{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCjXB7nX8bL2U2sje8d212Yw",
            "title": "Top chat replay",
            "publishDate": "2020-11-10",
            "shortDescription": "",
            "lengthSeconds": "1:56:30"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "GdsMKlhy-0w",
            "fillerWordCount": {
                "uh": 394,
                "um": 420
            },
            "readTimeFullTranscript": "74 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "app": 212,
                "contact": 74,
                "data": 60,
                "privacy": 54,
                "apps": 46,
                "exposure": 43,
                "information": 41,
                "phone": 37,
                "health": 35,
                "code": 29
            },
            "wordCountSummary": {
                "app": 26,
                "contact": 25,
                "data": 14,
                "privacy": 13,
                "apps": 12,
                "state": 12,
                "health": 9,
                "information": 9,
                "technology": 5,
                "case": 5
            },
            "fullTranscript": "Hey so well should we start at six you're, muted, it's six I did not know. If you wanted to wait on Russell, oh he's not on yeah. We should wait for us we'll give him one minute, because I know we're really pressed for time and I just got an email from him so he's around. He has not connected his audio. Yet, okay, there, you go okay, good, it's nice to be the person. It all depends on welcome to Community Board eight's fourth program on contact racing. I'm Elita, Camp, chair of Cba Good Evening, New York state, released an app. This fall for smartphones to enhance contact, tracing efforts. The this evening's program focuses on the new app and includes technology, privacy and purpose we're lucky to have a with us, Dr Ted long, the executive director of the Covid-19 test and Trace Corp of New York City's health and hospitals, Albert foxconn, the founder and executive director of the surveillance technology oversight, project, a privacy and civil rights, not nonprofit, housed at the Urban Justice Center, and he's also a fellow at Nyu Law, School's, Engelberg Center, and we have with us as well. Kevin Sheldon Lead project manager of the Covid-19 Alert New York, App Release. He was also been managing health care, ip and data projects for six years. I'm pleased to introduce Rebecca, Dangor Co-chair of Cba's health seniors and Social Services Committee and Russell Squire co-chair of Cba's environment and sanitation committee. Who will moderate this discussion I'll now turn it over to Russell and rebecca, and thank you all for being here right and with that we're going to turn it over to Dr. Long, since we only have him for a short period of great well. Thank you all for giving me a few minutes of your time tonight. What I'm going to do is walk through a couple of slides that represent our approach in New York City to using the New York State Covid-19 App, I'm going to leave time for questions and I'm going to leave some time for conversation with Albert who I can see here for the first time on the webex Hi Albert. So if we can bring up my slides here, I promise to go through at a brisk pace. Yes, give me one. Second, sorry, as you're pulling them up, I want to make one point going into this, and that is that we have built a very robust contact tracing system for New York City. We have nearly 4,000 contact, tracers more than half from our hardest hit communities and now we're reaching 91 of every single new case across New York City, completing interviews with nearly 80 percent of them, and we confirm on a daily basis that 98 are isolating meaning not going out there and risking infecting other new yorkers. Our contact tracing system has evolved since we started it, but right now it is very strong and it's actually by the metrics that we have the strongest it's ever been, despite the fact that we're in the most challenged state we've been in since last April and that's all doing contact tracing by having people call you people knock on your door. People from your community that live through the same thing that you did last March and April to people that you are more likely to trust. We view the app as an enhancement on top of a very strong basis that we've built, and that will be one of the themes about how I talk about this today and in some of the comments that I think albert and I will have after this. So dive right in this is just a background on the Covid-19 alert New York app, so we can go to the so here's just a little bit of background. This is an app developed by New York for New York that is rolled out now. All new yorkers are encouraged to download the app it's a proximity, app meaning it detects people within proximity of your cell phone, that's using the app and then what happens is when lab confirmed cases or people that, with the coronavirus are enrolled into trace, the app can also be will be offered a validation code to input into the app. When that happens, contact will be identified if they've been in proximity of the case, with a cell phone with the app downloaded please. So this is what it looks like if you wish to download the app. These are the onboarding screens. You get started, you enable notifications and then you're done in five steps simple as that please, so the way the app works is again. It's a you. Have a notification center, that's based on proximity. This is not an app there's! No GPS to you, know tracking, where you're moving or anything like that, it's purely a proximity, so you could think of it. As your phone has a six foot ring around you around your phone. If anybody comes into that ring for a period of 10 minutes or more, then that person is designated as a close contact if you're diagnosed with the coronavirus, and if you choose to push out to anybody that meets that criterion that you have been diagnosed with the coronavirus, then on the phone you'll see here in the middle of the slide, the app has detected that on X8 somebody has tested positive for coronavirus again being within six feet of you, so think of the ring around yourself with your cell phone for a period of more than 10 minutes, please! So that's at a high level how the app works I wanted to go through quickly, because I wanted to answer. Questions and I wanted to to turn it over to albert, while I'm on the phone or the webex here, so that we could have a little bit of a discussion here, but just to really make the point again. We in New York City, have had one of the strongest control rates of the coronavirus we've driven. We drove down the number of new cases every day since we started doing contact tracing by two-thirds across New York City. We kept it there for longer than most other cities in the country. We did that because we developed a trusted way of engaging new yorkers. That's really been buying new yorkers for new yorkers, with the 4,000 contact tracers that we've hired the app is an enhancement. On top of that, we encourage everybody to download it and we've Incorp. We are incorporating it into our contact tracing program. This will only strengthen our ability to do further contact tracing, but I wanted to make the point very clearly that we have a system that this is built on top of it's a strong system and it's really prevented coronavirus from really taking hold of New York City for the past several months. So I may actually turn it to our facilities. Facilitators here to direct me about whether we want to do questions now or whether we want to turn it over to albert some comments, and then we can have a discussion. I think. Maybe let's turn it into a little bit of a discussion before questions about the efficacy and privacy concerns regarding doing contact tracing through a digital app, instead of as it's been done previously. So Albert is unmuted happy to respond to some of those points, and one thing I want to emphasize at the start of my comments is that you know, as a privacy lawyer as a technologist, I, think there's a big distinction to be made between contact tracing apps such as the Covid-19 alert, New, York App and existing public health measures that we've had for decades. Like manual contact racing, those are the systems that we've really invested in here in New York, and we at the surveillance technology oversight. Project are quite concerned that this app is both a distraction from those evidence-based measures and that it is unable to live up to the promises of efficacy and privacy that have been promised. You know, while it is true that this uses bluetooth proximity rather than GPS location, tracking or some of the more invasive technologies that have been considered for other exposure notification, apps GPS pro sorry, bluetooth, proximity data can be mapped onto specific locations at specific times when paired with stationary g bluetooth beacons. The low-tech way to think about this would be someone simply duct taping, a cell phone to outside someone's apartment doors or in the elevator Bank or someplace, where they're likely to be for an extended period of time. You can use that to then re-identify that proximity data and extrapolate someone's I d, but the more important issue from our perspective is the fact that a lot of the communities that have been harsh by Covid-19 do not have access to the smart. The latest generation smartphones that are needed to run the software. You know, according to the modeling from Oxford University, you need about 60 of the community opting into this sort of system for it to be effective, and yet we know that about half of senior citizens do not have access to any smartphone, let alone the latest generation smartphone. That's able to run this sort of software. Additionally, we know that lower income individuals are less likely to have that sort of device, and so we worry that it will expand health inequality that this sort of app will give us a misunderstanding of where Covid-19 is spreading in our community, because it does not have that community focused approach that we've seen with manual contact raising because it and those blind spots we think, can be very dangerous. And lastly, before we pivot to the Q&A, I want to highlight the fact that there's no legal protection against having contact tracing data given over to police or even immigration officials. We worked with a number of community-based groups to pass legislation this summer. That would require that sorry would not even allow police access to contact tracing data with a warrant, but currently they can get that information with a warrant or even a subpoena a much lower standard and that legislation, even though it was passed by the assembly in the state Senate, it still has not been signed into law by governor Cuomo, and so today there simply is no protection against that information being misused, and when we're talking about contact tracing data, it is such intimate data and trust is so indispensable to having the effective response. So there's a lot to unpack there and not a lot to discuss so I'll just pause there. I just want to well sorry go ahead, Rebecca, oh no! You take it. I will say just for all of the members of the public here. Cb8 did pass three resolutions in support of that bill several months ago, and so that should just be noted, good well, so I think the you know. The focus of this first part of the discussion here before Dr. Long has to go. I think is going to be on sort of how the app fits into the tracing more generally and then I think we're going to get more into some of the sort of technical aspects of it, including the efficacy and the privacy stuff a little later on, but I would just say that you know Kevin Sheldon. If you have comments in response to some of the things also, you know even in this first part, if you want to weigh in here, please feel free, but so just going back to Dr. Long I think one of the kind of basic questions that I think would be helpful for folks to hear about is just you know, as people are using the app, if you could just sort of walk people through kind of step by step, what happens if there's a you know if there is a sort of positive and kind of how that happens through the app how people get traced and how that sort of differs, or you know, interacts with the kind of tracing that goes on manually and what overlaps there are. That kind of thing yeah actually to make the points I want to make here. I'm going to answer your question in terms of how the system works, but intentionally not go into all the details, I'll defer to to Kevin if he wants to go into more details, because the point I want to make is this everything that we're doing with I'll use Albert's words here manual contact tracing, none of that changes with the app, not a single thing, we're doing all the contact racing that we've done since June. That has given us that has drove drive, drove down the number of new cases every day by two-thirds of New York City kept us there by for four months, everything that made us successful. There is not changing with the app the app is not intended. What will not replace anything? We've done. That said, we do encourage people to consider signing up for the app. It is an enhancement on top of the contact tracing that we do, but I'll give a concrete example and then I'll turn to Kevin. If you want to go into more detail, let's say you're a case. Let's say you have the app you're still going to get a call from one of my tracers they're still going to ask you for who your close contacts are they're, going to use the same definition, they're still going to talk to you about what it is to be a case. They're still going to talk to you about all the resources we can offer you free food delivery, free hotel stay. We even have a free service to walk your dog, for you know which is important, because you should not leave your home if you're a case. None of that changes with the app the app is something on top of all of that. So I just want to make that point really clear that it's not a decision between manual contact tracing and the app the considerations for the app exists on their own and actually I, know Kevin. If you want to talk a little bit more about sort of pragmatically some of the details, yeah sure and thanks Dr. Long- and you know, I do have a slide that I can share with you. That actually has a really good example to try to explain how the app works, but the one thing that I'll add is there's actually no data connection between the app itself and the contact tracing system, so there's no exchange of data, there's no personally identifiable information that the app collects. The main purpose of the app is to really spread awareness, and you know, as Dr. Long mentioned it's not to replace any part of the contact tracing process. It's to enhance it. It's to supplement it by providing that awareness. You know, I use a good example of you know if you're standing in a long line with a bunch of people, for you know 10:15 minutes, you know maybe you're with your friend, but maybe you're. Also, you know standing in line with a bunch of people that you do not know right so like in a standard contact tracing process. You may be able to recall that you were standing in a long line and that you're with your friend, but you do not know the names of anybody else that you may have been standing in line with if all of those people had the app installed and if you do test positive, you will now be able to issue alerts to those other individuals that you otherwise may have not been or that you may not have done in the past. So let me just if I can I think I'm, oh, so I can share my screen at the slide contest. I think what we'll do is we're going to hold the presentations I. Think Kevin, you and albert both have presentations. I think we're going to hold those to the second segment here. Okay, no problem, and so let me just ask another question of Dr. Long here and then we'll turn it over to questions from the public and the board members. So I'm just curious I guess: have you seen changes in participation and contact tracing since the app has been introduced? Have there been kind of shifts in you know the rate of participation or what kinds of changes have any of you seen? That's a great question. I can't say that we've seen any concrete changes either way with the app, but that's sort of would be expected, given that the app is intended to be an enhancement on top of our contact tracing. To give you a quick sort of data trajectory point here, we look at metrics in terms of our content. Tracing performance like are we able to reach people? Are we able to complete interviews with them and let them and they get contacts from them? Are we able to confirm that they're isolating and actually, every week, that's gone by this week? The last couple weeks, in particular our program, metrics, are the best they've ever been so certainly would not say that the app has caused people to not participate just based on that, because our program metrics are getting better and better on a pretty even trajectory, but I can't comment on any specific effects that I think the app has caused either way in terms of program effectiveness. I do not care if you want to add anything to that. All right looks like I got muted there yeah. So you know we're. We've been in several discussions too, with with apple and Google, who you know are responsible for developing the underlying technology that this app uses, and you know the we from a New York state perspective. You know we are approaching a million downloads right, but you know the one thing in regards to the efficacy. In the you know, just general effectiveness of the app is you know you have to have those interactions you have to have. You know I. Think Dr. Long was referring to that six foot circle. You have to have enough of those interactions to where you know these positive individuals have to have the app and you know other individuals that they were in close contact with also have to have the app so that they can get those types of alerts, and you know in certain cases, since the app is still fairly new, it's been up and running for about a month now you know we are starting to see more positive or more notifications. Go out, but you know really. The whole point is the longer that this goes the longer that those devices are capturing those interactions, those close proximity interactions- and that's really, you know when you start seeing you know more I want to say favorable numbers, you do not you. Obviously you do not want to have all these interactions, but you know I mean I. Think you understand where I'm getting at here is you have to have the data which is it's creeping in and you know numbers are improving day by day and what they are going to add to that is, you know, given the modeling we've seen where you're aiming for that 60 to 80 participation rate throughout a population, you know a million downloads is significant, but it's an order of magnitude less than what we would need for the app to actually live up to its stated purpose, simply because the vast majority of Covid-19 transmission will take place in instances where you do not have both people using the app and also while we've also wanted to caution that we should not assume that a million downloads equals a million users. Since people will download the app not consistently use it and one individual might download the app onto multiple devices in multiple accounts, all right. So let's go to questions here, yeah, so we're going to go to elita and I would just remind other folks who are going to have questions that I would suggest saving the more technical or privacy related questions for later in the program and Elita go ahead and ask away thanks russell. So this question is primarily for Dr. Long, but also for Kevin or Albert, and I've read recently that there is new thinking that it's not 15, minutes or 10 minutes at one time. It's really 15 minutes over the course of the day and whether the contact tracing either the manual kind or the app recognizes that and is able to keep track of multiple I guess potential transmissions or connects over a day and also, if it's possible to track. Is there an overlap in communities that the app is serving or is it that the manual transmission were the manual tracing works better in one set of communities and the app works better in different ones? If there's a difference between Urban New, York and Rural, New York, or between different boroughs and different communities, neighborhoods in the city, thank you. This is ted I'll, start off there and then I'll turn to Kevin and albert. If he wants to weigh in on some of the technical considerations for what the app can or could not do, but I first want to commend you elita you're, on the cutting edge of research. So I'm not but I read about it. No perfect question. So to give the backdrop to this, the CDC recently completed an evaluation about the question of whether it is a cumulative amount of time that puts you at risk for contracting the virus or whether it can be different sort of chunks of time over Let's, say a one day period and that their conclusion was that, yes, it looks like in their evaluation that it could be. What's the correct word, the aggregated amount of time over that over that one day period. So what we're doing here, which is our standard process for doing things like this, is we're reviewing all the primary evidence ourselves and we're going to make any changes that we feel are indicated based on the totality of the evidence and that's our current process right now, which is our tried and true process. We have one of the best, if not the best Department of Health's in the entire world, so you can count on us coming out soon with our evaluation of that, but so you're very much on the cutting edge of that. What will happen, then, is if we do need to make any changes based on our evaluation of the evidence, we will do that with our manual contact tracing. The next question will be, and this I defer to Kevin on in terms of if New York state additionally because they manage the app is going to make any similar changes after they've completed their evaluation, whether the app could do that could have that sort of function, yeah. So from an app perspective, the app is actually already doing something like that. So there is some type of cumulative component. The and I'll just say this is the the code, the underlying technology, the exposure notification services developed by Apple and Google. It is open source code. You there actually is a lot of reference material out there in regards to the proximity criteria and risk scoring is what they call it. So if you do come into contact, you know with multiple positive individuals for smaller increments within a 24-hour period. You know the app will acknowledge that and still you would still be eligible to receive alerts based off of those interactions as I think there was a question about. You know different regions with the app or you know other users using it more. The that type of data is very challenging to well, first of all, to collect because we're the that would actually compromise the you know the anonymity of the app in regards to it being those anonymous transactions with others and with the server. You know we do not collect any sort of personally identifiable information, so we can't determine if one user group is using it or you know, if another is not using it appropriately. You know the app does collect some very basic symptom data, and that is you know, an optional component within the app and demographics there's some a handful of demographic fields that are collected, but as in terms of the exposures, you know we based on the data that's collected. We can not link it to any particular demographic region. You know gender, ethnicity, etc, and that's kind of that as I mentioned, would compromise the anonymous component of it, and one thing I want to add: is that with any of these metrics we're looking at sort of a generalization of exposure risk and none of it's ever going to be a perfect a way of capturing when any specific individual is transmitting a Covid-19 or not, because you know there are so many other forms of context that come into play. You know the viral load that someone is transmitting the ventilation of the space that people are in the whether or not they're wearing mass I mean, and so that you know. One thing that we keep in mind with you know when we're discussing maps in particular. Is that simply having a distance and a time frame does not give you necessarily a consistent prediction of whether that individual, in that specific case, was able to transmit the virus? Okay, well, I see it is 625 I mean there's one more question: can we barbara is there? Can we have time for a quick question here? I actually had three I was going to ask Dr. Long and I'll. Ask that first, the mechanics of what happens. So if I'm positive I have to physically click my phone to say I'm positive, it does not automatically happen. Is that correct and part two, then people will get alerts, do they if it's manual, you call them and say you have been. You were in proximity with somebody and do you need any help, and all of that does can we? How does mechanics go through this? Do we call somebody to say I need my dog walked or I need to somehow separate from my family yeah great question so I'll take the first part then I apologize I do have to unfortunately, I understand yeah just do your best. It's been great, I, always love spending time with you guys, cba best and barbara. It's always a pleasure as well and I loved you this morning, although you got me nervous this morning, yeah well yeah more on that later, so I'll start here and then again, I just want to say thank you for your time, everybody on the line today. So what two important points? One? If you are a positive case? Yes, you do have to push out the notification to contact. It's not an automatic thing. Good point number two, and if you, my slides sort of like, is buried into the side of one of them, but we actually have included for app users in New. York City are Covid-19 hotline, which is 212 Covid-19. That's the number that anybody can call that we can. We can help you in a variety of ways, including pairing you with a resource, a live resource navigator that can get you all the services that I alluded to, ranging from food delivery. Free hotel stay we'll pick you up for free drop you off there for free, give you free pajamas right, that's the part exactly so all that exists that you can access through the hotline that we've made in the app to make it accessible for everybody. So great question, and with that, thank you, everybody have a great night. Thank you thanks for answering that one questions for the other gentlemen and thank you, Dr. Long, okay, so barbara I think before we get to the questions for for Kevin and Albert, they both have presentations and so now I think we're shifting to more of the kind of technical discussion and privacy discussion, but so we'll just let them do their presentations in turn and then we'll open it up to to more questions for them and a discussion with that. So Kevin. Let's start with you, because you you know, you can tell us about the app that you've developed, sure and share my screen here, and some of this maybe overlap with Dr Lone's presentation. But that's okay. I'll try to skip some of those components or just repeat the most relevant content here. So all right, you still see my screen yeah and just very briefly before you start I just want to remind folks that if they have other questions for Dr. Long that we did not get to, we had to leave early. But if you just chat them to will, we will pass them on to him later and circulate those responses. The other thing is in terms of asking questions as I think we heard at the beginning here you know if you're using your computer, you can go to the participants menu to raise your hand and we'll see that and then we'll go through and unmute you to ask your question: if you're on the phone press star 9 to raise your hand and then we'll get to you as well, so go ahead, Kevin great all right! So again, some of this might be repetitive, but I'll try to get through this content as quickly as possible, so Covid-19 alert New York is a voluntary, anonymous exposure notification. Smartphone app! So you'll hear that term exposure notification a lot, so the app keeps track of when you know, obviously, as Dr. Long mentioned. If you are close to other app enabled smart phones and it uses bluetooth, low end low energy technology and it will send you an alert if you were with in close contact with someone who test positive for Covid-19. I did mention it a couple minutes ago. There's also a couple of other really cool features within the app on a day-to-day basis. You can track if you have any symptoms and we also call- or we look to the public New York state testing data, to where you can see the positive case, data and any testing trends, and you can actually view that on a county breakdown level as well and all of the app activity is completely anonymous. So this is an anonymous app. The app does not reveal who you are to anyone and subsequently it does not reveal anybody to you and I do apologize. That's my dog who tends to bark during the worst time. So how does this really work? So the app uses, what we call exposure notification service, which is developed by apple and Google? It did highlight this before it is open source code. You know if anybody needs the the link to where that code is stored. You know we can definitely share that with you, so the app uses bluetooth technology to sense when another person, with the same app comes within six feet for 10 minutes or more. There is a cumulative component as I did mention, but when this transaction occurs, the phones are going to exchange what we call a secure random code with each other to record that they were near. You do not know that this exchange is happening. They are random, alphanumeric codes. They actually do also change every 10 minutes and again, if you meet those proximity requirements, you will exchange those codes with one another. So, what's going to happen, is when someone tests positive for Covid-19 a case investigator or a contact tracer from their the local health department, will ask if the person is willing to share that the apps list of what we call closed contact code. So this is that that consent process, if you will to where the positive individual actually has to you, know, conduct a or go through the app and enter a code to share those codes. Sharing this list is completely secure and private. It does not indicate if you test positive for Covid-19. It does not indicate to any other app user that you were the one who tested positive and what's going to happen, is you know if you were in close contact with someone who shares those codes within the app you'll, receive an alert on your phone with the date of the contact, as well as specific guidance and recommendations? I think Dr. Long alluded to earlier in regards to, for example, contacting your healthcare provider contact the either the New York City test and trace hotline, or the New York state hotline for non-New York City residents is also included there. If you want information about what the alert means you know what next steps to take and things like that, so I think what may help people is I'll try to walk through a very basic example. Okay, so on the left-hand side of the screen, let's say three individuals, Joe Meg and Lisa- are on a bus for a 30 minute ride and all of them are sitting in the same row of seats and you know which means that they're all let's say within six feet of one another and let's say all three of them: have the app installed on their phone I did mention the codes on their phones are random, but for the purpose of this example, let's just say with this interaction: Joe has code, one meg has code two and Lisa has code three. So with this interaction, Joe's phone's actually going to log codes, two and three on his phone meg's going to log codes, one and three and Lisa is going to log codes, one and two. So then they're going to go about the rest of their day. They do not know the exchanges going on and then let's say, if you look at the middle of the screen there three days later, Joe Test positive for Cova 19. so he's contacted by a local health department or a contact tracer and now as a part of the process, they're going to ask if Joe has the app on his phone and if so, if he's willing to share those close contact codes within the app. So what's going to happen is within the contact tracing system, it will generate a six digit one-time pin number that the individual that, in this case, Joe, will enter on his phone and he will consent to sharing those close contact codes and, what's going to happen with this, is that code 1, which was on Joe's phone and any other codes that were randomly generated. They're now going to be flagged on the server as positive and notice. How I said code one it's not we're, not sending any of Joe's personally identifiable information. The app does not collect that such as name date of birth phone number. It's just the code itself is now going to be flagged on the server as positive, so meg and lisa their Covid-19 alert. New York apps are periodically checking that server to see if any of the codes stored on their phone match any of the. What we call positive codes so based on that interaction on the bus, Meg and Lisa both have code one on their phone and it matte that the app will match that positive code, one on the server so once that match occurs, Meg and Lisa are going to receive what we call an exposure alert on their phone. It's going to, as I mentioned, it's going to indicate the date of the interaction and indicate that they were within six feet of a Covid-19, positive individual for 10 minutes or more and provides a series of next steps and recommendations, such as to schedule a Covid-19 test. You know call the appropriate hotline based on where you reside or where you're located, and you know again, it's a it's a supplement to the contact tracing process and that alert provides them with that guidance to take the appropriate next steps. So I think we touched on how this app enhances the contact tracing process. Just a couple of other common questions that we see is you know, does this track your location that the app does not use location services whatsoever, the exposure notification technology uses bluetooth to exchange those secure, random keys and that's it? The server does not store again any personally ident identifiable information, even including a device's ip address it does not. Even it does not even store that it just uses bluetooth to exchange those keys and flags based on those positive transactions to flag some of them as positive, which is the core component. That issues the alerts and does it work outside of New York? You know, we've had some people that say hey you know: I live in New York, but I work in New Jersey. Does the Covid-19 Alert, App or Covid-19 Alert New York app work in those states, so there's several states that have their own apps, but they use the same underlying technology and actually the same type of server to generate and issue those positive keys. So Covid-19 Alert New York actually works across several state lines without having to go and download the individual app from that state and more states are now looking develop. Similar apps, apple and Google are also looking into developing. You know, kind of their native app and based on you know the server that's used that the server was developed by the Association of Public health laboratories, and you know the app will work across several state lines. I did include the link to the the state website has a lot of helpful information. It also has a comprehensive privacy policy. The website explains what type of data is collected, how it's used. You know what is shared and, what's not- and you know I think we've meant mentioned it before you know- go download the app you know the app was launched. Beginning of October governor Cuomo announced it on one of his press conferences. We do have we're approaching a million downloads, but in addition to downloads you know we do also attract. You know the number of users that have actually enabled exposure notifications. You know, and we do get thousands of new users every day the number of alerts that are being issued. Those are increasing based off of you, know, more individuals actually downloading and using the app appropriately you can get the app from the the Apple app store or the Google play store. It works on. You know a number of apple and android devices and again the link to the state website is at the bottom of this. In the event that this is shared, but we can, we can send that to you guys as well. So that's really the bulk of my presentation. I can turn it back to the host or moderator to see. If we want to do questions now or continue with, you know the additional information thanks yeah, so I think what we'll do next is we'll just we'll. Let's have Albert, give his presentation and then I think we'll open it up for some more discussion and questions that both of you will weigh in on wonderful. Can you see my presentation? Yes great? Well, thank you again for the opportunity to talk to you today about exposure notification, apps and let me begin by just recognizing the scale of what we've lost. You know we're dealing with a pandemic of truly historic proportions. Hundreds of thousands of people dead. You know, we've seen our daily life forever changed when we're all constantly in this zoom liminal space and as a professional privacy advocate. If I thought this app were going to protect me or my family or get us back to life, as usual, I would say: let's do it. I do not care about the privacy impact, but sadly I do not believe. That is what we will see with this application and I do not think that's the choice for being offered instead we're being presented with an unprecedented data threat because, yes, bluetooth. The way this app has been put together. It is not collecting as much data as some other exposure notification systems, but the end. The data it's providing, while De-identified stripped of our names, is not completely secure from being re-identified, with with our names with our identity and becoming yet another piece of data. In this mosaic, that's being collected on us constantly I think that this is particularly of concern for our undocumented neighbors, who are constantly being targeted by immigration and customs enforcement, using firms like palantir to aggregate seemingly innocuous pieces of data to build out an ever more sophisticated and granular portrait of our lives and as I as I hit on earlier. There is no privacy law here to protect this information from being acquired under federal law. Hipaa police can get this information with simply a subpoena, not even a warrant they. Basically as long as it's not an undue burden, they can petition for this information to be provided and there's and similarly they can not use a warrant to collect information about from these apps. So while it's helpful to have encryption as part of that map, encryption on its own is not a solution here, not when we've seen seemingly anonymous data being used by law enforcement and ice so many times in the past and with state laws. As we touched on earlier, there is a dearth of protections here in New York on the state level, and we once again renew our call on governor Cuomo to sign into law protections against having this information misused by police and I would say if the app is truly as secure as we're being told. If there is so little data being collected, then what conceivable downside is there to having a clear state law that says that this information can never be used by police can never be handed over to ice, and we continue to see the governor turn Covid-19 from a public health issue into a policing issue, much to the detriment of our response. Now, we've already heard a lot about the realities of contact, tracing and the mechanics, but for individuals who have potentially exposed folks who are undocumented or who have criminal justice exposure or who may have been exposed at a sensitive site, such as a house of worship. They face an impossible choice. Do they provide information as part of the contact tracing process to help combat this historic pandemic, or do they risk potentially putting their loved ones in harm's way, and that is why we need to make sure that we have these protections against misuse and abuse since we've covered. So much of this already in the earlier talk, let me just skip forward to one of my main warnings. We have to be skeptical of the claims that are being made by the tech giants who are coming in offering to solve this pandemic. The truth is that we've been down this road before, with with firms that claim that they had a technical solution to these sorts of dilemmas. Organizations like Theranos come to mind that have made really just unsubstantiated claims about the efficacy of how their systems can help solve public health dilemmas, and here the evidence just is not there that these apps are going to work, and they certainly is no evidence that they will be trusted by the new Yorkers, most at risk of dying from Covid-19. I'll skip through some of the other technologies that have been used and focus on bluetooth, because bluetooth is the heart of this app. It is what is used as a way to measure our the distance between devices between individuals, and it is not a technology that was designed for that. It was designed to transfer data to help us connect our wireless accessories and there's so many things that can change the perceived distance of Bluetooth-enabled devices. If you have your phone in your hand or in your pocket or in your purse, it can be perceived as being a different distance away because of potential interference with the signal from the phone different models of phone different battery levels, different operating systems. These can all skew the perceived distance of a desi device and, crucially, they do not capture any of the context that helps evaluate potential exposure. Whether people were indoors or out whether they had masks on or not whether they, you know any of those facts that a human being could could find during a manual contact tracing interview, which is why we think it is so important for the city to continue to focus its resources on those human interviews on those phone calls on that outreach that Dr. Long was describing and not the high-tech solution. You know we we've seen we've seen this model tried around the world. We've seen bluetooth exposure notification systems tried in Singapore only. They then see one of the worst spikes in Southeast Asia we've seen multiple countries try similar methodologies only to have lackluster success or no success at all and there's just nothing to show the a real path forward to get from. You know where we are today with approximately five percent of new Yorkers, using the application to where we would need to get for that application to be effective. Now only 80 of Americans have smartphones and by in some areas it's even less, and so, when we're looking at the maximum percentage of new yorkers that could actually be using this app. We already, we would need practically everyone who already has a smartphone to use it, but then we also know that many smartphones do not. They are not new enough. They are not able to actually run the exposure notifications system. They are not able to run Covid-19 alert, New York because they do not have the latest operating system. They are not able to support that application, so we simply do not. Even if we had public will to do this, we would we would. We would not really have the smartphone user base to do it and then there's the issue that when we've seen these apps rolled out in other countries, we we've seen just so many individuals who are just were blocked by these technical limit limitations. 2 billion of the 3.5 billion smartphones on the planet can not run the exposure notification system. They can not run the New York's Covid-19, Alert App and where we've seen you know really the public forced to use similar systems abroad, such as when Israel used its domestic security service to monitor potential Sp Covid-19 exposure using smartphone data. There were so many false positives. There were so many false alarms that people started putting their cell phones onto airplane mode started. Taking the Sim cards out started, doing whatever they could to avoid being tracked, not because they did not fear the virus, but because there was so many false alarms when they never had really been exposed. We have to listen to communities, we have to listen to communities of color and immigrant communities. We have to listen to the community's hardest hit by this virus and you know, according to the Brookings Institute two-thirds of black Americans do not trust this sort of app and according to Washington, Post 20, say of Americans say they definitely would not actually use this app, and so what we recommend is to simply reinvest in the things we know that work, access to testing manual, contact, tracing like the program Dr. Long overseas neighbors, reaching out to neighbors, using evidence-based measures and, of course, enacting privacy laws to make sure that every New, Yorker's health data and contact tracing data is protected. Thank you, so I think we're going to get the get into more discussion about a lot of these points through the questions that we have, but Kevin I just want to give you a chance. If you wanted to respond to some of the points or if there were certain specific things that you wanted to address before we go to some more questions here. Sure I mean you know, I did mention it before you know the app is not connected to you know or does not transfer any data. You know to and from the contact tracing system, so any data entered or any information entered within the app is stored on an individual's phone. You know the communication with the server is based off of that very basic interaction of if somebody tests positive to flag those codes as positive- and you know other individuals, apps look for those positive code matches to issue the alert you know the app is again there's no login credentials to the app you know you do not have to put your name. You know that the app is downloadable from the app store and Google play store and that all falls within you know the privacy policies within apple and Google. If you were to download any other app right, so you know I, there are definitely some. You know certain points that were made, but again that the app does you know try to the or the app does ensure the anonymous ensure that things are anonymous and those interactions. You know your that your privacy is protected. You know, I will comment on the one in regards to the alert fatigue. There are options within the app to where you can turn off notifications right. You can still, you can still navigate through or the app can still do. What it's supposed to do. You do not have to get alerted. You can go into the app whenever you choose to see if you have any alerts. So there are certain things that the app can do to kind of alleviate some of those concerns. But again you know we can ensure that the app does not use location services. Some people are still going to think that attracts your location right. So you know it is a matter of you know, making sure that the app features and components are understood, and we definitely recommend visiting the website visiting the privacy policy to to really assure you how privacy is protected, and you know how you can use this app effectively. Okay, so let me ask a couple of questions just to lay the kind of groundwork here, a little more and then we'll open it up to questions from the public and the board. So one question that we had from in advance is: do the codes change over time or does everybody always have the same code? You know forever. That's a question for I, think Kevin in the first instance and albert. If you want to you, know address it, you can also but I think that's yeah. So the codes do change every 10 minutes. So you know, what's going to happen, is your phone actually stores the the exposure notification data for up to 14 days? Anything beyond that is automatically removed the so what's going to happen, is you know, let's say over you know an hour span. You generate six different codes. You may, if you're within six feet of one individual or within an if you're, within six feet from an individual for ten minutes or more, you may exchange one code with that person and if you're you know, if you have another interaction with another, you may exchange a different code. But what's going to happen is when you do test pause or if you were to test positive for Covid-19 and initiate that transaction? Any codes that were generated by your app are now going to be flagged on the server as positive. So it's not one code per person. They do change every 10 minutes and based off of the number of codes that are stored within an individual's device. All of those codes are flagged as positive and the look back period is based off of you know. It's the rule of thumb is two days prior to symptom onset, which is collected all the way up through the date of entry of the code up to 14 days, and that's really the window in which somebody could receive an alert okay. So, in your example in the your slides code, one really is a group of codes. Really that's correct. Yeah I just tried to simplify it just for the purposes of explaining the technology, but yes, it is going to be multiple codes. Okay, all right! Let me ask one other question here before we go to everybody else, which is I'm just wondering if you can talk a little bit more about the health tracking feature, because you know I think we've mostly been hearing about the contact tracing component and how the codes work and that kind of stuff- and it seems to me that the cut the health tracking stuff is, it would just be helpful to get a little more information on it. In particular, I think that's an area where I guess folks are potentially putting in more information about themselves and and that kind of thing, so I'm wondering if you can just sort of explain a little bit more how it works, how it interacts or does not with the contact tracing feature. That's the bluetooth component and I think that's going to be. Ultimately something I'll ask both of you to weigh in on. But why do not you go first sure so, yeah there is a feature within the app called my health log. It's completely optional feature you do not have to use it. There is a very small number of demographic fields that are collected, but you also, you also do not even have to enter those to use it, and the purpose is just to track how you're feeling, on a day-to-day basis, all the way from feeling. Well today, to you know that there's a list of symptoms, Rel, representative of Covid-19, you can enter one or more of those symptoms and what's going to happen, is if you enter one or more of those symptoms, you know it will the app will present you with a screen very similar to if you were to receive a positive alert, but it's not indicative or an indication that you have Covid-19 or that it's not a formal diagnosis. It just provides you with some useful information such as hey, if you're not feeling well today, you know contact your health care provider or call the test and trace hotline. If you have general questions- or you know, visit our test site locator to schedule a Covid-19 test if you are concerned, but it's also a useful tool to you know if you are in con, if you're in conversation with you know like a case investigator or a contact tracer, and they ask they say hey: when did you first start experiencing symptoms right? In many cases, many people might have to go off the top of their heads and say: oh, you know it might have been a week ago versus if you're keeping track of your symptoms within the app you know, you'll have a not a detailed log, but just a very basic log of when you first started having symptoms and that could be useful information in providing that to a you know, contact tracer or case investigator. Thanks did you want to talk about that albert yeah, I mean we are not quite as concerned about that sort of functionality compared to the potential for the bluetooth functionality to be abused. I would say that you know this is something we've written about a bit with. You know local universities such as Nyu that have mandatory health screeners and some of the difficulties we've seen there just given the fact that you know such a high percentage of covent patients are asymptomatic and that you know we have not really seen a strong track record. That sort of data entry is a helpful way to prevent spread. That being said, it seems like an open question that has not been proved one way or the other, but that being said, we do want to make sure that we have protections against potential coercion, and you know this is something that's really been a theme throughout that we oftentimes hear a lot about the voluntariness of these apps and they can be. But you know what we've seen in you know. Some parts of the country is that people are told that if they do not take, if they do not install a university app, for example, or a local health department app that they won't be able to show up to school, they won't be able to keep their job. They won't be able to access certain facilities and, even if it says, I agree in the terms of service, there are not protections against the sort of coercion that could pro that could actually lead to some pretty alarming consequences. I'm not saying anyone actively wants that right now. What I do think is important, though, is that we actually put in the legal protection to make sure that all of these voluntary mechanisms truly remain. 100 percent voluntary all right! Well, let's open it up to the questions that we have. So we have another number of board members who have questions. So let's go aleta. You had asked a question previously, so I'm going to go to lori. First sorry, just to mute yourself, I'm sorry! Okay! Thank you very much. All of you for providing the information I downloaded the app and I'm happy that I did. But I am concerned about the efficacy, because if you have to self-report you yourself as a positive person, I think that someone who would be inclined to do that would not be the kind of person who would go out in public and being around other people. You know, because what you're going to do, if you test positive, is you're going to isolate yourself, so I'm a little bit confused about how we think this is actually going to work so I, let me just I mean as I understand it I think. The idea is that after you test pot, you'll test positive after having been in contact with a number of people and based on that it'll go back. Essentially, oh I see you're seeing contact with, and so it's not so much that you're out there and you know you're, positive and you're putting people at risk. It's that once you're, you know, there's likely to be a lag between when you find out you're positive and when you actually were- and so that's those folks who you interacted with before you found out that you were positive, are the ones that you now want to want to trace. Oh okay, all right! Thank you. Thank you for answering that that's good, but it seems to me that the money being spent on this, then would probably be better spent on just getting faster test results because, like I, there was a period of time where you know my father was in a nursing home or rehab center and I was going to the immediate tests. You know so you'd get like an immediate result in like four hours, and that was great, but it was. It was very hard to schedule it, and you know it was a bit of a pain, but so I think if we, if we had immediate results of testing, that would be better, but in any event thank you for answering my question. I'll feel a little bit better now, but you know I that that's what I think in terms of efficacy, that we should put our efforts into getting faster tests. You know I mean every day now when I go outside, there's a line around the block at city, Md I mean so people are getting the message that they should get tested. But you know I, think immediate results are the most effective way to make this happen. Okay! Well, let's get some reactions to that. I think let's go to Albert first this time and then we'll we'll go to Kevin. Okay, thank you sure, yeah! Well, first off I want to just agree the app the standard for contact tracing is 48 hours prior to the onset of symptoms, if you're symptomatic or prior to a positive test, and so the goal with these apps would be to go back. Look back to that 48 hour window. But still you know every time I go on social media. Every time I go on, you know, take talk, tic-tac-toe privacy, researcher, Facebook, I'm seeing ads for this app, and you know we do not have evidence that this app works. We have lots of reasons to believe that we'll never have the user base needed to make it effective, and yet we still see that here in New, York City the majority of tests take over 48 hours to return and I believe it's only about a quarter of them are coming back in 24 hours, which is the epidemiological gold standard. You know that's what we should be aiming for is to make sure everyone who goes out and gets tested gets that result back in 24 hours, and so in a world where we have limited resources where we have a historic budget crunch up in Albany and at city Hall. We should really be putting as much money and energy as possible into evidence-based measures into manual contact, tracing into support services and into making sure our testing is, you know as effective as possible. Kevin do you want to yeah? So the only thing that I'll just comment on from a technical perspective- and you know kind of Echo Alberta said it I mean the purpose of the app is that it does go back in time and searches for those previous interactions. There there's been questions of you know: does the app can the app tell or prove if somebody is violating like quarantine, instruction or orders or anything like that? The app does not. You know once that, once that sharing of closed contact codes has been completed, the app does not track the subsequent activity of those individuals. So you know we've answered some questions around that, but really again it's more to to spread awareness to you know, mainly you know, for the main objective is in regards to the people that you did not know. You came into close contact with right in public transit or you know, in an office building, etc. You know if you are in discussions with a case investigator a contact tracer, it's based off of you know what you know, but, and this app kind of goes beyond that and alerts others to that. You did not know. You were in close contact with you know, obviously assuming they have the app, but you know that that's that population's increasing every day, all right, rebecca, hi, okay, so I have a couple of questions. The first you kind of began to answer, but maybe you could go Albert- could go into a little bit more specifics on this, which is about the kind of fear that New York state implementation of this app encourages kind of schools and universities to use their own apps or even devices that actually use geolocation tracking services for their students, and the second question is kind of there's. This fear that some people have about like this orwellian existence where big brother is not just government, but it's also these large corporations that are harvesting our data. What message does kind of implementing this app without signing the contact, tracing confidentiality act? Kind of what does it make you think about the future of other privacy efforts unless legislation such as the New, York, Privacy, Act or even reverse search, reverse search warrant fans, okay, I. It makes me way too happy that you brought up a reverse search warrant, then because that's a bill, that's a passion of mine and I've been working on for over a year now and helped write and so I think that really we see a disconnect on the ground across New York and up in Albany, with the sentiment, lawmakers and the governor have on how to approach privacy, how to approach big tech and how to you know, treat them as part of our. You know essential infrastructure and I think really, when you're making these you know, giant tech companies an indispensable part of our health ecosystem and health and infrastructure. It's really asking and you're asking them to enforce the privacy protections you're, really having the fox guarding the hen house, I, think in terms of the privacy impact of other apps I mean we've seen. I want to be clear like while I do not believe that the New York App is privacy protective. There are a lot of apps that we see that are far worse, so we've seen private apps that use GPS data use, Wi-fi location data, use, sell site, telemetry use, facial recognition as part of Kiosks on campuses and those apps are completely inconsistent with any expectation of privacy and any sense of security for over police communities and immigrant communities on campus and so I. Do worry deeply about a broader normalization of this sort of mass tracking and well and I. Think that part of the issue is also just how we're approaching privacy guarantees in the Covid-19 alert. New York App Encryption is important. Encryption is very helpful as part of a secured design, but that is not a substitute for everything else that we need for this app to actually be secure for all new yorkers, and you know, while we're talking about the privacy promises, we have to also not oversell, because when there are a number of assumptions that are made by Google Apple when they're talking about the ability to re-identify someone with their code from the from their bluetooth transponder and there's so many instances that any of us can think of where that's simply not going to be privacy, preserving I mean. Let me give you a very simple one. You live in a remote area, there's only one person you saw the prior day and then you get the alert saying that's the day. You had an exposure event. Of course. In that case, it's not going to preserve the privacy of the person you're speaking to, but there's so many different edge cases like that, where you are able to re-identify the individuals with their bluetooth code, and there are a lot of other applications that we're quite concerned about yeah and I. Do not want to dismiss the fact that we are going through a pandemic that I could have never imagined and that I want us to be able to use anything that might help in any way, but I just think it seems especially disappointing to be in a time where you know subjects like the Digital divide, health, equity privacy, because we're all you know all these meetings are on. Zoom are at the forefront and I do think that maybe certain people's response to this app might have been different. If Cuomo had signed the bill that we've talked about before all right, we can go and Kevin did you want to touch on any of those items, or should we go to the next next question here, I think we can I. Think okay, I always just want to give both both folks a chance to weigh in understand so Alita. You have you have a question. I do I actually have several questions. So just stop me if I go on too long, I'm wondering if anyone understands what the governor's concerns are about the legislation, the privacy legislation and why he might not have signed it. Yet we we've reached out to the governor's office multiple times we've talked about it in the press, I've written multiple op-eds I. We have never received a coherent response and let's be clear, this was not a partisan dividing issue. This would I believe when it passed in the assembly in the Senate was unopposed. It was unanimous- and this is the sort of thing that should not be political. Public health should not be political. Having protections for all. New yorkers should not be political, and yet we continue to see these inexplicable delays. So if he signed the legislation, would you have a different approach to the app? Would you not that they're hiring you to endorse it, but would it be something that you would support I? Think I? Would sleep a bit easier at night, but I still do not believe it's effective, which I think gets back to my main critique because it I do not think we have I do not think bluetooth is reliable enough as a way to actually measure exposure. Events and I do not believe we have a user base large enough, that's actually going to buy into the app that we can hit the critical mass where it's going to be effective in preventing transmission or notifying people that they've been exposed. Well. That brings me to my I guess to another question, which is: how does it work? If someone is asymptomatic, then they're only getting tested at some? It could be much later point in a period of time and they're only getting tested, because let's say they want to go and spend a weekend with their friends who won't accept them without being tested. So it's just all. Coincidental is the look back period, those 14 days that I just do not know how it works at all, with all of that. With that issue of asymptomatic people who are just going in to get tested for the hell of it, I guess so Kevin correct me if I'm wrong, but my understanding is that the standard, regardless of the specifics for the patient, is 48 hours prior to either the onset of symptoms or the positive result, which means that you are going to have edge cases where someone has been spreading Covid-19 for an extended period of time, but it's not captured in that look back period, but at the same time you know it's, there's limited, there's less and less epidemiological value to capturing those exposures. The further back. You look because the greater the likelihood that people will be tested for other reasons that they'll become symptomatic themselves, and so it's really catching people early on that's most valuable right. Yeah I mean you know again. The app can only is only as good as the data that goes into it right. So you know we would not be able to catch those types of cases where you know if somebody was asymptomatic for a week or 10 days and then decided to get tested on a later date. It's just based off of that basic contact, tracing criteria and that's what we use for the app. Let me just add a quick follow-up. There is that there's a for manual contact tracing what we're calling manual. You know, there's essentially a look back period also and I do not actually I do not remember if it's the same period, but basically that's a problem. That's built into any contact racing, essentially you're, just going to have to you're going to have to have some kind of an arbitrary cut off, and you kind of make the best estimation that you can't. What that should be. Is that basically right well I mean- and this is why I think this highlights why testing and other factors are so important as part of any public health response and we've seen calls for the deployment of lower accuracy but much cheaper testing so that we could theoretically get to the point where every single american is taking a home test every single day, and it may not be as good as the pcr test you'll get in a laboratory but you're still able to catch those asymptomatic cases more quickly than when you have only people self-selecting into periodic testing the way we do right now, and so that that's something we may see support for at the federal level, all right and elite I know you had more more I do I. Thank you. This one is more for Kevin I guess well, I do know, does the app know and if I miss this I apologize Kevin, where you were when you had contact with someone, is that information that it somehow collects, even if it's not transmitted to anybody or it just so. Is it sorry, so that the when you do receive an alert it just indicates the day of the exposure? It does not indicate where you were exposed. The app does not use location services, for example like Google Maps right. It needs to know where you were located the app and again there's no communication with the contact tracing system of your general whereabouts, etc. So you know when you do get those alerts, it does not indicate where you were exposed. So if you have GPS on your phone, I use waze, there's no interaction between that and the app and I get those really annoying things like can. Waze have access to my contacts, which has no relevance at all to transportation. Right, so is it likely that they're going to start saying can waze have access? Where can this contact tracing app, have access to other information that may be of use not to New York state but to Google or apple, or if there are third-party apps I mean there's just all of that stuff that you do not know where it goes, and the privacy notifications are. I'm a lawyer and I think that they're hard to make out right so and I think Dr. Long had it on one of his slides, but you know through the very basic onboarding process. The app actually asks you for to allow for two things. One is the to enable the exposure notification service, which is built right within your operating system. So even if you do not have the app you actually have that core exposure notification service built in you know, depending upon your operating system, of course, for the phones that can support it, but you need the app to actually run it. So when you actually, when you download the app and you go through the onboarding process, that's the actual mechanism that turns that on so that's the one prompt, the other one is to enable just in-app or just app notifications to even if you do not enable it, you can still, as I mentioned before, go into the app see if you have any exposure alerts. But the app does not ask you if you for your contact information, it does not ask you to enable location services as if you know, for example, if you were to download Google maps, you'll get a prompt at the very the very first time to enable location services. The app this app does not do that and there's no other interaction with any other apps, and actually you know, there's other exposure notification apps out there. You can actually even only use one at the exposure notification services can only be enabled for one app at a time based on region. So you know it does not interact with any other apps if you were to have multiple ens apps on your phone, so you know it again. Just the two main ones are enabling that exposure notification service and if you choose to enable app notifications and that's it okay and I- do oh sorry, well I just wanted to quickly reiterate that you know what we do think there are security issues and privacy issues with this app. We want to give credit where credit is due and the app was designed to prevent. You know that you know a third-party app developer from being able to use that data. You know they created a new application programming interface, a new layer of the operating system, which allows for only the authorized health app to actually use that sort of bluetooth data. So it does create a firewall there, figuratively speaking, to prevent that data from being misused by other apps on your phone, where we see the vulnerability is with the Bluetooth Protocol itself, and that trans that constant pinging of codes between apps and the ability for third parties to abuse that, but we definitely there- we do not see any way that waze or anything else on your phone could capture that data. Let's let Rebecca ask another question leader before we go back to you for okay, fair enough. Thank you, okay. That, actually is the perfect segue into my question, which is this is not the only contact tracing app that we have access to in the city, there's one through citizen, which seems to be extremely alarming. So I guess my question is: maybe you could explain a little bit of the differences, because I do think there are some people who will choose to use the app regardless of any privacy concerns, and we want to help and make sure they're using the best app. There is another question for Albert right, both I, think, okay, I think Kevin and I will be in alignment on this one that you know I strongly. I am concerned about citizens effort. First of all, the idea that you're going to use a platform that has for so long been a tool of mass surveillance of communities of color that you know as your platform for that sort of public interest. Public health service seems completely wrong. To me, I mean the fact that you know citizen seems completely inappropriate as a vehicle for a public health service that we want all new yorkers, especially new yorkers of color and immigrant new yorkers to use, and so that that's one issue and the other issue is they use a must much less privacy protected protocol that creates much more of a risk of perpetual logging of location and ways that can create vulnerabilities and, as with the Covid-19 Alert New York App. There's no protection there against that data than being harvested by law enforcement by third parties, and my understanding is the terms of service for the citizen app do not. Actually. This may have changed since I last reviewed them, but at the time I reviewed them. There is nothing to prevent them from providing that information to law enforcement and and other third parties. So we were we've been quite concerned about the citizen app and we've been quite concerned about a number of these other apps, which again just are really do very little to protect privacy. Yeah I mean I. Can't really comment on. You know really any apps outside of Covid-19 alert, New York, you know from a technical perspective, as I mentioned. You know you can only have exposure notification service enabled for one app at a time, but the one thing that I did cover in my presentation is that other states are doing this as well. There are other apps out there, but you know Pennsylvania Delaware New Jersey, like they have very similar apps, very similar interface, and you know in many cases the Covid-19 Alert New, York App will work in those states without having to download others. You know my recommendation is to you know you know from a department health perspective. Is you know to download the cover, Alert, York, App and again I can't really get into the details on any other apps that are out there, and we know that there's others, but all of the privacy discussions and the features of all of this. You know that I can only comment on Covid-19 alert, New York so and I should note that we've seen a lot of variation state apps, like some of the earlier apps developed by I, believe it was North, Dakota and Utah used a mix of bluetooth and GPS. We've seen really a range of privacy impacts and design approaches throughout. So you know that I do think. It is important to note that you just because there's certain design protections built into the New York App, such as those prevention, those tools to prevent other apps on your phone from accessing the data that will not apply to many of the other apps out there, designed by other vendors, all right, I. Think, let's go to Elita, who got additional questions, is elite still connected? Maybe not all right! Well, we'll go back to Elita and let me ask some other questions here in the meantime. So I'm just wondering if we could get some clarity on you know who gets what I guess in terms of data, and specifically you know what, if anything are the you know, apple and Google? Are they able to sort of you know, get from use of the of the app you know what data? If any, is there going to be? Some kind of you know, I, guess that's really. The question is what data, if any, are they going to be able to get through this app as opposed to what the what the state is potentially getting and I guess? This is a question actually probably for Kevin in the first instance, and I'm sure Albert will have thoughts on it. Also yeah so I mean it's my understanding that you know apple and Google. Have you know the data that they collect through their app store mechanisms, right, number of downloads, deletions retention, etc? The data that the Department of Health gets from the app is all in its aggregate form. You know such as number of registrations when I say registrations like the individuals who not only download it but also enable the exposure notification services. You know we could see. The number of you know, exposure alerts that are generated again. You can't tell who it is or where they were generated. We just kind of get that overall aggregate number, but that's information that the Department of Health gets and that's actually information. That's included on our privacy policy and I believe that link was provided in the chat. Some of those very key data elements that we get in its aggregate form and then in regards to the symptom data, that's logged in my health blog again, we do not. We can not tie that to any individual. We just get, for example, the number of people, let's say on a given date that may have recorded that they had a fever or if they were feeling well and the one thing that I'll just mention I do not know. I do not know if I mentioned this before the my health log data, the symptom data that's collected, that data can not be tied to the exposure alerts in any way. So, for example, if 10 exposure alerts were generated, you know on let's say today: the Department of Health can't see that out of those 10, you know five of those people were within this county or five of those people experienced a cough on x date. Those two data sets are completely separated and there's no possible connection point between the two, so I just want to make sure that was understood, but yeah the data is that's collected is all in aggregate form, it's non-identifiable to any app user, and then you know the information that Apple and Google gets it's based off of the data that is collected as would be any app in their app store in regards to those basic analytics and metrics that they're able to connect based on downloads and whatnot yeah I mean it varies, so you know there's optional data you can submit to them so there's some feedback functionality, and so that includes, like your device model, your app version, your operating system version. If you have closeness sensing active, if you allow app notifications, if your Ems is active, so the it really there's a lot that varies depending on the user activity and so again it and there's also the information that is being collected. You know, through the app stores generally I, we, you know we can't honestly that has not been the biggest source of concern for us again. It's been the potential vulnerability of the underlying exposure notification. Bluetooth exchange. That's been our main concern, not the sort of the app Side Data aggregation by the vendors themselves, though that's something that obviously there's some amount of that as well: okay, Elita, let's go back, I, think you're reconnected now so yeah. Thank you. I do not hope you. No one heard me panicky when I lost everything and you all froze. First, I'm wondering if there's any thought to the intersection and I do not know what it is and what it would look like between the app and the vaccine and people who have vaccines and how that and whether it will impact any use of the app or any information that might be available to people and also- and my last question is I checked my phone. While I was listening to earlier to see because I do have the app and usually on a weekly basis. It tells me whether I've had exposures I did not get one this week and I opened it and I can't find where on the and I'm really bad at technology, I could not find where on the app it actually tells you if you've been exposed. So I do not know if other people have this issue or not so, and that's my last question and thank you, everyone for your your patience and answering me Kevin I do not know if you would want to take the lead on the on the first part. Sorry on the last part at least yeah. So on the last part, you know there's a couple of things that you know again like we're. Working we've been working with apple and Google, there's certain things that the app does right- and I've explained most of that this evening, but there's also things that is some settings or some features that you can access within your core operating system. So I'll just remind remind everybody that the exposure notification technology is, you know, for eligible devices or compatible devices. I should say is built right within the operating system. So you know if you were to go on your settings menu on either your iphone or an android device. There's an actual settings option called exposure notifications and within there there's kind of some native settings that you could that you could see such as the you know, the region that you're in etc. So we have been in discussion with apple I, do not know if you have an iphone or an android, but I know that apple was sending out some type of weekly summary or something like that. I believe that might be. That might be changed to monthly now, but then in no way, that's not related to the Covid-19 Alert New York App itself, and you should notice- is that you know any notification. You do get from Covid-19 Alert New York. It should have the general cover, Alert, New, York, Banner or you know, icon, etc, and the only alerts, the only actual push notifications that you should get on your phone from Covid-19 Alert, New York, are, if you were exposed to a positive individual anything else. You know there is some stuff that you can look up like on apple and google site about you know some of the other stuff that they offer and that's kind of the thing that we're still just trying to juggle back and forth between. You know: hey what does the core app do versus what is apple and Google, trying to do to either promote the use of exposure notifications or any apps that use that or just even awareness of the general technology? I thought that came from you and that's why that would explain why people who do not have apple phones were not getting the same information. Thank you and I could just add on the interaction with a potential vaccine, because this is something we've seen. A lot of you know: speculation about some early r d, devoted to the question of having so-called vaccine passports or immunity, passports for individuals who have been either shown to have an antibody response or shown to have a vaccine and we're quite concerned about the amount of venture capital money. That's been flowing into this and the number of people who've been pushing for this I mean and I say this as someone who is practically giddy still about the news early news as it may be about the Pfizer vaccine and the potential response rate we saw there, but we want to make sure that we do not include those sorts of health passports or vaccine passports as part of our civic tracking infrastructure. There's a really troubling history of exactly that sort of public health infrastructure in the United States. We saw that in the Antebellum south, with yellow fever, at the time where we would have so-called immunity passports for individuals with prior exposure, and that was made a prerequisite for certain jobs or was even tacked on to the value of a slave on the auction block, and really this is something the World Health Organization has pushed back against. This is something other health organizations have pushed back against and we definitely you know, while we think it's very important when there's a safe, effective, approved vaccine for every person in the United States to get it if they're able to. At the same time, not have that sort of vaccine tracking infrastructure going forward all right. We have a question. We have a question from the public here, so let's go to Julia last class hi. Thank you who made the app for New York I, guess it looks like New York, State Department of Health who what technology, who made the app yeah I, can comment on that one. So as in terms of again the underlying exposure notification technology, that is, that was developed by Apple and Google, and then the New York State Department of Health, has contracted with a developer called near form, which again I can provide the link to the open source code. For that, but near forum has developed the you can actually search Covid-19 green app, which was the original one of the original exposure notification apps in Ireland and I. Believe you know whether it be in your form or some something similar I know that you know other states use very similar kind of front-end development to enable or use utilize the exposure notification technology, but the core technology itself was developed by Apple and Google and Kevin. One thing we've been trying to figure out, and maybe you could help us with this: where did the funding for that contract come from? Was that from something that from general appropriations or was that funding from the tech sector as well? So the if you were to go on the website? It does not have the specific information about funding, but I know the New York State Department of Health has partnered with tech, NYC and other bloomberg. Philanthropies to you know, basically a coalition of technology and research partners to launch this app I can't get into the specifics the exact funding mechanisms, but it's based off of a series of partnerships with the State Department of Health. We have talked a little bit about or a fair amount about, other apps and some comparisons between the New, York, State, App and others and kind of improvements and I think most of the conversation there has been around privacy and so Kevin, I'm wondering if you can talk about I guess what what lessons from other apps? You know you guys incorporated in terms of trying to make the app effective or addressing efficacy issues that other apps have had. If there was anything you know along those lines that you guys looked at and what you did sorry, it looks like I was muted there yeah. So you know, as in terms of the the app itself I mean again: New York's been working with several other state partners and out-of-state partners to not only from a security privacy standpoint from just a general usability standpoint, and the thing with this is that you know exposure notification. Technology is still relatively new, you know there's more and more states or other entities that are producing apps. You know in the and even with discussions with you know, apple and Google partners. You know we're just still trying to collect as much data as possible to make sure you know that the app is friendly. You know that people understand, you know what it means how it works. You know we're still answering questions so, even though again, even though we say it does not track your locations, we're still answering questions about. Does it track? Your location, so it's really, you know we're trying to collect as much data as possible. You know the from a security perspective. You know, I can speak to on the Apocalypse New York. It's undergone a series of security, vulnerability tests and that's even in addition to the core testing that has been conducted by apple and Google. You know we, our office of information technology services has conducted a you know a security review as well. As you know, the state's been working with other you know. Other partners on independent assessments of the application- and anything that has been that has come back- is that you know that the app is super low risk, extremely low risk to its app users. Again that the information is that's collected, you know we do not collect any personally identifiable information. The key exchange and the flagging of those keys is positive. It's an anonymous transaction. The Ip address is not stored on the server, so it's a super extremely low risk to from a security perspective, and if I could just push back on that a bit. You know this is something where you know. Clearly, we have a difference of opinion on whether or not the bluetooth technology at the core of this app is actually as secure and safe and anonymous as being claimed, but I think. One thing we can agree on is that there's been a really problematic track record for these apps overseas, where we have not seen it really getting the user adoption rate having the efficacy that is being promised here and I mean look at the Uk, for example, where they're heading into you know a really broad lockdown as we speak. I do not think the evidence is there that the this is a methodology that really is going to help protect new yorkers, rather than distracting from the evidence-based approaches that will all right so Kevin I know you do have some time constraints. So, if you looks like we have one other public question, if you need to to go, then we can. We can let you go and albert I understand you have a little more time so I think we'll, since we do have another question from the public, we'll we'll take that one but Kevin. If you have to drop. That's fine I just want to say thank you very much for for taking the time to answer all these questions here with us tonight and tell us about the app yeah sure I mean I, think you know the links to the privacy policy, the website they were posted in the chat I can before I and actually on that website, it's actually within the faqs one of the faqs is, you know, I heard this is open source code. Where can I access the code? The link to that open source code is available on the website as well, so that is public information. You can access that on our on the website, so I would encourage. You know everybody here if privacy concerns or not just to visit the website, and if you do not have the app I encourage you to download it, and you know view all the information that the State Department of Health has provided on the app. So thank you. Thank you. Thank you very much and I just say. Thank you yeah just say thank you to Kevin. Thank you so much Kevin for being here and for sharing. All of the wealth of information that you brought. Thank you of course, yeah. Thank you so much. Thank you. Everyone! So I see we have a question from Luigi from the public. So let's unmute him hello team. Can you hear me yep? Thank you so much for having me here. I'm a nursing student at Monroe College, and this meeting is very important and productive. I would like to ask whether this app works when the device is off, for example, in South Korea, they have a system with the GPS that, even if the cell phone is turned off they're able to track, they are able to see. It was just a simple question and also thank you, because technology in healthcare is innovative and we are taking advantage in a positive way and evolving the system, the healthcare system, in order to provide a better quality service to our patients. Thank you so much yeah, so just to get into the technical parts of it. No, your device would have to be on. In order for this application to work, it uses the battery on your device to activate the bluetooth transceiver, to both send packets out to nearby devices and to listen to for packets from those other devices. It can't do that unless it is powered on and activated and also I believe if it's in airplane mode. Similarly, the bluetooth transceiver would not be active. As for South Korea I, I'm not aware of any technology that would allow for a phone to be tracked while it was off I can't say definitively. That's not the case, but I do know that there are a number of other tracking tools that have been used, such as installing cctv outside of the apartment, doors of individuals who are in quarantine or lockdown, and things like that. So that might be part of the story that you've seen, but it would just as a very at a basic technical level. If a device is truly off and not powered up, it would be difficult to use that as a way to track location and I. Think Julia may have another question we'll just we can try on meeting her to see if, if that's right or if her hand is just raised from before Julie go ahead, do you have another question? Well, I had another one, but I left my hand up by mistake. Oh okay! Well, we just were going to check with you just in case it's actually the combination of, but my other question I think is: okay, good, okay, all right! Let me I can wait though it's whatever you want! Oh sorry! So if you do have another question, yeah go ahead: okay, the the app does it have the capability of tracking or what whatever the right word is antibody test results. So I wish Kevin we're still here because I I'm not a hundred percent certain. My understanding is. It was only testing individuals for exposure to Covid-19 and an active infection to for Covid-19, and it had not been tracking antibody testing, but that may be something that had been tracked. I think it's worth it! It's important to note, as so many public health officials often do that. You know past exposure and having Covid-19 antibodies is no guarantee that you are unable to be it re-infected in the future and everyone, regardless of their antibody testing, needs to exercise the same level of caution to help prevent the second weight from getting any worse. So that's just something: I want to re-emphasize as well. Yeah I, understand, I, mean I. Think that's my understanding also. Is that it's not, it does not track, who has antibodies or not I. Think for the reasons that Albert mentioned, and basically it's just you know if you've been in contact with somebody, who's got a recent positive test. It's letting you know that, irrespective of you know any antibodies that anybody involved may have or not. Thank you. Thank you all right. Let me ask well you know what let's go to to Elita, who has another question, probably because alberto when he mentioned privacy impacts in other states and other than the interaction between other apps and the notification app. What else you might be referring to that? We should either be glad that we do not have here or wary of if we travel to another state and download those apps and I guess. Would that be something you can't answer that but I just wonder if the state would recommend if you do find yourself in Massachusetts and they have an app or in Pennsylvania- well, not Pennsylvania, but Maryland, for instance Ohio. Would it be advisable to download their app as long as you're there to help protect you when you get back and they'll have no idea if you were in contact with, but I do not think that you could answer that so never mind. Well, one thing I would note is that a lot of these apps are using the same underlying api and the same developer so depending on the state. If you do travel outside of New York, New York state, your app may be effective within that jurisdiction to the extent they're ever effective, which, as you've heard repeatedly I, think it's pretty low, I. Think one of the worst examples we've seen has been the case in Hawaii, where you've had a mandatory registration system. For many months now, that's been a mix of a web form and and telephone check-ins, but we've seen that routinely turned into a policing matter where people have numerous visitors have been arrested for failing to register or for leaving their hotel during the period they're under quarantine. And while you know, we strongly believe that every single american, every human being has an obligation to do everything we can to protect our neighbors and protect our communities that we are very worried that the more states transform Covid-19 into a policing matter. The more it will be a step backwards for public health that, rather than a step forward. So Hawaii has been a really problematic case at North Dakota Utah we've seen early efforts at these apps, where they were being designed with much less privacy, protective tracking tools where those efforts were largely abandoned I. My understanding is those apps were discontinued in part because of lack of public engagement, and you know, we've certainly seen really abusive apps in other parts of the world. You know there have been numerous examples from you know: China South, Korea, Singapore Israel, where we've seen very invasive approaches to Covid-19, where, sadly, you we've seen these invasions of privacy, autonomy dignity, but it has not actually resulted in the sort of public health benefits that are being promised, and that's why I keep coming back to that terrible pun of a of a line. Beware of geeks bearing gifts, so that I think goes to another question which I think is going to be the last question here we talked a little bit about this, but I just want to kind of bear down on it. So albert I know you have serious concerns about the efficacy and sort of the question of whether you know from a prioritization or kind of resource allocation perspective. You know the app really makes sense, but just sort of focusing purely on the privacy side of it sounds like the main concern is not so much with you know, Google or apple, or that kind of thing, but really about the possibility of law enforcement, getting access to records that it can use to sort of reverse, identify people or other kinds of things along those lines. So I think that my question is: if there were a sort of broad-ranging privacy protection bill coming from the state, you know along the lines of whether it's the one, you know. Basically the one that's already been passed by the legislature that the governor has not signed. Yet you know essentially saying that this data can not be used as a matter of law. Would that address the concerns? Or would you still have privacy concerns relating to to this app, so the privacy that would tackle our biggest privacy concern? We would also want to see federal legislation because there are limits to what a state can do to preempt the an investigation by ice or another federal agency using a federal court order. So we'd want to see those statutes as well, and you know, we would also want to see protections against the coercion that I mentioned earlier, where potentially people would be forced to choose between installing these and attending school or going to work or participating in life. So I think if we had those legal protections, if we and also made it illegal for third parties to intercept and de-anonymize this data, such as with landlords setting up bluetooth, kiosks or other individuals, potentially setting up their own way of tracking us. You know ways that really were not contemplated by the designers of this app I think that would go a long way, but I think for me part of why it's a much easier question is simply because you know a we have not addressed any of those privacy concerns and on top of it we still are left with a app framework which just has not proven successful and where I'm very dubious, that it could live up to those promises, understood and it's funny that you mentioned the federal law side of it because, as I think Rebecca mentioned, we had passed resolutions previously in favor of that privacy bill. But one of the things that we added to our resolution was something saying specifically. You know we also wanted federal protections as well for the for the reasons that you raise so that point is well taken so I see rebecca, does have another question, so Rebecca go go ahead, it's not a question. It's a comment. I mean in theory, I would love to bring a resolution to the floor, but I do not think this is a traditional meeting, so I won't. But, as we've said several times now, CB8 has supported the contact racing confidentiality app despite it not being signed yet so I would encourage anyone on the call who is interested to contact the governor's office and show your support for this legislation. Sorry, that's my little nerdy thing, but I think it's very important because again, I do not wan, for we have to acknowledge that we are living in an unprecedented time and therefore anything we can do to mitigate the spread of Covid-19 is essential, but I. Think a clear next step from this meeting is that if people are interested to, please contact the governor and encourage him to sign yeah- and let me just add- even if you know listening to me- you thought I was an alarmist. Even if you thought that these privacy threats are being blown out of proportion. This is not just something coming from me. This is something I hear from community groups all the time from groups on the ground. Working with impacted communities and I think that we have an obligation to do everything we can to build trust between all new Yorkers and public health authorities to make sure that no one worries about how this information will be used and to make sure that we do everything we can to stop the second wave from getting any worse and I really think that having these sorts of legal protections will go a very long way. Thank you, so I think that's all of the questions that we had so I just want to say. Thank you very much albert for all your time here and going through all this with us and explaining it to us. It's been very helpful and very informative, and we really appreciate it well, thanks so much for having me really such a pleasure to hear all of the questions and you'll look forward to working with you to make sure that the governor passes that the governor signs this law and that we can really move forward it with a broader slate of privacy protections. Thank you. Thank you, Albert. Thank you! Ted and Kevin, even though you've already left, and we know that contact tracing and testing are essential to controlling Covid-19. So, needless to say, here's my little reminder where your mask social distance, wash your hands answer your phone if it's a regular person contact tracer and take all of this into account and deciding whether to download the app and most important of all stay healthy. So thank you. Everyone for participating, Albert, thank you and Russell and Rebecca. Thank you and friends again spread this information around. It will be on YouTube. Thank you. Thank you good night, thanks for Russell and Rebecca.",
            "summary": "This evening's program focuses on the new app and includes technology, privacy and purpose we're lucky to have a with us, Dr Ted long, the executive director of the Covid-19 test and Trace Corp of New York City's health and hospitals, Albert foxconn, the founder and executive director of the surveillance technology, oversight, project, a privacy and civil rights, not nonprofit, housed at the Urban Justice Center, and he's also a fellow at Nyu Law, School's, Engelberg Center, and we have with us as well.\nWhat I'm going to do is walk through a couple of slides that represent our approach in New York City to using the New York State Covid-19 App. I'm, going to leave time for questions.\nWe have nearly 4,000 contact, tracers more than half from our hardest hit communities and now we're reaching 91 of every single new case across New York City, completing interviews with nearly 80 percent of them, and we confirm on a daily basis that 98 are isolating meaning not going out there and risking infecting other new yorkers.\nThen on the phone you'll see here in the middle of the slide, the app has detected that on X8 somebody has tested positive for coronavirus again being within six feet of you, so think of the ring around yourself with your cell phone for a period of more than 10 minutes, please.\nLet's turn it into a little bit of a discussion before questions about the efficacy and privacy concerns regarding doing contact tracing through a digital app.\nAt the start of my comments is that you know, as a privacy lawyer as a technologist, I, think there's a big distinction to be made between contact tracing apps such as the Covid-19 alert, New, York App, and existing public health measures that we've had for decades.\nWhile it is true that this uses bluetooth proximity rather than GPS, location, tracking or some of the more invasive technologies that have been considered for other exposure, notification, apps GPS pro sorry, bluetooth, proximity data can be mapped onto specific locations at specific times when paired with stationary g bluetooth, beacons.\nWe know that lower income individuals are less likely to have that sort of device, and so we worry that it will expand health inequality that this sort of app will give us a misunderstanding of where Covid-19 is spreading in our community, because it does not have that community focused approach that we've seen with manual contact raising because it and those blind spots we think, can be very dangerous.\nAnd lastly, before we pivot to the Q&A, I, want to highlight the fact that there's no legal protection against having contact tracing data given over to police or even immigration.\nThat would require that sorry would not even allow police access to contact tracing data with a warrant, but currently they can get that information with a warrant or even a subpoena a much lower standard and that legislation, even though it was passed by the assembly in the state Senate, it still has not been signed into law by governor Cuomo, and so today there simply is no protection against that information being misused, and when we're talking about contact tracing data, it is such intimate data and trust is so indispensable to having the effective response.\nAnd, then I think we're going to get more into some of the sort of technical aspects of it, including the efficacy and the privacy stuff a little later on, but I would just say that you know Kevin Sheldon.\nI think one of the kind of basic questions that I think would be helpful for folks to hear about is just you know, as people are using the app.\nI'll use Albert's words here: manual contact tracing, none of that changes with the app, not a single thing.\nThat actually has a really good example to try to explain how the app works, but the one thing that I'll add, is there's actually no data connection between the app itself and the contact tracing system.\nWe've been in several discussions, too, with with apple and Google, who you know, are responsible for developing the underlying technology that this app uses, and you know the we from a New, York state, perspective.\nYou know a million downloads is significant, but it's an order of magnitude less than what we would need for the app to actually live up to its stated purpose, simply because the vast majority of Covid-19 transmission will take place in instances where you do not have both people using the app and also while we've also wanted to caution that we should not assume that a million downloads equals a million users.\nThis question is primarily for Dr. Long, but also for Kevin or Albert, and I've read recently that there is new thinking that it's not 15, minutes or 10 minutes at one time.\nIt's really 15 minutes over the course of the day and whether the contact tracing either the manual kind or the app recognizes that and is able to keep track of multiple.\nThe next question will be, and this I defer to Kevin on in terms of if New York state additionally because they manage the app is going to make any similar changes after they've completed their evaluation.\nThat type of data is very challenging to well, first of all, to collect because we're the that would actually compromise the you know the anonymity of the app in regards to it being those anonymous transactions with others and with the server.\nYou know gender, ethnicity, etc, and that's kind of that as I mentioned, would compromise the anonymous component of it, and one thing I want to add:- is that with any of these metrics we're looking at sort of a generalization of exposure risk and none of it's ever going to be a perfect a way of capturing when any specific individual is transmitting a Covid-19 or not, because you know there are so many other forms of context that come into play.\nWe look to the public New York state testing, data, to where you can see the positive case, data and any testing trends, and you can actually view that on a county breakdown level as well and all of the app activity is completely anonymous.\nWhat's going to happen, is when someone tests positive for Covid-19 a case investigator or a contact tracer from their the local health department, will ask if the person is willing to share that the apps list of what we call closed contact code.\nSo, what's going to happen, is within the contact tracing system, it will generate a six digit one-time pin number that the individual that, in this case, Joe, will enter on his phone and he will consent to sharing those close contact codes.\nSo, there's several states that have their own apps, but they use the same underlying technology and actually the same type of server to generate and issue those positive keys.\nSo, Covid-19, Alert New York actually works across several state lines without having to go and download the individual app from that state and more states are now looking develop.\nThere is so little data being collected, then what conceivable downside is there to having a clear state law that says that this information can never be used by police can never be handed over to ice, and we continue to see the governor turn Covid-19 from a public health issue into a policing issue, much to the detriment of our response.\nThey provide information as part of the contact tracing process to help combat this historic pandemic, or do they risk potentially putting their loved ones in harm's way, and that is why we need to make sure that we have these protections against misuse and abuse.\nOrganizations like Theranos, come to mind that have made really just unsubstantiated claims about the efficacy of how their systems can help solve public health dilemmas, and here the evidence just is not there that these apps are going to work, and they certainly is no evidence that they will be trusted by the new Yorkers, most at risk of dying from Covid-19.\nYou know any of those facts that a human being could could find during a manual contact tracing interview, which is why we think it is so important for the city to continue to focus its resources on those human interviews on those phone calls on that outreach that Dr. Long was describing and not the high-tech, solution.\nThey can not run the New York's Covid-19, Alert App, and where we've seen you know really the public forced to use similar systems.\nWe know that work, access to testing manual, contact, tracing like the program Dr. Long overseas neighbors, reaching out to neighbors, using evidence-based measures, and, of course, enacting privacy laws to make sure that every New, Yorker's health data and contact tracing data is protected.\nI think we're going to get the get into more discussion about a lot of these points through the questions that we have, but Kevin I just want to give you a chance.\nYou know other individuals, apps look for those positive code matches to issue the alert.\nBecause, you know, I think we've mostly been hearing about the contact tracing component and how the codes work and that kind of stuff.\nThink that's an area where I guess folks are potentially putting in more information about themselves and and that kind of thing, so I'm wondering if you can just sort of explain a little bit more, how it works, how it interacts or does not with the contact tracing feature.\nIt just provides you with some useful information such as hey, if you're not feeling well today, you know contact your health care provider or call the test and trace hotline.\nIf, you're, keeping track of your symptoms within the app you know, you'll have a not a detailed log, but just a very basic log of when you first started having symptoms, and that could be useful information in providing that to a you, know, contact, tracer or case investigator.\nIt seems like an open question that has not been proved one way or the other, but that being said, we do want to make sure that we have protections against potential coercion, and you know this is something that's really been a theme throughout that we oftentimes.\nYou know, because what you're going to do, if you test positive, is you're going to isolate yourself, so I'm a little bit confused about how we think this is actually going to work.\nWe should really be putting as much money and energy as possible into evidence-based measures into manual contact, tracing into support services and into making sure our testing is, you know as effective as possible.\nAlbert- could go into a little bit more specifics on this, which is about the kind of fear that New York state implementation of this app encourages kind of schools and universities to use their own apps or even devices that actually use geolocation tracking services for their students.\nAnd, so I think that really we see a disconnect on the ground across New York and up in Albany, with the sentiment, lawmakers and the governor have on how to approach privacy, how to approach big tech and how to you, know.\nI want to be clear, like while I do not believe that the New York App is privacy.\nEncryption is very helpful as part of a secured design, but that is not a substitute for everything else that we need for this app to actually be secure for all new yorkers, and you know.\nWe have to also not oversell, because when there are a number of assumptions that are made by Google Apple when they're talking about the ability to re-identify someone with their code from the from their bluetooth transponder and there's so many instances that any of us can think of where that's simply not going to be privacy, preserving I, mean.\nWith that issue of asymptomatic people who are just going in to get tested for the hell of it, I, guess so Kevin correct me if I'm wrong, but my understanding is that the standard, regardless of the specifics for the patient, is 48 hours prior to either the onset of symptoms or the positive result, which means that you are going to have edge cases where someone has been spreading Covid-19 for an extended period of time.\nIt needs to know where you were located the app and again there's no communication with the contact tracing system of your general, whereabouts, etc.\nCan this contact tracing app, have access to other information that may be of use not to New York state but to Google or apple, or if there are third-party apps.\nYou know they created a new application programming interface, a new layer of the operating system, which allows for only the authorized health app to actually use that sort of bluetooth, data.\nThat, actually is the perfect segue into my question, which is this is not the only contact tracing app that we have access to in the city, there's one through citizen, which seems to be extremely alarming.\nSo I, guess my question is: Maybe you could explain a little bit of the differences, because I do think there are some people who will choose to use the app regardless of any privacy concerns, and we want to help and make sure they're using the best app.\nAs with the Covid-19 Alert New York App. There's no protection there against that data than being harvested by law enforcement by third parties, and my understanding is the terms of service for the citizen.\nYou know really any apps outside of Covid-19 alert, New York.\nYou know you can only have exposure notification service enabled for one app at a time, but the one thing that I did cover in my presentation is that other states are doing this as well.\nThere are other apps out there, but you know Pennsylvania Delaware New Jersey, like they have very similar apps, very similar interface, and you know in many cases the Covid-19 Alert New, York App will work in those states without having to download others.\nYou know that I can only comment on Covid-19, alert, New, York.\nThe only actual push notifications that you should get on your phone from Covid-19 Alert, New, York, are.\nSo, as in terms of again the underlying exposure notification technology, that is, that was developed by Apple and Google, and then the New York State Department of Health, has contracted with a developer called near form, which again I can provide the link to the open source.\nIt does not have the specific information about funding, but I know the New York State Department of Health has partnered with tech, NYC and other bloomberg.\nI mean again: New York's been working with several other state partners and out-of-state partners to not only from a security privacy standpoint from just a general usability standpoint, and the thing with this is that you know exposure notification.\nLet's go to to Elita, who has another question, probably because alberto when he mentioned privacy impacts in other states and other than the interaction between other apps and the notification.\nThink that my question is, if there were a sort of broad-ranging privacy protection bill coming from the state, you know along the lines of whether it's the one, you know."
        }
    }
}