{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCVgO39Bk5sMo66-6o6Spn6Q",
            "title": "September 2020 CB8M Zoning and Development Committee Meeting",
            "publishDate": "2020-09-24",
            "shortDescription": "",
            "lengthSeconds": "2:40:44"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "gfqxwrfEsPY",
            "fillerWordCount": {
                "uh": 338,
                "um": 159
            },
            "readTimeFullTranscript": "87 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "buildings": 44,
                "housing": 44,
                "height": 40,
                "public": 34,
                "pops": 34,
                "space": 33,
                "planning": 30,
                "building": 29,
                "department": 26,
                "street": 25
            },
            "wordCountSummary": {
                "housing": 14,
                "planning": 10,
                "buildings": 10,
                "pops": 9,
                "proposal": 7,
                "department": 6,
                "space": 6,
                "public": 5,
                "height": 5,
                "development": 5
            },
            "fullTranscript": "Hey Elizabeth you're unmuted. If you want to test your audio where oh, no, I can hear you, I just want to make sure it says: mute, oh, but you're unmuted right now, so I just wanted to both. Let you know that and also have you tested your audio, so we could make sure we could hear you, so you could what make sure we could hear you and we could. Can you hear me? Yes, we can hear you perfectly okay, we're here. Is there any way that elaine and I can talk to each other off the not really? Well, I can put you two in a breakout room. If you oh, I get no, we just wanted it when we conducted me. This is the first time we've done this and you when we conduct a meeting if we have to sitting next to each other. We just have to say something so anyway, if we can't, we can't, unfortunately, there's no whispering, I think that's Barbara Chalky, on the line. I just want to make sure that's Barbara Star six to unmute is that you I'm on the phone again. My computer just is giving me a hard time, so I give up it's okay, all right. We can figure it out another day. Okay, I have people coming experts coming and it's me with the building has a problem with Wi- fi and it keeps them disappearing the link, so you sent to me to send it to me. I give up we'll get it figured out, I'm going to put you back on mute, but I just want to make sure that was you elaine. You can unmute any time you should have the ability. So I'm sorry I apologize for being late. Oh no! It's all that you're still a few minutes early and we're still just getting people coming in right. I just I could not find the ipad. Then I realized I set it up. Then I could not find my new sheet whatever how Elizabeth? How are you doing very well and we can't talk to each other. You can't oh, this is this. Well, we run a meeting talking to each other. Oh my god! What are we going to do? Okay, we'll try! The back. Can we go into a chat? Not that I know a chat room, but can we go into a chat to talk to each other or just talk over each other, any sign of cpc or DOB? No, not yet, but let me check. Finally, we got some decent weather out. Here I mean we've been in clouds and cold. I've had heat on, as my sister- in- law said, you're just not used to being here at this time of the year, which is true, we'll never hear them, but anyway we're here. You do have D.O.B here, Josh's, oh Michelle's, here good, so I did find a way to get all of the board members at the top of the list. Oh great, so you'll notice they'll be up first and then everybody else is going to appear after them in alphabetical order by first name, okay, but we can reach out to who we want to participate from the public, exactly yeah, okay and then you see city planning just showed up so okay, it's good because I know- and I thought D.O.B just showed up: okay, yeah, that's what you're saying D.O.B is here: yep Adam is here Max and Max. We'd, like you, as I said, to introduce yourself so everybody gets to know you and also begin to take minutes for this. It's not going to be easy. We like them succinct but not overbearing. Okay, I do not know if he heard me. Did you hear me? I do not. I do not see him anywhere on my screen anymore, but, oh, okay, if you can relay that to him right, he's got a closed on the mic. He's still closed, he's! Muted, I'm sorry, that's the right language! You me he may have stepped away from you! That's okay! Everybody else is muted. If you've, muted everybody is that the yes yeah so and there's no way for Elizabeth, and I because that's how we run a meeting talk to each other, so we'll just have to defer and step over each other. Is that what I'm hearing? Well? We have quite a few people here, yeah. I think you can just conference. You know with each other with everybody. I walked right in when someone said someone may have stepped away from. It did not know if that was me, but just wanted to announce. I'm back, you can step away Max. If I could. I would too, but what we're asking is we're going to introduce you tonight? You know yourself to the committee and then, if you can take the minutes, this is going to be our first time trying to do zoom, okay, sure, taking picking minutes right and you know to the point we do not need all the just take them in them Elizabeth and I will work with you. Let's put it that way. So, typically, where I've worked before I've not had to take the minutes, I'm more than happy to do it and I've certainly seen many meeting minutes right. Look at the model we have in the past and that will guide you and then Elizabeth, and I will help you okay, sure I I'm not sure through the zoom, whether we can do everything that we like. But you know this will give us a draft of what we can fill in, because some of the areas are new to you and afterwards finish. This meeting we'd like to have a call with you assume, whatever the hell, it's called to talk about what we'd like you to work on as we move forward past this agenda tonight. Okay, yeah, that sounds good, definitely sounds good. Will. Is there a resource with past meeting minutes? You can direct me yeah I'll. Send you something. Okay, cool thanks super is it I do not have my why I just realized. I do not know my watch on what time? Is it two minutes after so we can get started whenever you guys are ready. Adam Walt got his pull up. His core is already up. Okay. Yes, I do not Elizabeth. Let us start the machine. Welcome everybody! I was just saying hello: how are you in the family? Are you? Okay? The kids are yeah. We are good we're in Manhattan we're here, and I see your brother on TV, probably 20 times a night during all the sports, every single commercial just run it Adam. Thank you. I will tell him: it's been a very difficult time for the family to close a restaurant after 30 say five years and his I have to I'm going to tell you this. I should not. He talks to me today and his hip is killing me. I said because you were doing that running and you're not allowed all right. How has to go to the doctor for his hip. I could have killed him, but anyway, Mark Zuckerberg they'll pay it right, but Adam. That's wonderful from here, I know will saw him and it's you know it's it's not a way. We they want it to close, but God bless them they're, trying to do stuff with the community. So I it's been a sad time for the family yeah. So thank you Adam for saying that. Okay, Elizabeth, do you want to start yeah? You are going to be the lead. Oh open us up. Thank you, okay. I want to welcome you to the zoning and Development committee meeting. Can you hear me? I do not think so. Yeah! Yes, you can okay, because I did not see the green bar, so I did not know. I want to welcome you to tonight's zoning development meeting of CB8. I hope you are all well and safe. We are going to move this meeting expeditiously and not more than an hour and a half, so I warn you of that. We're not going to go on forever. So I want to thank everyone who has participated and you've got the agenda in front of you and I'm going to ask Elizabeth to start. Go ahead, Elizabeth, yeah. The first item is our pre- application at the City Planning Commission, for currently it's for two special zoning districts, the the Avenue, the Eastern avenues. First, second, Third and York have no height limits, which is why we've had these horrors either going up or threatened, and they have been steps to close loopholes, but the only way to deal with it quite honestly is with height limits, the problem. I think that it will take two or three hundred years playing whack- a- mole with loopholes to get them all closed. So what our proposal does is institute a height limit of 210 feet, protect the tenements in small buildings and protect local retail and service stores. It is in the pre- application stage at city planning, and what we'd like to do is hear anything that tony that you have to say about what Cpc is up to at the moment and then anything that department of buildings can do, because it's bitter as we're working on getting something widely supported in the community to protect the community in its quality of life and people. Until we get it, people are applying for horrors. So we will ask you and d.o.b to tell us what, if anything, you can do to slow or stop the destructive buildings and so I'll hand it over to you, tony okay. Thank you. I can say that, in terms of the application for two special districts, we had the informational interest meeting with the members of CB8 back on February 25th of this year. We then on March 3rd, gave directions to your representative tuck to begin drafting up the paperwork for the pre- application statement. What had been delivered to us before that was an explanation of the project which was extremely thorough. What needed to happen after that was we give a project? I d that goes on the pre- application statement, which is then formally submitted to the department. I had a phone conversation with tuck back in April about what all needed to be included in the pas, because he had a couple of questions, but since then we have not actually received a pas for your application. You know, as was stated when we met with you in February, the department is happy to work with you at advancing your application. The next step, of course, is the formal submittal of the pas, so we look forward to that happening. Thank you very much, and is there I think Elizabeth. Can I respond to his comments? Please yeah. Okay, Tony. We had a fantastic meeting with your staff with your director and what has happened since, and I know you've. Communicating with talk is that, as time has moved on, our budget does not have anybody to continue the work on the applications. We hope that will change very shortly, but there are some issues, but we are thankful that in our meeting with you with every single elected official there that you they were supporting where we're coming and that you acknowledged you wanted to work with us, and we know that there was another non- profit that put in an application that you denied. So we are thankful and looking forward to working with you, it's been a difficult time with Covid-19, but our goals are the same. Our commitment is the same and wants the RFP to hire a person to continue our work. You will see us moving forward with 100 support from every elected official that was at that meeting, so Tony thank you, and as soon as we can we're going to be there. Okay, do you hear us I do? I do want to make sure that this is completely understood that you know what was stated in the informational interest. Meeting from our executive director was that the department does not support a 210-foot height limit. We do not believe that is the best mechanism for creating new housing in the district or preserving existing tenements. But in saying that we will be working with you. We will absolutely process your application. We will give it the same new consideration that any private applicant gets and we are like happy to have those conversations along the way to make sure that your application is as strong as it can be when it comes to us. I mean that is very different than like us, creating materials for you or anything like that. So I just want to make sure that that's clear, you know Tony. It was not clear at our meeting and what was clear is we're going to work together to meet the goals of our community, so you need to go back to whoever you were talking to. It was totally not clear that you were not we're not saying you're on board, but we're saying you're going to work with us for our goals. That was the outcome of that meeting with every elected official, and we just saw what happened in Brooklyn. So, let's work together and move it forward. Okay, yeah, I think our understanding of working with you is saying like we are. We are absolutely going to help in any way to move this forward. You know in the meeting in the informational interest meeting Edith did state that we had various concerns regarding the proposal. We believe the Upper East side is an appropriate place for density and height. You know we do not support the proposal, but we will work with you to make sure that it proceeds through the land use process the same way we do with anyone that puts a proposal for us. We ask you when we raise certain issues around fair share and everything else, your director could not respond and were shocked and when we told you what we have contributed fair share, so we want to work with you, but I want you to have an open mind and remember what we said at that meeting, both Elizabeth and myself and others that you are not going to take the east side and think we owe the city because you put a subway there. That is not just for us, but for the entire, the city. So I do not want to continue the debate. What I want you to be is open as we move forward with the application and do not do what you did to other community groups. That's all I'm asking tony! That's all we're asking for! Thank you, yeah and as we before we go to the representative of the Department of buildings. I just want to reiterate what our proposal does, which I quite honestly I I do not see any anything to object about it. We propose the height limit, that is the highest height limit in the Upper East side, the prevailing height limit on the Upper East side and the height limit that has the support of the community, we're proposing saving the tenements in the small buildings and who does not want to save affordable housing, and we want to save the local service stores and retail stores. So anyway, is there a representative of the Department of buildings, plus you tony any suggestions for preventing out of scale buildings. While we work on getting in scale buildings, so hi, yes, Joshua Adams from the Department of buildings is here you hear me. I believe I unmuted myself you're good okay, so yes, of course, I mean, as far as the department of buildings role goes any applicant or we submit applications to the department for any building proposal. New building proposal or enlargement certainly have to go through a planning plan. Examination review prior to any approvals. That plan exhibit that plan examination review would also include a review of the zoning resolution and that proposal must comply with the current approved zoning resolution that made available. So they would go through that process in the event that it does not comply. You know we would ensure that that the applicant meets those standards. Otherwise you know through an audit or other reviews, if necessary. So as long as the Dcpe, you know, if you go through with your proposal that you submitted and if there are changes made and the department of buildings will ensure that we follow those changes than any applicant to submit applications to us new buildings, enlargements or otherwise. Follow that zoning resolution that's available and you I hope, will not let people slip by as they have in other places by digging a foundation proposing something that looks okay and then changing afterwards. You know a phony first stage in order to get something awful in the second understood in the event that you know, and once these you know, applicants you know put through their new buildings, their enlargement application. There is the they must admit, of course, the zoning diagram or Zd1 to the department. You know and, of course that allows for the public a 45-day period to submit any challenges to that request. Additionally, you know if a building you know is being developed- and you know the community does notice something. You know. If anyone has a complaint about the development and we review that complaint and determine that at the valid complaint we always we can always go back and audit work that was conducted and follow up with the applicant to ensure that they are code compliant. Thank you. Any members of the public have a question about this, or so you have five people have their hands up, starting with elite camp and then Valerie Mason and then two members of the public, wendy and Andrew, and then Marco Tamayo also has his hand up. Okay, fine, take the public people first, okay, so wendy you had your hand up. First, I'm going to ask you to unmute you'll just need to confirm it at the bottom of your screen. Can you hear me? Yes excellent? I want to thank you for giving me an opportunity to speak. I come before you tonight to ask you to commit to supporting and promoting a 210 foot height cap for all construction and to calling for a temporary moratorium on the destruction of smaller buildings. In CB8, the 2:10 foot height has become even more crucial because buildings over this height monster talls are the cause of 67 to 75 percent of New York City's, climate change, pollution, toxic emission levels rise, even in supposedly green buildings, there's an exponential increase in energy use and thus climate change pollutions in the buildings, with a height above 210 feet. For decades, new yorkers have been given the false promise that taller real estate construction would provide upgraded transportation, affordable housing, lower homeless rates, new senior center schools and the like, and as sky high additions were used as inducements to developers to provide these necessary components of neighborhood life. We have not seen that these promises have not been fulfilled. In addition, the extended building heights have devastating effects on our health and survival, as the economic devastation of the pandemic becomes increasingly apparent. These false promises are again surfacing whether in the context of upzoning as of right, manipulation or unbridled variances. Pursuant to our tenth, our constitution's tenth amendment cities and states are well within their rights to regulate building height for the help of the welfare of their citizens. The controlling case on this issue, I only have two more seconds to talk on this issue, took place in New York City on the very matter of building height Penn Central company versus New, York City in 1978. It's still good law, the 210 foot height cap for our safety and health is clearly within the meaning of the zoning. That's permitted under our 10th amendment. We have no time to wait for the next New Mayor Department of City planning, our new City council members. We need to initiate an action, a plan, an absolute 10 to an absolute 210 height cap and a temporary stay on the destruction of the smaller buildings that have safely provided us with affordable housing and neighborhood services. So I'm hoping that cba and all of the citizens will mobilize our institutions and legislative bodies to truly represent new Yorkers and their health and safety, and not impose what either is their better idea or their more selfish idea. Thank you for letting me speak. Thank you next Speaker Andrew hi. Thank you for providing me with the opportunity to speak about the 210 foot, height cap application and I'm so thrilled with what the previous speaker discussed both separating the idea of tallness in buildings with affordable housing, which, as we've seen, is not true but also introducing the climate change aspects of these tower developments. A little background on me: I'm a cellular researcher who's been peer, reviewed, published in peer-, reviewed periodicals. Regarding how climate change impacts us on a cellular level- and I have seen the studies that show, for instance, out of the University college London, where there's been sort of similar over development, that buildings above 210 feet and the disproportionate amounts of climate change pollution, even when the buildings are quote, unquote, green. In addition, the urban heat island, which is a phenomenon where the ground level temperatures increase by anywhere from five to ten degrees, fahrenheit are also a result of over development, and they impact us greatly on an invasive cellular level, both deteriorating our cellular immune responses with regards to proteins, but also air quality, which predisposes us to respiratory health. Coming out of this pandemic, our city is going to have to take a hard look at how our infrastructure on an everyday basis, either helps or hurts our health. As we've seen from this pandemic, a recent Harvard study has shown that when people are exposed to air pollution over longer periods of time, they're eight percent more likely to die from Covid-19, and so I'm asking the Department of City planning the department of buildings and also the departments of environmental protection and health to look seriously at a 210-foot height cap. So we can be a model for the rest of the country, but also so that we can protect the health and safety of new Yorkers everywhere. Thank you. Thank you. Any other members of the public. Okay, we'll go to the board. Oh Betty, Cooper Wallerstein just raised her hand. So that's the last member of the public. Oh fine, all right, Betty, Star, six to unmute Betty just hit Star six. There you go okay, hi! I wanted to be clear about the about Tony's comment that they were waiting for something else for the application that was requested and elaine. You said that we did not have the personnel to complete it. What is it and what is the funding we needed and do we have it now right now, elaine, you can explain problem yeah, okay, right now we have no funding, but we did get some funding through discretionary funds from both Keith powers and Dan Ben Kalos there's been some complications in the bureaucracy, as I call it between the mother president's office and the chair of the board. As of today. I think it's been resolved and that it should move forward and what we call an RFP will go out so that someone can continue the work that we've been doing for the two Canon special districts. I've been as Elizabeth Ben has been totally frustrated. We have lost three months into the new year of not being able to move on r to 10 in special districts, so betty. If you can push whoever you can, but we have been tied up into what I call was Viarakashy 101 and I'm hoping as of tomorrow morning. This has been resolved. Well, I hope so too elaine and I'll talk with you tomorrow, but I do want to make it publicly known now that I'm speaking for East 79Th, Street, Neighborhood Association, and if you ever have a problem with funding for something as important that we all support what you're doing we will try to get funds. So please remember that we will try to get funds that we can give to our Community Board Zoning Committee. If you ever have a problem like this again and for now I'm hoping that whatever who, with whomever you're speaking tomorrow morning, that you will get the funds, but you have neighborhood associations who are there and I'm speaking for mine and I'm sure there are others who would also want to have made funds available so that we would not have lost so much time. I'm not even going to ask why we did not have funds from the board, but anyway, thank you for explaining it. Thank you for both of you for what you're doing Betty. Thank you thanks a lot betty that is that's wonderful to know because we're all getting very antsy about getting this forward. Well, you know, we've always had difficulty, it took what did it take 20 years for city and suburban, so we're kind of used to, but it's now it's getting too late in the game to continue to have these long waits. So thanks very much. Thank you. Okay, Bendy Betty! Thank you. Bureaucracy is a challenge. I've been around it. We will make sure it happens and we will absolutely be out to your group and all the other community groups, because we do have the support of our elected Ben Kayla's for 210 and let's move it forward and I'm hoping by tomorrow. The RFP is out and we can hire somebody. Thank you. Thank you. Thank you. Next board member Dave, Elita Camp, Valerie, Mason and Marco Tomaio Elita. Thank you, hi Joshua and hi Tony. So at the DCP meeting there was reference to not being able to establish that a lower height limit would lead to the same amount of affordable housing as the taller building. I have information and statistics that there has been very little affordable housing brought into cba and that's not a gain of affordable housing that we have lost more than 10,000 units of affordable housing in about a dozen years. So there is no there's just no proof that these taller buildings bring affordable housing into our community rather taking down the tenements the walk- up buildings, the lower buildings are what part of what's causing the loss of affordable housing, as well as just the destruction and the bringing in of market rate housing. So we will be prepared to provide that information to DCP, with the expectation that it will encourage you to be a more enthusiastic supporter of our application, because it will not only preserve affordable housing, but actually, we believe, bring more affordable housing into the community by taking some of the pressure off of the the crazy development that's going on. So I wanted to say that we have a lot more information that will be that will be able to be made available to you. Thank you, Valerie thanks. I tony this question is for you, when you were describing our application earlier. You said you would treat it like any other private application, I'm a little confused by that characterization. Since we are not a private entity and I do not see why we will we would be treated like a private entity. Can you explain that yeah and I apologize if the language of that is misleading? I just meant that we'll give it the same. The same timelines, the same sort of attention. It will follow the same sort of process as any other application that goes through the Department of City planning. That's all I meant okay, so that so let me let me just expand on that a little bit, because why is that? The way we get treated? I mean we're a community board. We are authorized entity of the government and we're telling another part of the government that this is what you know. This is one of the purposes of the Community Board. So I'm a little again. I do not know why we would be treated like extel or Lenox Hill Hospital pursuant to a euler. Can you explain and if that's the way, we're treated then what? How would we go about changing that, because I had when I had a little give and take with our mayor. He indicated to me that if he I asked him to support the 210 limit and he said to me you know I'm sure you're very heartfelt about it. But if I listen to you, I'd have to listen to every other community board and I tend to think that he does not understand the process in New York City, but that is one of our primary purposes. So I would think that you know when you say you're going to work with us. This is the community coming forward telling you this is what we want. So I'm a little bit concerned about how we're being treated like if we were a private developer yeah. I do not know. I do not know that I'm going to provide information about why the process is the way that it is. That is probably something that's determined through the legislative process, and I do not know that I have a good, a good answer for why it exists the way that it does so we do not get any more points that we're in the community and we've had hearings on this and we're coming to you, for this is what we want, the other, the other question and I'll stop. My understanding from talking to other not- for- profit groups is that New York City is one of the few major metropolitan City in cities in the United States of America. That does not have height limits for the entire city. Can you confirm that I can not? I do not answer that well, how many, how many, how many parts of the city are unregulated as to height behind? Besides our neighborhood, I'm not sure I was not given that question beforehand, so I have not prepared an answer. I do not know. Okay, maybe you could get back to us. I think it's less than like four neighborhoods is left, but I heard so I mean we're not asking for something that is that unusual. So I would hope that when you say you're going to work with us, you would take that into account and I'll be quiet. Thank you. Marco is the next board member and that's the last one. That has their hand up. Thank you. Let me start with the pov. We have an opportunity to challenge within 45 days. Any application are there any chance or any oppor or possibilities that, since it's hard to visit in the and find out any information in the building department, one of you can are notified directly to the community board, especially those development, on the avenues in question. I'm talking about your first second and third avenues, and that will be very helpful for us, because then we can propose some challenges that otherwise usually what happened with these 45 days, we are late. So that is one point. The other point is the grand the greenhouse gas emissions. Yes, they are doing great. As a matter of fact. Yes, two days ago, I received their training for the 2024 they're going to reduce to 40 percent of the of these gas emissions, and I think we have, though I appreciate also that you differentiate between green buildings, because green building novel people believe that it's actually green. This is a commercial certification. This is not actually an environmental protection development. So, with this comment, I would like to go now to the department of planning. You say that you do not believe that 210 is going to be fine, it will be available because it will stop affordable housing. Well, I'm going to tell you this is the information that I can provide to you and in our development, around 76:77 to 86 between York and Second Avenue. I counted 12 developments all around the unexploding, the advantage of the second Avenue and all of them they demolish 777, affordable units and they are going to build just only 44. So that means even with your good intention program of the may. You create you. What happened in our neighborhood is for every new, affordable housing with the knowledge 17.26, affordable units. So when you read it, you will put intentions, it's coming in good direction, but the reality the developers they run in the difference direction, and so we are concerned with that part, and I do not believe that 210 is a blue solution. I'd say in your case your position that you said that you find it. That is not good, but I think is. On the contrary, it will be very helpful for us to negotiate indeed in our community, the developer they're coming and they use the old vouchers and you guess what they produce: affordable housing in the declining areas and they use luxury housing in our community. An example of that is a development of 74 and York. This development is that's what presented to us by the way and a studio for five thousand dollars a month and a penthouse for 36 thousand dollars a month, and the issue is right: there you produce luxury housing, really to produce larger accounts with affordable cars, I'm not against luxury houses. By the way I support, affordable, notion housing, but it has to be a an inclusive society. It can not be a polarized society. You can not create two cities, poor city and reach a city. It has to be inclusive completely. So that is a strong argument against your position at the city planning. If you have an example in the in the in the upper sound, I would appreciate that you demonstrate to us. Thank you Rita Popper, excuse me: do you be allowed to respond to Marco's concern about the updates, because I could give him a link to where he can obtain those updates regarding applications, the middle emissions and Zd1 I'd like to add on to what Elita said about affordable housing? Besides that we lost all those small businesses and all the people who worked in those businesses lost their jobs and how many jobs have we lost because of this encroachment of very large buildings. When this originally started, there was duane, reed or bank in every large building, and now, as you walk down the street, the duane reads are closed. So I think that, besides affordable housing, we have to look at the economy of what it does to the economy of the community. That's it do you want to remind because I did not actually say it at the beginning, if you're on the phone- and you want to raise your hand to be called on by Elaine or Elizabeth, it's star 9, so you just have to push in star 9 and for everybody else. It is in the participants menu at the bottom of your screen. Thank you. There are no more comments on this. You have one more that has not spoken. Oh sorry, let that person speak first: okay, Maggie Lehman. I believe it's M Lehmann, so Star six to unmute yourself, M Lehmann, who was on the phone. It's Star, six, three 16.! Yes, this is maggie! Yes, we can hear you thank you and I'll make it very brief. I wanted to go back to. I believe it was Tony's statement that city planning believes the upper East side remains the right place for increased density, and I wanted to point out that, while I understand that for some years that has been city planning perspective- and I know it was Alicia Glenn's perspective in the De Blasio administration before she left. I wanted to point out to everyone at the virtual meeting tonight that if the past seven months have taught us anything about life in a big urban area about life in New, York City, it should be that the definition and the pros and cons of density must be revisited. The ongoing perspective and approach of city planning to use the same phraseology about density that it used a year ago and two years ago and five years ago, reminds us that his we must learn from history and what we have learned from history since March is that we must redefine and the health effects and the economic detriment of too much especially badly thought out. Overbuilding. Thank you. Thank you. Thank you for what you've said. I think we as a community need to listen to all of what you've said and say that we are a community that is under- resourced, but over- developed, and that we need to look at and it'll be the next item, or maybe it's this item on the gender I'm so confused on these zooms that we need to look at. How do we preserve the quality in the contextual environment that we all live in? We have for many years, supported, affordable housing and we have had elected officials and developers say to us. We can't afford it in our neighborhood and they move to other boroughs, and we are saying now we need to have the affordable here within the constraints of the zoning and move forward, but we are supportive of what we need to be as a community and the upper East side, Yorkville, etc. Atlantic Hill are very supportive of our people who live here because we are all being challenged, but we do not want to hear from the city that we're not getting services and we are not seen as a vital part of the city. So thank you all for what you've said so far and before I close I'd like to remind the Department of City planning. We are the commute, as I think Valerie pointed out. We are the community board. Our job is to recommend the best for the community on the advice of the community. The community wants this. We had a meeting once- and I asked just this matter of curiosity- how many members of the audience would like a building higher than 210 and not one single we've probably had 500 people in the room and we not one single hand went up. This is what the community believes it is best for itself. So I think that I hope that city planning will open its mind and not take just the position that they do not support, 210, think about 210 realize it what it means to our community and do not put it off the table. Thank you very much for coming. Thank you. Shall we move to the second item on the agenda? You do have two board members who still have their hands up. I do not know if you're going to recognize them or move on. I did not see them, but we'll recognize them. Elita and Adam. Do you want to go to Adam or Elita First Adam, okay, Adam just confirmed my meeting lovely setting, Adam hi. So the only thing I would say in response to this is what I'm gleaning is that City Planning Commission has rebuffed our advances. The Department of City planning has rebuffed our advances and the issue with the affordable housing discussion that everyone brings up is that in the last couple of years, the city and the state have chipped away the ability to develop, affordable housing. They have taken away low income, housing tax credits for mixed income projects. Now the city only allocates 100, affordable projects, they've taken away the ability to transfer bonuses, off- site, so projects that we're going to do affordable, big, affordable components, I'll point you to 511 East 86th street. They were going to do a lot of affordable and they took away the bonus mechanism and they went from 38 units to seven affordable units, we've slowly chipped away at the mechanisms to facilitate affordable housing development and if we start chopping away at the height limits, we're going to decrease the availability to increase the supply of the built environment in the neighborhood and we're going to just continue to chip away at any ability to develop, affordable housing. I, the Senate, has already said they're going to get rid of the 421a tax abatement they're going to get rid of it completely. So anything that would incentivize, affordable housing development is gone. It's all going to be gone and you start taking away height limits. You're going to get rid of that. That's the last thing we can use to develop, affordable housing, so everyone who wants affordable housing. They do not really want it clearly, because everything that we would use to develop. It is all gone. That's here, I think, developing affordable housing is important. Preserving the affordable housing with people already living in it is much more important and I think that's what our proposal does when saving the tenants in the smaller buildings. Thank you, Elizabeth Adam. I think a leader had a pop okay. Let me just respond to Adam. Our community board has supported affordable housing when developers came in, they saw a foot to put the affordable and other burrows because it was cheaper. Therefore, we do not have what we should have had so Adam. While I hear what you're saying we need to bring the developers back in and build it in our neighborhood, we lost because of the political and development collaboration. I hate to use that word that moved what we needed here to other boroughs and Adam. I may hear you, but I totally disagree. We can build affordable within the neighborhood if people want. So thank you and a leader. Let's move to you. Oh thank you. Elaine Adam, I disagree with you. The extra height that we have has not added to affordable housing. It's done. It's done nothing for that. In fact, we are the board the we have the largest loss of affordable housing units among all of the districts in Manhattan, all of them by far by a large margin, one district that's actually gained has gained because they have a height limit and they are able to use it as leverage when the developer comes and wants to get more height or get some kind of variance. They are able to say if you want that you have to put in affordable housing. We can't do that because we have no leverage, because we have no height limits. Therefore they build what they want and we do not have affordable housing, also city, suburban, that building, which has tried to tear itself down, and the developers tried to tear it down or the owner and build something taller. They can't because they're landmarked, so they went back to having affordable housing or rent stabilized units in that building, rather than market rate or selling it from making to make a lot of money and put up a tall building without affordable housing. We could get more specific about it, but the but the height the lack of height limits has rather than increased, affordable housing has led to an enormous decrease in units again far more than any other district in the city. Also, I disagree with your statement that city planning rebuffed us, as elaine pointed out. They did not one of the things they said was that if we can show them that we will not lose affordable housing units that they will be more enthusiastic supporters of our of our proposal to get height limits and, as Elizabeth said, preserving the tenements, preserving the walk- ups and preserving small business adds to the community nature and decreases the pr, the the market rate pressure on developers to cobble together pieces of property and put up these monstrous towers that have no place in the densest area in the city, and it is the densest area in the city. So I disagree with you know I respect you, but I just have to say that this is not only a means to preserve the community but a means to bring in and retain the affordable housing that we have. I will stop here. Thank you very much for your time and consideration guys, so you do have Wendy's hand still up. I do not know if you want to move the agenda or you want to go back to Wendy. Oh elaine, you're, muted, sorry, elaine! You are muted right now. Okay, sorry, is this a boardman, a board member or a Republican who spoke earlier from the public? No we're moving the agenda. I'm sorry. We need to move on and Wendy chat us and we'll respond to your request. But we've got to move the agenda. It should not be interesting, okay. So the second item is the Lennox Hill Northwell. Are you hearing? Yes? Okay? Here we did invite Lennox Hill, who said they'd come after the next task force meeting. We had that task force meeting arranged by the borough president, but they have re reneged on that situation. Let me bring you up to date right now with Northwell the site, the south, oh god, if I can do this right, southeast corner of 76th, where they wanted to put a residential tower, is no longer in play. They have removed that. So you should all know that we are now working with them. They've reduced the height limit on 76th and Lexington. By about or whatever feet we are working with them. There is a task force meeting conducted by the borough president and Keith powers, the City Council member of that area, and we will be moving forward with them. But right now the residential tower is gone, and I want to thank the community group that organized and worked hard on this, as well as the community board that worked to preserve that area, and we will continue to work with Northwell and Andy if you're there. If you'd like to comment, please come in is Andy there Ndk, maybe Elizabeth is not it Andy K! I do not. I do not know who, who is I Andrew C, Andy Seusslav said somebody would come to recommend to represent them. Has anyone come to represent the neighborhood use the participants button to open the participants box and you'll find a raise hand button in that box and if you raise your hand, they'll be able to see you and call on you or if it's, if you're on the phone, it's star nine, the only person who has their hand up right now is Michelle Birnbaum, okay. Well, maybe the community could not make it tonight Elizabeth, so they did not. They told me they were coming, I know. Well there we are, let's listen to Michelle, okay Michelle. Thank you. I'm delighted to hear that residential building on park is no longer in play. So that's terrific, but I wonder: do you have any information about what they are going to be doing with that site? Have they just I mean? Do they have any additional plans? Can you tell us what more you know? The only thing we know is that they've not put anything forward, but that corner site will be used for the hospital. We know nothing else and as soon as we do, we will share with him. Okay, if it's going to be used for the hospital, that's good news, but I think we still have to be vigilant that a hospital building won't approach the height that they were that they were proposing for the residential building. So I think we still have to be very careful, although financially, that would not be as beneficial as a market value condo on park. However, I think this is good news, but I think until we know what they're doing there, we have to be very careful and very vigilant, which I have no doubt you both know and we'll be on top of it. Thank you Michelle. It's yeah, we understand it's. A hospital use, it'll be within zoning, but you're absolutely correct. We know nothing more than what you shared tonight. Elizabeth. Do you have anything else? Well, I can also point out that the hospital was invited to this meeting but decided that they would not come. I think that as we go forward and we have no idea what they're going to propose. One of the problems is that what the hospital wants to build the far that the hospital itself without the residential building wants to build exceeds the allowable far on the block. So I think, as we go forward, we've taken the position thus far that the a building that is two and a half to three times allowed by the zoning resolution. The height limits, are there for a purpose. Their good height limits, 170 feet on Lexington 210 on park are good, and I think that if we work with them on the understanding that those height limits are sacrossanct, but they own the whole mid block. So if they want to make changes in the mid block, we ought to think about how they can do that without damaging the community, such as a full lot coverage, because if you only block in yourself, we do not care. So I think it's something that perhaps you'll take up. They may come out with a plan in early October, and then we can hold a meeting in late October and discuss how we deal with whatever comes out of there. We do not know you guys have two hands up right now, with three now Gail Barron, Elita, Camp and then Maggie Lehman from the public. Do the public first, okay, maggie it's star, six to unmute! Thank you, quick question. Do we know if they've also exceeded the far on the Third Avenue block, where they're building the euphemistically described outpatient facility? I do not think so. Thank you. Thank you. There's no limit there! That's why we're fighting to change the zoning on well, there's west of Lexington East, I'm sorry of Lexington, and that was why I was asking because there could be the last neighborhood meeting. I went to pre pandemic. It was 275,000, it was another great meeting you conducted Elaine and Elizabeth, I think at Hunter, and it was an enormous square footage and I wondered therefore, whether you had any more refined notion of the size of that it's going to be enormous and high, and I just did not know if you knew more. No, the only thing we know is what they last presented, which it was. If I can recall it's about a 14-story height, which is they could go as high as they want on third avenue, but we've heard nothing more than the last meeting. So thank you and we might thank you. Okay, thank you. So Gail had her hand up first and then Elita. Thank you. I've attended all of the northwell pre- task force meetings, the task force meetings as well, and I think the success of Northwell finally agreeing to eliminate the condo Tower really comes from the fact that there is strength in numbers, but the combining of the community's voice with the Community board's voice. I think has made such a difference and I particularly want to take the opportunity to commend Elaine, Elizabeth, Elita and also Anthony Cohen, who put together a lot of different drawings. I think just standing steadfast and not letting anybody from Northwell try to change the conversation, although that was pretty paramount as to what they were doing at every meeting. I think that that's where we've been successful so far, and I'm hopeful that in the future, as we look at what the final design is going to be, if we keep staying on it, the way we have with the community up to this point that we can certainly be hopeful. Thank you. Thank you. Yeah. Shall we move to the next item? I'm sorry! Thank you. Thank you. That's okay, everything in front of me, so it's harder! I know! That's okay. I appreciate the time I just want to underline what Gal had said and that it's a question of having 8,000 signatures on a petition in opposition to the hospital having the community board hearing from our elected officials, hearing from preservation groups and having all of that support has made an enormous difference. I am remaining optimistic that the hospital will be more interested in in coordinating with us and interested in our feedback as they develop their plans, as Gal mentioned, Anthony has come to those meetings with very strong ideas about how to allocate space so that they do not need to build that kind of tower how to phase the construction, which has been their justification for that size tower, so that they do not need to use that and, and just to believe, that the hospital will be interested in health issues around the city and in complying with the zoning resolution that we have so that they can modernize the hospital so that they can handle a surge. If it's necessary, like all of the other hospitals, do they have said that they are going to comply with a 210 limit on Third Avenue? They said that quite a while ago, it's the hospital site on between lex and park. That's been the issue, but I remain ever hopeful that we will be able to have more input and persuade them that compliance with the zoning resolution in a purely residential there is no commercial usage in on that in that area is really valuable, and for those of you who would like to see the scale of what they have wanted to build, there should be drawings on our website or will could post a link to them so that you can see how truly out of scale with the surrounding residential neighborhood. The proposal would be so thank you, Elaine and Elizabeth Elaine, you're, muted, so just unmute apologize. I just wanted to respond a leader. The issue on Third Avenue is: there are no height limits, and so they can do whatever they want, but we've been assured- or at least what we've heard it's a 14 story complex. So we hope they stay to that and we see what they do reflection today. Okay, we'll move on any other public members or our board members before we move on no elita may not have finished what she was saying. I do not know. I know that there is a there's, no high limit, that's what we talked about earlier, but they said they know that we're fighting for 210. They said possibly thinking if they say that on third avenue that we would be more lenient on lex park. I do not know what their motivation is, but that's what they said so and they have not really given us any information at all about that site. So there's nothing that we could object to or voice our concerns about. Our concerns have been driven by their proposal between lex and park on 76 to 77Th street and the tremendously outscale buildings that they had proposed. So I'll stop here and just say that it is worth it is a tremendous effort of unanimity and force in having the community and the preservation groups and elected officials and the Community Board together. So I thank everyone for their enormous collegiality and cooperation with all of this. So thank you, I'm fighting for words here. Thank you. Thank you. Thank you. Okay. We are now going to move the agenda if there a will, if there are no other hands up republic of people, no more. Okay, we'll go to item three, which none of us knows anything about, and we're very grateful for Tony coming here explaining about the notices to community boards about changes in zoning lot designations we'd be very grateful if you explained what this proposal is and, or fact and its effect. Thank you very much yeah. So I I'm actually not sure if I can speak to a specific proposal that you're mentioning, but I can say that you know the Department of city planning has come out on record at a city council meeting saying that we would support a local law that would provide notice to community Boards council members. The borough president, any time that zoning lots are merged. Zoning law mergers are something that actually goes through the department of Finance, not through the Department of City planning or the department of buildings, and so we are in support of any sort of legislation that would change the transparency of zoning lot mergers. Oh thank you very much, and this would give us a heads up on air or development right transfers, air right transfers, so that, because that's why they merge their zoning lots yeah, I will say: sometimes there are transfers of development rights that do not occur under a zoning. Lock. Merger yeah, those do exist. Okay sounds like if so, if we, if we get forewarned, we being forearmed, so I think that we do not know enough yet, but that sounds like a very helpful thing. Any members of the public have any comments or questions okay, Michelle Elaine did you want to say something before yeah I tony. How closely are you working with finance and on what basis are they moving forward on the merger of the zoning lots and how are we going to be notified on a timely basis? Do you know any of this? You know. Personally, I am not a part of that process, given my role at city planning. These are great questions that I can. I can certainly take to DCP council because they would be the ones who would be working on this. I would appreciate we would appreciate this because we see on the Upper East side in our community, these zoning lot merges and if it's going to finance on what basis are they permitting the mergers because they are impacting on a negative level, our neighborhood? So tony, if you can guide us in this and help us, it would be very appreciated. Yeah. I will see what information I can find and pass on to will, but this is that this proposal is not something that's coming from the Department of City planning. So I do not know that anyone within our agency will be able to point you towards any specifics. We have just voiced our support publicly for such such an endeavor, but I do not know what more to say about it than that: we're not the ones leading any sort of effort to make this happen. Okay, who's leading it. That's something that I I'm not aware of at the moment, but I can ask council: can you let us know who's taken the lead on the zoning lot merges because it could be a financial piece, it's political, but who is taking the leadership, so we can then reach out to that agency. Absolutely I'm not sure who's driving this initiative. I will reach out to our council and see if they can provide more clarity. Okay, so, within a week can we hear from you, I will do my best. That sort of depends on council getting back to me. Oh, come on. Let's move it! I can't guarantee that zoom land, let's move it I'll, see how quickly council gets back to me I'll. Thank you. Sony oh tell us who we need to reach out to absolutely. Would your proposals include a lot besides mergers? I would hope you would add cutting off pieces because we have a building, that's built on, I think 88th street, where they got around the zoning by chopping off an unbuildable chunk and to in order to so I think, if we besides learning about the mergers, it would be useful to know. I hope that never happens again, but it would also be useful to be forewarned if we have these weird chunks chopped off in the future. Zoning lot divisions, let's say yeah, I just want to re- emphasize. We do not have an active proposal for such a thing to happen. So your first question about specifics of that proposal. I do not know that there are any, but I will ask council to if they can give any specifics about any said proposal from another agency Elizabeth. If I may interject Joshua from the department of buildings again the buildings Department had put out, you can hear me correct. The buildings have apartment. Buildings has put out bulletin 2020- 003, which can actually found be found on our website, the Department of Memorandum, that updates our buildings, memorandum from May 18 1978, referring to zoning, lot certifications. This memorandum states that no part or extent it says, department of Memorandum dated May 18th 1978 to borrow superintendents. It is the May 18th 1978 memorandum is superseded in part to extent to the extent that a zoning line may not consist of parts of tax lots unless a permit has been issued any reliance on such building lot prior to the issuance of this bulletin. So I believe in reference to mentioning portions of a tax lot being added to a respective zoning. Lot may not occur after this. Bulletin has been posted, which was March 2nd of this year. Does anything occurred in our community that has the zoning Lot amendment? I do not have that information on the top of my hand or top of my head or for you tonight, unfortunately, but I can get to us and send it to us by the end of the week. Just like Anthony has stated I can. I can follow up with upper staff or senior staff on this issue and try to get back to you as soon as possible on the reliance that they get back to me. You know thank you by the end of the month, we'd appreciate it. Okay, thank you very much anthony for bringing us up to date on that over to you, elaine. Okay, you have to you, have two people with their hands up and I do not want to interrupt. You go ahead. Go ahead. Let them know before I go all right, Scott from the public and then Michelle Scott hey there, so my name is Scott and I'm from city planning as well. I work with I work with Tony, so I mean I was only raising my hand because I can't actually unmute myself, but really wanting to sort of reiterate that the department does not have an active project to try and make this happen. We have been on record before saying that we would be interested in and probably supportive of something that improved transparency around zoning lot mergers, but I mean there's nothing active in this realm for us to really get back to you on, apart from us sort of repeating that sentence, so I mean Tony and I will certainly go back to the department and sort of ask around as to what might be happening, but I mean, as far as we know, there's no active move to try and implement something in this area, but again happy to clarify and the department's certainly open to considering such a an initiative. So I mean, I hope, that's clear. I do not think we had. I guess a lot of context coming into this meeting about what this question was about, so we probably could have asked around a little more if we knew that, but I mean I hope, that's. I hope that clarifies things for you. Thank you, thank you, but our understanding is the zoning lock merges is coming from the city and we're asking for information, so we can be informed so anything you can find out and share with us after this meeting since you do not have it now would be most appreciative because it it's not coming from us it's coming from the city. So please could you follow up and inform us. That's why we ask you to come tonight. Thank you. I mean yeah. We can do that. We just we need some context to be able to do that research, so I mean the best way to do. That is probably to put those questions in writing and send them through will and we'll look into those specifically for you happy to do it context is nothing more than what we heard from the city will follow up. I hope, given what we can understand from what the city told us about this. So it's not our initiative, it's your initiative, so whatever you have to do, we appreciate whatever organizat agencies or streams or whatever you take care of it for us, because we're only a city agency that receives information we do not initiate. So thank you Michelle and then Adam has his hand up as well hi yeah. In light of what I heard, I would like to make a resolution supporting that transparency for changes in zoning lot designations and, if seconded I'll, speak to it, because we can then clarify the language, but I did not want to miss the chance of making the resolution. So if somebody would second it, I would just like to explain why I'm making this resolution and how I think it could help us. I saw Elita giving applause. I do not know if you know or Marco has his thumbs up. Okay, great! So the reason I'm suggesting this is. I do not really think that we necessarily need the specifics of how the proposal is written, whether it come from the finance or city planning or whoever it comes from. I think we're within our rights. In writing. A general and supporting a general resolution that says we support being notified about any changes in zoning lot designations and any other kind of transparency issues that you feel is appropriate to include in this. I say this because it would be a way of getting ahead of the situation. We would be on record. It can't be too controversial because who's ahead, who's against transparency and we're not being so specific as to you know, take a position. The only position we're taking is on being notified and, frankly, it's not unlike what we had proposed when we were talking about city charter changes where we had asked for all kinds of notifications and transparency and being notified before things got through a certain phase, etc. So I'm certainly happy to have the wording you know made in any way that you all feel comfortable, but I think it would be a way of getting ahead of it, because we have plenty of chance later once the proposal is actually made to support that proposal or for all we know there might be something in it that takes away something that we would want to see in the proposal. So in that case we may not totally support it or we may want additional input so, rather than wait for the whole thing to be formalized after which it becomes very difficult to make changes as you well know, I propose we get ahead of it. It's I we word it. How we want to word it part of it is changes in the zoning lot designations. Elizabeth, your thought about putting you know, pieces of zoning lots. However, you want to word that in the resolution I see no harm. I think it can only benefit us to get ahead of it and we send it out to all of the agencies that might conceivably have some input in this, and it's not contradictory to anything. We've asked for before. Thank you, Michelle. Would you think it's a resolution, or should it be a letter? I would do it in the form of a resolution, because they've already give you work they've already, given you wording. They've already said that they're talking about changes in zoning lock designations, so you already have some wording there. So I think if we can build on that with and again we're only talking about transparency, it's about it's like being against. You know motherhood and apple pie. I mean who could be against it, but we could put things in there that we know that have been hidden from us before on purpose or inadvertently. That relates to this. You know not get not getting any broader, just a very closed, very simple resolution that we are asking that and we can put in one of the whereases where we hear that the department of finances is considering. You know changes to transparency and whereas we would see city planning- and we would hope you know- whoever the agencies are- would be supportive with the tra of transparency. Therefore, we resolve, you know we're asking that the community boards be notified and we should put in within. We can set an actual time frame, but we certainly should put in within a time frame, making it possible for the community to respond, in other words, a reasonable time frame, not 10 days before a proposal comes out, but something where we can respond. I see no harm in this and I think it's a good way to get on the record and also I do not think we would have difficulty passing this through the full board so that it would come down as a full board resolution. I can see no harm a letter. In addition, if you wanted to do that with a resolution attached, that makes it even stronger. That's fine[ Applause] from the public is, if you admit, I'm your petty, it's Star, Sex Betty, Star, six, one more chance, Betty Star, six, all right! I do not know I guess she may have stepped away from the phone elizabeth. If we do this resolution, I was just going to suggest adding to changes such as zoning lot, mergers and divisions. You also have Adam. Will you are new to me? So let me just respond. I'm perfectly happy with that, and also to be very precise about it. We should say not excluding any additional suggestions for transparency that we may have in the future. In other words, so it's not to be misconstrued that the only thing we're asking for is what we might be mentioning at this time in this letter, so I think you know sort of a legal thing. You know. Lawyers use that kind of language all the time, but absolutely hello Betty is now unmuted hi. Thank you so much. I thank Michelle. Do not ever leave the board. You really are so special. I was listening to what Scott said and he said that they are interested in improving I'm reading what he wrote the transparency, but nothing is being discussed or work on, so he was really inviting the board to say and do something, so they do not have any they're not doing anything. So this is wonderful and Alita's idea of including a letter also. He was actually telling us that in what he said, that was all I wanted to say so Elaine and Elizabeth. You both have your hands up. So I do not know if you wanted to say something before you moved to Adam go to Adam. So my recollection, then I checked. This is something that council member Kalos proposed in City Council and it was the notice of development rights transfers which basically said that, five days after a merger zoning lot merger was recorded, we're supposed to notify the board Community Board. So on and so forth. I'm looking at the legislative history and it looks like it was laid over as of September 26 2019. It seems like it's all it all will do. Is it will notify everybody that a zoning lot merger has occurred when we write these letters or resolutions, especially when it comes to zoning and subdivision of tax slots? And you know incremental merging of zoning lots. We have to be very technical with the knowledge and with our conveyance of what we want to support and what we do not want to support. So I would just, but basically what we will be doing is we'd be supporting legislation that has already been introduced by council member kalos. The question should not be to be department of City planning. The question is to Ben, where we are in the legislation and whether he thinks it's going to go forward or not. So maybe we need to ask him elaine and Elizabeth. I do not know how you want to proceed. Let me just say I understand Adam. Our role is to put out where we're at the next step would be then to say after we've passed. If we do a resolution that we ask Ben to move it forward or if it's Keith's area to move it forward. I totally understand what you're saying, but we do need to have some record of where we stand, and then we go to the next step, even if it's the bottle present. Okay, thank you. I think that's everybody is not it. Yes, Michelle has her hand up Michelle made a motion, so somebody's got to second it somebody did second it. We have to call the question, but before I do that, I just wanted to respond to Adam. Nothing in this resolution would prohibit us from doing or saying or promoting or asking Ben to do anything or asking anybody to do anything, but this will be a strong statement if it can go to every agency, including the city council, including the speaker that we are on the record for transparency. We did this when we worked on the on the city planning. You know on the resolution for the state for the charter. We did it when we asked for transparency when we worked on the city charter, and I just think that this is a good firm. You know just put it down firmly. We can work on the whereases and the statement, but it does not preclude us from doing anything in the in the future, not at all. Okay. What we need is to call the question. I guess I do not know if I could do that, or maybe you want to continue discussion here fold the question all those in favor of calling the question. I do not know how you do anything about it, but just put your paw up. I think you have the plurality. Thank you. Good okey- doke call the roll, please, okay, so I'm going to call the role by board member's first name, just because that's the alphabetical way that they are lined up and then I'll go to Elaine and Elizabeth's for the last two votes. So Adam, just repeat that one more time. Yes, I'm in support of this all right. Thank you Alita! Yes, thank you! Barry Schneider! Yes, thank you craig, yes, Dale! Yes, thank you! Gregor Morris! Yes, thank you! Jane Partial, you're, muted, yes, yeah! Thank you, James great daddy to Greg Morris. I did Marco yes, Michelle, yes and Rita. We did yes thank you and Barbara Chucky Star, six, yes Barbara. I heard a yes, I did too, but I just want to hear louder. Okay, are there any other board members that I missed Sherry did I call you Jerry Weiner one? Second, yes, thank you. Any other board members that I missed raise your hand. Let me quickly run through the rolls Elizabeth yes and elaine yes, perfect, so unanimous and the record shows everyone who voted. Thank you: okay, elaine, okay, we're into pops the privately owned public spaces and the reason it's on the agenda tonight and we have done a major study years ago. We have 96 pops, but given what's happened under Covid-19, there have been some questions raised about the use of pumps in our community. We are unusual in that our pops were all in residential buildings, where the developer got extra height. To then provide this public space, and there was an issue with Tony's restaurant on I'm going to say 64th and 3rd, where they took over that site and the residents of the building raised issues. We have over time tried to work with city planning. That does the enforcement that any change to a pops would require a rule up in an an architectural planet. So we have it on here now be because of a complaint and want to discuss really what is going on with the pops and what has city planning and DOB doing, and I turned that over to DOB and cbhc. I just wanted to clarify one thing: the Department of city planning is not responsible for the enforcement of pops. That is a department of buildings task. So in the past it's the opposite. So Cpc says it's now dobs responsibility. Dob is responsible for actually doing the for fielding complaints or issues with pops and then actually they send somebody out to investigate whether or not there is a violation of those pops regulations. That is not something that the Department of City planning does right. So DOB. Can we hear from you sure, of course, so in regards that way, because I do not want to blame you individually, all right in regards to the Tony Dennapoli restaurant that you're referring to we. Actually, we went out to inspect that site on when you sent in the requests it was entered on our website for the 301 complaint on July 8th. We went out there on on August 25th because we received an additional complaint. I believe that will had sent something over to myself, so we expedited that request. We did go out there. The pop is open to the public. However, we did find that Tony Dennapoli's restaurant was using that pop site for additional speeding. So we did. We did issue a violation. We did issue a oath summons for that location yeah, so it's still being processed, and there should be. You know hearing dates that for some time, probably late, latter part of October, if not the earliest. In November now we received a number of complaints for pops actually in the Cba area, and we had done a ran some analysis on it, but most of the complaints that we've only received nine total 311 complaints that are on our system for pop sites. In the Cba area of those nine complaints, we issued violations to three Tony Dinapoli 1081 Third Avenue, also known as 200 East 64Th street was one of them as well as 339, east 339, east 93rd and 525 east 72nd street, both of which are both of which receive violations for pop sites. Now there has not been any notice given to the department given to buildings regarding any relations to pop's closures. You know owners, you know, building owners are still required to maintain the pop sites as a requirement and still follow social distancing guidelines and they're still supposed to be opening open. So you know as given that you know if you continue to receive any more complaints, please feel free. You know to reach out to us, but it would also benefit you know we would prefer, if you submit it to 311 as well as you know, once doing so, you can follow up with the department as well about that complaint, so we can have a record of the complaints regarding pops in your area and citywide. Well, given the complaints, what were they and what has gone on? We know, after our study of 96 pops- and we are an unusual area, because our pops are residential, not commercial right. They have serious issues and in working with Cpc and DOB around what certain pops wanted to do to even make it more accessible and safe. We've been confronted with an architectural consultant having to be hired plus a euler, so we need to know now with the complaints what is going on, and how can we help our residential pops? We are not commercial. Pops like most of the complaints have been related to pops being closed, so we went out there, for example, so some of them were not pop sites but of the ones that we did go out to. There was one issued one. Second, there was one pop site that was issued regarding an additional sign added to the pop sign, saying that there was no dogs allowed or no smoking. Of course, we issued a violation for that, because they're not they're not permitted to relocate place. Yes, that location is 525. East 72nd street. Okay, all right now that the next one, this one was missing its required signage. This was 33,339 east, 90 or east 93rd street. We issued all summons for this location as well and they were missing required. Entry signage for the public, publicly owned space does not say that the place was not open, but it was missing inside which is required to be posted. As far as 1081 Third Avenue, we issued a violation for them, because the Tony Dinapoli was using the space as extra restaurant feeding. Additionally, there have been one, for example, 436 East, 86th street. We went out to this location based off of a complaint that the pops location was closed. We did find that it was closed and the reason why it was closed because there was facade work in the building adjacent to the pops, so it had to have been closed by the facade. Repairs are being conducted additionally, other complaints related to pop's closures, where we have went out and confirmed that those pop sites are actually open, and that's the that's the the updates that I have regarding pops for you. Unless you have any additional questions. No, I think the major one was the tonys in the App League. So where are we at? I know you've done some violence. We issued that violation on August 25th right. We used that violation, August 25th there was they did not. Of course they they're not permitted to use that space, but you know once they receive their oath hearing date. They'll go to oath court and, along with DOB, will also attend, and if they are found to be in violation, then they must remove that seating from the pops location. But do you know now what's the date for the oath hearing and what's the status of what they're doing with the space? I do not have the date on hand for the oath hearing it's still being still being processed as soon as it's processed. I can provide you that date and I can send that to. I can send that to will and I can provide that to you as far as them, what they're doing with the space at this moment, we are not sure if they're still using the space for seating. Obviously you know based off the violation. You know they should not, but they still need to attend their oath hearing to see if they're in violation and then they must provide us, of course, with documentation or pictures or evidence showing that they removed that seating and returned it back to. You know: full pops, of course, they're. If they're wanting a seating, they should be following up with D.O.T regarding sidewalk, cafes and access. That way, is it open now, as far as you know, for the residents the pop site top site? Yes, as far as our most recent inspection 825, could you go out again and look because we need a more current assessment sure why not yeah? This is a major issue that was given to developers and the public needs to have access to that space. Of course, now we can go out there again. We can not issue an additional violation for this meeting until their oath hearing has been until their oath hearing has been heard, but we have no issue going back out there again to confirm that the pop site is open if the pop site is closed, we can't issue a violation of the owner, but you can notify the appropriate group that they're still in violation and that's what we need to hear, because we do not want our residents to be not denied any of the limited open space that we have. Thank you, hello, Joshua's still there. I think I lost him. Okay, I can hear you now. I do not know why they cut out for a moment. I can hear you now enough, given zoom, we all get cut out yeah. I just wanted to say that we'd like you to go back out to, let us know what's going on so the residents in the community are not denying the limited open space that we have in the community. At this point I mean the pops has been a major issue for us in the community, with many sites not being available to based on our study to people in the community, because even the buildings did not know that they had a pops. They got me. The developers got major concessions to do this, I'm not saying- and I would hope that- and one of the questions in our study was: do the people purchasing in these buildings understand their responsibility to pay for a pops and it's been unknown, but we'd appreciate you going out and making sure we have as much open space at this point, as is needed. Thank you sure thing I do not know if DCP has anything that they want to add to that before you want to go to. You have five people with their hands up several from the public? No I'm good! Elena and Elizabeth. Are you ready for public comments from the public okay? So we have Bruce Caitlin person with the letter K and then Judy Schneider from the public and then Barry Schneider is a board member bruce we're not open to the board. Yet we're open to the public. Thank you for giving me this opportunity to address our community board. My name is Bruce Templemeyer, I'm the director of operations for Tony's, the Napoli restaurant. I have a statement I like to read. If you permit me, Tony's has been a committed member of the Upper East side community for almost 30 years, we've been very supportive of every faith- based organization, every school, whether public or private, local hospitals and charitable organizations in our community. We take great pride in our support of the Ronald Mcdonald House of New York by supplying dinners to the children and the families of the house on the third Wednesday of every month. For the past 20 years for the past 10 years, I've had the honor of being Chairperson for the annual Ronald Mcdonald House Heroes event held Augustavinos each year. This event hosts over a thousand people and Tony's the Napoli restaurant donates all the food and liquor for the event which raised over nine hundred thousand dollars in 2019 and was on track to raise over a million dollars this year. Had it not been cancelled due to the pandemic. In addition, during the peak of the Pandemic county's initiated program to donate meals, to our front line, hospital workers and first responders, with the help and support of our friends and community, we're proud to be able to deliver over three thousand complimentary meals, Tony's has been fortunate to have a plaza behind the restaurant. This plaza, along with our restaurant, has been under scaffolding for the past three years, which certainly had a negative effect on our business. It's a total mess from the construction of the building behind us. We cleaned and scrubbed painted and repaired this closet in order to provide a clean and safe area to be able to serve our guests. I can confidently say that more people in our community have had the opportunity to enjoy this applause in the past four months than I've had in the past eight years, we've been here numerous times, Daily, I'm thankful our guests for providing them a place to dine where they feel safe from vehicle and pedestrian traffic and enjoy dining in a properly socially distance environment. We do realize at this public plaza. We have not blocked public asset access and have not and would not deny anyone access should they sit, want to sit and read a book or just relax. Despite the mayor's open streets initiative, you may not realize that virtually all New York City restaurants are operating at a loss and, unfortunately, many have closed their doors for good our times square location has been closed since mid- March and we are all doing whatever we can to survive. Our businesses are dying and we are, we and our employees are losing their livelihoods. We currently employ approximately 60 people at Tony's. It is our only intention that we survive this pandemic with our business intact, so that we are able to keep these people employed, bring back the rest of the employees. We miss so dearly and can even continue to be part of this outstanding community, and in closing I just like to add that we've been inspected by the people. There are no current violations that I'm aware of, and I'm just on the DOB website. There are no open violations as of now. Thank you. Thanks bruce going on down the list. Caitlin, you just have to confirm hi. How are you I'm? My name is Caitlin Conklin, I'm the director of volunteers and communications at Ronald, Mcdonald, House, New York, we're a house on 73rd street for children with pediatric cancer, and we would just like to say that Tony Sinapoli has been an incredible supporter to our house and our families donating food to feed all of our 95 families monthly. For the past 22 years now, and during Koba they have really stepped up an incredible way for our community and our first responders our health care workers, donating so many meals to hospitals and, of course, to our families and we're so proud to be partners with Tony's annapolis want to just share how incredible they are to be an asset in our community. Thank you. Person named Kay Lana, Landsteiner Hi, Carl Landsteiner, I'm the I'm. Actually. The person who made the original complaint- and the reason I made the original complaint is that the access from I believe 64Th street was blocked for at least a month, maybe two months by a gate, and then after the public hearing is when I noticed that they opened the gate back up since then. While it is true that the public Plaza is open to the public, I will say that there are very few occasions where every single possible seating space within the public space are not open and they're occupied by patrons of the restaurant. And while I understand the struggle that these restaurants are going through, I also understand the value of public space within a city like New York City, where there is a dearth of public space, and these spaces are to be protected for the use of the public, not solely for the use of patrons of a restaurant. And what I hear while this may be one instance is that we're beginning to utilize these public spaces for commercial enterprises, and it's one thing to offer seating to patrons of a restaurant. It's certainly another thing to put tablecloths and picnic tables and umbrellas acrosss the whole public plaza. And while you may say that there are sufficient spaces for people to sit at and read a book, that's just not the case, and it does not provide an inviting environment for people to come and visit these places and to enjoy the public space. If it's being occupied by a commercial enterprise. There is a feeling, at least that you either must patronize that restaurant or you must be seated by a hostess to sit in that space, and I think that's the danger here, and I will also add that Tony Dinopolis already has a sidewalk permit for sidewalk seating and frequently, I would say nearly every single day. There's a sandwich board on the sidewalk that says come up and enjoy our patio. It does not say, come up and enjoy the public space that we happen to be nestled under it commandeers this sense of ownership. That really is not the property of Tony Genopolis, it's the property of the public, and I appreciate the opportunity to voice my concern and I appreciate the the candor of the board and I yield the rest of my time. Thank you right, Judy, Schneider and then the rest are all board members good evening. I have to say that I disagree with the former speaker. The gate has been opened to the plaza. You can go up there and read a book. I have not been going out, but I have friends. I live on 64th street. This is close to me who tell me that it's a great place for them to just sit and read, and the employees do not bother them, so it is open to the public. I also happen to have friends who live in this rental building. It is not a co- op or a condo, it's a rental, and they tell me- and I have seen myself over the years practically never during the day or into the evening. It is, it always seems to go empty, and now it seems to be more inviting with what the restaurant has done and I think at these very difficult times we have to give. We have to make some exceptions- and I say this to DCP and pov- and giving the some leeway to these people, so they can stay in business, pay, rent pay taxes so that our city can survive. If the times change, then yes, the rules should be tightened up, but now, under these difficult times, I think there has to be some leeway in the rules. I would also like to ask Joshua at DOB a question on you mentioned spanish, in the plaza that you gave out a violation for illegal signage, has DOB or DCP. If you do all the plazas any specific wording or signage that they're supposed to install in the time of Covid-19, so that people will distance and wear masks or are the plazas it's supposed to come to you? How does that work? Could you answer that job sure so, as owners are probably on space, they're required to maintain their properties, ensure that individuals within the pop sites- you know- I mean peop, people should be maintaining social distancing, I'm not sure if the department is issuing. I do not think we're issuing specifically. Violations for I'd have to confirm. I have to confirm for you regarding like violations such as that, but, as far as like signage goes for pop sites, the only required signage is signage that was confirmed by or that has been approved by city planning. I believe yes, but now I'm talking about the Covid-19 signage. You know the city planning. It takes a long time to get your approval on the pops, but this Covid-19 thing is recent and have you come up with the standard for all the pops that you've notified them about that they have to post for distancing and mass I'm asking what the city is doing. I do not believe there was any updates, but I can confirm and follow up with Zb8 if they could reach out to you. If you want to provide will- or they have my information- because I have another plaza in mind- that has a problem: okay, it's Tony. Did you have something sorry to cut you off? Judy Tony was trying to do. Let me say there is standard signage about what a pops is. Yes, I know, but given whether it's Covid-19 or not, these pops are be open to the general public and when you are perceived by the public as not a public space, people then do not enjoy what we were forced upon by the changes in zoning with the development rights. So the key is that the spaces must be open in public. Tony Dinopoly must make it clear, what's open whether they are serving. We have a situation with a pops on with shake Shack and it's very clear with their signage that people can go in there sit down and bring their own food. Tony monopoly must do the same thing. The residential component of cops has been a major challenge and, as everyone knows, there will be no more pops in a residential community. We are very different than the commercial areas, so Thanopolis has a responsibility with all their charitable. Giving as many of our community organizations and restaurants have done, must make it clear that it's okay to go, sit there and not be forced to order a meal. If I may, I want to address two things that have been spoken by a variety of speakers, so one is that per the mayor's executive order. Number 128 pop spaces are allowed to operate, or I'm sorry, private dining is allowed to operate in pops. There are some standards that they have to follow. The two of them that relate to the Department of city planning are that they do. They are required to provide notifications notification of changes to that pop so that pop space excuse me it's a written description detailing the changes and then they need to provide us with a site plan showing that any changes that they're making comply with the executive order. So in the case of this particular restaurant that we're discussing, they would be allowed to do that as provided that they give us the necessary materials and that they're following the guidelines and it typically you know it depends on the size of the pops, but typically they're not allowed to occupy more than 20 percent of the space, and so that could be where some of the violations issues came up and some confusion about, should they be allowed to operate there or not. The second thing related to Covid-19 signage, the city at this point, does not have a required standard for Covid-19 signage in pop spaces, as you alluded to, we do have our regular prop signage, but part of the executive order also does allow for pops owners to provide additional signage permitted in within the pops related to Covid-19 messaging, to remind people to follow health, current health guidance and other executive orders, so that is allowed if they choose to do it. Thank you. Can you provide to will the list of the pots that are expanding and opening their sites for restaurant use? I know in the area there's very few that would fall onto this, but it would be helpful for us to know where that happened. I can tell you in community board eight. There has not been a single pops that has submitted a request for outdoor dining to date, so that Tony Dinopoly never requested. Thank you so they're in violation. Okay, can we move on? If there are no other will do you have anybody out there, one one member of the public, Maggie Lehmann and then three board members? Okay, thank you Maggie. I hate to take up any time I wanted to echo. I think what Judy Schneider had said about Tony Dinopoly. I have been there as a member of the public with two small children in the public plaza. The servers of Tony Denopolis Restaurant were delightful with us. We went in. I had two little. We sat on a bench. One of the servers of the restaurant actually brought a chair over to me so that I would not be crowded on the bench with the two little kids and when she saw my two little grandchildren eating she actually brought over each of them a delicious piece of bread. They were inviting. They made it clear that the public was welcome and I wanted to simply add that on to Judy's comment, I thought they were great. There was no sense on my part at all or the other adult who was with us that in any way were we made to feel the least bit uncomfortable as the public using the space thanks maggie, you have three board members with their hands up: Craig, Michelle and Barry. Okay go from the top Crank good evening, everyone! So I understand rules are rules, but we all know. This is a time of shared sacrifice. It's a time where local institutions are literally dying every day and going out of business due to cobit and all the impacts of it. So I think it's just plain wrong to not provide the flexibility to provide businesses a fighting chance to survive, even if it's a temper, even if it's temporarily using a public space. So if not, if not a pops, then I'm guessing Tony's would likely be using the curbside lane or the sidewalk, and we know that many people love how outdoor dining has really created a vibrant feel to the community. But not everyone universally supports that approach. So I guess I guess what I want to say is that I feel like as a board. We should be proactive in trying to create and be creative and trying to find any public space that could be used to help our small businesses survive, because without that, then what is our community even if it impacts our public spaces, and we should therefore be lenient when facing situations that may not conform to the quote-, unquote rules that we face in typical time. So I would hope that we can just not embarrass ourselves by fighting against a local institution such as Tony's that has been around for a long time has had to relocate because of the Second Avenue Subway, and that are good neighbors. I just hurts me that this is where we've the discussion that we're having and that we're wasting time having this discussion right, it's now Michelle yeah. Well, I would like very much to support and I'm sympathetic of Tony's position, and I think we really should give them some leeway, I'm also sympathetic to the public. However, it really seems to me that there's a way for everybody to be happy here, I mean certainly you're taking public space if you take a lane next to the bus lane in the street and you're taking public space if you're on the sidewalk. So I do not think that the pop is sacrossanct at this moment in time and considering the fact that there is a way for the public to use it. I think we should encourage Tony's, who is very good neighbor, been in this community for a very long time. We certainly want him to survive and his employees to remain employed, so if he could reach out, if there's anything, that's a really. I do not know how big how many I do not know how many square feet we're talking about here, but there if there's a way to just make the place a little more well welcoming to the public, put a sign up, assuming that's permissible, and you know let Tony do a little outreach to the community, although it seems as though the staff has been doing that instinctively by being so welcoming and kind to a public person that came in, but certainly there's a there's a way here to solve this, and I certainly would not want to see Tony's have any fine about this. So my recollection with the initial guidelines about taking space was that you filled out an application online and you just simply took it. I do not remember that there was any particular. You know way that that the administration got back to you telling you could or you could not so maybe Tony's. Maybe they did this. I do not know, but maybe they should just go online and just apply for the space. I certainly hope they're not going to be incurring any fines in addition to all the other financial hardships at that this time, there's a way to work this out. This is not critical and, I think, neighbor to neighbor. They can do it and I support their effort and I support them for staying in business. Thank you, Michelle Barry and last person, I'm incredibly proud of my community board members for their attitude. Michelle, particularly thank you so much craig. Thank you for expressing what I had in mind to speak. Let it stand as it is: they're doing their best to stay in business to keep their employees employed. They're. Oh welcome, welcoming the public into that area, which is a public space. Let's move on. Thank you very much. That's last stand up elaine and Elizabeth. That's the last hand up if you wanna, okay, I just wanted to say that the community is an absolute support of our small businesses, but if there are certain procedures we suggest and will maybe we can put it on the website that if you are wanting to use a pop, so whatever the regulations are that you apply and facilitate that movement, so that there is a review and an acceptance, so the businesses can move forward. I think we are as a community board on record, supporting small businesses and I'm sure our small business community, a committee rather would support any of the groups, but we also have to look at that. We have residents in the community that are going to raise questions because they do not understand why there's a change and we need to be clear with our businesses that there are procedures, follow them and we will support them. Thank you. Let's move on to the signage DOB. Are you there? Yes, I'm still here. Could you talk to us? We've had a number of issues related to enforcement of signage, particularly banners on streets and avenues that are not in compliance with the zoning and also a concern about the signage on target on. I think it's 70th and 3rd Avenue and then the new proposed signage for the target on 86th street between Thursday and Lexington. So if you could bring us up to date, what did the deal be doing about signage because we have a lot of violations in the area? Yes, so, as you know, we are still in the sign moratorium that moratorium is running from February 9th will start on February 19th 2019 and runs through February 9th 2021, where we won't be issuing any violations or business sides that existed on before February 9th 2019.. However, do you be? We have not? You know imposed any civil penalties for work without a permanent violations for business signs that do not exceed 150 square feet in area, nor 1200 pounds in a way now, I believe, signs that are on the street like banners on light poles and such like that may fall under D.O.T, but as far as like banners and such and flags such as that, as long as they do not exceed 150 square feet and 1200 pounds in weight. We won't issue violations for those and I believe they they do not need permits for signs that are smaller than 150 square feet. Now, as far as for illuminated signs such as the one you mentioned at target, they do have permits for these signs or they do they have apply for permits for these signs. I'm not mistaken. They are currently in the process, but have not been approved for permits. Yet so, but I did not get the one for 77th street I'll have to follow up with you on that one, I'm sorry 70Th, 7-, 0 and third seventieth and third, the separate different target right. There's one seventieth on third and then there's one eighty- six between one fifty east mid eighty-, fifth, okay, I'm going to write down 70th and third, because that one, I did not get a question for you just want to follow up on the illuminated sign, request right and the state, and you raised that banners etcetera are permissible in residential communities. Logs are smaller than 150 square feet inside that's permitted unless it's a bid and we have an implotation of banners with advertisements for non- profits throughout the community and we've had a numerous number of complaints on this. You have specific addresses for these locations. God the avenues- Lexington Avenue 86th street. How about how about this? You find the specifications yeah give me the list of addresses for these locations that are, they should not be having any kind of advertising or advertising for any product at the location or at a separate location unless of course, specifically approved by the department. So, if you have these locations, we will go out and inspect for right. Now, it's still in the sign moratorium right now. It does not mean we won't, but banners are different than the signage and what we're asking is for you to let the will. The community board know where we have people who have applied for these science, because it is an environmental infiltration of our area, and people have been complaining about. What's going on with the banners you're talking about banners on buildings, facades and on the street right on the lamp posts, or whatever else is available, that's the place we've had yeah now lamppost banners would be under D.O.T. Department of buildings only has only has jurisdiction over the meats and bounds of the building itself. Okay, we have some on the buildings. Okay, all right, so any specific ones that you have on the buildings, we'll look into it and we'll go out and inspect now. Just because we're in the sign moratorium does not mean we won't issue a do, DOB violation that does not come with a penalty because we're not issuing penalties for signs at this moment, but in the event that they do not. It does not. That still requires them if they have not met compliance to comply in the event that they do not comply after the sign moratorium following February 9th 2021, we may issue violations that come with civil penalties. Okay, but do the businesses have to get a permit to put a signage up? Yes, as long as it does as long as it is, if it's greater than 150 square feet in area or greater than 1200 yeah, if it's greater than 150 square feet or 1200 pounds of weight, anything less. Obviously I do not think we're going to find a sign. That's probably 149 square feet less than that, but if it's less than 150 square feet, they do not need a permit if it's greater than that, they need a permit. If it's illuminated sign, they need a permit. Unless it's inside the window, if it's inside the window- and it is advertising- we can still go out and inspect okay. Thank you all right. Now again, it's likely well, I do not want to. You know, speak on specifics of that, but we'll go out and inspect. You just provide us the information and we have no issue going out there. Thank you. I think someone else had an additional question. There there's one question from: I see it: okay, no worries, there's one question from a member of the public and there's one question from a board member Betty, Cooper, Wallerstein and then Michelle Burbaum. If you guys are ready to go to questions. Yes, please, okay, Betty, Star, six did that work hi. I wanted to ask about the banners on lamp holes in terms of property that has been. You know that gosh. You know what I think I really do need. I do need the number to call, because we have some banners on polls for a long time that probably should not be there at 78 79th street. So how do I get in touch with? And you said that one's D.O.T I believe it would be department of transportation since that's okay, right away, yeah all right, so I have that one. So, thank you. Okay will. Could you get betty the right number for that? Please thank you. Thank you very much and then Michelle yeah hi. So for many years and elaine will remember this well, we've been complaining about the banner that covered originally the front facade very significantly of the church. On the southwest corner of 85Th and park. We had a representative named Steve Fiorito from the DOB who used to come to our meetings and he would very diligently take down the list of names but found at that time, even though this was a recognized violation that the DOB in fact did not have the manpower or who did not or would not or could not dispatch. Anybody to take care of this banner inexplicably, was now moved from the front of the building to the side of the building. It's just as egregious. I understand you're, not ticketing now, but it should certainly be on your list. It's 1010 park, it's the South, West Corner of 85Th and Park, and that has been going on for a very long time. I'm going to also ask you about the marquee on 86th street of the old movie theater. Now that movie theater, as you may or may not know, is now vacated. The expectation is that you know a commercial entity is that where target is going or are they going in there, barnes noble, oh okay, but eventually somebody is going to be going into that movie theater and that movie theater has a big marquee out there, which of course was only put there because it was a movie theater when this happened to the Dwayne reed on 86th street, just west of Lexington, which had been a movie theater for many years, and then the theater left, the marquee, the Community 86Th Street Association, and the community fought very hard to have that marquee taken down when the Dwayne Reed moved in, because there was no reason for such a big thing. So my question after all of this is about that site on 86th street, where there was a movie- and I imagine a movie will not be coming in to replace that. But retail will I'd like to go on record to have the DOB look into that and have that marquee removed. So is that within your jurisdiction at the moment, do you have to wait till it's leased? What what's the protocol just? I would have to follow up with senior staff, but send me the address to this location as well, because I do not. I do not have the information. Okay, what's provided, all right will. Has your email I'll find the address. It was the old amc it's on 86 between third and third and second on the outside of the street. Do you happen to know the address off the head top of the head? Is it 150 elaine? No, it's 86 between lex and park, and it was finally no that's the Dwayne Reed, I'm talking about the movie theater, no, it's not on Lexington park, you're, talking about on the south side, yeah the old, the amc theater that vacated on 86th street between second and third. Okay. On the south side, I I'm somehow I'm thinking 150, but I do not know I may be wrong. Do you happen to know the address? No, I think Elita does. She was waving your hand. I was waving frantically because Michelle that movie theater, we heard an application from the owner that they are trying. They are wanting to reopen it as a movie theater, oh wonderful. They have, we actually heard the application in February or March. They had another movie owner. I do not know what you call them a distributor, but I think that fell through when Covid-19 started taking over, but they came back and they asked us to approve that they needed to renew their variants in order to bring in another movie theater, and they asked us to be able to do that. What committee was that? No that's great, that was, that was a land use application. The owner of the theater is a client of our firm and she told me that they are looking to get another movie theater. Oh well, I'm very happy to hear that so good, so withdraw those marquee comments at the moment. Thank you but put that put that church on your list. Okay and ten Park Avenue Correct yeah South on Park South, West, Corner, 85Th, Street yeah. I think we have heard of this location in the past. I'm sure you have because you've heard it from this committee a thousand times yeah after we re- acclimate myself to the history behind that location, but surely have no issue following up in the future. On that terrific. Thank you you're welcome. Maybe what we can do is look at the list and resubmit it to DOB, so they can follow up once the moratorium is over. Thank you, Michelle was that all you had to say. Yes, thank you. Okay, thank you elite and, oh sorry, Adam. You had your hand up first before nope, you're, good, great and then Alita. You have your hand up. I did I meant to lower it. I had I do not. I do not know how Elizabeth and Elaine will feel about this, but I had an item of new business. Well, we are going to move into new business elita. So we have one item. If you have one, let us hear it and then we'll we're going to bring up our item. Thank you. It was actually something that had I and I think I just had not lowered my hand. It was something that had come up when we had the charter commission, the Charter Revision Commission, which was to ask for a comprehensive city plan and I'd like to ask if there could be a resolution to ask for that from the city. This is a good time to reevaluate where the city is and where things should be placed. We're looking at health equity issues, we're looking at height limits, we're looking at other things, and so since we had already passed that with the the Charter commission, I thought I would ask about it again that you look puzzled or something else, I'm not sure what you're really asking. I guess I'd like to ask sanded Pardon me. I was asking Elizabeth as the co- chair. Did she understand what you were, whether this belongs under us or another or full board? I do not know, I do not know. Could you re- explain it? I'm sorry yeah! I was just asking if there could be a resolution calling for city planning to work with the communities, educators, preservation groups, community advocates on having a comprehensive city plan, while the city is going through a big change, a big flux from Covid-19 and the economy. To think about where things should be, how the city should be laid out comprehensively, so that our height limit request and efforts make sense so that health equity is taken into account so that we have an affirmative action to try and get more parks and green space and open space so that the city is looked at as a whole, including our district, and maybe better decisions could come out of it. This is a really good opportunity to look at the city while it's undergoing so many changes, and the reason I brought it up here is because if it were voted on in zoning and development, because it is a question of development, then at the community board it would not take up new business because our meetings run so long, but we could do it at land use also it's just it makes it makes sense to. I mean for me, that's why I'm asking everyone else to view the city holistically with community preservation in mind, affordable housing in mind, shelters in mind and all of the issues that have confronted the city so dramatically in these last six and seven months as well as previously, but have really been highlighted in during Covid-19. Anybody want to respond to that. Michelle has her hand up yeah. I think that's an awful big undertaking and my feeling about it is frankly, I think, at this time, with this budget, with a turnover at the council of about 30 people and during the Covid-19 time. I think this is probably the last thing that the city is going to be willing to take up. This is an enormous job, in addition to the fact we're asking them, I'm reluctant to even ask them for something like this, without telling them what we want, because when the city gets their hand on something, even if they took it up, they would be coming up with a plan without our input and until we have a plan that we would like to see imposed or happen in our particular district, I'm a little concerned about opening up that Pandora's Box plus. I just think it's unrealistic that they'll take it off. I do not think they have the manpower. I do not think they have the budget. I do not think they have the will and the whole city is in transition. So I do not I'm not sure you'll get the group who's supposed to look at this. To look at this. I just do not think it's feasible at the moment. It may not be, and it's part of what we had asked for through the Charter Revision Commission and I was not envisioning something without community support, but quite the opposite, because what's happening now is a lot of changes without community input, but to really have the community involved, but based on the number of hands that are flying up, it may not be an appropriate time, so I just threw it out there because it seems like a good time theoretically, but perhaps Michelle you're right and practically it does not make any sense. So you have two other people who have their hands up Jane and Sherry Weiner. Oh thank you will, I have to say I agree with Michelle. The city is totally broke: they're furloughing managerial staff. We and you know, I'm a teacher. We got an email from carranza that they're going to start laying off non- managerial personnel or they have to go on furlough within the DOE. It's just too broad based, and there are too many financial issues. There are people who are hunger deprived. I do not think that this is the moment to ask for such a broad- based study. Thank you, okay, fair enough and Sherry Weiner. I was going to say that I'm afraid, if we do not mention it, it's going to be it's going to be forgotten. Perhaps as people are saying, we do not there's not the resources to do it at the moment, but just to remind the powers that be that it was on it was on. You know the Charter Commission study. I think that would be appropriate. So I'm trying to think of a compromise where, yes, the practical nature of it is that it probably is not the money or the wherewithal, but we could go on record and just say: hey do not forget about it at some point, we'd like it to be done just trying to be a compromised suggestion. You have billy Freeland, who has not spoken yet Michelle has her hand back up. What do you want? I can't yeah. I just want to say I agree with elita and would be totally amenable to what she's suggesting, but I also you know respect what folks are saying about now, this being a difficult time, I do think I do think, there's a point at which we should raise this again, because we did make this suggestion as elita mentioned during the charter revision process. I think it's a really important idea and I think, as a board, we should be considering the fact that there's going to be a new mayor in a year and a half, and so maybe it's not right now, but at some point it would be great to take this up, because we do need comprehensive planning all around the city. It's something we've supported in the past. I think it's worth picking up again, so I definitely you know thank Alita for bringing it up. I think it's an important point and I hope we'll take it up sometime in the next. If not now the next year you have Michelle, who has her hand back up and then other than that no other board members, oh and Betty Cooper Wally scene. I guess we should go to the public first go to the public, please Betty, it's Star, six hi am I on now. Yes, I agree with Billy and I I'm very happy that elita brought it up because it may sit a little bit somewhere and then they will not know that it was even there or remember, but we may have an opportunity then to come in when we do get some information and we do not like it. So I think it is important to bring it up now to have it to decide what it is. You wanted to say and to get that in and and then we'll just see how it what happens, but not to do anything it would, I do not think, would work so yeah. So as a compromise, why do not we send our charter committee's resolution back out? In other words, we have the resolution. Maybe you want to write a cover letter saying we do not want this to be forgotten and all the mayhem and send the resolution back around and that serves the purpose of bringing it up to the forefront again and yet having the understanding and recognition that this is not something that is going to. You know be on the drawing board anytime soon, but that we do not want it forgotten. So how does that sound? The resolution included a lot of things we were asking for from the charter commission, but we could certainly, if there's approval, have some kind of letter, reminding them that we did ask for it at that time without, I guess muddying the waters with the other stuff. Yeah. Okay. Well, that's that sounds fine. I see no harm in that sounds fine. Let's see what Elaine and Elizabeth say I you do not need a resolution to do this. Do a letter from the board- and I what I would suggest is an outreach to the various committees to get their input as to what should be needed, but because we're under fiscal constraints should not stop us from moving forward and looking at what we as a community, need to continue to contribute to the success of our city. So I would suggest that we gather some additional information and then a leader that a letter go out from the board, not a resolution identifying our concerns to the city, that's great language that you use too contributing to the success of the city. Let's go back and listen to this tape. Thank you right. Okay, can we move it forward? Please I'm losing batteries, so we got ta, move it, no one with their hands up anymore, so the other item under new business. We wanted the community to know before I die, because my battery's just about out is that the blood center on 67th between second and first appears we do not have. Data is coming forward with a change in zoning in a plan with which has not been presented to us to they're, located in the Rhb district and from what we remember from years ago. They want to build a tower there Ri-10 and do medical buildings, so we wanted the community to know that this indeed does not fit in the zoning for 67th street, but that something is being proposed and we need to know- and there will be in a couple of weeks- some kind of a meeting with the Community Board on this, but we wanted to alert the community that something is a coming from the blood center on 67th between second and first- and I can't recall- I must say I think we did- handle the northwell issue and the tower on Park, but there is a major concern that you've got another non- profit institution wanting to come in and request a zoning change. Thank you. I may be gone. Am I still here? Okay you're still there, okay, I'm about to go out on my ipad Elizabeth. Do you have anything else on that? No, that's all I recall yet more bad news, but we do not know the facts yet so, but it does not look wonderful, correct all right with that. We want to thank everybody for spending their Thursday night with us and we'll see you soon move to adjourn the meeting. Second, okay, we're adjourned good night go rest enjoy whatever sunset is coming we're gone.",
            "summary": "Oh great, so you'll notice they'll be up first And, then everybody else is going to appear after them in alphabetical order by first name, okay, But we can reach out to who we want to participate from the public, Then you see, city planning just showed up.\nIt is in the pre- application stage at city planning, and what we'd like to do is hear anything that tony that you have to say about what Cpc is up to at the moment and then anything that department of buildings can do, because it's bitter as we're working on getting something widely supported in the community to protect the community in its quality of life and people.\nCommunicating with talk is that, as time has moved on, our budget does not have anybody to continue the work on the applications.\nWe hope that will change very shortly, but there are some issues, but we are thankful that in our meeting with you with every single elected official there that you they were supporting where we're coming and that you acknowledged you wanted to work with us, and we know that there was another non- profit that put in an application that you denied.\nWe told you what we have contributed fair share, so we want to work with you, but I want you to have an open mind and remember what we said at that meeting, both Elizabeth and myself and others that you are not going to take the east side and think we owe the city because you put a subway there.\nThat has the support of the community, we're proposing saving the tenements in the small buildings and who does not want to save affordable housing, and we want to save the local service stores and retail stores.\nFor decades, new yorkers have been given the false promise that taller real estate construction would provide upgraded transportation, affordable, housing, lower homeless rates, new senior center schools and the like, and as sky high additions were used as inducements to developers to provide these necessary components of neighborhood life.\nWe need to initiate an action, a plan, an absolute 10 to an absolute 210 height cap and a temporary stay on the destruction of the smaller buildings that have safely provided us with affordable housing and neighborhood services.\nThank you for providing me with the opportunity to speak about the 210 foot, height cap application, And, I'm, so thrilled with what the previous speaker discussed both separating the idea of tallness in buildings with affordable, housing, which, as we've seen, is not true, but also introducing the climate change aspects of these tower.\nA recent Harvard study has shown that when people are exposed to air pollution over longer periods of time, they're, eight percent more likely to die from Covid-19, and so I'm asking the Department of City planning the department of buildings and also the departments of environmental protection and health to look seriously at a 210-foot height cap.\nAnd I'll talk with you tomorrow, but I do want to make it publicly known now that I'm speaking for East, 79Th, Street, Neighborhood Association, and if you ever have a problem with funding for something as important that we all support what you're doing we will try to get funds.\nYou ever have a problem like this again and for now I'm hoping that whatever who, with whomever you're speaking tomorrow, morning, that you will get the funds, but you have neighborhood associations who are there , it took what did it take 20 years for city and suburban, so we're kind of used, to, We will make sure it happens, and we will absolutely be out to your group and all the other community groups, because we do have the support of our elected Ben Kayla's for 210 and let's move it forward.\nThere's, just no proof that these taller buildings bring affordable housing into our community, rather taking down the tenements.\nWe will be prepared to provide that information to DCP, with the expectation that it will encourage you to be a more enthusiastic supporter of our application, because it will not only preserve affordable housing, but actually.\nWe believe, bring more affordable housing into the community by taking some of the pressure off of the the crazy development.\nIf we were a private developer So, we do not get any more points that we're in the community My understanding from talking to other not- for- profit groups is that New York City is one of the few major metropolitan City in cities in the United States of America.\nAre there any chance or any oppor or possibilities that, since it's hard to visit in the and find out any information in the building department, one of you can are notified directly to the community board, especially those development, on the avenues in question.\nIndeed in our community, the developer they're coming And, they use the old vouchers and you guess what they produce: affordable housing in the declining areas.\nI wanted to point out to everyone at the virtual meeting tonight that if the past seven months have taught us anything about life in a big urban area about life in New, York City, it should be that the definition and the pros and cons of density must be revisited.\nI think we as a community need to listen to all of what you've said and say that we are a community that is under- resourced, but over- developed, and that we need to look at and it'll be the next item, Maybe it's this item on the gender We have for many years, supported, affordable housing, We can't afford it in our neighborhood and they move to other boroughs, and we are saying now we need to have the affordable here within the constraints of the zoning and move forward, but we are supportive of what we need to be as a community and the upper East side, Yorkville, etc.\nSo I, think that I hope that city planning will open its mind and not take just the position that they do not support, 210, think about 210 realize it what it means to our community and do not put it off the table.\nThe Department of City planning has rebuffed our advances and the issue with the affordable housing discussion that everyone brings up is that in the last couple of years, the city and the state have chipped away.\nNow the city only allocates 100, affordable, projects, they've, taken away the ability to transfer bonuses, off- site, so projects that we're going to do affordable, big, affordable, components, I'll point you to 511 East 86th, street.\nPreserving the affordable housing with people already living in it is much more important and I think that's what our proposal does when saving the tenants in the smaller buildings.\nOur community board has supported affordable housing.\nThey did not one of the things they said was that if we can show them that we will not lose affordable housing units that they will be more enthusiastic supporters of our of our proposal to get height limits and, as Elizabeth said, preserving the tenements, preserving the walk- ups and preserving small business adds to the community nature and decreases the pr.\nYou know: I, respect you, but I just have to say that this is not only a means to preserve the community but a means to bring in and retain the affordable housing that we have.\nThe residential tower is gone, and I want to thank the community group that organized and worked hard on this, as well as the community board that worked to preserve that area, and we will continue to work with Northwell and Andy if you're there.\nSo I think, as we go, forward, we've taken the position thus far, that the a building that is two and a half to three times allowed by the zoning resolution.\nI. Think that that's where we've been successful so far, and I'm hopeful that in the future, as we look at what the final design is going to be, if we keep staying on it, the way we have with the community.\nI am remaining optimistic that the hospital will be more interested in in coordinating with us and interested in our feedback as they develop their plans, as Gal mentioned, Anthony has come to those meetings with very strong ideas about how to allocate space so that they do not need to build that kind of tower how to phase the construction, which has been their justification for that size tower, so that they do not need to use that and, and just to believe, that the hospital will be interested in health issues around the city and in complying with the zoning resolution that we have so that they can modernize the hospital so that they can handle a surge.\nThat's been the issue, but I remain ever hopeful that we will be able to have more input and persuade them that compliance with the zoning resolution in a purely residential There is no commercial usage in on that in that area is really valuable.\nThe issue on Third Avenue is: There are no height limits, and so they can do whatever they want, but we've been assured- Okay, we'll move on any other public members or our board members before we move on.\nExplaining about the notices to community boards about changes in zoning lot designations, So, I, I'm, actually not sure.\nIf I can speak to a specific proposal that you're mentioning, but I can say that you know the Department of city planning has come out on record at a city council meeting saying that we would support a local law that would provide notice to community Boards council members.\nMergers are something that actually goes through the department of Finance, not through the Department of City planning or the department of buildings, and so we are in support of any sort of legislation that would change the transparency of zoning lot.\nAre you working with finance and on what basis are they moving forward on the merger of the zoning lots and how are we going to be notified on a timely, basis?\nI would hope you would add, cutting off pieces because we have a building, that's built, on, I think 88th street, where they got around the zoning by chopping off an unbuildable chunk and to in order to So your first question about specifics of that proposal.\nLet them know before I go all right, Scott from the public and then Michelle Scott, And I'm from city planning, as well.\nI work with I work with Tony, So I mean I was only raising my hand, because I can't actually unmute myself, but really wanting to sort of reiterate that the department does not have an active project to try and make this happen.\nIn light of what I heard, I would like to make a resolution supporting that transparency for changes in zoning lot designations and, if seconded I'll, speak to it, because we can then clarify the language, but I did not want to miss the chance of making the resolution.\nI'm, certainly happy to have the wording you know made in any way that you all feel comfortable, but I think it would be a way of getting ahead of it, because we have plenty of chance later once the proposal is actually made to support that proposal or for all we know there might be something in it that takes away something that we would want to see in the proposal.\nSo, I, think if we can build on that with and again we're only talking about transparency, it's about I mean who could be against it, but we could put things in there that we know that have been hidden from us before on purpose or inadvertently.\nYou know not get not getting any broader, just a very closed, very simple resolution that we are asking that You know changes to transparency And whereas we would see city planning- Whoever the agencies are- would be supportive with the tra of transparency.\nTo then provide this public space, and there was an issue with Tony's restaurant on I'm, going to say 64th and 3rd, where they took over that site and the residents of the building raised.\nNow, be because of a complaint and want to discuss really what is going on with the pops and what has city planning and DOB doing, and I turned that over to DOB and cbhc.\nI just wanted to clarify one thing, the Department of city planning is not responsible for the enforcement of pops.\nSo we need to know now with the complaints, what is going on, and how can we help our residential pops?\nBut we have no issue going back out there again to confirm that the pop site is open if the pop site is closed, we can't issue a violation of the owner, but you can notify the appropriate group that they're still in violation and that's what we need to hear, because we do not want our residents to be not denied any of the limited open space that we have.\nI mean the pops has been a major issue for us in the community, with many sites not being available to based on our study to people in the community, because even the buildings did not know that they had a pops.\nOne of the questions in our study, was: do the people purchasing in these buildings understand their responsibility to pay for a pops, and it's been unknown, but we'd appreciate you going out and making sure we have as much open space at this point, as is needed.\nMe, Tony's has been a committed member of the Upper East side community for almost 30 years, we've been very supportive of every faith- based organization, every school, whether public or private, local hospitals and charitable organizations.\nIt takes a long time to get your approval on the pops, but this Covid-19 thing is recent and have you come up with the standard for all the pops that you've notified them about that they have to post for distancing and mass I'm asking what the city is.\nBecause I have another plaza in Yes, I know, but given whether it's Covid-19 or not, these pops are be open to the general public and when you are perceived by the public as not a public space, people then do not enjoy what we were forced upon by the changes in zoning with the development rights.\nThere was no sense on my part at all or the other adult who was with us that in any way were we made to feel the least bit uncomfortable as the public using the space thanks maggie, you have three board members with their hands: up: It's, a time where local institutions are literally dying every day and going out of business due to cobit and all the impacts of it.\nIf you wanna, okay, I, just wanted to say that the community is an absolute support of our small businesses.\nOne seventieth on third East mid eighty, fifth, okay, I'm, going to write down 70th and third, because that one, I did not get a question for you just want to follow up on the illuminated sign, request right and the state, and you raised that banners etcetera are permissible in residential communities.\nThis is a really good opportunity to look at the city while it's undergoing so many changes, and the reason I brought it up here is because if it were voted on in zoning and development, because it is a question of development, then at the community board it would not take up new business because our meetings run so long, but we could do it at land use also I mean for me.\nNow, I think it's a really important idea: We should be considering the fact that there's going to be a new mayor in a year and a half, And. So maybe it's not right now, but at some point it would be great to take this up, because we do need comprehensive planning all around the city.\nSo we wanted the community to know that this indeed does not fit in the zoning for 67th street, but that something is being proposed and we need to know- But we wanted to alert the community that something is a coming from the blood center on 67th between second And I must say: I think we did- handle the northwell issue and the tower on Park."
        }
    }
}