{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UCEAZeUIeJs0IjQiqTCdVSIg",
            "title": "Exonerated Five Task Force Meeting",
            "publishDate": "2020-06-29",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 8,
            "um": 17
        },
        "wordCountFullTranscript": {
            "people": 114,
            "terms": 66,
            "community": 65,
            "things": 56,
            "space": 54,
            "panel": 48,
            "exhibit": 47,
            "discussion": 37,
            "park": 37,
            "meeting": 36
        },
        "wordCountSummary": {
            "people": 18,
            "space": 17,
            "community": 15,
            "terms": 15,
            "things": 11,
            "park": 8,
            "exhibit": 7,
            "project": 6,
            "committee": 5,
            "letters": 5
        },
        "fullTranscript": "Before - all right, I'm on now it's doc die McGill is on. The call right is that Miguel on your committee, you I just want to apologize in the next couple of minutes. So please bear with us. Thank you, everybody you! We just want to apologize to any board members who are coming on you, okay, I'm, sorry, I just want to apologize the now the meeting announcement went out to all of the board members in error, so we want to apologize for that. It's a meeting just for the subcommittee members of the exonerated five Central Park exhibit task force, so we're just going to wait a few minutes more to see if we get any more participants and then we'll begin- and we won't keep you too long this evening. Thank you for your patience. You, okay, I'm, just going to briefly share the agenda. I! Don't think it to get it out in time. So here is the UH you see if I can share it. Hello, you, okay, Shoetique! Would you mind sharing the agenda? Can you see the agenda? Karen? Yes, I can see it. Okay. Can everyone see the agenda? Yes, okay good, so this evening, we're going to I will do welcome, welcomes and introductions, but we are looking at The Exonerated five, an Associated exhibit in Central Park subcommittee. This is our first meeting and this is a discussion and we'll begin with a recap and then we'll have begin talking about public panel. Just discussion planning will do any updates and next steps, and so does anyone have any questions about the agenda. If you do, please raise your hands, raise your hand and we can go back to the to the gallery view Chiti. Can we go back to the gallery view? Hello? Karen? Yes, can we stop screen sharing? We want to stop okay, yes, okay, hi, everyone! So, finally I'm! So sorry, we had a lot of technical difficulty and these things happen from time to time. So Stephanie. Would you just like to introduce yourself unmute yourself in it and make it and introduce yourself? Thank you Karen. My name is Stephanie Palmer and I'm, the parliamentarian for community boy. Ten. Thank you. You're welcome, Thank, You, Terry wisdom. You have to unmute yourself about that. Okay I'm good afternoon. Everyone and I am a new board member on community board. 10 and I've got to join my committees, but I'm very interested in participating in this subcommittee for the exonerating fine. Thank you so much too honey good evening. Everyone - honey abou. She are also a member of community for 10 and civil rights attorney here in New York City Thank, You, Charles I'm, just joining so I'm a little behind so good evening. My name is Charles. Powell I am the second vice-chair of community board tan and also the chair of the Housing Committee, and grateful to be able to join this conversation regarding our beloved exonerated thought: Thank You Donna, Gil Donna. Would you introduce yourself yes, housing and Health and Human Services Committee? Thank you and Shannel shanell. Would you unmute yourself and make an introduction, I think Karen. It seems as if she's still trying to connect the audio yeah, spinning. Alright, our illustrious chair, Cicely, Harris Cicely, doesn't have audio, ok and now we'll move on to our guest. Mrs. salon. Would you please unmute hello, I? Oh good, ok, I'm! You self, please! Oh I'm sure on Salam, the mother of Yusef, Salaam and I want to say right now that some of our members from our supporting group on the committee we're not I'm not able to attend because they weren't able to switch their schedules around, but in any that we are still here in spirit and removing full speed ahead with the committee. Thank you and we have Daniel Patterson. Would you please introduce yourself? You have to unmute Daniel and meet yourself. Oh good evening, everybody, my name is Daniel Patterson I am a guest and I am honored to be amongst all of you for this purpose. Thank you and Rebekah Brown. Thank you. Would you please unmute and make an introduction door hi good evening, everyone I'm Rebekah Brown I'm, the director of policy with the Innocence Project, just here representing the project in full support of this anything that we could do, and you know we work in criminal justice reform as well. So, to the extent that you know the monument is accompanied by any educational stuff, we would love to have a role in helping to shape some of that work on wrongful conviction. Thank you. We have Prince hunt if you wouldn't be unmute and introduce yourself please. Yes, can you hear me? Yes, okay, yes, princey hunt, I'm a member of wrongfully incarcerated, jwi and I'm here to support mr. long and how you know in any way. I can in regards to that. Thank you and who else do we have? One have I missed, miss janae, ordinay Vidal. Would you please unload transcriber she's a transfer? Okay, oh great, with an AB transcription and this [ __ ] chanel is still not available and I. Think I think we've covered everyone and let me introduce myself. My name is Cara nori and I'm, chair of Parks & Recreation, and thank you everyone for all of your patience and for being here. So with that we can start to share. Can we share the screen for the keynote the PowerPoint fatigue? Can we make it fullscreen start at the top? Okay? So we've got to have a little that the screen is not as clear as it should be, but this is The Exonerated five and a printed discussion on a permanent exhibit in the Central Park in Central Park should see. Can you go to the next slide? I'll, try and so hold up. Do you see the next slide? No I see it on my end, no I, don't see it, don't see anything changing no slide now. Okay, now I see it all right. So, okay, so at the last meeting on May 26th we just to recap: we discussed that this was going to be the start of a multifaceted journey and issues that we want to keep in mind that whatever this exhibit turns out to be or develops. It should be excuse me it should be. It should prioritize the perspective of The Exonerated, five and their families and what matters to them. It should include a diverse dialogue and be as broad a group of stakeholders as possible. It should exemplify strong community engagement around the possible things. Social justice concepts and exhibit content project should include the city, side, focus and social criminal justice aspect. It should define how the abstract can be brought to the concrete in the form of a permanent exhibit, and it should specify the content of the exhibit as an outcome of the subcommittee's work. It should delineate how the exhibit will meld with the countryside. Intent of the park because we will be we do have to work with the Central Park Conservancy in their mandate, is to make sure that the park is a countryside experience and it serves the purpose of its original intent. The project should engage people in thinking together how to work through the message to be conveyed by the exhibit and how can voices and opinions be reconciled city? Can you go to the next slide all right and on to seek the 10th of June at the outcome of our meeting in terms of next steps was first to find out what the status of the RFP, the Lincoln Correctional Facility, located at 31-33 West 110 Street, and to find out who was on the Community Advisory Board for the RFP process? Next item was to circulate the resolution to key stakeholders and facilitators, then to identify and invite youth participants and subcommittee members. The resolution was to be sent to the president. The land use committee was going to offer support in terms of an amendment to our current Parks and Recreation resolution, and we discussed launching a massive media campaign and gathering letters of support. So we could just go over those items and in terms of updates step here, but in terms of the RFP with the Lincoln Correctional Facility Charles came on the meeting this evening and I'm hoping he'll be able to speak to that Charles. Can you unmute one on you? Oh thank you. Am I immune it now? Yes, you are so Karen and I had a good discussion about what's been going on with Lincoln correctional. There was a point in time as they send in a Brian Benjamin, along with representatives from Empire State Development Corporation was seeking to gather information from our community with respect to what would happen with Lincoln Correctional Facility following its closure. As everyone knows, that is a state facility and therefore the land is owned by New York State. So there is a you know, a process by which I think has been on pause since early. You know discussions, you know pre Covid-19 19. You know just to say that what should go there I think. The only thing that I can say you know that you know everyone agrees on is that it should not be some kind of market housing. You know we've heard from the rosies group. You know the former rosie singer of that correctional facility and you know Rikers Island, the women's Correctional Facility about a re-entry program. You know and I know that Karen you know as indicated that members of the alcohol them the Harry Belafonte group, you know, has been meeting you know and the gentlemen in Karen I haven't gotten around to sending you the contact information which I'll do his name is Marian syllabus Marian Phillips has been communicating with Curtis Archer, who was our local representative of Empire State through the Heartland Community Development Corporation about what's contemplated or plan, but I think over 19 has really impacted. I've not heard my Sicilies on the call and I know others may have some better information, not heard anything about what they're planning for Lincoln Correctional site other than the consensus that everyone agreed to from a threshold consideration that it should not be some form of you know of market rate housing. As you know, that's right there on Central, Park north and there have been numerous developers that have been trying to weigh in so what it will become. And what is connection to you know our exonerated five, you know exhibits, you know I. Think Karen, as you and I spoke a couple of days ago, I think it's a TBD but I'm more than happy with Lloyd Williams in the great Harlem chamber. You know to weigh in I've asked him to give me an update and schedule something with this group where mr. Phillips or a senior representative from Empire State Development can come on and tell us what you we should be doing to try to connect the dots between the exonerated five exhibit and what's contemplated for Lincoln correctional, as I said to Karen the other day. I am prayerful and hopeful that this tremendous you know initiative for The, Exonerated, Phibes, permanent, interactive, exhibit in Central Park does not get waylaid or dragged down by whatever is gonna happen with Lincoln correctional I understand connecting the dots but I'm just suggesting that you know we are full steam ahead in this particular train for the exonerated five I'd hate to see anything be delay on the basis of what will happen, then, with Lincoln correctional, so Karen. That's, basically a summary of what you and I have spoken about. Thank you. So much Charles and I just like to say that we did who were sending the resolution to Marion Phillips. We did were it. We were able to get some contact information. She cheek did that go out the resolutions- yes -, Marion Phillips, oh good, okay, so that went out to him and then I just like to say thank you Charles in it, and this is teamwork, makes the dream work. So we also asked echo dev to become involved, because this may become an issue that echo dev would have to deal which side I'd like to ask you Nell. If she could speak to that, Charles was saying in regards to the plans, so I just want to make sure I'm hearing correctly this the project for The Exonerated five, that is gonna happen in Central Park separate from the Lincoln project. Yes, there are two separate issues right so, but somehow I'm I will just want to make sure what I'm hearing is that the Central Park exonerated project once they include some sort of thing happening with Lincoln right would like, for whatever exhibit that takes place in Central Park to be interactive with the Social Justice Center right. Are we for sure that it's gonna be a social justice, Center and I heard mr. Powell mentioned that all these people, who I'm just gonna, be honest with you, I'm boring I'm born and raised in Harlem I grew up on 107 I was one of those kids who parents would not. Let me go on into the park, because what was happening in my neighborhood but to watch all these other people have opinions on what should happen, and you know people like me sit on the board, so I am from I. Am a cloth of this community and I sit on this board, but somehow someway these things always get decided by folks who don't live here or are not from here or have no idea what happened, and so he mentioned a few groups that I'm very familiar with, but I'm also familiar with the fact that they're not from here so I'm interested to see why they have a say. So what happens? Well, I think we're at a point where you're having the discussion and we are having input on born. So is there any way that I can? Is there any way that I would be able to that? You would be able to be on whatever committees they have going on about that I'm. Sorry, what's your question again, you own the committee's that they're speaking about in terms of state or whatever they are talking about. Well, are you do we have representation and Charles Powell? Is our representative from CB 10 Charles would like to speak to that. So, let me just say: Chanel I'm gonna. Everyone hear me I'm in total and complete agreement with what should now just stated and that's what I should know. That's what Karen and I were talking about. I think the whole situation with Lincoln correctional is very convoluted and it does not reflect how we at community boards and like to approach things I. Think it's really. You know the reverse process. You know and what I've been saying to everyone on behalf of CB, 10 and Cicely Harris has been involved with those conversations, whether it be to the chamber or to the Belafonte group. You know that they've not gone through our process and that's why I was really saying to Karen I'm, not sure whether anybody is really Chanel being very intentional about it. I think they've just had some very ad hoc - luminary conversations, but they haven't gotten to us yet and when they get to us, that's where you'll come in as chair of Economic Development, you know where I'll come in, you know and others you know on our executive committee, you're, absolutely correct, I, don't think that that's anywhere near any point of real, you know planning and that's what we've said to them. Don't issue an RFP until you've heard you know from us and I think: that's actually what has happened so I think we need to bring mr. Phillips in you know all the governors representatives in and you know, answer some accountability as to what's going to happen with that site and that's why I said that as far as I'm concerned, the exonerated five project is a train that has already left the station and the Lincoln correctional project is one that hasn't even gotten to the station. Yet that's all keeping it separate right because I agree with Charles that you don't use the exonerated five project trying to run after Lincoln, because negative gonna be a mess and everybody would claim it because we're in that space right now, everybody's gonna want a space in that building. You know that's going to be a mess, I think the question Karen. This is Stephanie and so and I heard you know, because I've lived at a hundred and tenth Street since 1985, and that facility has always been housed by people who look like us who look like me and the thought that it would somehow displace. That is sad and it and it for me personally. It breaks my heart and I hear Charles in terms of being practical and there's a part of me that here's what you say that we need to separate the two, because we don't want of this important project to get caught up. I. Just you know the eternal optimist. Can we do both things? Can both of those trains run together? You know what I mean I would not want it to be held a bustle, but I would not want to miss this opportunity. I can't think of anything that would be in respect to what has happened in the community. What that site represents and changing the whole the whole debate in terms of what that site, what it was and what it could be so I just want to you know, is there some space for us to not back off completely? Let me just say that is exactly the and that's why I'm following what Chanel says, look I said the caring in a conversation you know earlier in the week the exonerated five you know project has taken on. You know a life that really we are. You know very grateful and thankful. Cicely Harris presented that to the borough board meeting where all twelve community boards really receive this perspective project. You know as something that the buy-in is there to buying is from the borough. President. The buy-in you know is from the various community boys that are responsible for Central Park I. Think the articles that have been written all I'm simply saying is that, let's make sure that we don't get held up in terms of what's happening with the exonerated five and, of course, we're gonna make sure that nothing happens at Lincoln correctional. That is our community board district. That is our community, and we will not, you know, go peacefully, you know you know it with respect to anything. That's gonna go on with that future development. What I'm simply saying is that with New York State in covert nineteen and budget considerations, I, don't know what's being planned or contemplated for Lincoln correctional, but I do know that the great work that's already been done and what will continue to be done on this? Yes, exonerated five exhibit should not be held up. That's all you hear me saying we're not going to miss the boat in terms of weighing in on Lincoln. Let's not tie them together right now, because that's what you now was saying now we get handcuffed, and now we get caught up in bureaucracy and that's not what we're looking for in terms of the exonerated five exhibit in Central Park. No and I appreciate that night and I understand we spawn I understand that we could keep them untie I'm, just gonna, the eternal optimist of me and at the wrists of seeing the disappearing. Can we at least keep that other tie like close by yes and I, just like I, say I had a preliminary conversation with Chanel and understood that Central Park Xzibit is the purview of the central part, the parts and recreation subcommittee, and that that's why we moved to the more appropriate committee for the correctional facility. So Chanel and I talked about developing a resolution which would be presented at her July committee meeting. So we are running two separate trains here. We've got two separate tracks, so we did look to make that happen and in terms of moving forward this the initiative of this subcommittee, we are making a lot of headway and I think it's excellent. Thank you so much Cicely for presenting the resolution at the borough board meeting, because we do need the support of the surrounding boards, the other surrounding boards of Central Park. So that's a great step and thank you so much for that. Is there any other discussion and the reason why we're talking about the Lincoln correction of Correctional Facility is because that was an outgrowth of our just our last few discussions and we had some questions and we're just following up on those questions, but like Karen and or two separate tracks, because that facility is going to get nasty I'm just with the people that he just mentioned involved I, don't trust anybody he mentioned so you know, and they don't trust each other. So it's going to turn into a mess it's starting out as a mess, so I would like to definitely address both or separate tracks, so I'm not saying he shouldn't address it or that I would but I'm just saying. If we can yes, that'sthat's understood, that's understood, Chanel and I certainly agree with that agree. Yeah. This is cherry. Wisdom, I, think if he can be separate but equal' that work so that we're working on both tracks but I question I saw that an article came out. You know stating that the community board 10 is moving following. The resolution has been cast. You know for us to move forward with the exonerated fire project and, in my understanding, in the last meeting and I'm asking it for a reason- and you know if we are there, we had some discussion about putting out, in fact that we wanted the Lincoln facility to be the Justice Center to the community. Just so we could get some traction and get some people behind it, and you know I didn't know if that was now ready to go to the public, because you know I, write and post for Harlem Network News. If that is something that could happen, you know, then we should have a platform to get it out there and get the drumbeat, because I think that I mean it has shown just in the different protests and things that are happening all over the country and all over the world. Certain things that didn't happen turned over in 48 hours. Suddenly we have, you know giunti, that Jim T is now a state holiday. So I think you know, if you have people behind you and people know what's happening right now. I mean you know, we're driving a train and we should drive it. You know as long as we can and as hard as we can I just wanted to get some understanding, because I know we had spoken about that. But I didn't know if we were actually you know doing that in a structured way to roll it out, and you know that may be ahead of the agenda, because I saw it as a part of that meeting. That's what I had to say. Thank you well I would say Terry Emery. In response to that, we are planning to do a resolution in Echo dome, which will come up in July whether or not we do something in terms of that. I think, certainly having a resolution that we can say that as a full-bore, we support the use of what would the use were suggesting for the facility is very significant. So if there's anyone add to that is Sicily. You know I'd like to assist leader because Sicily and I mean, as our chair and I'm second vice-chair if Sicily is not going to be able to respond to it, I work to Terry's point that you know the point of the matter is you're talking about linking correctional. You know in terms of what is the overall project going to be and tell hurry. We have not taken any sort of position on that other than a number of organizations, and you know even the borough president has presented things before us, but there's not been a firm resolution or decision by the community board as to the overall picture of linking Correctional. What I'm hearing in terms of the exonerated five is that whatever is going to happen there we'd like for that permanent exhibit to have an extension? You know you know that would encompass the possibility of linking correctional. That's what I meant by it being so premature. We don't even know what the overall plan of New York State is for the utilization of that space. You know whether it's gonna be you know. I've heard the Justice Center I've heard museums, I've heard you know civil rights, you know you know Museum, none of that has in fact been solidified to the extent where it's ripe enough for us as a community board to even weigh in so what I've said to Karen in terms of this particular subcommittee. Let's not you know, get bogged down. Yes, of course, I think it makes sense that whatever we do in Central Park, we want an extension to Lincoln correctional or an extension to the Museum of the City of New York or an extension to any of a number of things that are contiguous. You know to Central Park to make it vintage istic, but we haven't gotten there yet is so far away that all you hear me hear us saying as a community board, the state hasn't determined what its gonna do. So we don't even know what our ask is going to be I, just like to say also I just like see also in terms of continuity with exhibits in the park. We could also tie in the Seneca village project as well at some later point. If we want to talk about connection and social justice, which that is a social justice, was a social justice issue as well, but is that some is everybody? Okay, when we had the other meeting, I know that there was discussion and I may be misunderstanding it that's. Why I'm asking for clarification? There was a point where they were saying like RFPs may have already been out, and if there aren't RFPs, they can't go back, and then there was other discussion that was saying. Okay, you know this project is extremely important, extremely paramount and it deserves to have that space and that I was thinking that whatever project it was, it was something that the whole task force was going to create out of something for The Exonerated fine and they would have multi things. I may have misunderstood, because I didn't think that we were doing it trying to fit in. You know. We had said as I thought aback that story, that if, in fact we didn't get it, we didn't get control of it. We weren't able to create the whole scenario that if it we wanted it to be like a Justice Center and at least it was something that we could fit into. I may have misunderstood everything, but I was thinking that we were trying to get the building and create like a whole surrounding project that had to be exonerated five that had libraries, museums, places. Kids that come you know, so I may have misunderstood that. So that's why I'm asking for clarification, because I thought we were trying to move past in this environment that we're in to get something that might be more gettable and doable now than ever just given the environment, so but okay, Thank, You, Terry I, just like to say that the focus of this subcommittee is the exhibit in Central Park, oh yeah, and if you, if you just read the notes, the minutes we this just came as an outgrowth of the computation, but our focus and that's why we're saying we're looking to move that aspect to Echo dev, because that's not within this Committee's purview. Okay, that's our focus is the exhibit in Central Park welcome. Okay, so I just like to move along to the next item next bullet, which is the resolution being circulated to key stakeholders and facilitators and that we have done we are we sent requests to the ball president and should be getting a letter of support from the president. We spoke with the community of Community Affairs Division at NYPD and we're expecting a letter of support from them. We've also are going to reach out to the n-double-a-cp for a letter of support, and these letters of support will go to the Central Park Conservancy in the New York City Parks Department, stating that this community would like to see this project in the park. Next item was to identify and invite you to participants and subcommittee members. We have one young person who's being considered right now and if there's anyone else would like to suggest a youth participant time, and this person is from this high school senior at Thurgood Marshall High School. So we are looking for any other youth members, preferably from the community who would like to serve on the subcommittee next item. We did, as I said, we sent the resolution over to the president's office, the Land Use Committee, supportive amendment to the current resolution, which we voted to do that. But then, as a later discussion with Charles and with Chanel, we decided that land use would not be the appropriate committee. It would be echo dev, so we're gonna work with that. Go demo on that. Launching a massive media campaign was an item which is that has begun and also in terms of as I stay. We ask for letters of support from different agencies and will continue to reach out to get more letters of support should see. Can you change the screen? Go to the next screen? Okay, so our next item would be a. We had talked about doing the public panel discussion for the exhibit and the focus with, and we would like to determine what exactly would be the focus of that question. The focus question or questions for that panel discussion a date and time and of course, who would be the panelists that would be on that public panel discussion, so I'd like to open it up. We haven't heard from our guests: is this someone who would like to comment should see? Can you see if anyone has their hand raised I can't see at this point, the Karen before you go on to this particular slide? Can I just go back to the earlier one, and I certainly want to hear from Rebecca and others. You know regarding this panel discussion, I think getting to what Terri was really talking about in terms of timing. The one thing I don't see in that particular list of things to do is taking you know advantage of the opportunity that currently exists within ourselves to really talk about money. All of this is going to cost money and all I think that we have now seen you know. You know that discussion about wealth, building and I'd like to add that to the listing that we should be talking about some comprehensive. You know fundraising outreach with respect to how this is all going. The way itself out. This is a golden opportunity and that's why I want our focus to be to be able to say that we want something magnificent. We want something amazing. We want something: that's gonna cost a lot of money and guess what there are lots and lots of companies now in LA of organizations and lots of others who have the ability to really make this happen. I know that drama always with the Central Park Conservancy. You know and I do not want us to be limited to the city of New York or the Central Park Conservancy in terms of how this thing is going to be funded. So could we add another item to that earlier slide? You know that really just talks about funding and you know and fiscal fulfillment. Well, yes, Charles! That was a recap from the last meeting. So that's why you may not have seen you didn't see that listed, but that would be something we could put as a next step and I'm, not sure are we I don't know as a community board if we can be involved with fundraising, that's good. It's Sicily consistently speak to that the community board, especially, is they, of course, that one I'm not really talking about the community board? Doing it I'm simply saying that we're the expediters and facilitators of identifying sources by which they will be both public and private sector funding? That's all you hear me hear me say it's just something for us to try to engineer, and that goes to what I am dealing with in terms of Terry. You know, and the ability to media or through outreach to the community to be able to say you know how is this going to be funded? You know it's just a question that we can at least raise the question, we're not the ones giving the answer. Yes, so we'll put that as a next step. Thank you. Okay. Can we hear from some of our guests or I was just gonna mention on the public panel discussion? If it's helpful, you know I mean obviously I think we want members of the exonerated five and Musallam you who's been such a visionary on this one thought that I had just in terms of an expert and I. You know again, this is for everyone to decide. I mean oh and just on letters of support, too I was wondering if the Schomburg Center had issued one, because I thought they might be a great group to engage on this. But aside from that, there's an amazing guy that we've been collaborating quite a bit with his name is Vincent Sutherland and he runs a Center on race, inequality and the law out of NYU, but he is just he has dedicated his career to advancing racial justice and civil rights. He used to be at the N double ACP, Legal Defense Fund for many years and he's just been phenomenal. We actually worked with him on a panel recently around criminal justice reform in New York, and he just is wonderful, so I mean I. Obviously, there'll be many ideas and I'm not saying it should be him over anyone else. I'm just saying he might be a great person to consider. He was just great at contextualizing the entire system, and did it really well I think for a lay audience at a recent event that we did and he's you know, he's just brilliant he's funny. He you know kind of I think is very charismatic and you know dynamic, so I thought he would really be a wonderful possibility to think about ok and Rebecca. He could speak to because our discussion would be about what this exhibit. Wouldn't the contents of this exhibit and what message we trying to convey and what education were trying to put out there. Absolutely. He knows the case intimately and in fact you know was- has sat on panels with members of the exonerated five before and you know he's he just is you know he knows his stuff so deeply, and really just you know, I mean he's done. Everything from you know, sort of advocacy efforts around race and policing. He was the lead counsel on school, desegregation and employment. Discrimination matters like he's just very steeped, in how all these issues kind of come together, but he really knows the details of the case. He would speak brilliant, Leon it and part of why it was thought it'd be great, is because he's also a lawyer, so he could talk to some of the things that went wrong in this case. Fundamentally, well, yeah he's just great he's a racial justice expert and he's you know, I, think and based in New York. You know he's a New Yorker, so could be just a nice guy in a nice addition, but that's just for you all to consider. There are many great people yeah, so we could, if you could give us his. Perhaps you could help us with contacting, of course, anything so I mean I. Just I'll wait to hear from you for the right, but whatever I'm happy to do it. Okay, thank you! So much Rebecca. So that's that's another next step. Any other suggestions, yes Oh, sir! So Jerry. Can we excuse me Terry? Can we hear from mrs. Salaam? Yes, I'm not familiar with this screen? Oh, we can hear you it's so different. Okay, well I've been listening to everything that said before you have listen. Does it would be a good thing in terms of that I? Imagine when we're doing something like this we're going to open it up as well to the community to get some sort of community involvement, and, in this conversation regarding you know, what's going to be happening, not necessarily what's going to be happening to invite them in to participate with in the conversation once everything is set up, and you know in working towards getting a time of visibility and all that kind of stuff, cuz I would imagine it would take what a few weeks to a month or so to kind of pull all of this kind of stuff together and to have one on board. I know we are very interested in participating it with the Central Park five we're interested in participating. We all have ideas in terms of how we see this type of any of an exhibit being something maybe not necessarily like strawberry fields, but something around that type of issue where people are drawn into the space and there are different things as happening within the space that are that people can go for once comment to another and, let's say, grow within the space and come back and experience different things at different times as they interact with a space and its surroundings. Within that heat within the park and I. Imagine it would be good to have other people on. In terms of you know, people who are able to do these types of works and pull these types of things together against structurally and trying to figure out even a site for it to be within the park, becomes kind of I. Guess part of these strategic planning kind of thing, because I know right here: I get intense street when you enter the park, it's very tight in those areas around a hundred, [, __, ] and filth is tight. It is tight around also tight, around Linux Avenue, when you're entering, because you like have little small entry ways so like when we're looking at it and where it would be in the fall Mendy and then how people would be perceived within the space to tell whatever story is being told and to try to educate in an ongoing way how this is going to work and how people are going to see it, because we want something. Also, that's going to be. You know useful going down the road so that when people come into the park- and they see what's going on, they experience the park and years from now they can also come and have an experience within this same space and later on, bring their children to the space and have an experience as well. I see so we're looking to so you're thinking in terms of not just only content but logistics, yes, yeah, and just how people interact with the exhibit and with and getting and gaining an overall learning experience from that's right, because I would imagine if you had an idea regarding the logistics. It helps you to kind of put more of an eye on the space, because you know where it's going to be- let's say five by seven I'm, just making up space now, but you know a five by seven ours. You know it's going to be a hundred seed around. You know how big a space you're dealing with when you're. Looking at various things, you know if it'll have be able to contain a seating space or a drawing board, or you know if, let's say, if you're doing statues, if statues are high, if that statues are low, are they able are the children or people coming through able to touch these statues, because sometimes the size makes it more humane, as you're looking at a space and if you're interacting within the space, you know all those types of things in terms of how the space would work within a specific area within the park. So would you fit into our community's perspective because you'd still want it to be something that speaks to the Harlem community and what our perspective is on these issues? Yes, so what are you saying that we should have some sort of sketches some preliminary drawings as part of the public panel discussion, not necessarily, but you know just and like if we go to the parks department and if I ask them regarding specific types of locations where this could possibly fit in. That might be more helpful than the sketches itself, because the sketches I would we'll take it to a different kind of another level. Beyond the this you know likes, it would take it at us into planning. So right now we're just looking at the space getting a feel for the space itself like where would it be because I'm, you know like right here across on the parks when you those faces, are kind of tight want to be opened up to contain the space? Then you have the Conservancy there. You have a mirror there. So it's hard to have it, let's say across the street, because you have that whole mule there and that exhibit. Is it gonna be on the other side? You know right. How is it going to fit where well I think that's the discussion. We'd have to have with the Central Park Conservancy yes, so we could have them as a panelist. Yes, okay, missus just said because I think crystalize, you know an incredible. You know next steps I, for example, in early March I was in Montgomery, Alabama and I. You know was that Bryan Stevenson, you know both the equal justice initiative, both Memorial and Museum, and now all of a sudden and based on what mrs. long said. It now makes perfect sense in terms of she just gave us an insight as to some limitations of Central Park, you know, and that now you know, I mean a light, went off in my head to be able to say that's the extension to the possibility of a place like Lincoln correction, because if you've been in my gun, if you know Brian Steve's, there's equal justice, you know there's a tremendous. You know the lynching memorial and the exhibit and everything relating to it is so transformative. But it's all Museum in the different location and so I think she just crystallized the fact that we need to bring together this community board, and this subcommittee needs to be a facilitator of conversations with. You know people that have engineered and you know and created these spaces. You know whether it be you know our you know: National Museum in Washington or whether it be what happened in Montgomery or elsewhere. We need to be the facilitators of bringing those people together. It is not just a conversation would have been services, but we learned that Katerine, you know from what we were dealing with it with Seneca Village. We need to bring to them what we're talking about and that's where the resources are. That's where the outreach, that's what I meant by being able to say reach out to the people. There are people who do this every day. They know how to plan a space and they know how to plan an exhibit and they know how to plan a museum. Let's be the outreach, that's all you hear me saying, and you know our dear sister salon, you know just identified. You know it's not just about you know kind of brainstorming, it's about resource and people, identification that can make this thing happen. So I just like to say to that Charles that Seneca village was driven primarily by the Seneca village project. They had a lot of input. Central, Park Conservancy did assign a specialist to work on the project as well, and so the community did have input. Central, Park Conservancy has taken an interest in what we're doing the senior vice president of Planning has attended some of our meetings, and so they are waiting for us to bring to them something that we would like to see done. They do, however, have a lot of jurisdiction within the park as to where things can go. So you know we do have to take that into consideration, but they we are being proactive in the sense that we're bringing to them in terms of the exhibit carries nothing. He has her hand. Thank you. Yes, I just wanted to go back to the idea of recommendations for the panel I. Think that again what Charles and you know Salaam said it had to do with looking at visioning for the what it might look like I think it might be great to have some sort of renowned artist or designer serve on that panel. Who can begin to talk about visions. I agree with this I go into the planning, but just begin to blue sky. You know in terms of the creativity what it could look like and then the second thing and I may have to defer to you, know Terry wisdom on this, but I think someone from the mainstream media I think one of the things that had a significant impact was the way this was portrayed by mainstream media. You know, and so having somebody you know from that community who is knowledgeable and insightful I think would be an idea for panelists as well. Okay, would you have any suggestions we should reach out to I will do research and get back to you if you'd like okay? Yes, that would be great excellent. Okay, so a media specialist, well I, have a question regarding the media specialist. Would that include someone from the Amsterdam news or you're talking about different types of media specialists? I think the Amsterdam would news would be great I think the times would be great, because I think that they for me, you know we're sort of complicit in the way that this was presented during that period. You know: how does that kind of stuff happen? How does it affect a community? So I wasn't thinking of anyone, but maybe there's I think there's face and if Karen and you guys on the task force, think so to have more than one representative. Okay, some suggestions I thought that what miss sallam said was very clear. It was very succinct and it covered everything and the notes that I took as we were you know just listening is that we need an artist. We need a writer, we need a logistics person. We need a historian, we need an architect. We need somebody from the parks department, you know from the other side of it, but we were talking about people that are involved in the justice system. Columbia University has a restorative justice center and one of that works and teaches at the restorative justice center. Her name is Greer Ellis and she also runs the Exodus program at Abyssinian, Baptist, Church I, think you know somebody from that which restorative justice program, because that program is set up where anyone who has been formerly incarcerated can go to Columbia and get a Bachelors of Arts. You know for free and there are a lot of people that are part of that program who have been formerly incarcerated. You know some for like 25 years and they're just like 45, and now they have like their doctorate and are doing stuff so they're in the mainstream, but I think when we start talking about media, we need to make sure that our media is there like. The time should be there. You know yeah, they should you know because it'll get a lot more traction, you know, but definitely our media, because there's like a black out just me, working with all the network news, a lot of our stuff that happens up here. It's major, even New York one does not cover. We had a March last Sunday with 2,000 people that the clergy day and nobody covered I was out there covering it. We had something at Harlem Hospital. That was major. You know with drum drumming, and you know the police department on horseback. They did not cover it and Associated Press it and pick it up. The media is selected if Harlem is burning down and somebody is being murdered. That's gonna be major news. You know so I think we need the major news, but we need build. Our news is gonna. Tell our story and I think that that's very critical I, you know I'm just thinking, because I think is very exciting. What miss sallam said, because you do need all those experts, I think the Schomburg. That was a good idea to have them come in, but we know that, even in terms of some of the things that have happened in the selection of different museums, even like the Civil Rights Museum, we need to assure that people of color are involved in this. There are many experts around the country that are artists and writers, and this is something that you know needs to. They need to have input and be conscious and be involved. It needs to be conscious. People, not just people that you know on the front, is a billboard for the black community, Thank You Terry I, just like to say so. We have some ideas like to have as panelists, but I just like to go back to what will be the focused question that we would like for the panel to consider and is there anyone any of our guests would like to comment or board members. Okay, well, I can't see where it was. I was going to say that was affected indirectly. So I remember thinking to myself, while they were giving their presentation wow they're, going to fix this part up. So nice and people like me, who grew up and couldn't go into the park, because my mom was in total fear, because what had already happened, I won't be able to experience those experiences. So one is there a way that we can make sure that it is affordable or it is free and accessible to young kids that are in poverty, because the story was about not necessarily in poverty, but young people from this community is there a way that we can make sure that the exhibit is free, a - that is a technology component to it in terms of interactive right part of what happened in Central Park five circumstance was not with information right. Families might not have been informed of the laws and things like that and what came out of Central Park five was a lot of Lords, so I think those should definitely be highlighted and somehow incorporated in some type of technological experience where young people learn about what laws came out of that experience and what happened and what's in place now from that experience. So I just wanted to say that, like ten minutes ago, so I know it doesn't speak to what you just asked. But I have my kinetic race, so I just wanted to make sure I got that and okay well should know. That was very pertinent and very enlightening and I just like to speak on our as a committee. Our experience with the Seneca village project, which is its which is digitally interactive. You can go in East, kids scan a barcode and you can get information historical information on that area and there are I picked. There are 12 signs or 12 or 13 signs that are around the footprint of the where the village existed, so you can go and you can stand with someone's fine ones or will want someone business or you know that sort of things. So it is interactive, excuse me, and it is free, it is a free exhibit. There is a paid tour, that's associated with the exhibit, but you can just go on your own. So this is something that you know. This is a format we can look at, for this particular exhibit right, yeah, I'm, sorry and then the last point was the African Museum that is across. That is empty. That keeps being used for everything other. And what see the thing is that I'm, the young girl that grew up in the red building next to it and so I watch my neighbors fight as I grew up for that garden and the only time they decided that they would give up the garden was because they told them that it would be an African Museum. So we all know there's no African Museum there is that any way that we can get that space for and that's an issue and that's why we're bringing it to your committee facility, but our focus is the exhibit in the our Ohana okay, in terms of what we're going to do as mr. Lumm, so craftily said, where we're going to have this memorial is something that we're going to have to figure out, and we have to keep in mind that the conservatory already has plans to redo the harlem mayor and the director skating ring. That's right. There by hundreds of 10th Street, so they're already working on those plans, so I think we need we have. We need to speak to everyone, but we also need to figure out where it is that we want this exhibit to be because we have to think of a space, because you know that space would close to the Harlem is going to change dramatically and they've already they've come to the community and they've already started working on that. So that's a consideration that we'll have to be thinking about when we're thinking about place where we want to be that missile arm could choose that space. Well, whatever we can have a discovery, can't have a discussion about the space selection, but whatever goes on has to be sanctioned by the Central Park Conservancy, and we have to have that discussion with them. As I said previously, they have. They are I'm very interested in what we're doing and they're waiting for us to come to them. We ask that letters go out from elected officials such as the borough president Gale Brewer, and we're looking at also getting a letter from Senator, Bryan, Benjamin and whoever you know we can get letters from, but and also we're getting we reached out to the DA's office and NYPD community relations and those letters will go to the Central Park Conservancy, expressing that we as a community want to see this exhibit. So once we engage the Central Park Conservancy. Officially, we can begin to have those discussions as to where things can go and what we, what we can do within the park and Karen I, just had a couple of just tiny ideas that I just wanted to make sure I didn't forget, just because I love the idea of having an artist I, don't know how people feel about maybe Kara Walker, but you know she's done really work. I think just kind of around a lot of these issues and sort of confronting stereotypes which also like brings me to possibly a discussion idea, which is why people of color don't have the presumption of innocence in this country and how the until part, 5 didn't have or the exonerated five never enjoyed the presumption of innocence. And you know it might be a really good way to kind of also explore the you know. People on this call said brilliant things, I think about the role of the media and how they portrayed The Exonerated by this total rush to judgment. This use of like gangs and Wilders and predators- and you know I, think really tying- that into the presumption of innocence could be powerful and Kara Walker as an artist talks a lot about how people are stereotyped so that possible, tie-in just rank it out there, but I just think it could be really powerful because I think so much of this, and why this happens is because people of color in this country don't get the presumption of innocence. I. Think that's really great Rebecca and I just like to ask if you could again, if you wouldn't mind I'm, trying to make that contact with Carol Walker I, don't know her I, just like quietly worship her from afar, but I did anyone have them have any information as to how to contact her I can I can I was thinking, there's another artist, some she's in it she said of Atlanta originally from Brooklyn. Her name is Tina Dunkley and she's done a lot of research and so on, and she was the head of the Clark Atlanta Art Museum or when selected for about 25 years. She has a book called the muse of all of the art that you know she procured for that institution. So you know I can reach out to her, because artists know, artists, I'm sure she may know her, and it may even end up to be a collective thing. Artists. You know that come in also here's another two other great artists that a Harlem artists at Imola, og Coppola. You know who right here in Harlem, as well as ding de mccannon, who was an artist and she just had one of the highest selling- is another younger artist out of Howard University. Her name is escaping me, but she does had an exhibit up here. I mean I, think we have several formidable artists, I think we should also have educators involved and when we say educators, you know you got the people on the university level, but you need educators that are on the elementary high school and middle school level so that he was sure that whatever you're doing you know even priests level, you assure that this is something that you know. Young people can understand and gravitate towards I think that's excellent Terry. Thank you and I, just like to say I'm with the women's suffrage Monument that whole process involved artists and they there was. There was a competition that was set up so that all the artists brought some samples of their work, and then it was a vote that had been picked up was taken to determine who were the finalists and then rendering of the exhibit. So that's a process that we might want to take a look at also in being fair and also in trying to identify, do a really quality piece of work that will represent one job. What it's trying to be conveyed here and getting back to the point that Rebecca made about the presumption of innocence. Perhaps that is our that might be a focused question that we that the artists could use around developing their piece so that that's that could be one possible, focused question. Any comments on that or any other focus question. That sounds like a very good focus question, and it also speaks to the importance on having someone like Rebecca from the Innocence, Project or institutions like that also on the panel, because we're talking about a number of different things, but we're not talking about innocence. There, safety people from the someone from the Central Park five and the families are there. It would be good to get a legal perspective of someone. Who's worked with a number of people because it's very different when you come out of prison and you have these other institutions that are there to assist. You then, when you come out and you have been adjudicated from your client of your crime, so different types of it plays out of there in different ways. That's what I'm trying to say. Sometimes all the types of services that may have been available to you as a person coming out are not quite as available as they were are because you are an innocent person now. So you imagine. That means the help for you is not readily available because as an innocent person, you don't really need any help, because this also speaks to people being able to speak on the impact of this on the community. So that's like a social service person. The impact on this community as a whole under individuals and families that are involved directly and how they fit. Within this scenario, -, you know mend their lives and get their lives back together, and when you talk about their ways that it could be removed to my legislative, legal types of terms because you're almost dealing with issues and like let's say the people who are demonstrating all over the world all over the country in New, York and there, they too are talking about a presumption of innocence in terms of how people are viewed and the effect of being proceeded in a certain way had negative enough effect on your being. That might cause you death. So, when you're looking at these types of things, you need someone I, don't know if you can talk to that, because that's like a social service, but they think that's definitely talked about its impact on innocent people who go through this process, and there are a lot of innocent people who go through with it, but who go to the apposite and how they have extended effects allies. Moving forward into this innocence, how they regroup and III it just comes to mind as a focused question is: what is the pathology that occurs or ensues when the presumption of innocence is denied? I? Think that's so right on and I think you know, and I also just wanted to pick up on another point missile I made earlier, which is you know, better engaging the Harlem community and one thought I have to is: maybe there's a youth leader that works on criminal justice or someone from the community. That could talk about perceptions of what's changed and what hasn't changed since that time, and you know really kind of drive home the fact that you know these horrible things happen and this country doesn't change or doesn't change substantially right and I think maybe some current young youth leaders from Harlem to engage the community could be really interesting. You I love, I love the idea of the pink it's great Thank, You Rebecca, the idea of the presumed innocent folk escuela want to just, though out there for consideration. The idea of imaging, like this whole idea, Wilding that whole introduction of that new language in vernacular and what that said and how we still use those images describe our young people. So something I don't have the question, but the importance of images and how it has an impact on us and I just like to say that it also brings us back to what you know had said about the legal that the laws that came out of that incident and how developed and they went on to impact the community to this to this very day and also the importance of being aware of what the legislations are and how we should have input into that process. And so, basically, that's what you know just following the progression of the laws and the in their impact. So how do you comment? Yeah and I would just by extension, also should light on what are the safeguards or lack thereof, to guarding innocence, because I think that you know we do have the presumption of innocence. But it's always railroaded not. You don't buy things that are not necessarily in law. The District Attorney's Office has unfettered and unilateral discretion to do these things, regardless of what the law says and I think that we should also have a discussion on. You know this position itself. What is the values or the view of justice that a district attorney has and its effect on assistant, district attorneys and the culture of the office, because, like I said, like that's really how this stuff happened right? There was a lot of prosecutorial misconduct that occurred with no consequence, regardless of the law, and so we are still subject to that. Our communities are still subject to that today, and that is why it continues to happen. Sometimes these cases go viral and it highlights the issue again. For us, we put on a day-to-day basis. The culture of the district, attorney's office and law enforcement is the driving force of these violations. I think I mean I think we have like a broad base, because this is a really special incredible project and obviously we will people have to be involved. Psychologists and social workers have to be involved because he wanted to have a hole just like even the civil rights, a museum, one of the things that museum did was actually make. You feel it make you experience it and then finally, you went into the room where it really happened, and you looked at the balcony and it was just an impactful thing. So I think we would be doing some of that just to experience what it was and you're right. Words like Wilding came up, and nobody even ever heard of that who was from the community I mean children went to Central Park East, which was right there on 106 and went to school in that building. Nobody even heard a Wylie, but that became a media catch were you know, and suddenly people were talking about it. So that is a way also that media just drives a train. This is not even existing and coins. Us is something and then everybody is falling into that insane. You know I'm hearing that there are quite a few disciplines that need to be brought to play in the discussion, so this may mean that we may need to do more than one panel discussion and have each of those panel discussions focused on a specific discipline of issues, maybe even having two or three panel discussions yeah that might be possible because you might have one on health. You might have one on the criminal justice system. The we might have one on the after-effects of tackling the impact on the community could be like a whole. Well, I, don't want to say a series, but something similar to a serious type of thing where people could come in and out or even participate in each one where they want run in consecutive days to work. Your way to work. Your way through that, as you reach out to the various community players in terms of all of this okay. So we can begin to talk about that as well. So it seems as though we need to have more of a discussion as to unless we can make a determination here this evening. I, don't know that we can as to whether or not we should just have the one panel discussion at some point in the very near future, which would be maybe more broad. So what is your thinking on that? Donna I see you are you that? Do you have your hand raised? Okay, Chanel has her hand raised Chanel, no I'm, sorry, I, never took it down from I. Don't know, I'm not I'm, not quite sure how to raise my hand, but you know I think rather than delay it. We need to at least get one panel that has some different representatives and then we'll have some breakouts, and you know I mean that kind of thing is done all the time, but it seems like one of the initial panels or one of the initial people that has to be on. It is the parks department, because we need to have a part specialist arranger, that's identifying some of the areas that might be available and what could be done there because then you know some of the talking points. There's also I, think dis in terms of like models. There's also I think that Hunter College owns it, but it's like the Roosevelt house or something and the Roosevelt Conservancy owns this property and it's where Roosevelt used to live, but I mean they have spaces via where they can have rotating galleries. They have an auditorium on the lower level. You know so there's a lot of models of what something like this would look like, even here in New York, so I just think you know. This is incredible that we could bring in a lot of different experts, but I think it should be community experts. Community artists, you know, input from the central profile. This is key because a lot of times our things are built out and we end up to not have anything to do. This is not that kind of time. Okay and I just like to say that we can do I just attended a four-day conference on zoom and it was fantastic I mean they had all kinds of workshops and then they even had socials things and they were breakout rooms, but I just like to say you know we don't want to have like need to be. You know kind of zoom in here and focus on who we would like to have on an initial panel, maybe four or five or six four to six people on a panel I think Karen. Once we narrow it down to exactly what the topic is going to be like if we do something with the parks department, it's more like a question-and-answer session, an informational session where there is a discussion of what we're gonna, do what we're gonna focus on if we split it based on logistics, the requirements the permit at the time, those technicalities that can probably all be accomplished with one panel, and we would hear from the parks department in terms of what that's gonna require the land-use to for men or anyone else from those respective agencies. As to what can we actually do and how long it would take. And then we can dive into the substantive panel about different topics that we would want the exhibit to actually focus on and consider. And then we can still prepare for those now in terms of collecting people that are representative of the community and representative of the message that we're trying to accomplish, with the exhibit I see I. Think that again in terms of logistics and what goes on in the park, we can have Central Park Conservancy as a panelist, someone from New York City Parks Department as a panelist, so that takes care of the park, the physical, the physical location, so NYC parks and Central Park Conservancy, and we have talked about we have mentioned. Who else would we need in terms of the technicalities of what we can do and how Central Park Conservancy in new york city parks? Is that too far? Do we need a would like an architect? Well, she has all of those experts at there as a part of their staff and also new york city parks. They have architects and all of that, but in terms of I'm, I definitely think that we need that wasn't. There was a gentleman that Rebecca recommended something kind. You know I mean in terms of your panel and I, hear we're talking to honey. You're, saying and I tend to agree, however, if we are going to really you know trust, but that's where I am and I've had a lot of experience with both of those particular you know, agency, New, York, City, Parks Department and the Central Park Conservancy, and if I'm hearing that you're gonna get some ideas and directions from them as opposed to telling them what you want to have done, it's gonna be a problem. Well, this. Let me finish: Karen I know your experiences and yours is different from mine. You know so I'm wondering you know I'm just putting my stuff out there. You know, based on you know experience. The Conservancy has never demonstrated to me even with Seneca Village and even with whatever else you know. The sensitivity that we are expecting is going to be mandated by what we're talking about here. We got to take to them a fait accompli and that's all I'm gonna say and then I'll set up, and you know I just want everybody to remember what I just said. If you're, depending on them, it's going to fail, you know that I'm gonna put it out there and I'm gonna, be emphatic and I'm, really emotional I'm doing whatever I know. The people that are on Conservancy and I know that they do not have our best intrest and hard they're gonna create some little small vacuum of you know of something that would be a token and it's not what we're talking about, especially not in this pandemic, lower than a pandemic. This is a whole new time and those of those people haven't demonstrated to me that they are part of the problem and not part of the solution, and then I will just hello. You know. Yes, this is Prince and Charles I'd, just like to say that you misunderstand what I'm saying I'm, not saying that we should take direction from Central Park Conservancy in new york, city parks and what I said at the outset is that they that we have to engage them because they control what goes on in the park, but we are bringing to them what we want to see nothing they're dictating to us. So I just want to be clear about that. You know that is not my thinking, I'm that's why we and I mentioned them as panelists, because they should be at the table, I believe at the outset, because they can talk in terms of logistics and I and adding to the panel we were talking about. We were just trying to put up some panelists together. That's all okay, hello, Nancy can I speak now. Yes, okay, what he just said, and this is why I was mostly styling up until this point is I, mean I, emphatically support what he just said and I'm telling you this from not just from anything in the past. But what is taking place right now, I'm gonna say a few things. One I think it was the young lady Donna. That said that the CDC has plans already we spoke with them. They have already made it clear, I, don't know what they've said to you in regards to what they're looking to support, but they have already stated that you know they have no interests in supporting people quote-unquote that are still alive. They did agree to like- and this is what's so ironic, that he said that what they agreed to and I don't know what they told you, but they were talking about a plaque putting up a plaque and I pointed out to them that they raised 120 million dollars to do that part and I, maybe I'm wrong, but I, don't know how involve you guys were in regards to win it. That money was raised in the plans that they have for that parks, especially considering it's on the north end. I also gave them information directly for parks in Washington State and in San Francisco, when they raised money for the exact same thing that they're doing that they included the community and had money in that budget for housing and programs in the surrounding area, because they knew by doing that with the part it would affect. You know, in effect, you know, create a gentrification issue in part affect the surrounding community and the speak to what I think it was Chanel said because I grew up part of my life, while 113th Street I'm said to them that Park was always for forbidding place for people of color up and then into the community, because it never seemed like it was designed in part for us and I. Don't and I, don't recall having any engagement for somebody. I never even knew half the things that were going on in there to be honest with you and to bring that up to the president's side from the Central Park cloud. Our dis incident. That just happened spoke to that. The gentleman that had the bird watch and gentlemen lady that quadrant. So now they were supportive, and this is how the Lincoln conversation came up even prior to this being brought up in the meeting was that they were in support of engaging with that, but that Park part I can tell you and that's why I was just gonna. Ask you before everybody gets excited about what we would like to see there. I think you need to have a conversation with CDC to see where they stand and then decide on how we are going to attack this, because I can tell you that they didn't sound like you know, as he said, they were part of the problem. Just to put it bluntly, that is another thing that you know because I think a little more broadly and I'm not sure if this is something that we're of but the contract the management contract for that part of the park that's being remodeled was ironically being held, was bent was held by the Trump Organization. Now when they, when now listen I, you know I'm not sure if your weirdest, but the contract expires when the remodeling of that Park is targeted to be finished and maybe push back now because of this old virus thing, which is next year, so the Trump Organization, knowing that they were probably given the climate had have you know their management contract not renewed, they quietly took their name or so my thought was I, don't understand. Why is it that nobody up in the Harlem community, with all the organizations up there? Why they can't have at least a opportunity to be able to manage that into the park? I know, and maybe- and you know, I, don't know if the point- and this is a Parks Department issue, but I I'm, just thinking if we want to see change up there and you want to see the things that we want to see happen up there and we should be a part of that conversation and who is managing what goes on up there as well as the building of it and every infrastructure building of it. So I mean you know, I'm, just throwing these things out there, for you know people to consider, but what he said is spot-on, I departed, a problem you know just to echo, I want to remind people I'm a historian and I'm telling you that the same people from the Conservancy were the same people that Chanel was talking about and the same people that proffered you know that whole situation with what was happening in the car during the time there was a central park, five and there's the same people that are there now. If we ain't talking about something new, something revolutionary, something evolutionary, they were wasting our time. I don't want to be a part of a panel that anybody from the Central Park Conservancy is a part of I'm. Just expressing my opinion, they are part of the people that have created this situation and why the hell are we talking to them about solutions, and that's me speaking because I was there and I know that you know that they were part of that problem. The same people, the same money, people that consist of the Conservancy are the same people that are not the people that we need to have at the table in this new normal that we've worked for and we've created in black lives matter in doing whatever so you'll go ahead and deal with that I'm. Just saying and I'm not gonna participate in anything that those conspirators are. Apart of. That's all you hear me saying, can I ask a question about fund development? Yes, maybe I missed a session or two, but have we identified? Is this results in our coming from? Do we have what have we identified where the money is? Where are we getting? Not the money would have to be fundraise, and that was one of our next steps to discuss to be able to identify resources for fundraising in terms of what princess said and Charles, and you know you see the we have to go through New York, City parks in New, York City Parks works with Central Park Conservancy in with in Central Park. So if you want to circumvent those two agencies, I don't know how we do that, but maybe that's something someone can address because I don't know how you know how we have we well I. Won't. Let me just say this I wasn't saying you know, circumvent and that's why I mentioned the management contract up there, because I took a look at some of the things that was going on there and we're you know, and this is kind of how I you know, look view things how you can operate in the confines of what exists. Also, you know and I try not to speak for anybody and because I, you know, I, don't know the word. I'm looking for the wherewithal of the board so to speak, or the position that you may take in regards to confronting for the lack of a better word CDC. So I don't want to speak to that because that's a decision that you know the board would have to make, but in terms of working in the conference of what they do, that management contract is something that should be looked into, because it should be open to people of color and especially from the community, and they are people that are up there to have those capabilities. I mean I'm. Just you know thinking outside of the box. Here, for instance, they exonerated five Yusuf, has a doctorate 'no snow. Now he may not have a doctorate in management, but he can partner with our management company in harlem, and you telling me that they can't manage that or at least be in the conversation. I mean that's just a thought so again, I'm just suggesting something: that's within the confines of what takes place not to circumvent and as far as the fundraising missile arm could probably speak to this. She has the j4w our organization. Now the board doesn't do the fundraising things then I guess that would be, could be a conversation with mr. Lama, how you can support heart organization and raise funds for J for WI, which in turn will be a part of that and I would also recommend on this and I think it was my partner that said she lived over there and as Chanel that you communicate with Miss Salaam, because the three of you right or three of you live right there. So you definitely should be on the same page or at least have that dialogue. So so I'm, just things I'm saying that are not about circumvention. Well, though I'm all for that I mean if we're gonna take to the streets, and you know fight the power I'm for that too. But if not, then you know these are things that can happen within the confines of what they do. Well, you know the only thing I'm saying is we're trying to get an exhibit in Central Park. We separate from any funding that would be involved with the renovation of the construction of the pool in the mirror, and all of that we just focused on this committee is focused on an exhibit in Central Park and in order to do an exhibit in Central Park, which is a New York, City Park. You have to go through the process with the New York City Parks Department. So you know that that's the only point I'm making I think that you know and when we were talking about what the contents of the exhibit could be I mean as we get into social justice. Maybe you know I mean this is a much broader topic and maybe once we can address those of those issues. At another point, I Duke I can say that when Janelle voiced her opinion about the Central Park five at our October meeting when we passed a full board resolution in support of the project for the renovation of the pool in Central Park, the Central Park Conservancy addressed that in the meeting, and they said that they would take an interest in it and they would be supportive. We have had representation from Central Park Conservancy at least two of our meetings, so they are interested in working with us in terms of what Charles is saying. You know that has not been my experience with them and you know, as I said, let's want to just circumvent going through the New York City Parks, Department I, don't know how you do that to get a project in Central Park and that is our focus, getting a project and exhibited in Central Park yeah. Madam chair, yes, can I just ask a question. I remember: when there was a plan for pandas in North, Central Park, all of our elected officials and leaders were going to meet with I think it was Rosenthal I, don't remember what you liked. It was pushing it, but it seemed to have a lot of traction around. It wasn't something I'm. So is this project? Getting that same traction is what I want to know, because we had a lot of our leaders from here in Harlem attending those meetings for a panda project that were the sense, the property values out of control. It is to my understanding. It was like a million dollars just to feed them, but there were people, elected officials actually entertaining this idea. So my question is: where are they for this phone call and why aren't they backing this? We mentioned earlier on that we were getting letters of support from elected officials and ypd and were present they were present at meetings for pandas in North, Central Park. So my question is yes: okay, we want letters, but we also want them present so that we can talk about how and what type of pressure we need to put together to make sure that what Charles and Prince is saying does not happen and we're not going to avoid what they're talking about from happening. Unless we are united on the front and that's our leaders, our elected officials, all showing up and being present for this initiative. So my question is: where are they? We need to put more pressure to get them to these conversations, because them coming to these conversations is already enough pressure to say: okay, they're gonna stand on a united front, so we really need more than just a letter. We need them speaking this into existence so that they don't like and prints a just do whatever they want, and that's only gonna happen if we can't get our leaders to support this initiative and really be behind what this committee or body that incorporates the family of the Central Park five would like to see. Mr. salam, would you like to speak to that? Well, we do, and we do have and have reached out to some of the politicians, and some of them are on board in terms of working with us with these types of issues, some of them. We have not reached out well unless they have been able to reach, because with this cold, that nineteen everybody is not really in their offices. So it's harder to reach people unless you have a better number than what I would have to reach out to some of it. But we are trying to get support from as many as possible to come on board, if not to send their representatives on board as well, and we've also been reaching out not only to the politicians but to the religious communities who have a large population that goes in the attorney can bring them on board as well. Some of them have also agreed to support the project in its entirety. That means the parties, as well as the Lincoln Correctional Facility peace. Now many of the some of them had representatives at our last meeting, but we're not able to attend this particular meeting here, because you know the date was changed and everything and you have to have certain things, fit into a schedule that you already have in existence for you to function, but we can see if they can send their representatives to take part in more of these meetings and reach out more to them and see what's happening because I'm sure many of them would want to be. You know would be want to be involved because some, let's say, like kids- was involved early on so I'm sure he would like to be involved as well. But the thing is: how do we get to him to? Let him know to come on board. Keith Wright has has offered his support in totality met. Wilma Braun is what she comes on: she's, representing him and she's, representing also the Fred Salmons Democratic Club, but you know we do have to try to get some people. You know more involved and Bryan Benjamin, I'm sure he's probably involved, but we just need to bring him like sure thing, bring a book to the table and have their representatives. Yes, at some of these meetings as well, but to get them in we, you know we you need to let them know in advance so that they can put these types of meetings on their schedule. Let them know when to come in because they say for it, for example, the meeting that we had with the committees the last meeting now a number that some of the people were not able to come during that committee and the meeting was very long. So we need to be more strategic in terms of telling them when to attack in on the meeting so that when they come in they're coming in at a point where of their expertise, their support is ready to just go out there and be a part of it moving forward. But you know we'll see we're still working on it. We're gonna have more meetings and more people are gonna, be coming in and bringing people on board like even with this. When we're talking about telling what this panel will then, all together, all the people on that list, don't necessarily have to be panelists, they could be people who are in the conversation who are in the room who are on the call. Everybody doesn't have to be there, so maybe we don't need, for instance, two parts, people you like and ooh good one and have all the one sitting on the backs of questions come up. They can answer some questions as well, but all of those things can be worked out as soon as we figure out the type of people that we need to have on the panel with in this conversation, and once you have that, then you just start filling our name, giving out the numbers in terms of that cuz. We have some already in terms of you know two or three of these people and we are moving forward to pull it together. Now, one of the most important things to have going forward, if the figure out when is going to be so that we can start reaching out to various people so that they can see if their schedule is free. If the schedule is not free, can they free their schedule up and give them enough time so that these things can be done so that they too can participate in? What's going on I totally agree about, you know making sure that we're you know I whenever I'm dealing with politicians, it's like you have to pick your spot and, like figure out, you know when they're gonna have the most help right, so it I think during like key voting times and all that and I think to miss Long's point: I mean Brian Benjamin, it's great and Keith right that they're on board I. Do wonder if we can ask the black and Latino caucus in the legislature to make this a priority, and you know, and then you also have the heft of the entire caucus coming for you. One thing I think absolutely and I think we're in a whole different time now, I mean there's one bad thing about not coming together, but the great thing about coming with zoom. In certain instances it's a lot easier to get to people, and some of them are a lot more accessible like with all in network things. I've been able to have all of the public officials on ministers, everybody because major media doesn't have them congressman SPR. Does his own press conference every Friday you're, not I'm, saying so the people are there, they understand it. They had a big press conference out there with the black Latino and Asian Caucus, and it was extremely powerful, so I think that we can't get them in and if they can't come, they will send their representatives and when I said that first I didn't mean that we need to talk to them so that they can tell us what to do. I just meant that we should understand what parts what parts of the part are available and then we can start walking it looking at it and getting out experts to see what can happen, because I think is very critical. A lot of programs and projects that happen in the city, including the contract tracer like the people they get the contracts or not, people that look like us, don't understand what's going on, and this is another part of systemic racism. Sure let me ask you a question: when you say the parks would be available, we would need the parts to go in and show us where we could have a location. Is that right, yes or understand what is available? I mean there? May the skating rink in the swimming pool, we're not gonna put it in there. You know what I'm saying so what space is in the park? I mean where there's a statute. Already, it's not gonna be there. So we need to have some idea of what gistic sar available and then we obviously are still in the planning stage to think how much space would be. What do we need to put you know, but there are certainly parts of the park that probably are not available at all because of whatever but I'm saying. If you have an idea of what it is he's like. Certainly they're not going to tell us what to do. It's not that kind of time, because that you know I, think I keep hearing that over and over again and I keep saying that's not the case that we're not asking. We are asking them to identify possible spaces, and that's. That is the only reason that we have right now for wanting to talk with New York City parts and Central Park Conservancy, just to identify the space. What goes into that space and they will tell us what is it we can or cannot do in terms of the context of the park right so that we do have to adhere to, but what the content of that exhibit is going to be. That is for us to decide as a community. So that's the you know: I was trying to move the meeting along too to get to that point where we could begin to discuss where it could go and what that content with that artistic content would that educational content would be so that's what I was trying to you know and then, where its goods getting to be almost 9 o'clock, so I just like to you know just to get an idea with where this committee wants to go because right now you know I I'm, not understanding that you know I'm. Hearing that you don't want. Some people don't want to work with Central Park Conservancy in New York City Parks Department, but they have to tell us where we can put the exhibit so or give us some ideas where it can go and how we have to adhere to the context of the cart. So may I make a suggestion. Yes, if you're going to approach it that way, I would suggest that you have I guess once there's a general consensus here within the group of what you would like to see there, that you have an architect from your side from this side to do that, walk through with you. First before you even go to CDC the plans that they have, they already have presented their plans of what they plan on doing there so and I presented it actually at a community board meeting I was there, so they have already did. This is a you know for them, it's a failing, comply if I said that correctly, but we are different way in a different climate. Now my personal opinion is based on. What's going on now that it can be a different conversation, so I would suggest that you go to it with an architect and see what can be done there, because if you go to them and ask them okay, where can we put it then I I'm with Charles I, can almost assure you it's not going to be much of anything, and this is just predicated on what they've already done. This is not something that you know, I'm, just expressing you know just out of know it they've already. They have their plans done it's already done as far as they're concerned, so Prince I'll, just say to that was that's a separate project that doesn't have anything to do with the exhibit and the exhibit would require its own funding, so they would like to they would know best where exhibit should be placed because I imagine they would probably be on this in some place. Coming up from, let's say what is it? They said that from 163 going walk, oh no I know what was suggested, no I'm, not suggesting anything. The only reason I'm saying 106 Street I'm, not suggesting that they said or anybody said the only reason I'm saying 163 is I- think that's why they were the incident with her occurred. Mmm crosswalker, 106 Street, if I'm, if I'm, correct, I may not be correct, but if I'm correct it happened in that crosswalk someplace, the young people, they entered the park from a hundred and tenth Street and they walked around in the park and in different locations. I, don't know if they got I, don't even know if they got to 106 Street. Hmm, you know in that area around 160, or maybe they got above 106 Street, but just not in that area, but they in the park. One hundred and tenth Street at a certain point. I do know that they were on a hundred and I'm just guessing now, let's say a hundred and ninth Street around in there as I remember, one of the kids was walking on the outside of the park on the west side and the police chased him into the park, and that happened on the west side. So different aspects of the movement happened in different spots along the park: okay, but if you're talking about a unified kind of area, my thinking in terms of the location is like you know: where is a flat space that might be I'm, not really good on sizes, but let's say five hundred square feet, 250 square feet and believe me: I have no idea what these were feats, but you know in terms of having people to have some sort of walking around space. Other people can come and you know have a few benches in the space one person could be looking at one part of the exhibit in the park. Another person can look at another piece of the exhibit in the park and different stuff could be going in this face if its own in this unified space now I did sing it as a flat space, but you know Central Park has heels too I'm just saying this is what I saw, but it could be any number of things in terms of this and from what Chris is saying. Maybe when we are looking at this, even though we know we have to deal at some point with the Central Park Conservancy and Central Park, maybe we should have more clarity in terms of what it is we want, so that when we introduce it or talk to them, we have a more concise vision of what needs to be happening to satisfy our community needs within the space in the park. Well, that's what, in terms of my thinking, that's where the panel discussion would come in to come up with some ideas, some concept we would like to see in the space and then do the walkthrough perhaps and identify the space once we know what the concept- okay, I'm thinking community board 11, because they had the whole thing about the sim statue in that area on the west side. Well, that's all that's on Fifth, Avenue, so I think more of the community partners that we have saying that this is what we want may help the conservatory or strengthen our position with the conservatory, because I understand what you're, saying and I. You know I'm saddened to hear that people are saying that the conservatory is not going to do what we expect them to do, and we know that, but I still believe that we still have to go to them to get the rights to do this or to get permission to do this in the park, because they are, after all, the people that run that space, but I think if we have more community involvement, as far as like community board 11 and maybe 7 or 9 on both sides of the park. That would help in strengthening our you know our ask. Certainly we don't expect that they're going to want to put anything there. We know this, but that does not prevent us from going to them as a united body just so that we can effectuate the chain that we want to see in the park. That's just the thought. Okay well Sicily, introduced in our resolution at the world board meeting today and she said that she got a very good reception for it. So that means that we could therefore go and approach them for letters of support yeah for the project. I think I mean I, think that going back to what we said in the initial meeting, I think that the time is really right and it would be crazy for them to put any pushback on, because the whole world would be looking at them like what you know like in 20 years later of a birdwatcher, somebody called the police, so I mean for them to give push back good cause. You know, God knows what so I. Don't think that that's a concern but I think consciously. You know I'm like going over the park in my mind and I know at some point the Rose Garden is in there. I know that whole meadow area, the hospital, put up tents and made a hospital there. So obviously, when stuff needs to happen, it can't you know so, and you know, keeping on that east side at 110th and fifth I think is important, but I'm just trying to visualize like some way the Rose Garden is in there and then we know down by the hospital there's a whole flat open meadow. You know: that's not it's not really that far down, but I'm. Just saying that's what we have to think about and then there's a lake, so you know you've got to be dealing with that so yeah. Well, whatever says that we just discussed that we need to develop a concept person, then we can think about the space. So you know that I think that's where we are right now. So it's 9 o'clock after 9:00 and I was just trying to identify what the next steps would be. So it looks like you know, primarily, we need to develop a concept and then to take a look at the space to do a walk-through and look at various spaces where this concept would be able to go so Cole wants to come inside. So we came across, came up with a few focused questions, which was this meeting and three of them. One was pathology that ensues when the presumption of innocence is denied, and second one was safeguarding safeguards or lack thereof of innocence, and a third focus point was values or the view of the justice of the DA's office and what the culture of the DA's office. But what would have the culture of the district attorney's office impacts on one on justice, so those were three focal points was safeguards or lack thereof of innocence. You know what else could be really interesting would be even to think about inviting the man who is victimized by Amy Cooper in Central Park, who also didn't get the presumption of innocence. The man involved in the bird incident, the birder mr. Cooper, yeah I, know I, just don't want to say Cooper again, but you know that could be interesting too right. It's in the same Park, it's this many years later and he was victimized for the same thing like just you know, I mean you would be interesting stripping it out as her brain. Alright, so I mean we came across a lot of disciplines and come panelists that we wanted to see, but we have quite a long list. We have artists, we have Vincent's Sutherland, who is a psychologist. I believe he's a he's, a law professor at NYU, but he runs the center he's the executive director of the Center on race and the law, but he's just he's a powerful speaker. I think he'd agree, and he- and you know, and he's worked with exonerated five on different panels before okay. So this is anybody's suggestions as to how we can just kind of condense this and come up with a panel. If that's something we'd like to move forward with Department of Technology the Department of Law, we can add panel, but we also discussed having a broad panel and then having maybe two more that are more fine-tuned so because we have two larger group ones. So there'll be a three part situation, a three part presentation. It could be set up that way. Daniel has raised a comment: yeah I got involved and I was listening, I think I'm, the only one as I spoke, and so far and I do appreciate all the things that have been said. It's a it's a it's a it's a long hill to walk up, but I do think that trying to understand the funding part of it is what Charles had mentioned before is very vital, so that that's one things that I'd like to kind of disgust cuz. Something just happen to come across my desk yesterday. So I'd like to get a better understanding of that, so who'd be the person and I would talk to him about that funding. I'm, sorry, I just wanted to say: I ran out of battery space. My phone went out and I came back as somebody came back as one of my children, so yeah I understand that it's been a very long process, but I think all the elements of a long process are is what I've been listening to. So it's a very necessary. So how do we do that? I mean it's too early to ask about a subcommittee or yeah I understand that, but I have some ideas. I just don't want to put them on the table right now. So if there was somebody I could talk to it, I could either talk to Charles or prints or Chanel or Karen. Okay. Let me let me just let me just put it out there. This. There has been a group that contacted me yesterday and they're, considering investing in some type of program in Harlem, and so you know this seems like a viable program. So I'm trying to I, want to talk to the contact person about that and then maybe get back to you in terms of what criteria needs to be met in order to qualify. So that's kind of rolling around in my head can I. Can I well only I just want to speak because he invoked my name if the board and I'm only saying this, because you know the boy someone on the board expressed that may not be or it may be, a conflict interest I guess, for you know for the lack of a better word for them to be in the fundraising area. But if that's not the case, then I defer back to the board because of course they're putting this together. So I don't want to overstep there. But if they're not and I would ask that you speak to miss Salaam and then you know and I forgot I think it was Terry no-nuts area, but they are the person that lives on 110. Yes, okay, that you guys in turn also have the discussion with no organizing with mr. Lumm as well, because you're in the area and you're directly impacted by. So that's just a thought, but you know you know I, don't know you know again: I can't speak for mr. Charles, so I, you know whatever he wants to be involved. I'm, sorry, Prince, really quick! The DM is trying to orchestrate I'm trying to get you guys. Me Shane, get my information over to you guys so he's saying they not seeing that messages. So I just want to make sure before I get off this ball that you guys have it so I will be able to contact mr. Longman, you biscarrat, yes, okay, just in terms of an agenda the agenda that we had, which was public part of it, was public panel discussion planning. So where are we going with that? Because that's that was like you know the focus of this meeting and what I'm trying to understand? And how do we get a consensus? You know, and within this forum that we have for what this panel discussion, which we probably were thinking about a broad one initially, which can I I, think I, don't think you're gonna be able to do to decide that by committee or at least a group this large, this was a very rich discussion and I think that it might make some sense to go back to the committee, the parks, your community chip manager that you chair and basically look at maybe segmenting the different pieces of this. So that there's one group that you that you're talking about the panel there's another group that you're talking with about the fund development plan, know and the structure but I, don't think we're gonna do it by committee. My experience has been it's always very difficult and challenging to do that. I, don't you know, I think that we should be as proactive as possible. We have been discussing this for quite some time. We did get a resolution going, but you know things can get really drawn-out I think to go. We have to wait a you know till next month to go back to committee. Would we be able, so you already said that it would be something of a three-part type thing, so would we be able to at least narrow it down to say? Okay, one part will be for these parties. Then we'll have another meeting that will only you know, we'll invite you know the politics or whatever then we'll have another meeting that involves the architects, the technology or you know the technical part of it. So maybe we need to identify it's that fire. Maybe we can break it up into that part right, because those who want to hear about some come into the community. You may not want to sit for you, know a building, presentation or I'm, not a building, a presentation of some sketches or something like that. So maybe we can break it up into a meeting, for you know, sketches architects, you know what the how to play fundamentals or the we can have a meeting for the public interested parties. That's exactly what I'm suggesting in terms of going back and basically defining the test. So that not everybody's, that doing the same thing, and in that way we could probably get much further. Those pieces are going to be interconnected. You guys need to know you know. I have no artistic bones in my body, but a lot of experience and fun development which to me is gonna drive a lot of those other pieces. How much money we were able to raise is gonna really impact. What that design. My thinking is that if we can at least get a concept yeah, then we can begin to talk about the technical aspects, like the support of the elected officials, the funding and all that sort of thing, but if we could just get a concept off the ground at this point, I'm thinking that you know that's being progressive and we're not just you know just talking and kind of spinning our wheels, you know. So that's what the right should we go after public opinion. First right, since we don't have it fully thought-out. Do we want to do something that brings the idea forth to the public that this is something that's in progress or in negotiation right now? How do you guys feel about that and then I guess we can go I mean if that's up to you, I mean for now. If you, if it's about moving forward and getting something done and in this area, but no you don't have things in place right now. Maybe it's just public opinion about. You know how they feel and then we'll probably get ideas from that at public hearing. I. Think if you have the panelists that we spoke about, and you know the panelists might be all the aspects of it: a historian person, an artist person, an educator hurts in a person that is involved with legal aspects of it. I think that restorative justice Center at Columbia's, excellent because they also do have a part of it. That is really just for youth, so I think if you have those conversations with some of those experts on the panel and then certainly have public that can listen and put in their input or whatever, because it's gonna be a virtual thing that you are moving it forward and that would help us to shape the concept and then once we have the concept, then obviously we're going to go for the budget, but I don't think the budget is going to drive with the concept is. This is a deep concept. This is a big project, but concept is concept and content is extremely important, so I totally teri I totally agree, but I do think that the budget, its budget should not drive division in the concept, but it's gonna definitely have to say it will it will impact it, but I'm just saying going in. You know it's hard to then put those pieces in place and I think that, right now in terms of money and funding, there's been so much going on with the systemic racism. You know it's almost a no-brainer and I'm just saying you know it is about money, but there's organizations like the Robin Hood Foundation that raised 163 million dollars in a half an hour and I. Don't know where that money is going to. You know the Robin Hood Foundation, there's no other foundation that has that capacity right, but I'm, saying that there's money and the capacity most of the time money does not really trickle down to no community or to anything, and that is what has to stop, because that is what systemic racism is and it continues and will always be on the back if it, if we don't stop it so I think time is of the essence here. Yeah I, agree, I think it would start off with a panel discussion around concept using those three focus: questions having six panelists that represent legal aspects, an artist historian, sociology and educator that we could. We should also have a technology media right here, media and also, of course, the Central Park exonerated you know has to be a part of what should happen or what will happen? How can we get that outreach? Cuz, you know: how do we get this into 4:05 into the conversation? The question I mean I've asked Laurie I sent some moves on tonight. I, don't know well mr. llamas here and as far as other members I don't know. Mr. Lamba, you know outreach. I have outreach to - I, believe it's Kevin's and his brother, you know who's a DJ who you know live right there as well, so I mean I. Think we just have to do our homework. You know nobody's inaccessible and in a way, in a weird way, zoo makes people more accessible and it makes it easier. You know that they're not having to figure out a date in a time where they can have to go somewhere. You know they could be in wherever they are and still come into the zoo me, so that in itself is an advantage. We just have to do our homework. Well to me it one of the main things that you need to do is come up with some sort of a date, because the date is going to be the driving engine in terms of whether you get who you get who's available and you need people who will be able to do on the zone, because, if you're on the airplane, you can't do those right if you're on another zoom, you can't do those. So it depends. So the main thing to do is to get some dates and then start reaching out to people to see who can become involved. As you invite the community in because to me each meeting you have should be a community meeting where the community is notified now and in terms of funding and other types of stuff. A lot of that will depend on who you are inviting to the table in terms of these conversations, because some people will be able to help publicize that this is going on, that money will be needed and all that kind of stuff will fall into place, and it just is, in my opinion, a lot of that stuff will fall into place as we move forward, but without any candidates we're just spinning our wheels and then you're having the whole thing because I don't know, you know putting people are available because there are some people who are more available than others, and there are some people who have had such a negative experience. They don't want to be out there like this, so you have that within the groups. Also, so you don't know what's going to happen, but you do know that if you don't have a date with a time associated with it, nothing really is going to happen. If you're talking about having three dates, then you need to come up with three dates: whether it's, for instance, July 7th, July, 8th, July, 9th from 6 to 6 to 8 6 to 7:30. You know whatever the time is going to be, people need to know when these dates are and then, as we meeting, we can structure what conversation is going to be held per day. You know what I'm saying so on this day, you might want to talk about the an introduction to the overarching concept of the project would be, let's say, the first piece, then the second piece would be kind of a slimming down that process in and moving forward slimming it down to a point where you kind of crystallizing it, and then the third piece is now we have this going on now. Where do we go from here now? We need to introduce, bringing in let's say the parks, department or whoever it is to get involved in terms of moving forward, because we've done our due diligence in terms of figuring out certain things, because preprints was good in terms of when he was saying how people who are down in this area get together. Maybe we could get together one day and just you know, walk around in the park and look at locations and come up with an idea for what a space might be so granted the space and the size of the space may or may not be acceptable, but at least you're going out with them with a plan and with the plan we're working around the issues that needs to be achieved to get the stuff done, because if you go in- and you say well, we're going to do it, for instance across from the hospital where they have that flat open space I'm, just making this up I'm not saying nice face. But if we're going to do that and so we're saying well within that space, we want to take up five hundred square feet of that space. To create this Center to create this educational piece, then they might say: well, you know that space is not a good location. We have other ideas for that space. You know why? Don't you move it down the street? We got five hundred square feet over here. You know what I'm saying so, at least it puts you in the in the process of trying to control some of the conversation and trying to let them know that you want X Y Z amount of space and that space is more than a plaque that says Central Park five, absolutely you see so we wire up the conversation into a more of an arena, but the main thing that you need to come out with to here tonight is a date and a time right. You have some people here that can be part of this conversation moving forward. Some of the people can be the same people on three days. Some of the people might change, but we just need to get it started and get it moving. So the question is: maybe we should leave here with a date one a date two torn apart and the date to have this. The first discussion perspective date that we can least try to send around the seasons available. Onion Karen. Excuse me a movie yeah I'm, you hello. Can we just have a date going mister salams, Day, July, 7th made them up, they might even be on the weekend, are the are the panels gonna happen back-to-back like that? No, this is just for the first week: okay, that's Tuesday, Wednesday and Thursday. So let's start with those dates, and then we can look reach out to and I can send this out. So we need a. We want to have the exonerated five on the panel, someone who can represent legal aspects, an artist, a technology person, a historian, sociologists and educators. So we have six panelists and we can keep it concise and then we can have media on the panel. Also, do you think you're gonna be more, you know what, but we're just we're just trying to come up with a concept right now, media! Absolutely well. Can you explain? I mean I, think media drives a lot of what happened and past thoughts and rights, and you know knows you know it's important media being from the beginning. Don't care and it'd be our media, be it our void or you're, not I'm, saying I'm, not a backup, but you gotta have media. That's a great part of what happens in this world. Okay, so we have a panel of okay all right, so we have a panel of eight. We will send out get a consensus of who those panelists should be. So we want to send that out and have those focus. Those three focus questions. If that's okay and I'll put that in. If you have, if you have dates for all three meetings, because when you're sending the information out, you can send it out so that people know where it's happening on this day is happening on that day and it's happening on this day, whether it's like a week apart or within the same week, but at least you know, even though we'll probably send out more than one notice. People can prepare for the event in its entirety that this is going to be going on. X, Y, Z days. Okay, so do we want to make no I'm just saying it could be? It could be that's saying it could be one behind the other. It could be a week apart, yeah, but I. Don't I, don't think it should be a month apart, but it's a good week apart. Oh it's why people are talking about. It could be every other day what about July 13 14? No, you said what did you say about the 13th 14th and the 15th? That's possible yeah I! Think it gives you a little more time and I think that's a great idea. Okay, so that that's the second session and okay confused and the 20th, the 20% of 22nd I, think moving anything back I'm trying to set up I'm always trying to buy more time than less time, because things take more time than you think yeah. Thank you. Yes, sir I think the 13th and the 14th and the 15th is good, because, even though a lot of people are not really moving around, it's still like the July 4th holiday or whatever it is, you know so probably the 13, 14 and 15 gives you like enough time to get it plan to get what I was saying Terri's the seventh day. The night would be dates for the first panel. Oh okay, 14 to 15 three dates possible dates for the second event, and then the third panel would be the that following week. Excuse me, the 20th 21st of the I know I can't do the 21st may be the 22nd 23rd of the 24th for third panel of July of July, but if it works for everyone else, go for it. Okay, all right! Let me just make a suggestion, uh-huh, and that might be if you, whatever day it is so, let's say if you moved a seventh to the ninth and then you could have all of them on a Thursday. You know it's easier to remember and follow the dates that this is going to be on this day. This is going to be on the owner Monday, and then you have everyone on the Monday. It might be a little easier than if you're jumping in two different days right. Well, whatever these are just three possible dates for each of the payment, all right, good, okay, so that's just gets us started all right, so we can get this information out if we can go ahead with the first panel, which is just to come up with the concept I'm sorry I had to step away. I didn't hear what you said the first panel for the concept. What date are we targeting? We look at? We have three dates for each of the three panels, so it could be. The first panel can be on the 7th, the 8th or the 9th, as for people, the second panel, which would be on the 13th or 14th or 15th, whatever works best for the panel okay session, would be July Lisa on the July, the 22nd, 23rd or 24th for the third panel- and this is so I would suggest you keep it on the same day of the week, and that makes for consistency. So call me if you need me: okay, when we're going out to people and I, don't know I'm usually having this because I'm trying to get people, but if we give them alternate dates, I mean it's not that many people, but it's still gonna, always end up to a consensus. So is it better to just say: okay, this is the date and then see who weighs in and then, if a whole bunch of people can't weigh in, we could say this is this. Is we want to meet on the 7th and then, if it comes back that a lot of people yeah? Well, then we can say: oh okay, can you be done yeah? Otherwise it gets too crazy. You know yeah one and that's it and then everybody can weigh in and then, if you see a whole bunch of people can't do it. Yes, you make your adjustments and most of these you know, and even for the general public, but a lot of times. You know with the political officials and everybody. You know when I'm trying to get them. I just say: okay, this is the date and then some of them say: okay, I'ma jump in and that's the advantage of zoom I can't come in the beginning, but I'm definitely coming in and then, when you know they don't have that much time. This is a different thing. Then useful. You see them, you just put them right on it: okay, yeah, sometimes otherwise, you're going to be trying to figure out too much. That's the biggest competition okay. So we have a plan and did we get the walking plan? Don't have a concept I think all of us can start to think about that because I know I'm gonna just go walk around the park and look and see you know so we can all probably you know start getting our minds. Go. You spend that -. Yes, I'll. Ask them to send out something to everyone about how we can, above what the format of the discussion isn't to get panelists reach. Out to you. We have some names already, there's one whatever the things are: I send it to you there any other. No mrs. Quran written is the next top meeting. Oh, that would be. That would probably be the panel discussion I'm thinking, but we can talk, we can communicate. You know: okay, mr. Lumm or remote access now so I'm trying to contact you Dooley. You will be able to take someone individually, but you can't put my number and my email when my number and I wanted to reach out to you miss Alam also, but my number is six four six, oh, you can't see the chin. It's six, four, six, two six one: five, three, nine seven and my personal email, which is a good one, is also is H Harlem house at gmail.com. I just want to read it back to you, six four, six, two six one, five three nine seven yes email was H is 2, HS is H and then it's Harlem house at gmail.com. That's my personal email, sending email! Ok! Thank you! Thank you. Okay! Are there any other comments or mr. lamb? You can give my information from the DNA district manager. I, don't know if he's still on the line. No, that's my information. I wanted to okay! Well, if you hold on, let me see I'm. Just afraid of these, it's also recording guys so put just email, each other directly. I guess I'm out here, I'm already out here, but I get you Chanel I, don't know! If there's a lot of different things going on for Juneteenth I, don't know if everyone is aware, but I know there's something going on and st. Nicholas Park I'm not sure the time it starts, but I do have to fire for it. The mosque on 116th they're, doing their normal, like walk for duty, it starts lining up at 10:00, is going to be at 11:00 to start marching and they're going around towards Central Park and they're coming up, 8:00 they're going up to 125th and then they're coming back down 7th and they're going to convene at the state office building something in Fort Tryon Park, because someone was a black man was found, hung in Fort, Tryon Park on June, 9th and they're trying to say it was a suicide, the community saying no, it wasn't and so they're having a healing event starting from 10:00 to 12:00, with baby whatever in Fort Tryon Park. That is happening as well as virtually honey in the rock is doing something the group on tomorrow evening and then, if you're out in Long Island, somehow the Shinnecock reservation and the East End african-americans are having something in South Hampton. So there's a lot going on. You know contained with Jew teens and also the Damascus to sign to make it a national holiday and if you would like to get a free juice at a juice bar rejuvenex, it's all on a column network news site, but there's a fencer who was scheduled to go to the Olympics he's a millenium Darryl ha corner and he is the sponsor with the black juice place and you can go, get a free juice from 11:00 to 4:00 on 133rd I'm there tomorrow for jeans and the marches on Saturday. That's all the juicing stuff, Thank You Terry. Are there any other announcements? Okay? Well, thank you. Everybody and I'm. Sorry won't have that happen again. I think this was a very productive meeting. I think there was a lot of great discourse that came out of this and, as we said, this is a journey I just wanted to get up, but make it you know top-notch and community driven well with that I'd like to say thank you.",
        "summary": "She are also a member of community for 10 and civil rights attorney here in New, York City, Thank, You, I am the second vice-chair of community board tan and also the chair of the Housing Committee, and grateful to be able to join this conversation regarding our beloved exonerated thought: Would, you introduce yourself yes, housing and Health and Human Services, Committee?\nCan you go to the next slide, all right and on to seek the 10th of June at the outcome of our meeting in terms of next steps was first to find out what the status of the RFP, the Lincoln Correctional Facility, located at 31-33 West 110 Street, and to find out who was on the Community Advisory Board for the RFP process?\nThe land use committee was going to offer support in terms of an amendment to our current Parks and Recreation resolution, and we discussed launching a massive media campaign and gathering letters of support.\nThere was a point in time as they send in a Brian Benjamin, along with representatives from Empire State Development Corporation was seeking to gather information from our community with respect to what would happen with Lincoln Correctional Facility following its closure.\nPhillips or a senior representative from Empire State Development can come on and tell us what you we should be doing to try to connect the dots between the exonerated five exhibit and what's contemplated for Lincoln correctional, as I said to Karen the other day.\nWe also asked echo dev to become involved, because this may become an issue that echo dev would have to deal which side That, Charles was saying in regards to the plans, so I just want to make sure I'm hearing correctly this the project for The Exonerated, five, That is gonna happen in Central Park separate from the Lincoln project.\nI will just want to make sure what I'm hearing is that the Central Park exonerated project once they include some sort of thing happening with Lincoln right, would like, for whatever exhibit that takes place in Central Park to be interactive with the Social Justice Center right.\nI think the whole situation with Lincoln correctional is very convoluted and it does not reflect how we at community boards and like to approach things Others, you know on our executive, committee, you're, absolutely correct, I, don't think that that's anywhere near any point of real, you know planning Don't issue an RFP until you've heard you know from us You know, answer some accountability as to what's going to happen with that site.\nThat is our community, and we will not, you know, go peacefully, What I'm, simply saying is that with New York State in covert nineteen and budget considerations, I, don't know what's being planned or contemplated for Lincoln correctional, but I do know that the great work that's already been done and what will continue to be done on this?\nYou know for us to move forward with the exonerated fire project and, in my understanding, in the last meeting If we are there, we had some discussion about putting out, in fact that we wanted the Lincoln facility to be the Justice Center to the community.\nWe have not taken any sort of position on that other than a number of organizations, and you know even the borough president has presented things before us, but there's not been a firm resolution or decision by the community board as to the overall picture of linking Correctional.\nBut, okay, Thank, You, Terry I, just like to say that the focus of this subcommittee is the exhibit in Central Park, And. If you just read the notes, the minutes, we this just came as an outgrowth of the computation, but our focus and that's why we're saying we're looking to move that aspect to Echo dev, because that's not within this Committee's purview.\nWe've also are going to reach out to the n-double-a-cp for a letter of support, and these letters of support will go to the Central Park Conservancy in the New York City Parks Department, stating that this community would like to see this project in the park.\nWe all have ideas in terms of how we see this type of any of an exhibit being something maybe not necessarily like strawberry fields, but something around that type of issue where people are drawn into the space and there are different things as happening within the space that are that people can go for once comment to another and, let's say, grow within the space and come back and experience different things at different times as they interact with a space and its surroundings.\nIn terms of you, know, people who are able to do these types of works and pull these types of things together against structurally and trying to figure out even a site for it to be within the park, becomes kind of I.\nGuess part of these strategic planning kind of thing, because I know right here: : I get intense street when you enter the park.\nIf that statues are low, are they able are the children or people coming through able to touch these statues, because sometimes the size makes it more humane, as you're looking at a space and if you're interacting within the space, you know all those types of things in terms of how the space would work within a specific area within the park.\nIt now makes perfect sense in terms of she just gave us an insight as to some limitations of Central Park, you know, and that now you know, I mean a light, went off in my head to be able to say that's the extension to the possibility of a place like Lincoln correction, because if you've been in my gun, if you know Brian Steve's, there's equal justice, you know, there's a tremendous.\nA Families might not have been informed of the laws and things like that and what came out of Central Park five was a lot of Lords, so I think those should definitely be highlighted and somehow incorporated in some type of technological experience where young people learn about what laws came out of that experience and what happened and what's in place now from that experience.\nWe need to speak to everyone, but we also need to figure out where it is that we want this exhibit to be because we have to think of a space, because you know that space would close to the Harlem is going to change dramatically.\nAsk that letters go out from elected officials such as the borough president Gale Brewer, and we're looking at also getting a letter from Senator, Bryan, Benjamin and whoever you know we can get letters from, but and also we're getting we reached out to the DA's office and NYPD community relations and those letters will go to the Central Park Conservancy.\nWe can begin to have those discussions as to where things can go and what we, what we can do within the park and Just, because I love the idea of having an artist I, don't know how people feel about maybe Kara Walker, but I think just kind of around a lot of these issues and sort of confronting stereotypes which also like brings me to possibly a discussion idea, which is why people of color don't have the presumption of innocence in this country and how the until part, 5 didn't have or the exonerated five never enjoyed.\nThat means the help, for you is not readily available because as an innocent person, you don't really need any help, because this also speaks to people being able to speak on the impact of this on the community.\nI. Don't know if you can talk to that, because that's like a social service, but they think that's definitely talked about its impact on innocent people who go through this process.\nThe fact that you know these horrible things happen and this country doesn't change or doesn't change substantially right, And I think maybe some current young youth leaders from Harlem to engage the community could be really interesting.\nWords like Wilding came up, and nobody even ever heard of that who was from the community I mean children went to Central Park East, which was right there on 106 and went to school in that building.\n, I mean that kind of thing is done all the time, but it seems like one of the initial panels or one of the initial people that has to be on.\nYou know, in effect, you know, create a gentrification issue in part affect the surrounding community and the speak to what I think it was Chanel Said, because I grew up part of my life, while 113th Street I'm said to them that Park was always for forbidding place for people of color up and then into the community, because it never seemed like it was designed in part for us and I.\nI think you need to have a conversation with CDC to see where they stand and then decide on how we are going to attack this, because I can tell you that they didn't sound like you know, as he said.\nDon't want to speak to that because that's a decision that you know the board would have to make, but in terms of working in the conference of what they do.\nThey can answer some questions as well, but all of those things can be worked out as soon as we figure out the type of people that we need to have on the panel with in this conversation, and once you have that, then you just start filling our name, giving out the numbers in terms of that cuz.\nThe only reason that we have right now for wanting to talk with New York City parts and Central Park Conservancy, just to identify the space.\nSo I just like to you know just to get an idea with where this committee wants to go because Some people don't want to work with Central Park Conservancy in New York City Parks Department, but they have to tell us where we can put the exhibit so or give us some ideas where it can go and how we have to adhere to the context of the cart.\nSo different aspects of the movement happened in different spots along the park: okay, But if you're talking about a unified kind of area, my thinking in terms of the location is like you.\nBut you know in terms of having people to have some sort of walking around space.\nOther people can come and you know have a few benches in the space one person could be looking at one part of the exhibit in the park.\nMaybe we should have more clarity in terms of what it is we want, so that when we introduce it or talk to them, we have a more concise vision of what needs to be happening to satisfy our community needs within the space in the park.\nWe would like to see in the space and then do the walkthrough perhaps and identify the space once we know what the concept- okay, I'm thinking community board 11, because they had the whole thing about the sim statue in that area on the west, side.\nYou know, and within this forum that we have for what this panel discussion, which we probably were thinking about a broad one initially, which can I I, think I, don't think you're gonna be able to do to decide that by committee or at least a group, this large- And I think that it might make some sense to go back to the committee, the parks, your community chip manager that you chair and basically look at, maybe segmenting the different pieces of this.\nA lot of that will depend on who you are inviting to the table in terms of these conversations, because some people will be able to help publicize that this is going on, that money will be needed and all that kind of stuff will fall into place, and it just is, in my opinion.\nWhatever the time is going to be, people need to know when these dates are and then, as we meeting.\nYou might want to talk about the an introduction to the overarching concept of the project: Would be, let's say, the first piece, then the second piece would be kind of a slimming down that process in and moving forward slimming it down to a point where you kind of crystallizing it, and then the third piece is now We need to introduce, bringing in let's say the parks, department or whoever it is to get involved in terms of moving forward, because we've done our due diligence in terms of figuring out certain things, because preprints was good in terms of when he was saying how people who are down in this area get together.\nAt least it puts you in the in the process of trying to control some of the conversation and trying to let them know that you want X Y Z amount of space and that space is more than a plaque that says Central Park five."
    }
}