{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB11",
            "channelId": "https://www.youtube.com/channel/UCIlZuhawe3QWwxbglYpZMmg",
            "title": "Full Board 2/2020",
            "publishDate": "2020-03-01",
            "shortDescription": "Monthly meeting held at Einstein College of Medicine's Lubin Hall, 1200 Van Nest Avenue. Our meetings are open to the public."
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB11",
            "normalizedName": "Bronx Community Board 11",
            "twitterName": null,
            "youtubeChannelName": "Bronx Community Board 11",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "twitterHandle": null,
            "dateCheckLast": "9/13/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 1,
            "um": 4
        },
        "wordCountFullTranscript": {
            "people": 53,
            "community": 42,
            "office": 38,
            "board": 34,
            "meeting": 30,
            "bail": 22,
            "things": 21,
            "shelter": 20,
            "questions": 19,
            "lot": 18
        },
        "wordCountSummary": {
            "people": 19,
            "community": 14,
            "board": 10,
            "office": 5,
            "shelter": 5,
            "census": 5,
            "budget": 4,
            "district": 4,
            "bail": 4,
            "city": 4
        },
        "fullTranscript": "Okay, coming up as Gustavo Rivera state settler. Thank you, hello, folks, so I'm gonna stand kind of over here, which means that I can kind of look around everybody and still look at all the board members good evening. Everyone I know I. Your chair reminded me that I have not been here in a while. Thank you so much for rubbing that in it is being in the majority, is both exhausting and exhilarating, but mostly currently exhausting since we're in the middle of a budget battle, and so I will be giving you kind of an update of some of the things that are happening, and then it opened myself to any questions. You might have. First of all, I'll remind you that there is Department of Finance property tax. As this assistance we have out of my office, it is happening on Thursday, March 12th from 11 to 2. That means, if you are, if you're eligible, you can save money for applying for property tax exemptions, and you can come directly to this event in my office to speak to the Department of Finance representatives, you can ask questions to understand your notice of property value your market and assessed values, how to appeal your assessment, etc. I know that obviously, this Community Board is one of the ones that has the most homeowners in it in the Bronx, so I want to make sure that you know that is available to you in my office. Also I will remind everyone that we are in the that just a couple of weeks away from the census beginning not only in the state of New York, but across the country. We want to make sure that we count every single person in the Bronx and in the state. It is incredibly significant, as most of you know and related to the money that we get from the federal government, on education, on transportation, on health care, etc. So it is incredibly important that each and every single one of us gets counted. There will be many events that I am sure this Community Board will do that. The precinct councils will do I know that the electors offices, your local libraries, etc. It is incredibly important that this happened so that we count everyone so make sure that you pay attention to that. It's going to start in I believe March 12th is when it kicks off, and then it will be there for the rest of the year. So let's make sure that we make it a little bit easier on them and, as I was there's also tenant specialists every Tuesday from 11:00 to 3:00. In my office, that is a thing from 11 to 3. In my office on Tuesdays appointments are required, but if you are an apartment, dweller like I, don't know if I need this. What, if I? Do it don't do this in any event, so you could also get help in my office. So last but not least, a couple of updates about a lot of things have been going on. The first thing: I'll talk about briefly, so we find ourselves in the middle of an immense budget battle. The one thing I will tell you, as the chair of the Health Committee in the Senate my response. My main responsibility, as it relates to my conference, is to try to understand the proposals that the governor has put in front of us related, particularly to Medicaid, but also on other public health. Related matters develop a response from our conference, and then we have a process in a couple of weeks called the one House budget, which is when the Senate will present its version of the budget as we as we go towards passing a budget on time on April 1st there is, we can have a conversation as long about this as you as you would like. The short version is that, unfortunately, what the governor has thrust upon us would be actually what we currently have in front of us. As far as a as a budget proposal, it would be disastrous for the state of New York, very brief history back in 2011 when he was first elected, the Medicaid cost curve, in other words, how much the cost of the Medicaid was going up was kind of going like that, like a rocket, so there was something established called an MRT or Medicaid redesign team. That was not a perfect process, but what it did do was it actually flattened that cost curve and it made it so that the program would continue to exist while being renovated and being redesigned, and that was partly successful and we've been able to keep the program and not have it explode our budget. So since we find ourselves in a position where we are in a deficit, particularly around Medicaid, the governor's response is to create MRT to the Medicaid redesign team -. We all know that sequels are always better than the original jaws, for that was a killer. That was the that was the one everybody remembers, but in all seriousness, what this process has been, unfortunately, has been opaque at best behind closed doors. At worse. Not real inclusion of Health and Hospitals, which is the public health system in the state of New York in the city of New York. No, real inclusion from federally qualified health centers, no real inclusion from doctors from nurses from nursing homes and unfortunately, even the people who are named to the MRT are not being fully included in the process. It is, and I will all said. I will say this for the record. I believe that is obscene, that this governor is choosing to cut services for the most vulnerable across our state, as opposed to and, among other things, generate new revenue by taxing the ultra wealthy billionaires millionaires in the state of New York and there's a lot of things that we can do, which would impact not a single middle-class person in the entire state, but would generate billions of dollars and would help us to not have to cut services to the most vulnerable. So we're in the middle of Sallu bless you. So that is the main thing that I am focused on and I will briefly speak on this, although I'm sure that there were questions about it on issues of bail, reform and I know that there are questions about it and I will be here to answer any questions that you might have also have a colleague from the Bronx defenders. Justine is with us, which we look and answer any questions that you'd, like the short version that we'll give you is the following. The reason why many of us believed very strongly that we needed to do, but we needed to do bail, reform and I still believe that it is an important thing that we did was because for many generations the criminal justice system, unfortunately criminalized poverty. To put it simply, you all remember Harvey Weinstein, now a convicted rapist who everybody in this system is considered innocent until proven guilty. But after dozens and dozens of credible accusations that he had all sorts of things that he was alleged to have done, he spent 20 minutes in front of a judge and because he was a millionaire, he got to go home and chill until the court date that just happened a few weeks ago, as opposed to that somebody who was a constituent of mine, kalief, Browder, a 16 year old boy who was arrested for allegedly stealing a backpack spent three years in Rikers Island, two of them in solitary confinement until the charges were dropped committed suicide later on from the PTSD that he got from being in Rikers Island from being accused of a crime that he did not commit and a crime that he didn't want to plead to. He didn't say he was guilty. He could have gone home with a record or if he had the money he could have posted bail. He could not do that. He spent three years in Rikers, ultimately, certainly any bill that we pass. None of nobody's, perfect and I'm sure that there are things that we could do to make the system better. But I will reiterate that I believe and I'm going to finish with this, to open it up to any questions. I stand with the actions that we took last year, because I believe that we're trying to change a very complicated system but I believe that we need to stand strong on what we did, because this is about making sure that we change a system that had, for many generations, criminalized poverty and done so in a racialized way. That is a system that we need to change and it'll be difficult, but I believe it is necessary. And lastly, before I hand it over I am sure that, even after any questions that I might answer this evening, you might still have more I'm always open to them, and even but sometimes you might not have questions, and you might make a decision that, because of this action that I have taken as a senator and the defense that I am making of these actions, you might decide that I am someone you can no longer support. If that is your decision, I will respect it. I will still represent you, but I will respect it, but I believe it is something that we needed to do and I'm glad that we did it with that. Mr. Chairman I pass it on to you, so we have a quorum now. So the meeting will officially begin at 7:29 p.m. we obviously heard Gustavo senator Rivera speak generally. Questions come from the board members. If there are any, if not, we will continue with our Dom shanem mic. Well, do you have a question for I? Might as well just keep the questions all the way since you just got done speaking I. Don't you have a question I understand what you're saying about the bail reform and stuff like that? Yes, sir okay, but that needs to be tweaked really good, because if you have somebody, like you, said the gentleman you were talking about no prior convictions, you know clean as a whistle I understand the fact that he should be let go. But if you got somebody you know with 38 or 40 arrests prior to that, okay, that should be in the judges hands as to whether or not they should be a bail, and you know what it should be set at couple of things. First of all, we are in a system in which anyone, regardless of how many times they've been arrested or even convicted if they are arrested of a new crime, they're considered innocent until proven guilty. That's number one number two, the question that has to be asked and I know it is a tough question to ask, but if someone has been arrested, 35 or 40 times for what would be potentially minor infractions, the question we have to ask is: what are the things that we are doing, which make it so that person sees no other option except continuing to do this, unless, if there is a belief in some folks in this room and in this world, might have a belief that there is something that might be inherently wrong with that person that is possible. Certainly, I do not believe that we're talking about the majority of individuals. Lastly, I will say that, unfortunately, many of the things that have been said in the last couple of months, which I remind you, it is as long as the bill has been. The law has been in effect just a few months, as opposed to the decades and generations that the prior system was in effect many of what it was. What have been of what has been said has actually been inaccurate and has been if there's specific concerns. For example, on there's a there's, a bunch of bills that we passed, one of them related to speedy trial. The idea that somebody as is constitutionally protected, should have a speedy trial available to them and when we change the law, some district attorneys brought up legitimate concerns about some of the resources that would be necessary for them to be able to make it happen in the timeline that we set in the law. That is a legitimate concern and we need to actually what we're having the conversation right now during the budget about how we give them the resources necessary, so that they can put the staff on in hand so that they can provide for the law to be observed. But in many instances of the as it relates to bail reform. Many of it has what has been said has been inaccurate exaggerations and, in certain instances, someone who has been accused of a crime for which they can actually currently be remanded did not get remanded. In other words, the judge could have chosen and did not choose to keep them inside. Currently, so in many, so I've I would say that the thing that we need to underline- and we need to remember, is that there are literally thousands of people who have been able to go back home at the end of the day and not have to stay overnight or for a month or for a year or for two years have been able to keep their jobs, have been able to keep access to their children, have been able to go back to the shelter that they live. In I mean there was a story that I read for a court watcher who had somebody who was released and that it was a client right. It was a public defender and the client said. Is there any way that you could get them to actually put me in jail overnight, because my curfew for the shelter that I stay in is already done so I can't go back there. I would have to sleep on the street and it's too cold outside. So I would say that, while certainly if they're legitimate concerns I want to hear them when somebody says tweak I'm like cool, tell me how tell me what needs to be done. We had the district attorney here a couple of months ago and last month and she had a lot of ideas. So maybe we can have the community board, send her a letter and tell her to get in touch with your office, and you know, and I will tell you that our that just the district attorney has been sitting down with one of the main sponsors of the bill, senator Jamal Bailey, and they have been having conversations about by the way there has been some. There have been a lot of folks who have said that we did this too quickly and that we did not include district attorneys. In that conversation, that is literally a lie and I know it for a fact, because I was in Albany when my colleagues, particularly Jamal Bailey, who again a Bronx senator, and he was one of the people that was main one of the main people behind this, as well as Senator Sepulveda. Who was the chair of a crime, victims, crimes and corrections, both of them had innumerable meetings with district attorneys, both representatives of the district attorney organizations as well as district attorneys themselves, and then to turn around and say like well, they didn't talk to us. That's not accurate, so I would say that there are conversations that are ongoing and if there is something that is put in front of me as I try to do with every piece of legislation, I will take it into consideration and I will look at what is there, but much like the speaker of the of the assembly who has taken the position that he needs more information to see how this is working. I take the same one and I need more information to see how it is working for the moment I am standing, I am holding the line on what we currently have in law. Thank you, sir okay. Thank you very much, sir I'm gonna stick around for a while, just in case. Thank you. Thank you. So does anyone my canary win right? Everyone rising will do the Pledge of Allegiance, so four nine precinct could not be here tonight. They're dealing with some other issue, I, was told and will go into the gallery session will start with Justine alderman from the Bronx defenders. You saw it, you have wait. One second, though, will tell you to two minutes. You have to speak and the only questions you can entertain are from the board members around these tables. As you mentioned, I'm Justine alderman I'm, the executive director at the Bronx defenders. So I'm gonna. Do this the senator and step back a little bit. Thank you for that lead. Look, there's a lot that the senator said: I don't need to repeat it, but what I can share with you is that I have been a public defender for 20 years in the South Bronx and we represent tens of thousands of people every year and what I can tell you from my 20 years as a public defender is just how incredibly necessary this bail. Reform was and I say that, because, as a public defender, I bore witness every single day in the courtroom to how bail literally tore families apart, I mean imagine just for a second. Your neighbor accuses you of having done something having stolen something, and you think okay I go to court. The court process is gonna work I, you know, I get the benefit of the presumption of innocence, just like everybody else, and to go to court and never come back out to be put in a jail cell, separated from your children, from your parents, from your siblings, from your loved ones, not be able to return to work, not be able to take parents to their health care appointments. It literally tears. Families apart and destroys lives, and it doesn't matter if you're innocent. It doesn't matter if there isn't enough evidence in the case against you, because that single decision that got made for you to be held in on bail is the thing that will ultimately unravel the fabric of your life, and so I saw countless times. People who were ultimately found not guilty were the prosecutor themselves once they carefully looked at the case, ultimately decided to dismiss, but it didn't matter because our clients lives had been destroyed. The other thing I want to stand up here and tell you is that, even though it has only been a really short period of time, bail reform is actually working and I hear the concern I mean if I could just finish this one point: I hear it's up to the board. So does anyone have a question Bernadette. Thank you. Thank you for raising that. Let me speak directly to that. So I think you're talking about two different things. One has to do with discovery or form, and one has to do with bowel reform and both raise these questions that are legitimate about. How can we make sure that witnesses and victims are being protected so in our discovery law there is already a provision that allows judges to issue protective orders anytime. The prosecutor goes without me be present. They can do it outside of the presence of a defense counsel and make the case for why. Actually, there should be a protective order and that information should not be turned over and when it comes to bail, judges have so many tools at their discretion, so they can put money on electronic monitoring. They can send them to supervised release, they can issue an order of protection and if a witness is intimidated or threatened in any way, the judge actually has the ability to put that person in jail. So what you don't hear a lot in the newspaper and on the front page of the post, which is understandable because it doesn't make headlines, is that this bail bill is so carefully tailored to address exactly those concerns. So I would really encourage anyone who has them to literally open up that bail bill and take a look at all of the different ways in which judges do have discretion, to make sure that everybody is safe. They the accused, who's, presumed innocent and witnesses and victims alike, I, don't know either Lisa or Edith. My question is: I would like to hear your last. Your last point that you were trying to make. Thank you so much so, though, one piece that I was just going to add is that one of the things are just sit by and watch is that you see the front page the tabloids and it can skew all of our senses of what's really happening so I can count. Maybe there are 25 stories that understandably make us uncomfortable, but, as the senator said, I have pages and pages of what the facts are in each of those cases. If anyone wants to come up afterwards, I'd be happy to go through it with you, the vast majority of those instances. First of all, they involve people who are really struggling right most of the time. Those are people, sometimes it's obvious from the reports. Sometimes it's not who are struggling with addiction or mental health and for decades. The way we have treated people who are suffering among us is to jail them, and that has not served us well to the instance where somebody is getting out in the senator mentioned this and is getting arrested over and over again. We have a real opportunity as a community to say maybe there's another way. Maybe we can do something better, because actually studies show that incarcerated people who are struggling exacerbates all of those underlying issues and really does make it more likely that we're going to see them back in the criminal legal system you just put, sir, is that on just somebody to click it, please don't touch the buttons unless it's red, just let me know so on person- is innocent to go out without bail. However, you don't talk about the other side of the coin. What about the people that are not innocent that are guilty? You, let them out two days later, they're committing a crime that puts all of us into danger. So I think. The question that we have to ask ourselves is: how do we know that? How do we determine that? Is it based on an article in the New York Post or at some point, do we have to actually let our criminal legal system work right? If we believe in the presumption of innocence, then we have to believe in it for everyone, regardless of what that front page of the New York Post says a regardless of what you know. Information might be put out into the universe in an article and one of the things that's important to note when it comes to judicial discretion is somebody who is out on. Let's say you know a felony case and gets read in another. The judge actually can in fact put them in jail. So the question is: if somebody comes through one time on a first offense, let's say right, the question is even if in our hearts in our guts, we think I think that person is guilty. If we act on that and we act on that information, we are essentially dismantling our entire legal system, which I think most of us feel enormous pride in. How do you explain a person being arrested for consecutive days? Robbing a bank and not being able to be a judge, have a discretion of putting him or her on bail? That's a poor excuse for this law. I'm. Sorry, if I may I'm not sure there was a question in there but I'd like to okay. Thank you. So that is a perfect example where, obviously there is something going on with that person where their underlying issues are not being met. If you look at the stories that were written right, that person had a long history of being in and out of the criminal legal system and under the old standards that we had the ability to hold that person in jail. It didn't work so going back to the way we had it be for isn't going to help that person either, and so we have an opportunity to say what are the tools that now judges have that. Actually they didn't have before we didn't have electronic monitoring before we didn't have supervised release in the way that we do now. We didn't have the resources before that are being put in to addressing the underlying issues, and in that particular case, when somebody is arrested on a felony and gets really on a violent felony offense, the judge does in fact have the power to keep them in jail. Great. Thank you. Mike does work. It helps if I remember, which number it is so I can unmute it. A gray, Slovakia clergy counselor of the 49 precinct hi good evening. I am just I'm here to talk about the banquet that we're having on April 2nd at my Astros, the clergy council of the 49th Precinct we're having our fourth annual fellowship banquet, and we are hoping that everyone will attend. It's going to be having our new Commissioner Shea's our keynote speaker. Letitia James is an honoree Carl, hasty captain atif and some others as well. We also have a journal and I. Don't have I wasn't able to get bring fliers the Machine the fly at the copier wasn't working, so I don't have flyers. However, if you want to call me or text me, your email addresses. My number is three four: seven, six, four, six, four five text me an email address, and/or phone number and I can send you the Flyers regarding that one way onto another note, starting April 4th at the allerton library we're going to have a poetry workshop for four weeks, starting April 4th. If you need more information, just call Mannie at the library Alison. Thank you. Thank You, grace, speed and Manny he's our next guest speaker, Manny Martina's, New, York, Public, Library good evening. Everyone happy to be here, so we got a lock cooking up at the library this year, we're celebrating the library's hundred and twenty-fifth anniversary, so that throughout this entire year calendar year, we're gonna be doing a lot of events that focuses on that and really highlights what's going on at the library. So it's a start off in collaboration with the Assemblywoman Natalia Fernandez we're gonna be celebrating Black History Month. This Saturday with the film screaming of Selma, followed by a discussion and it's gonna be from 2 to 4:30 and then for Women's History Month next month, March 21st from 1:00 p.m. to 2:30 p.m. in collaboration. Also with the Assemblywoman Natalia Fernandez, we're gonna be doing an adult, brunch and paint so it'll be it'll, be food. Air there'll, be beverages for everyone and, as of next month, we're gonna be really focusing on census, so census work for the Allyson library we're a hub branch for census. So our focus is census, so I'll be a lot about that, but we are going to be doing a census kind of 101 to inform people what the census is. How can they? How can they complete the census? We're gonna be having kiosks there and this those dates are gonna, be March, 12, March, 20th and March 31st, all ranging at different times. I've left the flyer at the front for more details. Talking about children, we're gonna, be in with literacy, Inc we're gonna, be celebrating dr. Seuss's birthday, so host the literacy workshop. First 24 families will receive a copy of The Cat in the Hat and I'm beginning this Monday we're gonna be doing a crocheting workshop for 8 weeks, beginning this Monday, that's geared towards older adults, 50 and older, then later on that in March we're launching a studio, we're launching our studio that has video, editing, audio, editing and podcasting great. Unless there's questions we'll move on to our next guest speaker gallery sessions figure it's Vinnie, Marie Lyon regarding the PS 108 annex I did speak at last month's community board meeting regarding this issue. We are under the assumption that the annex is starting to be built this spring and it's a concern of ours that there is no current middle school for our kids to go to after fifth grade that PS 108 caps at we've been to CEC meetings we just kind of hit in roadblocks. We really need the community's support to carry us to 8th grade, like I said: there's no quality middle school for our students, currently in the neighborhood and I'm just here to get advice, feedback, support, suggestions and how to make this happen. So I spoke to the principal of the school today and he said he has a meeting with the school construction authority next week and at some after that, he's going to touch base with me, because he I suggested that we have a meeting a larger meeting, definitely at least with stakeholders, because they're you know there was some discussion with the NYPD want to make sure I was on the same page. I will definitely bring your concerns to that meeting. I'm in terms of a larger public meeting. I don't know what I was told that the school Construction Authority usually does that without notices, I, don't think, I have a meeting, though okay, so I don't know. If you emailed me, I think somebody emailed me maybe I was at the youth board meeting with Bernadette. We couldn't hold an official meeting because it wasn't enough people, the education community, I, know the quorum. So again, I encourage you to email. Me I gave somebody a card last meeting. Okay, I can give you more. If I can find them, you can go to our website - and our contact informations there. Okay, I, recommend emailing everybody on that contact, so the whole staff and the chairman of the board, okay, great I, can and I'll take your concerns, I'll forward them on to the principal okay. Perfect. Thank you so much. Thank you a question from Bernadette and we should be putting money into our future, which is our children, so you need to well. We can try. If you can you put that in an email to me. Thank you. Baraka Castro board member representing board now representative or member, represent a Latina. International merchants represent the board thirty seconds I'm the secretary of the alt international Merchants Association. Currently there is talks of a bid coming to Allerton. We feel that the bid should be transparent and they should come before the community boards and answer to the community boards. Allerton bid is not popular among the rest of the merchants and the property owners. Currently, a letter of support is being disseminated around Allerton. Those who have expressed opposition to the bid have not been included in the conversation to express the opposition. None of them have excuse me, huh, none of them have been come or invited to any of the discussions, only people that they invite our people that they believe are for the bid they wait until the bill. They have both support before announcing the votes and threaten and intimidate property owners and merchants, while they're doing it they make statements such as. If you don't support the bid, you will not have a say in the bid. We as a merchants association will not let the merchants and owners who have served. This community for generations be silenced. For this and more we oppose the proposed bid. We will seek reparations for the damages caused by the process of by this process to the merchants association. Sorry, that's our statement. Thank You, Debby colic, also board member I'm, not sure. Just speaking generally I'll make this short and sweet. Psa t3 is having a blood drive on March 19th from 2:30 to 7:00. Anyone who knows me knows I'm an avid blood donor and platelet donor. Please take a little time. How do you day to stop by and donate a pint of your blood? You never know whose life you might save blood is always a limited supply, there's currently a short supply of blood. So please take time to donate it's at PS 83, the annex building, March 19 - to 237 Thank You, gdo7 tele from the Bronx Italian American, Cultural Association. Just remember, Gallic such as speakers. You have two minutes at the 30-second mark. Frano will raise the 30 seconds and then and then, after that, it's over there's Lulu. Speaking with you good evening, Treaty of cement le, as you stated, Bronx an American culture. Association I've been in this community 14 years. What our organization and I came here tonight: I'm. Actually a Pelham, Bay resident and I came here to warn us your support for the 1,400 against the 1,400 blundell Avenue. We were supportive and for 2500 Williams, which wrote we had a lot of our members informed the neighbors I participate in a lot of the events and we're gonna fight for community board, 11 I, hope community board. 11 will oppose this I believe so. I participated the other night. What the combined hear public hearing on the shelter a fortunate they were not enough people there I wish there more people will show up at these meetings and I want to take my last few minutes and talk to senator Gustavo in reference to his statement, senator Gustavo and Natalia Fernandez, or taking a position that they not going to amend justice reform or bill reform. While there needs to be some reform, we have Democrats in Albany. Now we have the governor. We have other leaders in a Democratic Party, it's not a Republican thing. It's a democratic membership of the assembly and the state Senate that are talking about amending justice reform. So if we understand here and praised this, you know I when I've rather praised some of the people and some of the kids that go and get five A's, not five jail or five summonses or criminal things. So we need to take an add, a different attitude. Senator we have Democrats up there change your position, stand with the people. The people are suffering out there in the streets. Not you. Thank you. That's right: Efrain, gonzales, homeless, shelter, hello, everyone I'm me friend, Gonzalez I, work at Einstein, monster, Fuhrer and I actually live in community board 10. But the issue that I'm bringing up here is when I attended the town hall at the Rotunda of Jacobi I was really shocked that anyone would want to put a homeless shelter, certainly on a in an area where it's industrial, it doesn't say too much about what they think about homeless, but I. Just don't believe that in that yeah we should have it near a Lehmann, high school or a daycare center, and that's what we're. Having and I want people in Community Board 11 to understand that both of these community boards really are cohesive in a lot of ways. A lot of homeowners in community for 10 more in community board 11, but we do share the same councilmember most of the time, and so I am against that I'm against people coming out of Riker's to go to a homeless shelter when there was no screening process about what you're gonna see this doctor you're gonna do this there they're talking about substance, abuse clinic in the homeless, shelter and right away that sent up a red flag because then I believe that Oasis will get them approved for a methadone program. So what I want people to understand is, even though you don't see it in the in the in the blotter, it's there in the fine print. Lastly, I'm gonna close I was made aware at that meeting from councilman Marc Jonah, and it offended me that there were people attacking members of community board 11 and 10 and I want everyone to know. It is unacceptable for anyone to attack any member of a community board because they have an issue the way we fight those issues is we come together and so I just want you to know that. That's how I stand? No violence, we're gonna, talk against bail reform and we're gonna talk about tweaking. We can't accept anybody going in there and attacking the people that change things in our community. Thank you. Thank you. Larocco, homeless, shelter again good evening. Everyone, my name, is Lou. Rocco was just a square Civic I got two parts to this. One is that I am NOT for this homeless. Shelters I support the community board also to go against this homeless, shelter being put there. The second one is that in your community, when they speak about putting people out on bail, I'll give you a live story. That happened no names, no, nothing still in court. Man is arrested in your community for banishing a gun wants to kill a bus driver that just had a new baby goes to a grand jury. Everything is ready. They let him out he's in your community again walking around with a sawed-off shotgun, the 49 precinct raids, the place of his residence he's out there selling dope and whatever he has the resources to get out on bail. He owns property, so you have the same criminal vanishing. The gun walking around in your community. Should this guy with two felonies: no convictions yet, should he be still walking around in your neighborhood and as far as intimidating a witness? How would you like to have someone come 12 o'clock at night? Looking for their golf ball in your yard, or attempting you looking for a golf ball? Is that it's not good with that? If we had the information at that point or video, the person with the gun would have been arrested, the judge would have had something. This guy is still out he's in your neighborhood, okay, violent felon, violent drug-dealing lives in your community, so think twice. We need reform again this here, letting them out and we became the victims. It's very bad, very bad. We are all victims we need to go and everything relates on your elected officials to change these laws. They need to be changed. We want strong I'm, not a liberal I want to come home and that man with the bus with a new baby he wants to come home to his new baby. Thank you, Robert press. You were 11 resident community board 11 resident day after three community board 10 residents, I speak as myself. Robert president of community board 11, who attended the town hall meeting on 1400 Blondell Avenue. Now whence community board 10 and 11 were holding hearings on Blondell Commons. There were concerns, but the Westchester square bid gave a letter of support for the project which included rezoning the area to an M 1, and the bid was to get about 100 parking spaces for that letter of support. I said at that time be careful with the zoning that you change it to, because you don't know what's gonna happen afterwards. You now find out, what's going to happen, that allowed a community facility, a community facility that can be a homeless shelter. The Department of homeless services will put this shelter in no matter what you have an option here and a unique option to community board 11 because you're responsible for 397 homeless families. You should make a resolution tonight to the Department of homeless services and demand that they do not put an adult man, shelter there and they put a Family Shelter there. I say that, because why is there so many single adult men homeless? Right now, okay, I, ask that of Mayor DeBlasio on February 4th two weeks before that homeless, shelter, meeting, okay, mayor de Blasio said basically that we have an influx of adult single men. Why all of a sudden, because the no cash bail law went into effect and any person in jail, how to be let out if they were on bail. So you have these people now out on the streets, the homeless and they have to be found home somewhere. Okay, once again and I will say that if you let this homeless shelter be built for 200 adult men, you will have level 1 and level 2 sex offenders in there. Not what councilman, John I said about pedophilia I burn it for if I can. If I can answer that, the mayor said that community board 11 homeless people have been placed elsewhere. He tried to say they've been placed in Queens in Manhattan in Brooklyn. Okay, however, and he said he's going to replace them with people from the Bronx now the homeless provider, who, by the way, has a corrective action plan because they can't account for their time. Okay has said that they will take him from the community board, the Bronx and the city all right. Thank you Bob. Last but not least, we have Marissa Davis securement kervins bar 736 lighting. Thank you for allowing me to speak. I'm the owner of kervins I was denying an extension at the last meeting due to a description of two events on New Year's Eve. Not only with this set was the second event a flat-out lie, but transcripts were provided, proving that it wasn't true. Since then, I've had no retraction of those statements. I've had no ability for due process and bigger than this I feel that two events in 24 months is a really small ratio and I could have invested anywhere. I came to the Bronx, because this is my community and I feel that I've gotten a really hard shake from the community board. This is the city that never sleeps we're all residential and any socio-economic development starts with bars and restaurants, because any neighborhood in this city, that's something that someone wants to live in has bars and restaurants I feel that the Morris Park Tavern was given till 3 a.m. on their first liquor license. I was given till 1:00 and 2:00 a.m. after two years. I think two incidents is really miniscule to the bigger picture and I'm being denied the market share, and not only that things were said about me at the last meeting, like I said that was given transcripts and nothing has been done about it and I think there needs to be a due diligence before statements are released. That are not true and I need to have the opportunity to be given due process and have a QA, because you're affecting my business and I could have gone anywhere and I didn't go to Brooklyn and I didn't go to Rockland County, where I'm from and I didn't go to. Scarsdale, where my mother lives, I came to the Bronx and I'm, not getting the support that I should get as a minority and I think that you should look at the people that have been open, till 4:00 a.m. like the pool hall. That was closed because the owner wanted to close it, but she didn't take out an abatement and he had dozens of calls for the years that he was open and I haven't had anything like that and I'm, not given a chance and I think you should rethink it. Thank you. This is any questions that will close the gallery and we move on to elected official. Thank you. Thank you. Elected officials, portion Ruben, Diaz Jr's office issue, Koons Oz good evening. Everyone, my name, is ich kann Zaza's I'm from the Bronx borough president's office. I just have a couple of announcements here, so the borough president releases, his monthly report online I- did not bring it with me. I would not want to read it it's about three four pages. So, if you're interested and reading that please take the time to read that at home, I'm assuming so also the borough president is hosting a LGBTQ career. Fair excuse me ish. One second, can people in the back please step out into the hallway or if you're going to talk. Sorry. So, as I mentioned, the borough president is hosting an LGBTQ career, fair on March 20th at Hostos Community College from 1:00 to 4:00 p.m. so. If anyone is interested in that you can RSVP ahead of time, they're also going to be assisting with there's gonna, be a resume workshop there. So if, as I mentioned, if that's something you're interested in, if someone you know is interested in that, please feel free to share that information with them. The next two announcements I have are for the board members I know: Community Board 11 has done a pretty good job at submitting their reappointment applications, but if there are board members that have not sent that into our office, yet please do so the deadline for that was February 7th. So we are well past that so please forward that over to our office as soon as possible, also the sexual harassment training, the deadline for that was also February 7th. So if you haven't completed that, please reach out to Jeremy or you can come to my office, give us a call whatever works for you, and we can set you up to take that training. If anyone works for this city, the city of New York- and you already taken the sexual harassment training at your job, you can also take send that's a certificate to us. That's all I have thank you very much just here where, if you didn't know couple board members reach out to me last week or if not the week before about the renewal application, which I did not receive from the borough president's office until yesterday, so they have, they never received the initial reappointment. That's what they told me, and they told me either last week or the week before, and unfortunately, I had to wait to get an email, because the renewal applications now online, the brand-new application is but I did get that yesterday. So that's why you probably haven't received at least a couple of word members as renewals. No problem at all. Thank you. Thank you, ladies and gentlemen, and I want to introduce the next gentleman. He represents mark Joe nice office, he's back Tommy Messina thanks Tony for that introduction, I'm glad I'm back. This is not my event, because I just sold an hour and a half before five o'clock to come here, because somebody else could I think farad. Does this? Okay? Listen, there's a lot of information here for Mark's office, just a few things here: free tax preparation! You know for people with incomes, less limits of 66,000 come to the office. It's on the back end that table not that table that table reusable site bags, Mark's column in the office, - February 28, so you better get there soon and starting March 1st. You know they're gonna be charging for the bags free, immigrations service. You know if you got any, probably any questions. You call the office at seven, one, eight, nine three one 1721 and they got the SAT prep class. But there's like thirteen different flies back there there's a lot of information. You know take it. Of course you know it's a lot of important information that we can use, and we all know that mark is against this Blondell. You know we're fighting it. Listen everybody's got to really put their into it, getting Bob and try to nip it in the bud. All right. Thanks very much Thank You Tommy councilmember Torres is office. Drumming master Thank, You Jerry before I get into the report there was I was the chair of the Land Use Committee and many people are not on a community board when Blondell Commons was a Uhler that had nothing to do with anything else. In EM, 1 -, one residential people are not. You can't have a residential building, so we did a euler for just that piece of property, although in EM 1 there's one which is light manufacturing, you can have a community facility which is a library, a homeless, shelter, anything else. As of right. That means there is no people. You know the city doesn't have to come to. The community board doesn't have to say anything so by us doing that you lurk for Blondell comments had nothing to do with this other project. This project is out of write because it's a em one - one like I said, is a very low-key manufacturing district, so I just want to straighten that out before I went any further. The councilman, like many of the council people, are going to have free tax prep. You got to call the office also. We are doing participatory budgeting this year. That means we take a million dollars out of the 5 million dollar pot for capital improvements, and you can do anything that will last more than five years. That means it has to be something like if you were in a nature development. You want to put a door in you know that'll last 5, 10 years, I got 30 seconds, left, ok and the what the I think the best part of the whole thing is anybody 11 or all that can vote. So you can get kids involved voting, especially if they're doing something for their own school and if you need any more information on that, please call the office seven one. Eight four, two: eight one: zero! Thank you: council, member Kings office, robber, press parking, calendars, bike, smart official guide to cycling in New, York, City, pamphlets and on March 12th, councilman King will be holding his state of the district state of the district me. It will be at PS, 41, 33:52, Olin, Villa, Avenue doors will open at 6 p.m. the state of the district is 7:00 to 9:00 and, as councilman King says, people pay attention to people who participate. Thank you. Thank you. We have two people from the DA's office. I, don't know who plans on speaking, okay, so Christina good evening. Everyone, my name, is Christina Calderon I am a community engagement coordinator within the Community Affairs Unit at the Bronx DA's office. As you all know, the a Clark has been making her rounds to Precinct Council meetings, as well as community boards to talk about three components of the criminal justice reform, bill discovery and speedy trials. She does say her stance on it as well and for the record I would like to say she has never denied sitting down with the legislators. Just want to put that out there. Thank you to members here. There is a significant uptick in what's called a grandma scam. It attacks elderly people. For the most part, these are phone calls which the caller has information about. Your children or your grandkids and they'll get on the phone and go grandma. You can't understand me because I've been hitting the mouth and my teeth are hurt and I'm locked up I'm in the police department and I need you to send bail money. Can you please go to CBS and get a gift card and then give us the number on the back? It's imperative that if you did not initiate a phone call and you had just passed it to the elderly people, especially they should question any phone call like that comes in to them, try to reach out for the individual. That is claiming to call, and if you can't get that person call another family member. Shockingly, my own mother got hit with this about a year ago and after 12 years of being told not to fall for this. She was on her way to Walmart before she called me. Great Blitzer. I have something to say about that about three weeks ago, I got a call, hello, grandma, yeah, it's Jeremy I had a very bad car accident. I hit a pregnant woman. All right, I have stitches Isis. Really. Won't you tell your mother, he says: could she go crazy and says you know: I called her a few choice words three times, though, after that they've called, and they no way we can stop these goals. Well, I can't get into any details about how to stop the calls, because it's something I'm working on with the police department right now, but that aside, it is very common to play on your emotions and to immediately tell you don't call my mother, don't call my don't call fill-in-the-blank, because, though they'll go crazy, just send me the money and the whole problem will go away all right. That is a scam 99% of the time the elderly. People in the community must be told to be careful because they are the targets. They don't go after people in their 20s or 30s Thank You Alexandra I go Kosta cortezes office, dusty Cruz good evening folks. My name is destiny. Cruz I am field representative and caseworker to congresswoman, Ocasio Cortez, just a few updates from our office last well. Actually, just last week we had a town hall in Queens, fully surrounding the census, and so in March we will have a census. Town Hall in Van, Ness I, invite all of you to come. I will be sharing the Flyers as soon as they become available to me, - Jeremy, all of our Civic group leaders here I, want everyone to be present. It turns out that Van Nest is one of the lowest counted neighborhoods in our district, ok, and so we want everyone to get counted. I know we have folks from the New York Public Library here in Allerton, I'm I just met Manny tonight, I want to stress over and over again the importance of getting counted. We work with the federal government. We are the ones who send out that money. So we recognize that importance and we want to get as many resources as possible to you all. So, as I said our Town Hall next month, we will notify you. That being said, I am quote. We are co-located with Assemblymember Cardenas Reyes at 1973, West Chester, Avenue I. Am there every day except Wednesday, 9 a.m. to 5 p.m. please find me later take my business card. If you need any help with USP, yes, IRS Social Security, anything like that feel free to come. My way, thank you, Burnett and then Fran, oh sure, is it? Is it on you see the lights on light? No, it's recorded, please because I mean when we do the minutes. If we can hear it, if we need to write something, is it green? It's a light. Green yeah, that'd be wonderful, and just yesterday we heard that the location was approved so yeah for sure for sure, and that's why we're announcing it here. So everyone's made aware well in advance. We just started planning it this week and so we'll definitely connect for sure all right, Thank, You, Fran, o segredo hi. Why can't you have satellite hours in the board office, so it better represents this area instead of just well. You call share the office. I mean honestly I understand she chosen not to have an office but to leave a big chunk of the area and represented it's shameful. Okay, so we are co-located with Assemblymember Reyes, just as we would be like we were planning with state. Senator Biaggi I am physically the only person in the Bronx, and so when you ask me to try to stretch myself thin, it's really difficult, because then we don't want to neglect all of our constituents. Parkchester is essentially a central location. We know we have Morris Park. We have some folks in City Island, but we also have folks out in Throgs Neck so park. Chester is just that middle area that we found to be the most efficient and effective. That being said, I'm more than happy to continue the conversation, Jeremy and I can maybe meet, and you as well. We can discuss a day that I can come, maybe once a week once a month, something like that to make it work, there's not much discussion. You just tell me what works for you now tell you for it's available great, have a computer for you, okay and then senator B AG's office, Emily, Vazquez Emily. Still here, hi folks same announcements: we are at Bronx house every Wednesday from 10:00 a.m. to 3:00 p.m. the first Wednesday of the month. We are there from 3 p.m. to 6 p.m. to accommodate folks that work in the mornings and maid evening hours we're also available during the evenings. As long as you MLS and let us know, we can work that out. I have one more announcement and that's that we're hosting a woman's herstory event next month at the end of the month and I'll have more details pending. Details are pending. So if anyone has any questions, no okay, thank you and then last but not least, we have for HOD from Assemblymember and Italian fernández's office. Hi, everybody just two quick announcements. So we are hosting a free housing services at our office, the first of every Thursday of every month, so first Thursday of every month, sorry I saw that awkwardly, but Nyko will be providing services. So if you have any issues with eviction, if you have any issues with the one-shot deal, if you're trying to get some housing services, please call our office schedule. An appointment is half hour slots, we're more than happy to accommodate you. The first Thursday I think Thursday, the 5th March 5th is the first one it's already being booked up. So if you guys want to, please call. Secondly, over at Traci towers, I know it's a bit of ways, but we are doing a presentation of the state budget. The Commissioner Ruth hassell-thompson, whom some of you may know where the senator will be co-hosting with Assemblywoman Fernandez, so we'll be there. That's gonna be February. 28Th presentation starts at 6:00, but doors open at 5:15. Does anybody have any questions? No! Thank you very much unless I'm missing anyone else that ends the elected officials portion and will now turn over its Chairman's report. Tony Battaglia good evening. First thing up: I need a motion to approve the January 2020 full Board minutes a second by 8:00. It open for discussion, all those in favor against abstentions, motion approved, I, didn't next issue I'm going to mention in everybody's folder jacket. There was something about meeting attendance meeting in tendance, okay, we also put down in there one sheet, which applies to the full board meeting and one sheet that applies to the committee Beaton's. If your name is on there, please, you know they. You know, try to make these beans, because we, you know, for instance, on it that does affect the committee means that's terrible. People are not having meetings of Sanitation that affect the transportation and I think one other one. There was another committee, Public Safety, those three committees, I mean they can't have a meeting unless they have a quorum. Now, if your name is down here, please try to attend. These beats I'm not going to go around threatening people. Anything like that. But you know we have bylaws and we're not we're not we're not doing anything on the bylaws, because, hopefully you people will come around to us and a tenure means okay. I mean if you're legitimately out you're out, but a lot of absence, ace or with it yeah is absent. No excuse all. That means. So please look at the sheet, see how you look and address the issue if appropriate, I. Thank you. Treasurer's report, Veronica Castro. The report is in your package. If you have any questions, you see me after the meeting. Thank you. My report is down in the packet. It will be sent out to you right after this, but I do have some of it printed I will tell you what will be in the printed version that you'll receive the email will be the homeless, shelter about the homeless, shelter. What I gave out to the public of the town hall, meeting, Monday night and I do think everyone should be aware that only 120 people came out for that meeting. Let's see that includes people like me, al Tony, here politicians or whoever signed in at the front long story short so coronavirus. So obviously, you know there's a big scare thing going on and maybe rightfully so, because we're told to expect the worst just remind dissing my endure, if you haven't heard all right already, it's still flu season and if you haven't got your flu shot, it's highly recommended, so you don't come with down with the flu and people think you have the virus and avoid you like the plague, but also you know they don't want to tie up doctors. They don't want to have hospitals if you do get something like that, when you cough remember coughing to your arm versus your hand, because you shake somebody's hand, you rub your eye and you can spread germs that way right. So another thing to think about is if things go bad as they're predicting and it comes to you something like we work, Kimmy we're 11 working from home, the staff we're not prepared for that I mean we could be prepared for that. Giving some tweaks but I want you to think about that I mean I. Once the three staff members I'm prepared to work from home, but not on a protracted basis, I can't make edits to the website from home. I can't make do my timesheets. I can't do other things from home, but I do have a laptop I can try to configure, but again, that laptop is maybe 10 years old at this point, so something to think about coronavirus. That is one thing that people are starting to talk about. You know closing of schools working from home, avoiding unnecessary travel or medical procedures. Bill reform meeting our chairman, Albert Angela and I, went to a meeting that is in your packet in terms of the pamphlet that, if it's not in the packets online for those of you who prefer online from Senator Bailey, who said the Bronx da is upfront with him in any meat conversation he's had. Although some people got their impression, the Bronx da is not necessarily in favor of bail reform, I've heard, so we had a meeting at senator Bailey's office, al-kamil or 10:00 keyboard 7qe before 12:00 about that homeless, shelter I mentioned parliamentary procedures. So let me try to simplify it again. If the motion is on the agenda doesn't need to be seconded just state. The motion and open for discussion doesn't need to be seconded if it's on the agenda. Hr a domestic violence, shelters, hostage, shelters. There are two other types of shelters, other than homeless shelters, as eventually you'll get to Hazel motion to request stats from the city, because they're the city's great about publishing stats for each community board and how many are in the shelter system, whether they originate from waters, place or Jacobi, Medical Center, and not really $5.99, rhinelander Avenue or something is another story, but I am pushing and with the housing committee's help we're pushing for stats on people outside of this city that come originate from outside to see that come into the shelter system, because I was told it could be up to a thousand people, which is a pretty big number, so be curious to see where those people come and what are the stats onto my domestic violence? Shelters I understand their privacy issues. I, don't want to know the address of a domestic violence. Shelter in a district I want to know how many are in the Bronx or how many are on Staten. Island is again. Is it lopsided like homeless shelters? Do we have a an overabundance in the Bronx? Hasa is aids, so civic engagement, commission notes. We had a meeting that I and now we're invited to I'm gonna, put the notes in the written packet in key words, I got notice yesterday, I believe that they approved our Yankee award recipients. These were the names submitted, so we will send out notices now that's been finalized. Who did and did not get the award or sorry tried, but try again next year, plastic bag ban I wanted to bring some of these bags there at the office, but I just ran out of time. We do have them at the office. You won't come. You want to get some bags. Some board members already come by already and to v. Lo2 Vick I made a site visit. That will also be an email I got from the director of the group home. So that's the temporary boiler. That's been blocking loaded, Becca Avenue for a long time. I was on the phone with them today with DEP, and them today tried to resolve that issue and item II I will also put in the written packet. I don't want to take up more time. So please speak to me after the meeting, please, let's just move through the community reports. If that's okay, we'll turn over to bylaws I, don't that's going to be sandy or Joanne Rubino sandy younger Mike, the bylaws committee met, and we are asking for a motion to approve an ethics and disciplinary committee to be placed on our by Lords. They have already been meeting, but it needs to be approved by the whole committee. So it'll be brought up tonight and then next month, Jeremy. That's it I hope they heard it. Sorry, okay, so that's brought ups to be voted on next month. Thank you. Thank you. Economic development, Joseph, Thompson or Veronica Castro, two motions on the table. The first one is a new application for la catrina restaurant sony Signorelli and I both visited the establishment on monday to have a look around. There were only two minor issues that we saw. One was the rear door leads out into a building 1,800 Mathews Avenue, which leads to another door to get out to the exit door of the building. There were no signs saying exit. We brought that to the attention of the owner before we even left the establishment he had already sent somebody out and posted two signs exit signs to direct people how to get out in case of an emergency. So that was rectified at on-site. The others were, he has to expire with signatures, one in the front of the establishment, one in the back both were obscured by tall plants. We asked him to move them, which he did he's, also going to be raising them up to be in regulation between 3 and 5 feet up off the floor other than that he was very cooperative. It was a nice establishment, so we have a motion to send an email of no objection to new New York State Liquor Authority regarding the following new liquor: license application for look la catrina restaurant located at 825, Morris, Park Avenue. So any discussion, I Burnett from what was the was their measurements taken, actually I'm, sorry measurements from the church. So the way we had to measure it was on the side of the street of Mara's Park, where the restaurant is located. We measured it up on to exit Realty, which is directly across from the church that measurement from there to exit realty was approximately a hundred and fifty five feet. We then measured it across from exit realty across to the beginning of the church. That measurement was 99 feet, so it is over 200 feet from the church. The other concern was a daycare. It was discussed. It was researched. The daycare doesn't seem to fall under the restrictions of any of the types of properties that have to be within the 200 foot rule. So for that matter we did not have to. We did measure. It was under 200 feet, but because it does not fall under the 204 requirement spaces, it's not an issue. They had a panic bar on the door, ready, that's what I said. The daycare does not fall under the 201 of the cut types of locations that we have to worry about, and that was researched with SLA, okay straddle mic. Last name, you add something or they just they have an illuminated side within the establishment. They put extra signs in the lobby of the building which they got from the hardware store they're, not illuminated. They are just plastic signs to show people the direction to go to get out, so they do have an illuminated sign within the establishment itself way glow in the dark material. I, don't know if they're glowing, the dark, I didn't see them with the lights off, but in some interior areas. Even if it's not illuminated here, it would have to be reflective glow in the dark. No I'm, not sure if they were to be honest, I just know that they were there. They were big. They were sorry a little bit bigger than eight and a half. They were visible, one in front of the door, that's in the medium by the stairs and then one above the door that actually exits the building. So if that other door happens to be open, the other door does have an exercise, so it's always visible for them to be able to exit if there's an emergency. Thank you, you're welcome, okay, any other discussion. All those in favor opposed brunelfran abstentions, Joe Mendte, one Andrew Segal to some motion carries. The second motion is for lutes lounge, so we're sending a motion to send an email of no objection to the SLA regarding the renewal of the liquor license for loose lounge located at 1808, holding those in favor question veronica, what's happening with those violations he has for the outside, they have submitted an application to have the outside cafe, so we're waiting for that determination. Okay, because it seems every time they come up. Reno, it's the same story. They actually have done that they also were on requested to put in a side a door for an exit. They are in the process of getting that together. They said they. The door should be in place within 45 days from the day it was requested. Okay, thank you here. I mean Luke's lounges been out on the sidewalk, I mean they'll. Already put in for the sidewalk permit or whatever you want to call it, but I mean up until they get that permit shouldn't they be forced to take whatever they have out. I mean the things been there for years. The committee voted to make a referral to pass it as long as they follow up with the application. Any other discussion, all those in favor opposed so one colic to Schiano three okay, oh yeah, I'm gonna. Do a roll call, let's just it's easier okay, so this is for no objection for Luke's lounge, so Anthony of italiano, adoption, Oh, Frankie, Castro, yes, Francie, Greta, Christian, Amato, test, email, l, ju, c abstain, val and the belly's. Not here Joseph big coat. He just Blitzer Darrell Bowen, Patricia, Charles, Paula, query, Brett, Ferrara, AVO Francis, not here rabbi, Fuchs, Kenneth, Kaunda, Deborah, cowlick, NAT, Natalie, Medina, Joe, Samantha, Sylvia, Mazzella, hazel, Mira, John, Mostow, Shraddha, Pritam Daisy. Rather he goes ELISA Rodriguez, Shran, Rubino, Joseph Chancellor, a teach gravy Andrew, Segal, Lisa, Soto John Joseph Thompson Sandra motion failed. It was 15 for 10 against five abstentions. You have to have a majority to be 16 versus, or you know more Jordi be fifty. Sixteen in this case about 15. No, it's entirely. You don't have to do anything it's entirely up to the board. So unless there's anything else for your committee will move on to housing, hazel Mira I'm happy to say that we actually had a floor and we were discussing the shelter and we came up with emotion only because we're not if this goes through we're not exactly sure where these men are going to be coming from. Even though they're telling us that they're going to be Bronx residents, we don't believe them because there may be coming from Yonkers and other areas of the city in the Northeast state. So we make a motion to request the city of New York collective, published statistics on the number of homeless individuals originating from municipalities outside of New York City, but who are curling in the New York State shelter system, making it clear which municipalities, counties, and/or States to individuals originated from that's our motion. Okay for discussion all in favor and against any opponents, so motion carries unanimously. 80 shkreli abstains, so motion carries all right, yeah. Well, we walk correct. We all have those publish on the website tomorrow. Hopefully transportation, Thank, You, hazel Fran owes the grano transportation give me the notes are in detail in your packets. Please review them. Next month we will be voting on a couple of sweet corn aiming as well as one new activity. Thank you and have a good night. These are renewals unless somebody has a question. Ma'am they're not going to be voted on tonight, Bernadette Farrar. This is for the young street activity and I correct. I. Just have a question about, and the one on Bronx Tale Avenue between pairs of NS is the whole street going to be closed, and you know it's only partial. It's going to be sidewalk, it's a Thursday from the Saturday isn't school still and in session. Is it so I mean that's a question? Why are they having I understand? But school is still in spec? You have managed Academy right there yeah we can ask about it. I just know that the city is very reluctant to shoot those down because they're religious, but we can still ask yeah, I mean it's and that is covering bad-assed Academy from banner, which is vanished in Bronzeville sir, but is a renew it is a renewal. Remember they've had this before. Unless there was previous issues, we automatically approve them because there has been no activity. Note that was negative. We don't disapprove them or we don't recommend math approval when you're in Monday. Can you inquire about this place? Thank you. Ethics committee I know yeah, hey, you could not be here tonight so I, don't know who was going to speak from the committee a teeth or Ellie, Rodriguez, 80 or I can do it. If you want it's up to you yeah and if someone hasn't submitted a written complaint and we will not discuss it, I don't know what else so, there's a complaint form on our website. So yeah, yes, Andy, who are the complaints going to be against? Is there going to be against board members workers in the office? So if anyone has a complaint against the board, whether its individual members committee, the staff- this is what this is for- is to try to handle things in-house versus things going directly bp's office. So we have a committee now to review that complaint form is on our website. So if anybody needs or wants to know where that is on our websites under the forms and guidelines section, we can always email it to you too. So, if you need, if you need further assistance so and the minutes are in the packet Parks and Recreation Pat Charles, she yeah there. She is everyone all right, Thank You, for we had a. We have in such a good time with our proximity right now. I am grateful. It's where we are about to start visiting other talks, but the minutes are here as well. If you want look at what we're doing, but we do want to start this thing other proxies than what they have, that they need. There's any needles repairs, but mainly to look at other process, see what they have in their palms, so other plants might be able to get some equipment. That's in a different part that they don't have anything so we and I was told that our calendar Ian has given us a an option for commissioners to give us a bus, so we can do our tours, so we can do it in unity as a or as a team. We thank you and our next meeting will be on Wednesday before seven five in anybody would like to come in and meet product possible. Department would be welcome, but I do want to just explain one other thing. My suggestion is to - for the community boards. A lot of community boards need a lot of help so one if someone from each community board we meet at add meeting once a month and have concerns for whatever, because all communities are conformed to the same thing. So if we can just have one head person assigned from each community and we sit down and have a conversation on our concerns, I think that would be a good suggestion. Thank you great old business, new business, Burnett Ferrara that a stable alliance is going to be having their monthly meeting on Monday, May, 2nd and our guest speaker is going to be Darcelle Clarke and we are going to be having Q&A and discussing the bail reform legislation. So if anybody wants to come ask questions, maybe on the other side of the coin, etc. Please do and also about his neighborhood Alliance is going to have their dinner on Friday May 15th. We do not have our honorees set in, so we don't have anything out there. We also are going to have a journal, so you can mark that on your calendar, it's going to be a Strauss Friday, May 15th from 7:00 to 11:00. Thank you know. Our monthly meeting will be March 10th and we had to part many sanitation, no border health coming to visit. So if you have any problems with creepy-crawlers, please join us. Our fundraiser will be May 14th on Thursday at Frankie and Johnny's from 6:00 to 10:00. We do have a journal and look at your emails. You get all the information. Thank you any other new business, Sam I wanna make a motion to adjourn Oh all in favor against passes that set 8:52 p.m. thank. You have a good safe trip home.",
        "summary": "If you are, if you're eligible, you can save money for applying for property tax exemptions, and you can come directly to this event in my office to speak to the Department of Finance representatives.\nI know that obviously, this Community Board is one of the ones that has the most homeowners in it in the Bronx.\nRelated matters develop a response from our conference, and then we have a process in a couple of weeks called the one House budget, which is when the Senate will present its version of the budget as we as we go towards passing a budget on time on April 1st We can have a conversation as long about this as you as you would like.\nHe spent 20 minutes in front of a judge and because he was a millionaire, he got to go home and chill until the court date that just happened a few weeks ago, as opposed to that somebody who was a constituent of mine, kalief, Browder, a 16 year old boy who was arrested for allegedly stealing a backpack spent three years in Rikers Island, two of them in solitary confinement until the charges were dropped committed suicide later on from the PTSD that he got from being in Rikers Island from being accused of a crime that he did not commit.\nThat needs to be tweaked really good, because if you have somebody, like you, said the gentleman you were talking about no prior convictions, you know clean as a whistle If they are arrested of a new crime, they're considered innocent until proven guilty.\nThat is a legitimate concern and we need to actually what we're having the conversation right now during the budget about how we give them the resources necessary, so that they can put the staff on in hand so that they can provide for the law to be observed.\nThousands of people who have been able to go back home at the end of the day and not have to stay overnight or for a month or for a year or for two years, have been able to keep their jobs, have been able to keep access to their children, have been able to go back to the shelter that they live.\nWe had the district attorney here a couple of months ago, and last month, Maybe we can have the community board, send her a letter and tell her to get in touch with your office, and you know, and I will tell you that our that just the district attorney has been sitting down with one of the main sponsors of the bill, senator Jamal Bailey, and they have been having conversations about by the way there has been some.\nIf there is something that is put in front of me as I, try to do with every piece of legislation, I will take it into consideration and I will look at what is there, but much like the speaker of the of the assembly, who has taken the position that he needs more information to see how this is working.\nIn the South Bronx and we represent tens of thousands of people every year and what I can tell you from my 20 years as a public defender is just how incredibly necessary this bail.\nOther thing I want to stand up here and tell you is that, even though it has only been a really short period of time, bail reform is actually working and I hear the concern So in our discovery law there is already a provision that allows judges to issue protective orders.\nActually, there should be a protective order and that information should not be turned over and when it comes to bail, judges have so many tools at their discretion, so they can put money on electronic monitoring.\nThey can send them to supervised release, they can issue an order of protection and if a witness is intimidated or threatened in any way, the judge actually has the ability to put that person in jail.\nWe can do something better, because actually studies show that incarcerated people who are struggling exacerbates all of those underlying issues and really does make it more likely that we're going to see them back in the criminal legal system you just put, sir, is that on just somebody to click it, please don't touch the buttons unless it's red, just let me know So What about the people that are not innocent Let them out two days: later, they're committing a crime that puts all of us into danger.\nWe're gonna be really focusing on census, so census work for the Allyson library Our focus is census, so I'll be a lot about that, but we are going to be doing a census kind of 101 to inform people what the census is.\nThere's questions we'll move on to our next guest speaker gallery sessions figure it's Vinnie, Marie Lyon regarding the PS 108 annex I did speak at last month's community board meeting regarding this issue.\nWe really need the community's support to carry us to 8th grade, Like I said, there's no quality middle school for our students, currently in the neighborhood And I'm just here to get advice, feedback, support, suggestions and how to make this happen.\nIf we understand here and praised this, you know I when I've rather praised some of the people and some of the kids that go and get five A's, not five jail or five summonses or criminal things.\nEfrain, gonzales, homeless, shelter, hello, everyone Work at Einstein, monster, Fuhrer and I Actually live in community board, 10.\nHaving and I want people in Community Board 11 to understand that both of these community boards really are cohesive in a lot of ways.\nA lot of homeowners in community for 10 more in community board 11, but we do share the same councilmember most of the time, and so I am against that I'm against people coming out of Riker's to go to a homeless shelter when there was no screening process about what you're gonna see this doctor you're gonna do this there They're talking about substance, abuse clinic in the homeless, shelter What I want people to understand?\nI was made aware at that meeting from councilman Marc Jonah, and it offended me that there were people attacking members of community board.\nIt is unacceptable for anyone to attack any member of a community board because they have an issue the way we fight those issues is we come together.\nWe can't accept anybody going in there and attacking the people that change things in our community.\nShelters I support the community board also to go against this homeless, Second, one is that in your community, when they speak about putting people out on bail, I'll give you a live.\nThe mayor said that community board 11 homeless people have been placed elsewhere.\nOkay, however, and he said he's going to replace them with people from the Bronx.\nOkay has said that they will take him from the community board, the Bronx and the city, all right.\nIf you didn't know couple board members reach out to me last week or if not the week before about the renewal application, which I did not receive from the borough president's office until yesterday, so they have, they never received the initial reappointment.\nYou know for people with incomes, less limits of 66,000 come to the office.\nDrumming master, Thank, You Jerry before I get into the report there was I was the chair of the Land Use Committee and many people are not on a community board when Blondell Commons was a Uhler that had nothing to do with anything.\nThank you: council, member Kings, office, robber, press parking, calendars, bike, smart official guide to cycling in New, York, City, pamphlets and on March 12th, councilman King will be holding his state of the district state of the district.\nAs, you all know, the a Clark has been making her rounds to Precinct Council meetings, as well as community boards to talk about three components of the criminal justice, reform, bill discovery and speedy trials.\nThere are two other types of shelters, other than homeless shelters, as eventually you'll get to Hazel motion to request stats from the city, because they're the city's great about publishing stats for each community board and how many are in the shelter system, whether they originate from waters, place or Jacobi, Medical Center, and not really $5.99, rhinelander Avenue or something is another story, but I am pushing and with the housing committee's, help we're pushing for stats on people outside of this city that come originate from outside to see that come into the shelter system, because I was told it could be up to a thousand people, which is a pretty big number, so be curious to see where those people come and what are the stats onto my domestic violence?"
    }
}