{
    "YoutubeMetadata": {
        "author": "MCB3",
        "channelId": "https://www.youtube.com/channel/UCydYELaIxiq8Qt2aTpkaKug",
        "title": "CB 3 Manhattan - Land Use",
        "publishDate": "2020-07-22",
        "shortDescription": "1.    Approval of previous month's minutes\\n2.    District Needs Statement\\n3.    Information presentation: development plan for 290 Henry Street - affordable housing at the annex of St Augustine's Church on Madison Street side\\n4.    DCAS: update on 70 Mulberry\\n5.    Vote to adjourn"
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB3",
        "normalizedName": "Manhattan Community Board 3",
        "twitterName": "Community Board 3",
        "youtubeChannelName": "Manhattan Community Board 3 NYC",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
        "twitterHandle": "@CB3Man",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "Just admit a few more people here and then I will get going sure. Okay, so welcome and thank you for attending here are a few guidelines for tonight's meeting. First of all, I think you all know that this meeting is being recorded. So if you don't want to be seen, turn off your video, if you're, not a committee member, please sign in enter your name and your affiliation. If relevant and any item you wish to speak to in the chat box, use the chat box, if you have a technical issue, do not use the chat box for substantive comments. Raise your hand for those. Please stay muted unless you're speaking- and this is how you mute on your desktop computer- you have a microphone button, you can click it and it turns red, you click it again and it turns white and when it's white you're unmuted on a phone, you type tap the mute icon at the bottom of your screen. Now the most confusing thing in zoom is raising your hand, so pay attention on a desktop computer click. Participants at the bottom of your screen go to the bottom of the list and click the button labeled raise hand on a phone press star nine. After each presentation, the chair will take some comments and questions from board members. First, then, the public you'll have a two minute time limit. The committee will then formulate and pass a resolution. Everybody happy with how to mute and unmute I'll show you a picture in case. You want me a little bit more. That's the participant button at the bottom of the list. You'll see the raise hand. Okay, thank you linda, so we don't have to like that anymore. Okay, as linda mentioned before, and the chat box is really only for checking in and also ask technical questions. So please do not use the check box to share your point of view or discuss any issue or you will be removed from the meeting. If you do so. This is just our policy and before we start our discussion tonight, I just wanted to welcome troy valles to join our land use committee. I believe troy. This is his first official meeting with land use, although he was also present at our June meeting. Is that right, troy we may have to anneal, troy hi, troy? Oh looks like he's frozen. Okay, all right, and so our first item on the agenda is to approve the minutes for our June meeting. Michael. Can you where's michael? Can you do a roll calling to see if anyone everyone approves our posts, abstained and present not voting at the same time? Taking the attendance? Please sure, jackie? Yes, linda? Yes, michael, yes, dominic, I don't think I saw dominic. I don't know jonathan. Yes, thank you, jonathan herman hewitt. Yes, thank you, herman trevor holland. Yes, thank you trevor lisa kaplan. Yes, thanks lisa olympia, yes, olympia! Thank you, troy, steve harrick. I think I saw it. Yes, thank you steve and then tim laughlin. It's no done all right. We're all set thanks. Thank you, michael and next item is the d-class update on 70 marbury street. This is the update after our June 25th town hall, where linda and I both attended, and we have quentin from dicas tonight and after his update and also his presentation and also the committee session. I would take four to five questions from the public and clinton I'm seeing you here. So, okay quentin, you are already unmute thanks, jackie, so good evening. I want to start by thanking you, jackie and the community board and land use committee, as well as the local elected officials, that for their support over the past six months, and I also want to acknowledge the five tenants of 70 mulberry for the continuing commitment and working with dcas over these past couple of months as well. I mean, finally, I want to touch base on the community input and recognize all those who have sent in letters emails. Some phone calls expressing their support for sending mulberry. This is truly a historic site and because of everyone's involvement, this administration has put forth the resources needed to preserve its rich history. Now, as you know, on july, 2nd, the mayor and dcas announced the allocation of 80 million dollars to help rebuild this site and that the city would prioritize options to preserve what is salvageable from the remaining structure. Now, how this site will be redeveloped will be guided by the community. In addition to the allocation of resources for its redevelopment, the administration has also provided funding for a community visioning process. We have established an advisory committee that will help shape this process. The committee has already been in formation and has met and is comprised of representatives from both the cb3 local elected officials and the five tenants together. They have developed the scope of work that went out on 710 and the vendor proposals to that work or to that scope of work are due on july. 24Th. The community visioning process is expected to begin this summer and stretch into the fall community. Visioning will gather public input about the future of the site and provide a forum to discuss all the available options for its redevelopment now. I know there is a lot of work ahead of us, but we are excited about collaborating with all the stakeholders involved. We believe that we have in place the resources needed to ensure that this site will serve as a beacon for current and future chinatown residents. So I thank you for this opportunity to provide a brief, update and I'll turn it back over to you, jackie. Thank you clinton, committee members. Do you have any questions for clinton olympia? You want to raise your head? Yes, sorry! So just a clarification, do you want to explain what is this advisory board? What was the criteria you use, how many members etc sure? So, as I mentioned in my opening remarks, as well as what we put out in the press release, so the advisory board is encompasses both all five tenants. Jackie also serves on the advisory board as a representative from community board three as well as so I guess I can. I can name the electeds, so someone from the congresswoman's office state, senator's office, assemblywoman's office, as well as the local elected official Manhattan borough president bureau's office, as well as councilwoman chen's office. I mean, since the concerns and the viral debates included a lot of groups that deal with preservation. Do you have someone in the advisory board that represents this interest, so there is no one on the advisory board advisory committee, that is from the any of the industry, groups or community groups, so just to kind of go olympia to kind of the purpose of the advisory board or advisory committee, which was three and fold. I guess I can put it in three things: one was to develop the scope of the vendor so that we developed the scope that would actually go out so that vendors could actually so that we can seek a vendor to facilitate the process. The second was to actually help the vendor actually identify stakeholders in the community, such as the preservation group, such as businesses such as residents to be able to engage in this process, and the third was is to actually receive the final report from the vendor. So those are the three things for the advisory. This is not the full on community engagement process. Again, the advisory group is there to influence the both the scope of work. Understand the scope of work select the vendor that will facilitate the process and then provide advice on that. But this is this is not the thing that is going to make a decision. Can you explain what is a vendor in this process like a vendor, someone who sells? No, it's a consultant? Oh so it's a company vendor correct! So remember in my last in our last town hall, I mentioned that we were going to embark on this process and that the city would hire a consultant, I'm using the word vendor, but it's a consultant, a facilitator that would do that and this advisor planning it's a planning consultant that helps participatory design. That's what you mean no ma'am, it's a community engagement consultant. Okay, thank you just to understand, because a vendor could be anything yeah. I understand. Thank you. I was I was using. The word vendor, but consultant is probably would resonate as well. Other committee members, do you have questions lisa linda, you are milled yeah. I toast. I cannot hit the raised hand button. So indulge me now. My question is they're in the process of deciding what to do in the in the 90-day process. One of the things we asked for in our original resolution was a preservation assessment. How was how is that coming? Are you asking in? Have we started? Preservation engaged a preservation, a consultant. I mean an engineer to do a preservation assessment. No, we have not engaged an engineer to do a preservation. It's that plan we are listening to every. I will say that part of the engagement process was to consider that we haven't even hired or brought on board a consultant yet, and so we haven't had the opportunity to even engage any of those that have offered those services yet, okay. Well, I'm just concerned because time has gone by and it was in our original resolution that we wanted that assessment made, so that will help the whole community decide what to do understood. What we have committed, as I announced in the previous meeting that I appeared before you guys- was that we would halt demolition to the third floor, and so I think that does give us the opportunity to consider that request, and hopefully that is something that both the community rallies behind as well as something that we're able to do. Thank you. Thank you, linda lisa. Do you want to ask the question you asked me a couple days ago or you don't? Okay so looks like she is not going to ask the question she's trying to unmute. I think, wasn't my question just whether a preservationist had gone in and that's what linda just asked. Okay, thank you. I'm disappointed to hear that they haven't, because that was the community board's resolution. Despite what might go on with the community engagement process. I think the community board's resolution still stands. Thank you lisa, and do we have other committee members want to ask questions? If not, I want to move to the public session. Thank you. The first one is richard moses and linda: can you amelia richard, please I just unmuted myself thanks, oh hi and thank you. My question is. It seems as if there's still a little bit of uncertainty about exactly what happens when in this process, and it would be very helpful, I think, to have a written schedule with all the steps broken down one by one and a target date when you'd be moving to the next step. Has something like that been considered? Is that possible to provide that to the public? So we have considered it. The most immediate next step is both getting the consultant on board so that we can start the visioning process, and once we get the consultant on board, one of the deliverables for the consultant is to come up with a timeline of engagement, so it has been considered. That was also added into the scope of work for the consultant, and that will be publicized. Thank you clinton and I, before I opened up to the public session, I should have mentioned that each speaker has two minutes to ask questions or make a comment. So you can either make a make a comment or ask questions and try not to ask multiple questions the same time or to go back and forth with the presenters and make it like a private conversation. So thank you richard and I'm gonna lower your hand. How do I do this? Oh, I cannot do this linda can do it. Thank you and next question is colin. Okay. This is a question for mr haines. A month ago I had asked you a question regarding the construction wall along mulberry street in bangor street, since we're gonna reach the third floor in roughly two weeks, or so has some city either dlt and the border is that the DOB made a determination whether that wall is gonna, be removed and mulberry street and bayou should reopened for vehicular traffic. Thank you thank you carlin. So, yes, we have considered. We are we. The goal is to remove the fencing on bayard and, when I say, remove actually should use. The word choose the phrase push back so that we are able to open one lane on bayard street that will allow traffic or at least open up and also give space for the area businesses so that, yes, that is the plan. I have a quick follow-up and sure, since why open it up for one lane of traffic only when the imminent danger of any building collapse has been removed and the building would be sealed yeah. So it's also for site protection and security. So what we were able to work out with both the contractor and the relevant authorities? Is that even because it still is an active construction site that there had to be some fencing and there had to be a certain distance between the actual building and the fence where it's kind of blocked off, and so that's what we were able to get I'm at least able to open up one of the lanes. Thank you, collin and next question is godzilla. If I hope I say your name correctly, did the guido heartray yep hi? Thank you. So my name is I'm an architect, and I've worked on several similar preservation projects, including the pratt institute higgins hall, which was a project that we restored after a fire. I would like to support what the community members have been saying: the community board members in terms of getting some kind of preservation assessment of this site. I do feel like that to have a public discussion of what the community wants to do with the site. You really need the context of knowing what's possible in terms of preservation, and I think that it it's just really going to inform that discussion. Without that you know the potential costs and benefits of preservation versus other options are going to be hard to determine so also just as a as a as a member of the community. I would really feel like I would put my kind of personal support behind preservation, but I also think that to do it, you need to do it in an informed way and understand its implications and really make that part of that community outreach process that I'm that I'm very glad to see you doing. That looks like a like a statement. Then a good comment. Yeah, it's a comment, and next I have cine westworth. I don't say your name correctly. Yes, this is sanad. I just want to say thank you for the presentation and I wanted to ask that this project would be covered under a pla with b cast. I didn't hear the la sorry senate. I didn't hear the last part of what you said: a project labor agreement for d cast. Is this a d cast owned property? Would that be an effect or are you? Are you saying for any future redevelopment of the site? Yes yeah? So we would take that into consideration, I'm not sure of the actual details of what the actual construction will be like, but I will take that back. Thank you so much. Thank you. Thank you and the last question goes to amy amici hi amy. Do you need to anneal yourself hope she just disappeared? Am I still here I'm here? Can you hear me? Yes, amy? Oh okay, I just also want to support this preservation assessment. I think it's outside of the community envisioning process and the information that would be gained from a preservation assessment is really critical to the discussion. But I had a question about stabilization of the remaining structure I wanted to know. I know that construction is gonna, stop at the third floor, but I think it's vitally important to reserve, preserve the and stabilize the structure that remains both for safety reasons, as well as preservation reasons. I wanted to know if plans are in place for doing that. Yes, so, of course we can't, we won't be leaving the building, just as is we will need to cap the building off at the third floor or temporarily put something in there to ensure both site security and safety of the building. So while I can't go into the details of exactly what is going to transpire once we get to the third floor, that is part of the plan to stabilize that, so there are no kind of safety issues or site security issues with the building, and I just had a other question which is in terms of the facilitator: how will the RFP be distributed and what is the field of consultants that would be considered sure, so the are the scope of work or the or I'm calling it the scope of work. That's so the scope of work has actually already been out to the public, so there were two qualifications. So the way the city is procuring. This is through mwb, small purchase and the two requirements for a vendor to be eligible to present or put forth a proposal on for this project are one you have to be a certified mwbe with a small business services department for the city as well as you must be registered in passport, and so, if you meet those two criterias, you are eligible to submit a proposal for that. So that went out on the 10th, as I mentioned in my remarks and those proposals are due back this friday, the 24th could that be shared or let us know where that is that are sure it actually goes out through passport. So if you, if you are registered, one of the criteria is that you have to be registered in passport. So if you are registered in passport and you met the criteria, it already went out to you, but if you would like to see, I don't know, I'm not sure if, if you know of an actual business or nwb that meets those criteria and has not gotten that, if that is the case, please reach out to me and I want to make sure that they get that statement of work and we can. We can work offline on that. If there was someone that didn't that meets those two criterias but didn't get the information great. Thank you. Thank you, amy. Thank you. Clint and quinton. Can I post one last question from jen lee, because this is a very passionate topic and he is really the last one to ask questions. Sorry guys, I didn't, I forgot to raise my hand, otherwise I would have been on the list earlier. I have to compliment mr hartree for adding context to this conversation, because context is everything this building does not exist in a vacuum. We as a property owner. I speak to a lot of property owners about the plight of chinatown, and one of the things that we did today was take an inventory of some of the beloved businesses that have gone out of business. Amazing 66, let's makan sun hop singh chatham restaurant 69, bayard mandarin court. The list goes on and on and on, and I want to underscore the fact that this is not a wealthy community. This isn't a wealthy community in terms of its property ownership. 85 percent of residents in chinatown of the 2400 properties within the catchment of the bid are rent, regulated, heavily rent regulated. We have rents that are as low as 100 to 500 per resident, so with the loss of businesses that I just listed by the time. We have this conversation again. We will have added to that list. So, in terms of context, I want everyone on this call, including the committee to understand that the context must first be predicated on the survival of businesses and having the business and all of the employees of the businesses that I named we're looking at about 150 employees that have now lost their jobs in chinatown. So in terms of context, you have a lot of weight on your shoulders. The longer this drags out, the longer we're going to see people lose their jobs, we're going to see people who no longer have the buying ability to keep the economy of chinatown going, and so yes, some people may say that the building is an interesting building. Some people may say it's a beautiful building. Nothing is more beautiful than a thriving economy in chinatown. Nothing is able to match that, and so the beauty of the building is nothing if we have empty storefronts around it. So I bring to light the context of what is all on your shoulders. The context is the survival of chinatown its buildings and its 300 million dollar tax base. 300 million dollars annually is created in chinatown that fills the city coffers and if we don't contextualize the time frame of everything that is being asked for here, some of that money is not going into the city coffers and it's great to have a building preserved, but it's not great if everything around it has disappeared. So I leave you with that. I hope I pray that the next time we all meet this list that I just read to you doesn't get longer. I thank you for your time. Thank you, jen and also I want to thank clinton and all the people who spend their time to participate in tonight's discussion. I'm sure clinton will have some very good information to bring back to the administration clinton you have you do you have any worked for us. No, just thank you in advance for both your participation and we look forward to collaborating with you throughout this visioning process. Thank you, quentin. Thank you. So much, okay. So our next item on the agenda, so I moved the agenda a little bit this item on the on the agenda. I wasn't I'm not sure if it was a second or third, but I move it up a little bit. It is going to be the development plan for 290 henry street. Affordable housing at the annex office in augustine's church on madison street side and st augustine. Church is a landmark and developer plans to build 100, affordable units, and this is going to be their first time to provide the details of their plan to cp3 and the presenter is miss jessica, loser, jessica, hi, jackie, thank you, hi. I think I met you. I feel. Like you look familiar to me, I might have met you somewhere before. I think I've met you before too hi jessica, hi, lisa, hi, everybody I spent it feels like a lifetime ago, but jackie. I I spent about 10 years or 12 years on the lower east side, representing representing chelsea and also working for the community board and also had the the honor of being on the on the cb3 commit subcommittee, which it was an honor for me, but I'm here tonight representing st augustine and thank you for letting us present now we're not here asking for a resolution or for any approvals, but just as we as the church is developing their plans, they wanted to keep the community board informed and part of the process of the the application's already been shown to the council members office, and we just want to keep everybody informed. I want to introduce our team, I don't know if you can see everyone sort of at the same time, but just to let you know who's here. On behalf of the project we have father nat, st pierre, from st augustine, myself, jessica, loser from the law firm of goldstein and hall and on the development team. We have jack heaney and john waters and then jack esterson from think architect. So two jacks but light father nat. If you could tell us a little bit about the state of the church, the state of the congregation, and then you know how Covid-19 has made things you know better or worse, your call father nat. Can you unmute yourself, or can we unmute you so very much jessica and thank you to cb3 for welcoming us synagogue has been in the community for almost 195 years. The building is a historic landmark. We are one of the major black congregation of the episcopal diocese of new york and we are also the proud host of two slave galleries in our sanctuaries. So I arrived there, I would say eight years ago and we're already thinking about we developing our land, but because there was a change in the leadership that project was on ice for quite a while and it was resurrected. Why? Because the church is not as viable as it used to be. We had lots of programs in the community that we have lost the means to carry and our congregation being in decline. We are not really hoping to bounce back to the place where we were before and have the financial means to even support the historic landmark that we are right now. This building is more than 190 years old, so there is a demand on keeping it up. Roofing issues boiler issues all kinds of challenges and not having the support of a vital congregation able to contribute the financial means. In order to do that, we have to turn to a different model of support. That's where we contacted denim wolf and golden stein and also fulcrum to see what can be developed on site for us to regain some viability and remain in the reserve, the site that is an historic building of the lower east side. Thank you, father nat, and just to the really I think the big takeaway is that, while the church does need an infl, an influx to their resources and into their finances, they want to do that through the development of affordable housing and and so that it's not just financial resources for the congregation, but that it's an asset for the community, and that was an important part when the vestry was. The festery is like a board of directors for the church when they were developing their plans and figuring out how they were going to solicit bids from developers. It was really focusing on affordable housing development. The other point that I wanted to highlight is that we're here, obviously, because the development plans are not going to be fully as of right, but the we're not asking for a rezoning rather we're asking for an envelope waiver. If the church wasn't there, if the historic, very old and very beautiful church, wasn't there, then a fully efficient, affordable housing building could be built on the site pretty easily, but because we're preserving the church and then building around it. It's a very tightly constrained site and so a height waiver will allow the future affordable housing building to use all of the as of right floor area on the site. So just sort of keep that in mind as as we're going through the presentation, and so without further ado, I'm going to turn the screen over to jack, heaney and jack to show you what we have on the church and linda, I believe jack has a powerpoint, so you may want to make him the co-host. Thank you. Do you see him linda? Hey. I see him yeah great, all right, jackie! Thank you. Thank you, jessica. Thank you, father nat, thank you to cb3, especially to jackie and linda for getting us on the schedule. At such short notice, we have put together a brief presentation that we previously shared with department of city planning, councilwoman rivera's office and landmarks commission. So I'm gonna share my screen. Now. Oh I'm still disabled, linda sorry, I clicked the wrong jacket. They move. You know it's a little tricky how's that let's try it that worked. Thank you, okay. Unfortunately, okay start at the beginning. Okay, can everyone see my screen? Yes great, so the first few slides are just some context, slides to show your location for folks who may not be familiar with exactly where the saint augustine is so as some orientation the site is between henry and madison street. Close here's, grand and east broadway p.s ps134 is across the street, and the vladicoms are here to the south. Here's an aerial perspective again, vladimir holmes is orientation. Ps134 is here. This is henry. This is madison. Here are some historical photos of the church and one current one. This is actually a photo of the slave galleries, which father nat had referenced in his introduction. Here's an old photo of the church with his former steeple, so the non-historic portion of the site includes this annex building here completed in 1962.. So in order to build the affordable housing, we're posing this portion will be demolished, but the historic church will be preserved and restored. I think the church was originally completed in 1829 in a federalist style. With some gothic details, you can see some of the arch windows and the photos I'm about to show the zoning district is r72 with a commercial overlay again. Here's an aerial perspective showing the annex building in relation to the historic church here are some on the ground photos. This is the annex building picture of the historic church. You can see those gothic arts windows, here's a church picture of the facade. This is a an ada accessible courtyard that we'll be preserving and enhancing to connect the old church to the new development. Again, some more context photos here's a picture of the interior so as discussed. Our goal here was to take all the available floor area for the site and create a massing, a building that would allow us to fully utilize the number of affordable housing units that are available, while also taking advantage of errors, which is an acronym for senior housing. So the result, the program is 130 units with about 5, 000 square feet of ground floor, retail and 4 000 square feet of new community facility space that would be used by saint augustine church, and you can see the two massing studies on the left and to the right are just the typical floor plates for how the building would lay out on the various stories- and I think this is actually a good transition point for jack esterson with think architects to talk a bit about the thought process that went into the massing that's being proposed and specifically, as it relates to the historic church right. Can everyone hear me? Yes, yeah right thanks everybody for having us one? Second, can I interrupt something jackie do you have because it's very hard to follow they're, very small? We can't read it. Is there a way to email us the pdf? This way we can understand what we're seeing, because we can't follow yeah olympia. I don't have the illustration. I don't have the file okay, yeah. What I could do is that I could ask them to provide the material to us after the presentation, but right now I don't have. It is the problem that you can't see the images and jack. Is there a way to blow them up from your screen? So so one zoom strategy would be to switch from gallery view to speaker view. I think that would then it would take up a larger portion of your screen. Good idea, that's not resolving the issue. Don't worry! No! Okay, yeah, okay! Well, let me continue chat. Thank you. I'm sorry, for that. We're getting really accustomed to designing taller buildings in next to historic buildings or in low-rise, neighborhoods, and always thinking about how do we strategize around that? So it's not just another slab or not an empathetic structure slammed up against a nice church, so we are just starting. I mean these are really conceptual zoning diagrams. We are, you know, not really considering it's obviously not developed architecturally, but it's kind of a baby step to look at the height and the mass thing, and perhaps the interplay of masses interconnecting the use of at least two different materials to sort of break down the mass of the building and make it more empathetic with the church. So the image on the top is and there's some following pages that have bigger images jack. Just let me know when you want me to switch to the next slide. So, okay, just for just stay on this one. For a moment, okay, the image on the upper left. It is on the madison street side and it's showing a setback. I believe it's a seventh floor which then hops up as a dorm, what's referred to as a dormer, and the image on the bottom left is indicating a seven-story setback that kind of wraps around the building and it's about at the same height as the church steeple and we're using two tones to indicate that the lower portion I mean we're not likely to use the 19th century schist stone that was used to build the church. But when it comes to selecting materials, perhaps it has a texture and a coloration. That's very similar. We're hardly at that point yet, but that mat that lower mass that's projecting has at least two functions. One is to, as jack said, to utilize all the far, but also to relate to the scale of the church, and so let's go to the next image and the next image. The set of images is really more on the street level, of course. So the image on the left is illustrating the scale of that lower piece that would visually connect to the church and then the tower sort of interlocks into it and would be possibly a lighter colored material and lighter in spirit, possibly larger windows. We're really not at that level. What we do is we tend to sort of say. Okay, here is the massing and everything that's approved, there's an agreement, and then we go on to really start looking at proportions and windows and materials and details. The image on the left is seen from henry street, and we've made an attempt to really disconnect the building from the church in a way that the current annex does not do the annexed kind of connects in a, I would say, a slightly awkward way. It wraps around the corner of the church, actually blocking one of the gothic windows, so our strategy, after demolishing the annex, is to pull away and let the church breathe again. So the image on the left shows the lower extension actually separated from the church as opposed to the current nx yeah. Thank you. That's a good second way to that image, which is error. You know sort of an and the current annex is butting up against that corner, blocking that 20 foot high gothic window, so from the interior. It's blocked up right now. There are not five gothic windows on that side. There are four so by removing the annex and pushing the new development back revealed away from the church with a gla, possibly a glass, recessed entryway. It allows the church to finally stand on its own independently and there would obviously be a restoration required at that corner with the cornice, and we don't really know what the stone is like underneath and then the undertaking really part of a preservation program for the for the church building. So we would weave that into that program, just a little bit of above that space is a green area which is actually the roof of the commercial space that faces medicine. It's a one-story, rather a good size, commercial space with frontage on madison and the roof of that would be a garden for the residents of the building the new building and would provide breathing room. Of course, to the back of the church, which is currently has the annex connected to it, so there would also be preservation in the back of the church, which would be now newly revealed- and I would just add to that jack- that the intention with this rear landscape is to be shared by both the residents, the new building, but also the congregants of saint nicholas. Yes, of course, because it would, it would be accessible from their new space, which is we're kind of representing. Is this blue wall here, the blue glass transparent? So what is this? What's the difference on the back of the church in the building? It's which is required for lighten air, but we also add jack that by pushing that annex a little bit back that will allow the endicott accessible now to have direct communication to the church, because, right now we have to go to the basement and at least go up via an electric chair. That is not working, absolutely so yeah again. These are not very accurate, but this screen area here represents the existing accessible plaza with an ada ramp. So the idea is to connect this existing ada plaza with a new entrance for st augustine space, which will then connect to the historic church and there'll be an elevator within their space, so that now everything collectively becomes fully ada accessible. So that's right, so the next page is a larger urban context. We wanted to indicate to you the immediate surroundings, so there's the public housing on the left of the new development, there's a rather large one-story commercial jack. What is it a supermarket? Maybe to right next to the development which we think is highly likely to be developed in the future? It's actually a just a great it's a health clinic. I'm not sure how many tenants are in there, but there's one main health clinic and then there are. Then there are two 21 story: buildings about half a block away on the upper part of the page. This is all to show that there are both low rise and high rise buildings within half a block radius of the site. So this gives context we are making every effort to, while using all the far to also be empathetic architecturally with the church in mass and in detail as we move forward and that that'll take it'll manifest itself in many ways, both large and small in every decision will be looked through the lens of how does it relate and work with the historic church building, and I think that jack do you have anything else I do just before we open it up not to the design portion, but before we open it up to questions again at the beginning of the presentation jessica mentioned, this will be a 100, affordable project. We intend to finance it through hpd's mission mix and match program so of the 130 units that would be proposed. 70 would actually be at less than 80 percent of ami, with the highest tier being at 100 of ami and on the as part of the units that are below 80 of ami. That also includes a number of senior units that would be at 30 to 40 of ami and that's it. So. Thank you. Any questions yeah. Thank you, jack and jack, and the one who use cell phones to dial in your signal is not very strong. Is you keep breaking up? I don't know if other committee members see the same problem. I wasn't listening that to that very well, but it's okay, just a quick question before opening up what is the envelope waiver that you are seeking, so it's a special it's basically, a department of city planning special permit, that's specific to historic, landmark buildings to allow a waiver in certain bulk rules, but no increase of floor area to accommodate the unused floor area specific to that historic structure. So, basically it allows adjoining buildings on a development site to utilize unused air rights over a landmark building. I have a couple other questions but I'll. Let committee members to go first. Committee. Members olympia, I mean so I mean the obvious question is: will that trigger euler? Yes, so I mean that would have been helpful in the beginning of your presentation to say that, even though today you're not asking regio that's, why we're reviewing this project and then it would also be helpful like to receive the details that pertain to the euler. So, of course, it's always interesting to hear the architectural details and stuff, but like ahead of time so before. If you come to present again to us, maybe pdf before that we can review and understand better. These breakdowns would be very helpful. I we would intend to do that yeah and just to be just to be clear. A lot of those details aren't determined yet and when we have everything ironed out, then we can present information to the community board and it will be done in advance that you have time to review it. This really is just informational so that we can get sort of immediate reactions and feedback from the community. Other committee members they have their hands up in the chat jackie. There are many of them, I'm so sorry I there is in the chat yeah. There is trevor mike the maris and lisa, I'm so sorry, okay trevor, I scrolled the participant names too high, so I didn't see them. I'm sorry, jeffrey just a quick question and it may have been addressed earlier on the ownership structure of this building who's going to own it, and I don't imagine you have the management structure worked out, but the ownership structure? It's a good question. We actually didn't clarify, so this will be structured as a ground lease or at least half of the this. The portion of the site where the new building will go will be groundless to our team from st augustine so that the church will retain ownership underlying ownership of the site. Okay, thank you sure, michael police. Sorry I was, I was taking notes, that's! Okay! Thank you. Thanks for the presentation, I just have a few quick questions, so you said you're gonna be using the mix and match program. Do you have the schedule of the breakdown of units and amis, or is that still other underworks and that's still under review with hpd? Okay? But it's temporarily affordable right? It's not permanently affordable from what I understand of the mix and match well well, so actually because we have to go through. Actually, I don't know if that triggers mih or not, but the length of the time of the affordability will be at least 40 years. That's sort of the typical length of an hpd regulatory agreement, but the reality is the building will likely be affordable. Wait well past that, because the subsidy mortgages that go into these projects typically just get rolled over for another 30 years, when the term comes due so okay, and are you going to work and try to have a NYCHA preference, because this site is so close to the vladic houses? Yes, it's actually something we've discussed internally, but again, because it's still early stages. We want to confirm the program and the ami mix with hpd before we reach out to NYCHA, but we especially for the senior component. We think that's that would be a great fit great thanks. Thank you and next is damaris hi. I think most folks answered most of what I was gonna ask, but I just have a couple of clarifying points since you haven't determined all the amis, the ami I get my question was: is the deep do you anticipate that the deepest level of affordability for the senior units will be at 30 percent of ami? Yes, and I actually forgot to add that, as part of the ami mix, there will be 15 formerly homeless, as well integrated into the project, and do you know what the ami will be for them? So I it's not it's not restricted to an ami, but we the it's set to, I guess what they're referred to as shelter rents. So I think, like it's like a studio in that tier is about 215 dollars per month. Okay, I mean I'm asking because you know 30 is still high for many seniors. It's a it's in the 20s and most seniors in the neighborhood live on a fixed income. What information can you share with us about the kinds of the mix of units like? Are you looking to have a certain you know, amount of three-bedroom two-bedroom studios that kind of stuff so again, there's there are. There are term sheet prescriptions for the for the ratio, obviously, because they'll be seniors integrated into this project, we'll have probably about 25, maybe 30 of studios to accommodate that population, but I think again, once we've confirmed the program with hpd and gotten their blessing. The next time we come before cb3 we're happy to present the full unit mix in an ami breakdown. All right, thank you. Next is lisa yeah. Some of my questions were asked, but I guess I'd like to understand a little bit more how the church is benefiting from this proposal. Is it just a share of the original development rights, or is it an ongoing payment? How does how does that relationship work, yep, so they'll be so they'll be given consideration for contributing to land a few different ways. One is through a ground lease, so there will be an annual ground lease payment to the church that escalates annually. We actually have a profit participation clause in our agreement with the church where, if the project gets refinanced or if we bring in new tax credits, the ability for the church to participate in some of that upside down the road in the shorter term, there's going to be there's an allowance for restoring the church and as part of the project, we're proposing 4 000 square feet of new community facility for the church, and that would be deeded over to them at no cost. So that again it's part of their compensation. Thank you and just to be clear. This is jack's partner john. There will be an upfront significant lease payment at the beginning, at least to go with the ongoing lease payments. Yes, I forgot that if you really think about the consideration, it's an upfront payment, long-term payments to the lease and about in the four thousand square feet of permanent space that is defused to the to the church upon completion all right. Thank you, john forgot about that olympia. Would ask that? Oh olympia, do you still have a question yeah? I do so about the height waiver. So when you get a head waiver, I mean how tall are you going? Are you intending to become so in this proposal in order to fully utilize the available floor area for the affordable housing, it ends up being 21 stories, and what I want to understand is because you said the rule is that you cannot, you cannot add far, but you may need to just go higher up. So how does that play like? Do you have empty space inside? Do you have higher ceilings like? How is that? Why is that working better? Why is it important to have the waiver? Because if we were to propose an as of right building, it wouldn't be tall enough to accommodate all the floor area of the entire site, because essentially we have to shift all of the residential floor area to one side of the site along madison street, so that the as of right, zoning envelope wouldn't be able to make use of that so we'd be we'd, be leaving affordable, housing, undeveloped, okay, so basically the current situation would give you less square footage. So the only way you can have your full square footage is by going higher right. That's correct! That's correct! Yes, and so, and so is there any way in which, in this euler process that you get this waiver, you know because the waiver doesn't put any cap. So what protects the community from future additional far the regulation like it will be written inside when you get your waiver yeah. So we at no point does the far for the site change, because that would actually require a separate europe action and that's not what we're pursuing the euler action. We're pursuing is very specific to just getting specific bulk waivers to the height of the building and possibly set back, but I don't think we've gotten that level of detail yet with dcp right. So one more thing we should see when you present the next time is to understand this bulk, like what would be the as of right and what is the new thing that we're giving you, because it wasn't super clear. I know you're freeing one of the windows, but I would like to understand this better sure yep. Thank you. So I I you know, I reached out to valerie's house before the meeting and also linda reach out to henry street settlement, so that the neighboring organizations are aware of the this development plan and I'm going to open up to the public to take four five questions. If they have so. Thank you, there is a community birth. Remember that has a question is sandra hold on one. Second, I for some reason. I cannot see this very well. Okay, sandra! You may ask the question hello. Can you hear me yes, hi? Thank you. My question is about the retail space you said: has anything been determined yet I know you said 5 000 feet is going to be dedicated. No, we it again. It's still early in the process. We haven't determined exactly what type of tenants we would like, but actually part of as part of the process of cb3 we'd welcome the input of the type of tenants and services that cbs would like to see for this location. Okay, thank you. Thank you and next would be mitchell. Grouper yeah. There was some mention of a preservation plan for the church other than restoring that gothic window and the wall in that area, where you're removing the one-story building. What does the church need and what is planned in terms of preservation? So we haven't conducted a historic needs assessment report. Yet that's actually going to be one of the next steps we're going to do, but with kovid you know everything we've been working on in the last three months has been delayed, so once we have that needs assessment report, it'll include items like repairing gutters, doing any masonry repair that might be needed, but overall we don't anticipate any large scope of work, be beyond restoring the window as we're proposing, simply because the church is in fairly good shape. To be honest, we're quite amazed, given you know, it was completed in 1829 so and of course, hats off to father nat for keeping it in such good shape for as long as he has, but also just sorry. This is jack's partner, john again just to interject, and this leads to two of the questions the special permit. We are going through dcp and three lerp involves feedback from a landmarks preservation commission and we're going to have a written agreement that everybody has to agree to about ongoing preservation of the church and the church's needs. So when we talk about a needs assessment, it won't be. You know us dictating a needs assessment from a consultant that will be signed off on by lpc and as part of the special permit process. It becomes codified into the approvals that we have to ensure that the needs assessment can be delivered. You know even 10 years after the building is built that the church's preservation is right, been accounted for so yeah, so it actually would affect our ability to get a cfo or a permit for the new building. So we're invested to make sure that works completed correctly. How many floors could you build as of right on the same footprint? I think with heirs? It is 11 stories. Thank you. Next is sinaite of westworth hello hi. I wanted to. I wanted to ask if there would be any prevailing financing for the project through the new york city council, or anything like that. No, so currently there would be no requirement for the city funds that are proposed for prevailing wage when the building is in operation. I think because we're over 120 units, as proposed that would trigger union staff for the building, got it. Thank you so much yeah. I just always I put myself on mute. Okay. I just wanted to ask two quick follow-up questions. Has there been discussion about any level of community engagement around you know the retail space and also are there any additional amenities that you all might be considering for the building and then last but not least, I know that you said there's a space that you're considering four thousand square feet for st augustine. Is there additional space that the community can use for? You know other types of meetings and events, so the answer first part of the question we are definitely open. We intend to have an engagement with cv3 in the community about potential uses for the retail space. We're not opposed to creating new community facility space that would be separate than what we intend to provide for saint augustine, but we have to identify funding sources for that and also tenants. I do want to add that early in this process, we did speak with the henry street settlement as well, so we sort of begun that process of talking to local non-profits, who might be interested in such a space, but again we're right now. At this stage, we're in all we're currently envisioning is about five thousand square feet of ground floor retail, with the new space for exclusively for st augustine's use, and the last question you didn't give me an answer. Maybe I you didn't hear me: are you also talking about any other amenities in the building for the tenants? Yes, so I think you may have seen in the diagram the areas that were shaded in green, so there'll be two it's hard to see. I'm sorry [Applause] yeah, I know interested. So when we come back, we come back to you folks. You know, after we have a more developed plan, we'll have much better looking renderings and details to share, but just conceptually there's two outdoor recreation areas that are proposed. One is the rear yard, which will be actually shared by residents of the church as well as residents of the building or congregants of the church and residents of the building. There'll be a second exterior outdoor recreation space on the sixth floor of the building that would be for use by the residents and then that actually leads to some interior recreational spaces as well and just to add to because we're proposing using errors, which is the acronym for senior housing in the zoning code. There is a requirement for a certain percentage of in of interior recreation space so which we'd be providing great. Thank you thank you and I'm gonna go to david garza first before family, because he is right across the street david hi. Thank you, jackie, and you know thank you cv3 for providing the forum to hear about this project. My name is david garza, I'm the ceo and president of henry street settlement. I know we just mentioned and you know we certainly welcome the opportunity to sit down and see how we could provide supportive services. I don't think we've met yet jack, certainly father nate. How are you good to see you? Thank you. You know to the south. Our senior center exists to the east. We have a naturally occurring retirement community for seniors also to the east. We have the meals on wheels office that provides meals, and then we have a senior companion program all in the three sides surrounding this site, and then of course, our headquarters are across the street and and then there's a federally qualified health center right next door. So I think there are amenities to engage for the residents, particularly formerly homeless and seniors and people who are low-income and we look forward to sit down to explore those possibilities. We do as well david, although I'm wearing like a t-shirt and my hair isn't, but I think we actually did meet about a year and a half ago, it's your office when we first got engaged on this project. So I'm in disguise myself. You can't recognize john, because yeah it's actually not a mask, you know it's. It's been a while barbara, okay, next penny. Thank you. Thank you david. We look forward to continuing the conversation. Yes hi. I live in that building juvenile gardens that other 21st 21 floor. Building right that you guys are going to be facing. I just have a question: do you guys have a timeline at all so because we have to go through the euler process? I mean that typically takes 12 to 18 months and that doesn't you know, take into consideration delays because of Covid-19. So if you consider that and that typically you have in terms of closing in the financing with hpd, it happens either in June or december of each calendar year. So I think the earliest we could close and start our construction would be december 2021. But that said, that's all pre-covered planning as you. If, as folks may have heard, hpd obviously has had some budget setbacks. So there's probably going to be. You know additional delay as a result of that, so I suspect 2022 would be the earliest. We could close and start construction. Okay, olympia, you have one more question: yes, just because of what the marriage asked and it reminded me of some other eulers. So one more comment for your next presentation: I understand that you said that you're gonna have some public space amenities, but it sounded like they're gonna be restricted to either the tenants of the building or the congregates. So especially, I mean beyond the henry street settlement I haven't seen the plan, but there may be other nearby people impacted in terms of light and air, so when we see the shadows etc. So it would be important to understand if you have amenities for the overall surrounding neighbors, who will be impacted with the additional 10 floors right, so you're correcting to clarifying that the amenities spaces are specific for the residents and the congregation we currently are not proposing any amenity spaces that would be open to the general public yeah. So just in order for us to understand in the future, it's good to know who's impacted and who can benefit from you know, understanding which will be reviewed yeah. It's part of you sounds, like you probably know, through the euler process, there'll be that environmental study, which will look at those issues. It is a very interesting topic, but we also in the interest of time we need to move a little bit faster, linda and then followed by michael yeah. First of all, I admire this landmark greatly. I looked at it many times I haven't been inside yet, but soon, and I admire also your efforts to you know highlight it and make it will certainly be better than what's there now it looks to me like a what do we call this thing again. We call it a envelope waiver, it's a little bit like an air rights transfer right except you're on your own property. Correct, that's right and what is the zoning code? That applies the zoning district yeah? No, it's like a an air right would be a 72, 711 yeah. I think it's actually that's the zoning resolution that the dcp's falls under. I think it's 72, 7, 11., 74., 74, sorry 74.! I couldn't understand you one of you, please 74, 711, seven, four, seven, eleven! Okay! Thank you! Michael perlis yeah, I just want so I just wanted to sense. The affordability levels haven't been fully determined. I just want to echo what people have been saying and say that the ami of all of community board 3 is 58 and in this area it's likely much lower and mix and match allows up to 120 ami, maybe higher. I think there may be some programs that are higher so just keeping in mind that that's twice what the full district is just really stressing and urging to try as much as possible to deep skew the rent and get the lowest levels of affordability possible. As that's been important, thanks, yeah. No, I understood and actually to that point in our initial discussions with hpd. They were also mindful of that through their community group, and so they wanted to encourage us to cap the top ami tier at 100 of ami partially. In response to that issue. So and as you probably said, I mean it's a little bit of a discussion of ami versus subsidy amounts, so it's kind of a negotiation that happens, but so far hpd has been very proactive in pushing us to to propose lower amis and still make the budget work. Thank you. Thank you all. So, on top of what everybody asked, maybe next time you come back to community box 3, you could also add certain illustrations. Tell us. How is the shade gonna be cast on velocity house, because this is a 21 story building and it's so close to vallettic houses, and I just curious to know I mean I guess in euro process. You would have to do that anyway, but it would be helpful for us to get an understanding before that in and also next time when you come back to cb3, please send us your plan prior to the presentation, so I could share with them the committee members for them to read before the meeting. That would be helpful too will do. Thank you so much. That's all I have so any other messages. Any final matches message you want to send to: oh I'm sorry, linda sorry, yeah just one more thing since now: we're talking 74, 7 11., that implies in an air rex transfer you would be making a deal to provide a perpetual maintenance of the of the landmark. Is that part of part of this yeah? That's correct, yeah, my partner john described that earlier, okay yeah he mentioned it. I just wanted to be sure, because I didn't know that we were talking 74, 7-11 yeah, so I, in addition to bugging you here, I chair the landmarks committee and we hope to see you at some point in the future. You will see us soon. Thank you. Thank you so much for coming to cd3 and share your plan with us, jack and jack and jessica. Thank you so much! Thank you! Oh and linda. Just I don't know if you know rick azar, but he'll be working with us as our landmark consultant. So, okay, thank you! So much! Okay! Thank you! Everyone! Thank you. Everybody have a great night good seeing you thank you bye. So the third item on the agenda is the district, miss statement. So I already sent you the district miss statement last night linda. Can you pull it out? Would that be good? Yes, let me see so the dns. This is just a draft and it was further edited by jim. In response to the comments we made at the June meetings. I did not receive any emails from the committee members since the June meeting, so I just assume we will not be adding new items to the dns and we want to finalize it this month and also the dns will be loaded together with the budget priority in october, and I mean on one hand we don't want to keep editing it and on the other hand, we want to leave ourselves some time in case anything unpredictable happen in the next two months, so we can still add it to a dns yep. So let me see trying to see it here. I cannot see it so jackie while we're trying to put this up one thing that I think is missing and I don't know if it's in another document from jim is. I think we had agreed that we're gonna have some sort of copy, 19 disclaimer, you know or because this is going to be. You know the budget that comes when a lot of this impact will already be felt. Is this jim something you are working on or we have to drop something right, how's that better? It has not show up yet really yep, there's a sentence in there: olympia about Covid-19 19 on page two page, two? Okay, so maybe I missed that one under the budget priorities it starts on. It starts on the bottom of page, one, sorry, okay, impact on the real estate market, blah, yes yeah. I was thinking more, you know, because of all the other phenomena that may be happening, you know vacancies, predatory takeovers, etc. We don't want to name them olympia. I had this discussion with. I have your feeling as well, and I shared that thought jim and I actually discussed this two days ago. So a lot of things we cannot pre because the dns is for fiscal year 2022. So thank you linda. So a lot of things. We cannot predict it from now and we also do not have the experience of history to predict. What's going to happen, so I think what we can do is that we're going to carefully. We advise the city to carefully monitor the situation and see and in response to to what they need to be addressed, but just so everyone's clear we hi everybody who doesn't know me, I'm the assistant district manager for cb3. We did add something that addresses that, specifically in the second half of that paragraph, that lisa was pointing out earlier. You know we do acknowledge the unknowns, but we try to kind of give a caveat that this is exactly what we need to be looking at as a committee over the next 12 months, as we draft resolutions and whatnot and then be prepared to pivot as needed in the next fiscal year, based on what we've seen and what maybe has not been addressed in the previous year. So that was our kind of like what me and jackie discussed as a as a way to address these unknowns. Yeah. I read it now better. I mean I don't know. I thought we were gonna put it, you know as an opening statement and the you know it also nexus to homelessness. I mean there are so many tragedies that are unfolding at the same time and they also took away a lot of money from many important. You know legal assistance, programs etc. So I don't know, but definitely your sentence is pretty good. Other committee members, do you have any comments and questions? I think there's a word messing in there somewhere, though then. The last line of that paragraph he's talking about yeah, there's very likely. I think when I work in track changes, I find that I miss small grammar things because private equity firms that may be looking for opportunities there you go so are we explicitly calling out then a harassment? Yes, it's mentioned, I'm looking for it. I just you know. I think it's mentioned when we're talking about funding the community groups that do the community based organizations that kind of provide services that protect tenants against that type of behavior in the in the first stated need build to preserve, affordable housing- and- I guess also it's sort of alluded to in the cobid paragraph as well. So this is for the city budget right, the gym. Yes, it's for the fiscal year, 22 budget yeah so shouldn't we maybe make basically an open remark about how we're disappointed about the cuts that they gave to hpd and about all the services that they cut and how this is very alarming to cb3. That would be the budget priority. Jim you are, you are mute. We can't hear you sorry, there's a. We acknowledge the hpd cut capital budget cuts in one of the paragraphs in the beginning of the cobit paragraph. You know I mean you could say something that you know you want to frame it. It's a little bit of a gray area, because you want to frame this document in terms of needs so like. In that sense, the need would be. I mean the need is affordable, housing, the capital budget being slashed, exacerbates that need, I don't know I mean I think, we've already. We already stated in the dns the need for affordable housing and also regarding the cuts we can bring that up in the budget. Priority which specific program they cut and also like capital budget capital budgets in general, got that cut so across the board. So we can mention that in a budget priority I just feel we need to have like stroke come out strong this year, because the way they went for the budget, it was very problematic, but they decided to cut and not to cut. Do you want to propose any language here? I mean fundamentally what I because I I'm relatively I don't know I have copied 19 brain too many things are coming in, but basically it's like I'm overstimulated with horrible things that are happening, but I would ask maybe it could be a statement that is put in front of all of us, not just for our committee. You know what I mean, I don't know. What do you think? Is it better for our committee within our committee or will the cb3 has an overall introduction that then has all the various committees district needs. So that's a good point so something that I that we usually do earlier in the process, but we've held off on this year is a it's a kind of an introduction for the entire community board, and I suppose that that's probably this year, maybe the best place to address the budget cuts because they do the work of so many different committees it may it may. Maybe that should be the theme or one of the themes that we organize the intro paragraph around. It's just the sort of austerity budget that we are that all the committee's work is faced with. So I don't know I have to work on that sometime between now and october likely next couple of weeks, but I'm just I'm gonna note that at least as kind of one of the ideas for the for the for the big theme of the intro paragraph is addressing the budget cuts specifically yeah. That's usually, you know we usually kick off the whole thing with some sort of theme. Like I really like that idea. Thank you, lisa. Thank you, michael [Laughter], michael. I see him thumbs up on the screen, but not the on the chat. So I want to ask committee members: do you have any questions more questions on the dns? If not, I want to propose we adopt it. We don't need to vote because it will be voted in october, along with the budget priorities, budget priorities we'll be talking about programs, so I mean if we don't, if no other committee members have any other more comments, I'm just gonna consider that this is approved by all of us. Thank you all and that's all we have for today. So eight o'clock, not too bad, so not too shabby jackie. I like it. Thank you. Thank you so much damaris. Okay! So do I? Would you like a motion to adjourn yeah and dominate joined us too? Wait all right. I was like it's okay and damaris too, so we have them as the final have them on the final vote. So do who's gonna motion to attend the meeting. I do second, all in favor say hi. Do we have to do a role call we have to all right who's here, my goal. Sorry, I was doing it myself: okay, jackie, yes, linda! Yes, michael, yes, dominic, yes, jonathan, yes, herman, hewitt, yeah! Thank you, herman trevor holland. Yes, thank you lisa! Yes, thank you! Lisa olympia! Thank you, damaris! Thank you! Troy feliz is troy still here. I don't see him. Okay, steve herrick. Yes, thank you steve and tim laughlin. Did he join okay, we're all set thanks. Thank you. Thank you good night, good night, good night good night, bye thanks good night.",
        "summary": "I want to start by thanking you, jackie and the community board and land use committee, as well as the local elected officials, that for their support over the past six months and I, also want to acknowledge the five tenants of 70 mulberry for the continuing commitment and working with dcas over these past couple of months as well, I mean finally I want to touch base on the community input and recognize all those who have sent in letters emails, Some phone calls expressing their support for sending mulberry This is truly a historic site and because of everyone's involvement, this administration has put forth the resources needed to preserve its rich history Now. As you know, on july 2nd, the mayor and dcas announced the allocation of 80 million dollars to help rebuild this site and that the city would prioritize options to preserve what is salvageable from the remaining structure.\nI think the community board's resolution still stands, Thank you lisa and do we have other committee members want to ask questions?\nI would really feel like I would put my kind of personal support behind preservation, but I also think that to do it, you need to do it in an informed way and understand its implications and really make that part of that community outreach process that I'm that I'm very glad to see you doing and I wanted to ask that this project would be covered under a pla with b cast I didn't hear the last part of what you said: a project: labor agreement for d cast Are, you saying for any future redevelopment of the site?\nI know that construction is gonna, stop at the third floor, but I think it's vitally important to reserve, preserve the and stabilize the structure that remains both for safety reasons, as well as preservation reasons At the third floor, or temporarily put something in there to ensure both site security and safety of the building So, while I can't go into the details of exactly what is going to transpire once we get to the third floor So there are no kind of safety issues or site security issues with the building So the scope of work has actually already been out to the public, so there were two qualifications: This is through mwb small purchase and the two requirements for a vendor to be eligible to present or put forth a proposal on for this project are one you have to be a certified mwbe with a small business services department for the city as well as you must be registered in passport But if you would like to see I, don't know I'm, not sure if, if you know of an actual business or nwb that meets those criteria and has not gotten that, if that is the case, please reach out to me.\nChurch is a landmark and developer plans to build 100, affordable units, and this is going to be their first time to provide the details of their plan to cp3 and the presenter I I spent about 10 years or 12 years on the lower east side, representing representing chelsea and also working for the community board and also had the the honor of being on the on the cb3 commit subcommittee, which it was an honor for me, but I'm here tonight representing st augustine, and thank you for letting us present.\nThank you father, nat and just to the really I think the big takeaway is that, while the church does need an infl, an influx to their resources and into their finances, they want to do that through the development of affordable housing and and so that it's not just financial resources for the congregation, but that it's an asset for the community, and that was an important part when the vestry was It was really focusing on affordable housing, development Wasn't there if the historic, very old and very beautiful church, wasn't there, then a fully efficient, affordable housing building could be built on the site pretty easily, but because we're preserving the church and then building around it.\nBuilding to use all of the as of right floor area on the site, I believe jack has a powerpoint, so you may want to make him the co-host Thank you father nat.\nHere's a church picture of the facade Our goal here was to take all the available floor area for the site and create a massing, a building that would allow us to fully utilize the number of affordable housing units that are available, while also taking advantage of errors, which is an acronym for senior housing So. The program is 130 units with about 5 000 square feet of ground floor, retail and 4 000 square feet of new community facility space that would be used by saint augustine church, and you can see the two massing studies on the left and to the right are just the typical floor plates for how the building would lay out on the various stories- We can't read it I mean these are really conceptual zoning diagrams We are, you know not really considering it's obviously not developed architecturally, but it's kind of a baby step to look at the height and the mass thing, and perhaps the interplay of masses interconnecting the use of at least two different materials to sort of break down the mass of the building and make it more empathetic with the church.\nSo the image on the left shows the lower extension actually separated from the church, as opposed to the current nx That's, a good second way to that image, which is error We would weave that into that program, just a little bit of above that space is a green area which is actually the roof of the commercial space that faces medicine, It's, a one-story rather a good size, commercial space with frontage on madison and the roof of that would be a garden for the residents of the building the new building and would provide breathing room Yes, of course, because it would, it would be accessible from their new space, which is we're kind of representing the blue glass transparent?\nBasically, it allows adjoining buildings on a development site to utilize unused air rights over a landmark building, Let committee members to go first so I mean the obvious question: is: will that trigger euler?\nYes, so I mean that would have been helpful in the beginning of your presentation to say that even though today you're not asking regio that's, why we're reviewing this project and then it would also be helpful like to receive the details that pertain to the euler A lot of those details aren't determined yet and when we have everything ironed out, then we can present information to the community board and it will be done in advance that you have time to review it.\nUndeveloped, okay, so basically the current situation would give you less square footage, and so is there any way in which, in this euler process that you get this waiver, you know because the waiver doesn't put any cap So what protects the community from future additional far the regulation like We at no point does the far for the site change, because that would actually require a separate europe action and that's not what we're pursuing the euler action.\nYou know I reached out to valerie's house before the meeting and also linda reach out to henry street settlement, so that the neighboring organizations are aware of the this development plan and I'm going to open up to the public.\nMy question is about the retail space you said: has anything been determined yet There was some mention of a preservation plan for the church other than restoring that gothic window and the wall in that area, where you're removing the one-story building So we haven't conducted a historic needs assessment report.\nso I think you may have seen in the diagram the areas that were shaded in green, so there'll be two You know after we have a more developed plan, we'll have much better looking renderings and details to share, but just conceptually there's two outdoor recreation areas that are proposed There'll be a second exterior outdoor recreation space on the sixth floor of the building that would be for use by the residents and then that actually leads to some interior recreational spaces as well and just to add to because we're proposing using errors, which is the acronym for senior housing in the zoning code.\nOne more comment for your next presentation: I understand that you said that you're gonna have some public space amenities, but it sounded like they're gonna be restricted to either the tenants of the building or the congregates So, especially I mean beyond the henry street settlement.\nI think it's mentioned when we're talking about funding the community groups that do the community based organizations that kind of provide services that protect tenants against that type of behavior in the in the first stated need build to preserve, affordable, housing, and- This is for the city budget right, the gym , Yes it's for the fiscal year, 22 budget, so shouldn't we maybe make basically an open remark about how we're disappointed about the cuts that they gave to hpd and about all the services that they cut and how this is very alarming."
    }
}