{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB8",
            "channelId": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "title": "Housing (Advocacy) Committee Meeting",
            "publishDate": "2020-12-10",
            "shortDescription": "",
            "lengthSeconds": "1:51:35"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB8",
            "normalizedName": "Brooklyn Community Board 8",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 8",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "GT3_vyq7J8g",
            "fillerWordCount": {
                "uh": 112,
                "um": 204
            },
            "readTimeFullTranscript": "59 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "housing": 45,
                "trust": 26,
                "tax": 21,
                "problem": 20,
                "money": 18,
                "section": 16,
                "state": 16,
                "chat": 15,
                "place": 14,
                "property": 13
            },
            "wordCountSummary": {
                "housing": 21,
                "section": 9,
                "money": 6,
                "place": 5,
                "tax": 5,
                "hearing": 3,
                "trust": 3,
                "owners": 3,
                "apartments": 3,
                "impression": 3
            },
            "fullTranscript": "Good evening all we're just waiting for Miss Tyus or Miss Moranville, well, Miss Bramble. This is her meeting to join us or any of the other long-standing members of the housing committee. Pardon my ignorance. Do we have an agenda tonight, not that I know of I, believe it's a continuation of last month's discussion about the NYCHA letter for Wi-Fi and other important improvements. We give the music in the background I'm trying to keep my birds seated other than that I may maybe the HPD loss on Bergen and Dean I don't know, I am looking forward to it. Thank you. No problem, Mr Callahan, Ms Hyatt. Would you like to get going with the meeting while I give Ms Granville a call to remind her miss tyus, you're, muted? Thank you. How is everybody doing glad you're all here, I know you can't all answer. Let's see, I did not get a chance to double check. The agenda this evening is Adam sax with us. No okay, he's also late. Okay, so now I know that there was a letter that was going out regarding the privatization of NYCHA through a section changing it from section nine to section eight, which would allow for eventual privatization, I'm hoping that someone can bring me up to date on that anybody care to speak to that issue. You can unmute yourself if you can add anything to that discussion. Okay, no takers, all right! Now there was some talk, not having notes in front of me either there was some talk regarding a housing fair. Has anybody done any work on that? You can unmute yourself and answer. Let me check the chat, see what's going on there. Everybody just got here, okay, so it's just Us chickens. All right, let's see! Well, we have some challenges. Coming up, NYCHA is going to be privatized. Unless we speak up, there was a hearing and I think that the Mrs Granville has joined us. I just want to finish my statement and hand the baton back to her I think that the comment period for the hearing on transferring NYCHA from section nine section, eight is still open, I'm not sure I, hope Ms Granville will be able to confirm Lomas Granville back to you, okay, all right. Okay, so I was asking. If anyone wanted to comment on that letter that went out, I'm not sure if it was shared to the committee, the housing advocacy committee on the transfer of NYCHA from section 9 to section 8. I'm sorry can you hear me. I can hear you okay. What I was going to say was that it didn't go out yet you just told me that you had looked at it and you made a couple of comments. It hasn't gone out, but my feeling was that it should be sent anyway, even though they said the comment period ended yesterday, oh reason being that we didn't find out about it until Sarah. Let us know so. This is one of those things where they sneaked it in on us during the month of July and we were meeting, but we didn't know anything about it, but I think it's important enough, since we have three major developments in our area that we, you know, let our feelings be known and it's my understanding that Mr Well Mr Carnegie is the chair of the committee and he we discussed him in the past about the fact that he had appropriated monies for Albany houses that were never used supposedly to improve their playgrounds and something else that was going on and every time we went there all we saw was signs of neglect. Should the letter also be going to state representatives? Yes, all right, I get to mention that to you, because the state people had their from what I understand they had a hearing at 5:30 yesterday and the one for the City Council Committee was held at 11 in the morning. If I remember correctly. Actually sorry, this is Sarah the so the state assembly meeting was the one that was at 11 yesterday morning. Okay and I, I'm I didn't see the very beginning of the hearing, so I'm not positive whether the decision is being made, you know, is definitely being made at the state level and I don't know who the decision makers on this necessarily I don't know if, like, for example, is City Council going to get to actually vote on this, or is this just something where we want them to express an opinion one way or the other, but I figure? If the assembly was having a hearing about it, they must have decision making power right. Correct, may I share for my 20 years in the settlements, division of the city controllers office and defending the city against claims of child lead, poisoning physical effects. I can tell you with a certainty that the costs for NYCHA are divided as follows: 50 federal, 25, state, 25 city, okay, all right! That's the way that works, the city, the state, I'm sorry, the feds are supposed to pay the city in rule of taxes, pilots. So whenever you see that term, it's payments in rule of taxes and the money never comes, and that is one of the core reasons why the NYCHA facilities are the deplorable conditions that they're in with peeling lead paint and asbestos and outdated heating systems, and so on so they've been trying to figure out how to dig themselves out of this hole. But the whole thing needs to be revamped, so each one of our officials on all three levels would need to get that letter. Okay, now can you repeat those percentages again who was supposed to be paying? What 50 federal 25 percent state, 25 city, okay, so and I can't tell you how many times I'm gonna go into it just on and on they. The city has tried to rework the payment plan, it's the various memoranda of understanding about what would be paid and when and it never money, never comes it's very sad. So who was it that never paid ever the feds? Okay? Yeah number pay number okay, so this is where we are and New York City has a mandate to house the homeless. This is we're dug into this hole. We don't do it through NYCHA. It goes into homeless, shelters. There's a court order out that no New, Yorker, New, York City resident should be homeless. So if they don't get a rental apartment, they go into a shelter. So Niger pills, the sale is part of that yeah Sarah. You have your hand up yeah, just because a lot of this NYCHA stuff is just newer to me. So I'm learning yeah I was wondering so the federal money is it that they promised the amount of money and then they don't deliver it or is it that NYCHA makes requests for things and then is denied I think it's probably a mix. It's probably a mix. Okay, so it would be an interesting question to put to the mayoral candidate stringer, give him a chance to blow a hole into the Bs screen. That's between us and what's really happening there. So I didn't pick up on the agenda for tonight's meeting, so I'm definitely back to you chair Randall. Well, we did not have a set agenda for tonight, but I'm happy that you did start off with talking about what they're planning to do the so-called blueprint for nature and I. Don't feel good about it at all, because I don't think we should. The rights of affordable housing should not depend on private developers and their markets and their fluctuations on. What have you so I? Don't feel good about it at all and from what I'm understanding if I read it correctly, if you're going to use the dilapidated condition of the buildings to try to qualify for section 8 in order to finance the bond issues that you're going to need, it makes me wonder if there was a plan all along to let things just fall apart and then propose this, because you know the city has a way of letting things go when they really don't want to be bothered, and then, at the last minute they come up with these plans to save stuff and I. Don't personally think that it's going to save anything plus, I'm still concerned that we have so many apartments that are being warehoused in public housing, and it's my thought that if those apartments were being used, we wouldn't have the homeless problem that we have go downtown Brooklyn and look up at the buildings at night and see how many apartments you see. They don't have any lights in them. They don't even try to make them. Look like there's anybody in there I hope that is in the letter. Well, Ethel. Thank you because I will remember to put it in there. Okay and I want to let my committee know that I'm going to write, but if you feel compelled to write something to put your feelings on paper, please do so as well, because I'm sure they had a lot of people who knew before we did that the hearing was going to take place. So there were some people who testified in person and there were other people who also wrote things and I wouldn't want these folks to think that, oh they netted Albany houses, but they were impressed how things were because we were not Sarah. Thank you. So much for being the trumpet blower to let us know that this was going on, because we did not know yeah sure, I mean and I appreciate everyone here. You know paying attention to the issue as well. I mean I only saw this because somebody else who I know in intent, organizing had sent out the information I was just very surprised that I that it was the first time I was hearing about this blueprint and I saw that Kathy Island is asking us to summarize the proposal. Maybe does somebody want to do that? Okay, I will tell you what I have which is based on I, think what you probably have sent Ethel and Elsa sent it to me and what I'm going to try to do when we finish is send a copy around to make sure everybody gets one so that you'll see it. Okay, the concerns about this particular project. The goal of the plan of this plan is to create a new quasi-private entity called a public trust quote, unquote to which all public housing units can be transferred so that they can be converted to section 8 and be made profitable for private investors. The concerns number one reliance on private investment. This discourages NYCHA from making repairs now. The third thing is loss of oversight and protections, and the fact that this change would make everything permanent there would be no going back once this change is made now. The second page goes into extended reasons for this: the first one reliance on private investment, the trust and conversion to section 8 opens up these housing units to private investors and ties, tenants, futures and rights to housing to their profit interests and market fluctuations. Since when would private people be as interested in where you live as you as a citizen, it doesn't even sound right. The trust will generate money to make repairs by taking on debt through issuing bonds to private investors. If the trust defaults on its repayments, the properties and or vouchers may be in jeopardy as collateral. Nycha has told us that this is like the school construction authority, but, unlike to see the SCA, there is no option to approach City Council for money if private investment fails or the trust is unable to make a debt payment number two. This discourages NYCHA from making repairs now, after the trust is created, NYCHA must convince HUD to give them tenant protection vouchers. Tpv's. These vouchers are the collateral that allow the trust to issue bonds to private investors. To obtain these vouchers, NYCHA is pursuing section, 18 I think they meant section 8 on the basis of obsolescence. This means that NYCHA has to prove that the buildings and units are in such disrepair that transferring them from section 8 is the only option. This incentivizes, not repairing the buildings. Now, loss of oversight and protections tenants have no real oversight to weigh in on the plan other than pressuring state officials and voting their conversing. Their concerns to NYCHA and publicly officials vote on the legislation and, if approved, HUD, makes the ultimate decision that would seal the deal. So that goes along with what ether was saying about how it's important for us to make sure that our state people get a copy of our comments as well. The nine-person board of the trust will include a minority of tenants, two appointed by the mayor and two appointed by Nycha's CEO. This does not promise tenants any real representation. Nycha has told us that this is like the school construction authority, but, unlike the SCA tenants and community members have no say over how building construction will proceed or what is prioritized. There is also no mechanism of accountability for making sure that trust carries out its duties well and to tennis liking. The trust is only accountable to the mayor, the board of the trust and the night in the NYC department of investigations. Aside from that, there is no way to sue or otherwise hold the trust accountable for doing what they said they would. The last thing is the fact that this is permanent if the trust is created and the units are converted, there is no pathway for converting them back to section it says section 9. Moreover, the trust remains in existence so long as it holds debt potentially in perpetuity. So that's the information that I have at this point that I will make sure that all of you get so I'm looking at some faces here and I. Don't see anybody smiling. So let me know what you think can I respond to that. Yeah I have the pleasure of working in the Imani Garden like five days a week, and I've been watching for the past year. The complete renovation of the Weeksville garden project under this private partnership model that they're proposing for all the projects and the thing that hits you in the face first off, is that all the contractors working they're getting completely new kitchens new baths, asbestos removed plumbing the whole roofs windows being replaced is a complete makeover and all of the workers and all the contracts are private contractors from often outside the city not exclusively, but mostly so. You know most money's going to the owners not to the workers, it's exactly, there's no union labor involved. We have no idea what these workers are making. So it's exactly what's wrong with this whole private public partnership quote-unquote, because we have no control at all over the wages the workers are making it just left up to the marketplace, and this is you know why this is such a bad idea. You basically have a bunch of rich dudes, probably white, dudes, probably living in the suburbs, getting all the money and the folks who are doing the work. Probably people living in the city are the ones who's getting. You know screwed. So it looks great it's nice to see Weeksville garden, getting completely made over God knows they need it, but when this day is done, all the money ends up outside the city, the real money you know, and so this is the model that's happening with the tax lien sale, exactly where these private developers are buying up these tax, foreclosed properties and a fraction of their value, the city's getting no money. All the money's flowing out of the city into these wealthy people's pockets, it's upside down and backwards, and you know it needs to stop I, don't know if you noticed the headlines today, but they disappointed that Biden has appointed his proposed new HUD secretary. If you notice how a 68 year old black female, named fudge, who was apparently her advocates in the black caucus, wanted to make her the secretary of Agriculture and instead they made a white guy from Nebraska Vilsack, the Secretary of Agriculture, and made her the HUD secretary. So for what it's worth it looks like the fix is in again, these are the kinds of things that make a difference. You know that we need to speak up about. You can't have this. You know big victory for Biden and then he goes and appoints all these people who are just going to perpetuate the current status quo, and then we wonder why all of these private, healthy partnerships keep on being pushed down our throats. You know it all happens right now and I just made an appointment to be in Washington DC December 22nd to 28th. Maybe we'll do a little snooping around who knows. Well, I'm sure you have something interesting to tell us when it's finished yeah well, we'll see. Sarah I see you looking very thoughtful yeah. It's just I, I'm concerned about this, and I'm also thinking that a lot of people are discussing taxes on the rich. At the moment a lot of people are discussing, you know, taxes on billionaires, etcetera fixing, it would be I, don't know. I would prefer. Instead of increasing the amount of debt taking on a whole bunch of new debt in order to fix NYCHA, there might actually be some money that is actually available to put towards this I. Remember I attended this. Oh gosh, it was a teach-in on revenue for New York state, and they were talking about how just bringing back or stopping the policy of rebating the stock transfer tax would raise enough money to completely fix nature several times over yeah. It would bring in 16 billion dollars a year to the state yeah. So what happened? Well, I believe that that's a bill that is currently I think the bill has already been proposed in Albany to stop rebating this truck transfer tax, but so I'll definitely be paying attention to that. When the new session starts, you know what princess under Bloomberg a lot of pride. A lot of the city. Housing was slated to be privatized because one of them I think it's on decap, where they use the old law on the book that, if you have someone that committed a crime and living in your apartment, you can lose that any private public housing and the apartment I think it's on the cam that was used to displace a lot of people in that building downtown Brooklyn, and this happened on the Bloomberg. So a lot of the things that we are seeing right now when it comes to public housing, it was in the works long before Bill Blazer take over, because Bloomberg had sold a lot of city buildings and in privatizing a lot of public housing. So what we are seeing now has been in place and one of the first public housing was affected. Was the one I think it's located on the cam and I knew about it, because one of my students was living in it and his parents, mother, was having problems, and she was saying to me way back then that a lot of the seniors who were living there, because their children and their grandchildren had problems with the system and they moved in with them. They used that law to evict them from the property and turn around, and it ran that to a lot of private people. So if you see a lot of public housing where the faces are changing pay attention- and you will see that because I know someone where his son live in a private house in the Bronx and he's living in a one of one bedroom and a one-bedroom apartment and he's paying 1200 a month in public housing and like I put it in the comment, why don't we work for the apartments to be hand over to the tenants and make them homeowners, so they would be responsible turn. It into a co-op because a lot of people in public housing are paying rent and I think that is something we need to work towards. Having them become home owners of these apartments and I think that would solve some of our issues we are having with public housing yeah. There's a I just want to interrupt you for one second Greg I. Remember you saying this when we met in Albany houses, I, remember that you have said this before yeah, so I think that's the right. We should go helping the people who live in these things become their owners of those apartments. Was it wasn't that, like a program way back in the 60s and 70s, which is how New York City Housing actually nationwide public housing became the derelict thing that it is right now like didn't? They move them into their things? Isn't that how most of the Hdfc apartments in New York started initially like they moved from NYCHA to like affordable home ownership? Please refresh my memory. If I'm wrong, not from my research that I did so I, don't know, maybe I missed that for me along the line. I don't know I think like a couple of Hdfc is on sterling place, Saint John's place, and not only eight but board six as well a number of the smaller so-called development. Sorry, my bird is linked right now, so she's pushing it out. So please forgive the chirping, and then there are a number of them. I'll do some more research, there's a book that I'm reading and I'll finish it and report back to the committee. Okay, well, I just have to say: I was right around up in Williamsburg and my bike and some guy running for office up there has is painted. What do you call a stencil on the bike passes? Says deeds not leases and they're all over the place. Yep, Bushwick and Williamsburg, so I think someone's figured that out right. There I don't know he's running for some office up in Williamsburg, because I know that I had a problem with the building on scent marks. Years ago, when I was living on St marks between Kingston and Albany, where the people who, in that building they actually took over the building and it becomes home owner. You know they did they it's a huge apartment. I, don't I can't remember the whole story, but I know when I was living there with the tenants fought to become home owners of the apartments instead of being renters and I. Think that is something we need to introduce, and especially because in a lot of these housing, because things change in New, York City, the next thing they're gonna go after is these big public housing and a lot there would be more displacement. So I think now that we are very new in it. We need to get on board and meet with the people who live in public housing and see how we can help them to become homeowners and to become owners of these apartments, because some of them have been living there for years and people is under the impression because you live in public housing, you don't pay rent, and that is not true. Some people live in public housing paid just as high rent as we people live in private houses and I. Think that is somewhere. Something people need to get away from because you live in public housing, you're living for free or you're, not paying rent, and it's not true and I. Think that is something we need to educate the public about, not everybody living public houses are getting help. Some people are educated because I know somebody who had two masters that were living in public housing and she was penguined and I know I, like I said, and no one who's presently living in the Bronx is paying twelve hundred dollars for one bedroom apartment and every time he gets a raise, you have to take it into the city and raise his rent. Yeah I mean on the in a related topic, I mean what Julia was talking about before I think it was the Til program where, like the pardon or the attendant program, turned it into release programs, okay and that turning and I that was like private housing, where the landlord had essentially abandoned it. Yes, and then it turned into hdfcs, but in a related topic, I, don't know if people here have heard of the Topa bill, that's up that Senator Mairie has introduced. It's not I mean it's Topa being tenant opportunity to purchase and that's for private housing, not public, but it is something that is in this same I mean it's adjacent to what you're talking about that idea. That's if I recall that's the bill that allows if a landlord is going to sell, then they get the first right to purchase. Is that right? Yes, they're doing it with business to in New York City? That is something that just introduced too, with the business sense. If Allah Milan is getting ready to sell his business, the employees have the first option to buy okay, yeah, okay. That was just introduced like about a couple a month ago, so doing it in businesses, as Ms Callahan just said, I think we need to work for them to do it in housing, and you are right. The person who Robert is right because I think that's the way that building constant marks. That's the way that had falled under the tenants had taken it over because it has something to do with the landlord. So, yes, I wanted to bring up in the did. Anyone see the city council hearing on the tax Lien trust today, no I missed that. So it was the council. Finance Committee was mostly meeting on the budget oversight today, but they also had a bill about renewing the tax Lien trust program that Councilman Adams Councilmember Adams was she was carrying the bill, but she did so with a strong prejudice against renewing the tax Lien trust she wants to get rid of it, but the administration is has insisted that the program has to continue for logistical purposes for the future. It's a complicated situation, essentially the administration that the administration's position is that they there's nothing in place that isn't as they call it, an adequate enforcement mechanism that would keep people paying water bills and property taxes and etc, and so the removal of the tax Lien trust without anything to replace it. They aren't in favor of it and they're going to continue it, but the council, it seems like there's a strong appetite for removing a pretty Ods program, a pretty odious, Giuliani era program, so I think that there's definitely movements at the city level for abolishing the tax Lien trust. It's just gonna, take it's classic De, Blasio stuff, it's De Blasio doesn't want to continue or wants to continue doing things business as usual, because it's easier than making hard decisions. So it's going to take grassroots action, yes, Dr Lazar, so the trust I mean. Are you talking about the tax lien sale program is, and is the trust part of it? I guess is that where sorry I just don't know where yeah I'll give a brief overview, Greg and I have a lot of experience with this one. So what happens? Is that I mean so I know like the tax lien sale program like I know: I, just don't know what the trust piece of it is. Oh okay, sure, so the tax liens when the tax lien sale actually happens. What they're doing is they're selling bonds in order to give it to a private entity that creates a tax lien trust for whatever properties are delinquent for that given year. So the tax, a tax, lien trusts, say I'm making numbers up but say they say that they're going to sell 175 million dollars worth of debt for that year, and what happens is that a private company sells 75 million dollars worth of bonds and they give that money to the city. And then that's all, that's the city. Why should washes its hands of all the debt and then it's up to the company, the private company that bought the debt to collect on whatever the debt is. But so what what's actually happening here is like say that 75 million dollars that actually may have been worth: 100 million dollars worth of property, tax delinquency or water, bill delinquency, etc. But the city is giving up the right to that and instead, so that's what, when I use tax Lien trust as a as an interchangeable with tax lien sale. But it's not the same thing. It's just one step in the process. Okay, interesting! So it makes me think again about what I had just read to you, guys about the trust that they want to set up with the unit housing. I'm very curious about whether that's a model that De Blasio has created whole cloth or whether it's something that other cities have undertaken, that NYCHA is very unique in this in the nation in that we're one of the last true public housing authorities. I'm really I'd be really curious about whether this is something that he's doing, because it's considered a best practice elsewhere or whether he's just decided that this is the way that things are done in New York, because it might help us better talk in his language and come up with ways to stop him from doing what he's doing. Okay from the hearing yesterday was it yesterday yeah. It was yesterday when they had the CEO of NYCHA on, say somebody referred to him being associated with the Cambridge yeah I think Cambridge model, because I guess the CEO of NYCHA used to be in Cambridge Massachusetts and dealing with their public housing. So I'm wondering if this is some structure that he carried out in Cambridge Mass before coming here to Nysc. It might be worth looking into that Sarah. You know what the Cambridge model, what it looks like. No idea, okay, I guess! If we google it, we can find out more information. Yeah I mean when he was talking about Cambridge Massachusetts. They were like they were using it as an example. They were saying: oh look, how great this turned out for Cambridge I feel dubious about it, and you know it's so funny that people want to latch onto things that were done in other places, but is Cambridge comparable to New York city I. Just I did google it and it says the Cambridge Housing model apparently relates to energy efficiency uh-huh. What I can tell here in this quick overview, Cambridge? So not sure, but the thing that's killer about this tax lien sale is the city is losing property. That's worth far more than the liens that they're collecting, as in the case of our property in Schenectady. What is it 89, Schenectady I they collected about eight thousand dollars in delinquent taxes. The city got eight thousand dollars this. The all current owner of the property, has it on the market for 995,000. So, arguably, if the city owned it, the city would now have a property worth 995 thousand dollars. Instead, we got eight thousand dollars. Greg I need to point out that, if you've got a property where no one is living in it, I challenge you to find an insurance company, that's going to insure that property and that's what happened to the city when, back in the day when people were reporting all the bronzes burning, when people couldn't pay their water and sewer and property taxes and the city took over the property and nobody was living in the property and taking care of it became a real problem. Okay, it was a problem, but there was a problem that was sung by the time Giuliani left office. The problem was solved, but they never took away the remedy, so I mean. Let me just finish that what we're looking at is same thing with NYCHA. We have to be able to take care of the building. The roof needs not to let the rain in the heating system needs to work. The gas and the gas tools need to work. It's got to be working so who's going to do that, and I've been saying all along that these unions should be training a cohort of the residents to do licensed, building construction trades. The people who live there should be being trained to keep those facilities in habitable order. Otherwise you're just creating another problem. Go ahead. Mr cut, I'm sorry again. I work for the Independent budget office, I watch a lot of council hearings, so I know a little bit about a lot of things. The NYCHA does actually have a requirement that their work, if work is done on not your properties that there is fact a component of it where there is a train like trades and trainings that are set aside for people that are residents in the NYCHA housing that the work is being done on I, Actu I. Quite honestly, don't know the scale so I don't know if it's a nominal number of positions or if it's like a substantial number of residents are trained in that so but the program and the model exists. It's just a question of whether they are committed to continuing to use. It has to be implemented on a scale that would address the backbone of yes, but the mother exits and it's being utilized like it's a totally different thing, it's there, but it did be new to life. Not really so that's the difference. You know yeah and there there's no mandate that these private developers that are going to be taking over NYCHA on this proposal would have any kind of union representation or any tenants in the building working for this that if there was some kind of language that effect in the proposal, it might not be so bad, but there's none of that. It's just you know. The private developer does whatever he wants, hires, whoever he wants and pays them whatever. They want. That's the problem, and that might be a suggestion that we need to make, as I have heard, Ethel talk before about the need for NYCHA residents to become trained in the construction trades and the fact that they would have to have people who are already masters in those fields to supervise them and be willing to train them, and one of the things I think they came up before was the fact that if you had a contractor, who was doing that and the contractor changed for the job, are they legally bound to continue to train the young people or the NYCHA residents, as they once did? So that's not exactly clear either because sometimes because one person did something if the other person is not made to continue the obligation they don't and who's paying attention. My question is: how can the people who live in these houses we galvanize them? I think this is more lack of it. Not so much of education is lack of like their rights as residents living in those buildings. So how can it be done where they can be galvanized and I? Would I don't want to use the word educate but help them to fight and as residents of those building their rights and help them to work, to become owners of those apartments and become stakeholders, because I think when you're a stakeholder in a place, you put more interest in it and if they become stakeholders, it's a better chance of they keeping the place up the standard than just being a tenant. So I think we need to work on that point of making them more of a stakeholder than just a tenant. I agree with Ms Benjamin, it turns it seems like we are going to turn into a bunch of lobbyists for the public good and as part of our job as members of this community board. Unless we put writing and bring it to the attention of our council members and those who are now jockeying for a position to replace them in the upcoming round of elections in 21.2, we'll be right back here. In the same place, we've got to speak up, be succinct but lay out what we expect. These new people, who want to come in to use as their platform for these naughty issues that have persisted all these years- we've talked about it and talked about it now, it's time to lay it out, like Greg suggested and, like maybe Robert, can help lay out the issues put it in writing and get it in front of them. So that's the only way I could see that you're gonna get any progress going here. I want to mention the fact that when we did meet at Albany we did have a couple of meetings where a lot of the residents came to the meeting, and they spoke about the fact that, yes, there have been times when they have gone to Albany the lobby for certain things, for housing and I got the impression that these were mostly older people and that they have gotten tired, so I think it is, would be good, as princess said, to wake up. Some of this need to have a stake in what's going on among the younger people, because the older people that did travel and did go to meetings and whatnot, they basically had gotten the impression that a lot of they're just tired- it's not that they weren't doing it before and that they weren't vocal I. Guess it's like spitting in the wind, if you have one or two people out of a hundred, and only one of those two people talk, it's very easy for the folks that you supposed to be talking to just ignore you, because there's only two of you as opposed to this, should be a hundred or maybe a thousand. So that's one of the things that I've heard from them that, yes, we did go because we did have some people who came to the meetings and they were very vocal and they hadn't been just sitting there for 30 years, letting their pipes and things fall apart. In certain cases, they spent their own money to have certain things done and I think I mentioned that in the letter the draft of the letter I wrote. These are people who talk to us about the extreme backlogs for repairs, and these folks they had their security doors, don't work. The mailboxes are torn out, there's trash all over the place and what have you and, in certain instances, folks spent their own money to have repairs made. So these are not people who were just sitting there waiting for folks to do stuff when they didn't do it had to be done, they did it. Sometimes you have to sue Ms. Are you proposing that we take some action as a committee that we put on this community board, I'm proposing that we put these issues in writing as instructions to the existing representatives, City Council level, state level, federal level, the things that we need you to do now, and we need you to make it clear that these requests these demands, these proposals that we're putting on paper for you carry forward until they are realized, so that make it clear to anybody else, who's aspiring to take the place of or any of these incumbents. They need to pick that up and run with it as well. We should ask someone from the appropriate section of HUD to come in and talk to these issues appear at one of these meetings and tell us what they see from the inside and hopefully give them some recommendations that we think will go a long way towards solving these problems, and we also need to have people come in from the different night to tenant groups to lock arms with us, so that we can hear from people with a boot on the ground to tell us how we can help and put that in writing back to our elected representatives as well. Those are just some of my suggestions, but we got to speak up. Otherwise we're going to be roadkill yeah at the hearing they most of the NYCHA tenant people who were testifying. They were, you know, not only frustrated with the plan as they understood it, but also frustrated at how little outreach had been done to them to inform them of what was being planned on their behalf and also to ask them their opinion in the matter. And so I'm wondering if I mean that we're not having our meetings in the Albany houses anymore, so we would be able to more easily talk to the Ta there to see if they had ever been consulted about any of this, and would they would it make sense to I mean? Would it make sense to like co-write the letter or the statement along with tenant associations at the various campuses in our area, or should we just talk to them and then mention what they say in the letter from the community? Board? Yes, Miss Iceland I just have a quick question, also responding to Sarah and Ms Tyus and Robert Callahan. Has there been much press about this I mean? Has this been written about? It seems to be such a major change and I'm not the most current person in the world, but I haven't seen very much about this at all in the local press or the papers. It seems like something that would be should be really being brought to people's attention. So if we can help, if we can help do, that would be great in whatever way, maybe by galvanizing. The tenants union- and you know the housing organizations together and trying our meeting to bring more. You know the big meeting the community board meeting to bring more attention to this. Just it just seems like something that should be really on people's radar and I might be wrong. I mean I may be living in a in an odd bubble, but it doesn't seem like it's getting much attention. Are you speaking specifically about the Nike proposal? Yeah? Yes, I! Am it's definitely the first time here of it as well. Tonight it's really like a major change with really very serious consequences, not to be getting more attention, and what is the this? You know the mayor's office doing to bring this to the fore so that people know what's going on well. I think I know the answer to that, but I I'm trying to remain neutral so well. I've gotten the impression that for them to even mention this so-called announce it in July, they really didn't expect anybody to even realize what was going on and basically at the last minute. Possibly the people in NYCHA found out about it. The ones who were there to speak, but you get the impression that when certain groups decide that they're going to make changes, that's going to affect a lot of people, they purposely downplay it and don't give it any press, because when you oppress people to a certain extent it is a form of abuse and abuse is very easily done when nobody knows that, it's being done, so it's purposely kept under the radar and purposely not spoken about, because it's something like the NYCHA people are totally mystified and I'll say this to you years ago, when the public housing in this city was planned, it was planned in areas that nobody else wanted to live in. Now that real estate is so prime. Most of the public housing is now considered, prime waterfront property. So now everybody is looking at it in a whole different light, but before it was basically places where most people would say, no I don't want to live there. That type of thing so I agree with you that there has been limited press, and that has been intentional and with all the people who live in public housing. In this city- and they have to be I- would say more than a hundred thousand with all the different developments we have as far as I know, I, don't think they even have any type of a newsletter or newspaper or anything like that where one group communicates with the other group. So when you have people who are disjointed- and they don't know in one part of Brooklyn, what's going on in Manhattan or even another part of Brooklyn, it works in the interest of the people who want to divide and do what they want to do so. You're, absolutely right. So it seems like this year after we gonna have a whole lot of writing to do and I hear her. I see her looking, but I don't know if she actually heard what I said. I heard you when I agree with you, I was looking for the Knights Attendance Association webpage. There is a web page out there that lists all of the Niger houses throughout New York City, with their tenant association, contact, information, okay, yeah, so I think that if we're going to lock arms with our neighbors- and it's do like the Crown Heights Tenants Union does and go out in a group, they say you know, there's strength in numbers so that if we join doing with them as a quasi-governmental agency, a governmental agency, community board I think we'll get a lot more traction and we'll learn how to play. The media, like Kathy Island, is suggesting I know with a ongoing issue near where I live on sterling place between New York and North Street, where a giant housing development is being planned for a sterling place between New York and Brooklyn avenues. When the neighbors came together and started to play the media and got 5000 signatures, we got the attention of the LPC to work against such a poorly conceived project. A sterling plays 951 smaller places. So it's the same kind of thing here: the more attention, the more light you shed on the problem, the better it will be for the people who are going to be negatively affected by it, because more thought will be put into the proposal, even if we don't win in the end. The light we shed on the proposal as it stands now will undoubtedly make for some improvements. I'm positive well after I said it before and I'll say it again. All you hear about in our city is how we not taking care of our homeless, but if we let NYCHA go to the point where people don't have a right to the apartments to the point where private developers take over, can you imagine what the city would look like as far as homeless people concerned? We would never walk out of our door without having to step over somebody and where all these people going well, everybody keep it right. Oh and I mean on top of that just Covid-19 yeah that too, so you could be back to mass graves. It's a problem where you really can't say not in my backyard cause. Can you actually name an area for me in this city that doesn't have public housing somewhere? So it's everybody's problem? We may not all live there, but it will be everybody's problem if folks don't have somewhere to live, and it's not about them. Saying oh we're going to put up such and such a development. We got a lot of flack when we had that joint meeting with HPD about those two sites, because a lot of you all said, especially people who are new to the community board, see some of us have gotten kind of used to the way the city slowly does things in a way they don't make sense when they do stuff. But these new folks are like a breath of fresh air. They came in and said. How are you proposing to do this when you haven't even done the proper analysis? Where's the public analysis to show us that this is what needs to be done and I want you to know. I heard you when you said that, so it's something that we can all work on, because it's going to affect everybody who wants to step over somebody? That's homeless every time you step out your door and we already have a problem with housing. The people who are already in the street so is it can be a very serious problem and these folks, who even to Rikers the prison that we have I, understand that some people are of the opinion that that's a land grab and now that they've decided that they're not going to have the prisoners there anymore. Now they say: oh there's, a problem with the soil that the prison was built on, but didn't they know that 30 years ago, but the long Island college hospital that we don't have anymore. That was another example of a land grab. So if we don't pay attention- and we don't publicize it- and we don't put it in such a way that people will realize that it's everybody's problem, it will quietly continue the next thing. We know they'll be announcing this new trust. Yes, Mr Callahan all right. This may be a question for Dr Lazar or for you do we have any sense for what the timeline is for the blueprint for change. Is there any anything that we know about when it's, if it's an inability, when it's proposed, when it's going to come the existence I? Could that could light a fire under what any action and what kind of action you want? We don't know definitely, but if they announced it in July and they figured that they would easily be swept under the rug. Now that way at the end of the year, regardless of Covid-19, then I wouldn't give it too much more time. I think that the schedule might be in the January 2019 agreement governing the convergence I put a link to that agreement in the chat a little bit. So you might want to take a look at that and then that may give us an update on where the process is. Okay, take a look at that Adam because last week he was able to monitor chat for me, it's kind of hard to host a meeting and then monitor the chat as well. I know, I, think you miss him. I think also that the state budget timeline might be a factor in all of this in this decision-making, because I mean, of course, we all know that Cuomo very much likes. He he's not exactly the most generous budget guy and you know not to get overly well anyway and already in the earlier part of this year. He was I mean there were cuts everywhere, including the hospital. So I'm imagining that as and you know, and also they've been waiting to take action on a lot of different things until everybody was waiting to see what is the federal government going to give us in terms of Covid-19 relief and they're still waiting on DC to do things so I feel like this particular state budget season is going to be especially tendencies and, of course, if there's anything that has to do with taking the headache of funding NYCHA off of our taking it out of our mind for a while I imagine that this is going to be yeah, and so that would get settled up at the beginning of April. So yeah I mean moving quickly in order to let our electeds know how we feel about. This is probably wise. Yes, I agree, yes, Mr Callahan, the just a point of verification Pius. The document that you shared is the agreement for the federal monitor that took over NYCHA in 2019. So that's a little bit different. The federal monitor was because of habitual mismanagement of NYCHA, and it's so it's probably related, but it's not exactly related to the blue. Okay, I think we're looking for the schedule, I'm hoping that the schedule for the monitor would be monitoring is in there, okay, so you're hoping for a degree of transparency. Okay, you need to know what's going on so in comparison, I'm going to share a link to the page for the blueprint for change which I apologize, if that's already been done, but the, but it appears that a component of this public comment box for the 28th of 2020. Yes, we might have to move rather quickly. If we wanted to say something on the record about this, and doesn't it also say something about. We could also put comments in social media Mr. Callahan, would you be willing to draft a letter? I can take a crack at it. I don't I, whatever material you have would be valuable because I'm happy to put it synthesize it, but obviously, as this is the first time hearing of this there's parts of this I'm going to be suited for parts, I'm not going to be okay, a little arm weight. We never scared anybody. Thank you. I guess, princess has gone, I, don't see her. Did anyone else have any comments they wanted to make about this, because I'm missing the fact that we don't have the in-person meetings that we once did because there were a couple of times. We could actually feed our issues to reporters who would come to the meeting, but I'm not even sure that those publications are still in existence. Has anybody heard of the patch Sarah? Does that sound familiar to you? There's I think it's it'd be worth putting that on our radar at least to start. Okay, there's I've been in contact with a reporter at the city, who's been doing a lot of good articles about tenant issues recently, and you know I think they did a story about the tax lien sale. They have done stories about eviction, blockades, stoop court, all sorts of good stuff, so I could def. You know whatever letter the community board comes up with I could give it to her and yeah. There are some other publications that I could also send it to I mean. Would that be the right way to go about it to send them the letter once it's already drafted, absolutely I agree with you Mr Granville. What do you think? That's a good idea and I'm also thinking about all-time press as you're speaking well, I. Think from my experience with these online newsletters. What we would produce for letterhead and whatnot would be too big to paste into their comments. Okay, so we we'd have to use a succinct, pointed snippets and say who we are and speaking for, the housing advocacy committee for Brooklyn community board eight and we will be and also copy, the elected representatives we gotta get to the decisions, because, at the end of the day, they're the ones who will call the shots on whether or not this stuff happens. We need them to understand that they're going down the wrong path and to do a make a lifter or a right turn or an about face and get headed in the right direction. That's what I think that's my opinion. Yes, Ms Iceland again, I, don't know what the timeline is, but one thing that would also be not a bad idea is getting some read from the you know this: the candidates for City Council, on where what they're thinking is about this I mean I, think we should be the North Prospect Heist Association is organizing that kind of forum for the particular issue that we're dealing with HPD but I think it's a very good forum. A way of these are people who are going to be running for council and they're. They've got pretty full-fledged campaigns, as you know, on the run, and we should be saying what's your position on this is a big deal, so I think we could also make sure to be reaching out to potential candidates for city, Council and I. Think that's a very good idea. Thank you, Kathy. As we were saying earlier, we need to tell them what we need and make sure they include it in their platform. So you need to include this in your platform. If you expect most of people who live around here and I, think I just saw a note from Sarah, where she also mentioned that this would be something good to also put to the candidates who are running for mayor of the city. I'm smiling because I was taught years ago that community board members are supposed to be the eyes and ears for the elected officials, and apparently we have had a mayor who did not believe that at all, when people pulled his coattail about certain things that went on in the city, nursing homes that were changed over and sold and then raised to the ground and stuff like that. He listened to that. But some of us were taught differently. So I think that's a very good idea. Sarah and I think some of these folks who are sitting in the churches too. I, don't know the ministers of our churches may not necessarily live in this city, but their congregants do and I think. Sometimes it is I find it a little strange sometimes that we've met in churches, but when it comes to actually the churches actually having members who are even attendees of the community board, it can be a little strange if we have some large churches in our neighborhood. We don't have the one in East New York. We don't have one that large, but we do have some pretty good congregations in number in the immediate area, and sometimes it baffles me unless we have a community board member that belongs to one or two of the churches. You get the impression that a lot of the people who are in the churches who live in the neighborhood, don't really know. What's going on and the people who informed the neighborhood about the Hebron school project, they did a terrific job, because I had a neighbor who never comes out to a meeting, and she told me she knew about it, because somebody approached her in the grocery store and told her about it and gave her a flyer. So that's the type of outreach that you need, because the precinct council people are home owners, but most of them don't come out to the community board. If they're not coming out, they probably don't dial in either. So it needs to be a broad outreach of people because, like I said eventually, this will affect everybody. Okay, I, just I will say that I'm looking at the blueprint for change now, it's a pretty substantial document to provide comment on, and so some focus on what we would like to focus on, whether it be the funding structure. The central premise of it like would be helpful because it's I mean it's a you know it's a nine chapter endeavor, because it's a public report, I'm happy to read it. It's gonna take some time. Okay, thank you! Mr Callahan I want to Greg. You got any suggestions, I'm sorry who who's the chair of the housing committee. Do we know a witch housing committee, the City Council, the council, yeah Carnegie. He is the chair of it. Now. Yes, he is well that's a no-brainer housing and buildings. Okay, all right bam. So if we can't get his in here, but there's hope, Greg and I say this, because recently certain laws that were passed like enacting, astringent strength, changes with the sprinkler law and stuff. The brownstoners are not going to. Let him sit down and not do anything. Well. I was saying to the fire. If you noticed at the hearing about the Lebron school, he was the first one to testify and he came out against the proposed building, which I was so excited about right. So maybe there is hope, well I, think every now and then it's helpful when you remind people who they were elected to represent- and I've said this before a lot of people say to me: we never see Carnegie. He never comes blah. This was before the pandemic. If he is talking about or he's dealing with a subject of interest to all homeowners, not just the people that live in Bedford Stuyvesant, but everybody that lives in Brooklyn or just part of central Brooklyn. If he realizes that among the audience of maybe 40 people at least 10 of those people from community board aid. That would remind him yeah I represent them too. But if everybody says okay, we don't see him and we wait for him to show up what is it they used to say about a mouth not being fed closed. Mouth doesn't get fed. Okay, I want you all to realize that as part of the land, Use Committee, I've added our elected reps to the Google group and they're working representatives. So when we're sharing stuff on the Google groups, our electeds are getting that information and it to me it's a technique to engage them. So that's land use. We've got our council member and their next their direct report, not their different, but their immediate, subordinate foreign, along with our assembly member, our state senator our Congress member. No, we don't have them. They don't give up their email address, but we have to. We have the local people, the state and local people in our Google group, and they got a novel this week they got quite a novel to read this week, then the back and forth between Buckholtz and Bocconi is informative and it helps to bring ideas together. That can help us all as a group. So once we start to gel we're going to be formidable absolutely formidable. A regular juggernaut, not a regular, just a juggernaut, because all of us together can make us safe now, I, don't know how you all think, but I have tried to tell people, especially new board members, that as far as I'm concerned, housing is never boring and land use is never boring and I. Remember before we split the two. We just called it housing, but it got to be more land use because we have three LPC historic districts at this point. But my what I want to say is that if you are new, if you attend any meeting, especially one of my meetings and you don't come away with something that you didn't know when you came when you sat down, please let me know, because I think it's very important, that you learn something that you didn't learn before, that you possibly make a contact that you didn't make before, because if not then I don't want you to feel like you wasted your time, because everybody has other things to do and as far as I'm concerned community board the most democratic form of government that we have. It doesn't matter what your language is, it doesn't matter where you come from. It doesn't matter whether or not you have multiple degrees. None of that you have just as much right to have us say as anybody else so anytime. You attend something, and you see me sitting there and you're not getting anything out of it. Please let me know because it's been keeping me busy and enthused and what have you for the last I'd say: 20 years, it's never boring because there's always something to learn always, and we have elected officials that need to be schooled and the community board. People are the folks that need to do it. So you can't be bored because there's a whole lot to do. Ethel did you want to add anything to that chair? You were quite clear. Thank you. I, look at the board as an extended family, so you have to excuse my enthusiasm when I start talking about the boards. I people say oh she's, on her soapbox again, but even though we having a pandemic, please realize that community boards have no budget for promotion. So if we don't talk up our group and we don't make people interested and we don't explain to them what it is that we do, they will not know because you're not gonna, see an advertisement on TV between shows telling you about the community board you're, just not gonna see it. So we are our own best advertisement. Now. What I'd like to know is if anyone has anything else that they want to bring forward that they haven't already discussed. Also, don't we have a meeting coming up next week with a combined meeting on the 17th. It is the show-and-tell from department of city planning on population and economics for M Crown and I'm trying to get to my calendar now. So you guys probably want to attend that everybody understand that is this: coming Monday the 14th at six o'clock correct for 14. and then the HPD report back for 15,561, Bergen and 542 dean is on Thursday, the 17th at 6:15 or so, and we've asked them to let us host that. So we keep a record and I have to say for both of those meetings, I'm getting intonations from both DCP and HPD that they don't want to be bombed with accusations and being cursed at God knows what else during the first round of discussions that were had on the proposed projects for Dean and Bergen because they asked them, did they really feel like they were being assaulted? I've been asked to manage those two meetings in a way that they're protected, that the presenters are protected. Yeah, I'm sorry, why should they be protected from the public Ethel that that's a really I'm in a way, I'm exaggerating. But what would happen is that you'll get a chat, that's filled with people yelling. In a way you attended one of those first meetings right Kathy, you saw what was going on. I've attended almost all of the meetings, if not all, of the meetings- and the only thing I can say is: yes, there's a very active and robust chat, but partly because of the way the project's been introduced to the community, I mean they're, getting they're reaping what they're sewing so I, don't feel too sorry for them and I'm not sure the community board represents the residence of the community and advocates for the residents of the community. So I'm not sure the role and pardon me and with all due respect as Gibb likes to say his favorite saying all due respect. The job of the community board is to represent the community and not to protect the city agencies coming to our to coming to our community and with a proposal. That's you know, being fast-tracked and just thrown on the table. So, yes, they have kind of listened, but anyhow I. I've said my piece I think they're in shock, because they're so used to those of us who are used to them not really giving them the business for the stuff that they're putting out there. Okay, I just don't want it to turn into a shouting match with one or two people call names and make assertions that don't allow any kind of informative exchange between the audience and the speaker. Okay, that's what I'm trying to avoid. Kathy and I see your hand also Robert, all right, so we're going to try to keep it organized and I recognize that HPD said they were had met with the community when the community board had not had any meeting with them, nor had North Prospect County's Forehead Prospect Heights Neighborhood Development Council, so they put a lie out there and that's what raised everybody's hire at that first meeting? Okay, so now we want to control it and act like adults, we're not going to sit in the audience and yell at the speaker liar or any of that kind of stuff we want to have. We want to have an informative civil exchange, just to be clear. I just want to add one thing and I understand that there are others. You want to speak, but I think also part of what's been happening in the chat. The conversation is not people speak. People attacking HPD or DCP, but there are some people who don't live in our in the neighborhood or in the community board, who are participating, who have who are bringing a different view. I think, there's more there's a lot of controversy between people in the chat, that's not necessarily directed at HPD and I. Think that could be. That needs to be watched as well, but there's some nastiness going on in that part of the chat as well. Okay, good point, Sarah I mean I was in I. Think I was in both of the meetings that were had and I. Don't remember, name-calling exactly, but I do remember, being very frustrated in the first meeting about this, because the way that they had set it up was that people had to. If people wanted to ask a question, they had to type it into the chat, but the person who was reading questions they weren't going in the order that they were posed and they weren't actually taking all of the questions. So, just as a participant, it kind of felt what made it so stressful was the fact that, like you, don't know, if you're actually going to be given a chance to participate effectively and if your question is going to get answered. Even when you follow the rules and I. Think if there's anything that can be done in order to not exactly to I, feel like people will be more respectful in their participation, if they're sure that they're going to get a chance to say what they want to say either. If it's, you know having an order in which people get to ask their questions out loud or if it were possible to make sure that every question is asked in the order that it came in, because I think people start getting heated when they're running into structural problems with the whole format. And then it changes their attitude in the way that they're communicating with their thinking. Well, yes, Mr, Callahan, I, think adding to Dr Lazar's point I, think that the a component of it that I, really think would make for a better process, is to have a Ma a time. Keeper, because the thing that frustrated me with the last hearing with HPD was that there seemed to be, as you said, miss Tyus people who dominated the conversation and I think it was just long-winded. People, weren't, interrupted and told to wrap up and what would be really great it, especially it's very it's I, think that to as Dr Lazarus said that the problem is people feeling like they're, not that the rules aren't being followed. So what I would potentially propose is that it's saying at the top, like perhaps it's a three-minute five-minute comment limit and to have that be honored in such a way that someone is actually in charge of announcing that the five minutes have expired, so that as many people as possible can be allowed to comment, and it's not just whoever comes in first and then everyone gets tired by the time that it's their time to talk so, okay. That is a wonderful suggestion, and just so everybody knows for Dcp's presentation on Monday we're being asked to group the chat, questions or have a local association submit their questions in advance. This will be for Monday and then there's another DCP community outreach in one m crown later on in December, I think it's December 22nd it's very difficult to get things up on the meeting calendar or the board website and within seven days in advance. So that is there Mr Calvahan's suggestion for a time limit for Monday's, community outreach or income. I would think three minutes would be good and they did ask to be protected by grouping the questions that come into the chat. Have someone monitor the chat, so that will be the issue that both Mr Callahan and Laszlo have complained about where the feedback from the presenter seems disjointed, because the response is coming at a time delay because all of those duplicate duplicative questions have been grouped and it would seem like the question is being partially ignored. So I'm open to suggestions on how to better structure that so people feel that they are truly being heard. Miss Iceland. Can you just repeat so the questions that we that to be submitted for the meeting on Monday and then the subsequent meeting later in December for DCP? They want those grouped by neighborhood Association and, if they're so there will, there won't be apply content. Subject my content subject, so whoever the facilitator is gonna have to work to do that. Okay, thank you for clarifying whoever's monitoring. The chat will be just like the woman who did it the first time hpv had their thing is to try to gather the questions that are coming into the chat and group them by subject matter and go on so that'll. That will create a kind of delay where the questioner may feel that they're being ignored, but it would be easier to get the questions in advance of the meeting and have them pre-grouped yeah. Yes, I did mention that too. So, whatever we can get, this outreach has been a little delayed, but it's a preface to the second one for December, and so if the neighborhood associations want to send questions in advance, it is on the calendar. Now that would be a good thing and we can go on from there and the presenter is coming to the community board. So we sorry we will have the transcript available to us. The recording available to us and the other details on the call rather than having the presenter post the call, so any other suggestions on how to improve this exchange is welcome after I have a question now you mentioned the 14. If you mentioned the 17th, is there anything else that we need to know? As far as our meeting is concerned for the rest of the month, I think you didn't ask me that before you have a birthday coming up, don't you yes, I do in a holiday I! Don't blame you! As far as I know, everything that we've got is up on the calendar. I'd have to ask Miss Neil to confirm and I'll check my stuff too, but schedule meetings on the calendar, all meetings that the district office knows about that we are responsible for creating the meeting or the event for they're already on the calendar. Okay, thank you doesn't have a meeting coming up because you all used to remember right. Yes, the 15th they're trying to get they're not doing a mailing now, because the time has gotten away so they're going to be sending out an email and making phone calls which I hope people don't plug into no more robo accidentally or on purpose which I'll see. Okay, what day is the 15th of Wednesday? It's always the third Wednesday every other month. That's what I thought? Okay, so that's Crown, Heights, North! Okay, yes, for those of you, who've, never attended! You may want to give it a look for the first 10 minutes, or so you can see get a flavor for the meeting. When do you all make your decision about the decorating contest? The fly I have the flyer on my machine. I'm going to circulate I got it today. They had to make some graphical corrections: okay, because the lights that they were instrumental in putting up last year I think they added a lot to nostalgia. They were very nice excellent, so I just basically wanted to know because I like to know ahead of time when certain things are going on, so that you can plan your schedule so that if you want to participate, you can so that's the only reason why I asked that question yes, ma'am. Does anyone have anything else they wanted to bring up Sarah. Do you have anything coming up that we need to know about well. I just had a question about the meeting on the 17th. Is that going to be HPD and DCP or just HPD I believe it'll just be HPD? Dcp will be in the background, because when we're not around you're talking to each other, because I was just thinking of these previous meetings and the thing that everybody had wanted to know was: what's the proposed zoning envelope right, how many lots and I just don't know if we ever got an answer about that? No, we there's no answer and they continued HPD continues to say they will not talk zoning until after the RFP goes out, it's the most backwards. Anyhow, no there's the only part that goes in front of that. Thank you very much. Miss Titus. Well, now, listen I'll use a different word: it's asinine okay, but they do intend to say to the potential respondents to the RFP. You come up with the zoning. So for me that approach by HPD and sometimes the approach that LPC uses to win buildings in historic districts is a waste of money for the applicant okay. They could tell the applicant ahead of time what the limitations are. So the applicant can more appropriately target their effort, and so the community understands what the parameters of the projects are as well again. I think we should prepare that it's community board who needs to be advocating for the community, and so you know as well as the developer. The community needs to know what what's being planned. Uh-Huh I'm telling you all have been a breath of fresh air because sometimes folks get too used to each other to the point where the things that they do have become so ordinary. You have a tendency, sometimes not to question it. I think what we need to start doing now, holding our elected official, accountable and I think now our vote and we need to put them on alert. This is what we expect of you and if you don't fulfill, you don't have to worry, because you're going to be a one-term whatever and I think we need. No. We seriously need to do that because they become so comfortable in the position. They only show up when the one vote and they sell us a bag of bull and we all sit up and inhale those fumes that they're selling us. So we need to say: okay, you want our vote. This is what we are putting you an alert and guess what, if you don't work for us, we don't have a problem with that you're going to be a one-term and we need to really bring it home to them because they are really selling us. They are pulling the rock from us little by little and we are not holding them accountable and I. Think it's about time. We bring it home to them as a community, say, guess what you want. Our votes. I know you can't put it in writing, but somehow we have to hold them accountable and we need you know. We need to start doing that because I listen, I. You know what I follow a lot of these elected officials and they come into one neighborhood and I've gone to meetings to hear a lot of them. Speak and I sit in the background and I listen how they speak in this neighborhood and when they go to that. Neighborhood I hear the song bite and when they go to this neighborhood this song by change and a few of them have called them on it, and I'm not gonna call no names and I. Think that's where we need to follow them and hear how this song might change as they go into different neighborhoods and how they address different neighborhoods. And then you would see the fume that they're selling us in all these different neighborhoods as they go. They tailor their speech to sue that neighborhood they're, giving the spirit to suit that congregation and the church said somebody said, and we say amen, so we need to follow them as they go because I follow a few of them. So I know what I'm talking about and I've called them out and they speeched and I think that's what we need to do. Okay and I think if we do that I think we would see a lot of changes because they would realize you know what, but eight people who live in this community mean business in a way that you know what I need a votes and if I want their votes, because other communities hold his elected official fee to the fire. You're gonna get our vote, but they always put a conjunction in. So we need to do the same, put a condition on them. Getting our support yeah, not only a condition. We're gonna put that conjunction, there's a, but is a conjunction that joined to so we're gonna. Put that back in. So you keep it at the back of your mind that butt is right there, because it's gonna come back to bite you in the real. But if you don't do the right thing, you know yeah, don't realize that Miss James might be our most outspoken boy person. She says exactly what's on her mind and I love her because she's like this all the time. No but I follow a lot of them in their meetings. I follow a lot of them. That's what I tell them. I said. Don't come to ask me to get no signature for you, because at the end of it my community does not get justice. So don't ask me to walk the pavement to get no signature for you, because I'm not gonna do it, because our community does not get adjusted when you get elected so I, don't do it for them, but we have to the thing about it. We have a homeless, shelter. Remember when that shelter was being addressed under this game, it was to be a community center. It was to be all these wonderful things that far flat on his face. Nobody can speak on it so far when combo got elected, she was going to do now. She focused on the one and board nine that was sold from on the board nine. That is all something else. So we are not holding people comfortable, I, hope we can start doing that and to bring the changes we need to see in our community. Okay, so are there any other remarks? Princess I know that you will remind me if I fail to do that. No, you know we have like okay, let's start looking I know a few of the committees that Carnegie sits on we go up to I was on his side following him Mary. We know a few of what my research on I know right now we losing Montgomery because she's on she's stepping down you know we need to start with our district leaders because we have new district leaders. So we need to bring all these people who we have put there these new blood we need to get all of them in one place and bring them to the table: who's replacing Montgomery, Jabari, Brisport yeah. Oh excuse me yeah, okay and the funny thing about it. Half of these young people who are going to Albany they're, not sitting at the table with the people who are going out because so far the person who's replacing Montgomery haven't stopped, haven't come to the table to and speak to her yet so they're going into Albany with their own agenda and most of the times when they get to they're so busy trying to hold on to their position, because I'm going to say something and I think Miss Granville remember recently when they had the Nostrand Avenue support them. They had an elected official there and I approached them and I asked a question, and this was what that was said to me. Or there are things we can not say when we get to Albany only you guys can say it so think about that. They're coming to us, they're asking us for our votes, promising they're going to do all these things, but then it Albany is played to pay. You have to pay and that's what's happening and we are being traded left and right and in the process they're being paid very well. Oh, yes, they are fair to play because half of them know when they get to Albany half of the things they promise certain community they can't deliver, but then they will still come back and tell you all these things they're going to do when very well know they can't do it and I was told that- and you didn't have a politician, because you were part of that group. Miss Granville I mean I. Think the thing that's changed is we've actually gotten. Some comments kicked out with this. New surge of socialist candidates coming in I mean historically most of these guys once they get in they're like in for five and six terms forever, so you can yell and scream, but when push comes to shove they know they're going to be a slam dunk next time around so they're like nodding. Yes, you to death and that's no longer the case. Let me interrupt you for a minute. I think was it you Sarah? That said something about you. Having to go to another meeting, oh yeah I do have another meeting. Okay, sorry, so we as a group still continue to talk, but if you need to go to another meeting, excuse me: is there anything more pressing to discuss? This meeting has been going on for an hour and 45 minutes. I've worked late every day this week so far and still have the board meeting tomorrow. I would really like to eat dinner. If you guys have no actionable items well, thank you for letting us know, because I saw that. Can we wrap this up, but I didn't realize that was coming from you. So I'm sorry about that. So, yes, we can wrap it up. Sorry, Julian! Thank you! Not a problem have a good night. Everyone all right good night.",
            "summary": "Okay, So now, I know that there was a letter that was going out regarding the privatization of NYCHA through a section changing it from section nine to section eight, which would allow for eventual privatization, I'm, hoping that someone can bring me up to date on that anybody care to speak to that issue.\nI think that the comment period for the hearing on transferring NYCHA from section nine section, eight is still open, I'm, not sure I, hope Ms Granville will be able to confirm Lomas Granville back to you, okay.\nAnyone wanted to comment on that letter that went out, I'm, not sure if it was shared to the committee, The housing advocacy committee on the transfer of NYCHA from section 9 to section 8.\nYes, All right, I get to mention that to you, because the state people had their from what I understand they had a hearing at 5:30 yesterday and the one for the City Council Committee was held at 11 in the morning.\nIf, like, for example, is City Council going to get to actually vote on this, or is this just something where we want them to express an opinion one way or the other, but I figure.\nIf you're going to use the dilapidated condition of the buildings to try to qualify for section 8 in order to finance the bond issues that you're going to need, It makes me wonder if there was a plan all along to let things just fall apart and then propose this, because you know the city has a way of letting things go when they really don't want to be bothered, and then, at the last minute.\nAnd I want to let my committee know that I'm going to write, but if you feel compelled to write something to put your feelings on paper, please do so as well, because I'm sure they had a lot of people who knew before we did that the hearing was going to take place.\nAnd I wouldn't want these folks to think that, Oh, they netted Albany houses, but they were impressed how things were because we were not Sarah.\nOkay, I will tell you what I have, which is based on I, think what you probably have sent Ethel and Elsa sent it to me and what I'm going to try to do when we finish is send a copy around to make sure everybody gets one so that you'll see it.\nNycha has told us that this is like the school construction authority, but, Unlike to see the SCA, there is no option to approach City Council for money if private investment fails or the trust is unable to make a debt payment.\nIt's exactly what's wrong with this whole private public partnership quote-unquote, because we have no control at all over the wages the workers are making it just left up to the marketplace, and this is you know why this is such a bad.\nIt's nice to see Weeksville garden, getting completely made over God. But when this day is done, all the money ends up outside the city, the real money you know, and so this is the model, that's happening with the tax lien sale, exactly where these private developers are buying up these tax, foreclosed properties and a fraction of their value, The city's getting no money.\nAll the money's flowing out of the city into these wealthy people's pockets, it's upside down and backwards, and you know it needs to stop I.\nSo a lot of the things that we are seeing right now when it comes to public housing, it was in the works long before Bill Blazer take over, because Bloomberg had sold a lot of city buildings and in privatizing a lot of public housing.\nIt, into a co-op, because a lot of people in public housing are paying rent, And I, think that is something we need to work.\nIt wasn't that, like a program way back in the 60s and 70s, which is how New York City Housing.\nActually nationwide public housing became the derelict thing that it is right now, like didn't.\nBecause things change in New, York City, The next thing they're gonna go after is these big public housing and a lot there would be more displacement.\nWe need to get on board and meet with the people who live in public housing and see how we can help them to become homeowners and to become owners of these apartments, because some of them have been living there for years and people is under the impression because you live in public housing, you don't pay rent, and that is not true.\nI. Something people need to get away from because you live in public housing.\nSome people are educated because I know somebody who had two masters that were living in public housing.\nSo doing it in businesses, as Ms Callahan, just said, I think we need to work for them to do it in housing, and you are right.\nI think that there's definitely movements at the city level for abolishing the tax, Lien, trust, Classic, De, Blasio, stuff, It's, De Blasio doesn't want to continue or wants to continue doing things business as usual, because it's easier than making hard decisions.\nSo the tax, a tax, lien trusts, say I'm making numbers up but say they say that they're going to sell 175 million dollars worth of debt for that year, And what happens is that a private company sells 75 million dollars worth of bonds and they give that money to the city.\nIt makes me think again about what I had just read, to you, guys about the trust that they want to set up with the unit housing.\nI think Cambridge model, because I guess the CEO of NYCHA used to be in Cambridge Massachusetts and dealing with their public housing.\nYou know it's so funny that people want to latch onto things that were done in other places, but is Cambridge comparable to New York city I.\nOne of the things I think they came up before was the fact that if you had a contractor, who was doing that and the contractor changed for the job, are they legally bound to continue to train the young people or the NYCHA residents, as they once did.\nWould I don't want to use the word educate but help them to fight and as residents of those building their rights and help them to work, to become owners of those apartments and become stakeholders, because I think when you're a stakeholder in a place, you put more interest in it and if they become stakeholders, it's a better chance of they keeping the place up the standard than just being a tenant.\nI agree with Ms Benjamin, It turns it seems like we are going to turn into a bunch of lobbyists for the public good and as part of our job as members of this community board.\nI want to mention the fact that when we did meet at Albany we did have a couple of meetings where a lot of the residents came to the meeting, and they spoke about the fact that, yes, there have been times when they have gone to Albany the lobby for certain things, for housing.\nWe should ask someone from the appropriate section of HUD to come in and talk to these issues appear at one of these meetings and tell us what they see from the inside and hopefully give them some recommendations that we think will go a long way towards solving these problems, and we also need to have people come in from the different night to tenant groups to lock arms with us, so that we can hear from people with a boot on the ground to tell us how we can help and put that in writing.\nYou know the housing organizations together and trying our meeting to bring more.\nThe ones who were there to speak, But you get the impression that when certain groups decide that they're going to make changes, that's going to affect a lot of people, they purposely downplay it and don't give it any press, because when you oppress people to a certain extent it is a form of abuse and abuse is very easily done when nobody knows that, it's being done, So it's purposely kept under the radar and purposely not spoken about, because it's something like the NYCHA people are totally mystified.\nAnd I'll say this to you years ago, when the public housing in this city was planned, it was planned in areas that nobody else wanted to live.\nSo I agree with you that there has been limited press, and that has been intentional and with all the people who live in public housing, Would say more than a hundred thousand, with all the different developments we have as far as I know, I, don't think they even have any type of a newsletter or newspaper or anything like that where one group communicates.\nThe media, like Kathy Island, is suggesting I know with a ongoing issue near where I live on sterling place between New York and North Street, where a giant housing development is being planned for a sterling place between New York and Brooklyn avenues.\nAll you hear about in our city is how we not taking care of our homeless, But if we let NYCHA go to the point where people don't have a right to the apartments to the point where private developers take over, can you imagine what the city would look like as far as homeless people concerned.\nWe got a lot of flack when we had that joint meeting with HPD about those two sites, because a lot of you all said, especially people who are new to the community board, see some of us have gotten kind of used to the way the city slowly does things in a way they don't make sense when they do stuff.\nAnd you know, and also they've, been waiting to take action on a lot of different things until everybody was waiting to see what is the federal government going to give us in terms of Covid-19 relief.\nOkay, So we we'd have to use a succinct, pointed snippets and say who we are and speaking for, the housing advocacy committee for Brooklyn community board, eight.\nYou know: this: the candidates for City Council, on where what they're thinking is about this.\nAnd apparently we have had a mayor who did not believe that at all, when people pulled his coattail about certain things that went on in the city, nursing homes that were changed over and sold and then raised to the ground and stuff like that, So I, think that's a very good idea.\nYou get the impression that a lot of the people who are in the churches who live in the neighborhood, don't really know.\nWhat's going on and the people who informed the neighborhood about the Hebron school project, They did a terrific job, because I had a neighbor who never comes out to a meeting, and she told me she knew about it, because somebody approached her in the grocery store and told her about it and gave her a flyer.\nThat's the type of outreach that you need, because the precinct council people are home owners, but most of them don't come out to the community board.\nWe know a witch housing committee, the City Council, the council, yeah Carnegie.\nOkay, I want you all to realize that, as part of the land, Use Committee, I've added our elected reps to the Google group and they're working representatives.\nI, don't know how you all think, but I have tried to tell people, especially new board, members, that as far as I'm concerned, housing is never boring and land use is never boring.\nAnd, you don't come away with something that you didn't know when you came when you sat down, please let me know, because I think it's very important, that you learn something that you didn't learn before, that you possibly make a contact that you didn't make before, because if not, then I don't want you to feel like you wasted your time, because everybody has other things to do and as far as I'm concerned community board the most democratic form of government that we have.\nI'm getting intonations from both DCP and HPD, that they don't want to be bombed with accusations and being cursed at God. Knows what else during the first round of discussions that were had on the proposed projects for Dean and Bergen, because they asked them, did they really feel like they were.\nKathy and I see your hand also Robert, all right, so we're going to try to keep it organized and I recognize that HPD said they were had met with the community when the community board had not had any meeting with them, nor had North Prospect County's Forehead Prospect Heights Neighborhood Development Council, so they put a lie out, there.\nIf there's anything that can be done in order to not exactly to I, feel like people will be more respectful in their participation, if they're sure that they're going to get a chance to say what they want to say, either.\nDcp will be in the background, because when we're not around you're talking to each other, because I was just thinking of these previous meetings and the thing that everybody had wanted to know.\nI think we should prepare that it's community board who needs to be advocating for the community, and so you know, as well as the developer.\nThink if we do that I think we would see a lot of changes because they would realize you know what, but eight people who live in this community mean business in a way that you know what I need a votes and if I want their votes, because other communities hold his elected official fee to the fire."
        }
    }
}