{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CB 3 Manhattan - SLA \\u0026 DCA Licensing Committee - August 17th 2020",
            "publishDate": "2020-08-18",
            "shortDescription": "Agenda\\n1.    Approval of previous month's minutes\\n2.    Amend administrative approval stipulations to require one year of operation before applying for an upgrade\\nNew Liquor License Applications\\n3.    Bel-Fries Foods LLC, 132 Ludlow St (b)\\n4.    The Bronx Brewery LLC, 64 2nd Ave (op)\\n5.    Cenoté (Merse Group LLC), 109 Ludlow St (op) (withdrawn before meeting)\\n6.    Ten Degrees (241 On St Marks Corp), 121 St Marks Pl (op)\\n7.    Dinah Restaurant (Dinah Corporation), 162-166 2nd Ave (op)\\n8.    Avenue A Gourmet LLC, 202 Ave A (op) (withdrawn before meeting)\\n9.    Corp to be Formed, 511 E 5th St (op)\\nItems not heard at Committee\\n10.    The Ground (Chinatown United Food Services LLC), 130 Madison St (wb)\\n11.    Lhasa (Lhasa Fast Food LLC), 177 1st Ave (wb)\\n12.    Global Nippa USA Inc, 239-241 E 5th St (wb)\\n13.    Clandestino Cafe \\u0026 Bar (35 Canal Cafe LLC), 35 Canal St (op/corp change) (withdrawn before meeting)\\n14.    Vote to adjourn"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 240,
            "um": 392
        },
        "wordCountFullTranscript": {
            "business": 117,
            "applicant": 86,
            "application": 65,
            "beer": 64,
            "people": 54,
            "hours": 51,
            "location": 49,
            "license": 47,
            "event": 46,
            "area": 40
        },
        "wordCountSummary": {
            "business": 31,
            "applicant": 23,
            "hours": 16,
            "application": 13,
            "location": 13,
            "community": 11,
            "people": 11,
            "license": 10,
            "event": 9,
            "street": 9
        },
        "fullTranscript": "Hello, do I need to check in with you guys with my name, because I'm not on the zoom online yeah, if you're calling in by the phone, I can go ahead and you don't obviously have the app option to enter into the chat box, but I can, if you want to just go ahead and give me one second, to open the chat box and state your name. I can just go ahead and type that in so we have a record of it. You know clint I'll type it in. Thank you I'll type it in for glenn. Okay, thank you robbie! Thank you that was that was glenn right. Oh no! Let me know, let me know when you're ready rob. I believe that I typed in the chat box winning okay go ahead, the person who called into the phone yes, my name is mordecai, that's m-o-r-d-e-c-h-a-I. My last name is hasson h, a double s like sam, oh and like nancy. Okay, and are you with an applicant? Are you here for or against? Yes, I am the applicant, I'm the owner of new statford restaurant. We do business as 10 degrees, okay and we're here for the license. Transfer great okay, great! Thank you. Okay, I got you. I entered you into the chat just so we have a record. Thank you for that. Yep appreciate it. Thank you. Okay, it looks like alex. It looks like everyone is now in, except for herman. You want me to text him yeah check and see. If he's joining us, if not, we can go ahead and get started. He sometimes has tech issues, but he knows how to he texts, but hopefully he'll respond to that. Okay. Well, while we're waiting for one more community committee member I'll go ahead and read through the guidelines for anyone who is attending here as a guest or an applicant, so the meeting is being recorded just for everyone's use. If you're, not a committee member, please go ahead and sign in by entering your name and affiliation or if you're, just a member of the community and any item you wish to speak on in the chat box. Please stay muted. Unless you're speaking on a desktop computer, you can unmute using the microphone button at the bottom or press the space bar to temporarily unmute yourself and speak on a phone. You can tap the mute icon at the bottom of your screen and please raise your hand if you would like to speak. You can do that by going the participants tab at the bottom of your screen. Go to the bottom of the list. Click a button labeled raise hand on your phone. You can raise your hand by pressing star 9. Then please use the chat box. If you would like to speak for each application, the chair, which is alexander militano, is going to give a brief summary of the application. As it's been submitted. The applicant will then have a chance to speak after that. We'll call on any members of the public that wish to speak or ask any questions. The applicants will then have a chance to respond, and then the committee members will discuss after that. The committee will then formulate and pass a resolution. So that's generally how our meeting is going to progress this evening. I will one moment I'm going to put up one of our agendas for this tonight that we can see what items will be discussing. Okay, so here are the items that we will be discussing tonight. We have item number three is belfry's food at 132, ludlow street item number. Four: is the Bronx brewery at 64, 2nd avenue? Item number 5 has withdrawn 109 ludlow street 10 degrees, which is 129 st marks, dino restaurant, which is 162 to 166, 2nd avenue, a gourmet which was number eight, has withdrawn and a corporation to be formed at 511, east 5th street. Just because one of the items has withdrawn does not mean they will not come back again next month or following that, but for they are not on our agenda for the season. Clint herman told me he would be on in a minute when he's logging on so we'll just wait for clint for herman tv, oh and I do see in the chat box dennis riddle. You've made a comment that you wish to comment on. Item number 10 the ground. That's an item that is not heard at committee. It falls under our administrative approval process, which means they've agreed to all of our standard stipulations, so we will not be discussing them or approving them tonight. I don't know if you have any questions or you, I would have questions for the board. Yes, and what? Because no one's approached us in the neighborhood about the place and what will we have that opportunity to oppose? Do you want me to answer that question sure threw it out there, because I don't know what else to do. There's no sense of me attending tonight. I would like to know when usually for administrative approvals, but the process is, and it's outlined on our website is that somebody has the opportunity to look at what is listed as an administrative approval, not heard of committee. Look at the sla notice and the questionnaire that was submitted by the applicant, which is on the website, look at the elements of the business you can reach out to the applicant and speak to the applicant about whatever concerns you might have and then, prior to the committee meeting, if there's an issue with the business that you want addressed, you ask us the calendar. If that's what should happen, some things are resolved just by speaking with the applicant or they're just a question of wanting clarification about what businesses. But there is a questionnaire that the applicant submitted, that is on the website, that details the elements of the business, the proposed business and also what the stipulations are that's over in the business. So there's no there's no opportunity for the residents who are directly affected by the business to say anything. I'm sorry could you say that again I just didn't hear you. So is there there's no opportunity for the residents who are directly affected by this place to say anything? There is and that's the process that I just described. If you want to just make a comment about the business, that's fine, but we're not hearing the applicant tonight or discussing whether or not to approve this as we've already determined, would be administratively approved. If you have a concern or comment about it, you could send that into the off after this meeting or after you've reviewed the questionnaire that the applicant submitted and the stipulations the conditions that it's agreed to about how it's going to operate its business, then you can certainly send something into the office and we'll try to address it, for you send that into the sla website. I'm sorry, I could just send my comments. Direct to the snla website is tv, three or four you can and if they're, yes, you can and they'll get forwarded to me, okay, but make sure, but make sure you submit them to the community board, not just the sla website yeah. I understand that cb3, yes, yeah. Okay, no reason for me to attend tonight. No, because we won't be discussing that item yeah. Okay, all right! Well! Thank you. All you're welcome take care. Okay, so herman has now joined us all of our community members are here we're going to go ahead and get started just another quick reminder for anyone who's just joined recently, since I last read this, if you are joining, please sign in the chat box list, if you're an applicant, if you're here supporting an applicant if you're a member of the public, with any comments for or against or you're just here to listen, but the chat box is what we use for our attendance sheet and on that I'm gonna go ahead and hand this over to alex for her to begin the meeting good evening, everyone to start we're going to go to our approval previous month's minute and then we're going to build into the agenda items that clint reviewed when he went through the agenda so is. Do I have a motion and the second for the approval of previous months minutes or any amendments I'll motion to approve? Is that you ellen second knitting? Yes, all right all in favor hi, I think that's all of us. Okay, we're moving on to number two number two is: was an agenda item added by the office and something that we have discussed on and off as a committee which is adding to the administrative approvals, the stipulation requiring that the applicant or the licensee operate for a year before applying for an upgrade and as a committee, we've discussed different amounts of time. But this is how this item appeared as generated by the office. Do you want me to speak more to this has come up on occasions, I wouldn't say come up frequently, but it's come out up on occasion that someone who has been administratively approved has very quickly then applied for an upgrade in that license. We have had a couple of people: do it in as little as three months time from the administrative approval process, but it hasn't been something that we've dealt with so much on this committee. I would say there was like a handful of them at one time in the space of several months, but otherwise it's been every once in a while that we've heard from somebody who has been operating with less than a year. Do any of the committee members want to comment or be heard about this? I would, I would say if we just do it, based on that one and a half line of statement that you have right now, I wouldn't I wouldn't vote on it. That way, I think a whole resolution has to be done to take into consideration even if they do one year and I would probably think at least one year not one year, because they would take that as a permanent way of just coming back and said. You said one year, I'm operating for one year. Therefore I need the upgrade. The second thing is, it should have wording that has to do with the possibility that person has not been conforming to the rules and regulations, and that would give us an idea of how to evaluate them and to decide where, even at one year or even at two years, that we would not vote for approval because they probably have violations they. You know we have a roadie place or stuff like that. I mean you could go on, but I think we should really tie it up and not just vote on that tonight. Just the way it is you mean you like to see a more comprehensive resolution that includes something along the lines of no sooner than but from at least like a and I'm not even saying that it would necessarily be a year, but from this point on, you may apply for a changing class of your liquor license understanding that your application is going to be evaluated just as any other application would, which would be whether or not it's appropriate for a changing class and whether or not your business has been operating the way that it agreed that it would, when it was administratively approved. Is that what you're, saying herman or taking into consideration all the things we would normally take into consideration like that? Yes, so go ahead clint. So I would like to add. I don't I kind of agree with herman, but we have talked about this in the past and I think it is a good idea because often we're having people coming in with administrative approvals. Coming back after three four six months, when they haven't been operating long enough for us to even really get a full understanding of, if they're going to be good operators or if they're going to be problems, so I do think this is necessary. I personally think that a year is not long enough, because the administrative approval process is to give us something and if they're only doing it for a year, by the time they get up and running so that they get their license, they open they're going to have a grand opening. It's going to be a couple months. It's going to take a little while for them to get up and running in their normal. You know the normal phase, whatever that may be in the future. So I don't personally feel like a year is enough. I think it needs to be more something along the lines of 18 months. That way we go through all of the seasons of them opening, because, obviously you know different seasons of the year cause different problems for different businesses. So my suggestion, or my opinion, is that it should be something longer than a year. You know I'm throwing out 18 months just because that would give us a full cycle of a year after they've actually been up and running. I also do agree with herman. Maybe we don't necessarily vote on this tonight. I know that's putting it off another month, but maybe it's probably a good idea to have it formulated into a more comprehensive resolution so that we have a better understanding of what we'd actually be discussing and voting on anybody else. Can I hit jesse yeah, I would be. I don't know going to 18 months seems a little long to me. I get what you're saying and I do understand. I feel that after a year we could take it case. By case, like alex, is saying, there's only a handful that really came in. I would be. I don't know going beyond a year and saying that you can't come before us. It seems a little long to me for if they're, if they've been in good operation for a year, I feel like going after a year. It's a case by case we say well really you've only been up and running for six months by the time we got around opening then, but I don't know a little along to me. I was gonna say just two years, but I was being generous. All right, clint anybody else. Committee members, do you agree that you want just a resolution that is better explained because we can certainly adjourn this to next month and I can draft a resolution yeah. That sounds good to me. I think I agree. I think that would be a good idea. I agree with that. Okay, moving on to item number three belfrees fries, either or which is 132 ludlow street hi, grabby sharma. On behalf of bell fries, I have with me here glenn schlossberg, he's on the on the zoom and on video he's the proprietor owner hi. That's me, yeah todd is on here also he's my partner. Oh okay, sorry about that! Sorry, todd! Hey guys, I'm sorry! Right now I have a bad internet connection, but nice to meet you and again, I'm gonna go good evening. Again, I'm gonna go through the materials that I've received and then give the applicant an opportunity to make a statement or a presentation and as well as give anybody in the audience who signed up to speak for this and again, if you've logged on while you've been talking and you're here to speak for this or any s item you should or against any item or you're the applicant, so that we could keep an accurate accounting of attendance. We are using the chat box so that you could log in your name and any organization you're affiliated with or if you're a resident of a particular location or area, and you want to speak to an item. You should write all that in so this is an application for the sla notice says: tavern with minimal food recorded music and notes the existing outdoor space pursuant to the executive order, which it doesn't have to because it's pursuant to the executive order on the ground floor of this location, the ceo, it says, is 74 with four tables in 15 seats. Although a diagram submitted shows a standing rail with no seats, a bar with no information- I don't know if it's the service counter or something separate in the diagram, it appears to be a service counter. Hours of operation are 1 pm to 2 am sunday through wednesday 1pm to 4am thursday. Through saturday it says kitchen open all hours and the item that is the location is serving is fries. It says french and accordion doors. The diagram shows that the facade is completely open. I mean, or the photograph that was submitted or photographed, show that the cloud is completely open without any agreement to close at 10 pm, which is one of the stipulations on our questionnaire recorded background music, no promoted event scheduled performances or events with cover fees, no tvs, no security, no sound proofing, no intention to upgrade no hosting pub crawls or party buzzes happy hours to 8pm. There's no agreement about no wait lines. There is an agreement about staff outside and that outside means somebody responsible for overseeing crowds and noise on the sidewalk for the applicant, there are five licenses on the plot. On the block. I counted. Six, the applicant notes no license experience, but no similar job experience they're not as just location necessarily, but there is a long-standing cavern. Also at this address, and then there were a number of letters and emails submitted. Two letters from residents of 101 stand street complaining about a event on may 31st, where the street was closed for what they're characterizing as a race car block party. That's one resident the other one said a gathering of 150 people, 50 cars with no social distancing and a dj. There was a another resident letter submitted, also fighting the event on may 31st, also speaking to the cars as well as the dj on the sidewalk, there was a letter submitted by the lower east side dwellers also citing the events, but additionally, noting that this applicant currently is placing its rails and its rails. When they're on legs, there are rails on state on legs that have holes, because the fries that they sell are served in cones, so the holes presumably are to put the fries in the cones through and those rails are currently on residential garbage cans acting as an area for people to eat their food. So they know that, in addition to being on sanitary, not promoting social distancing, it also obstructs the public sidewalk when people are standing at the garbage cans. This way, the district manager also submitted a statement that, because of the two she said, there were two gatherings, both of which generated complaints, the second resulting in a fight meeting, with the bid with the business improvement district in that area, the community board, the precinct and local elected officials or their representatives to address what was going on with the business and which ultimately resulted in the business agreeing not to be open for the period of one week or consistent with whatever phase we were in and until we moved into the next phase of the executive order. So that's the information that I have with respect to this application. This is now the opportunity for the attorney or the applicant or both to make a statement or to clarify any of the information that I provided bearing in mind. This is primarily this is summaries, a summary of the information you submitted, as well as the letters that were submitted to the office you're on mu you're on mute, ravi, all right so alexandra. Thank you very much thanks glenn for telling me I was. I wanted to just address a couple of things that you mentioned in the application in terms of the terms of what we submitted. There's, it's technically a bar, but really that's the food counter where people order their french fries and that's where they would that's where they would order their beer or wine to go with their food. This there is the cfo is it's. You know. Technically it's a it's a! I believe it's a letter of no objection, so it's under 74, but realistically there's not room by any means for 74 people, but technically that's the law, but there's no way anybody's putting 74 people in that space. It probably holds you know, seven people, you know shoulder to shoulder in a non-coded situation and you can see by the pictures how small it is in terms of the amount of seats that are listed. Those are technically the seats that are part of the outdoor seating that is, is visualized in one of the photos from taken from inside the the premises which is put there because of the executive order on the street, where there would normally either be parking or traffic. So those are the things that I that were mentioned in the in the that you mentioned that I wanted to clarify. I know I note that I have not heard personally from anybody that I emailed the community groups that were listed on the cb3 website, inviting them to certainly reach out to me that I put them in touch with my clients if they had any questions or concerns about this. I understand the letters you received. I haven't seen them, but I understand what they're about. I know that there was not an event, but there was a gathering back in may 31st. I believe you said this is not a normal or part of the regular course of business of this business, which is to sell french, fries and and hopefully to sell beer and wine in conjunction with the sale of french fries. Really that's what people would go there for, and it's not going to be part of the normal operating of the of this business and in fact it was not even part of a planned operation. It was an impromptu event that occurred with some fans of the place that happened to have a lot of fast cars, and frankly, it was a bit of a surprise to everybody involved that it happened and it hasn't happened again and it's not planned to be happened as a regular course of the business of this of this business. It's a french fried place and I think the record is that hasn't happened since I don't know what the second event that you mentioned was, I don't know anything about that and it doesn't sound like it was. It was similar. I don't know, I'm certainly willing to answer any specific questions. The questions have perhaps after we hear from members of the public- you, let me know: okay, we do have at the moment there's one person in the chat that has signed up to speak on this item and that would be marvin aviles. Thank you, sla cb3. I want to know two points here. One is which I'm surprised at the position in which the operator is taking and the representation is taking. I'm very surprised that there are stating that this was not a planned event that they seem to be portraying it as that they're, more victims of the situation that occurred versus the instigators or the orchestrators of the dj of the cars of this of the cars that had decals of the place, et cetera, et cetera, et cetera, but number two. I also want to stress that I do understand the situation that the business is in. We are in a Covid-19 world and I understand that it's going to be very difficult for them to generate revenue. That being said, I don't see how this location can meet the basic needs of a restaurant or any other beer and wine. I think I got lost, I don't know how far I went. You're back marvin are you finished yeah, I'm finished, I don't know why I got caught, but I think you got some of my stuff in my email, so I just wanted to state my two points. Thank you. Okay, thank you. So much is there anybody else at the moment I don't see anyone else. I there is one comment from. I remember. Actually our board chair who said she was there the day of the opening and the whole block was shut down without warning. Is there anyone else anyone else that wishes to speak on this item? Okay, I see none alex okay, robbie just for clarification, you're saying that the applicant was seeking to serve beer and wine, but we only had a notice for beer actually alex yeah. The application does say beer wine insider, I mean that's it. The notice says that the agenda only says beer. I think I think the agenda only says beer, but I think that it would he had it correct on the application. It says. Yes, I'm looking on its new. Yes, new wine beer cider license yeah. I think that was just not filled in correctly on the agenda yeah and just by the way. I think this is this is at this point this event and there were two gatherings of some kind, because the second resulted in the office actually responding to the site, but the event that happened on may 31st ravi had flyers posted to announce the event with the logo and name of the business on the flyers. So I appreciate that you're saying it wasn't a planned event, but it was something that was done on behalf of the business, but the business. Somebody printed out, flyers that had the business logo on them and they did it in it far enough in advance to result in what is being counted as like 50 luxury cars, showing up on the street parking on the street driving around the block. Somebody had the wherewithal to bring cones to put cones on the street to block off the block and the resulting gathering was in the amount of approximately 150 people. A dj came with a table and set the table up and was in the process of beginning to play music outside when the police and mr velez was kind enough, marvin to submit a video of the police, actually stopping the dj from playing. But it also was posted in the press to stop the dj from playing outside and the police broke up the gathering. So I know it's called a gathering, but it appears to be consistent with an event, given that all these people showed up in the same place at the same time and were summoned there in some way, whether it was just via the flyers that the neighborhood saw, or by some other means, as well and like and was with the idea of having music outside and coordinating off the street. So all unpermitted unauthorized activity that seems to have been sponsored or promoted by your applicant and the concern here is not that the business is going to be run every day like that would be its own concern, but that there really can't be any reliance on how the applicant is going to run any kind of business. Even a teeny, tiny one that maybe only can hold seven people because he's already had these two events that necessity that resulted in complaints on one case necessitated various city officials showing up to try to mediate it both times the police had to show up. Alicia actually has her hand up alex. So when you get a chance of course, you can speak- and this is our chair. So I'm going to give our chairs the opportunity to speak, and then you or the applicant can respond to this, but I think in order to get to the making of a resolution, we have to move past this place where all of these unauthorized things have already been done in a really short amount of time and figure out how we get some assurance. It's not going to happen again, alicia yeah alex. Thank you. So much. Can everyone hear me yep go ahead, okay, so yeah I was. I literally was on the street the day that the event happened with all the cars, the overs. They not just were they cars. They were oversized vehicles and no other car could get around the vehicles. These were like some kind of like car show kind of situation. Now I know you know I don't I don't know what prompted them to have this type of event for a french fry place opening- and I know that they're applying tonight for beer wine or something like that, but I am really just disgusted at the fact that they had no regard for the community when they allowed this thing to happen, I mean, or, like gentlemen said, like marvin, I think his name was marvin said that the cars had their logos on the side. If they like alex, was saying making reference to the dj that was being set up. I was literally standing on the corner, trying to see what the entire world was going on with this situation, and it was out of control. There clearly was no one that wanted to take ownership of what was going on, and I felt like I didn't know who the point person was that I could even get a word in edgewise to talk to someone to say what are you guys doing? The next thing I knew it was like one: car became 10 vehicles, these specialty cars that came out of nowhere and the whole entire ludlow street was shut down. I mean yeah, there were celebrities, I heard there were celebrities there and all of that, but the thing is it's like we are a small community. This is not the place for that. You know. I really do hope that you really learn a valuable lesson from this situation. That happened, and I hope that you never do this again to our community. This is a small community and there are a lot of families that are living in this community. They are elderly, they're children, and we need to be mindful and respectful of that and keep that in mind. Okay, thank you. Thank you. Alex okay, go ahead. This is an opportunity robbie for you or your client to respond or to make any other statement. So I've spoken to my client about this situation. I we still again. I don't know what this second event that's being described is, nor does my client. The only item that I know about- and my client knows about, is what is being discussed with these vehicles. The reality is that it was not planned by this applicant. This was a spontaneous thing that somebody that knew the applicant decided to do that they thought would be cool. This was not something that was the my client was in charge of or instigated it was not an opening. The place had been opening open for more than two weeks. All of that being said, I've heard about this event. I wasn't present. I learned about it when susan mentioned it to me when I put in the application, and certainly I've discussed the reality of the situation in this neighborhood with my client that whether it was planned or not, which it wasn't, even if other people want to do something like that, it's not going to stand unless it unless anything, has to go through all the right channels, and that's not the plan to do at this time. This place is a french fry place. It's not a place to have a car show. My client understands that somebody didn't understand that, but it wasn't the applicant. The applicant didn't take charge of the situation, because the applicant wasn't in charge of that situation. It apparently lasted for about an hour and a half. It's not. It doesn't sound like. There was a map from what I can tell it sounds kind of wild to have that many luxury cars there, and certainly the idea that somebody would set up a dj table sounds pretty crazy to me, but I have to take my client at face value that this wasn't something that my client planned. Does my client know some of the people involved. Yes, but that is the reason that activity is not has not reoccurred and again we don't know what you're talking about in regard to the second event, certainly I don't know what that is. Maybe it was a. Maybe it was information and or spin-off from something in the regarding the first event or complaints from that, but I don't know of two events whatsoever and I haven't heard any details as to what that is as compared to this other car event that you know we're not saying it didn't happen. I'm saying what I'm saying and I don't have much more to say other than it's not part of the planned operation of this business, and if there was some over-exuberance by some fans of the business, that's what it was and maybe perhaps too much over-exuberance, but it was not a condoned plan. My client doesn't know about any brochures or flyers. I haven't seen any. We definitely would like to see it, but these were people that were a fan of the place that thought it was a cool idea which I frankly, don't think it was a cool idea for this neighborhood, not in these circumstances, and not certainly going through the proper channels, and that's what I told my client okay. Thank you. I will say that being an attorney myself, I appreciate that sometimes clients or people that you deal with, who want to make statements to the to a court or a body, will tell you something and as the attorney we're not necessarily supposed to be relying only on what we they're saying and what the face value of those statements are. But we're supposed to ascertain- and I understand that you don't have the ability to do that now. Clint, do you have the video that morgan sent on his email? Can you call that up and there's also the flyers that, in the letter that was submitted by the 101 stan street resident had the flyer I believe that was circulated announcing this event, which was announced as a fundraiser? So it seems unlikely it was spontaneous, but you do have to look at whether or not physical evidence or other evidence or other people corroborate or refute what your client is saying in order to represent them in the best way. I think we once you do that we can go to the making of a resolution and have a discussion about what that resolution was hold on. One second and bring me up and marvin also has his hand up marvin. If you want to go ahead and speak while I'm pulling up your videos. Thank you. There is one video I did not present as evidence, which was the discussion of the seventh precinct community officer, who found mr slushen sloshberg and had a discussion with him for a period of time and after that period of time, mr schlossberg went and told the dj to leave and was acting as if he was the person in charge. So I can only deduce that he was the orchestrator of the event and this the community officer from seventh precinct had a very lengthy discussion with him, and I can I can upload that if it need be, I didn't want to because I didn't think it was appropriate but based upon their position, I'm frankly very shocked that the legal representation of mr schlossberger is not in line with either his client or the events that occurred on that day. Okay, so if we want, I can play the videos here hold on one moment. Let's make sure that's okay, this should be playing. Let me know, let's everyone. If we can see this okay, can everyone see the video? Yes, I can hey. Oh there's another one that shows the police yeah stopping the people from playing and there's also the flyer. So this one is sideways. I don't know that I can rotate it easily on youtube at the moment, but, okay, let's eat them, did you have a flyer yeah, I'm just getting that one right now hold on one second or actually was. It was part of one of the emails I sent. Everybody with the complaint give me one. Second, then it wasn't. I thought it was in that same message that you forwarded there, but you know this: can you not find it clint? I do not. I do not see. I don't see the flyer. It was sent right when the event happened, so it was attached to one of the initial letters yeah and one okay, one of the early ones, the 101 sand street resident, hey clint. I think michelle sent you a link to a video that has a lot more relevant information yeah. It's a pretty slickly produced video about the event which sort of stretches the imagination that it was spontaneous. Do you want to put in the chat? Also thank you michelle or hold on. If you send it yep, I got it in the email hold on. Let me okay, give me one second to share this yep group motorcycles. I'm sorry! I didn't know that he was actually driving one of the cars. I think what we want to get from this and what we want to continue into this discussion is. We have a lot of concern about the ability of your clients to manage any kind of business or the people that come to their business on their behalf since they're, claiming that they're not they didn't participate in this event so and watching this, I do have a lot of concern about their ability to manage anybody, that's affiliated with them, which they will have to do as business owners. I also don't think that white truck that says belfries on it should ever be on ludlow street. It takes up the entire block so, and I didn't appreciate that was actually the business truck or a truck that got the business logo on it. So I mean, can we just speak to? I think what would be most helpful here is some like some show of contrition, rather than we had nothing to do with it, but clearly, at least on the part of your one client. It's not true, so I'm sorry clint did you want to say something, so you can go ahead. I have. I have something different to add, not even about the event but go ahead. Robby, and you can answer that question okay. So I want to be clear as to what I'm saying this was not planned by my client. These were friends that know my client. That thought this was a good idea. My client did not know this was going to happen and when it happened, it was bigger than anybody thought. Certainly, my client thought that it was going to be when he may have heard about it previously. To that moment and the statement as to he's in charge he's in charge of his restaurant and certainly just like, you would tell people that are making noise in a lineup to please stop making noise or don't bother neighbors we're not in charge of those people, no one's in charge of those people, but you do the best they can. You can and when the police were on site- and they spoke to my client, my client did what he could do, which was to tell the dj like you're. Not don't, please don't play like if the dj had wanted to do what he wanted to do. He would have done what he wanted to do. He was not hired by my client to play. He was not planned to be there by my client, my client. Frankly, when it started to happen, was at first probably flattered, but obviously that's not an event in the way that it turned out. That was going to fly, probably in any neighborhood much less. This neighborhood we're not saying that no one knew anybody who was operating, who came with cars, but it was not planned by my client to do so. This was a spontaneous thing from other people. They may have planned to show up with a dj, but they weren't. This wasn't ordained or even cleared with my client, and that's what I'm saying here after the fact. My client decided that, because this had happened, that he would donate all of the proceeds of that day to charity which he did, but this wasn't meant to be a charity event in advance, and this was going to be a big thing that there was going to be an opening or also my client's. A professional he's run a business for many years very successful business and the way that he's built this establishment with the architecture and with the attention to care with an excellent chef and excellent food. If he was going to have an opening party, he would have had an opening party and you would have been real advertisements about it and hopefully it would have been, and I would I would expect if he would have hired an event planner who would not allow an event something of that size to occur in an ad hoc manner like this one occurred. So you wrap this up now. I think we understand yeah so, and I saw the video and it's consistent with what everybody has said happened at that event. But it does it's not consistent with he's in charge of that event, and that's what we're saying here and as far as contrition goes, I've told my client that you know this is the type of thing that you just can't not do, and you cannot allow your friends to do that either, and I think he knows that I mean it's very clear. That event did not happen again and is not planned. That's not what this business is about, and that's, and you know that was an enforce. In my opinion, an unfortunate event. Well, it might have been flattering at first. It certainly wasn't what the neighborhood wanted and certainly you know events can happen, but those things have to be done in through the proper channels by anybody who wants to throw an event whether it's a block party or anything else. I didn't see the road being closed in that video, so it does look like what you guys have said. It is, and it also looks like what my client says it is. It was and we're not trying to be inconsistent here and try to pretend that you didn't know anybody that had one of those fancy cars. That's not the point. The point is that it wasn't a planned event by this company to have its opening. That's what it was not should we go to the making of resolution now and another discussion. I just yeah. Well, I want to say one more thing kind of on a separate subject. The only thing in response to that is this that last video definitely showed, even if he didn't plan it, the video was inside his kitchen taking videos of him cooking and his staff cooking. He did nothing to stop it. So that's my concern, but that wasn't what I was going to speak about. Let's just say that event never happened. I have a concern about even a beer and wine license in this location until 2 a.m and 4 a.m. On the weekends, because there are, with the exception of the governor's executive order for having outdoor seating other than that, there are no tables. There are no sit-down. People are going to stand and get a beer and right now, yes, they're allowed to get a beer to go, but once this executive order's over with, if it ever is whatever that may mean there's nowhere to even sit in there. This is a purely takeout business. So that's a concern of mine for a beer and wine license for pretty much a stand-up takeout business. I I'm not sure I could support that, even if this was opening and had never had any of the other issues we've been through. That would be a concern for me. I could I could address okay, I don't have to go. I mean okay go ahead, just in terms of the you know, legality or the size of the place. Clearly right now, yes, beer to go along with food outdoor space. That's allowed when that, when, hopefully, when that changes and the Covid-19 executive orders are over, I mean I prefer that there be outdoor seating personally, but even if there isn't, when there isn't assuming there isn't, he will have to not allow anybody to leave that place with a beer and break the law. That would that will be something that will get his license revoked and it's not a takeout beer place this you know it's, it can't be, and if five people want to be able to sit on the inside of that premises and have their french fries with a beer, then that's what they can do and maybe his license won't be all that amazing. Then, when you can only sell five years at a time, but that's the way it's going to be, but right now, but he's entitled to that he's entitled to have a wine beer license. That's maybe not as efficacious as a place that has actually 30 seats and he breaks the way. Where are they going to sit? There's no, there's no tables, there's nothing on the diagram that we were given. Oh there's that little table there that can slide it pivots and certainly some seats can be sit there and by the way they need to sit. They can stand at that little table if they're inside that's lawful, I'm not saying it's, I'm not saying it's unlawful, I'm just saying it's not! I don't see the point in having, if they're getting fries, to stand and eat to go or to eat for three minutes. They don't there's no benefit to having a beer with that, and I think we understand. I think we understand the points on both sides- okay- and we just have to move on to the discussion and making a resolution. So with with respect to that committee, does anybody else decide? Clint want to be heard? I've already spoken so, and I agree with him with respect to the hours of operation, the type of business, the location, and you know what they seem to be marketing toward and also what I've read in terms of what they say: they're marketing toward which is the hip young, energetic community that exists in the area, michelle ellen jesse herman. Do you want to comment? What I want to say is even without seeing the video that was shown, I see more than that, because it was live stream by somebody on facebook. That's how I find about it sitting in my house. I wasn't in the street I wasn't close by, but I saw all of that kind of stuff. Secondly, the other point is, I agree with clint that having beer and wine and having to stand at one small table, how many people could be there and, if you're, having the fries and drinking somebody on the sidewalk and, of course the sidewalk is a privilege. It's not a right, so it could be taking be taken away in a couple of months depends on the liquor authority and they have to apply for a sidewalk cafe or some form which may not even be given to them and serving french fries and beer and wine until two three o'clock. It's not my sense of what I would like based on his business model, and I cannot trust. The fact is that the first his representative could say as much as the point he wasn't there. He has to rely on what his client tell him. I guess that's a political point of it. I don't know I'm not a legal person. However, I just have to say without going further, that it's not something I would approve in total, but if it's one of those things that he closes at midnight, maybe that's something I could go along with. Okay, anybody else, I'll just say that I agree with herman that maybe if this had been an administrative approval, that would have been less contentious, but there are a lot of operator existing operators in the neighborhood who have lost their license for less than that kind of behavior. So I don't see why we would preemptively give someone who has already proven to be a bad operator a license, especially right now, maybe at a different time: okay, jessie or ellen, and then I'm gonna make a statement with respect to the process, and then we can discuss the resolution and what it might look like. I think, everything's been stated. I don't have anything to add. I don't have anything more today. Okay, so the standard for approving of your wine license is very low. That being said, I don't I don't know that this would necessarily fall. I don't know necessarily the sla would not credit this, as opposed to any other information that we might put forward for opposition to a beer wine license. So I think that there's either we could do either of two things we could make a motion to deny, but that motion to deny should be accompanied by all the documentary evidence. We've been provided and the videos, or we can make a motion that we are very unhappy with this business and the reasons why already we are unhappy with this business and a motion to approve with very restrictive stipulations, I'm open to either either one. I guess, the one that approval technically has disadvantages. My expectation is that the applicant's not going to assign any stipulations that we construct, although maybe that maybe that person or people will and then we'll go to the sla and we'll end up having to send somebody to the sla, and I have no doubt that the community will submit material to the sla also about their concerns about this business. Given this short history- or we can make a motion to deny the motion to deny, would have all of the information that we discussed, as I said, as well as the documentary evidence, but my expectation is that the sla in most circumstances would approve of your wine license. You know absent some sort of criminal record on the part of the applicant, so I'm open to either suggestions. We certainly have made motions to deny br1 licenses before and we followed them. Then we can do that here, alexander, my client has asked if he could make a final statement normally. I know that he probably won't allow that, but I have to ask because he's asked me sure: I don't know that it's going to change our opinions in any way, but it would. I would appreciate, hearing from one of them. Okay, so hi, I'm glenn schlossberg. I am a little new to the neighborhood. I live on the upper east side of new york city and about two years ago I was traveling through europe, with my daughter, who's in college at cornell university. Currently and when we were traveling through europe, we saw free stores, all over france, the netherlands and then into belgium, and my daughter came to me and she said we got to bring this to the states, because there were lines in front of all these street stores and we were trying different french fries and- and so I rolled it off, I said, make me a business plan, yeah and sure enough. She makes me a whole long business plan and she shows me how she wants to perfect the french fry she spent over a year working on. She tried out maybe over 30 different potatoes from around the world and different oils and different ways of cooking them and finding them, and we believe she believes she really perfected the french fry and we set out to look for a location. And, yes, we wanted a young electric kind of nice area. So we then bumped into stefan who owned the taco place. That used to be there prior and stefan is a a chef, a high-end chef who has a different a job, and so we partnered up with stefan. The one thing I was missing was the social media branding design, aesthetic my normal business, I'm in the fashion business for 31 years, I've had only one company I have as of January, I had over 300 employees. I know how to run a business. I don't have that many employees at this point because of Covid-19 and most of them are on furlough still. But what I do know is, I know how to run a business. I know how to run a business professionally. You know I hire only the top-notch legal accountants. I pay my taxes, everything I do is top-notch, so I am a car enthusiast. I will say- and I have friends in that world, so I invited one of my car enthusiast friend to try our french fries well. Needless to say, he was blown away with how good they were and then he gets on his texting and his instagram and he's like. I gotta bring more of my friends here. I gotta bring more of my friends here and within 36 hours. Okay, all of a sudden he's got all of these people. Rolling up he's made decals for their for them for their cars and he's screaming and bragging about our franchise right and business in colbit was not all that lovely. It still is not right, we're marginally profitable at this point, and so at that moment in that moment, yes, it was flattering that these people all came. We did not hire a dj, they came with a dj. One of the car. Guys is a dj, you know and he started playing and another guy out of nowhere, not part of the car people started videoing the whole scenario, a lot of picture, taking a lot of iphone thinking and, and then- and so this was a very not planned event. But what happened is the neighborhood came out to see all what was going on? They were trying our french fries, they were enjoying it. There was a lot of laughter going on. It was a very stressful moment in the city, and you know what we. It was a little comfort. It was comfort, food, it was laughing, it was calm, it was then the police came very respectfully. They said you know what you don't. You can't do this it's too much. The neighbors are complaining. It's too loud. Let's do this and right away. I said to my car guy and to the dj. You got to stop this. The police only asked me. Please shut down the dj and immediately I did okay and then later on they wanted. You know it's got to calm down more and then we took cars off the street and before you know it lasted maybe an hour and a half and it in my opinion it wasn't super out of control, but it was a little louder than maybe it should be. For this nice comfortable neighborhood, I'm not planning on doing another one. I learned my lesson from that. It wasn't worth it. I have befriended, the police they've told me all the rules in the neighborhood. They told me all about the neighborhood. I happen to really like the neighborhood truthfully. I almost never went down to ludlow in my entire life. I went to ludlow from the upper east side and now I you know I come back up to the upper east side. It's like ludlow's a wonderful place, I'm so impressed with that whole area. So I didn't mean to offend anyone or to upset anyone. I didn't think it was that offensive or at the moment, until after the fact, the video you showed was all after the fact right. It was the whole the whole thing there was never a second event. I don't know where that was said that there was a second event. I don't know if a single second event that ever happened, we've been we've been operating, the business is doing nicely, it's increasing. The problem is it's barely marginal margin, marginal profit wise and we feel with the beer and wine. Maybe we can get a little extra profit out of the out of the store. The whole store is 350 feet square feet and my daughter's there almost like every day experimenting with her craft and what she's trying to improve and perfect and yeah. I didn't open it with on the cheap at all we spent. I spent a massive amount of money with the design, the decor, the branding, the social media, everything and it's to me it's making people I've only if you look at my ratings only five star ratings so far, I can't even believe it. Everyone is really enjoying the french fries and the food and please anyone here in the committee who wants to try the french fries they're on me all the time, because you would love them. Also, it's really it's a nice. I think it's a nice scenario, I'm a businessman, I'm not trying to do anything wrong in the world. I don't need to do anything wrong in the world, sir, we can't accept a gratuity from you, it's like going to court and asking telling a judge that you'll give him something for free. We can't okay, we're all elected. I want you to know I've never seen officials, we can't do it. I've never been to I've, never been to a community in my life, my first time ever on a community board. I didn't know any of the rules I had. I like talked to ravi and it's pretty interesting. Thank you. Okay, so let's go to the making of a resolution. Please we have to move on to the other four items. Do you want me to do a straw poll for a vote to deny or a vote to approve of stipulations? I can do that is everybody on the fed straw poll for a denial and then we could move on to whether or not that's going to be the resolution or we're going to make a motion to approve so michelle you're new, when we do these, you just have to say yes, so all those in favor or no raise their hands for denial. Okay, all those all those in favor of a resolution to approve with restrictive stipulations. I mean, I guess, okay, if it's since it's beer and wine, I think you kind of have to do that. So four of you have already voted. I can't see ellen, but that's a majority of the committee, so we can go on to the making of the resolution. I think clan drafted the beginnings of a resolution and we can work on what it would say or if there would be additional information. It would start with stating what the applicant is applying for. We go through the elements of the application, as stated in the questionnaire and with respect to what the attorney provided the information attorney, provided that this is a currently unlikely storefront. It counts the number of licenses on the block and in this case rather than I know, clint put in full ops, but I think we should put licenses on the block and licenses within overall licenses within two blocks. Alexandra, I'm sorry to you just refrain while we're making a resolution go ahead. I just wanted to point out that you had made a had a question as to whether or not this was an application for beer or beer and wine. I'm looking at the application that I emailed you guys and it says beer insider and that's an error- we're not probably ever gonna start cider, but it's going to be beer and wine ravi. The application that I have that you sent says beer wine, beer and cider. Oh well, then I sent you something that I corrected and I'm looking at an old one. So I'll leave it at that. So yeah, no, I'm sorry the one, and that was the one that was posted on the website. It did say wine, beer and cider very good, sorry about that you're better than you thought. So I think we should include the awareness paragraph that clint had in about that. This business has been open since may of 2020 and that in the three months of operation that there have been two events or gatherings- and I think that we can- although we can put in that the applicant's attorney denied the second gathering, we have information from the district manager actually talking to the complaints, referencing, the second gathering and the response by her and the precinct in the bid and elected officials from the meeting. They were all attending at the time to the location to address the gathering. But we should include, if clint had that in the short period of operation, they've actually been complaints regarding two events or gatherings at this location or on behalf of this location and then detail. What the complaint letters and marvin appeared to speak about. This alicia also spoke about what she observed, as did herman speak about what he saw on the live stream, but we could speak about what was observed and what was provided by way of video documentation of at least the event occurring on may 31st, and the letters submitted in opposition to this application. Given that the business has already been disruptive and has had these, what they're characterizing is irresponsible, unsafe events, the in addition, the lower east side dwellers submit a letter which also speaks to its current operation, unassociated with the events themselves, in terms of how it's utilizing residential garbage cans for the rails, that are that are actually part of the places that you eat the fries and they submitted photographic. Evidence of that. We can include that the applicant, the attorney for the applicant, the applicant, were given an opportunity to speak and stated that they didn't plan this event, that it happened without their planning and that when and that when- and I guess and I'll rephrase it, but that the lack of planning, including the number of cars that showed up for at least the initial event, the number the use of a dj outside the blocking off of the streets and they just profess, not knowing what the second gathering it is. The and with respect to that event, that was instructed by the police to have people dispersed and have the dj go away that they, you know, follow the instructions of police. I think, if they're saying that and I had included what clint brought up, which is of my own little notes, that this location has no tables and chairs that, even in the explanation of the questionnaire submitted, the table's insurance referenced in the questionnaire to the community board, where the tables and transfer currently exist outside pursuant to ceo executive. But I say eo, I mean executive order. Sorry, I use this message. All the time for my own work and that, rather, there is just a small space that can house only a few patrons with a counter and rails that can accommodate the cones that the one item of for service the fries are or french fries are sorry. I said french, their belgian are sold in that and you can certainly amend what I'm making, because I will write it out in a much more comprehensive in order way that the that the the layout and setup of the business and what it sells is not conducive to. We understand that it's not conducive to the cell sale or really compatible with the sale of alcohol of any kind, including beer, wine and cider that the patrons will really have no place to drink the beer one insider other than to stand up while holding their cones. We also understand that the apron has no license experience and it has himself spoken at length about his experience or in the fashion industry, and nor does he have any familiarity with this area or it's already existing issues with respect to the vehicle, congestion, pedestrian congestion, noise from people, noise from horn honking, because cars can't get down the streets which are blocked and that you know this was evident in the event that was held on behalf of the business and how it exacerbated all of these conditions. And consequently, we have great concerns about the approval of a license of any type for this business, because we have concerns about the ability of the applicant to follow or permit requirements. But we understand that the threshold for the approval of such a license is low and consequently would therefore approve this application with certain stipulations governing the method of operation of the business, and we can go through what they are, but I'll propose them. So what I'm proposing is that the for the first one that the method of operation would be and ellen since you're filling this out under other? It would be a fast food, belgian, fries restaurant with the kitchen open and serving food during all hours of operation. I would propose hours of 1 pm to 12 am all day. I would propose no outdoor state, no commercial outdoor space recorded background music online, the facade closing at 10, no pub calls or party buses, no unlimited, specials, no happy hours, no wait lines and somebody responsible for overseeing heads in life outside alex. Can you repeat the hours of operation? I propose one to twelve all days. That would be okay with me. Does anybody else want to speak to the stipulations or whether or not there should be any additional warehouse clauses? I think this. I think the stipulations were fine. I think. Maybe I and sorry if you mentioned it and I've missed it, but maybe you should just mention. Given the saturation and the late night foot traffic in this area, adding a quick serve take out. Fries would only exacerbate the late night crowds and people on the street sure with their original proposed hours. I guess is mine. I said late night, quick, third, okay, anything else, all right ellen. Did you get everything? Yes, I believe so, do you have any questions about anything for number 15, no wait lines and staff outside death responsible for overseeing people outside okay, so I've made the motion. I guess is there michelle? We can't see you sorry, okay, no opposed, no abstain! That was everybody. Okay, thank you! Robbie where'd! He go I'm because of the type of meeting we're having. I will go through the stipulation so that you have the form tomorrow and I report it to the office and they will mail it to you. Do you want it to go to anybody else? Besides you or just you, you're, muted, you're, muted. Sorry about that. Just me is fine, my email, okay, all right, so the office is gonna, send it to you, va email tomorrow, okay, thanks very much for the morning or the morning of wednesday, but very quickly. You're welcome have a good night all right. Moving on to number four number: four is the old key license application for 64 second avenue? The llc is the Bronx brewery llc. This is a location that has not been licensed. The sla notice says tavern, with small pilot brewery system on site recorded music and no outdoor space. On the ground floor, the cfo is 74 with 18 tables 59 seats, a 20 foot bar with 10 stools proposed hours are 11 a.m to 12 a.m; sunday through thursday 11 a.m to 2 a.m, friday and saturday kitchen open all hours serving this is the applicant wrote the swedish street food but then also wrote primarily burgers accordion doors and windows, two tvs recorded music and djs at background and entertainment levels. It says, entertainment, level, music would be played at events and dj nights and then djs and other events would be two times per month. Security for promoted or ticketed events intend to install soundproofing, or I think, what it actually said was soundproofing is being installed now. No pub calls or party buses no happy hours, no agreement about no wait lines outside. In fact, there was a statement as part of the questionnaire with a plan to address waitline staff, had an agreement to have staff responsible for overseeing crowds and noise outside the applicant listed 19 ops within 500 feet, but submitted an sla report that listed 20, and there are 20 per my count as well as four pending ops within 500 feet. The applicant has operated the bronze brewery at 856, each east 136th street in the Bronx since 2011, with an op license issued september 21st of 2018 submitted a applicant submitted a letter of public interest which in some said it would be one of two breweries in Manhattan, which would provide patrons unique access and perspective to the beer making process. It would showcase up and coming creative. The word used by the applicant with activations also were used by the explicit through two new releases per month, which is something that currently exists as its business that it operates now and then also said. It would redouble its efforts to support creatives and also included in the statement the need to have alcohol for people who have allergies to hops and gluten intolerance. An applicant also submitted a letter from the Bronx overall EDC. That's an economic development committee, saying the business opened in 2010 and has been a destination location and is supportive of the business. I notified the business that it's within 200 feet of a church. It did check off within 200 feet of a church or school on our questionnaire, but wrote in that it believed it was in close proximity to school. So I notified the applicant that it was within 200 feet of iglesia de cristo, which is the east side church of christ, which is located at 56 second avenue, and it's been open for 47 years and that's it. The now is this is the opportunity for the applicant to make a presentation or a statement about your application or to clarify any of the information, most of which is information you provide in your questionnaire and your letters. Thank you. I appreciate that yeah. The only real point to clarify was that I did, as I mentioned in the questionnaire during my walk through the neighborhood for purposes of filling out. The questionnaire see the school that was within 200 feet, but also not shown on the sla's proximity report, so that was the reason for the confusion there, but no other than everything. You said we have been in business since 2011.. The idea behind this was to bring you know a bit of what we've been doing up in the south Bronx down to the east village. We've been incredibly supportive, local artists. The word I use as creatives because it kind of span a bunch of different mediums, but that's really what we want to do with the space use beer use. The venue is a platform for local artists and creatives through collaborations through activations, like you said, so, that's really the intent. We will have a small brewing system located in the venue that will be visible to the public, obviously separated as required by the sla and the federal government, but the I. The idea is to encourage interaction between our brewing team and guests that they can learn about what goes into beer, the beer, making process etc so happy to answer any questions you have about what we're looking to do in the space and I'm excited to be a part of the neighborhood okay. Has anybody signed up to speak clint? No, let me just glance through and make sure there's no one new, but no one had is there anybody from the committee that wants to make any comments or ask any questions, the artist? What is the artist's performances? What category are those and what do they would they do in this space? So the artists that we've worked with for the most part in the in the south Bronx have been visual artists, painters, poets, we're doing some work with the tattoo artist, principally collaborating on label designs for the beer. So these new releases that I mentioned taking place twice a month. The idea is to work with a local artist, typically in conjunction with some sort of non-profit or community organization, and to donate portions of proceeds from the sale of that beer. So the artists that I mentioned are generally involved in the creative elements around the beer in terms of performances. You know we do salsa nights up in the Bronx. We do occasionally have djs but yeah. The artists that were mentioned are generally in collaboration around the beers and the stories themselves around here. Do I have a question and then I have a comment yeah. So the question is that in March there were two two articles in social media that spoke to the opening of this business and identified it, and it appeared that they were speaking either to you or somebody that was speaking on behalf of the business. The reason I say that is because both articles one came out on the 13th one was on the 14th of March. Both spoke about the excitement of moving the business from or having a smaller version of the business that was in the Bronx in the east village that it would be a two-story venue with live music performances and that you proposed having some sort of meet and greet before construction began on the location. So I want you to speak to, and I can tell you the one was called vegan Brooklyn surprisingly, and I think the other one was called six square feet. Okay, yeah. Could you perhaps speak to those proposals that were in the media sure which don't seem to be included in this but seem more consistent with the existing business yeah? So I think the concept initially was to have it be more of a venue for a lot of performances. I think, as we have sorted out the layout with the architects, but that is just not going to be feasible, so I think, while we would have liked to have had, for example, live bands for salsa nights, the space just won't allow it so was something that I think we had initially intended for the space, but not something that we're going to be able to do given the confines and the meet and greet was really something that we wanted to do just as a way of opening our doors to the neighborhood. You know long before we open down there. Unfortunately, I think we made the announcement right as we were entering lockdown. So obviously did not carry that out. Okay, thank you. So then, in the comments can I just make that comment. The comment I was gonna make is I work in the Bronx I'm familiar with a lot of the neighborhoods in the Bronx, I'm familiar with morrisania and the port morris section of the Bronx, and I can see just in looking at your location and looking at it, whether it's on the sla website on the lamp map or looking at it on a street view that it's in a warehouse, it's not surrounded by a residential area and it's not surrounded by any licensed establishment. So the location sort of lends itself to what you do now, whereas what you want to do here is bring that business, even if it's in a smaller format to what is essentially a 1900 residential like mixed-use, residential building in an area that is packed with people, whether they're people who actually live here or people who come here. I get the draw of wanting to have your business here because of the people who come here, but we're not underserved by beer places, including craft beer, places that are locally sourced, so that they're getting the beer from breweries that are coming from Brooklyn, if not Manhattan, and we're inundated with places that call themselves breweries and provide us that service. So while I appreciate that you want to bring this business to this community, I don't know that this okay and the location's two doors down from a church which is its own issue. I don't know that this is the right location to have this type of business, and I think you're gonna find if you attempt it that you're going to have more problems than you'd care to deal with and that maybe a better location for this business in this community might be houston or delancey street, or even just off either of those streets which have much more of an industrial slash residential character than this location, which is residential with commercial overlay. Yeah. And I thank you. I appreciate that we've actually reached out to all of the tenants in the building our landlord is in the office is immediately above our location and above them there are eight tenants, we've reached out to all of them and they all voice clear support for what we're doing. Okay, thank you go ahead. Clint I just laura sewell has her hand up if you want to go ahead, lauren if you have some a question or something to say, I'm just playing catch up a little bit here. I have to say I completely agree with what alex has said. I guess I was startled to find it was a full liquor license because I just saw a brewery in the name and assumed it was a beer wine. But you know we have I'm just thinking of second avenue. We have a couple of places who have expressed interest in that type of model, and we really we really pull it back to straight restaurants. It just seems in historically when we've had people come in, who want to create a certain scene. You know, and yet we're saying it's really not a suitable location that it's already very crowded area with a lot of restaurants and a lot of service to bring additional congestion to the area you know is in an unlicensed location when there are so many licensed locations to choose from. I don't know when you did your search, but we we're hearing all the time about businesses that we're losing and just to add another license to the to the neighborhood is generally something that my organization opposes and it you know, according to a 500-foot rule, it just seems that there's a lot of disconnects between what you want to do and the space that you want to do it in yeah. If I, if I could, I mean, I think what we more than anything want to do is bring a small brewery system down to the east village, and I understand there are other locations that sell beer and craft beer, none of which are actually producing beer on site, and I think, more than anything, that's we're looking to do looking to have a full kitchen serving food with the product. Certainly not trying to create a scene other than having a brewery that you know has music and food and as a place to showcase little local artists and creatives. I mean, I think why, may I ask why you are requesting full liquor, yeah previously unlicensed location in a famously oversaturated area? I mean, if you're familiar you're from you're an experienced operator, so you have to be aware that there's yeah so and as alexander mentioned so we've been in business since 2011. We didn't apply for and receive an op license until a few years ago, up in the south Bronx and the reason we did it's less than 10 of our not even 10 of our sales. Very much more. You know, first and foremost, a brewery selling our own beer, but we found that people did not want to come to the to the brewery they did not. If groups wanted to come, if you wanted to come with a spouse or a friend that was allergic to hops or allergic to gluten, there was just nothing to offer them so wine yeah, I mean I think we would very much like to sell wine. In fact, we saw probably some more wine in the Bronx than we do liquor. So this is also an argue, an argument that we hear all the time. It's only this little tiny portion of my sails, but I have to have it and again, that's fine, if you're in an area where there is that's not so over saturated with licenses and on a main road that gets clogged with both pedestrian and vehicular traffic on the weekends. I guess you're, probably hearing that, though, from businesses that don't produce beer as their core element of business and that's what we do and that's more than no I'm sorry, I don't mean you have not answered my question. I'm asking you specifically why you're looking for full liquor in an oversaturated area, you can bring your craft beer concept to an oversaturated area, your brewery concept, to an oversaturated area. Without full liquor, so I'm asking a specific question and I just haven't got the answer to the question is that we want to be able to offer something other than beer to people that do not enjoy beer or that are allergic to it and want to provide as much option as we can. Okay, in my mind, that does not define public benefit and to my understanding that does not define public benefit you're, bringing the concept that you're bringing is a brewery. That's the public benefit you're offered offering doing that doesn't require full liquor. That's just! I can't see it any other way. Thank you laura any other committee members or anybody else who raise their hand, but no there's no other hands raised and not no one in the chat. So we're good. Do you want to discuss the making of a resolution? Well, I mean I would move that you know we. I personally think we have to deny this simply because of the it's within 200 feet of a church and possibly the school that without any of the other issues that have been brought up. That alone, I don't see any way we can get around. That I mean that's conversation. I don't know what school he is referring to if it's not on 2nd avenue. The only school building on 2nd avenue that currently exists is lasalle's old location which is empty and then any other schools are actually on the side streets. So I don't think, and you can certainly name the school. You didn't do that in the questionnaire. But if you'd like to see it, I don't think that there is any yeah. It was in the questionnaire. It's the nord anglia, international school, that's around the corner, not on second. So it's not it's not on second avenue, so the only proximity, the only the church of school that is relevant for us for proximity, is the one that's located on the same street on the same side of the street as this business, and I agree with clint, I can go to the making of a resolution. Does anybody disagree or want to speak to an alternative resolution not hearing from anybody everybody's blacked out, except for hermann, so I'll make a resolution? Thank you, herman. It's going to be a resolution to deny which begins with awareness clause stating what the applicant is applying for that what the elements of the application are. What is the statement of public interest was, which I summarized that a submitted statement of public interest that it submitted a letter in support from the bronze overall EDC, and what that letter said. The prior experience of the applicant operating the location that is in the Bronx, the address of the location and when it was issued of an op license at that location, identifying the location, that's on 2nd avenue as a previously unlicensed location and also identifying it as a mixed-use residential commercial building built in 1900, it's five-story mixed use. I got it from the dov website residential commercial building built in constructed in 1900, whereas that we recognize that this location is within 200 feet of a church and in fact, it's two doors away from a church that ends up being the east side. Church of christ, which is located at 56th second avenue, also identifying the 500 foot cut seminary, which is which the applicant identified as 20 licenses within about 500 feet. In addition, there are four pending licenses per the sla lamp map, and then I would put in how the location of the existing business, which is what I said in a warehouse in a relatively isolated industrial section of port morris in the Bronx surrounded by no other license, is markedly different from the location is proposing to occupy, which is the 1900 building in a in a densely populated area that, furthermore- and I I'll add in because we- I didn't- have it before that- laura that a representative of the east village community coalition, which represents tenants and businesses in the community, spoke in opposition to this application or to the issuance of a full-on premises like license for an application to operate a small pilot brewery and to the the reasons stated by the applicant during its hearing, which is that it want to be out. It was asking for an op license because, in addition to being able to serve people who were intolerant- and it had allergies that wanted to have the option of, I wanted to have the ability to provide more options to patron. And then I also say that we're in an area that's well served while we don't have a brewery. Well, we're well served with businesses that serve beer that serve craft beer that serve locally sourced beer, whether it's locally sourced from new york state or new york city, whether it's coming from breweries that are in Brooklyn or other boroughs of new york city and given that we're well served that the location is already that the location is mixed: residential, commercial in an area, that's residential with commercial overlay and a dance population that the location is currently unlicensed and within 500 feet of numerous locations. And given that it's so close in proximity to a house of worship, we're opposed to this application. I actually separated out anywhere else clauses which I think is more appropriate. That first were opposed to this because of its proximity to the house of worship and then second, we're opposed to it because for the other reason- and consequently we move to deny just because I think, if they're dating them separately, does anybody have any amendments or a second? If no amendments out? Second, okay, all in favor right! No opposed no okay. Thank you, yeah. If I might actually just for purposes of guiding my application of the slas, would it be possible to I guess what I'm hearing is that the community board would be in favor of a wine insider licensed at this location with the brewery, or do I need to submit a secondary application for those purposes, or is that able to be part of the resolution? I don't think I don't think we could. I think you should submit a new notice with a new application. If you I mean you go back and you consider whether or not that's feasible for you. Okay, all right! Thank you. Okay, thank you. Take care all right. Moving on to number six number. Six is an application for 10 degrees. That's an op license for an application for 10 degrees, which is an existing business. At 121 day marks place. The sla notice says it's a tavern cocktail bar with full menu recorded music and no outdoor space on the ground floor. We denied this location. I believe it it's this business in January of 2004.. We then denied it again because nobody appeared in July of 2006. At that point, the application was to add a partner and change the business name to 10 degrees. We heard this business for a renewal with numerous violations in April of 2007.. I actually have them written down, of which there were many, so there were violations for sales to minors, as well as for noise, as well as for exceeding occupancy, as well as for prohibited sales and part, or all of that resulted in what's called a nuisance abatement for anybody who's to the committee, an audience who's unfamiliar with a nuisance abatement. That's where the city seeks to close down a business because of violation but the business and reopen it with stipulations or part of the settlement regarding its method of operation and with fines for how the business has been operating. That happened in June of 2006., and we we were going to in essence approve the renewal with stipulations that the business continue and bought to abide by the settlement. Stipulations from the nuisance abatement that had been constructed with the city- and I don't have them outlined here- I'm sorry and closed its default at 10 pm sunday through thursday, at 11 pm friday and saturday. The applicant then, would withdrew that was the committee recommendation. The applicant withdrew before the full board vote and then, although it appeared on the agenda on at least one subsequent agenda, it never actually appeared before the committee again to be heard. So there was no resolution as a result of that recommendation by the committee. This application has no cfo listed 15 tables, 49 seats, then in a diagram it appears it's 15 tables and 33 seats consisting of chairs and couches and 10 16 seats consisting of stools at a at the bar. The bar is 10 feet by 8 feet by 10 feet. The hours of operation are 4, am to 4 am monday through thursday 2pm to 4am, friday and 12pm to 4am saturday and sunday. It has a prep area serving small place all hours. It says french doors, but the facade opens completely and has for a long time no tvs recorded background music. The applicant states that it plays the music at a decibel level of 80. no promoted events scheduled performances or covers no traffic or a sidewalk plan. According to the applicant, it wrote in it does not have crowds existing sound proofing, private parties on occasion on occasion of the phrases by the applicant, no pub girls are party buses, happy hours to 8 pm and 11 pm to 4am sunday through thursday. There was an amendment to that. We got today, which I will read to this application. No wait lines and staff outside the apple chain count 18 02's within 500 feet, and this application consists of one principal who has worked in the business since 2006. on the sla website. The op license was issued, may 5th of 1987., and I, like I said I have outlined the violation history which, when we heard the applicant in July of 2006, they stated that all of the violations were for were from the partner who had previously operated the business and not for that person. And then I also have some information that I gathered from social media that I can speak to in a minute and I will say the applicant says 18 licenses within 500 feet. There are 10 ops on this block, including the applicant, including the location. There are 11 and it says 14 licenses on the block. 11 beer wine licenses on this block, so 22 licenses on this block consisting of beer wine and fall. There are 30 ops within 500 feet of the solicitation, and I believe I counted two three excuse me pending op licenses, I wrote it in my draft and then the the amended application says it's seeking to have live music for new year's eve only and happy hours to 8 pm. It's stressful language, that's at 11 pm to 4 a.m and those are the differences in recommended applications or it's amended page. Excuse me all right. This is an opportunity now for the applicant to speak or to make a presentation or clarify any of the information that was provided. Yeah. Thank you alex. Can you hear me? Yes, thanks good evening everybody donald bernstein, I'm the attorney for this applicant. First, as alex mentioned, the information we have gotten has indicated that this location has been licensed since 1987 continuously. Therefore, just for the record, it is not subject to the 500-foot rule is not subject to the public interest test. The transfer application that we will file and it will be filed as a transfer application is required to be approved, absent, good cause shown the information that we have. I only have information going back to 2002. I think then it was called open air. Then around 2005 it became morrissey park and not 10 degrees. It was not roof. It was not operated as 10 degrees. I think until 2007.. Mordechai hassan is my client and I think he's on the phone he bought in to the business in 2006. So the violations that you're, referring to including the nuisance abatement, which was in 2006, were all based on incidents. Excuse me in violations that occurred prior to the time that he became the owner, and I just wanted to make that clear. This is a transfer, so mr hassan is the majority current owner of the current licensee, which he owns together with a relative. He owns the majority interest he is now his relative is not going to be involved in ownership anymore. He has found another partner ilioshenko and rather than doing a corporate change, they are they've decided for various reasons, to form a new entity that new entity is the applicant before you and we will be filing as a transfer. So multihassan, who is going to be a 50 owner of the new applicant, has been the person that has been operating and owning 10 degrees since 2006 and the operation is not going to change it's going to remain as 10 degrees. There are not going to be any physical alterations. The place is currently closed. It's going to going painting and remodeling they're going to fix it up. Then it will be open. The operation will remain the same as it's been for 20 plus years with a 4 am close seven days a week. The maximum number of seats, I believe, is 49 seats. The 500 the area survey just to make a point of it that we have, and we actually had someone go out there and walk the neighborhood. We have a listing of 18 licenses within 500 feet. Pending licenses, do not count at the sla beer and wine licenses do not count at the sla. I don't know if there's anything that he's missed, but we have a total of 18 within 500 feet that are licensed and active. What did I want to add just to clarify and the staff that he's had working there for years are all going to remain so from the outside nothing's, changing it's going to remain as 10 degrees, just clarification alex for new year's eve, not looking for live music. Looking for dj, so during day-to-day operation, it will only be background. Recorded music, no live music, no dj, just a dj on new year's eve. With respect to the french doors, we would agree to what you have in your stipulation that they would close at 10 pm every night and that they were closed whenever there's music, so we have agreed to that. Okay, thank you. Does anybody want to speak to this or ask any questions? No, okay. I will I will say that on occasion I have walked by there and seen a live performer, so I appreciate that you just have recorded music recorded background music. No dj's live music in the application. I just want to note that I myself have actually seen a live performer, usually sitting on a stool, usually right at the front of the building with of the business, which I noticed, because the facade is completely open, so I don't know whether or not you want to speak to that at all. But if you are saying that you're only having recorded background music, then that's fine anybody out. No I'm! I don't have any questions or comments. Okay, so I'll go to the making of a resolution, then what the applicant is applying for that this is a new corporation with an existing principle and a new principle. That is what the elements of the per the applicant is going to maintain its business name and staff. So the next layer of clause would have what the elements of the application are. What the applicant history has been before the the community board that the original license. As noted on, the fla website was issued, may 5th of 1987. the account for the applicant and the count for us with respect to number of licenses in the area and that the existing principal has operated this business since 2006, whereas, given that the business method of operation will remain the same and retain the one of the existing principles of the present business, we would approve with, or we would deny unless the applicant agrees to the following stipulation, which is that this would operate as a tavern cocktail bar with a prep area serving food during all the hours of operation, or rather it's on the stipulation it would be less than a full service kitchen with hours of operation of 4 a.m, to 4 a.m, monday through thursday, 2 p.m, to 4 a.m, friday 12 p.m, to 4 a.m, saturday and sunday, no commercial use of the outdoor space, closing its facade at 10 pm or when any amplified music is playing. Having recorded background music, only no promoted events no scheduled performances. No events with covers no live. Music, no live dj, no djs, with the exception that it may have djs on new year's eve, no alteration without first coming before the community board will not host pub calls or party buses will not have unlimited drink specials, we'll have happy hours to 8 pm and we'll have no wait lines and have someone responsible for overseeing crowds in those websites. Okay, is there an amendment to this motion or a second just to let you know jesse just had to leave so he threw past pasta minutes on to me, but he is no longer with us, so don't be for his vote. Okay, so five, yes, zero, no, zero abstain. Okay, donald I'll send the office will send the stipulation to you either tomorrow or wednesday morning. Okay, is there anybody else you wanted to go to, or should it just come to you send it to me I'll circulate. When do you need it back by the office? Will send you an email as soon as you can? I think they usually say by friday, but it'll be included in the email that you get sent sounds good. Okay, thanks! Everyone good night! All right, moving on to number seven number, seven is diner restaurant at 162 to 166 second avenue. This is it says an op license application, but this is an upgrade application of an existing business. The applicant here, the application. The attorney is that correct? Yes, they were both signed in. I think they're both here. So the sla notice says this is a restaurant, with a full menu, a hookah bar belly dancing on fridays and no outdoor space on the ground floor. The previous well, there's a history with respect to the previous applicants, which was also a hookah bar, but this applicant itself was administratively approved. A wine beer license in september of 2015 with stipulations operate a full-service balkan restaurant serving food within one hour of closing having hours of operation of 2 p.m, to 12 a.m, all day, not using outdoor space closing and it. This is confusing. So this is closing at sidewalk cafe at 10 p.m, employing security, friday and saturdays having it wrote in that it would have, or already has sound proofing on its administrative approval, stipulations. Closing his father 10 pm playing recorded background music, not seeking an upgrade not applying for an alteration without first coming before the community board, not hosting club calls or party buses, not having happy hours, not having weight loss and having staff responsible for overseeing crabs and noise outside. So the original application did not include that this would be a hookah bar with belly dancing. So that seems to be a change in the method of operation. The application that was submitted says the cfo is 46 with 13 tables and 44 seats. A 16 foot bar, but there are no stools specified or listed on. The questionnaire proposed hours, are now 10 a.m to 2 a.m all day. So now it's an increase in hours, a kitchen open, and it has hours unspecified in no food type specified one television recorded background music, no promoted events scheduled performances. Events with covers, although the applicant didn't check that it was agreeing not to have these things on the stipulation on the back of the questionnaire. No security, no sound proofing, no pub calls or party buses, no happy hours, no wait lines. There's no agreement about having somebody oversee people or noise outside the applicant encountered one op license within 500 feet of the location and identified that license of the deer. The liquor store: that's right next door to it and identified itself as within 200 feet of a church which is saint mark's church on the bowery I counted, 25, ops and one pending rp using the sla lamp map, the license the beer one license was issued, January 14th of 2016- and I guess there's confusion here, because the business seemed to oh there's, confusion on my part, but then it seemed to close in december of 2018. So I'm not quite sure what has been going on with the business in the time since it opened and now the other thing is that the existing hours of operation appear to be 1 am 2, am 3, am if you look at social media or places where there, where it references the take out service for this business and list just hours of operation and the website. Our facebook page says that it has belly, dancing, tuesdays and fridays. Okay, all right! This is now an opportunity for the applicant or the representative of the applicant to make a presentation or a statement regarding the application or clarify any of the information that I summarized good evening. Everybody. My name is edward mussini, I'm the attorney for the applicant. I just wanted to clarify on the application. The actual hours of operation would be monday through friday, 4 p.m, to 11 p.m, and the weekend it's 4 p.m, to 12 a.m. That was a mistake on the application, so I don't know if there's an increase in hours and the belly dancing would be one hour from 9 00 p.m, to 10 p.m. On friday night, only for one hour with respect to the closure in 2018, perhaps my client can explain that. I I'm not I'm not aware of it that this business is, as you said, has been in restaurants, been in business since 2015., it's had a a beer and wine license since 2016 and we're just we're seeking an upgrade to a liquor license madrid. Do you? Are you there? Yes, I am. Can you just before he speaks? Can you just tell me what the amended saturday sunday hours of operation are? Please? Yes, the amendment it is monday through friday, 4 p.m, to 11 p.m, and on the weekends, 4 p.m, to 12 a.m. Hours of operation. Okay, thank you welcome. This is your opportunity to say something. If you want to do that, yes, hi good evening, everyone can you hear me? Yes, yeah, okay, yes, our operations are from four to eleven during the week monday through friday and then on the weekends. It is from four to twelve. We have belly dancer, one belly dancer for an hour from nine to ten just for entertainment purposes, because it's a mediterranean cuisine. Restaurant we've been in business for about five years now, we're just looking to upgrade to the actual full liquor license. If it's possible, because of a lot of our customers, are always asking for it. Madrid can you talk about the closure in 20? Was there a closure in 2018 as alex it was? Yes, it wasn't a full closure. We just revamped the place. Basically, what we did was we had it closed for about. I would say three to four weeks because we painted the inside and just installed some. You know padding for the soundproofing just to have it in case, for you know for the tenants that live upstairs, you know we haven't, had any complaints, thank god, but we've been abiding and you know very polite to everybody. That's in the neighborhood also, I mean I personally grew up in the neighborhood. I've been there all my life since I was two years old and I currently still reside there. So that was the reason why the store was closed for about, I would say, close to a month. What we did was we painted it inside. We just added some different kind of accents and things. Okay, could you perhaps speak to the enclosed outdoor area? Sorry enclosed outdoor area? Well, we have. The thing is we have a the property line gives us about nine feet that belongs to the store and the only area that was just it's on enclosed. During the winter time we have the actual schematic scheme and everything from the building department and the dlt. That shows that it belongs to the actual building, because every other building is 10 feet away, meaning you know opposite of it. So that's the reason we have that enclosed area, but we only use it for entrances purpose like a vestibule type thing. So when you do going into the winter time it doesn't bring the draft and the cold air in. Do you have a permit for the enclosure? Excuse me, you have a permit for the enclosure. Yes, we do to use the enclosure as a vestibule. No, the enclosure is on our property line, it's not on the city's property. Now I understand that the so the you're saying you're using it as a vestibule, but you have a permit to construct that I mean it's a massive tent. Essentially, you have a permit to construct that tent on the sidewalk. Even within the building line, we have permission from the building and it's not actually from the building. Do you have a do? You have permission from dod if it's within the building line to construct the tent, you have to have permission from the ob correct, but it's not a constructable tent. It's just panels that go up and you could take them down. That's it's. How can I explain their cloth panels? I no. I appreciate that. I know what it looks like because I see it every winter. Okay, are you treating that as indoor space, because you referenced that you have no outdoor space, but that's a pretty sizable outdoor area and it also has tables and chairs what we have previously we have used. It should be on the application, but we do not serve alcohol on the outdoor area, meaning beer and wine. We only do it on the interior, but now that everything is you know previous to covert. Yes, now that kovit is, you know we're dealing with everything we only have about right. Now, it's about five tables, I would say, on the outdoor area. What's your regular use of that space, because your questionnaire doesn't include any reference to outdoor space and neither does your sla notice and neither one of them asks if it's a sidewalk cafe versus within the property line, but rather it asks, do you commercially use at the outdoor area or any outdoor area? So what exactly is the outdoor use, not during cove at any time? What is your existing outdoor use? Sidewalk, I mean sidewalk, meaning tables sit down and eat yeah I mean what are the number of tables and what are the number of seats and what are the hours of operation of the outdoor space? Well, the outdoor space is until 11 o'clock it's from 4 to 11.. Previously it's been from the actual hours, which was previously. It was one I mean I'm talking about four years ago, but now our operations for the past three years have been from four to eleven and then on the weekends it's from four to twelve, but our outdoor area closes at eleven o'clock. Okay, and what are the number of tables and chairs that you usually have there? There's four tables and each table has two chairs, so total, eight. Okay, all right! Thank you. Does anybody else have any questions. I don't really think so. No I mean I don't laura raised her hand, yeah go ahead. Mom yeah, I'm just I'm confused about a few things here too I'll just say that is it. Are we talking about mehani there's a it's dinah restaurant is not on the sign right now. It says: mahani! That's the restaurant. At 166 second hour, it's 162 to 160 yeah, it's a very big, it's very big and it's right next door to op me liquor right. So it's I'm just I just. It seems a little strange to me that the name on the restaurant, like if I as a person that lives in the neighborhood- I don't know that it's dine, I would not know to go to dinah, except that I know dinah was there before so right now, there's a different name on the restaurant, so I just feel like that probably should be addressed. The church across the street is the church across the street, so I don't know that full liquor is even an option, but there are certainly a couple of issues. Just with the you know, they've been operating outside, which is fine during the cove vid. I don't know. If they are, I don't find them in the open restaurants program if they did an application with dlt. That's what everyone was supposed to do to use the outside space, so I'm just again just a few things that don't seem to be connecting and there's way, there's far more than eight seats out there I mean I passed by you know it just I don't know why we're under representing what's happening there, there's nothing wrong with what's happening there, but there's there are several tables and chairs and it's outside and then yes in the winter it gets enclosed and nobody sits at them because it's winter and it's not heated and the decorations just sort of stay inside the enclosure. But of course the enclosure should be it's. It is supposed to be a deal a dov permit to have an enclosed enclosure, even if you just use it as a vestibule. So just there's a few things here that just for somebody's who's been operating for so long and has neighbors who are doing all of these things. You typically would expect them to have caught up with the paperwork. So I'm just I'm just wondering if you're saying it sounds like there's a lack of understanding of what's required. Madrid. Yes, can you answer that question because I haven't been there recently well on the tables outside? We only have four tables. I even have camera systems. I can even actually submit photos of all the tables outside right now I mean on my end and as for any other questions, meaning for the dlt. Yes, we have also we filed for DOT. They gave us the approval and we also have all the emails that we've sent to them and compliance with them for the sidewalk permit. Okay, it could just be the discrepancy and the name, but I'm looking at a photo right now on your website. That shows is this your website, or is this just google that shows like 12 chairs? At least I just I'm, which is not that's, not necessarily a problem? I just don't understand why you're saying something different from what I regularly observe. I live in the neighborhood. I know what it looks like and so dinah dying a restaurant on yelp is closed and there's this mojane that's open, but I don't. I don't know that I'm just not hearing answers about why that is either it's. What what's going on is it's still on operating under dina restaurant? I haven't changed, dina restaurant, the name on the front, is a different name. We just changed it to try to revamp it and figure out what we're going to do, meaning with like the menu wise, and I mean our paperwork- is still dina. Okay, so you know if you, google, dina on yelp, it has you as clothes. That can't be a good thing for your business and it looks nice. I'm not! I'm not. Thank you. I appreciate it disputing any of that. I just don't understand why you know. Typically, you would you would change your name officially before you just put a different name on your it's just it's a it's very unusual. I do this for a living. I attract the businesses in the neighborhood and what's going on, is very unusual, so I'm just trying to understand it. So that was basically the go ahead. I'm sorry no go ahead. So what happened with the name wise? I mean the business is still operating under dina restaurant. So what we did was we just changed the name to figure out exactly you know. Being me, it's like a upgrade basically trying to figure out trying to go with the. How can I say with the area what the people are asking for, so what we did is we've revamped, also our menu and made it a little bit more simpler than what it was. Okay. What is this? What is the business name? Now, I'm sorry, the business, the name on the store is mahona. Can you spell that plan sure? It's m e h, a y e. It's and you said you revamped that I'm so sorry h, a n e okay and you said you changed the menu. You didn't submit a menu, whether existing or revised, to make it simpler. How have you changed it? Well, basically, we took 30 items from the menu that were the most popular and we broke it down because there was a lot of food wastes. You know so we're trying to save, and you know not spend as much money as we have in material wise. So what we did was we took the most popular dishes off of our menu and made our menu smaller. Okay, all right committee members. Do any of you have any questions or comments following up laura regarding the name wasn't establishment fined by the sla for not operating under its trade name, trade name, it doesn't have any history on the sla website. You would have to ask the attorney wait. Herman, do you mean this establishment or a previous or a different step? Just the other day? I was reading something yeah two days, maybe three days ago. Yes, actually, I think it was maybe set las. That was one of the charges against them right. Well, there are many businesses that don't have aren't operating like if you look at their licenses, their licenses aren't consistent with what their business name is and, in fact are pre-existing businesses. This one doesn't have any sla history, though, or disciplinary history that I can see. So do you want to discuss the issue raised by the applicant himself, which is the proximity to st mark's church and how st mark's church has been viewed? I think a long time ago, when there was an assessment about the whether or not the church was exclusively used as a house of worship. It failed that test. I don't know if there's been a re, I don't know if the sla has been asked to assess it as whether or not it's primarily a house of worship. I mean we all recognize that it's one of the longest standing churches around, not only in new york city with consistent church services, so it may assess it differently under that standard than it did exclusively as an exclusive house of worship. So I would, I would like to suggest I know in the past, there's been a couple other businesses within 200 feet and the sla has ruled that this is not exclusive. I would just like to suggest that we make it a note in our emotion that you know the sla, evaluate or consider if this is a legitimate or exclusive. I guess is their word house of worship. Well, now it's pr predominantly or primarily a household, that's the standard as opposed to exclusive it used to be exclusive. Okay, I think the application states it's three- it's 310 feet from saint mark's in the bowery church. The questionnaire also kicked off that it was within 200 feet of the church, but it's basically across the street. Well, we have a state. I submitted the statement of area plan with the application that has been filed prior a prior occasion with the sla and the distance is 310 feet. Hopefully that's with the application, because I have it in my copy. I didn't see that so maybe I missed it yeah. I added the 500 foot law statement and it's in the statement of area plan 200 foot law. I think we can include so I think we can include two paragraphs that say that there's a an issue with respect to its proximity to a house of worship that being saint mark's church, the bowery that the applicant has stated and submitted a proximity report indicating that this house of worship is 310 feet from this location and that the community board understands that in the past the fla found that this is not exclusively a house of worship. However, the community recognizes that it is primarily a long-standing house of worship with contingency which is continually held services during its years of operations and asked that this, the proximity and this used to be evaluated by the fla and considering this application. So do you want to go to making a resolution that would be to approve it with stipulations or to deny it, and if we're going to move on to making an application, that's going to be approved to approve stipulations I'll go through with the elements of that application should be anybody. Can I have a straw poll go ahead, I would I would recommend- or I would suggest we approve, given the reasonable hours of 11 pm and 12 am on the weekends, and I actually would like that's one thing that I'd like to clarify you're, saying on the weekends. So you want 11 on friday and you want 12 on saturday and sunday or typically when people refer to the weekend hours of later they'll stay later on friday, night and later on saturday night, with an earlier closing on sunday night. So when you say two nights on the weekend, are you referring to friday or saturday or, as you previously mentioned saturday and sunday? No, I'm referring to fridays and saturdays, I'm sorry, okay, so sunday through thursday, it would be until 11 p.m and then friday and saturday till 12 a.m. Correct, okay, yeah! I mean, I think, still to reiterate what I'm saying earlier, that given the reasonable hours there's no complaints, they you know, seem to be operating, you know and not being any kind of problem or nuisance to the neighborhood as long as we're, adding in the stipulation for the sla to consider the church in their recommendation or their determination, and I would recommend we approve with stipulations, okay, all right. So then the resolution would be the awareness clause stating what the application is applying for, which is a change in class of its wine beer to a full on premises. Liquor license what the elements of the application are, that the method of operation- and I would put before the elements of the application, but that the review of the questionnaire and sli notice indicates that the method of operation now includes a hookah bar and belly dancing monthly. What the elements of the application are. The next paragraph would be that it was administratively approved in september of 2015 and the stipulations that include to then when the wine beer license was issued. This was January 14th of 2016., the number of that the number of licenses within 500 feet. From my count for the applicants count and per my account, I counted 25 and one of one pending, though, that the application, the concern about the proximity to st marks in the barry church, the applicant statement with respect to the proximity report they submitted believing it's 310. People from the church are asking that it be evaluated and our understanding that, in the past, the fla, but that this church is not exclusively used as a house of worship, but are asking that it be evaluated as part of the liquor license. Because of the community's belief, this primarily is a household worship and has been a long-standing historic church which is continuous, continually operated with services. Since it's been an operation that given this business, has been operating since 2015 or 2016. with as a full-service restaurant and is continuing as a full service restaurant with moderate hours of operation, we would approve ogenai unless this applicant agrees to the following stipulations. So here it would be a full-service mediterranean restaurant which, with the kitchen, open and serving food during all hours of operation, the hours of operation would be 4 p.m, to 11 p.m, sunday through thursday, 4 p.m, to 12 a.m, friday and saturday and ellen is probably gonna have to go on the bottom, but it will operate outdoor speeding within its building line, as consisting of four tables and eight seats with hours of operation of 4 p.m, to 11 p.m. It has a the facade of this. Business is fixed, I've never seen it open, so I believe it's sick, but I'm just asking it's made out of plate class. I'm sorry can you repeat that I didn't hear it? Can you speak to whether or not the facade opens of the business? It looks like plate glass. That does not open, but can you can you just clarify that for me, please the actual doors, no, the, not the doors but the windows all along the facade yeah. They can open correct they're like a bifold door that actually you can open. Okay. So then closing at 10 pm playing recorded background music, not having dj's, live music, promoted events scheduled performances or events with covers and allowing for belly dancing between 9 00 pm and 10 p.m. On fridays, or one belly dancer from 9 p.m, to 10 p.m. On fridays, this I have to tell you has to be part of the method of operation of the business, because under the existing zoning you can't have scheduled performances. So you can't have a pro. You know something that you advertise as a performance at 9pm, even for an hour, because the zoning doesn't permit it. You can have a dancer, that's part of the existing method of operation of a restaurant that comes in and dances for a period of time. You know just like. Sometimes, restaurants have musical accompaniments that aren't considered to be scheduled performances, but there might be like a violin player during brunch or something like that. Correct, no problem, no alteration without first coming before us, no club calls or party buses, no unlimited drink specials with food, no happy hours, no wait lines and somebody responsible for overseeing patrons and noise outside. Is there any amendment to the up to the resolution or a second? I always second it. Thank you michelle all in favor hi. We should send the stipulation to your email address. Yes, you have it on the sla notice. Did you put it on the sla notice? I think I did, but do you want me to give it to you now or that's fine, that's correct! Okay! Thank you. Thank you very much. Thank you! Bye! Everybody. Thank you good night, everyone, okay! Moving on too good night. Moving on to the last item, number nine, which is an application for 511, 85th street, and it's it just said corporation to be formed, but the applicant put in the chat that the corporate name is the rossi fifth street llc. Thank you. What is that? Please? Sorry, the name de rossi fifth street is the llc. Is it corporate name g-e-r-o-s-s-I? Yes, sir? This is this was previously violated, which was a detroit-style pizza, restaurant, the as well. I noticed that this will be a restaurant with a full menu recorded background music, no outdoor space on the ground floor and basement the there have been a number of licensed businesses at this location, but the last one doing business with violet was approved, nop licensed by us in december of 2017, with stipulations to operate a full-service pizza, restaurant serving food all hours having hours of 12 p.m, to 12 a.m. All day, not using outdoor space. Closing the facade at 9 00 pm playing recorded background music, not applying for alteration without coming before us, not having happy hours, not hosting pub calls or party buses, not having unlimited drink specials with food, reviewing the exhaust and just pursuant to complaints, reviewing the exhaust system and making repairs to address complaints of residents, not having weight lines and having staff responsible for overseeing people on their website. The application has a cfo of 74 with 12 tables 36 feet. The 13 foot bar with six stools proposed hours of 5 pm to 1 a.m, monday through thursday 5 pm to 2 a.m, friday 12 p.m, to 2 a.m. Saturday 12 pm to 1am sunday, a kitchen opens within one hour of closing, serving vegan mexican food. There's no answer about the squad, but I believe that the last location didn't change the facade and that there are existing open windows or an existing open window. No tvs recorded background music, no promoted event, schedule, performances or those with covers no security and intention to install groundbreaking, no pub calls or party buses no happy hours, no wait lines and agreements have staff outside to oversee patrons and noise. The applicant county, 24, o p, is within 500 feet. I counted 25 as well as one pending using the sla lamp map. The previous op license was issued december 19th of 2018 and the applicant we heard last month as well has a number of businesses already in this neighborhood. Okay. This is your opportunity now to make a presentation about your application or any statement about the application or clarify anything that it said. I mean not much to say really I as we go into this sort of, like you guys all know me, and you know how many places I have you know realizing going to this sort of new world we've had to. We have to you know now I'm starting to reopen my restaurants and bars now, and I can't you know we had previously. You know 150 60 employees and I'm actually not able to hire all of them back because we're going into this economy that I think, is going to be rough and there's some people within my company that I don't want to lose jobs, and so we decided one of them happens to be this brilliant woman. She was the CDC she's, a mexican woman. She was a CDC at avant garden for the past three years, the chef's cuisine and she used to make staff meal every day, and I would always go over there for stephanie and she just made brilliant mexican food for staff meal, and then we decided- and I didn't have a job to bring her back to so we decided to do a vegan mexican, restaurant and tequila mezcal cocktail so, and a lot of it has to do with just honestly wanting to not to be able to bring this staff back to work. Okay and walter did you want to say something you're here to speak on this? Yes, please. Thank you. Congratulations to mr lalchendavi for his great success. Thank you, sir bless. You man much continued success in the future. I live near the august. Lord restaurant. It looks very nice, oh august, lore is not mine, oh that it said so on the apple or somewhere on well, one of the websites or I originally owned august, laura when it opened in Brooklyn many years ago. I sold that to the current owners who reopened it. So I'm not involved in that. I own this space across the street, which was mother of pearl and moya margot and honeybees. Oh, I think, okay! Well, you know, as well as the number of spaces on st marks and e seventh one on st marks and then four one seventh yeah 14 right according to not anymore, we've closed a few of them. I yeah I have closed a few because of Covid-19 that we just didn't think would sustain so we're down to, like I don't know exactly nine or ten right now and now, like I said, they're part of the reason why doing this one I couldn't make deals. Some of my landlords didn't want to make deals. They didn't care, they were just like pay me or get out. So I was like okay, I'm gonna leave. A lot of my landlords did make deals. The landlord on fifth street at this space was actually very kind and he seemed like a really nice guy never worked with him in the past. Who was he? It's ckc associates the guy I was dealing with. Who was the principal there, the daniel cooper, and he was just daniel cooper, daniel cooper and he's just really nice and he's like listen? I get it we're going into a really excuse, my language shitty economy and it's going to be hard for any restaurant of ours sustained, and he gave me a really good deal on the rent, and so it was so. It was sort of hard to say no to and it made, and it was a fully built out beautiful restaurant with a gorgeous open kitchen and- and I had this brilliant chef- and I thought, let's you know it's a scary time to be opening new places. But unless I know I'm gonna give it a try so that I can employ 25 people that I would have normally had to fire or not bring back because they've been out of work for. Are you going to be occupying any part of 509? No, I think is that is that what is 509 is that it's my residential building. We, I think we have the basement there. So our the restaurant we have is about a thousand square feet, but our basement is 2 000 square feet and I don't know which way it goes. I don't know if it's 509 or 513., but oh no, it's five on it's in 511, your basement, which you are entitled to, and then there is a door that goes into 509 illegally many years ago, one of the restaurants illegally broke through that load-bearing wall and received a thousand dollar fine was an sla determined by an administrative judge. It was a determination they were supposed to close in the basement. Yes, they were supposed to have closed up that door and mr cooper berg or mr cooper is it cooper back cooper. Well, anyway, daniel cooper berg is the principal of the owner, and I don't know him is his ckc associates. You know they own the plan that they administer the thousand hotel apartments. They administer the frank, gehry building downtown, he's very influential and very wealthy, and that's why probably I forgot to get that my letter in on time on friday, because it's always terrifying- I've been coming every year to testify about this or that you know something that the restaurant maybe doing there. I assume that you're, a good restaurant owner, but there's been many under capitalized restaurants, there's been smoke in our windows. We had one person actually roasting a lamb. I have pictures and the community board has those pictures of roasting a lamb in the backyard. We have all kinds of work that was done without permits. We have one restaurant owner looking in my window this window here you can see it are you on the ground floor? Yes, and actually looking at me and making menacing faces to me, because walter can I walter, because I know I want to give you your opportunity to speak, but I think I could refine at least parts of this so ravi, much like with your businesses on 7th street. This is zoned r7b. Given the residential zoning, you can't use, you can't extend the business either to the front or to the rear. So you can't use this commercially. You can't commercially use, but you can't commercially use the backyard and other businesses yeah other businesses rather than putting tables outside. I mean other businesses in the past, rather than putting tables outside try to use it as a vegetable gardener. Try to do some cooking outside, for you know to actually provide service inside it can't be used at all right. You can certainly, if you wanted to make it pretty, you can make it pretty, but it can't be used at all. The other thing is. I think that what walter is trying to say is there's an outstanding issue. He believes about whether or not the 509 portion of the building can be used commercially, because his belief was that it was illegally extended and in fact, at some point in the past, a business owner received or the building itself received a fine for that illegal extension. I'm happy to look into it. We can meet to talk about it. I don't usually I don't meet with restaurant owners about it. I meet with the community board. I've got I meet with the regulators with the the government authorities that are understanding who's, who trust I put my trust in the government to be a good government and to regulate a commerce properly so that it doesn't violate the law in terms of habitability. You put your true, misunderstood belief in the trump administration. Sorry well I'd like to laugh at your joke, but I'm really right now and I'm usually a very jocular person, I'm sorry, but I I'm not making jokes right now, but I get I get the joke, but really it's. I know for a fact that you're not allowed in 509 at all. It's a resident, residentially zoned by the way, I'd like to ask on the application. This is for alessandra. Why does it say? Why does it say r7-b when something changed? It was always I'm not familiar with what r72 is in this area. I only know about r7b raa. You know what I love. Having looked at the zoning map and attributed to different locations in this area, you know over the time that I've done this I've. Never I think that is a mistake. I don't know what r72 is yeah and I do hope that nothing has been done without consulting us, because we've been long been interested parties in this matter 20 years and I'm going to tell you whether or not whether or not there's a b or a 2, the r 7 zoning is the strictly residential voting. Okay good, so please understand part 8 that just means residential without commercialization. That is a fact, and they misrepresented this property to you and I'm sorry about that. It's this is this is my landlord. You know, and right now, he's harassing me: he's got the toilet full of water that they won't move. They have some disinfectant I'm allergic to. I complained about it and the sleeper moved it closer to my window and I complained about it never got an answer from my landlord, so I mean things like that is just making me nervous and no wonder I missed the deadline for the letter, but I did send the letter and I do believe that that clint has copies of it for you, we do look at it. I would like I would like everybody, but just to maybe even reread it, because I think it has good insights on tender, habitability and responsible businesses, which I think that this sla committee could really benefit from. There are so few public voices from tenants. You know with all the deregulation and very influential and powerful landlords, all over and powerful business I mean since reagan and the whole country has been deregulated unions are very weak corporations I mean: did you know that that the profiteers made six of the same almost the same amount as our military budget for one year in this Covid-19 19 environment, the pharmaceutical companies? Did you know how much how outsized is billions of dollars? This country has plenty of money to, for you know we had a man here who was a bad citizen. I thought that was an applicant and he got a chance to talk for 45 minutes, so I think I've only been on for 10., so you have to let people talk more to get them to say what you need them to say, but he wasn't really saying what he needed to say at the beginning. Well, what I need to do if there's anything you want to add that's different from what you've already said. Then you can say it, but then we need to move on to the making of the resolution yeah. Okay. So what I need to know is whether or not there are any intentions of using our 509 seller, which is residential, whether and or whether the community board needs to stipulate that that's that that seller will not be used at all. Well, the only address that we have yeah the only address that we have that they're applying for is 511. right ravi. This is notice to you that this has been an outstanding issue and has been raised for different for different businesses about the legality of the all of the basement things. So I will speak about it. Ravi, I'm going to tell you also that, if you're thinking of some other things like using the backyard at all, do you have any intentions? No, he said no okay, he already said okay. So and let's see oh, I wanted to ask you why it was crossed off on the application questionnaire we'd like to ask you community board that for future applicant questionnaires, let you not cross off a proof of conspicuous posting of notices that actually have to be changed. That was that was crossed off because of the stay at home order, but obviously we that stan and home order has been amended, and so now yes you're right, and that has to be changed for the next month's meeting and now sandra. I have another question for the board: there used to be a lot of reviews of restaurants every year. I would get a message that there would be a kind of a community meeting where I could meet with the restaurant owners learn how to renew their licenses, but this is all not being done publicly and I'm just wondering why that the people I saw the people from violet once and they were reasonably good tenants, but they shouldn't have been in five or nine, but but I would like to have had the opportunity to at least you know, have a review and there's other you can yeah. You can always submit something to the community board office and will evaluate whether or not something should be heard. You know as the result of comments or complaints regarding a business, but was there anything going on that? I was not privy to because I'd really need to be privy to these. Let's see what once a year, do you violet operated for a very short period of time and as far as I'm aware, consistent with what his stipulations were, which was what it was approved for? Okay. Well, thank you very much just to clarify your last point. Walter. We don't. We don't normally hear reviews, as alex said, unless there's a problem, so renewals we would hear if there was a problem or complaints, but if there were no complaints or requests, then renewals are not normally heard in front of the committee and if you send something to the office, a request for information- and we have information we'll provide it to you right. So if there's any, you know understanding that there's a history of complaints or regarding a business, and you ask a question with respect to that you'll get an answer responding to whether or not there's a history or we've heard anything all right. Thank you. Okay, all right, all right! So now we have to go to the medium resolution. I don't need to know whether or not you know it has to be that he has to be said that he cannot be using 509. I mean it really does. Doesn't it because it's very impactful to we have my. I have mice all over the place. That's not an sla issue, but it is a DOB issue. So I don't know, can you make a note other than maybe you should send a new complaint to the office with respect to what the gov issue is, I should make a complaint to address it in the present day because it's obviously been addressed previously. Oh, it has so now, but you're planning. Well, you said it now. Oh well, yeah, because I took them to court. I went to court, I brought you know so you know, I think it really says those compressors are there and it's a fact. Can we get an inspector down there to verify that they're there, because they have to be moved? You can. What I would do is I would make a 311 complaint. I would then also submit a complaint to the there's. Like a complaint form submitted to the office, saying I made a 311 complaint because it's my understanding that the 509 space is still being used commercially. Okay, can I have a member of the board be a mentor to me because these things, I'm not you know, I teach three-year-old, free and four-year-olds. You know music, that's my thing, I'm not a lawyer and the whole thing is very. Can you have I'm sorry? I didn't hear what you asked for. Can you have a what I said I'm just I would could I have somebody from the board be a mentor and kind of I could talk to. If I have a problem, I think all we can offer you is the office staff will help you as they can. We only have very limited staff and we have very limited board members, but we'll try to answer your questions when you ask them all right. This is, you know continually important matter. Alessandra, it's always lovely to talk to you. I am no. I understand that. I understand that's why you come back hello and you should you should know that much as you always come to these meetings. This applicant always comes to these meetings because he has his own long time, investment in the neighborhood right. So please try to make it work yeah, but I'm not trying to take it. I'm not trying to take anything from men that doesn't belong to me and I don't think any of us understood that say it again. That's what I understand I want to understand say it again. I said I don't think any of us understood that you're trying to take anything from him. I think that you come and you have concerns and we hear your concern right. So you need to help to protect me because I'm a very unpowerful person, I'm one person, you have two other tenants here that are too scared to just show up on video. This is you know we really need a little. We need someone to like really listen to us. Okay and mr lol shandavi. I know you love animals, 21 of your big charities. Please give this animal a break, this human natural. I will do my best. You have to like more than cats. Okay, so we have to have a discussion and go on to the making of a resolution robbie with respect to the windows which are sort of an easy thing at this location, because there were, there was a period of like lot of standing complaints, because the street itself is pretty small. This and it's you know it's just this one little block, that's kind of wedged in between village views and a school that that's the reason why there's a requirement that, for this location, windows have to close it by the front windows at nine. So that's just been a long-standing stipulation with respect to it'll, be fine right to address, recognizing that we've had these issues come up repeatedly over the course of time. Oh that's cute. She just moved in then. I think that other app store outstanding thing we might have to just speak about are the proposed hours of operation, and I don't know if any committee members want to talk about them they're longer than what we have had. I think we had one business that had mixed one a.m and two hours at one point in the past. I think that might have been seymour burton in like 2008, but the street is really a residential street. Where you know our hope is not that it has so many businesses that are opening really late. Does anybody else want to be heard with respect to that, so there's ellen herman, michelle clinton- I mean he's. I don't anticipate given his other businesses. I don't anticipate this being a loud problem, so I don't on the surface. I don't have a huge issue, maybe normally we would ask for to bump it back a bit to 12 in one, but given that we do know how he's operated as other businesses, I would probably be okay with well the side street businesses like the 7th street business is closed. At 12., ladybird closes at two death and co closes at three on the weekends two. During that week there are side street businesses, yeah yeah different company is different. I'm talking about like the restaurants that are in the residential streets that the death and company sort of faces village view the face with an open area. I mean there are buildings there and it's also it predates the other businesses, so it predates when we really had a consideration about how many businesses there were and the zoning and the locations had his donations at the beginning. Anyway, I've got two clicks on 7th street with 2am licenses that are open. That don't have any complaints. I don't think I've had a complaint. I know in 10 years, oh well, you haven't had any. Let's just say you haven't had any recent. I don't know if I would go as far as ten years when I looked up the three one ones, but not in the past couple we'll say that okay, I mean not. That has been brought to my attention by anybody, so I don't know. Does anybody else want to be heard about hours? I think 2 a.m on a sunday is a bit. I don't think we put 2 a.m on sunday. I think we put 1 a.m and then otherwise 1am anybody else. No, yes, herman, michelle! No okay! All right! Do you wanna! Should we go to the making of resolution, then sure I think we're all kind of on the same page, all right. So the where the first warehouse would be. What the applicant is applying for is stated that it wants to have a vegan mexican restaurant serving tequila mezcal alcohol. What the elements of the application are, what the history of location has been with respect, at least to that this has been a long-standing license, location, which was most recently approved a full on premises license by community board 3 in december of 2017, when the license was issued for the prior business that this applicant has numerous licensed businesses in the community with both year, one licenses as well as full licenses and without a history of recent complaints for his businesses. Whereas what the number of licenses are for him, as well as per my count and then given this assistant and that attendant of 509 to 509 to 511 east fifth street, appear to express opposition to the use of any outdoor areas, as well as opposition to the use of the commercial youth of the basement at 509th street, which is not not commercially permitted, and that the applicant was advised to address the issue of commercial use of the commercial use of the basement and also that, given the r7 b, zoning of this storefront extension of the commercial used to the outside, including the space in front of the business or the backyard, is prohibited. Okay, but otherwise, given that this has been a long-standing restaurant and the applicant has a long-standing history in this community as a restaurant owner, we would approve this our denis application unless the applicant agrees to the following stipulations. So the stipulations would be a full-service vegan, mexican, restaurant and robby. You put within one hour of closing, but I'm gonna ask you to have it right during all hours. I can do all hours of operation that there's no commercial use of the outdoor space that the and ellen I can. I can draft the stipulation at the bottom, but it's going to be that the facade the windows close at 9 00 pm every night, that there's that there's a recorded background music, no promotion that scheduled performances or events with covers no pub calls or party buses, no happy hours, no wait lines and somebody responsible for ensuring no noise or people outside or overseeing noise, and patrons about that excuse me anything else, get everything ellen you're! Looking at the stipulation, yeah! Okay! Is there an amendment or a second I'm just thinking? I think I think you got everything I'll. Second, all right, all in favor aye, thanks guys, okay, no opposed no stain and is it sent to your email address yeah what email donation yeah? That's fine! When you gave me last month, yes same email, okay, so the office will send it to your email address. Okay! Thank you very much. Okay, good night, okay, take care! Everybody! Okay! Well, wait! We need to wait. We need. We need emotion. What happened? Oh yeah? No. Everybody disappeared. I thought there was a motion. I thought five years here, you secular, don't we need a motion to adjourn. Oh, yes, we do need a motion to adjourn very suit of you clinton. Okay, there we go good night, everybody good night, hi walter take care. Firstly,.",
        "summary": "We, do business as 10 degrees, Well, while we're waiting for one more community committee member I'll go ahead and read through the guidelines for anyone who is attending here as a guest or an applicant.\nLook at the elements of the business you can reach out to the applicant and speak to the applicant about whatever concerns you might have and then, prior to the committee meeting.\nYou want to just make a comment about the business, that's fine, but We're not hearing the applicant tonight or discussing whether or not to approve this as we've already determined, would be administratively approved.\nYou could send that into the off after this meeting or after you've reviewed the questionnaire that the applicant submitted and the stipulations the conditions that it's agreed to about how it's going to operate its business, then you can certainly send something into the office and we'll try to address it, for you send that into the sla website.\nTo number two number two is: was an agenda item added by the office and something that we have discussed on and off as a committee which is adding to the administrative approvals, the stipulation requiring that the applicant or the licensee operate for a year before applying for an upgrade and as a committee, we've discussed different amounts of time.\nYou mean you like to see a more comprehensive resolution that includes something along the lines of no sooner than but from at least like a But from this point on, you may apply for a changing class of your liquor, license understanding that your application is going to be evaluated just as any other application would, which would be whether or not it's appropriate for a changing class and whether or not your business has been operating the way that it agreed that it would, when it was administratively approved.\nI know that's putting it off another month, but maybe it's probably a good idea to have it formulated into a more comprehensive resolution so that we have a better understanding of what we'd actually be discussing and voting on anybody else.\nSo this is an application for the sla notice, says: tavern, with minimal food recorded music and notes the existing outdoor space pursuant to the executive order, which it doesn't have to because it's pursuant to the executive order on the ground floor of this location, Although, a diagram submitted, shows a standing rail with no seats, a bar with no information- I, don't know if it's the service counter or something separate in the diagram.\nI mean, or the photograph that was submitted or photographed, show that the cloud is completely open without any agreement to close at 10 pm, which is one of the stipulations on our questionnaire recorded background, music, no promoted event scheduled performances or events with cover fees, no tvs, no security, no sound proofing, no intention to upgrade no hosting pub crawls or party buzzes happy hours to 8pm.\nAlso speaking to the cars as well as the dj on the sidewalk, there was a letter submitted by the lower east side dwellers also citing the events, but additionally, noting that this applicant currently is placing its rails and its rails.\nThe district manager also submitted a statement that, because of the two she said, there were two gatherings, both of which generated complaints, the second resulting in a fight meeting, with the bid with the business improvement district in that area, the community board, the precinct and local elected officials or their representatives to address what was going on with the business and which ultimately resulted in the business agreeing not to be open for the period of one week or consistent with whatever phase we were in and until we moved into the next phase of the executive order.\nI know I note that I have not heard personally from anybody that I emailed the community groups that were listed on the cb3 website, inviting them to certainly reach out to me that I put them in touch with my clients if they had any questions or concerns about this.\nAnd I think the record is that hasn't happened since I, don't know what the second event that you mentioned was I'm, very surprised that there are stating that this was not a planned event that they seem to be portraying it as that they're, more victims of the situation that occurred versus the instigators or the orchestrators of the dj of the cars of this of the cars that had decals of the place, et cetera, et cetera, et cetera, but number two.\nI think that was just not filled in correctly on the agenda There were two gatherings of some kind, because the second resulted in the office actually responding to the site, but the event that happened on may 31st ravi had flyers posted to announce the event with the logo and name of the business on the flyers.\nSo I know it's called a gathering, but it appears to be consistent with an event, given that all these people showed up in the same place at the same time and were summoned there in some way, whether it was just via the flyers that the neighborhood saw, or by some other means, as well and like and was with the idea of having music outside and coordinating off the street.\nAnd I know that they're applying tonight for beer wine or something like that, but I, am really just disgusted at the fact that they had no regard for the community when they allowed this thing to happen, I mean, or.\nWhen susan mentioned it to me when I put in the application, and certainly I've discussed the reality of the situation in this neighborhood with my client that whether it was planned or not, which it wasn't, even if other people want to do something like that- It's, not a place to have a car, show.\nWe definitely would like to see it, but these were people that were a fan of the place that thought it was a cool idea which I frankly, don't think it was a cool idea for this neighborhood, not in these circumstances, and not certainly going through the proper channels.\nI have a concern about even a beer and wine license in this location until 2 a.m and 4 a.m. On the weekends, because there are, with the exception of the governor's executive order for having outdoor seating other than that, there are no tables.\nI've already spoken, so, and I agree with him with respect to the hours of operation, the type of business, the location, and you know what they seem to be marketing toward and also what I've read in terms of what they say : they're marketing toward which Is the hip young, energetic community that exists in the area, I wasn't in the street Secondly.\nThe other point, is, I agree with clint that having beer and wine and having to stand at one small table, how many people could be there and, if you're, having the fries and drinking somebody on the sidewalk and,?\nIs that the applicant's not going to assign any stipulations that we construct, although maybe that, maybe that person or people will and then we'll go to the sla And we'll end up having to send somebody to the sla, and I have no doubt that the community will submit material to the sla.\nI live on the upper east side of new york, city She said we got to bring this to the states, because there were lines in front of all these street stores and we were trying different french fries And, so I rolled it off, I said, make me a business.\nI. Don't know if a single second event that ever happened, we've been we've been operating, the business is doing nicely.\nThis business has been open since may of 2020 and that in the three months of operation that there have been two events or gatherings- The applicant's attorney denied the second gathering.\nGiven that the business has already been disruptive and has had these, what they're characterizing is irresponsible, unsafe, events, the in addition, the lower east side dwellers submit a letter which also speaks to its current operation, unassociated, with the events themselves, in terms of how it's utilizing residential garbage cans for the rails, that are that are actually part of the places that you eat the fries and they submitted.\nWe can include that the applicant, the attorney for the applicant, the applicant, were given an opportunity to speak and stated that they didn't plan this event, that it happened without their planning and that when and that when- Not knowing what the second gathering it is.\nIt's already existing issues with respect to the vehicle, congestion, pedestrian congestion, noise from people, noise from horn honking, because cars can't get down the streets which are blocked and that you know This was evident in the event that was held on behalf of the business and how it exacerbated all of these conditions.\nWe have great concerns about the approval of a license of any type for this business, because we have concerns about the ability of the applicant to follow or permit requirements.\nWe understand that the threshold for the approval of such a license is low and consequently would therefore approve this application with certain stipulations governing the method of operation of the business, and we can go through what they are, but I'll propose them.\nI would propose no outdoor state, no commercial outdoor space recorded background music online, the facade closing at 10, no pub calls or party buses, no unlimited, specials, no happy hours, no wait lines and somebody responsible for overseeing heads in life outside alex.\nProposed hours are 11 a.m to 12 a.m; sunday through thursday 11 a.m, to 2 a.m, friday and saturday kitchen open all hours serving this The applicant wrote the swedish street food but then also wrote primarily burgers accordion doors and windows.\nThere was a statement as part of the questionnaire with a plan to address waitline staff, had an agreement to have staff responsible for overseeing crowds and noise outside the applicant listed 19 ops within 500 feet, but submitted an sla report that listed 20, and there are 20 per my count as well as four pending ops within 500 feet.\nEach east 136th street in the Bronx since 2011, with an op license issued september 21st of 2018 submitted a applicant submitted a letter of public interest which in some said it would be one of two breweries in Manhattan, which would provide patrons unique access and perspective to the beer.\nThe word used by the applicant with activations also were used by the explicit through two new releases per month, which is something that currently exists as its business that it operates now and then also said.\nThe comment: I was gonna, make is I work in the Bronx I'm familiar with a lot of the neighborhoods in the Bronx, I'm familiar with morrisania, and the port morris section of the Bronx, and I can see just in looking at your location and looking at it, It's on the sla website on the lamp map or looking at it on a street view that it's in a warehouse , it's not surrounded by a residential area.\nSo the location sort of lends itself to what you do now, whereas what you want to do here is bring that business, even if it's in a smaller format to what is essentially a 1900 residential like mixed-use, residential building in an area that is packed with people, whether they're people who actually live here or people who come here.\nI, don't know when you did your search, but we we're hearing all the time about businesses that we're losing and just to add another license to the to the neighborhood Is generally, something that my organization opposes and It just seems that there's a lot of disconnects between what you want to do and the space that you want to do it in There are other locations that sell beer and craft beer, none of which are actually producing beer on site, and I think, more than anything.\nThe prior experience of the applicant operating the location that is in the Bronx, the address of the location and when it was issued of an op license at that location, identifying the location, that's on 2nd avenue as a previously unlicensed location and also identifying it as a mixed-use residential commercial building built in 1900.\nThat, furthermore, I didn't- have it before that- laura that a representative of the east village community coalition, which represents tenants and businesses in the community, spoke in opposition to this application or to the issuance of a full-on premises like license for an application to operate a small pilot brewery and to the the reasons stated by the applicant during its hearing, which is that it want to be out.\nI guess what I'm hearing is that the community board would be in favor of a wine insider licensed at this location with the brewery, or do I need to submit a secondary application for those purposes, or is that able to be part of the resolution?\nThat's an op license for an application for 10 degrees, which is an existing business.\nNo wait lines and staff outside the apple chain count 18 02's within 500 feet, and this application consists of one principal who has worked in the business since 2006.\nWhen we heard the applicant in July of 2006, they stated that all of the violations were for were from the partner who had previously operated the business and not for that person.\nI. Just want to note that I myself have actually seen a live, performer, usually sitting on a stool, usually right at the front of the building with of the business, which I noticed, because the facade is completely open.\nThe account for the applicant and the count for us with respect to number of licenses in the area and that the existing principal has operated this business since 2006, Given that the business method of operation will remain the same and retain the one of the existing principles of the present business, we would approve with, or we would deny, unless the applicant agrees to the following stipulation, which is that this would operate as a tavern cocktail bar with a prep area serving food during all the hours of operation, or rather it's on the stipulation it would be less than a full service kitchen, with hours of operation of 4 a.m, to 4.\nMusic, no live dj, no djs, with the exception that it may have djs on new year's eve, no alteration without first coming before the community board will not host pub calls or party buses will not have unlimited drink specials, we'll have happy hours to 8 pm Is there an amendment to this motion or a second just to let you know So, he threw past pasta minutes on to me, but he is no longer with us, so don't be for his vote.\nA wine beer license in september of 2015 with stipulations, operate a full-service balkan restaurant serving food within one hour of closing having hours of operation of 2 p.m, to 12, a.m, all day, not using outdoor space, closing and it.\nClosing, his father 10 pm playing recorded background music, not seeking an upgrade not applying for an alteration without first coming before the community board, not hosting club calls or party buses, not having happy hours, not having weight loss and having staff responsible for overseeing crabs and noise outside.\nThat was a mistake on the application, so I don't know if there's an increase in hours and the belly dancing would be one hour from 9 00 p.m, to 10 p.m. I'm, not aware of it that this business is, as you said, has been in restaurants, been in business since 2015.\nRestaurant we've been in business for about five years, now, we're just looking to upgrade to the actual full liquor.\nIt should be on the application, but we do not serve alcohol on the outdoor area, meaning beer and wine.\nI think we can include two paragraphs that say that there's a an issue with respect to its proximity to a house of worship that being saint mark's church, the bowery that the applicant has stated and submitted a proximity report indicating that this house of worship is 310 feet from this location and that the community board understands that in the past the fla found that this is not exclusively a house of worship.\nThe community recognizes that it is primarily a long-standing house of worship with contingency which is continually held services during its years of operations and asked that this, the proximity and this used to be evaluated by the fla and considering this application.\nHere it would be a full-service mediterranean restaurant which, with the kitchen, open and serving food during all hours of operation.\nI noticed that this will be a restaurant with a full menu recorded background, music, no outdoor space on the ground floor and basement the there have been a number of licensed businesses at this location, but the last one doing business with violet was approved, nop licensed by us in december of 2017, with stipulations to operate a full-service pizza, restaurant serving food all hours having hours of 12 p.m, to 12 a.m. All day, not using outdoor space.\nClosing, the facade at 9 00 pm playing recorded background music, not applying for alteration without coming before us, not having happy hours, not hosting pub calls or party buses, not having unlimited drink specials with food, reviewing the exhaust and just pursuant to complaints, reviewing the exhaust system and making repairs to address complaints of residents, not having weight lines and having staff responsible for overseeing people on their website.\nWe have one restaurant owner looking in my window, this window here, Yes, and actually looking at me and making menacing faces to me, because walter can I walter, because I know I want to give you your opportunity to speak, but I think I could refine at least parts of this so ravi, much like with your businesses on 7th street.\nYou know, Like a complaint form submitted to the office, saying I made a 311 complaint because it's my understanding that the 509 space is still being used.\nI, don't have a huge issue, maybe normally we would ask for to bump it back a bit to 12 in one, but given that we do know how he's operated as other businesses, I would probably be okay with well the side street businesses like the 7th street business is closed.\nBut it's going to be that the facade the windows close at 9 00 pm every night, that there's that there's a recorded background, music, no promotion that scheduled performances or events with covers no pub calls or party buses, no happy hours, no wait lines and somebody responsible for ensuring no noise or people outside or overseeing noise, and patrons about that There, an amendment or a second When."
    }
}