{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CB 3 Manhattan - Economic Development Committee",
            "publishDate": "2020-08-06",
            "shortDescription": "Agenda\\n1.    Approval of previous month's minutes\\n2.    LESEN: Current unemployment and workforce needs\\n3.    Center for an Urban Future: Overview of current employment and industry and industry trends\\n4.    District Needs Statement\\n5.    Special District Update\\n6.    Vote to adjourn",
            "lengthSeconds": "2:10:30"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "gvH_sgnnF84",
            "fillerWordCount": {
                "uh": 274,
                "um": 538
            },
            "readTimeFullTranscript": "82 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "jobs": 48,
                "job": 42,
                "data": 39,
                "work": 31,
                "housing": 31,
                "training": 30,
                "bit": 29,
                "business": 29,
                "businesses": 29,
                "neighborhood": 27
            },
            "wordCountSummary": {
                "data": 12,
                "job": 11,
                "jobs": 9,
                "industry": 7,
                "services": 7,
                "businesses": 7,
                "losses": 6,
                "workforce": 6,
                "training": 6,
                "economy": 5
            },
            "fullTranscript": "No, I do not pay attention that closely. Yeah okay, well, Alex is wanting to join from the waiting room, so I'm going to admit her and I'm going to stop talking about this right. Now. All right I'll see you in a second hi. What's good, how you doing I'm okay, hi Susan! Are you the I'm just the computer guy? That's what I'm asking! Are you the computer guy? Oh, no, not the Mc for the night, just the computer guy yeah meeting, so I think it should be okay, although we're already recording, which I think I do not want to be doing. We are recording great well. Thank you, everybody for joining the August Economic Development Committee meeting for Community Board. Three. Thank you all for meeting in August. I know we do not usually do it. I always be in August, except for SLA, so hey richard. So we do have a number of things on the agenda for tonight. So, let's go ahead and get started with an approval of the last month's minutes, with a roll call vote and just for our housekeeping Joe is running. The zoom and Megan is doing minutes. So if you have questions about technology or anything happen, joe is Manhattan community board. Three, so ask him. Sorry, I point to where you are, but I know that none of you all everybody else has different experience anyway. Okay, I am ready when you are yep yeah, okay, so for approval of last month's Minutes Anisha Stephen, yes, Megan Joy, yes, Aleister Economicus. Do not you have to make a motion in a second and ask if there are any amendments, I do not go so last month, Michael said that we did not okay, I mean I can if you want, but I do not know- we've never done that before in the past that we you're not supposed to do that. Okay, Andrea Gordillo, yes, Herman, Hewitt, Joe, Kearns, Yep, David Louie, yes, Alexandra Milotano, yes, Richard, Ropiak, Richard, Rodney, Washington, Richard said yes, but he's on Mute, oh okay, Richard. Sorry, yes, Rodney Washington! Is he there I'm just on another screen? No okay, Andrew Comey, yes, okay, great! So, let's move into, we have two presentations tonight. The first is from Eli Dorgan who's from the center for an urban future, and the second is from David Garza and Guest Barcaro from Henry, Street and Lesson. I owe and there's also a note that any guests, if they could introduce themselves in their affiliation type it into the chat box, we're having these two presentations tonight, just to frame it a little bit based. You know, as we've been talking about the district needs, I wanted to introduce some information and data around unemployment. I know that we have heard from lesson in the past around specific programs that they run in our district, but I think that we are sort of in an unprecedented time of changes with our in within our economy that are affecting individuals like never before in this committee we talk a lot about small business and sort of larger real estate and economic development things, but we have not, at least in the past couple of months, talk specifically about how this is really affecting the people that live in our community. So with that I'd like to pass it over to Eli, you can either share your screen or we can pull up that presentation for you, whichever you'd prefer and if you could also give a little bit of an introduction to the center. That would be great sure. Well, thanks! So much for having me. Can everybody hear me? Okay, that's great fantastic! Well, my name is Eli devorkin, I'm the editorial and policy director at the center for an urban future. For those of you who do not know us we're a research organization think tank policy organization- it's been around for about 25 years now focused on expanding economic opportunity, reducing inequality and building a more inclusive economy here in New York, and we do that through research by publishing reports and studies that unpack some of these issues in detail, that put forward practical and achievable recommendations for policy makers, and I think, ultimately, that do a pretty good job of shining, a light on issues that have gone overlooked and getting them onto the radar of our elected officials. So we do this in lots of different ways, but certainly research on the state of New, York, City's economy is a big part of that, and this is just a tiny piece of what we do. If we kind of take a look at the data that informs better policy making. So Anish invited me here tonight to share a little bit of that data with you all on your district, specifically the lower East side and and parts of Chinatown, and I can share some of the latest data, both a look at where we stood in these in these neighborhoods right before this pandemic and then sort of a sense of where we may be right now because of this crisis, and of course, happy to you know, take any questions or discuss any further, but I did have just a few brief slides to kind of keep. This thing keep this thing moving, and so let me see if I can share my screen and actually, if you do, have it ready to go anisha. That might be the easiest way to do it, but but I'm also happy to share the screen. If that's easier yo, do you have it? If not, I can pull it out yeah. I could pull it up. I just I also made you a co- host which might just make it easier for you to just project, and then I can remove the co- host status, but I think that might actually be easiest got it sure, just one Sec, oh you know what it's not going to. Let me it won't. Let me won't let you all record it unless I quit out and re- enter, which I can do, but if it's easy, if that's the best option Joe just let me know no, then in that case, let me just let me pull it up. Okay, cool! Thank you! Eli. Can you say the name of your organization again sure center for an urban future cuff, as some of some of you may know us and NYC Future.Org is our website. Eli specifically, today is talking about employment and industry trends, but cuff does a lot around small business. You know they've produced quite a number of reports during the pandemic time that I would encourage anybody to go and look at because it's very informative thanks, Anisha yeah, absolutely we've been really busy since March, but I focused on all sorts of different effects of the of the crisis and certainly if anybody checks out our work or does not know us before tonight, and you have any thoughts or questions, you can just contact me directly and I can get my email at the end, but I'm also you can find me on Cuff's website as well Joe. Thank you so much. This looks great so so just wanted to walk, walk you all through a couple of these trends. Some you may be well aware of, and some may be helpful to to take a look at in the context of of this crisis and what a recovery might look like Joe can I advance or that you have to do that yeah perfect. So just a few quick data points on what the workforce looked like in the district before Covid-19. You know there were about 68,600 employed residents in the Community Board district, about two- thirds are people of color race other than white on the census about 36 percent born outside of the United States. The median annual household income in the district was about 43,700 a year, which is quite a bit lower than the city- wide median of about 60,000, though I would just pause there to say that the median income is lower, the average income has been increasing dramatically and, as many of you may sort of recognize, you know this is a district. That's really kind of a tale of two economies and I'm going to get into that in a moment, but but certainly there's a large influx of much higher wage earners in the neighborhood and at the same time they're. You know a large number of residents that earn below that median and- and it's still a neighborhood with you know pretty significant pockets of poverty and your poverty and a lot of that's reflected, I think, in educational attainment, about 43 of the neighborhood holds a bachelor's degree or higher. That's about 10 percentage points higher than just 10:15 years ago, which is a pretty significant trend in the neighborhood, but at the same time, about 26 of your neighbors have less than a high school diploma. Those are working, adults are you know 25 and over and another 16:17 excuse me are high school graduates, so in particular you know this is maybe unsurprising, but there are major major concerns about that 26 in particular folks who do not have access to the kinds of employment opportunities that are more resilient in this particular crisis and we'll get into that in just a moment. Certainly, no matter what kind of work you were doing, the unemployment rate had fallen to historic lows right before this crisis. It was about 3.6 percent in the lower East side in Chinatown about a year and a half ago, and one other trend that I won't spend any time on really tonight, but certainly is geared up in my heart in the work that we do at center for urban future, which is that the population of the lorry side has really been aging significantly, as it has been in the whole city, but about 14.4 percent of the population was 65 or over. You know, nine, ten years ago, as of a year ago, it was 18 and that's been a dramatic growth that we've seen in other neighborhoods as well. It is a factor, certainly when we think about workforce issues, though, because among other factors, age has been correlated with job losses and a lot of older workers have really struggled in the last few months. Joe. If you could head go one slide ahead. Thank you so, just briefly, and then I'll show you something a little more engaging than just text, but a couple of points on the economic crisis in the in the community. Certainly, unemployment has surged and although there is not hard data on unemployment at the neighborhood level, there are some pretty decent estimates that that are really alarming. You know, Manhattan, generally speaking, residents at least have fared fairly well, and that's maybe unsurprising, given how much work in Manhattan is. You can do remotely office jobs in general have been you know, certainly no one's none have been spared completely, but have seen far fewer job losses and and frontline workers have, you know, obviously been at risk of contracting the virus but have held on to their jobs, but so many other new yorkers are out of work right now, and that includes about 20 to 28 of certain census, tracts on the lower East side and in Chinatown it's not a number for the whole neighborhood, but it's certainly alarming when you see specific pockets, where a pretty solid estimate would be that about a quarter of the population is out of work right now, a couple of other ways to look at the potential for unemployment right now. One is just how many residents in the district are employed in one of the four hardest hit industries, and our most recent analysis found that over 17 of all working residents in the district are employed in restaurants and bars, retail, hotels and personal care. You know four of the industries or the four industries that have been hit potentially the hardest. So that's alarming, and in particular we also took a quick look at occupation data for the district, more than 11 of all working residents, so almost 7,000 are employed in just three of the hardest hit of all occupations in the city, retail sales and cashiers janitors and building cleaners and food, prep workers and cooks, and in fact there were over 3200 retail sales people and cashiers in the district alone and about 3,100, almost 3,200 food, prep workers and cooks, and those are two of the largest groups of workers by occupation in the whole district. I also wanted to mention that you know- and this is maybe unsurprising to this group but Chinatown and the lorry side is also home to about 960 working artists. That's just artists that report themselves as full- time, artists on the census. So, of course there are many more folks who are artists but have a day job frankly likely a job in one of those hard- hit industries, but those folks, those thousand or so working artists in the district have certainly been hit really hard as well, and so this is a chart of employment in the district by industry. This is the most recently available data, so this is you know before the pandemic in 2018 and there's a color coding system here. That, I think, is worth kind of pointing out. Green are industries that have actually seen job gains since February there's only one and it's publishing as far as the largest industries in the district, the gray are simply industries where we do not have enough data. The yellow are industries that have held job losses to below eight percent. The orange are industries where the job losses have been eight to twenty percent and the red have seen job losses of more than twenty percent and in fact, much more in certain cases. So you can. I mean my eye is immediately drawn to the very bottom of this chart. Restaurants and other food services, which you know in in- person, dining, has seen job losses of 69 from February to June. That's the latest data available. I mean it's basically the hardest hit industry in the whole city, and that is where the greatest you know concentration of residents in the district work in restaurants. So almost 6,000 people and that's you know clearly the number one I think impact by industry that you would see in the district right now. But it's also kind of worth noting that there are a lot of residents who are relatively, have been relatively spared by the economic impacts and all of those yellow industries have really held job losses down, and that includes Healthcare, unsurprisingly, but right down at the bottom advertising public relations and related services. A lot of these office jobs, you know generally fared a lot better architecture, engineering, jobs, computer systems, design, which is basically the single largest industry within what we think of as the tech sector. You know these are all major industries for residents of the of the community that have not been hit as hard, and then you can see a couple of others that really stand out. Clothing stores really leaps out at me, a particularly hard hit industry again seeing job losses of almost 70 since February and there it's a fairly large concentration of workers in that and just in clothing stores alone in the neighborhood individual and family services, which includes a lot of social services organizations which have also seen some pretty serious losses as they've dealt with diminished revenues and other challenges and construction. You know, there's quite a few residents in the neighborhood work in construction, more than fifteen hundred and while construction has come back, it's one of the industries. That's seen jobs recover since, since a low point in April we still saw losses of over 30:40 in specific constructions or sub industries, and then colleges. Universities is an interesting one. I mean that's, not just college professors. You know we're talking about administrative staff, custodial staff, all kinds of people that work in colleges and universities and that's a generally an industry. That's seen huge losses already has not been talked about as much, but a surprisingly large concentration, I think of folks in the district who work there as well. So I'll keep it moving, but you can get a sense. I think there of some of the issues. Now we do not know what the job losses look like by occupation, but we can kind of imagine given what some of these occupations say about where people work in terms of industry- and I did just want to put this forward because I think it's interesting to kind of get a sense again of where you know where your neighbors work, what kinds of occupations they have rather than just industries. You know, there's a lot of people that are working in management, they're, probably doing okay right now for the most part, although potentially making tough calls every day. But you see right below other managers, which is actually the single largest occupation for residents in the district and that's retail sales. You know at 1800 I mean you know. The data suggests that more than two- thirds of those folks are still out of work and have been since since March. So that's hugely alarming right after retail sales is cashiers, it's tracked separately from retail sales, but those two combined as a really you know seriously affected a set of occupations and then again right after that, you see janitors and building cleaners, the fourth largest occupation for residents in the district. So so, after other managers who are maybe doing a little better right now, you have three major occupations that have been hit. You know incredibly hard, and I think this also gives you a sense of kind of the tale of two economies that I was mentioning before. You know when you see the other major categories. Financial managers coming in as the fifth largest occupation lawyers, judges, magistrates and other judicial workers and office workers is kind of a catch- all. But then you go a little bit further down that list and you see food prep and serving workers. You see chefs and head cooks, all of which are in industries that have been hit really hard right now and artists and related workers, one of the larger occupations frankly in the district, and sets blurry side and Chinatown apart from other parts of the city in that way. But where you know it's worth pointing out, not only are artists struggling, I think, because they've lost all of their opportunities to you know to show their work to present their work, concerts and dance performances and theater performances, etc, but also so many artists work in the service sector, and so you know for many artists that I've spoken with. It's really been kind of a double whammy: they've lost all of their work, all of their income from their artistic practice. They've also lost their side jobs. So that's definitely some you know cause for concern, and then cooks also is in there as well separated out from chefs and head cooks. There's a lot of food workers in the lower East side and all of those you know all of those jobs have been decimated since February. Although certainly we've seen some new data that suggests that jobs have come back about 20 or so of the jobs that were lost from February to May started to come back in June, and that seems to be closely linked with the success I think, of the open streets initiative so certainly worth you know paying attention to that. As we made real changes in how restaurants are able to operate, we actually have started to see some of those jobs coming back. So that's just sort of a brief overview. I did not want to take too much time, but but some of the things that we're seeing in the district and, of course, happy to discuss and answer questions or otherwise participate in the rest of the meeting. Thank you. Thank you. So much we'll take some questions Richard. I know you had your hand out just out of curiosity. I find it amusing to see that you guys lump in chief executives and legislators. I do not know if I won't go on any further comment other than that, but that's that is how the Census bureau it's their the Census Bureau and the Bureau of Labor statistics are doing the lumping, not us, but I agree it's worth noting. Okay. The second comment: much earlier, you said something about people employed at the age of 25 and over, could you could you define that a little better sure I mean so this is looking at a data on I mean there's a couple of cutoffs. The first one is for a couple of the different data points is 25 and over just aged age, 25 and over and for educational attainment. That's simply because there are a lot of folks who are still in school before that point, so to have a fair sense of the share of the adult population with a high school diploma. For example, you know we use a 25 over cut off for for the jobs figures, we're looking at people who are employed. So you know that's a separate category. That's tracked in the data and in this case we're just you know, rather than there's a large number of residents who are not employed, including a large number of those 65 and over residents that we talked about before so we're focusing on people that are generally speaking in the workforce and seeing either are they working and if so, where are they working? So that's generally how the how the data is parsed. So we are, I'm not sure what words to use to describe what I'm thinking. How does the 18 to 25 cohort get defined in terms of employment at 18, they're able to vote at 18 they're able to go to work at 18 they're able to join the military, a whole bunch of things? Not all of them are going to college or graduate school. A large number are especially in New York City, but are not we missing something by not capturing them in terms of their employment yeah. Absolutely that's a it's a great point. Well, the employment data that we're looking at is anybody who's in the workforce, so that includes people that are over the age of 16 and have a job so we're not missing them in this employment data. That's separate from the data on educational attainment, where we use the 25 and up cut off, but you know your point. I think cuts a lot deeper than just that. I mean this does look at people where younger folks are employed. Now I did not separately just for this meeting. Take a take a separate look at this sort of 18 to 25 band and where those folks are working, I think you know our colleagues at at Henry Street have a lot to say about that, but you're absolutely right, and I think you know, among other things, we've seen two general trends. I can just mention acrosss the city and I'm sure you all you know, can see this playing out in the in the district as well. One is underemployment, which was at you know, potentially at sort of epidemic levels of a quiet epidemic before this crisis for young adults. You know this is not to say that people do not have a job, but it's that they're either. Not in, I would say. Maybe three things in particular. One is certainly not having enough work to make ends meet so combining gig work and part- time jobs, and none of it together adds up to really a sustainable wage and that has grown in recent years. As a problem, you know two would be folks young adults who are neither working nor enrolled in school. What was you know, which has been a problem for forever, has actually decreased somewhat over the past 10 years, but has not gone away and there's about 130,000 or so young adults who kind of sit in that category and and it continues to be a persistent challenge, and then the third piece would be folks who you know. Young adults who've actually gone on to get a high school diploma to potentially even enroll in a CUNY school, maybe even graduate, but who are not working in a field that aligns with their interests. Now that's a difficult thing to track in terms of census data, but we hear about it. Anecdotally, all the time- and you know it includes everything from graduating, with a CUNY college credential, but working in food service and not in a field that aligns with the degree and that's a significant challenge that we hear about quite a lot and certainly for folks with a high school diploma. The opportunities to be able to you know gain a middle- wage job or better, have dried up in the past 25 years. You know the kinds of opportunities that you could get with a high school diploma versus what now typically requires at least some form of post- secondary credential. So that's you know a big challenge anyway. I could I'll stop there for the moment, but but absolutely those are really significant issues and are going to be excavated by the crisis next to Olympia. Okay, yes, hi guys! Sorry, can you hear me? Yes, hey olympia, okay, hey! How are you like? Thank you so much so you know. The arts and culture subcommittee is also part of this economic Development Committee, and I was very interested in the data that you saw about the artist. I was wondering how do they deal with the art institutions and the nonprofits, because we also have a high concentration and they are deeply impacted right now in our district, so I'm wondering, would they be lamps under administrative or how can we could we gauge what is happening there, because I think we can not see the artist without the institutions in our district yeah. That's a great point. You know the well couple thoughts I mean one is that just in terms of sheer numbers there actually were more. You know more working artists that pop up in the census data and the Bureau of Labor Statistics data. Then there are people who work in, for example, performing arts, which is a separate category. I mean it's worth pointing out that performing arts in general is one of those industries that has been the absolute hardest hit and actually Joe. I have one more slide that could shine a little bit more light on this. If you've got the last slide here, you know this is just to look at the whole city. I do not have this data just for the district, but you can see you know the by far in a way the greatest job losses have been in full service, restaurants, both new America, you know total numbers and also the share of all jobs lost since February, but but right up there at the top is performing arts, it's actually even higher in terms of the share of jobs that have been lost, and I think you know olympia to your point. A lot of artists may not appear in the data as full- time working artists. They may appear in the data as people that work in the performing arts, for example, work in museums, museums have also seen about a third of their jobs disappear since February. So- and you know we know about some of that in the district I mean the Tenement Museum. I know well and has obviously been dealing with. You know catastrophic financial losses and has had to you know furlough and lay off. You know the majority of their staff. You know, I think, there's a there's a multiplier effect here, because so many artists work in the arts and may appear in the data there, and I can actually give you those numbers. I do not have them at hand, but you know specifically how many lower eastside residents work in museums, how many lower east side residents work in performing arts, for example. So I could share that data with you afterwards as well, but clearly you know the impact extends you know into those into those sectors as well and and the job losses have been significant. I think, if you ask me kind of just you know, bluntly who's faring the worst right now: kind of industry-, wise, it's food service, retail and and the arts I mean those are the big three. Thank you, David you're, next hi Eli. Thanks for the presentation, this is fantastic in the beginning, you mentioned a figure, I think 17 percent of residents in the dish in the in the community that work in the four harvest industries. How does that number compare to the rest of the city? Great question? You know, I think the lower East side is somewhere in the middle. As far as the whole city is concerned, you know the hardest hit. Neighborhoods are up around 26:27 percent in those just those four industries number one in the city is Elmhurst in Queens. You know in part because lori said is actually particularly vulnerable to those first two categories: about seven percent of lower east side residents, work in restaurants and about seven percent work in retail, where it's a little bit lower than some of these other hard hit. Neighborhoods is around, for instance, personal care, nail salon workers, but also barber shops and salons. You know in Elmhurst we saw that over a quarter of the workforces in those industries on the lurie side is about 17. On the Upper East side, it was about three and a half percent, so that's kind of gives you a sense of the spectrum, so the lower East side is somewhere in the middle, but the middle is not is not great. I think you know, generally speaking, only a couple of neighborhoods in all of Manhattan are in a similar place. Washington, Heights and Inwood is really the only other. You know, or the only other neighborhoods that are seeing similar job losses to lower East side and the rest of Manhattan has done better. It's faring a little bit better and then some of the very hardest hit neighborhoods, as I mentioned, are really you know: majority immigrant communities in particular Elmhurst, Corona and Queens sunset park in Brooklyn, Norwood and parts of the Bronx. You know that you see 25:26 12,27 just in those four. Thank you. So thank you for all these figures. It's really interesting- and I you alluded to in the beginning- averages really do not work in our community. We have, I think, we're the second or third of the 59 boards in the income diversity gap, so it's kind of like having, as I've heard it described one fire one hand in the fire one hand in the freezer and saying everything's great, I'm wondering because of this we have in past divided our district into 10 sectors, because we have some extremely low income right next to some extremely high income. For instance, you mentioned that the district is aging, but in parts of the east village it's getting much younger and more single, and I was wondering if, after the meeting, if you might have the some of the information more localized than the full board, I mean yeah. That's those are great points and that's absolutely right and we do have more localized information, absolutely and you're right about the age. Demographics I mean the the fastest growth in terms of age in the lower East side has been 65, plus or 62 plus, but then the second fastest growth was 25 to 29, so so you're. Obviously right I mean that's the split that you're, seeing and again that you know the median income household income is about 40,000 a year. You know which is only two- thirds of the city- wide median after the media and city- wide, but the average income is now up to over eighty thousand dollars and that's really been pushed up by. You know a smaller number of much higher wage earners. So all that's absolutely correct and I'm happy to share a little more of that data. That's helpful. That would be great. Thank you, megan you're, next and then guest bar you'll be the last question related to this and then we'll move into your presentation. Thanks Eli. This is really interesting. Just a couple of questions: what boundaries were you using for lower East side? So this is basically the census district, which is almost analogous to the community board, but not quite so I can. I can give you the exhibit. It's also the puma. If you're, you know, if you're looking at census data, but that's what we're looking at it's about the same you know similar, but not exactly the same. That makes sense, and my other this might be a silly question. But Joe can you go back to the last slide with the percentage of jobs lost? How because so the percentage point is the percentage of total jobs lost since February. So if restaurants are 112,000 and they're 68 percent, how is performing arts and sports only 30,000 jobs lost in that 69? Is it percentage of in that industry? Yes, exactly yeah, sorry! This is not clear enough, but yes exactly so it's what share of total jobs in that industry have been lost since February. Exactly so said, almost 70 of all the jobs in the performing arts right we're lost since then, and that's thirty thousand jobs, because there's just fewer jobs in general than there are, for example, in full service restaurants, but that's what the data is showing, I'm actually surprised more jobs were not more of a percentage was not lost in full- service. Restaurants, I'm surprised to see even 30 percent of the people were still oh. You know why it's because of the ppps, people yeah exactly yeah, definitely a big factor. You know people had the companies had to bring bring people back so that they could have those loans forgiven. That's definitely a big part of it. You know people were still doing delivery, so you know some full service. Restaurants stopped being full service, restaurants, but still stayed open. So you do see that a little bit as well. The one other thing I wanted to mention that you know it's harder to capture this in the data by either industry or occupation, although you do see it with the accommodations jobs of which you know, there's. Obviously a lot on the lorry side and many of those jobs have gone to neighborhood residents, but just the overall impact of tourism. I mean it's one other thing, that's just worth putting out here that you know you see traveler accommodation down fifty percent, but also so many of the and air transportation and transit and ground passenger transportation. You know those are all just tourism, specifically tourism industries, but so much of what the what else we're talking about here has been fueled by tourism. You know, I mean the number of tourists in New York City has more than doubled over the past 15 years. You know we had 65 million tourists last year, the most you know ever in the city's history, and you know it comes with a cost that all of us new yorkers know when we're dealing with in better times, frankly with walking down the street and feeling jostled by tourists on every side and that kind of feeling. But the reality is that tourism has been an incredible economic boom for New York and in surprising ways at least surprising to me better quality jobs than I might have expected. Some of these jobs are very low- wage, but some of them have been, you know, do offer you know middle- wage opportunities, and I think we've seen some of that on the lorry side in hotels, but also in all of the restaurants and bars and retails retailers that have been fueled by tourism. You know it's not just local shopping in all of these places that can kind of make ends meet. So it's just something else. I think it's worth pointing out, but as tourism has become increasingly important to the lower East side's economy, it makes the lower east side more vulnerable to this particular crisis, whereas in previous crises like the great recession, which you know, hammered jobs and finance but did not barely touch jobs and restaurants in New, York City, at least it also is. You know, previous recessions have kind of borne out the idea that that tourism is relatively recession- proof and obviously this particular crisis is wiping out those gains as well. So it's just one other thing we're thinking about in terms of the broader effects of the crisis. You know globally, on you know in just one community here in New, York Gaspar, your next for your question and for your presentation and then I'd also like to note that David has posted some links in the chat that everyone should look at as well. My mine may be more a little bit more comment than questions, but a little bit of a question. You know I am not nearly as adept with data analysis as Eli, but I've looked at a lot of this stuff myself and I wanted to clarify for those who may not know that there's two ways to cut employment data you can cut it by businesses or by workers, and I think that a lot of what Eli has shared tonight is maybe more by workers and then another point just to make that we have. You know, learned from Eli, so much about the people who reside in the district and where they work, what kinds of jobs, but there is a lot of information about the businesses in the district that are employing people outside of it and that's significant as well. So that might be a little bit about where my question is Eli, on what you might be able to say about employment losses for the categories of businesses within the district, as opposed to the residents who work anywhere in the city in those industries. Yeah. Absolutely it's great point. Scottsburg. Thank you. I mean, I think this chart. That's actually on the screen now gives you a sense of that. Just in terms of this is where you know, we've seen the most striking job losses and, in terms of you know the kinds of businesses that are on the lower East side. Certainly, I think you do see those same two top categories: restaurants, retail, definitely a big one. That does not pop up when you look at occupations, but absolutely as a factor are those cultural venues of which there's so many and it's everything from movie theaters to you know performing arts centers that have all. Basically, you know suffered some of the worst job losses. I do think that the tourism related is another big category, where it's not just employing people who live on the lower East side, though many do, but is drawing workers from all over the city. You know who work in the hotels on the very side in particular, and that's a factor, and you know within all of these kind of hardest hit categories. I think those are probably the biggest and then you certainly have other categories of people that live on the dory side that are commuting to other parts of the city. Construction being probably a big one, you know some of those folks are working on construction right there in the neighborhood. Many others may be commuting to other parts of the city. You know, I think you know the biggest, maybe differentiating factor when you think about the workforce that we're looking at is that very few of those relatively insulated office. Jobs are on the lower East side. You know those are folks who live on the lower East side, but they're likely commuting elsewhere. Now, that's changing! Obviously, there's office, you know going up at Essex Crossing and there are. There are some office type sectors on the lower East side. Some, you know you know small accounting firms and you know very kind of locally focused office jobs. But in terms of you know some of those bigger categories, the manager categories, the you know, financial services categories. You know those are residents that are likely commuting elsewhere. You know, to a certain extent more office. Jobs in the middle military side could potentially insulate more residents as well, but gaspar, as you know, you know so well. There are really steep barriers to accessing those types of jobs, so you know to a certain extent. You know part of the strategy and I know and we're huge fans of lesson at the center for an urban future, but it's around you know pooling the demand within the neighborhood to try to create local employment opportunities, but that's also targeting folks, where you know some of those barriers may be a little bit lower and there's a way to kind of go from point a to point b for a lot of the jobs that have been most insulated. You know you're, looking at a bare minimum or baseline minimum to access those jobs of a four- year, college degree or even more and the huge disparities in terms of attainment for those kinds of credentials definitely changes. The dynamics of you know: who's able to access those jobs. Those industries that have been you know much more insulated from the crisis, so that sort of speaks to your point. A little bit gas bar yeah great gaspar. Do you want to start your presentation Joe? Do you want to pull it up and then one thing I just wanted to say before Gaspar and David Speak were. Thank you so much Eli. I hope you'll stick around for this part too. Just to hear about what David and Gaspar are going to discuss is that you know when we think about recovery, and you know how we'll move forward as a city and as a community district workforce development has come up as something that's an important piece of an equitable recovery for the economy and obviously Lessen is our. You know our best workforce development providers, which is why we wanted them to speak. I also wanted to say, because this is, you know, we're sort of talking about the district needs. Also, you know by the time like by next year, we'll also have the 14th street tech Hub, we'll sort of be starting to move a little bit more. It's still, obviously in construction right now- and you know, CB3 has a role in the Community Advisory Board for that. So I think, there's an opportunity here also to sort of make sure that sort of a signature workforce center around a growing industry in New, York City. You know that we continue to learn about. You know, workforce needs and advocate for things that our district needs so guest bar I'll turn it over to you great. No, thank you so much and thank you Eli. That was a really phenomenal presentation and really appreciate the data. It's really hard to dig into and dive into this stuff. As someone who has tried to do it, I can really speak to how helpful and valuable it is to have experts such as center for an urban future. So you know I'm the partnership director for the lower East side, employment network and I'm joined tonight by David Garza, the executive chair for the network, but also executive director for Henry Street settlement, and we just have a very kind of pretty straightforward presentation, just to kind of give you all an overview of what workforce development industry actually is and the state of it under the current previous to the pandemic, but also now under the current duress and crisis of the economy and then try and wrap up with some recommendations that we have gathered and gleaned from the Workforce recovery group. That David Garza is actually a part of led by New, York, City, Employment and training coalition, and then last also a little bit about what lesson is up to during these times. So this first slide is just to reorient everybody to what lower East side employment network actually is who the member organizations are, we name them as partners. So when we talk about partners, we're talking about our actual constituent organizations and you'll, see here, there's eight and five of them provide really robust, rich Workforce development services. The others are referral partners who refer into those services and we always consider community board three, a highly valued co- founding partner, so we actually describe you all as a partner within the lower East side, employment network, so David. I think that at this point, I'd like to hand it over to you- and this is where we're going to kick off the orientation and introduction to what workforce development industry actually is. Thank you gaspar we're grateful to have gaspar on board. As our partnership coordinator, I want to thank Anisha and Susan and Eli for all that information. I echo you know Gaspar's statement that we consider the community board as partners, in fact founding partners. I was fortunate enough to be around when the network was conceptualized and when it was founded and when it was launched- and here we are 12 more than 12 years later, having accomplished a thousand job placements in the district and we're going to do as good a job. We can tonight of trying to be really concise and hopefully open it up to questions because as community- based providers that make up the lower East side employment network- we're really you know every data point that Eli shared there's a human being behind it and that every human being behind us either trying to feed their family or trying to raise a child or trying to take care of a senior or trying to keep a roof over their head. And so our mission, centered focus about trying to attach people to the labor market is really sometimes a question of survival or not for the people that we serve. We generally serve the residents of the neighborhood that tend to be either marginalized or not connected to the labor market, but the field as a whole is really responsible for that for connection to the labor market, for training and education, as it relates to employment opportunities for advocacy and then for retention and support services and the circles you see on the on the first slide really represent all the stakeholders and New York City is you know in many ways one of the most dynamic cities in the world for Workforce development opportunities and possibilities, and that density and that kind of vast spectrum of possibilities translates into a system, that's represented by a vast number of stakeholders. So you have the labor market. You have us community- based organizations, you have the education system, you have philanthropy, you have government, you have the Workforce investment board and then you have a number of intermediaries, partners and data, and research and analysts like center for urban futures and our friends there, and you know we frequently partner and connect with center for urban futures, whether it's Jonathan balls or Christian or Eli, just to really kind of meld the data with the story and see how the kind of work hits the street. If you will so like many things in New, York City. I think some of our greatest advantages can also materialize as real great challenges. The system, the workforce system as it's represented, is very frenetic. It is vast, acrosss, all the different components that you see and for an individual who is trying to gain the skills or the support to attach to the label market. It can be formidable to navigate and that's where our role comes, in, to try to help people attach the labor market and stay there and grow just so. You have some perspective about what it looks like on lower east side and then we'll go to the to the. So. As I mentioned, lower side, employment network has done about a thousand placements since its inception, with an average of 120 placements a year, but the community- based organizations that make up the network. We also do placements outside of the network activity and all told that probably adds up to about a thousand job placements a year. So that's just to give you some scale in relation to the numbers that Eli shared and I think it underscores something when we get down to either like the need statement or recommendations that there's considerable opportunity to invest more in Workforce development training- and you know, resources and money is often the low- hanging fruit in terms of recommendations. But you know aware of the belief that if you do not resource a function, you do not get it and that money equals mission and in order to help individuals gain the skills, education and training they need. It costs money as any business. You know owner or anyone will acknowledge and recognize that you need to put money in the system in order to yield good results. So in the spirit of moving along gas forward, we go to the so that we can make sure that we hit on a number of things. So, as I began to mention that you know, New York city system has a number of assets and strengths and a number of challenges and liabilities on the strength side, Henry Street and the organizations that make up the lower East side employment network. The eight of us are amongst 200 community- based organizations that provide job placement and career services to new yorkers who need that support either unemployed, underemployed or have been disconnected from the from the workforce we represent and serve about half a million people in New York in New, York, acrosss, the city system and out of the lower East side organizations. Out of the I said we place about a thousand people a year. We probably work with at least twice as many as that probably work with 3,000 people, not every outcome results in a job placement. Some go on to school, some go on to training, some have certain obstacles or circumstances they need to resolve and go on to social services. Some go to other paths, so we generally have and the lower East side. Employment network has a three to one interview to hire ratio that ratio of the people we serve versus the people that get placed is very similar just to kind of keep scale in mind. I think some of the assets of the system are there lots of creative programs like the lower East side, employment network, where our mechanism was a response to anticipated economic development and largely all of these phonetic stakeholders put community- based organizations in a position where they're more likely to compete for resources than to collaborate and I'm proud to say on the lower East side. We would literally turn that upside down and we collaborate as opposed to compete, because it was really about not leaving businesses without an efficient way and an effective way to connect to job seekers on the lower East side and creating a mechanism where job seekers would not fall through the cracks and be able to connect to those opportunities and the organizations that helped them do so. Excuse me one saying thanks. So, in addition to innovative and creative program design, we provide a lot of wrap around services when Eli mentioned that the lower side is to tell two economies. It is in many ways like from one side of the district, to the other, I think, on the furthest corner northwest in the neighborhood, we have an area immediate income of close to 130,000. If you follow that line to the census tract directly east on into the public housing development, you have an area of media income closer to 17,000 a year. We generally serve the individuals who are low income or who have been disconnected from the labor market system and so providing wrap- around services, whether it's financial literacy, child care, referrals and resources to other resources that could help people either stabilize or resolve circumstances in their own. You know in their own lives or their in their own households that can materialize as obstacles to employment is another really important role that the community- based providers on lower east side play and then, of course, advocacy and analysis where we get to look with a little bit more proximity and granularity to what's happening in the neighborhood. In order to advocate for approaches like the lower East side, employment network and really turn policy issues into service solutions, which is really the task at hand. In the face of this extraordinary pandemic, and we'll talk about that as we go on some of the challenges in New York City are the fact that the city system is workforce system is funded, acrosss, many different city agencies, and so it inhibits the ability to have clear accountability and vision as to who is responsible to develop the system. We also have a system that is led in many parts by the stakeholders that were on the previous slide and that business writ large is not a as strong as of an engaged partner as it could be, and that we've seen in other cities as models, integration, collaboration and competition, can be challenged because of the way that funding streams and resources are fragmented. Acrosss. The system and excuse me, as I began to mention before there is a dramatic under investment in the resources necessary to really reach all of the individuals and job seekers and all of the businesses that might need support, and that's illustrated in a couple of examples like, for example, the city several years ago, introduced a program called career pathways, which was intended to take job seekers and connect them to opportunities. That would put them in a position to be mobile throughout a particular sector, whether it was in the tech sector or the hospitality sector or the construction sector, and gained additional skills as they went along, it was targeted to young adults. It was a commitment that the city originally made for 70 billion. That was ultimately supported at a level of seven million dollars, and so it really is dramatic under investment in some of these opportunities and, of course, as we're seeing firsthand through this pandemic, I think nationally. The number is 40 of Americans, and certainly this probably plays out even more dramatically on Laurie's side only had 400 in the bank when this pandemic hit, so the exposure and the vulnerability become marginalized, just really exposes to initial point: the lack of equity in this system and the lack of economic inclusion. You know in the solutions, I think largely our workforce development system in New York provides a really vital service, because if someone is trying to accomplish those things that I mentioned before, whether it's a roof over your head or food on the table, a job is a necessary component. But to not have an infrastructure where you can navigate meaningfully to jobs that are going to provide some level of economic security is really a challenge, and I think we're seeing what the absence of that depth of the social safety net can translate to and from our estimation. But we're really at the tip of the iceberg. You know we at Henry Street anyway, have really looked at this as a kind of a triathlon with the public health and safety race. First and now the economic trauma and triage period, which we feel is going to be at least you know, number of years long and then the recovery and rebuilding, and so we feel that we're just getting started and there's going to be lots of opportunities to provide really necessary support to the job seekers that we serve. Guest. Boar, please great so this to get to the question that Gaspar has Eli before this really kind of puts some of the worker and equities in sharper focus. If you look at the data, you can see that communities of color have been disproportionately impacted, that younger people have been dispersionally impacted and that educational Attainment has really exposed. All of that vulnerability and fragility of the system that we've spoken about, I shuddered when Eli was presenting, because in the one graph that showed unemployment bisected- and there was four red bars, the red bars represented the construction, retail hospitality and human service sectors. Those are all the top sectors that we've placed people in over the years that I mentioned and referred to our performance, and so, in addition to the disproportionality and inequity reflected here, we've largely been very successful at placing people in the sectors that have been most decimated by the pandemic. We have a signature program for limited English speakers. That's placed hundreds of people in hospitality roles with virtually all of them and ending up unemployed when the pandemic hit. Some of them are just starting to return to work now, but the domino effect that that's create that creates, for example, is that particular program, and so this is a little bit of a preview to one of the recommendations. What the funder for that particular program is concerned about is the potential of discontinuing funding the program in the absence of job placements, because largely the New York City Workforce system is a paid for performance system and that's understandable. But what we're seeing, especially in the absence of an active labor market and after labor market sector, is that if you find a system that rewards and pays for performance, people are left out of that equation. And so how can we make investments in people during this time in order to prepare for what we hope is inevitable? You know return to a more active economy, a more active labor market, because this is really critical time and so we're doing everything. We can creatively to extend resources to provide people with vital skills and training that they'll need and we'll come back and circle and talk about that a little bit more on our recommendations. But the marginalization of the communities that we work with is exacerbated in a way that is acute and intense and we're going to be up against it for a long time. So this graphic, as well as some of the information that I pointed out, illustrates that we go to the next one guest store. I think we're I think, we're talking about some of the challenges in inequity, and here they are kind of outlined in bullet point. The digital divide is certainly a concern. We've seen that with people connecting to educational opportunities, but certainly people connecting to jobs that have some level of resiliency or sustainability in particular in this circumstance, but in the certainly in the future, that's going to that's going to stay the case. Small businesses, most workers in New, York, City 67 of the city's workforce, is connected to small business, so without small business engagement support an inclusive and equitable recovery is going to be really tough, the density of impacted sectors. We talked about hospitality and the other factor we're really working in with zero sight lines to how things are going to open up. We have some levels of optimism because we are trying to focus on like that hospitality program that I mentioned before. What the funder has challenged us to do with the funding at stake is to pivot and find a new sector to of the labor market, to connect our participants to that's, going to be very difficult in a short period of time, we're fortunate that we were able to leverage some of the ppp support to create a longer runway and right now we are diligently looking at other sectors like advanced manufacturing, industrial food, prep or commercial, food, prep and other sectors that we might be able to pivot to. But to do so with that kind of pressure and intensity and with people at stake is really challenging. So we're fortunate that we're able to extend the runway a little bit, but essentially we have less than a year when the sight lines are certainly completely obscured. So it's going to be very challenging to make sense out of that and let's go to the next one guess bro. So these are recommendations. So, as Gaspard mentioned, I'm on the board of the New York City Employment and training coalition. I've also been part of the state level workforce, recovery strategy group and I'm also on a NYCHA post, Covid-19 recovery group and a lot of the concerns and the recommendations that are being made are consistent, and so that is to invest in education and training now to try to identify public works and infrastructure projects where we can anticipate job creation and therefore know where to prepare people and attach them relief programs, because I think some of the challenge here is: we have to do the triage, but then we have to do the investment in long- term recovery, but there absolutely has to be some relief in the absence of job opportunities and then, of course, small businesses and support for other businesses that are that are amongst the stakeholders. So with that next one guess what so? This is where creative solutions from the ground come in and I'll. Let Gaspar talk about the network and then we'll open it up to questions after we get to maybe some more refined recommendations. Hey thank you, David, and no just echo your gratitude again. Thank you to the committee to invite us to present to you all and ultimately the point I think was to try and orient some of those of you dive in a little bit more about what Workforce development actually means. I mean, and we did kind of touch on that and get into it, but it's really hands- on it's very face- to- face very one one- on- one when you're talking about vulnerable communities. You know the digital divide is very painful when you have people sharing at best one device acrosss, you know a handful of individuals and it might be a child who's in school. Trying to do remote learning in addition to an adult who's trying to pursue work or retain work is very difficult. So we touched on the digital divide, we're trying to continue remote programming that has been inhibited by the fact that the programs that are tailored for specific sectors and industries are among the ones that are hardest hit. So we have very much built out retail customer service and hospitality trainings and those are the ones that are closest to the drain at this point. So what we've really been focusing on is delivering social services, relief and recovery work. A lot of our Workforce development staff have actually been on the ground, delivering meals, climbing stairs in public housing in tenements, etc, to really try and relieve a lot of that pain. So some of the other things we've been up to is technical assistance for our staff, who may be struggling with some of those digital skills themselves, but also to try and get them this very picture and presentation to them. So something that we're going to be doing is sharing this recording with the partners because of what Eli provided being so helpful and honestly rare to get access to, and also something that we're really trying to keep an eye on is what this is going to look like as the economy starts, to really be a more stable version of its postcovid. Be it you know the tanked economy with high unemployment, but it'll be a more stable version of that. We're anticipating a really tremendous amount of mental health needs. So that's something that we're trying to identify resources and solutions for so with Henry, Street and Grand street settlement deploying their neighborhood resource center, but also the community resource center that Grand Street is opening in the former Grand Mo. Cafe is some of the stuff we're up to so you know again. This is just a visual of who we are, and in the interest of time, do you want to pivot into Q&A, because I think that the most important facets have been touched on already and we will be coming back before the committee in the fall to present to you about what our fiscal year actually looked like. So I think that at this point we should probably hand it back off to you anisha to help guide us into the Q&A portion and I'm sorry I just want to. I just want to button up one piece in each I'm sorry, so I think that this you know what gas power is being do. There's four trust, there's four pathways: maybe five right, there's attachment to any jobs that exist now and so we're starting to have some activity resumed on that front. But it's about a third of the level that we had at this time last year, so we've had you know I can speak to Henry Street directly. You know we've had close to 70 job placements since March this time. Last year, we've had probably triple that so attachment to whatever jobs do exist is still a priority. Redeployment and some of the articles I put in the chat were about. You know we redeployed some of our arts workers to work at food pantries to work in our meals on wheels programs and we've been fairly successful. Fortunately, for the avon's arts center, we've only had the furlough single digit number of people. Everyone else has been either redeployed or working remotely, and so we've been able to achieve some stability there. We do feel that, in terms of an equitable recovery that the that you know the way I've been phrasing, it is that almost for every dollar put back into the workforce system. I've been calling it kind of like a split dollar theory, so that if we go back to what we did previously and invest dollars in this kind of more transactional workforce development system, we're going to get what we got, which is a really fragile. You know not equitable system, and so my perspective is that we need to invest not only in triage and connecting people to employment, but also in wealth distribution, also in asset building, also in ownership and entrepreneurship for people, so that we can kind of not only create. You know not only stop the bleeding but hopefully build up some resiliency, it's our future bleeding and then the other component is training that the one thing we have right now is time, and we really reject this notion that, because there are not as many open jobs available, that there is not an appropriate investment to be made in workforce development, we know that technology is going to be needed. We know construction jobs are going to become available if certain political results materialize, there's largely going to be public works projects or infrastructure projects, so to get people the credentials and skills they need now is really imperative, because for a neighborhood or a city to capitalize on any large- scale, investments like that you have to be ready to go, and it would be really catastrophic if we waited and sat in our hands and did not make the investments to be ready when that came about. So we think really training is imperative and then support for small businesses, whether that's wage subsidies or other creative ways to get people to work and help businesses get back on their feet. So I just wanted to punctuate it with those pieces before we went to Q&A, but thank you again for the for the opportunity. Thank you guys. So much we'll open it up for questions we'll just give it a couple of minutes. If anybody has anything, I actually have one or it's more of a request I would say, is that I you know definitely would want to keep the committee updated, as you guys figure out what the sectors are, that you might pivot training programs or any of these programs into you know. I think there has been conversations. Certainly you know cuff has facilitated some of them about like what the growing sectors of the economy are and if we do live in, certainly in Manhattan one of the most unequal districts you know, we've always had you know underemployment or people who have been left out of the labor force, but now we have so many of them in a variety of different skill levels and how we sort of appropriately get folks back into potentially better wage and good jobs of many kinds. You know people have been talking about manufacturing. I do not know if manufacturing is going to save the lower East side, but certainly tech or anything else. So as you figure that out, it would be really great to hear from you guys about it and then Olympia does have a question. So yes, so thank you so much for your presentation. I was thinking along the lines a little bit of you and yourself, but basically, two questions that would be useful for us is once how were you impacted by the recent budget cuts whether there are specific, you know, streams that were cut, that you would need, and we need to make sure that you know we ask for them to be reinstated or amplified Et, cetera and also locally. I mean in terms of workforce training, I'm assuming that now I do not know if you were able to move some of your Workforce development online and are you training people for digital jobs, because especially the younger people may have you know a faster chance of getting back to work if we were able to provide them with this kind of training. So when we write artistic needs, etc. If you give us this kind of information, we can, then you know do our best to help you sure I'll. Take the first one I'll. Let Gaspar take the second one on the tech training. As far as far as budgeting goes, the lower East side, employment network budget, which really supports Gaspar and his colleague Carmen Lynn, because they play a kind of a pivoting role in between all of our organizations- is very stable. Right now we have two years of funding secured. I have to say that most of our philanthropic partners have provided a lot of flexibility in terms of utilizing existing grants in whatever way we need to you know, our concern is about future grants. So that's as it relates to lesson. I will give an anecdote on some workforce funding, because that is where I think some of the advocacy and the needs statement needs to go that we have seen like one of the one of the city. Council initiatives, for example, is cut 26 percent a lot of private. A lot of privately supported programs are being cut. We saw summer youth employment, which normally like so Henry Street, has a contract. Normally we do 1700 youth. Every summer. This year we have funding for less than 500, so that was cut dramatically and we've been able to supplement with that with some private funding. So it's really kind of stream by stream, and that is of great concern for us because of this again what I shared. I think this either approach that, because there are no open jobs there, no immediate investments to be made. So we right we presently right now are stable but reduced, but very concerned about the future. As far as the funding question goes and I'll, let Gaspar speak to some of the tech because we did have a tech pilot and we are in some conversations there yeah, no we're really hopeful and optimistic about the tech sector and tech training. As you all know, we did pilot a bridge to per Scholas I.T support training. Last July and August. It began with eight participants and five graduated one had to unfortunately leave because he could not afford train fare to get to the training program and then another one identified that it was not the right sector for him and then the third who dropped out. He could not participate in the program because he needed to have access, build his income and get employment right away. So you know those speak to some of the issues that we hope the board might be able to advocate. For you know, mobility is a huge one. You know how do we train people for jobs when they can't get to the training or get to the job affordably? So you know that's a big one and hopefully there's some opportunities for innovation there with alternative forms of transportation. When people are afraid of getting on subways or they do not have access to vehicles. What can we do to make walking and biking safer and then also with regard to having people be able to complete training in order to get to the job that it that the that requires that training? We need to figure out how to have some sort of a wage, subsidy or wage replacement for the individuals who are in need of upskilling reskilling or redeployment for new for new work. You know the individual who did drop out. He was highly qualified. He just lacked the english proficiency, but because he could not stay in 20 weeks of training without working income, he could not participate in it. So, as a result, he went into a low- wage job or pursuing a low- wage job, and it dragged on for a good six to nine weeks of job search. If we could figure out a way to subsidize that so that he could participate in it, he would probably be thriving in a remote work environment instead of probably what is unemployed right now. So those are a couple examples of what that tech training would need and benefit from. With regard to the board's advocacy with city government, we're hopeful that we can do something again in the near future before the Union Square Digital center, the civic hall at Union square site opens because it really could be a boon for the neighborhood and the district. So you know those issues will still be there. When the building does open. You know the need for income and the need to be able to get there safely will continue. So those are a few of the things that we hope will be changed and affected for the upcoming year. I think, can I underline a little part of that answer. It's. I think, because I think the Need statement needs to that program. There's a term that gets thrown out called bridge programming and it's generally for someone who does not have the skills that make them eligible for employment in a particular sector, but they have to meet certain kind of prerequisites to get in the training. The training that we did was like an on- ramp to a bridge program. So it was real remediation for people who would might not be eligible for a tech training program and they needed some prerequisite skills. And so the advocacy point is you know, I call them on- ramps right, because a bridge with no on- ramp is a bridge to nowhere. And so I think the advocacy point is to build on- ramps to programs, because you know some of the information that Eli pointed out, like 26 percent of people have less than high school diploma. If high school diploma is the criteria to get into a bridge program, then we need support for ged programs or for high school equivalency to programs or to get people up to reading and math levels they're going to make them eligible for the training without the certificate, so on- ramps to to bridges is the way. I would under underline that Susan. You have the last question. Okay, thank you. Two questions. One. First of all, talking about funding, and particularly the bridge bridge programming, does that funding come from an agency. Is that more grants and City Council money comes from the city agency, like the Career Pathway, one that I mentioned was intended to come to DYCD, and I think part of the challenge is the way that it's structured, like the different city agencies that have workforce dollars actually have different deputy mayors. So it's really hard to kind of stack and find the accountability for you know where it stacks up to the department of small business services has some training dollars as well, and then there's areas and departments where things are very purposely funded like, for example, Department of Social services. Like we have a jobs plus program in the district which is embedded in public housing, it's resourced. You know very stably, and it's been it's been that way for years. So it's that disparity, acrosss city agencies, but it's more so from agencies than from the council. It makes it difficult when you have all these agencies, because we basically have 25 expense priorities and it sounds like that's going to be, and maybe we should get a list from you later. It sounds like that's going to be split, acrosss, a number of different agencies. It could be or maybe so we should talk, because maybe the recommendation is, you know, put it somewhere solid, so that's not so fragmented and diluted, acrosss, the city agency. I do not know if Eli, if you have a perspective on that, not to pull you into this response, but you have an advantage or I mean just to completely agree, and I think the fragmentation of the system is one of the biggest challenges that we face. I mean acrosss the board. Obviously organizations and Gaspard just spoke to this so eloquently. You know need the flexibility of that funding, if possible, to be able to meet multiple needs in the way in the wraparound way that Henry Street prioritizes, but if you've got one funding source that can deal with food insecurity, another one that could deal with transportation, another one. That's just focused on training, but it's only based on placements or you know. You need to report that outcome to actually get paid. You know the system can't function, it does not function well in the best of times and it can not function in a crisis. So I mean it's just to say that I think from both perspective, certainly- and I advocate for this when I speak with folks in government, but we need to make these contracts much more flexible and to blend funding where possible, but also for the private. You know philanthropy out there that you know there's a real need to just kind of give flexible dollars to the organizations that know what the needs are, so that they can cover these multiple needs and there's certain situations where you know simply for lack of something like a metro card. You see that somebody can't participate in a program that could potentially change their lives, but it's a short- term need that can't be funded with such restrictive streams. So I mean just I echo that sentiment and I think there are much bigger changes that need to be made at the at the state and federal level as well, but the city, certainly the city, has chronically underfunded workforce development period, but it's connected to a lack of flexibility in terms of how those contracts are set up. So those are those are issues that the city needs to confront. I think, to the extent that you're able to potentially help close some of those gaps by by making sure that funding can be used more flexibly to address these multiple barriers that folks face. That's the best possible, I think, solution, because it's the on-, the- ground organizations. That really know what's going to make the difference- and I just I'm so struck by that previous point- that gaspar mentioned, because I hear about this all the time you know for lack of a metro card, because I need to take that immediate job that does not pay well, but because I need the cash in my pocket right now, and these are the barriers that or child care is a huge one. These are the barriers that prevent people from you know being able to actually persist in these programs and not just in workforce programs, but also in in post- secondary education. So I think those are just absolutely critical to get this right and it is important that you're able to you know make some of that funding possible through at the local level. Okay, thank you. So I think some of that needs advocacy from us aside from the formal budget process. It needs a lot of advocacy. My last my other question gaspar talking about the mobility and the getting to training. Do you see that, in with people in community board three? Is that a need in community board three, or is that mostly outside? Well? The truth is that, although we're preparing and training them within our district they're going to be traveling for work, you know we have facebook on astor place, but you know that that's about it other than the startups in the district, most others will be working remotely or traveling, and you will be seeing some issues of mobility there. One of the, for example, the advanced manufacturing that David mentioned, we're currently speaking to the New Jersey Innovation Institute, and it will be a remote training program if they are able to acquire the grant modification to be able to partner with us and eventually, when they complete the 80 hours of training remotely, they will need to travel to a factory somewhere in the metropolitan area. Thank you. You're welcome the single most source of flexible funding. We do get, though, does come from City Council, just to note that it's the jobs to build on initiative, we've received it for over a decade and and that's one- and that was one that was cut 26 and we do have some flexibility within that one. So it's I just wanted to make sure that was included as as a point. Thank you. Thank you all for coming and speaking to us today. We really appreciate it. I think we learned a lot and we'll probably have some follow- ups for the specific district aid statement, so I'll probably be in touch with you about that so feel free to pop off now, and we have a couple more things that the committee needs to take care of thanks. So much. Thank you. Thank you thanks. So much it's a pleasure guys. Okay, great! Thank you all for staying through the presentation. The next thing on our agenda is just an another look at the district needs statement. There were three items joe. If you want to pull it up on the screen, there were three items that we had just said that we wanted to discuss again- or you know, have some discussion about. I made all of the other changes. I think the biggest one was really this inclusion of property owner or landlord in the district needs statement, and a discussion of you know who, if we are going to take any sort of position, even though that's not what the district needs statement is, but to say something about small property owners or small landlords, and what the impacts of the pandemic have been on. Those who are not the sort of big time players in the real estate world. That was sort of the discussion point that we wanted to get to. I did do some research and Susan and Megan and other folks did some research. There is no good answer or definition for small property owner, I think, probably because nobody wants to actually define it because it'll exclude or include people, but we did find a couple of proposals at the it's at the bottom. So I wanted to know if anybody had thoughts on any of those and then we'll move through the rest of it. The rest of the district needs has not really changed that much, except to do cleanups of what everybody else brought up the other day or last month. Alastair. Thank you. No. I had the same comment with you. When I looked at this and I try to see the definitions of a small landlord, I think it's very difficult to define it because I mean I can go into it. The way ownership is structured and people have percentages and buildings. You know a father might pass it on to his kids. So now you have five people out in a building or owning several buildings. It's a really slippery slope, get into a definition of what a small landlord is. So I'm not sure if we can just say small landlord but avoid defining it, because I would, I do not know how to define it and I've thought about it quite a bit and it's and it's a very complicated thing because of the way ownership is structured in with properties. So that was that was my one comment. I think what you've? What's there? I think on the second major highlighted point where you say I said this at the last meeting. Retail stores that do survive in our community are threatened by increased security deposits. Utility utilities taxes. Can we just some- I mean rather than me explaining the reasons why some of that does not quite make sense. Could we just say due to the increased cost of doing business, which is a general all- encompassing term, because there's a lot of factors that are affecting small businesses in many ways, so if we can just or we can go through- and I can dissect that and give you comments on that, but I do not want to use up that time if I do not have to- and I think that was I think- on the merchant organizing additional opportunities for city support, I think on the one item we could we could include there again. Is you know the city looking to reduce the cost of doing business in the city, because that's what I'm hearing from a lot of the small businesses- and this was before the pandemic- where it was just there were too many too many things had to deal with, and everything was too expensive for them from labor, which I think we all appreciate the minimum wage and all that and all these other items, but those do roll down and affect the business. So if we could mention reducing the cost of doing business in the city, because I think what I saw before the pandemic was businesses were leaving and now with the pandemic, it's been that's kind of triggered, hey man exodus. I also agree with you on both of those points. I was not sure really if that sentence fully made sense to call out each of those things anymore, but we did do it for a reason last year. So you know if anybody else has comments on that would be great. I think Megan also had brought up the cost of labor as not being in there. So if we wanted to just do it as the cost of doing business in New York City, I fully support that Megan. You have your head up. Yeah I was going to. I was going to say the same thing I think we can. I think we can sort of summarize that sentence into like the rising cost of doing business in New York City yeah, because I you know the payroll is definitely the number one expense for at least I know for hospitality. You know, and the other comment was about the definition for small landlords. Maybe we do not need to define it. I mean I was talking to Gigi recently about this and she said they. Their office really struggled to define it and they came up with something because they had to for their legislation, but maybe we could just say. Maybe we could just say a small landlord and you know and have them figure it out. I mean is not this just sort of addressing our needs, you know so maybe we could even say small landlords that provide affordable housing in their buildings. Andrew yeah, I think we, this is one of those where we know what we do not want, and we do not know how to define exactly what we do want. We do not want Kushner icon that cast the characters who own 50:60 70 buildings in our in our neighborhoods. So I do not know if small landlords is the term of art. Maybe aleister could help us with the term of art, but I do not know that small landlords defines it, but I, but I would agree, I do not think we can come up with a definition of how many units are under people's control or not under people's control. I love the idea of set of including landlords really emphasizing landlords who provide affordable housing. I think that those are the folks we want to. We want to make sure if there are property, tax breaks or incentives or things like that it goes to those landlords. Maybe it's also something that you know. Maybe you do not define it, but it's something like small landlords that do not have the same access to capital or influence with their lenders as larger developers or other institutions may have. I think, that's fine. I would also say whether we, whether we say small landlords who provide affordable housing or we say, affordable housing, operators of affordable housing right Herman brought this up. I mean we do not have a ton of commercial space that we rent out at hazards because we mostly rent it back to ourselves. But if you're a not- for- profit like Herman's crowd is you're not getting much rent from your commercial tenants to begin with, and then certainly now you know they're not paying any rent. So I think small landlords keep that separate and small landlords, and I do not know that you need to call them not-, for- profits, but small landlords and affordable housing operators. Okay, Herman. You had your hand up yeah one thing: you know we tore on landlords and landlords. There are buildings in between that. If you say small property owners instead of just landlords, you know, there's a connotation. There's small property owners and an affordable housing developers and managers. I think I would feel comfortable just say: small property owners that would that would take in everybody sort of that does not have, because I do not think the definition and I agreed people, not the definition, trying to figure out the definition of small property owners and landlords, because when I read what is there all of those items either left out the small cross, some small property owners or they afford our affordable housing managers and developers. You know because, like mutual housing, when you say 10 units I mean I mean 10 buildings, even if you say 10 buildings, mutual housing has 30 buildings, what you're all affordable a hundred percent. Okay, I agree people that you should not define as I've seen on what is it page page two one, two three and four. I probably make it just simpler, maybe about two or three lines anyway, Susan yeah. I can see the need for to include affordable housing, so you can include like mutual housing in cooper square, but how about also like people, our landlords, that house non- profits or arts and culture that need more affordable retail space? Would you want to include them as opposed to just strictly housing, so you're talking about commercial space, landlords of commercials, owners of commercial Spaces, Susan? Well yeah, if you're talking about small landlords is it is not just housing? Is it no? It's not just housing now. So what about nonprofits? What about like on? Fourth street arts block where you have all these little, you know theaters and that kind of thing yeah. I like Herman's amendment of property owners, and I think we can. We can certainly include yeah when you say property owners. It includes those, certainly yeah. Okay, they are not necessarily landlords yeah, they have property owners, but the stuff- and the other thing is where the city sticks, affordable, housing, commercial spaces with commercial taxes that does not gives affordable rentals to small business people. I do not know you fit that in but alistair. You have the next comment and then Susan also I mean not Susan Megan provided proposed language in the Chat box, but it's pretty wordy. I think it's fine. It may need an alex look over. No, I agree with. I agree with all the comments. Herman thank you for clarifying that Megan and Andrew. I think those were all valid points. I agree also with Susan that the areas we've been hit. The most is the commercial spaces, because they're unable to conduct business and pay the rent, so obviously the affordable housing factor is important, but you also have to the fact that you know commercial spaces, whether they're rent to any business that they run into that's, what's hitting the bottom line, the most in our industry, so I do not know- and I assume, when we say, affordable housing. That means regulated housing Andrew, no, not just not just rent regulated necessarily it could be supportive housing for seniors. It's a whole range of it right. Some of the large landlords I was talking about have rent regulated housing yeah we prefer not to, but there's they have a few of us left. But but you know, I think it covers a broad, a broad spectrum outside it does cover rent regulated housing. It covers rent, regulated housing, but there's also other non- rent, regulated housing like supportive housing or housing for seniors or housing for the disabled, etc. Okay, thank you thanks. That's the reason for my comment using the word property owners instead, yeah, I think Megan's language is fine. Are there any other comments to have Megan's? Oh, I have not looked at it. It's small, probably I was amending it just a tiny bit: okay, Alex yeah. Yes, I like that language Megan. Thank you Alex. You put it in the chat, yeah, I'm putting in the chat, so Alex's language is small property owners between space and managers. Sorry providers of affordable housing and commercial spaces and managers that do not have the same access to capital or influence as large owners or entities. I like that. I do too there we go. So, let's use that as where that first highlighted portion is and then let's move on to the second thing, there was a little bit of discussion about whether we wanted to use mom and pop versus independent business or micro business. There are any comments, one way or the other. We should just decide on that as well. I think Richard had a very compelling statement for why we should stay, keep mom and pop, but alistair go ahead. Thank you, sorry. That was me that brought that up last week, I'm fine with mom and pop. I I'm perfectly fine with that term. I just I remember at one meeting someone had brought it up or in some place someone had brought it up as potentially not a correct term. I'm totally okay with it mom and pop is still used, but it can be a little bit politically incorrect because you can have two pops or two moms running a business, etcetera right. It really connotes a very traditional thing. Laura just says: SBS says Micro businesses. So again, that goes back to my earlier comment that micro business is sounds like starbucks or anything, but Starbucks is a chain richard. How are they mike? I understand that I'm just talking about the sound of it sounds impersonal. I think the micro business actually means something different. I think that means like very small businesses under three employees, like that's a term, that's used for specific lending and stuff, like micro loans for Micro. I think that is a different connotation. I do not mind mom and pop I'm also good, with independently owned, which I know Vemma advocates or uses. You know, do not forget the phrase as it's showing is a loss of independent, mom and pop stories. So you sort of cover both thoughts. If anybody has any objections, I think let us know I mean let the group know otherwise I think leaving it as it is fine with me great and then the last highlighted portion was just that the retail do we want to add more items to this list, or do we want to just do it more broadly? As I mean, I think there are going to be a lot of unexpected challenges that we do not fully know that come up. These are certainly the ones that has have historically been challenges for small businesses. I would support Alistair's phrasing, a little more broadly without those items necessarily detailed yeah. I thought we had settled on something about the. I do not know if it was in this section or if we put it somewhere else and just could cut and paste it the increased cost of doing business. Okay, so we'll joe, you have cost of maybe the rising cost of doing business in the city. So well, so retail stores that do not survive in our community are threatened by the rising cost of doing business in the city, and I would say, in New, York City in New York City. I'm trying to look at the rest of that sentence. There is the reality. If you talk to small businesses, I remember talking to my barber and he said because the property values were going up for properties around him. His landlord got us reassessed, so his landlord got a higher property tax bill and therefore his landlord passed a higher property tax on to him, because his lease included a certain percentage of the total property taxes. So this was a big issue at one point, as our neighborhood has more and more as the value of the properties our neighborhood increase over and over and property owners have higher property tax bills, so do the businesses that occupy those commercial spaces. So that's why it's been consistently on our radar got it. I think that we can still prioritize those issues, as we think about you, know, programs or things that we, you know create, resolution or advocate for, but maybe not include it for the district names. So I'm good joe with that change. So thank you for putting it in there. Is there anything else you scroll down this? There was a bullet for workforce, but I will follow up with David and get some specific language. I think Susan correct me. If I'm wrong, we only have to have this finalized next month. So I feel like this is sort of the end of unless there are any other major comments to this, I feel like we're in pretty good shape. All right. Let me let me give a suggestion to work, Workforce development and I'm going back because you know in 1976 77 up to 80 something the city had what they call a workforce development, but it was not enough. A workforce development was called comprehensive employment and training Act. It's a program where youth between 16 and 23 was trained in who either dropped out of school. They came out of the prisons. They came out to stop, but to put them into the workforce. The city had a program I think, was funded by the federal government to train these people in different areas. Career center. You know plumbing electrical carpentry, technical skills, and so they were able to for those who last and it they were gainfully employed. As you go along, you know, some did not make it. Just like lesson was saying that some people for reasons won't make it through the program but majority of those people, although some of it was not handled properly. Those people believe now they're on skill, employment from bookkeeping community, organizing welding electrical plan. You know all of the carpentry, but they were also given a stipend that they could afford to come to work every day and even some equipment like shoes and stuff like that. So I'm not sure if we could present that as a proposal to New York City, because not everybody is going to college okay right, you can afford it. Nobody is going not many people will end up being subbed into the tech industry, but they could do basic stuff that really built the city, because those are the people that actually built the city, the buildings that we live in the you know the roads we work on when we have problems with plumbing electrical carpentry and stuff, like that. Those are the people that actually build New York, you know in the building trades. So if we could propose something that the city would probably look at, I'm not sure they're going to do it right away, but it's a thought proposal that could be presented as part of the Workforce development future process yeah. I think that is somewhere along the lines of what lesson and the New York City Employment and training coalition is looking for, like a more centralized funding stream or like significant program through this recovery period, that will upskill and train people a variety of different skill levels. So I Susan go ahead. I was going to say that is an issue with unions and there has actually been work with lesson with unions with this, because there are special programs where they go into the high schools or target the high schools for recruitment, so that actually is being done through you know through it, but you that has to be done, like I say very carefully through certain apprenticeship programs with the unions. But it is part of the lesson you know has been part of what lesson has done. But how do we define the need just to have it when I was running that program back, then we worked with the union to get the concession on wages, a concession on union membership to run the program, and the unions even take some of those people into the union program. It was not the apprenticeship program in the beginning, it was run by community organizations and that's what this is. I mean Lesson he's a community organization right. You just have to talk to the unions to get a concession in that they do they work with the unions. They've been you know that it happens with them and they unions have been at the recruitment like town halls megan. What is what was the circle back? How do we define our need, then, for workforce development like what would put it together like in a nice little sentence? What do we actually need? We need more funding for it. We need, we think about it over the next month, yeah, let's okay, yeah, let's think about it, but I think it's going to be something related to funding. I, like the nisha's recommendation, that we see if we can get some language from our two presenters that we can then edit modify, etc. Great so we'll have that for September. Are there any other comments on this, or can we move on to our last item great? So the last thing that we wanted to circle back to is the special enhanced commercial district, which you know right before the pandemic. We had approved the resolution for also you know megan, since you sort of led to this in your time as chair. Why do not you give like a 30 second overview for the new folks on the committee about what the special enhanced commercial district is yeah, so we we've been talking about it for years, and the overall goal of this was to increase retail diversity in our neighborhood. One of the problems in our neighborhood is that it's very homogeneous in the type of retail. It provides it's a lot of eating and drinking establish establishments, a lot of service establishments and we were losing a lot of you know, retail, that provided goods and services to our local communities. So we started looking at ways that we could do this, and one of them was through zoning to sort of put certain restrictions on stores in order or in order to sort of get more of the stores that we wanted. We were also seeing you know increased. You know people breaking into two different, you know storefronts and doing larger venues, and we wanted to try to prevent that. So the special enhanced commercial district is a tool that will put restrictions on certain types of zoning. The last point we got to we had written a resolution about it, and then we had at a testful board and then our next step was to do outreach within the community to see how they were going to how they accepted it. But the two, the few major points was that it was going to restrict formula retail aka chain stores in the east village. It was going to restrict the size of some stores in the east village, and that was basically I mean there were a couple of different points, but it was really about like size and frontage, and you know, for the most part, a pretty strict restriction on formula retail. You know this was passed by the full board the month before the pandemic really hit. I believe, and we had put together sort of an outreach plan for June and July that were supposed to be a lot of in- person meetings at various community groups throughout the neighborhood. While you know we had discussed this idea of like is there general, you know? Is the east village really moving towards being homogenous or having too many chain stores or whatever we? You know, this concept of the special district really had not been presented fully. Amongst you know various neighborhood and industry groups. You know we took a pause, obviously because of the pandemic, and because small businesses have been so hit by the effects of closure, and you know really having this committee go out and hold zoom meetings and present this information. It seemed like- maybe it was not necessarily the time to do it, because so many people were navigating so many different things in their lives. But Andrew asked for us to discuss this as a committee again this month, and so it's still, you know on the table, obviously, but I think we need to sort of revisit how we want to move forward with it. I confirmed with Jim sort of the longer timeline just so that we all are like fully aware of what we're working with there was supposed to be this outreach period for a few months, but then a formal proposal has to be submitted to DCP, which was always slated to be sometime in 21 and that sort of sets off a multi- year process of review. So it's not really something that like would happen and then a couple months later, all of a sudden formula retail would be banned. It is quite a significant process to undertake so I want to be. You know. I think we had only really been anticipating a decision from DCP one way or the other in 2022 or beyond. So, given where we are right now as a community, where do people see us moving forward with this? So I obviously I asked to put it on the agenda. I appreciate that doing outreach now with everything that's going on. It's probably not realistic. I just wanted to make sure that this was not seen as something that was dead, that we should. We should not keep alive because one of the things I I'm concerned about- and I've heard interesting people talk about- it is with all the vacant storefronts we have, they are ripe for chains and they are ripe for corporate hospitality to swoop in and grab up those spots. So we do not want the pandemic and the likelihood of more vacant storefronts to open the door for formula retail or corporate nightlife to come in. We want to give small businesses to the extent they a can survive or b. We are seeing some new mall business. New small businesses open right now, a chance to survive, so we do not have to I'm. Certainly, you know not pressing for us to discuss this at length tonight, but I just want to make sure we keep it, keep it on our radar and start thinking about. If we can advance this, how we would advance anybody else, have any olympia, you're mute. Can you hear me now great, so I mean for the benefit of the new members of the committee. I want also to clarify that there has been actually pretty much outreach like it's been going since I was pregnant and you just saw my daughter and I was pregnant with the one before her. So a lot of people have known and have discussed this for many years, and I feel that the need is still there. The environment is changing, but I think the idea of the outreach this summer was more about. You know. We all know that there are the usual suspects that know about our outreach and about our town, halls, etc, and there was a desire from the leadership of the Community Board to make sure that we more aggressively try to engage. You know local stakeholders and tell them about what is the desire and see if there is a any. You know, red flags raised or any further ideas that we did not consider to add, but I think this idea has already been communicated a lot developed a lot and given the fact that that's Jim very well explained to you from the planning perspective. This is not just it's going to be a lengthy process, but, let's be honest, diplois is not going to do it. His department of city planning has so many lawsuits with communities. They did not even undertake any community plans, etc. So I think starting the ball as soon as we can, because it's going to take on probably another administration and it's going to take a lot of back and forth, could be the right thing, because this thing will evolve. That's how the sausage is making in the planning work. So so I think this is also something to keep in mind as we as we discuss everything else. That is happening just to add a little bit more color. To that. I do think there are a lot of folks who have known about this. I think the real impetus for that outreach was it to get allies really in this, like political allies in bringing this forward, not necessarily like your average each village resident, because you know it is something that DCP will look very critically about, and the electeds will look very critically on, and you know there is not a ton of appetite frankly to move forward, something that continues to restrict small business growth, whether you see it in many different ways, it can be controversial, so I think the maybe the best way to handle this is that I do not think we know tonight really how we want to move this forward, but I think we could maybe figure out the time that we want to put this on the agenda again to reformulate, where we want to go and find stakeholders who would be supportive of this, and then I want you to. I wanted to clarify something that you said your reading of the fact that this would restrict small business growth is actually not correct it would it would actually it could help small businesses, it's more, what it will happen with the landlord side, but the small businesses will definitely benefit by that, because, among the reasons that pushed us from the planning perspective to come up with this solution was also you know a lot of speculatory vacancies in the district and stuff like that, and so I think this is. You know a more balanced way of describing this issue. It's the perception, that's the feedback that we get from DCP that that's what it what I mean, whether or not you know it helps like sure, but you know DCP when they have their response about restricting formula retail or any of these things, that's what they that's, what their response is. Otherwise, if that's, how we're going to move forward a couple thoughts on it before we wrap it up, I just I think we I mean we had paused it, and I think that we should continue to pause it. I think if you were kind of going into this with the thought process of we've got too many bars and restaurants in the neighborhood and it's inhibiting other types of retail from moving in well, that's kind of you know: we've had at least I mean 25 places go out of business in the last month and a half, so vacancies are not going to be an issue anymore. If you were coming at it like where you know, rent is too high and therefore other retail can't come into the neighborhood because they can't compete with the bars and restaurants will. Rent is absolutely coming down if you're coming at it with you know, there's too many chain stores and it does not fit in historically with the neighborhood, which you know, I totally agree, but I mean we just heard how many lower east ciders rely on hospitality and food and beverage for their employment. So I just do not really feel like. Now is the time to pursue this alex and then Alistair. I do not. I do not know if we need to pursue this as early as next month, but I think we should keep developing this plan and then decide when it's appropriate to submit it, because you know. Yes, we are losing those types of businesses, but we're also losing other types of businesses at the same time, we're I'm seeing because I see it monthly and I also keep track of it myself in in the press, but I see that new businesses, those businesses seem to be eating and drinking businesses. So I you know, I'm encouraged by the fact that they at least feel like they can still open and planned. Businesses are still opening ones that I've seen already on my own committee. So I think we I do not know that this is going to be a correction like a and I you know I struggle to use the word correction because I do not. I do not really want to use it under the circumstances, because these are awful circumstances, but I do not think it's going to be a correction for the issue that we were seeing before the pandemic. I see that it's going to be the same issue, maybe it'll be on a different scale. Maybe there'll be other attendant issues, but to me it's something that we've invested a long time in and we are not going to be able to see in just a few months that have passed whether or not it's a plan that we should completely abandon. So I think we should still work on developing it and decide when it would be appropriate to do outreach or if it's appropriate, to do outreach and to further the planet before the city, and I get that we have suspended this plan because there have been changes in city government or how the city views these plans, and this is another one of those situations where you know because of what's going on the city. May you know change how it uses, use these proposals, and that may be our suspension right. It may not be something that we're going to determine, but it may be determined for us based on where the city is and its economy is, but we can at least continue to develop it and we're almost at the end of it and have it as a finalized plan that maybe we then change or tweak, or we suspend because of how things are changing and what we see alistair thanks. Yes, I agree with Megan Alexander agree with you on many of your points when we did this. The unemployment rate in New, York City was what three percent, or so we're now at 18, close to 20 percent. So the landscapes dramatically change and I think the priority net priority now is to get jobs back and get people employed. So I just want to keep that in mind and I think we should revisit this. We should not abandon this in any way, but it should be revisited when back to a more of a normal trend, whatever that may be in the future, and things have kind of plateaued, because we do not know where things are going right now and I think, with a 20 unemployment, presenting something like this to officials, we might be looked upon as a little bit. You know as it not been the appropriate thing to be doing at this point in time, and I think there are more alexander just to your point. If a bit if the business is opening, that's great, I think, though there are more businesses closing than opening at this current time. Olympia last point, so one thing that I also wanted to raise is that we should not forget that, yes, we're hurting right now, and things are like in a complete crisis, but the way real estate moves has a different pace and the way markets come back is very fast. So, actually, because of the page we had in this committee, we- and I remember in this committee- we had the conversation that we were almost irrelevant because we were arriving too late in the game so by the time, and especially with De Blasio, not being the administration that is going to pass that in any way. We know that, like we discuss that with the planning expert, so if we're talking about starting the process so that this is done with, hopefully, if we want to do it with the next mayor, we need to get to continue the ball down, because we were too late before so. Maybe this crisis, maybe is making this more relevant, because we had felt at a certain point that it was taking us so long and De Blasio was making us lose more time that was becoming irrelevant. So I think, like from the planning and strategy perspective, this is still relevant and because of the process of planning, you can tweak and adjust it as it evolves, but stopping it would be detrimental. I think you need to keep going, so I would say that our next steps are. I do not think this is off the table by any means. I think that's the consensus that I'm hearing. I think that we just need to find the right time to start engaging with folks again and maybe our approach to it evolves, and maybe some of the things that we had restricted or you know had come up with, might evolve over time, which we always knew, because DCP would always have pushback and we would always have to you know, revise things so I'm. Why do not we, you know, maybe not put it on the agenda for September, but maybe the month after and then we'll see where we are and if it makes sense to, because we did do a lot of work, but really the next step was talking to folks. So if we feel like in within the next two months that it's the right time to start talking to people again about this- and you know maybe how we want that to work, because I do not know if the same narrative is the narrative that people might respond to again. Does anybody have any objections or questions about that? I mean the one thing is that Carolina Rivera was in support of this right, because you said you want to build political support. Okay, so she changed her mind. She was neutral about it yeah. I do not think she was. She did not give she wanted us. Her last thing to us was, you know, go out and get support from the neighborhood. You know okay yeah, because she I think again. I think that she does see it as something that will be politically challenging and it was really about getting the support from the chambers of commerce or anybody else that might support something like this and making sure that when a plan is put forth with DCP, there is a lot of momentum behind it. So we'll put this on October's agenda yeah. I think that sounds good and we'll just see where we are then, because we want to make sure that we present it when people are ready to hear it great cool with that, I think we're done Megan. Do you want to roll call close so Richard you're, making a motion to adjourn as always? Yes, I am you. Do not need anything. Are you saying I'm the second dude? Yes Susan. I know we do not need it. It's just a tradition. Just numerous all right, we've been here for two hours: megan joy, yes, Derek Onomakis, yes, Andrea Guardio; yes, Herman Hewitt; yes, Joe kearns; yes, even louie, yes, Alexandra Militano, yes, Richard Ropiak; yes, Rodney Washington, yes, Andrew, Comey, yes, okay, good night! Thank you! Everybody bye thanks. Everyone.",
            "summary": "I know that we have heard from lesson in the past around specific programs that they run in our district, but I think that we are sort of in an unprecedented time of changes with our in within our economy that are affecting individuals like never before in this committee.\nWe talk a lot about small business and sort of larger real estate and economic development things, but we have not, at least in the past couple of months, talk specifically about how this is really affecting the people that live in our community.\nThink tank policy, organization- It's, been around for about 25 years now, focused on expanding economic opportunity, reducing inequality and building a more inclusive economy here in New York, and we do that through research by publishing reports and studies that unpack some of these issues in detail, that put forward practical and achievable recommendations for policy.\nSo Anish invited me here tonight to share a little bit of that data with you all on your district, specifically, the lower East side and and parts of Chinatown, and I can share some of the latest data, both a look at where we stood in these in these neighborhoods right before this pandemic and then sort of a sense of where we may be right now, because of this crisis, and of course, happy to you, know, take any questions or discuss any further, but I did have just a few brief slides to kind of keep.\n, Anisha Absolutely we've been really busy since March, but I focused on all sorts of different effects of the of the crisis, and certainly if anybody checks out our work or does not know us before tonight, and you have any thoughts or questions , you can just contact me directly Some.\nIt was about 3.6 percent in the lower East side in Chinatown about a year and a half ago, and one other trend that I won't spend any time on really tonight, but certainly is geared up in my heart in the work that we do at center for urban future, which is that the population of the lorry side has really been aging significantly, as it has been in the whole city, but about 14.4 percent of the population was 65 or over.\nYou know, obviously been at risk of contracting the virus but have held on to their jobs, but so many other new yorkers are out of work right, now, and that includes about 20, to 28 of certain census, tracts on the lower East side and in Chinatown It's, not a number for the whole neighborhood.\nOf course, there are many more folks who are artists but have a day job frankly likely a job in one of those hard- hit industries, but those folks, those thousand or so working artists in the district have certainly been hit really hard, As well, This is the most recently available data.\nI mean it's basically the hardest hit industry in the whole city, and that is where the greatest you know concentration of residents in the district work in restaurants.\nSo, almost 6,000 people and You know clearly the number one I think impact by industry that you would see in the district right, now.\nIt's also kind of worth noting that there are a lot of residents who are relatively, have been relatively spared by the economic impacts and all of those yellow industries have really held job losses down, and that includes Healthcare, unsurprisingly, but right down at the bottom advertising public relations and related services.\nYou know generally fared a lot better architecture, engineering, jobs, computer systems, design, which is basically the single largest industry within what we think of as the tech sector.\nClothing stores really leaps out at me, a particularly hard hit industry again seeing job losses of almost 70 since February And, just in clothing stores alone in the neighborhood individual and family services, which includes a lot of social services organizations which have also seen some pretty serious losses as they've dealt with diminished revenues and other challenges and construction.\nYou know we're talking about administrative staff, custodial staff, all kinds of people that work in colleges and universities and that's a generally an industry.\nWe do not know what the job losses look like by occupation, but we can kind of imagine given what some of these occupations say about where people work in terms of industry, And I did just want to put this forward because I think it's interesting to kind of get a sense again of where you know where your neighbors work , You, know, there's a lot of people that are working in management.\nYou, see chefs and head cooks, all of which are in industries that have been hit really hard right now and artists and related workers, one of the larger occupations frankly in the district, and sets blurry side and Chinatown apart from other parts of the city in that way.\nCertainly, we've seen some new data that suggests that jobs have come back about 20 or so of the jobs that were lost from February to May started to come back in June, and that seems to be closely linked with the success I think, of the open streets initiative so certainly worth you know , The second comment: much earlier.\nThat's tracked in the data and in this case we're just you know, rather than there's a large number of residents who are not employed, including a large number of those 65 and over residents that we talked about before So we're focusing on people that are generally speaking in the workforce and seeing either are they working and if so, where are they working?\nA large number are especially in New York City, but are not we missing something by not capturing them in terms of their employment The employment data that we're looking at is anybody who's in the workforce, so that includes people that are over the age of 16 and have a job That's separate from the data on educational attainment, where we use the 25 and up cut off, but you know your point.\nYou know it includes everything from graduating, with a CUNY college credential, but working in food service and not in a field that aligns with the degree That's a significant challenge that we hear about quite a lot, and certainly for folks with a high school diploma.\nThat performing arts in general is one of those industries that has been the absolute hardest hit and actually Joe. You know this is just to look at the whole city.\nI do not have this data just for the district, but you can see you know the by far in a way the greatest job losses have been in full service, restaurants, both new America, you know total numbers and also the share of all jobs lost since February, But, but right up there at the top is performing arts.\nWe have, I, think, we're the second or third of the 59 boards in the income, diversity, gap, So It's kind of like having, as I've heard it described one fire one hand in the fire one hand in the freezer and Saying everything's great, I'm wondering because of this we have in past divided our district into 10 sectors, because we have some extremely low income right next to some extremely high income.\nI think it's worth pointing out, but as tourism has become increasingly important to the lower East side's economy, it makes the lower east side more vulnerable to this particular crisis, whereas in previous crises like the great recession, which you know, hammered jobs and finance, but did not barely touch jobs and restaurants in New, York City, at least it also is.\nThere's two ways to cut employment data you can cut it by businesses or by workers, and I think that a lot of what Eli has shared tonight is maybe more by workers So much about the people who reside in the district and where they work, But there is a lot of information about the businesses in the district that are employing people outside of it and that's significant as well.\nThat might be a little bit about where my question is Eli, on what you might be able to say about employment losses for the categories of businesses within the district, as opposed to the residents who work anywhere in the city in those industries.\nGas bar Just, to hear about what David and Gaspar are going to discuss is that you know when we think about recovery, and you know how we'll move forward as a city and as a community district workforce development has come up as something that's an important piece of an equitable recovery for the economy and obviously Lessen is our.\nYou know by the time like by next year, we'll also have the 14th street tech Hub, we'll sort of be starting to move a little bit, more.\nAnd I'm joined tonight by David Garza, the executive chair for the network, but also executive director for Henry Street settlement, and we just have a very kind of pretty straightforward presentation, just to kind of give you all an overview of what workforce development industry actually is and the state of it under the current previous to the pandemic, but also now under the current duress and crisis of the economy and then try and wrap up with some recommendations that we have gathered and gleaned.\nThat David Garza is actually a part of led by New, York, City, Employment and training coalition, and then last also a little bit about what lesson is up to during these times.\nWe can tonight of trying to be really concise and hopefully open it up to questions because as community- based providers that make up the lower East side, employment, network- We're, really, you know every data point that Eli shared there's a human being behind it and that every human being behind us either trying to feed their family or trying to raise a child or trying to take care of a senior or trying to keep a roof over their head.\nBut the field as a whole is really responsible for that for connection to the labor market, for training and education, as it relates to employment opportunities for advocacy and then for retention and support services and the circles you see on the on the first slide really represent all the stakeholders and New York City is you know in many ways one of the most dynamic cities in the world for Workforce development opportunities and possibilities, and that density and that kind of vast spectrum of possibilities translates into a system, You have the labor market.\n, you have philanthropy, you have government, you have the Workforce investment board Then you have a number of intermediaries, partners and data, and research and analysts like center for urban futures and our friends there, The data with the story and See how the kind of work hits the street.\nSo, as I began, to mention that you know, New, York city system has a number of assets and strengths and a number of challenges and liabilities on the strength, side, Henry Street and the organizations that make up the lower East side.\nEight of us are amongst 200 community- based organizations that provide job placement and career services to new yorkers who need that support either unemployed, underemployed or have been disconnected from the from the workforce.\nThe funder for that particular program is concerned about is the potential of discontinuing funding the program in the absence of job placements, because largely the New York City Workforce system is a paid for performance system and that's understandable.\nWe can creatively to extend resources to provide people with vital skills and training that they'll need and we'll come back and circle and talk about that a little bit more on our recommendations.\nWhat the funder has challenged us to do with the funding at stake is to pivot and find a new sector to of the labor market, to connect our participants to that's, going to be very difficult in a short period of time, we're fortunate that we were able to leverage some of the ppp support to create a longer runway and Now we are diligently looking at other sectors like advanced manufacturing, industrial food, prep or commercial, food, prep and other sectors that we might be able to pivot to.\nWorkforce, recovery strategy, group and I'm also on a NYCHA post, Covid-19 recovery group and a lot of the concerns and the recommendations that are being made are consistent, and so that is to invest in education and training now to try to identify public works and infrastructure projects where we can anticipate job creation and therefore know where to prepare people and attach them relief.\nPrograms, because I think some of the challenge here is, we have to do the triage, but then we have to do the investment in long- term recovery, but there absolutely has to be some relief in the absence of job opportunities and then, of course, small businesses and support for other businesses that are that are amongst the stakeholders.\n, it's our future bleeding and then the other component is training that the one thing we have right now is time, and we really reject this notion that, because there are not as many open jobs available, that there is not an appropriate investment to be made in workforce development.\nSo, we think really training is imperative and then support for small businesses, whether that's wage subsidies or other creative ways to get people to work and help businesses get back on their feet.\nCertainly in Manhattan one of the most unequal districts you know, we've always had you know underemployment or people who have been left out of the labor force, but now we have so many of them in a variety of different skill levels and how we sort of appropriately get folks back into potentially better wage and good jobs of many kinds.\nI will give an anecdote on some workforce funding, because that is where I think some of the advocacy and the needs statement needs to go that we have seen like one of the one of the city.\nSo I think the advocacy point is to build on- ramps to programs, because you know some of the information that Eli pointed out, like 26 percent of people have less than high school diploma.\nIt's really hard to kind of stack and find the accountability for you know where it stacks up to the department of small business services, Has some training dollars as well, and then there's areas and departments where things are very purposely funded like, for example, Department of Social services.\nDiscussion of you know who, if we are going to take any sort of position, even though that's not what the district needs statement is, but to say something about small property owners or small landlords, and what the impacts of the pandemic have been on.\nThere is no good answer or definition for small property, owner, I think, probably because nobody wants to actually define it because it'll exclude or include people, but we did find a couple of proposals at The. Rest of the district needs has not really changed that much, except to do cleanups of what everybody else brought up the other day or last month.\nI think we can sort of summarize that sentence into like the rising cost of doing business in New York, City, yeah, Because I, you know the payroll is definitely the number one expense for Their office really struggled to define it We could just say a small landlord Maybe we could even say small landlords that provide affordable housing in their buildings.\nMaybe aleister could help us with the term of art, but I do not know that small landlords defines it, but I, but I would agree, I do not think we can come up with a definition of how many units are under people's control or not under people's control.\nWe should not abandon this in any way, but it should be revisited when back to a more of a normal trend, whatever that may be in the future, and things have kind of plateaued, because we do not know where things are going right now: And I think, with a 20 unemployment, presenting something like this to officials.\nIf we feel like in within the next two months that it's the right time to start talking to people again about this- And, you know maybe how we want that to work, because I do not know if the same narrative is the narrative that people might respond to again."
        }
    }
}