{
    "YoutubeMetadata": {
        "author": "MCB2",
        "channelId": "https://www.youtube.com/channel/UCEXyH78eAd9JcCWmmI8GLzg",
        "title": "Manhattan Community Board 2 Full Board Meeting",
        "publishDate": "2020-03-19",
        "shortDescription": "Thursday, March 19, 2020\\nManhattan Community Board 2\\nFull Board Meeting"
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB2",
        "normalizedName": "Manhattan Community Board 2",
        "twitterName": "Community Board 2M",
        "youtubeChannelName": "Community Board 2",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC3kEY0n-RPRYE6rOlfstFDQ",
        "twitterHandle": "@CB2_Manhattan",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "Meeting, obviously we're under some interesting circumstances right now, and our meeting tonight is to essentially complete our precoded 19 business and move forward into the world declare in this day we're gonna start off with attendance time before we do that. There are couple of rules. I want to keep everybody on mute. If you can keep yourself on mute and why you are called on, you can use the raise hand, feature I'm going to try my best to manage this I've got a lot of people who allow them to speak and members to stay on at the end, for an executive session where we have a personnel matter to discuss with that turn over to dollar a dollar. Do you want to start with attendance and I'm gonna may have to wait a second for people to unmute themselves as we go through the attendance okay, Katie bar, oh I, thought I saw her on there. I am here sandy Russo rocío sands. Thank you. Thank you. Christian Seamus. Thank you, dr. Shari, Smith Chanel Spence. Thank you. Kathy Sullivan, Susan Wittenberg, yeah, Thank, You, Anthony, Wong. Okay. Space is not conducive to a sidewalk. Cafe, which reflects people's chatter across the streets, my building the only way to serve patrons is music to the atmosphere and across the street. To my building at the subcommittee meeting last week, the applicant agreed to put in a swing door, but the space is too now and it worked for two years. - loud music, which applicant uses to attract business, is not as gone long past midnight and made life at my building. Ontology granting this application will just continue. The harasser five more - Oh Wally West 11th Street written on March 16 motion to adopt the agenda. I, have a motion to adopt motion to attack, we're gonna, move on into the elected officials, reports and I. Guess the easiest way to do this is if the elected official reps, who are going to be giving the reports, if you could raise your hands so to speak, which, if you click on the manage participants with the participants tab on the bottom of your page, go over to the right and under more, she should be able to raise your hand. I think actually I think we're gonna start tonight off with Assemblymember Deborah Glick I'm going to unmute. You I see you here. Thank you. First of all, let me just say to everyone in the board that I and my entire staff upstate downstate, wish everybody to stay safe, and you know this is unprecedented and in Albany we passed a couple of bills and we did so by having a very limited number of people in the chamber to debate. You had to announce in advance. If you wanted to debate and then in small groups, we arrived to vote when the and we watched for everything on livestream. So it's we're all working remotely and we're all working to provide as much information as we have. We will continue to do probably every couple of days, because every day there are new challenges, the best news for folks who have had either a quarantine and because they are infected or because they have been exposed. We legislation to assist them with either paid or unpaid leave, but guaranteeing their job there's also. So we will have detailed information on that going out tomorrow and the good news today for folks who will be there lost a job or laid off or have had their hours shortened and have a mortgage. The governor has gotten a 90 day forbearance for people. It doesn't mean that you'll have to pay double when you, when we start back in some sense of normalcy but it'll go on the back end. Mortgage evictions have been for stalled as are foreclosures. The feds have done public housing. We have done rentals, we have done mortgages for those who are unable to pay. So there are. You know the governor's been clear that this the city is not walking down, but we are all asked to stay home unless we're doing something like walking a dog or going out for a jog or doing shopping. So the whole point is to try to stop the spread, and you do that best by staying inside, to the extent that you can, you know special emergency services working for the Transit Authority. Obviously, pharmacists, doctors, nurses, folks, who are involved in food stores. All of those are viewed as essential jobs and so we're all working from home and school children are at home and it's a difficult and unusual time, but I do believe that, as FDR said a generation ago, the thing we have to fear the most is fear itself and so I don't want people to be panicked. I've gotten innumerable calls or messages from friends and some constituents about one room or another. So we'll try to keep you with accurate information and, frankly, I think the governor, with whom I have not always agreed, has actually done an excellent job of clear, consistent messages to the public. So I want to thank you for holding this and I will stop yakking and I will just listen for a while thanks so much. Thank you very much. Assemblymember. Look, it's great to see you and obviously doing a great job, and these are very different times. I, don't think the last time I saw you I, think I'd be seeing you on the other end of the videoconferencing from the elected officials. Can you guys use the raise your hand, feature I, know all right here we go Robert start off with you. You're right up at the top seems to be healthy. We want to thank you all for continuing to move forward with this and keeping C functioning as we get through this sort of unprecedented crisis together and moving forward a couple of announcements. Our office is fully at the moment solely teleworking, so we are all working from our homes, but our phone systems and our emails continue to work. We are sort of fully functional as it were. If anyone needs assistance with federal agency or guidance on resources, please don't hesitate to reach out. We have a pretty robust set of guidance for city, state and federal resources, and we are happy to try to help make sure that people are getting connected in the right way. Today the President signed the family's first gonna bios response act. This was a house. That's bill, provides about eight billion in funding for to expand testing capacity and ensure create testing and treatment who needs it. That provides nearly eighty seven million individuals with piayed paid leave that would be funded by the government for up to two weeks at full pay. We expand food assistance, including snap and WIC. It expands unemployment insurance and, in addition to that, a billion will provide New York state with consummately 6.7 billion and expanded Medicaid funding, and that's annualized for the next. For the year we are already hard at work to the next release film. We know that the families first bill does not meet everybody's needs. We and a house faced a very difficult choice of either moving quickly with the consent of Republicans or not at all, and we wanted to make sure that we were getting these funds to States and individuals as quickly as possible. A couple of things that we are actively working on is to make sure that we're providing support for contract, freelance gig workers. That's involves a lot of artists, a lot of content makers, a lot of independent professionals who are not covered under unemployment insurance and the congressman. A seeking payment of about two thousand dollars a month for every American for the next as we are, while we are in the health places as a direct payment to people. We also want to make sure that we have credit support for small businesses and nonprofits, both of which are deeply strained under this with asking folks to shadow their doors nonprofits to theaters, to stay dark small businesses for it have their customers stay away. We need to make sure that we are unlocking beyond the loans that are available today. The Small Business Administration allowed authorized New York State's application for an atomic disaster which allows for emergency loans to be made. However, they are loans and we have to make sure we're getting some directs, for. We also need spy working for support for renters, in addition to those with their mortgages, people with student loans trying to backfill funding for mass transit on Tuesday. Just folks know there are about four million fewer rides taken on the MPA. That's four million folks in cb2 that are stranded abroad because of commercial flight cancellations, and we are saying we want to make sure that we are providing funding for the State Department to be able to repatriate those standard abroad. Again, please don't hesitate. If you have questions, we are obviously not in the office. Some people go in every once in a while. We're also trying something very strange with the Dharma Center we're trying to get the doorman center to so and turns out that in Wisconsin DuPont has thousands of I would say thousands of reams, garment, Surgical, garnet material, raw material, so we're hopefully by the end of tomorrow, we'll know that's available and then it can come to New. York they've got a sense of things. They can do about 25,000 garments and mass very quickly. So that's something because of my interest in the garment center hopefully will happen just lost to Gail you there. Can you get me now? Yes, so what it was calls from seniors FreshDirect is going to start on Tuesday, delivering 400 meals a day, we'll figure it out between uptown and downtown. Between now and there, we have a lot of seniors who can get to the nearest Senior Center, but certainly meals, on wheels, and you know just the usual amount of small businesses tomorrow. The payroll taxes are due and I understand from the mayor directly that one can get an extension, the hotel's 120 days of extension. They are really hurting and of course, we have and I'd love to get opinion construction. The issue in San Francisco, even with a lockdown construction, continues the issue that the mayor said is that there outdoors, on the other hand, they are close to each other, so the whole construction issue comes up often so, from our perspective, it's the seniors we're trying to get that early morning time when they can shop. It's the construction question and, of course, massive amounts of questions about small business which I'm sure you're getting and congratulations on your technology. Thank you. Thank you very much and let's see president's office, oh man, next I see I've got yes, I! Think everyone hearing this okay, yes, this is Claudia from Assemblymember news office and I. Keep this brief. As usual, quick note, our office has truly transitioned to working remotely. We are still accessible through our email and our office line for any questions and concerns for updates. Last week, the SMU attended one of our final press conferences to discuss some of our concern chunk of the nineteen in my community. Among more points that we echoed at that time was D ongoing son of obeah and incidence or the Asian Americans across the board in the city. It is absolutely harmful and unacceptable, and the assembly armor calls for the community to continue to stand together and remain educator, ANCOVA 19 and keep an eye out for all the misinformation that is circulating and it's kind of wild these days to see what comes up on Twitter and gets flat out very quickly in terms of our work, we have done two letters to Governor Cuomo one was for at-home testing kits for equipment 19. This is to allow for more rapid testing, while also lightening the load on our health care workers. We're also hoping to that way to minimize the amount of exposure when individuals are coming out for their testing. This would allow for them to do it in the comfort of their home and then have that arrange to be sent towards a testing center and then our second letter was a party covered 19 testing for 911, responders and survivors. Most of these folks have already pre-existing conditions or their side effects from the time, and we are asking for clarity, testing for them and one of our final letters we did for NYCHA going to their CEO, asking for a very in-depth and cleaning for all the buildings. All the residents have told us that they have not seen much of an increase in terms of the cleaning, especially in high-traffic areas, so that was one of our letter calling for them to really be fully aware of the areas that need constant cleaning where people are touching a lot or just brushing past all that, and that is as far as what we've done so far, and we will continue to work along with the community as we go into very new uncertainty. I would say, and by only for my office, we're pushing everyone well I'm, giving your family the bus and please have a good night thank you and that you and your families and your neighbors are all staying safe and healthy and practicing your best social distancing. During this time, I want to speak for a moment what we're doing to make sure the city's economy is protected and their workers to small businesses, who are the most vulnerable right now are protected during this time. Like the other government offices, we are working from home, but we are working around the clock to make sure that all the services and the economic supports that we provide are still fully ongoing. Our pension team is working hard to make sure all of our retirees are still getting their checks on time, and our investment strategy still steered toward long-term success. Our budget teams constantly in tests assessing the impact on the city's economy we've rushed over 140 million dollars of emergency contracts through to make sure that the city can distribute all the funds that they need to make sure that iPads are provided to school kids and all the other emergency services are provided and we're also making sure that nonprofits throughout the city are not being penalized for not missing their deliverables, as many of the them cannot stay open. During this time, we've also called our number of proposals to be enacted at the city and state level or at the company level to make sure that small businesses and families and workers are able to survive this downturn. The first we have asked for all the credits for companies to not count any missed payments against individuals, credit scores as they might not be collecting the normal paycheck during this time or may not be able to make the normal payments during this time. We want them to have a suspension on negative impacts of credit scores as a result of koban 19. We've also asked for a 10% delivery commission cap for copies that grow uber eats so that both restaurants and families, who are ordering in or not just to hold into whatever fees they want to charge as restaurants and their normal ways of getting food are not open or accessible right. Now we would like to see a deferment on the sales tax payments do much 28 tomorrow, and we want businesses have a waiver on some of the fines and fees which are not health related in the coming months as well. We know that many of them are struggling or forced to close making sure that when their workers are protected- and that also goes for the arts and creative communities and the independent gave workers who right now might not have their normal income stream during this time. So we also, lastly want to thank all of our state and federal partners who are working so hard and advocating for new yorkers and our office is once again open on the clock I'm available with anything that you guys might need, or people's backgrounds, that he's got this ocean in the background. Assuming it's a blue screen or he's having a really good time somewhere, I'm, not sure, and thank you to the President and Bob encourage were utilizing this kind of technology. You know with that in mind. I had introduced a bill a week ago that will allow this kind of teleconferencing under the New York State Open Meetings laws. So we want to make sure that community boards are not. You know, caught in the void here, the governor issued an executive order following my introduction of the bill to allow this, but I still think it should be done automatically whenever there's a state of emergency declared. So we'll continue to press for that bill when we have time. Obviously, there's a lot moving very quickly hour by hour and I know that the president mentioned its signing up for text alerts at six nine, two, six, nine two or calling the New York State Cobin 19 hotline, which is available on my website for more information. The state legislature has been meeting I just came back from Albany. That's when I'm a little bit late, just literally walked in the door. I was one of only one other person on the train in my train car. It's eerie up there, the streets are empty. This I don't know if you had to take the subway, but it's obviously empty, because people are following. You know good sense and staying home when they can so I really appreciate that yesterday that the Legislature passed comprehensive, paid sick leave for those subject to a mandatory or precautionary order of quarantine and as the economic impact of the virus becomes more evident to us, I'm calling on all levels of governments is for a restaurant rescue plan, a small business bailout and a wage worker and gig workers support fund so that we can save as many jobs as possible. We're really going to have to step up with both federal and state support to ensure that the people who are hurt most at the bottom of the income ladder are protected. It's going to require some really difficult choices. We're doing that right now in Albany. I hope that we look at how to raise revenues moving forward, obviously the economy's in a precarious position. So we have to take that in consideration too, as the cost of facemasks and other consumer medical goods become exorbitant I know any of us who've walked into you know. A bodega in our neighborhood has seen face mask for 30 bucks, a pop or sanitizer for $25 for a small bottle. I introduced legislation that would set a benchmark on price gouging, meaning that during a state of emergency, you couldn't raise a product price. That is a consumer. Medical item like sanitizer, face masks gauze more than 10% of its retail price. Before the before the state of emergency was declared it's the same standard. We have in states like New, Jersey and California, and the District of Columbia I'm, hoping we can get it in New York, because we really need that bright-line rule not just to make. You know it better for consumers, but so that retailers know if they're getting gouged by their distributor. For example, the bill would also give the Attorney General new powers to go after price couches, all the way up the supply chain, so I'm hopeful that we can pass that bill as soon as possible. Even though we've got a lot on our plate, obviously I signed a letter tonight with my colleagues on the chair of the Senate Judiciary Committee. That would place a pause on all statutes would call that we place a pause on all statutes of limitations in both civil and criminal matters. Obviously, if you're a litigant or your reporting, your victim of a crime, for example, this period, it should not be counted against you in terms of statutes of limitation and the same vein, I'm pressing that we put a pause on the year look-back window that we passed this year for survivors of child sexual abuse, so I hope to see the governor issue an executive order on this. The Attorney General - James backs up our call for pause on statute of limitations today, with her own call. So as they're pleased about that I'd like to invite everyone to our second town hall, we had a virtual Town Hall on Sunday with Assemblywoman Linda Rosenthal, and we had a few infectious disease. Specialists was very interesting too from Rockefeller, University and one from Columbia, and they asked you know on Facebook. We had a lot of questions, including some very New Yorker questions like is takeout still safe things like that. We all are asking ourselves. You know every day, that'll be this Sunday May 22nd at 8 p.m. it'll, be also on zoom'. You can join on my or Assemblywoman Linda Rosenthal Facebook page and ask questions we're working really hard on constituent services. Our office is closed, but you know one of the weird results of this kind of virtual world is that we've been so focused on constituents because they and Jacob come back with stuff he's on here, because they've been contacting us by email and by telephone we've been really on top of those calls. I hope you've seen some of that result as you've contacted my office and my team has just been doing a fantastic job. Just today we got an enormous donation of face, masks from a constituent and we're organizing volunteers through our website to volunteer for groups like God's love, we deliver and visiting neighbors. So please join if you're. If you have time to volunteer or the ability to volunteer the other thing is you should spread the word for retired medical professionals. The governor's office is seeking those individuals and you can go to the governor's web page which you can find on my web page. If you know of someone who has medical experience, they're looking to bring those folks out of retirement because we're gonna probably need them in the next weeks and months ahead, but this is showing me really truly how strong our community is and I'm certain we're gonna come out all the better for it. So I wanted to thank all of my colleagues and government and the community board for all the work you've done already. It is a long road ahead, but with all of our collective efforts, we all make it through. Thank you, Thank You Brad, and thank you for a really great town-hall meeting. Your virtual Town Hall and someday I really enjoyed watching that and it was very informative. You're right, New Yorkers have very specific questions that we don't get to read about in the National crust like what's up with the park bench. You know- and that was that's really what you know people are interested in knowing thank you did I have a couple of questions. Am I seeing that Robin? Just if anybody's got some questions for Brad? This is Ritu. Oh hi, there two things with respect to health care number one is: are there plans to loosen the requirements, the HIPAA requirements for Medicaid recipients in order to allow broader appointments through telephone and video conferences, issue will follow up and see what the state is recommending to the feds. In connection with that, that's a really good point, so that would definitely expand the ability of New Yorkers to receive health care. The other issue is also if I could just jump in there. I do believe that the feds have indicated that they are going to loosen some of those restrictions in order to make telemedicine much more widely available. Just FYI HHS has already submitted that, so they were allowing that. Cms has also issued a ruling with respect to HIPPA and for Medicare recipients. It has not been expanded to Medicaid and I'm. Just looking to that would be great for lower income. New Yorkers. The second thing that you may want to look at is to expand the offerings for healthcare by looking at the corporate practice of medicine and Brad. I was going to raise that issue with you at a later point, but I just want to put a little bookmark there. Okay, you cannot practice. You cannot organize medical practices without having a medical practitioner be the owner and that really kind of narrows. In many cases, the ability for practitioners to be all things to be billers, to be doctors to be counselors presentation from Lennox village in a few minutes, so they'll probably be able to jump in with some more details, not on the legislation side, but on sort of the technicalities of some of those different areas change since yesterday, but Greenwich House is initiating a program where they call all of their members a couple of times a week just to make sure that everyone is okay, but there this is pretty small, because their membership is pretty small and they would be enormous Lee helped by any context that you guys are able to share with them, because the hope would be that we then find a kajillion volunteers. We just each take on a number of seniors and just check in with them, and that really, you know, can be life-saving. So it's just a nudge. You might have heard from Darren black orange house already, but I just wanted to guys. Yes, we collected a list of 150 villagers and others who are signing up to do this kind of work. So I know we can reach out to Darren Block. If we haven't already I know, Jacob was talking to him and I bet, Deborah's and Gail and other colleagues have resources, I think we're checking with Tracy, but I think we have had a call to us and we're gonna go through our list and we'll also put something in our outreach so that people can let us know about neighbors that they may think are isolated or for whom they don't think are connected to a Senior. Center I just want to interrupt for a second David you're sharing the agenda with all of us. If you could exit out of that sharing your screen please. So you need to go down to the bottom of your screen and click. Stop sharing STDs delaying the ELA this year, yet I really I. Don't think that at the moment they have issued anything in part, because we have no idea what the timeline is going to be for anybody going to going back into schools and whether or not there is a mechanism for them to administer the test remotely. So I am oment. I haven't heard anything definitive I, just suspect that it is unlikely to take place and we'll check on that too. All right thanks, guys we're gonna move on to the next elected officials report from eric bakker from speaker, Cory Johnson's office, Eric - for doing this broadcast. This is history being made tonight. So congratulations to Carter and CB -. This is the beginning, a new era and community board meetings. If you've received any emails from Corey or been watching, the news you've been seeing what he's been up to with this twelve billion dollar relief plan. He proposed today we're urging the city to make the right decisions as we go along. I'll talk just very briefly today about efforts locally. As Brad said, constituent services are paramount. This week, we've been receiving a very high volume of calls and just doing a fantastic job, so many constituents who are reaching out just going through incredibly tough time losing their incomes overnight. We've been in touch with many small businesses Stonewall and tea and sympathy village dan, my lock chocolates they're all gonna need a lot of help. So we're going to be working very closely with them in the weeks and months ahead. We've also been getting a lot of calls incredibly inspiring calls from folks reaching out wine to help hotel purveyors, offering hotel rooms to medical professionals. Catering companies offering their kitchens with the city square on six avenues been going on for way too long. Those businesses need to end so that kind of stuff, amazingly honest this week. Thank you very much thanks Eric, and thank you guys for all your work and the trees to who I spoke with the earlier today is also on with us, and also Eliana feeling, okay and getting some fresh air with social distancing still in mind, with the focus on senior centers naturally occurring with retirement communities, youth organizations nonprofit small businesses, like everyone, has been saying, I heard from a lot of folks in the community and we're doing our best to make sure we're listening to what folks are saying, and one thing that I think someone brought up that we're looking into right now, it's around the telehealth calls and making sure that those are still getting covered. Please feel free I'm, just gonna broadcast my personal cell phone number. So if you want to reach me to eight to five one, seven five, if anyone needs to connect with our office, we're using our regular line as well, but that's me directly and I'm happy to chat with anyone. Thanks thank you and I've also got a Anthony Drummond from councilmember Chin's office was having some trouble getting in, but he just sent me an email and said that on behalf of the office he wanted to. Let us all know that councilmember Chen's staff is working from home as they're all trying to deal with the ko bid. 19 is, and if anybody needs to get in touch with them for constituent services, you can email him directly at a Drummond council button, YC gov or call their office directly or his cell phone, which is three two, eight seven five 374, and if you need that information, you can email info at cb2, Manhattan or directly link to Bob Lanier district manager on our on our homepage: Alex Hellinger, who's, the executive director for Lenox house furniture, Ilic Thank, You Wayne. Thank you very much and thank you for giving us this chance just to comment. Talk to the board again. I would like to also say hi to us. Alright, Deborah, Brad gal. You have all been really supportive of us over the last six years. So thank you for that. I will just say I'll just give you an our perspective on it. We have been using telemedicine now for quite some time. We use it within the hospital system for telepsychiatry telestroke till I see you even tell a hospitalist now and it is beginning to move in to the private sector. So any of those government regulations that can be moved in to help that would always would be very hopeful, but times like this, where people really want telemedicine, they don't want to go out of their homes and go to the doctor's office. It's becoming more and more important. So we're fully in agreement. I'm gonna go down some of these questions and then I'm gonna hand it off to dr. levy for some clinical updates on Co bed 19, but just to go through some specific questions that were sent to us. They were asking about shortages, therefore, the tests, the co, because this is something that's brand new, so I think we have been increasing our test capacity. Shakur lab. You may have heard that you may have heard core lab are on the news a couple of times. There are large, very large laboratory in Long Island and they started their initial ability to do. Tests was about 70 a day recently that went up to 300 a day, then 500 and yesterday they did over 600 and they're expecting to do over a thousand within the next week or so the ability to do the tasks in rapid fashion is moving, but she was a completely manual process. It's moving to a semi, automated and then a fully automated process, so that will ramp up the limiting factor, maybe the reagents and some of the chemicals that they use, because without those they can't do the tests. So from what I'm hearing from the labs that's more of a struggle than actually making the test happen very quickly, so they are working with. Everybody is working on it and it's becoming quicker and quicker. We do have a long road ahead for sure there was also a question about the drive through tests so currently with the drive through test. There's two in the Lyle and I believe there's one in Staten Island that just I was up running I. Think today we are becoming involved with those we've involved from the onset, even with those there's a number to call. So the two on Long, Island and I can I can give you. The number I can email a bunch of different things after this meeting, but there's a number to call. It's not a these are in Japan, where anybody can go. It essentially, they're gonna ask if you're symptomatic, if you're having fever and cough and in short breath and those are the folks that generally they're gonna test a test from what I'm hearing you have to make an appointment and that appointment. You can go there in about five to seven days and then there is a return on that test anywhere from two to five or more days, and so those are ramping up as well, but they're still struggling a bit to keep up with demand. Even as the test, by the way as we're able to do in more and more tests, there are more and more people that are being tested. So the number of supply and demand is a bit challenging here. But again everything is moving pretty quickly. There was a question about bringing a relative into the hospital and if they would be exposed to Koba 19, so currently our policy and what's been sent out from the state and the government is really there should be no nobody accompany patients unless it's absolutely necessary. So if it's just for comfort, things like it's like zoom Skype would probably be better, but we are trying to seriously limit the amount of folks that are coming into the facilities unless they truly need to be here. So we're doing that, of course, if it's a minor, if it's an end-of-life situation or something like that, of course, we look. We do allow people to come in, but we're really strongly suggesting that if they're not necessary that they do not come in and they do again something like this as we're in this age of technology. So the question is well: where do patients go from here? Do they all go to Lennox Hill Hospital? They do not. If you have your doctor in Mount, Zion, a or NYU would certainly send you there. If there's an accepting doctor- and there is bed capacity there as far as Lennox Hill Hospital, they are licensed 603 two beds currently operating at 450, and they have 48 ICU beds. So with what is happening now, we have been going through surge plans for all of North well over the 23 hospitals and hundreds and hundreds of amatory practices and we're looking for open at site locations, even in Greenwich Village we're looking at certain spaces that may be used for overflow and we've been going through this for the last week and we've identified many places, so we're very well prepared for this and we're prepared for any potential outcome and where this is going. We know we have a long road, but we are really well positioned to take care of it. There wasn't a question of information that could be sent, so I can send you all of our Twitter accounts. Our instagrams Facebook there's also a digital center Resource Center for Colby 19 that has all of the latest up-to-date with the epidemiologist weighing in so it sort of puts it all in one place, but I will send that rain. I think you know where to send it we'll get it to you and you can get out to everybody that's without to leave. If you would just maybe talk about the clinical sure, can everybody hear me? Yes? Can you guys see me as well? You can ask accents just to echo what Alex said. Thank you to community board too, and all the members for you know getting us the opportunity to speak to you guys tonight. You know this is certainly a unique situation and I want to echo what Alex said that we have been preparing for that. So we've been running mock drills we've been doing surge planning, we're sort of ready if this does end up ramping up, which many folks think that it may so from the clinical front are er. Is still open, we're gonna continue to remain open. We're 24/7 were fully staffed. We've been working on staffing contingency plans so that if our healthcare workers do get sick, we were able to pull resources from our vast system to make sure that we're operating at 100% capacity so to the sort of clinical front symptoms. Everyone's got access to the CDC website, I find their information to be very accurate and it is updated on a regular basis. So it's sort of hard to discern you know coded 19 from the flu. Some are saying: some of the symptoms can be a little bit different, a different feeling of a sore throat, more nasal congestion than you would get with a common cold, but still folks are getting fevers and chills and body aches and some gastrointestinal symptoms as well, and so the next natural follow-up question is: what do you do? So what do you do if you're feeling, sick and I think there should be a decision that everyone has a threshold for when they need to seek medical care for mild symptoms? We're really asking folks to try to manage at home, so hydrate rest. If you're having a fever, you can take out your opener Tylenol as long as there's no contraindications to doing that. But if you start feeling significant chest, pain, you're, having trouble breathing you're getting out of both, you know getting up some a seated position or walking around your apartment. Yes, could be signs that there may be a more serious infection going on and you know we would encourage you to come and get evaluated now, not everybody that comes into the emergency department at this point were able to test and sort of echoing what Alex had said as our system, not only core lab we're, also partnering with LabCorp and quest and some other private labs, as our capabilities to test expand, we'll be able to test more and more people. However, at this point, we're really only testing people who are symptomatic, so, unfortunately, there's not enough tests at this point to test everybody, so the sick people are going to get tested for sure and trying to discern whose labs get processed first. So, on the inpatient side, it's ever so important that we get that information back so that we can release specialty beds for patients who are B positives and release those beds for patients who are negative. The turnaround time that we're telling our patients so for a majority of folks who are getting sent home and discharged and told to manage at home despite getting tested for coded 19:00. The turnaround time right now is between five to seven days and again, as the testing capacity ramps up. We hope that turnaround time will become shorter. What I would encourage people to do and I'm set on telling this to my folks who don't live here they live in South Florida is to have a plan. Talk to your primary care. Doctor talk to your community doctor find out. If they do testing in their office. We do have an urgent care organization called go health. They have a bunch of locations, one in Greenwich Village, one in Chelsea. That's here on the east side and they're able to process tests as well. So we're trying to find the right balance in terms of keeping the right people in the hospital and making sure that the folks who are sick have other mechanisms to get tested. So that would be the you know, take-home advice, I have for them, and the folks on the call tonight is that everyone should sort of have a contingency plan and do a little bit of research on their own so that if they do feel sick and potentially not sick enough to go to the hospital that they at least have alternative mechanisms to get tested. Great I think I see a few questions here. Wayne do you want to add anything in before we take a couple questions and that you're muted hold on a second all on me view or a few other organizations. Some of our non-essential staff are working from home or we are fully medically staffed 24/7, as dr. Levey said so, people should be comforted in that and that other than that I think we should just take some questions. All right, I see you on your hand, raised gonna unmute, you all right. Yes, first of all, thank you guys for everything that you are doing. I'm sure this is incredibly stressful and busy time so I can certainly understand the need to project calm, and you know that it is under control, but I guess my concern is that there's no physical way to know what is in store for us and that 25% infection on 1% case fatality rate, there's no physical way. Anybody could be prepared for that. So I guess. Are there serious discussions about contingency plans where, if you guys, aren't well prepared or simply enjoy that's an excellent question, so they're certainly planning for different stages of what may happen in terms of supplies in terms of staffing in terms of capacity, so this is happening on a system level on a local insight level like one excels, running South, Greenwich, Village and certainly on a state and federal level. So I can only speak to what were sort of northwell health and our specific site is planning. So there are certainly conversations ongoing conversations on a daily basis about our surge and capacity planning. So I guess the short answer is yes. We are planning for every iteration of what may happen. Yeah I'll just add: we've actually looked in the building. Here we had a team today here of physicians, a CPS nurses, IP of how do we stand up additional units, so the opportunity part of being part of North Wales, there's 23 hospitals, there's a lot of really bright minds in this organization and we've been putting it all together. So we feel were really well positioned to handle this but yeah. We think we're in for a long, and we are certainly preparing for that. Thank you for your question. Mr. Metzger. This is. This has been very helpful, Alex and David Gruber speaking I'd like to know, is there kind of, if you're not having symptoms, but you know that you've been exposed to somebody who has tested positive is that is that a priority for being tested yourself, even if you're asymptomatic so again, another excellent question. So at this time the testing algorithm does not include folks who may have been exposed and who are asymptomatic at the time. So the advice I would give to that person is to self monitor at home, meaning you can check your temperature at once or twice a day. Monitor yourself for called for chest pain, try to keep some social distancing, which most of us are doing now and if there's anyone at home, who could be at a higher risk of getting sick, take extra precaution around that person and just monitor for your symptoms. Thank you, David. It's good to see you by the way primary care doctor, that's doing home visits via telemedicine. So that's just started to come off. You know off the ground. He is literally the first one down here, he's already started a program started seeing patients dr. Eric Asher, exactly what you're describing is a perfect, so I believe that's gonna, be something that's rolled out more and more as we're going forward. This event is gonna push that even faster I just want to say. Thank you! Well, if you're taking the time to talk with us, I, don't know you sure thanks I was just saying thanks. So much doctor I'm, not sure how that's working exactly right. Now it's a brand new test. I would say that if you're coming to the emergency department in your sick, you would you get an emergency department bill I, don't know that the tests would be separate there and, as far as the drive-throughs are concerned, quite honestly, not sure how that's working a couple of days ago. So, thanks for being here, your staffing, how many you know so our staffing is unchanged. So our staffing tonight is the same as our staffing was two weeks ago saying that it was six months ago, so we've been again preparing for potential call-outs and persons who may not be feeling well, so we've activated actually six occult program. So our current staffing model at our busiest times of the day and evening we have five providers, three doctors and two mid levels, either pas or NPS, in addition to eight nurses and for patient care technicians, in addition to the rest of the administrative staff. So our staffing model, we sort of staff to the busiest times of our day and we've been watching our numbers since this sort of pandemic began to see if our numbers have a statistically significant change, what they have it. So we've kept our staffing model exactly the same. Thank you and so I think what I just understood. You just says that you're a great increase in volume and people coming to the agency, so we don't have enough data points. Yet everyone we're talking to this is the first real week where volumes and sort of the rate of arrivals and census is changing in other departments. So we're gonna start looking this at week's end and then we're gonna start comparing it to the week before and the same week a year ago and we're a very tech heavy department, so we're really into that analytics. So we're gonna study. This very closely haven't seen a big change in volume. It's gone up and down in different places. However, the patients that are coming in are different right, there's much more respiratory patients that are coming in patients with colds, flus and everything else that they might have koban 19. So we do have a different, a different mix of patients as far as staffing as well. So one thing here is such a secretarial or folks that don't need to be clinically on the floor remotely as well and some folks we transition on and off, though we are trying to do things to preserve the staffing they don't need to be, and also people like me was administrative they've asked to rotate. So if one of us get sick, somebody else can pop in their place and we can keep the place running thanks. I've also got a question from Amy. Thank you thanks again for coming in I. Have a quick question: do you have? Does your staff have the materials they need? We're hearing a lot about. You know things like that, how's that going for you do you see any? What do you see in the future? Long term and I hope your staff are staying healthy? Are you seeing anyone getting sick because on your staff, because you don't have the right materials yeah? This is something that we have a materials management team that works really hard every day to make sure that we have everything that we need so we're doing really well, but the toughest part of this from a PPE, a personal protective personal equipment perspective, are the n95 masks. It's really tough, there's truly not enough to go around. So we work off a sort of a par level. We try to keep it going. Every hospital is looking for more and more of these, so they do. We do have it we're trying to control it so that we don't run out, but I will tell you one thing: that's been fascinating to me. Yesterday, specifically many community members came to the hospital to deliver pizza for the staff Coffee cookies, and there was one individual woman that was outside and she's motioning that if we maybe had a mass for her and so I grabbed one of the surgical mats and I went out. She said no I, don't want a mask. I want to give you this box of in 95 and after her somebody else came in and literally while I was on. This call. I just got a post-it that somebody called and said that they have a 95 mass. So now, May I will tell you when we're in crisis is when you really see the good of people come out, and we've really seen that here. I was really touched by it, but that is probably the hardest thing for us and for almost every hospital is the n95 s as far as the gloves and the gowns or in the in the goggles that shape our face shields, we're doing pretty good on all of that. The n95 s are really tough, so we are controlling it, but we do have what we need at the moment, but it's a day-by-day type of issue with those masks concern for all of you. My dad was a doctor so because, if you could just tell me, do you need a new one every day? Can you reuse it? N95 mask I mean what is just curious, so there's policies there are CDC suggestions. The TDC suggestion is that you came to mask every five interactions for us that could be multiple times a day for multiple people. So what we've done is we have them where the nn5 we put a surgical mask over it, to preserve it a little bit longer, and we ask them to try to keep that mask for two or three days with additional mask the go over it, so it doesn't degrade or get sprayed on if the mask gets soiled there to throw that away immediately and get another one, and with that we've been able to maintain, but we do try to pull on the Utes just a little bit, so we can so we can keep them in stock. Okay. Thank you. I've also got a really good question from one of our board members and people who do not have a primary care doctor, since many insurance plans no longer require it. If someone is sick with suspected code in nineteen and south carrying at home, should they tell someone in terms of tracking yeah, absolutely so just to clarify the question in terms of should they tell someone as in like the Department of Health or who, in particular just from this question? It's basically saying if you don't have a primary care doctor you're at home, he gets sick and taken care of yourself. You know, and you think you've got over 19 shouldn't be telling anybody as far as you know, any assume anybody, a medical professional that should be aware of that fact. Yeah. That's a great question, I think some a public health perspective. You know if you're not feeling. Well, you probably shouldn't you know be in a room within close. You know, with close contact, not wearing a mask with anyone in terms of if you're not feeling. Well again, everyone's got to have their own internal threshold for what that means. It may be something different for everybody listening to the call, but certainly if you don't have access to a health care provider, you're feeling ill, you could certainly come to the ER to get evaluated and that's what a lot of people have been doing and will continue to do. If your symptoms are mild and you think you can self monitor at home, still want to go and see. Somebody I think an urgent care is a nice in-between there, they're not open 24 hours a day, but typically most of them are open 12 hours a day, and you can always you know hop online and check out, go health and see what their hours are and you can even make appointments ahead of time. Okay and we've got one last question which I think it's a really good question, actually two more questions: one does the painters mask or a construction mask work at all, or does it need to be a medical mask, yeah, I, guess an n95 mask, yeah, I, think yeah and then 95. We would probably have to have our materials management team. Take a look and see what the actual structure of the mask is if it can be utilized in the same environment that we're using the n95 and so I would probably took that question to one of the materials management, people and then a question which my sister texted me but I don't think she's actually is to my guts and just you know what is safe, what precautions should older people take they're going shopping at the grocery stores? Yeah. That's really I think one of the most real questions as far as the community. What should they be doing if I'm sitting in the king board conference room right now, I'm across the street, from Morton Williams and you know, I when I came in I saw a couple of people older people going in and what should people be doing it yeah I think that's a challenging question I think whatever you can have delivered. I know a lot of the delivery services on thing things up to apartment, so they're leaving in doorman. So, if that's, you know an option you have in your building, I think that's a great option, but if you know you don't have that option and you go out in the supermarket I think for at-risk people wearing a mask is not a bad again trying not to be in close quarters with people. If you see someone who's, coughing or sneezing turn your back creates the distance so that the best way to mitigate transmission is going to be distance and protecting your face and nose from someone who could be potentially sick. So again, it's challenging space is limited here in New, York I live in the village as well, and my wife and I have been to the supermarket a handful of times over the past week and it's been really challenging. So I think you know you just have to try to use. You know whatever resources you have available and really keep the space issue, we're using ten feet as a number that we're sort of telling folks in the hospital is a safe distance. So if that's feasible, then that's something you should try to over a certain age. I, don't remember exactly what that age is, but it's for the elderly. They can go in it's much less crowded, so they've actually implemented that and some of the stores around where he is and it just it does, make it easier for him to get in get the food he needs and get out without too many people into close quarters. And it's interesting you bring that up, because that's actually what my sister texted was, you know what should they be doing during senior hours and I've got one last question from time. My question is probably something that we'll all encounter in the next couple of weeks or so I'm gonna. Ask it generally brought here is what happens if you do receive that email or that text from a friend who says I I've been around you during this time period and I have tested positive, but you yourself are not showing symptoms. What is the best practice there? Something I in light. What I'm dr. Levey said if you're feeling ill and you don't have a primary care doctor, you can always go to the emergency room, but if you're not that'll, you can also go to Urgent Care facility, it's probably less expensive. For someone to go to an urgent care facility right, they shouldn't go to the emergency room, really sick right. They don't have the same kind of overhead by any means of what an emergency department does I use them myself. So it really depends on how you're feeling, if your acuity level is going up. Certainly you need to come into an emergency department to get the cat scan etcetera. You really can't stop. Bendigo health are really good partners of ours down here and if they think somebody needs to be escalated to a higher level of care, they get one of our monsters to bring them here or they. Let them know that, but yeah I would say to check the NGO health is a fine place to you know, an urgent care is fun place to go first. This is anybody. Should you notified the urgent care before you show up put your name in for an appointment online before you just go right in they've made it very easy for you just a quick aside about at least ago Health they've put in a mechanism where, if you're, making an appointment to go and see them, they'll communicate with you before your appointment and ask you if you're having any true like symptoms, and if the answer to that question is yes, they'll arrange for someone to meet you outside of the urgent care and hand you a mask before you come in, so that they can at least create an environment, that's safe for other patients for maybe in the waiting room. Thank you, Alex. Thank you. Doctor. We've got to move forward, so we only allocated 15 minutes so I'm gonna move on it's the next portion of our meeting. So thank you guys. You guys are everybody and thank you guys. Thank you very much within the in constant briefings with Association, and we create a web page within our council web page that is Covid-19 19 exclusive updates, we're updating, multi, daily I'm gonna, put the link on the chat here. Also, one thing that we focusing is on calling all the soup kitchens and pantries in the district to gather information up to the information on how they are operating and a lot of them are expressing concerns guests. Volunteers have decreased, so they're asking for us to gather at this information. I also put here the email and phone number. We have plenty of them to look at the updates, but we actually had their respective elected officials actually spoke themselves. I see Andrew on there as well. Okay, so everybody's had to had their reports. Okay, so that's gonna conclude our elected official reports. Must we have anybody else who might join us move on to the chairs report? I think you know some of the information that we've gotten that we've seen tonight is it's pretty young I see somebody who said. Oh there we go you're sharing your screen. You want to put that link in Iraq into the into the comments instead of sharing the screen, I'm, not sure who's, sharing this actually all right. So moving on to the chairs report on Carter booth I'm, the chair of King board too, this is our March 20 24 board. Meeting last month we streamed our first meeting. Never thinking that we would be meeting virtually I think that's a pretty sudden shock the comments that we heard earlier from everybody. You know we were obviously living different world and the goal of tonight's meeting and how our business session is to really put pre-coated 2019 behind us and move forward. One of the things that we heard a little bit tonight is you know, what can we do, and one of the things that we can do is really reach out: help the most vulnerable in our community, our neighbors, that people are next to us. People get sick, there's a link on our website on our calendar to the day and we've sent it out multiple times the New York City, Department Mental Health website. That's got plenty of instructions as far as what to do. If you're helping somebody, how do you clean your building hallways it's a lot of information on there? I keep having Bob put it on there and sending it out because it is so informative and it's constantly updated along with York State Department of Health website and CDC, as we kind of move forward tonight, I'm trying to keep the committee reports, succinct, I think the most of the chairs are aware of that. I mentioned in our Executive Committee wanted to thank Bob, Josh Florence and even in our office. Who've been doing a great job. Our office is closed, is to the public and anybody's got any comments or questions. They can email the office we're going to be taking a break I think to the next few weeks. As far as any committee meetings as we go forward, we are going to have a weekly executive community meeting, virtually unzoom to just sort of discuss where we are each week. As far as going forward. Many of the city agencies Bob's, can give us an update. Many of the city agencies continue their business not as usual, but they are continuing their business and a lot of that business requires our input and yeah we're gonna figure this out, as is as we go forward, and as we see what happens, I mean that's really. One of the very sobering realities is we're not really sure, what's gonna happen and that's something that and have to wait and see, I think we're gonna go forward from there. Bob's can give his chairs report and I'm gonna jump in at the end, with one of the updates on one of the agencies. Okay, thank you call as many or most of our colleagues in government and elsewhere. My staff isn't working from home or week, I'm gonna thank them for the work they've been doing starting tomorrow, I'll be working from home as well. We close we'll be trying our best to perform administrative duties and to serve our constituents. I would like to say that if anyone needs to get in touch with us, the best way to do that is by email do the best we can to respond. Regarding some agency updates information, we really receive from agencies so that they're posted regarding public hearings, meetings and events. The Landmarks Preservation Commission has canceled all public hearings for the remainder of March. Future hearings will still be scheduled. In fact, they have scheduled wonderful, April, 7th that subject to change, didn't change and the best ever want to please check the website for regular updates, has temporarily suspended all of New York City's land use decision making processes. Also D Planning Commission meetings, including public hearings and votes required as part of the EULA process, are suspended and the time periods for hearings and votes will not run. We've been receiving notices by email over the past week or so from the mayor's street activity permit office that events that they have permitted have been met. Many of those events are scheduled for those couple weeks have been denied, so I spoke with the director this morning and he told me that his agency Sabo, as well as the NYPD in the parks department, are revoking any permits that have been issued or denying any applications that have come before them for any events of 50 people. More through April 12th doing that as wanted going forward. He did say that any multi-block event that has been canceled for this year will not be allowed to reapply they'll have to reapply for next year. If it's a small event, a single block events, they can reapply to have their event later in the year and, lastly, the Department of Consumer Affairs I'm kind of waiting for final clarification, but apparently they are not currently scheduling any new public hearings. At this time, the SLA they've suspended 500-foot hearings for the time being, full board meetings are still being conducted, they're actually utilizing the same executive order from the governor to conduct their meetings to some extent virtually and the public will not be included in their full board meetings. However, written submissions from the applicants or those in opposition can be submitted prior to the meetings and they will adjourn any items. We have two items from in our community board before them next week and I believe that people are requesting that those be adjourned until April 15th just and the reason we're doing this is to just so. People understand that some businesses is moving forward in different agencies in different ways, and we have we play a role in that process and to not have committee meetings should we need to in the coming weeks and months would be to sort of abdicate our responsibility providing for providing guidance to those agencies. That being said, I think that I've hit most. The points have gotten notes all over the place. I probably missed a few things and thank you. Bob and Bob's really been doing a great job. He he's actually in the office and I'm in the conference room- and this is probably gonna- be the end of both of us being here at this at the moment. So we're gonna move on now to our business session and you get a motion to approve of February minutes which were distributed by email to board members by Bob, sir, maybe I like to make a motion. Somebody will have to move in now into standing committee reports and our first. Our first key report is schools and Education Committee and Janine Kiley still with us number one is in support of state legislation to mandate, early screening interventions, dedicated schools and teacher training programs for all children with dyslexia and other phonological learning. Disabilities, therefore be it resolved. Cb two's supports the passage of New York State, Senate bills, S 4, 3, 4, 1 s, 7 0, 9, 3 s, 5, 6, 0, 8 s, 5, 6, 9 7, and s 4, 3, 4, -, a New, York State, Assembly bills, a 5 2 5, 9, 8, 7, 8, 6 8, a 7 to 1, 0, 8, 6, 9, 11 85032 and our just the governor to sign them into law and the urges our elected officials, New, York, State, Education Department and the New York State New York City Department of Education to support mandatory early screening interventions, dedicated schools, teacher training and testing accommodations for all children with dyslexia and related learning disabilities. The second resolution is in support of state legislation to mandate, screening and intervention for all incarcerated individuals with dyslexia and other phonological learning. Disabilities, therefore be it resolved. That cb2 supports the passage of New York State Senate bill 5 I mean six seven, eight, seven and new york state assembly bill eight seven two and urges the governor to sign them into law and urges our elected officials, the New York State Education Department, the New York City do e the New York State Department of Corrections and community supervision and the New York City Department of Corrections to support mandatory early screening interventions dedicated school for all. That's a typo here. Something got mixed up in there for all individuals in who are incarcerated in New, York, State, incarcerated individuals and I will fix that and send that to Valerie okay, so actually neglected to mention at the beginning of this the way we're gonna conduct our business session is that we're going to keep adding the committee resolutions into one large omnibus, though, however, if somebody wants to call out an item, we can call it out and discuss it and vote on that separately, but because we're doing a voice rule all boats, I thought that would be more expedient. Does anybody have any comments on either of these resolutions or you need to raise your hand or okay, so I'm, seeing no discussion one to thank you for the great work that you're doing. Thank you. The proposed language for the community strongly supports the proposed language for the benefits face. It's 60, -, 74 Gansevoort and for the resolve. Cb2 Manhattan also strongly supports the strategy that most specific criteria will then be identified by CB twos arts committee or equivalent to be applied by the appointed arts advisory panel during the application process for these spaces. The second resolution, which is very similar but is about a different space than a slightly different criteria, proposed language for CB 2 resolution regarding the qualifying tenant for off-site community benefits face at 7 - 11 Weehawken street 300, West 10th Street and 171 - 177 Christopher Street, agreed to in conjunction with 46 - 74 Gansevoort Street, restricted declaration text will be modified to match finalized binding letter currently before the City. Council, therefore be resolved at cb2. Manhattan strongly supports the proposed language outlining the baseline requirements for qualifying cultural and/or arts organization attendance at the site. Comprised of 7/11, we hope in street 300 West 10th Street in 171, -, 77, Christopher Street and therefore be it. Further RESOLVED, CB, - Manhattan also strongly supports the strategy that were specific criteria will then be identified by sea beaches, arts minute or equivalent to be applied by the appointed arts advisory panel during the application process. For these spaces, unanimous Xavier on both to myself, okay expediency wanted to go ahead and they are each in the same corresponding place for both resolutions. So it's the second to last, whereas in the seat or designee, the chair of the arts and institutions are equivalent. Then it's going to say: institutions are equivalent committee ,, a member of the Land Use Committee or equivalent committee, and at least individual, and so essentially we're a second Arts Committee member and reducing the two individuals to one. Does that make sense resolved? Would we now, instead CD to Manhattan, also strongly supports the strategy that more specific criteria identified by CB twos appointed advisory panel during the application process for these fishes for these phases, so we're striking after CB twos striking the word arts through okay? Does anybody want to discuss are either of these as I see that there's cute hand raised dr. Smith? Are you people came to speak on this? Should I meet you I won you here, I, can't you dr. Smith, so you, okay, I, don't I, know I, see your hand raised, but I don't see. Frederika I see your hand raised. Yes, I'm just wondering how many people will be on the advisory committee with that change people instead of two sort of random members to be selected. It's now going to be one. We decided it was better to wait to have two people instead of just the arts chair, another member of the Arts committee would be on so it's the same people. Thank you, I see. Okay, thanks, Frederick I see somebody I just see them identified as iPhone. Would you just repeat the second correction? It's I'm striking the in the second sentence in the second therefore be resolved. I'm striking the word arts through the to read CD to Manhattan, also strongly supports the strategy that more specific criteria will then be identified by CB choose appointed arts advisory panel during the application process for these spaces. Thank you very much. That's much clearer! Thank you. Thanks Katie any other, any other questions. Shirley I see your hands raised, but I can't unmute you and perhaps you can comment. Yeah. Okay and I will lower your hand for you and if you have something to add, you can jump in okay. So there's any other comments or questions on the two resolutions for the arts and institutions committee as they were presented. Okay, so we're gonna move those two resolutions from the arts and institutions committee into the omnibus vote and now moving on to the traffic and transportation committee presentation on their project to repairs and hurricane sandy damage in the Holland Tunnel, which is supposed to begin end of April at night. We're asking that noise be minimized as much as possible and wherever possible, and also for a community liaison for people to contact. We are also asking considering the portable flexible gates they're, using for protection as the portals which right now are to be stored, far away from the tunnel and we're asking to them to be stored closer to the tunnel somewhere in cb2 such as a pier 40, so that is river 1 and our second row of two rezo's request: transportation mobility review board. That's working at the suggestion pricing plans to make sure they include at least two Manhattan residents has members one residing within the congestion pricing zone and one reciting beyond the zone resolutions Shirley traffic transportation committee. It's ah anybody does being speak or raise your hand. Okay, seeing no discussion. We will leave those two resolutions into the Omnibus vote that we're going to do so. That's two resolutions from traffic, the Transportation Committee now moving on two landmarks, not spent Shannara with us, and here they're, several anonymous and I'll summarize each one 657 Greenwich Street is the fence on Christopher Street that steals the playground of the st. Luke's school. It was an active presentation that they left out the most important part, which is that the fence and it's covering work they're asking if those be made permanent, an additional modification and the fence we described as a construction fence and not at all suitable permanence. So we rejected the denial and some specifics about removing the materials that are thought to be objectionable and coming up with some solution to make the whole area be sympathetic to the district, and did they come back to us, Green Street, which in this case we recommended approval for and construct a new sidewalk and reconfigure. The entrance there's particularly we've got happy to adult. Whites are included. Fifteen seventh Avenue is the one of the hospital bill exists, been repurposed into Greenwich, recommended to sides which fit within the architecture and design of the building be approved and that there not be a flagpole on the corner, sticking out at an odd angle for 46 Broadway the place, which is not objectionable and again vault lights, which were the theme this month. We were happy about and there's some minor changes we suggested in the design and it's approved a layover been Google Street, West, 10th Street through wall air conditioners, and in this case, and a it's not a beautiful building, it's a typical tenement building and it just Falls the facade which is not unattractive and completely intact. Among other things, and we recommended denial of through the wall, air conditioners, 97, Greenwich Avenue is the Sports Club, that's been through some recent changes to make it I would say charitably less offensive and the proposal was to paint it dark, grey and black, which we felt was just totally wrong. It makes a great honking saying amidst some altogether quite nice buildings on the one side or row houses. The other side are Avenue client buildings rather fancy six resolutions. Would anybody like to call out any of those items or have any comments or questions on any of the resolutions which you know put forward? I actually wanted to step back for a second and I wanted to get a motion to have these put on the floor. Their motion to put these on the floor. There was not a quorum at the meeting, okay, so we're going to be considering those six resolutions that Chennault had put forward. Chennault meeting was actually the last in-person committee meeting that we had on the night before. That is the landmarks to me. I miss excuse me in the Land Use Committee meeting, which we had canceled so I don't lose an eye see you have your hand raised the air conditioners. So that's a change. Obviously, that's made to make life in that building much more comfortable window units. Are you know people don't like them because they block the one window in their apartment or whatever is common? We didn't consider the comfort I'm, not sure why it's just the pure temperature comfort, why it's more comfortable than a window I would dispute that pleasing if you're in the apartment I said at the meeting, this is one of them is a vexing thing. It came up at two Fifth Avenue, which whatever one thinks about white brick. Buildings is a rather carefully designed one and it was with some reluctance that we approved it there because it fit into the architecture better and it's not a historic building. In this case, it's just destroying a lot of historic material and aesthetically unpleasing. The landmarks criteria is not. It looks like from inside the apartment, but what it looks like from the exterior and this channel regularly rewind reminds me when I bring these issues up, is that the criteria is very narrow in its in its with respect to what's visible from the exterior and just a very narrow vision that, as far as applying the landmarks rules to two buildings in the recommendations from the existence north of its I, don't recall that we've had this come up except in 2000. You I'm inclined to think it is because it involves such a large destruction of historic material. Do I any other questions. Okay, so seeing none I'm going to move those six resolutions that Chennault had just presented from the landmarks committee into the next committee is SLA licensing number one and Donna Raftery. So we had eight applications. This month we heard three of them. The rest were laid over or withdrawn. All the votes were unanimous, denying less. So the first was an alteration to a four Opie Sophia's Little Italy at 1:43 Mulberry Street used to move the bar from the rear of the restaurant to the front of the restaurant. The we do, seceding from seven to four that was done. Less next was another alteration to a four o P for aunt Jake's at 133, mo bettah sidewalk cafe to the license that was denying less and then the last was an O P for a new restaurant at 195, Spring Street called Nancy narrow. This had been licensed before and basically the hours it was for. Also sidewalk cafe 80 hours of the restaurant and cafe are basically the same as what was there before. So that was denying less or withdrawn. It was in total numbers. Those shows are layover or withdrawals. If I can speak up a raise their hand, Katie I see you have your hand up a quorum at this meeting. I see that it was for a zero seems like it's them. I thought we had a quorum, but I can't tell I wanted to check on that. Make sure we do it correctly if we didn't okay, so we're gonna have one through three and four through eight, are on the floor for consideration. Is there any discussion there introduced by any of those items to discuss we're going to move on into the islands we had was withdrawn at the meeting. The second one was over to the next month, so it really made recommendations on three applications. The first one is kg7. One, five upholstery store seven one three Washington Street: this is an existing on-premise license. It really was just a change of ownership. The main owner was taking over from taking 100% of the ownership of the restaurant. Everything stays the same. The steams same stipulations are in place that existed number two and I was denying less resolution vote. Raoul's restaurant, pretty well-known restaurant on Front, Street, they're, looking to add a second storefront right next door. This application was heard I think about a year ago in the one committee that was approved just like this one is denying less with stipulations. So that would be an alteration of existing license. Number three is the other room, Holdings 1.3 ownership, a new owner was coming in and kind of taken over for the other owners, basically, the same exact operation as before. There's really no changes whatsoever. It's just new ownership. The scene manager is staying on and so not a whole lot. That was the unanimous vote. The denying less resolution the rest for through 15 are all withdrawals, layovers and no-shows 15. They might like to call out any of those items if you could just speak up or raise your hand Carter yes, I need to recuse myself from number three, the other, so I was gonna. Bring that up so we're gonna. Just make a note of that. We're gonna still do this as an omnibus boat, but Valerie. Can you make a note that Rocio is going to be refusing herself on number three Nathalie - because she said owner of the building got it? Thank you baby else like to say anything. Any other comments, questions, okay, so we're gonna move items one through 15 from SOA two into the omnibus boat and no discussion. All right move. Those in next report is quality of life. Joe Gallagher Joe. Are you with us? Yes, hi. The first day of three days, new applications for revocable consent operate in unclose, sidewalk cafe, and the first is Whitehorse hospitality at 567, Hudson Street between West 11th and Perry streets, and it's with 28 tables in 74 chairs. There's a typo in the hours it should read the third, whereas down the hours should be the cafe were closed by 11 p.m. Sunday through Thursday and midnight on Fridays and Saturdays. Can you make that change just directly yeah? Thank you! So much. Okay, sorry I'm nice to have to be put forward as recommendations, because we were one short of a quorum as well. Okay, so we'll do that? Okay, so this one was recommended unanimously approval. The second is super Noriega baby, Bravo 173, seventh Avenue South between Perry Street in Greenwich, with six tables and twelve chairs, and the Committee recommends approval recommended unanimously, and the third is the village down at 225 West 12th Street at Greenwich Avenue with six tables and twelve chairs, and this one is recommended. Approval unanimously and Bobby Lee sent a friendly amendment for number two for shoot. Super Noriega can I just give that to now to speed it up sure and if you could send it into just yeah sure so would be another, whereas this is from Bob. That would say, whereas the applicant currently is aware that he does not have a license to serve alcohol in the sidewalk cafe and stated, he would be applying to alter its liquor license for that purpose in the immediate future and I'll send that to Valerie, and that was back working stated that in the meeting as well. So it's he understands that to be the keys exterior sidewalk cafe correct because they haven't enclosed sidewalk, cafe as well yeah they can serve in the enclosed, but not in though right I think they. Yes, that's right, I just for clarity, because outdoor sidewalk cafe, yeah and okay and then next for the street activity application. Dinners Bob was saying earlier on the phone. The news from Sabo is that many of these have been cancelled already, but I'll read them for the record number for March 19th through the 22nd Adobe Store commercial event. The applicant didn't appear in the commits Committee recommends denial unanimously. The next is March twenty first, twenty two J Crew commercial event against Park Plaza, the applicant didn't appear and we recommended denial unanimously. The next is March 21st to the 22nd, the guest J Balvin commercial event, Broadway between West Houston, Street and Prince Street, and he's 14th he's tense between fourth and Broadway East 12th between 4th Avenue East 13th, between 4000 Broadway and stage fest at pride, fest forth, between East, 9th Street and East 10th, and forth between a East, 8th, Street and East, 9th Street, and then kid fest at pride fest in Astor, Plaza South and the committee recommended approval for all of those unanimously. The next is Gallup NYC on August 9th 2020. The Committee recommends approval Hudson Street between West, 11th and Perry recommended approval unanimously. Next is dinner on a Thursday September 24th 2020 West, 8th between MacDougall and Fifth Avenue. The Committee recommends approval unanimously and for the renewals number seventeen through twenty five. The committee recommends approval for all of those unanimously. Also the village alliance, those two they're starting they chose vendors for their art, is no market in their farmers market in the next few months. The people that run that farm and market- thank you sure and I, see there continue to be numerous landmark violations there. With all these complications of the concerning the Liquor Authority regulations to have some sort of condition, it says zoning and so forth, applicable zoning and sidewalk laws that they have to be conforming. There is the landmarks violations corrected as good applicants. Word is. He said all of the landmarks violations had been cleared and that the received a six year permit for the mural. That's on the side of the building. That's according to the applicant, but I didn't I, didn't verify. I, know that's true or not. There's nothing to say there such thing as a six year. I, don't recall getting the resolution from the Commission concerning this. We did not say I did but I don't always say that very clearly. The applicant stated that they're working diligently to get up to code with all relevant city rules and regulations and cleared up all violations from the last two years, including getting a landmark permit for the existing mural, which is adjacent to the unenclosed sidewalk cafes, some lights or some other things like Mike said there may have been an objection on the Sun Street there I'm, not sure the suggestion have it without this being like certification, that the landmarks have been corrected. Working diligently is something one can do for years: they're quite likely a bad actor and have been from the beginning with respect to landmarks, something to add specifically I'm, not sure how we can amend that Joe. Did you have any thoughts on that? Or do you think that that's sufficiently covered corrected rather than working diligently? Restaurant is in a landmark district. They need a need, a letter from the Preservation Commission kind of signing off on its form. We could probably do it outside the resolution, but attention and ask them to address the so-called. What about a friendly amendment just saying, whereas the applicant, whereas the Department of Consumer Affairs, should certified that all Landmarks Preservation outstanding Landmarks Preservation violations are cured before considering this applicant for a sidewalk cafe, it happens in order yeah and make sure that are corrected and I think corrected rather than cured. It's a term that wouldn't be satisfactory to me. I have a question for the board members of the board and we have to recuse yourself. Okay, just dinner, okay stepped away. Cuz I, don't see him on the green. Just like a little bit. This is Katie. Carter I mean what can I. Remember, -, the one where we had received an email from a community member representatives from the community board. Donna is a residential representative, so any other discussions on items number 1 through 25 Michael and we're going to be recusing themselves on number 16 and number 2 is modified. If not we're gonna move those into there and I, also I, guess: Susan Wittenberg. You were trying to make a comment on something that had been moved into the omnibus bill. This Susan, okay, Susan, okay, I, guess you thought it was Kenny, but I was trying to understand how the evaluation was made. The community was more native space than other arts groups, and I was just asking for my own experience and knowing what used to be available to the filmmaking community, which had to do with low-cost editing facilities, low-cost production, space, shooting space and I didn't I was questioning. Why that the priority that was not in the priority list in the landmarks committee recommendation the resolution and is a part of the restrictive declaration that was sufferance. The land already been determined. What was before the Committee on this one was the criteria to select which was not the not a part of that, because the choice had been left to the community board as far as through the restricted declaration and the side letter that the that was good, the choice was given to the community board. Does that answer your question, or is that a no I guess maybe I don't want to belabor this because we're all taking a lot of time but I guess then what I wasn't clear about is that earlier on, there was a decision that was made that the primary need in cb2 for a space for the Arts was for theater performance dance space as opposed to other arts groups, and what I felt was equal need. So I guess what you're saying is: I missed something in the past that was decided so question now really is moot because the decision was made earlier. The language committee was considering was what's the criteria for choosing a group. As far as you know, what would be the manner in which it would happen that was that was left out by the Land Use Committee, when the Land Use Committee was putting forward their recommendation on the land use matter. A portion of the application I understand so I guess what I'm saying is that's unfortunate, because how we identify so how, in this community arts community this it was predominant need, was for companies to have space and I'm just observing another loss. But what I tried I see now that decision was made earlier and that's why it's not my question to Robin is really. She was responded to a decision that was made earlier, so I think that's what you're trying to explain last chance before we move into considering all the resolutions that have been put forward before us. I, don't see anybody stepping up so what we have before us that we're going to be doing a voice. A voice vote is a large omnibus bill which includes two resolutions from schools and Education Committee, two resolutions from the arts and institutions committee that were introduced, two resolutions from the traffic and transportation committee, six resolutions from the Landmarks committee, eight resolutions from the SLA one licensing committee resolutions from the SLA to licensing committee and 25 resolutions from the quality of life committee resolution number 2 and the quality of life committee has been modified and those are all the resolutions we and, as matter of note before, we take the full load on all the other items that Michael Levine and Cormac Flynn have recused themselves on item number 16s as members of the board of directors of village, Alliance and item number three on the SLA licensing committee number: two rocío sins. It is recusing yourself as well as ston, because has an interest in the property and I believe that that's those are all the items that will be in the omnibus vote that you will be taking now. Is there any objection to voting on these with the with the specific votes, with the exceptions that I've noted just like everybody stay on with us and for the other guests that have joined us as well? On the zoom conference, a few people gonna be asking you after we conclude our business session after we finish our new business, which will be after this vote. We're gonna be going into the executive session to discuss a personnel matter so just before we get there I'm just gonna. Let everybody know that we'll be going through the list on zoom' and making sure that it's just for members. So if the board members would stick around okay so Valerie, do you want to conduct the roll call vote? Everyone all right, ready, Suzanne and Kimberly? Yes, I need a branch. Yes, I'll check back in yes, Susan gammy! Thank you! Susan Kent, Jeannine Kylie, yes, Thank, You, Patricia, leiria, yes, Michael Levine, yes, Thank You Janet live yes, syllabus, Tom, Connor or Doris deeper. It's not a double check on people quickly, Susan gammy, one more time. Okay, madam Erin Matthew Metzger yeah! Thank you. Yes, thank you. I see you nodding your head: yes, Donna Raftery, yes, Thank You sandy Rousseau! Yes, thank you. Rocio sans number. Three! Thank you! Scott Sartiano! Surely Secunda! Yes, thank you! Christian Shay, yes, but for a casino. Yes, thank you Georgia. So there are casinos. Thank you! Dr. Shirley, Smith, okay, Chanel Spence, yes, Kathy, Sullivan, Susan Berg see her on there. Yes, thank you Anthony Wong! Thank you! Yes great and just go check one more time for dr. Shirley Smith. Yes, the number on the SLA to quality of life. Number 16 I have noted the recusal x' for the two individuals that we need from before written in my notes. So for joining us tonight, move on to new business. Does anybody have any new business they'd like to raise okay, I'm gonna, just jump in and say that one of the things that his new business is co, vid 19 and we're going to be addressing we're gonna, be having we're gonna like to ask for the new way of doing of this uncomplicated technology meeting? Yes, but I. Think as we move forward we're gonna try to maybe do some updates in this format. Not necessarily committee meetings but have some of our community partners come in as it seems relevant to us. Some updates mean this is really a good way to at least reach out to awesome to the community and we're gonna be shifting gears with the way that we use zoom as well. To actually have the public participate directly with us in zoom, as opposed to watching on the livestream. We've had up I think up to 25 or 30 people watching the meeting on our YouTube stream. So, yes, we can do that. Connor will be committing meetings during the month view of, or is that too soon to ask I think we're gonna take a few weeks break for committee meetings. If we were to have committee meetings, we would probably do them in the second the last week of April and have a full board meeting in the last week of April. We would have to figure out how we could do committee meetings with applicants. That's another challenge. It's certainly something we can do, but we need to figure out the technological side of that and how we might move forward. But as long as you know, city agencies are beginning to put a pause on their actions. There's less of an of a need, I think at this point for us to schedule at this point any committee meetings something certainly we'll consider as things come up. You know we reacts to applicants and if people are going to be making applications, we don't want to give up her voice and provide those recommendations. So I hope that answers your question Michael is that the question I had is we had to land-use review applications before the Land, Use Committee and, of course, for that meeting being cancelled, I'm wondering if we would reconsider them at a future? Point I had a discussion that evening before the meeting of the late afternoon, with respect to the agenda items on our land, Landing establishments that were for 10 years issues with you know, I've been sending out emails to the board myself to the board members directly, and you know I'm gonna send out another one in the next few days and ask people if it would be okay. That is an open email discussion amongst all board members. I've been blind copying the members, so if people wanted to be involved in an open discussion, I think that would be a good format and also with our weekly executive committee meetings that were going to be doing I believe that we're going to be doing them on Tuesday nights at 6:30, which is the normal time that we do our executive meeting, we're going to be doing them via zoom and any of the regular board. Members are certainly welcome to jump in and see where things on provide suggestions. Of course, you can all text me or email me or to Bob in the you know, email him, and you can also provide you with his cell phone number. As far as you know, anything that comes up- and you know we're gonna figure out ways that we can better keep the community informed of specific issues that are happening from south of 14th Street, north of canal, west of Bowery and 4th Avenue and to the river. So it's really our world and well trying to get as much information as we can about that participating in able to entertain all the business at hand. Everything that comes before the board, I definitely don't expect any private business or anybody that's actually giving applications to not be able to zoom. They just have to click on one link, they certainly will participate and so I would encourage us to continue. Certainly, we as a community board are here and are serving our purpose, and you know I, really it's really impressive- that everyone's done this tonight and it's wonderful and sort of the new way of life. So this is certainly I. Don't think we need don't really call to anything and I just would encourage us all to move forward in the future for all meetings. Would they be a different link for every meeting for the different meetings at this point able to conduct our meetings in this fashion because of the executive order. Relaxing the public officers law that Governor Cuomo has been has put forward. The New York City Charter relies on that state law and I believe that there is a time frame which limits that you heard earlier senator oilman Brad as a bill. That's up for discussion that would make this more of a ongoing situation. In times of emergency- and at this point as long as the governor keeps extending that executive order, so that's what we rely on in order to do this support a resolution and push forward for this to continue being an option, was ever pregnant and serving on the board. It's sort of ridiculous that you know it's taking this long, so we should have this optionality going forward. That's a state level and that's certainly something that I think Brad is considered. I, don't know the exact details of his bill, but I'm sure that Jacob Crowley can, if you want to be in touch for them and can tell you a little bit more about that bill and just share my personal experience. It's great that we're on and we can certainly have guidelines around it, but there's absolutely no reason not to continue it. Okay, thanks Cole and Susannah, the electrician each house has initiating twice weekly calls with its membership, where people on their staff are actually to call people up at home check in with them they're hoping to expand that list a lot and when they do there will be a need for volunteers to take on some of those names and make some of those calls. So I just wanted to put that idea in your head. I think it's something that we might all like to participate and I. Think that the best way to get through this crisis is that to make sure that no one feels isolated reality is that we're gonna have a lot of people who are sick in our community and around us. That seems to be inevitable. To one extent we don't know, but one of the things that we can do is we can call people you can video chat with people and tonight it's amazing how much participation we have. It's almost all of our board members are with us tonight. So it is something that everybody can learn with a little bit of patience and you know and reaching out to people calling them up. You know you know the idea is not to go visit people in person right, but there are other ways that we can connect with each other and that's something that people should consider doing to that point. Also visiting neighbors, which has is a small organization and what they do is outreach to senior citizens, helping them to get to the doctor and helping them to go grocery shopping. Obviously they can't receive people anymore, but there is a lot of opportunity to volunteer to do pick up, groceries and necessaries for older people. So if you have any interest in volunteering and help me out on that, it's you know it's sort of like you just leave something at the door. You could be an enormous service to someone who's comfortable, leaving their house I'm. Putting in a plug for them too and I was gonna. Also say that you know and I see Brad still with us, but one of the other opportunities just for keeping in touch will start sharing. This information, as well as it becomes more clear where, as needed, you know, one of the things just to keep in mind is that the information lag is it's very important to be up to date on where help is needed. You know where help was needed. Yesterday is not the where help is needed tomorrow and I know that Brad's office has been sending out updates and as well as our other elected officials, so signing up for their emails as well is a good way to keep on top of things and we'll be doing the same, but do check when you hear that a need is necessary, verify it and just keep up to date, so that, if you've got time that you're putting it putting it forward in the best way possible on something that new needs that come up. You know this is truly every six hours 12 hours we've got new information and staying it up in front of that is really important, and it's a big part of why I keep pushing the links for the Department of Health for the city for the state and CDC they update information. Those are some of the best resources that we have for finding out information, particularly the New York City site. We had a call or an email from a constituent with regards to what happens if somebody in my building gets sick. What do you do their guidelines on there? What buildings can be to clean their hallways accelerate and what the you know the best practices are. So that's. You know just an example of the information that's already there and in it and if you're hearing questions in the media a lot of times, they'll be addressing those just as quickly on those websites as well and I, think that I saw in a email notice earlier from a one Lock sociation Lennox, Hill, Greenwich Village. Excuse me, Lennox Health's Greenwich Village put out a more elaborate set of guidelines on how you can help what you can do. You know how you can help somebody who's sick. How do you clean, or just some do's and don'ts, so we can get an original up that Bob? Can you mail it out to the to the board? David I see you've got your hand up as well. Just I just want to reinforce called Orson's comments. You know even at some point we will pass this crisis, but this is a really good way if we could integrate the public into these meetings and have some way that they could participate and speak. Maybe we don't violate the open meetings law. Maybe it just needs a little tinkering with it so that we all don't have to be in person, but I thought this was very successful and hats off to you. Carter I thought you ran a very good meeting, so I think this might be a new standard moving forward for us the reality world that we really have to address changing that law at the state level. In order to continue to do that, and the only reason we can do this now is because of the emergency executive order. Understand that. But let's see what happens: okay and dr. Smith, okay I just want to say that I kudos to you and Valerie, because you really gave me a quick tutorial and I have to say, is really been incredibly helpful to me and just sort of reaching out to people who are a little a little, not so up-to-date on their technical skills. But it looks like we worked it through pretty well, we had a couple of little glitches that I see. I got some emails, but I think for the most part, that may have been Internet connections that people didn't fast enough connections, which is also another real consideration in this as well normal times. Brad. Do you want to jump in so that you were so there and your name was mentioned a couple of times sure I'm so impressed this? Was such a good discussion really seamless and informative and important? There could not be a more important time to engage with our neighbors than now so again. I commend everyone for their participation, a lot of good ideas and a Jacob and I are writing we're taking notes- and you know this is a moment we should seize in terms of bettering our public discourse and improving ways that we can interact and you know protect the most vulnerable. So please send the ideas you know to me in to my colleagues and elective offices before we're gonna move into executive session to discuss a personnel matter, so there any other any other comments from anybody. They would leave the call and Mark who's assisting us with streaming, and this would be the point where we would conclude the public portion of our meeting in and our livestream. So thank you for everybody. Who's been watching via live stream. You know, I've gotten a few texts from a few people think Darlene's been watching in Pete and a few other people. So thanks guys for joining us in the live stream and we're gonna start going through Valerie. Do you want to help me out and just go down through the list from beta NYC and have really been a great help to me? So yes, the live shoes off I just want to say thank you to all community board to members.",
        "summary": "Meeting, obviously we're under some interesting circumstances right now, and our meeting tonight is to essentially complete our precoded 19 business and move forward into the world declare in this day , I'm going to try my best to manage this I've got a lot of people who allow them to speak and members to stay on at the end, for an executive session where we have a personnel matter to discuss with that turn over to dollar a dollar and I'm gonna may have to wait a second for people to unmute themselves as we go through the attendance okay, Katie bar Space is not conducive to a sidewalk Cafe, which reflects people's chatter across the streets.\nIf you wanted to debate, and then in small groups we arrived to vote when the We legislation to assist them with either paid or unpaid leave, but guaranteeing their job We will have detailed information on that going out tomorrow and the good news today for folks who will be there lost a job or laid off or have had their hours shortened and have a mortgage The governor has gotten a 90 day.\nYou know the governor's been clear that this the city is not walking down, but we are all asked to stay home unless we're doing something like walking a dog or going out for a jog or doing shopping The whole point is to try to stop the spread, and you do that best by staying inside, to the extent that you can, you know special emergency services working for the Transit Authority All of those are viewed as essential jobs and so we're all working from home and school children are at home and so I don't want people to be panicked.\nA couple of things that we are actively working on is to make sure that we're providing support for contract, freelance gig workers, A seeking payment of about two thousand dollars a month for every American for the next as we are while we are in the health places as a direct payment to people, We also want to make sure that we have credit support for small businesses and nonprofits, both of which are deeply strained under this, with asking folks to shadow their doors nonprofits to theaters to stay dark.\nThe issue that the mayor said is that there outdoors, on the other hand, they are close to each other, so the whole construction issue comes up often so, from our perspective , it's the seniors we're trying to get that early morning time when they can shop, It's, the construction question and, of course, massive amounts of questions about small business which I'm sure you're getting, and congratulations on your technology Thank you very much and let's see president's office, okay.\nLast week the SMU attended one of our final press conferences to discuss some of our concern chunk of the nineteen in my community It is absolutely harmful and unacceptable, and the assembly armor calls for the community to continue to stand together and remain educator, ANCOVA 19 and keep an eye out for all the misinformation that is circulating and it's kind of wild these days to see what comes up on Twitter and gets flat out very quickly in terms of our work, we have done two letters to Governor Cuomo one was for at-home testing kits for equipment.\nThe residents have told us that they have not seen much of an increase in terms of the cleaning, especially in high-traffic areas, so that was one of our letter calling for them to really be fully aware of the areas that need constant cleaning where people are touching a lot or just brushing past all that, and that is as far as what we've done so far, and we will continue to work along with the community as we go into very new uncertainty.\nWe know that many of them are struggling or forced to close making sure that when their workers are protected-- and that also goes for the arts and creative communities and the independent gave workers who right now might not have their normal income stream during this time We also, lastly, want to thank all of our state and federal partners who are working so hard and advocating for new yorkers, and our office is once again open on the clock: people's backgrounds that he's got this ocean in the background We want to make sure that community boards are not You know caught in the void here.\nThe governor's office is seeking those individuals and you can go to the governor's web page, which you can find on my web page You know of someone who has medical experience, they're looking to bring those folks out of retirement, because we're gonna probably need them in the next weeks and months ahead, but this is showing me really truly how strong our community is.\nYouth organizations nonprofit small businesses, like everyone, has been saying, I heard from a lot of folks in the community and we're doing our best to make sure we're listening to what folks are saying, and one thing that I think someone brought up that we're looking into right now, Please feel free, I'm, just gonna broadcast my personal cell phone number If anyone needs to connect with our office, we're using our regular line as well.\nWe use it within the hospital system for telepsychiatry telestroke till I see you even tell a hospitalist now, and it is beginning to move in to the private sector That would always would be very hopeful, but times like this, where people really want telemedicine, they don't want to go out of their homes and go to the doctor's office It's becoming more and more important and then I'm gonna hand it off to dr levy for some clinical updates on Co bed 19, but just to go through some specific questions that were sent to us.\nThere was a question about bringing a relative into the hospital and if they would be exposed to Koba 19, so currently our policy and what's been sent out from the state Of course, if it's a minor, if it's an end-of-life situation or something like that, of course, we look We do allow people to come in, but we're really strongly suggesting that if they're not necessary that they do not come in and they do again something like this as we're in this age of technology, and there is bed capacity there as far as Lennox Hill Hospital, they are licensed 603 two beds currently operating at 450, and they have 48 ICU beds So with what is happening now, we have been going through surge plans for all of North well over the 23 hospitals and hundreds and hundreds of amatory practices and we're looking for open at site locations, even in Greenwich Village we're looking at certain spaces that may be used for overflow, Thank you to community board too, and all the members for you know getting us the opportunity to speak to you guys tonight.\nWhat do you do if you're feeling sick We're really asking folks to try to manage at home, so hydrate rest Yes could be signs that there may be a more serious infection going on everybody that comes into the emergency department at this point were able to test and sort of echoing what Alex had said as our system, not only core lab we're, also partnering with LabCorp and quest and some other private labs, as our capabilities to test expand, we'll be able to test more and more people However.\nWayne, do you want to add anything in before we take a couple questions and that you're muted hold on a second all on me view or a few other organizations, Some of our non-essential staff are working from home or we are fully medically staffed 24/7, as dr Levey said, so people should be comforted in that and that other than that I can certainly understand the need to project calm, and you know that it is under control, but I guess.\nIn other departments we transition on and off, though we are trying to do things to preserve the staffing they don't need to be, and also people like me was administrative So. If one of us get sick, somebody else can pop in their place and we can keep the place running thanks, Are you seeing anyone getting sick because on your staff, because you don't have the right materials so we're doing really well, but the toughest part of this from a PPE, a personal protective personal equipment perspective are the n95 masks.\nWe do have it we're trying to control it so that we don't run out, but I will tell you one thing: Yesterday, specifically many community members came to the hospital to deliver pizza for the staff Coffee cookies, and there was one individual woman that was outside She said no I, don't want a mask So now, May I will tell you when we're in crisis is when you really see the good of people come out, and we've really seen that here.\nShould they tell someone in terms of tracking It's, basically saying if you don't have a primary care doctor you're at home, he gets sick and taken care of yourself I think some, a public health perspective You know with close contact, not wearing a mask with anyone in terms of if you're not feeling It may be something different for everybody listening to the call, but certainly if you don't have access to a health care provider , you're feeling ill, you could certainly come to the ER to get evaluated and that's what a lot of people have been doing and will continue to do.\nI think one of the most real questions as far as the community Should they be doing if I'm sitting in the king board conference room right now, I'm across the street, from Morton Williams and you know, I when I came in I saw a couple of people older people going in and what should people be doing it I know a lot of the delivery services on thing things up to apartment, so they're leaving in doorman, and you go out in the supermarket I think for at-risk people wearing a mask is not a bad again trying not to be in close quarters with people If, you see someone who's, coughing or sneezing turn your back creates the distance so that the best way to mitigate transmission is going to be distance and protecting your face and nose from someone who could be potentially sick.\nThey shouldn't go to the emergency room, really sick, right , Bendigo health are really good partners of ours down here, but yeah I would say to check the NGO health is a fine place to you know an urgent care is fun place to go first at least ago, Health they've put in a mechanism where, if you're, making an appointment to go and see them, they'll communicate with you before your appointment and ask you if you're having any true like symptoms, and if the answer to that question is yes, they'll arrange for someone to meet you outside of the urgent care and hand you a mask before you come in, so that they can at least create an environment, that's safe for other patients, for maybe in the waiting room.\nSome agency updates information we really receive from agencies so that they're posted regarding public hearings, meetings and events, The Landmarks Preservation Commission has canceled all public hearings for the remainder of March They have scheduled wonderful, April, 7th that subject to change, didn't change and the best ever want to please check the website for regular updates, has temporarily suspended all of New York City's land use decision, making processes, Also, D, Planning Commission meetings, including public hearings and votes required as part of the EULA process, are suspended and the time periods for hearings and votes will not run We've been receiving notices by email over the past week or so from the mayor's street activity permit office that events that they have permitted have been met.\nWe have two items from in our community board before them next week and I believe that people are requesting that those be adjourned until April 15th People understand that some businesses is moving forward in different agencies in different ways, and we have we play a role in that process and to not have committee meetings should we need to in the coming weeks and months would be to sort of abdicate our responsibility, providing for providing guidance to those agencies.\nSo if people wanted to be involved in an open discussion, I think that would be a good format and also with our weekly executive committee meetings that were going to be doing, and you know we're gonna figure out ways that we can better keep the community informed of specific issues that are happening from south of 14th Street, north of canal, west of Bowery and 4th Avenue, and to the river It's really our world and well trying to get as much information as we can about that participating in able to entertain all the business at hand.\nWe as a community board, are here and are serving our purpose, and you know I, really it's really impressive- and it's wonderful and sort of the new way of life They be a different link for every meeting for the different meetings at this point able to conduct our meetings in this fashion because of the executive order.\nand I Think, that the best way to get through this crisis is that to make sure that no one feels isolated reality is that we're gonna have a lot of people who are sick in our community and around us."
    }
}