{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB6",
            "channelId": "https://www.youtube.com/channel/UCnAsiniI4DF7vAAe7omWWFQ",
            "title": "Manhattan Community Board Six Transportation Committee - 10/05/20",
            "publishDate": "2020-10-05",
            "shortDescription": "",
            "lengthSeconds": "1:14:38"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB6",
            "normalizedName": "Manhattan Community Board 6",
            "twitterName": "Manhattan Community Board Six",
            "youtubeChannelName": "Manhattan Community Board Six",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "twitterHandle": "@cbsix",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "GZoYFRjFqdY",
            "fillerWordCount": {
                "uh": 134,
                "um": 187
            },
            "readTimeFullTranscript": "37 min read",
            "readTimeSummary": "4 min read",
            "wordCountFullTranscript": {
                "cameras": 27,
                "street": 23,
                "car": 18,
                "space": 18,
                "light": 14,
                "agenda": 13,
                "problem": 12,
                "speed": 12,
                "state": 11,
                "information": 11
            },
            "wordCountSummary": {
                "car": 5,
                "space": 4,
                "safety": 4,
                "public": 4,
                "park": 4,
                "cameras": 4,
                "speed": 3,
                "bit": 2,
                "street": 2,
                "project": 2
            },
            "fullTranscript": "That way we can minimize the background noise. It's James! That's you! Oh sorry, round noise. The mute is on the bottom left and the meeting is now. It has now started on Youtube, so Claire can start whenever she'd like okay, welcome everyone to the October 5th 2020 meeting of the CB6 transportation committee. My name is Claire Brennan and I will be chairing the committee tonight. This meeting is called to order at 702 pm and tonight we are joined by community, associate Brendan birth members of the public. You can raise any questions or comments that you have through the question and answer feature of zoom. If there is time following the committee's discussion, we'll field questions from the public, no one has volunteered to take minutes for tonight's meeting committee members nope not true. Last month, though, I had second thoughts when I saw the agenda, I think it's an easy one. Well, I wish you well on that task and I appreciate you stepping up just a side. Note, I think, we'll be sending out another doodle poll for folks to sign up in advance after this meeting. But now we will take attendance by roll call. Brendan will conduct the roll call. Many members, I will call your name and you will unmute yourselves when your name is called please say present. I will announce if there is Quorum Claire Brennan, I'm here, gene santoro here, John Berenbaum President me Desmond, President, Pearls, Hernandez, present Andrew gross present molly hollister. Here present, okay Napolitano, I did see his present at Robert President Larry Shire President Ann Seligman, here Brandon Van Noven President Ronnie White Ronnie Bob Cohen, I saw I saw Ronnie in the participants list and James Wilson Present. There is Quorum okay. I think we have to get James yeah. If James the mute Button is bottom left. Also Brendan. Do you have the ability to do that there we go wonderful, okay! Thank you. The agenda for tonight's meeting was distributed ahead of time by the board office and appears on the screen before you. If there's no objection, we will adjust the agenda. As stated members of the committee. If you object to adopting the agenda, you may raise your hand through seeing Noah Jeff objections. The agenda for tonight's meeting is adopted. James. Can you mute yourself very loud James present? No, you need to mute yourself, yeah, that's good! I muted things. Sorry! Thank you. Okay, so the agenda has been adopted. The minutes from the September 2nd meeting were distributed ahead of time by the board office. If there's no objection to these, we will adopt these minutes committee members. If you object to adopting these minutes, you may raise your hand through zoom, seeing no objections. The September 2nd meeting minutes are adopted. They will soon be available on the cd6 website. Okay, thank you. In order to conduct an efficient meeting we'll observe a few ground rules. These have been in effect for a while now, but I'll just remind us all of what we're expected here. No one will no one may speak until the granted the floor committee members. If you have a question about committee business or wish to make a motion, please raise your hand through zoom. Excuse me if you click the participants icon, the participants panel should appear and you should find the raise hand function there. If you still have technical difficulty, you may click the chat, icon and relay your difficulty. The chat function should not be used for committee business or questions about agenda topics. All such remarks should be made on the record. By raising your hand, through zoom chat should only be used to alert us of any technical difficulties you are having or to state in writing information like an email address that was already stated aloud on the record during the meeting. When a committee member is given the floor to speak, I will identify you and you can unmute yourself so that you can speak and finally, we are required by executive order to create a verbatim transcript of the meeting. So please keep your questions and comments, succinct and germaine to the discussion. So we saw the agenda and I think we are ready to officially begin so. Hiroki is here to present on the redesign of the 37Th Street Fdr Underpass, and I'm going to pass the Mic over to him and I think, there's a few slides that he wanted to share. So I do not know if Brendan's pulling those up or how to do it. Brendan are you able to pull the slides up? Yes, I can do that right now, just a moment. Okay, there we go. This is the this is the do you see, we can see it yeah, hello, everybody, but actually we're. I think we're on the third slide. So maybe, if you start is that, do you hear me yeah? Okay, thank you for allowing me to present some idea that I have and I'm a I'm a residence near Un and organizing helping organize organization of Brick and Glick park, and then I am an architect I love gardens. So I go to Greek park so many times, but I always have a some unhappy moment. Let me explain it and then can I see I need to. Let me explain a little bit the current situation. No sandy! No, I saw you okay, you know the Greek Park Glick Box. This is I'm sorry, the hand in know small hand, shows the Fdr and then actually this drawing is cutting out to the road above and then upper part is East. River and the bottom is the street 73 37th street and then the problem is for me is it's very dangerous because the that the cars here coming out from the Fdr missions stand? I guess this is the extension of Fdr, so they are very fast. Instead of you know they should understand. This is a street city street, not fdr, but very fast. On the other hand, this side, Riverside, also similar thing- is happening, but slightly better. So I will show you the image. What's going on now sorry here this is from under earth, so you see the car coming very fast and then go through in front of you and then disappear. This is this is a city site and the bottom one is from the picture from the city side. So from going to the underpath, it's not so dangerous, not the problem because you can see cars are coming, but from Underpath, it's so dark and the visibility is very bad and then also not all not for us. The cars car do not recognize us. As you see. You know this part these car, but this bus is not moving, so it looks okay, but consider this bus is running very fast and you are standing here currently. This is this part, is the opening entrance and the next one too next picture shows this, and this is opening, so people go through this, but the cards running coming down from Fdr can not recognize you very well, and only people rely on traffic sign for cards, side also pedestrian side, and I believe somebody someday will have a accident, and this is the buzzer eye. So you see this is actually already proposal was reflected. Sorry and the idea is, people are coming now from here, so this part blocks the view from the car so instead bring the people out from here cent central part and then make a kind of diagonal path same fortunately sorry Riverside, it's people goes people use the central part. So that's why actually it's not so dangerous, and this is the view from a street site. So the car blue car, on the left- hand, side, is a parking, sorry, stopping and also they can see the producer and coming out and then this is. This is the view from from the car this part. So you see the my proposal is to extend the as you see the curve, a little bit like projecting from Fdr, so people come here, Perusian comes here and then the car driver. This is the view from the car can see. I'm sorry, someone is there. The current condition is actually shown. You see, there's something some hand or something here. This is the condition the existing condition you may be able to catch. Somebody is coming out, but actually you are moving so fast. You do not notice, and then this guy may come out may not come out. That's only you know, predictable, not predictable. Actually, through you know, your sign is just green, but you never know and then I'm sorry how to yeah the other- and this is from the street Sorry Pedestrian side, the yellow cab and that blue car is approaching. But you are outside of this fdr wall, so you can see the car is coming or stopping there's a signal here, a sign, so they may be not moving, but it's not so easy for you to recognize in under the fdr. So you see that something red the round thing is a little bit ex extended to the street side Street. So you can stand up and then confirm the cars is coming or staying there and also, if this red thing, I do not know the color right now, but this is extended a little bit so car automatically recognize it and then slow down. Hopefully that's the idea and then the other side also the other side means Riverside, is also something and similar. At this moment, people goes out from the central part like this girl, but also the other problem is this guard Concrete guard is covering up to this color and the other side is also not a concrete guard and then also protection of the column extended. This way some way here. So even car approaching you do not see the cars, so you may get a sign. Actually the sign traffic sign is here, but you may miss it. You know. New yorkers are very bad to respect Trump's side so and also some blind. The people may have a problem, but anyway, so sorry, sorry, maybe yeah, because this I will show you some existing condition this one. This is from from the Glick puck, and this is what I said, the protection of this column and the concrete guard is coming over up in this existing columns. So the car you know like a cab, you do not see the body because of this, and so first side is taking out the whole thing and then put some decent protection here and then basically maximize the visibility and then give the drivers caution. This is a pedestrian and then this street this is not the extension of Fdr. This is a street some sign in a visual sign like that. Instead of a sign signage, that's the basic idea and then- and also I think, it's a good chance to put some some device to make this space nicer, because it's so dark and then dirty- and you know it's like a jail here, so we can take it out and then make this entrance like a welcoming gate to the clickbank. At this moment. It's not like that. It's really the scholarship and that's it. Thank you for listening to me. Did you do your catch? Thank you so much for the presentation. I think that the committee members can definitely agree that this needs a serious upgrade and I think your ideas are welcome and beautiful. Thank you. I really appreciate it. Thank you for coming and presenting to us. I see a few on raised hands, so I'm just going to call on the order that they're up in the line, gene yeah. I just wanted to say that one of the reasons we were interested in this besides the fact that it's beautiful in itself was that we're thinking about this in terms of the shovel ready stuff that we spoke about. It's another project to put online to get DOT to study the area we've been pushing for them to do something about this for years with no success, and so if this is a way to get them moving when the money comes, if the money comes, we've got another project lined up that they can throw it at and we can get something that we really need out of it, because people do hate that space. That's it thanks: gene Andrew, hi, so, first of all hiroki, I just want to say that this is. This is an amazing presentation and I I'm a pretty avid runner, and I run actually all the time in this space, I'm very familiar with this space, and I was involved about a month ago with a person who was hit by a car at this space who was very seriously injured. I was there like about probably two minutes after they got hit by a car trying to cross from the river the Riverside there and I actually ran and got police from the ferry to bring them this. You know this person had like a, I think, a head injury. So this space is not it's not just about visual, as you very eloquently put it it's about safety, and when you know last time we looked at, for example, another infrastructure project with like a nice bridge, which I think is gene, said it's very nice to plan ahead. I actually look at this as a serious safety issue both for cyclists and for pedestrians. I go through here at least three probably three times a week and every single time I cross the street. I feel like I'm risking my life, there's, probably no more dangerous place in our district to be a pedestrian short of, maybe the the Midtown tunnel you know crossing in this spot. I also think that the other problem we have in this spot, which you are addressing here, which has come up time and again we keep putting band- Aids on it, is this spot is full of homeless people and I feel very bad for them. But you can even see it in your photos. It's basically an encampment and it's really disgusting and what I think this space does and hiroki tell me if you, if you disagree with my assessment, but I think that by bringing in natural sunlight and by bringing in light into the space it will, I think it naturally deters people from like trying to sleep in there. I think that, in addition to that, we as a board will need to if this is done. I think we need to think about how to put like lighting in here maybe at night to make sure that it does not become another encampment, because if the city is going to invest in something beautiful like this and also importantly again for our safety, we have to make sure that it does not become an encampment, and I think that that's you know it's important, maybe hiroki. Maybe if you have a thought, if I can ask how this space maybe would naturally prevent- or if there's anything we can do to make sure it does not become like a homeless living space is important. But again, thank you. I think this is. I think this is critically needed. I agree. I agree totally agree. I kind of skipped the presentation of that design inside because I thought we did not. I did not have yeah. I think that this is kind of more conceptual. So maybe, if you have an answer to the lighting question, but then we'll keep the agenda moving. Okay, yeah! This is muted. Oh yeah, you're, muted, oh yeah! Sorry, it's not easy by accident yeah! This is the first time for me to use zoom anyway. Thank you like this. The problem of the space is too dark, so I rip it off whole everything that makes inside the shadow or dark. So one of the idea is put the refractive material on the ceiling and then the light comes in between. Basically, this black part is vacant. Nothing and the light comes in between lights, and then this circle is a refractive material like stainless steel, polished to the standard steel or something so the lights from the street side and also a Riverside epoxide goes in and then refracted down. So the whole thing is brighter. That's the idea! Thank you so much, and also I just want to reiterate for everyone again. This is just a concept and we're not really talking about specific details of the project, because DOT will plan and actually execute, but Anne took her hand down so larry. No, oh you did it. No okay! I made it and I think someone else took it down yeah. I think this is great. I think this is a really tricky area. One of the things that we have not talked about a ton that I think makes it so complex is the interaction for cars, pedestrians and cyclists, and so there's kind of two things about that. I know that it is not the preferred route, but certainly cyclists come along the Fdr. The access road and they're typically come along the right, because they've been avoiding the traffic coming from the left and then they cross over to get in so there's just a mixing zone. There that's tricky and I think maybe that's exacerbated if you're trying to funnel the you know kind of all of the traffic into a central entrance and exit, and while I agree it definitely improves the sight lines and that's you know really important. There's kind of this other element there that I think would need to be incorporated in any. You know kind of fuller design. Okay, thank you. Ann Larry did you have a question? Well, I'd like to make a comment: okay, the Concave mirrors on the on the roof are very, are very intriguing to me, and it reminds me a little bit about our discussions previously when the 37Th Street Bike path was under consideration by this committee. I had suggested a Convex mirror on the on the outside to help people who are in the underpass, see where the vehicles were before they stuck their heads out. So that's why Hiroki's idea here is so impressive to me. D.O.T did not investigate or do anything with that idea and this by physically moving the the entrance to a very much more visible location does solve that problem. So I wanted to commend him for that. Thank you, hiroki. Okay, thank you, Brian. I just also wanted to add a comment just to say that, in terms of what was mentioned earlier about potential occupation of the space and encampments, I think that our priorities are to design a space that is functional for the public and try not to get mixed up in anti- patterns and hostility features to try to keep people out of the space. I think that if we have a problem with encampments, it means that we need to build more housing, so that would be our focus, but thank you for designing a nice open space. That seems to be an improvement over what we have now thanks Brian. I agree with that b had a question, but you might need to unmute yourself, but that's like suggestion I have to tell you I've been meeting a number of community boards. I thought I did sorry you did. You did yeah yep. Sorry me, I I've been meeting a number of community board Members Park and I actually have to tell you, because I do not spend a lot of time at that part of the of our community board. I actually thought it looked like a derelict park. The darkness and the safety was really an issue to even cross, because I'm not sighted in one eye. That was a major concern for me to cross over. I think the design that's presented highlights what the deficits are, and I think I said before this is a concept. It's a concept that would have to work down. So I would actually record recommend that we do a resoluting that we do the issues of great park and deal with the safety, the lighting and make it a community park. I think, having something shovel ready is going to be very significant. Thank you I'll. Second B's motion. Okay, we do have a few questions from the public. I think I'm seeing some written in here and then I see one member of the public who has their hand raised. One of the people that's their hand. Raised, has also asked some questions in the Q&A feature, so I can yeah I can, if you like, I can just read off some of the questions. Okay, so one question is: is not the pedestrian bulb a driving hazard projecting into the street and then asked what does DOT? Think of this? I know it's really a concept right. Maybe, since that's like kind of more focusing on the details of the concept, we might want to skip that one. I'm trying to read these sorry yeah, there's a lot of confirmation that this area is an issue yeah. Also, a remark saying also: there is no curb cut for bikes to roll up onto or wheelchairs. It is not ADA compliant. So I guess the it's a statement, but I guess a question of what sort of ADA compliance there will be for the for pedestrians. Yes, I know it's not totally ADA compliant yet, but we will study more and then definitely to get work like being on slope or eliminating sharp edge or and also color, it's so pre, and this study is very primitive, so we will keep studying. I will keep studying that's great and I'm seeing the other questions are about, like lighting and getting back to kind of thinking about. Yes, folks, so I think that, certainly if a member of the public has a specific question, they can read it or send an email to the board office, but I'm wondering is colleen here and listening to this. Are there any claire? It's colleen, I'm here listening? How is everybody I want to say this? Okay hiroki, I want to say the conceptual design is very beautiful, considering what's really there now, and you know this particular area. I know D.O.T we maintain the lights and under the Underpass, but I believe the underpass is part of Park's jurisdiction and I believe the state is also have some jurisdiction and in terms of the roadway. Yes, that would be DOT. So it's a collaboration between three agencies, but I'm going to find out from my office if there's any interim or upcoming projects for this particular area, and I will let the community board know, but in the meantime brendan, if you can forward the presentation to me tonight and I'll share with my colleagues and we'll have a discussion about it. Okay, we'll do. Thank you very much and I think colleen with that conversation. If there's anything that can be added like immediately to help this situation, because a lot of the chats and questions are- and you know, I've witnessed it too- it's a dangerous situation, so maybe we could get something in there as soon as possible and then think about a complete redesign. Oh yeah, I know one constituent is advocating for a speed hump in the area, for example, just to give a taste of one of the types of safety improvements that are on people's minds. Okay, so that could be something brought up, but I think B suggested that we write a resolution and gene Ii did it. So we should take a vote now on Appreciate b. Are you offering to rate that rezo? Well, let's do the vote first and then we can figure out who is going to write it if it is happening so we'll now vote on requesting that DOT studies this area and creates some alternatives and improvements by roll call when your name is called for, you can meet yourself and say a nay abstained or not entitled Brendan. Do you mind taking the roll call for that Claire Brennan not entitled okay, gene Santora, I John Barrenbaum Aye B, desmond Hi Charles Fernandez hi Andrew gross hi, okay, molly Hollister, hi, Youssef, Khaled, Hi, Sandy, Mckee, Hi, Phil, Napolitano, Hi, Matt, Roberts, hi, Larry, Shire, Hi, Ann Seldman and might be unmute I'll. I sorry all good Brian Van noven. Yes, I ronnie White, I Bob Cohen Bob Cohen and James Wilson James. You might be on mute. I have not seen him anymore, okay, James yeah. I you should be yeah. You need onion buttons at the bottom left. I also tried on muting you. The resolution has passed by the way I just want to make sure I get James's vote. Thank you bye and what's your vote, you already voted. I did not hear you. The count is just a moment. It is 15 in favor, zero abstain, one not entitled well thanks and do we have a volunteer of who might want to write this resolution or is available to do not all jump at once. Okay, that's great! Thank you! Okay. I asked the question: do we lose everyone's picture because everything's black on my screen? Oh I'm seeing us all. Maybe if you flip through somehow are you on an ipad or a I'm on an ipad? I saw Anne before just lost her. I think they moved got rid of the tren, the presentation so maybe you're looking at Speaker View and you want to have like gallery all right. I'm I'll see if it comes back. Thank you, yeah, sorry, okay, so we will now move to the next item on the agenda, which is a discussion on speeding and red light cameras in our district. So this is kind of has been a little bit ongoing. We've been talking about it, I think in new business in the past, and I think some of us have also been conversing offline about this issue and, with you know, the change in travel patterns and more folks. Unfortunately, relying on car use, there has been an uptick in speeding witnessed like antidotably, but also Brad Hoyleman has introduced a bill that we kind of discussed already. That is focusing on like racing in general and I'm not sure that that's actually the issue with us. It's more of individuals just speeding, but we do not really. You know the red light. Cameras are not rightfully so you know published widely because then folks will slow down for that one block and then continue speeding. But I think that there's something that our committee should probably be doing in order to combat this and try to prevent reckless driving. So I'm not sure if that's you know, writing a resolution to request more speed cameras or to support Brad Poyleman's act, which also extends the use of them on the weekends and outside of school hours. But I'm seeing some folks having wanting to speak to this issue as well. So maybe sandy you can say a few things, I'm pretty sure that we did write a resolution in the past asking more cameras, and I think the issue really is that we just need many more cameras in the district and, if I recall, I think we are limited by the state. Colleen may be able to address this because there's a cap and there you're limited by the state assembly member. So if you want increase it's more of a legislative issue, that's correct sandy. So if there's a way that we can address this with our with our you know, there's that's probably I mean we've already written the resolution, I'm not sure if we can write a follow- up to it. That address really highlights how this fits. This particular point in time yeah and I won't wonder who the resolution went to. Maybe it did not go to the assembly member, so we could forward it to them. I do not. I do not know Andrew had his hand up all right yeah, so I guess I'm waiting for my camera turn on. I'm not I'm not singing a channel in like a challenging way here, but you know, if you want people to stop speeding, I think the question's also, you know red light cameras right like do. They actually make people slow down, and I guess- and I think so- I'm not necessarily saying like I'm opposed to more red light cameras. I think that they have, I think that they have use. I mean they create tickets for some people and the city maybe will make money right, but I think that if we want like enforcement of or make people slow down, you know I think I really think that's probably more of a police visibility matter like when you see the New York City Highway Patrol out on like the Fdr right. I think that's, I think, that's a very visible deterrent for people, I'm just I'm just closing like. I do not know that. I completely hear you, but I'm pretty sure that they're, like proven, effective and also traffic stops, are proven to be, unfortunately given to folks who of color and black and brown people- and I did not- I did not say traffic, I did not say traffic stops. I said visibility of police, that's I'm not suggesting that we stop people, that's not what I said. I do not want to go there, no problem, it's different, but I appreciate your thought and I think that again I think that red light cameras have some use, but I'm not sure that they're going to that they are the answer to this issue, and I agree that speeding is a problem. Okay, does anyone else on the committee have something to add sandy? I just want to follow up with what Andrew said that we actually did invite the police, and they mentioned that it was special training to do this type of speeding and you know documenting speeding, but also, I think, in New York. There are a lot of people like there's a whole series of lawyers that will get you out of your speeding ticket. So it's a bit of a it's a fairly complex issue and not that we should not try again to do something about it, but it seemed like the red light. Cameras were the you know, one of the tools that we had. If anybody else has other ideas for other, what other tools are available, I mean definitely the police did not seem to appreciate or want to jump into the to the fray of having more people address. Speeding. Okay, I see a member of the public wants to speak on this issue and has some kind of antidotal information, so Ian Robertson. I am sorry if I do not, I'm not pronouncing your name right. Could you brenden allow him to talk or yep just a moment? Okay Ian, you should be unmuted. Okay. Thank you very much really excellent discussion. Last year, Second Avenue was so busy that I almost died on a crosswalk being crushed by an MTA bus. Two weeks ago a cyclist was taken away by ambulance on 39th and second, the last week there was another cyclist taken away on second and fortieth. There was another instant at the weekend where somebody was hit at 42nd and second speed cameras, work, it's been proven, and the question is simply that we are literally seeing people getting hit every single week in Second Avenue and enough is enough and we really need those cameras and just to the point, there is a parked cop car on 39th and second regularly cars just speed by it. There's and it's it can't be an enforcement issue for police, I'm very close to the 17th precinct, and what you find is that a cop can stop maybe six or seven people in an hour a speed camera can take photos of hundreds of drivers in an hour. We need to do something as a community, because people are getting injured already and they are going to die. Thank you so much. Thank you for sharing. I agree it's scary and something needs to happen. I guess the question at this point is: if we already have a resolution, what are the next steps? Besides trying to re- elevate it? I could just jump in for a second sandy was not there does not did not. This have originate with something to do with Sutton place. This particular issue, yes, Sutton place very specifically asked for a camera at 54th and Sutton place. They asked if one could be installed there, but I think the issue was that we want them everywhere. I mean that's one very specific area, but we do want them in a more even more places. Molly did you have something yeah. I was going to ask Colleen so the red light cameras and the speed cameras. Those are both state legislators that are controlling those money. Those budgets. Yes, so we have. You know we included that in one of our budget priorities for the city, you know as we as we you know, advise or recommend our for the city budget, but I you know we just need to keep this as a priority and we need to measure it's very dangerous in our neighborhood and it's more dangerous than it's ever been before. I agree with everyone else's comments, but you know I'm we're grasping at straws, trying to figure out how we can buy our own speed cameras, or you know so just to measure it because it is like. I do not know if people do not believe us in the state or city Council, but we'll you know we'll go to our state assembly and maybe sandy. If we can just update that resolution, I think we should write it again. Re restate the importance of this. It's bad just a point of clarity for me, please, if I could ask Colleen you're, saying the state assembly member controls the funds for this, or is it the state legislature that legislates the limits on the cameras as a whole? Well, it's the state, legislators and they're, the ones who limit who put a cap to it. But in order for you to you know, pursue this and you know increase the cap. You would have to get in contact with your state assembly members. I do think that the cap was increased, but now there it was a few years ago. Yes right, and so are there more cameras available that we're just waiting to cite or is it an issue that we have to increase the cap even more? At this point, I think it's an issue that you have to increase the cap more. I think it's actually there's two things. There's the total number that is increased, the total number of cameras of both types and they are treated differently in the legislation, so that's important, but it's also where they are distributed. So I do not think you know. If we had the money, we could get it. If it's not, you know if there are no more to be allocated. We also. I think, though, need to talk, as somebody mentioned at the very beginning, I'm talking about what hours, because I think right now I can't remember which but they're only sort of operational during school days, just full hours like while school is in session, and I think a lot of the problems are. You know, especially, I would say, Midtown honestly traffic's back to where I was people are doing a lot of. They may be running red lights, but there's a lot less speeding, because traffic is back up, but at night it's really a problem and, of course, at night visibility is lower, and so, if those, if those cameras could be functional 24 hours- but I that may require an even bigger change in the legislation. Okay, Brian we'll try to wrap this item up because I think we're all kind of on the same page here, but Brian yeah we're all on the same page. But to add to what Anne said. Most of what she said is correct. There is a statutory cap on the number of speed cameras that the city can install within city boundaries. It's not a very high number DOT, I believe, has shuffle those cameras around to kind of make up for that and make it a little less predictable, but also there's still stuff in the law about the hours of operation. That Ann was mentioning, so we could petition the legislature to basically either greatly increase or remove the caps and to take restrictions off of ours for both types of cameras. We could do a resolution for this, or we could go on past resolutions that we've done. I do not know if the past resolutions say anything about unlimited cameras or just support existing bills that included statutory caps Larry. I think you're muted. I think the last go- around with the legislation made the the hours much greater, not limited to simply school hours and school days. In addition to that, I was wondering whether Colleen could verify whether there might be any unallocated cameras that have not yet been installed, and if that is the case, let's ask for you know Larry. I do not know if there is- and I do not know if I would be a privilege to share that information. I really do not know you know, but if there are any, we want to ask for them. Well, I think I do not believe there are any. I mean we've used all that we have in this dispersing it city- wide. We would not be holding extra cameras. Why would we do that? No but there, but there you said that you know they sometimes are taken out of locations so but they're adding to other locations as well. If they're, taking out, if they're being taken out from one location, they're added to another location that might be problematic, you know we would not be saving. I understand that and I okay good. I do not want to argue, but just ask you to check. No, I think that there's a lot of clarification that needs to be made here and we'll try to gather some more information offline and any other questions that come up. Of course, Brendan is: does a great job at fielding them and doing research. So Sandy did you have another question, or did you want to make a motion? I wanted to make a motion that we do a resolution that asks for both speed, but I mean the previous one was for red light cameras. We asked for both speed and red light cameras to be added throughout. You know throughout our district second okay Molly seconds that so now, let's take a vote on asking for more speed, light, speed, cameras and red light cameras in our district Brendan. It would be great if you could do that roll call again. Okay. So when I call your name say I nay Abstain or not, entitled Claire Brennan, I'm not entitled gene santoro, Hi, John, Berenbaum, Hi, B, Dismantle, hi, Charles, Fernandez, hi, okay, Andrew Gross, hi, molly hollister in favor, Yousef, Khalid Yusuf. Does he step on the call anymore? Okay, Sandy Mckee in Favor Phil Napolitano Hi, Matt, Roberts, Aye, Larry, Shire, Hi, Ann Seligman, I'm seeing her mouth eye like. I do not know why it's not working I'm getting a hand instead of a pointer, Brian, Van, Newen Oven, I ronnie, White, hey Ronnie is here I'll get back to Ronnie in a moment. Sorry about that. I no problem. Bob Cohen is not here and James Wilson he's on mute, but I see his mouth saying I or moving to I so the resolution passes if the resolution passes. Sorry. Thank you. Brendan. That's great is someone so not for nothing, but you know you, google, where the speed cameras in New York, it's not hard to find out. They are not a big secret. Does someone want to write this resolution? Molly is raising her hand. Thank you. What was your vote again? It was like correct James, yes, perfect and if you do not mind great okay, so molly offered to write the resolution and it seems like there's some easily googleable information that could support you, but I think Colleen might be able to help as well. We are going to go to the next agenda item, which is a discussion of an open street application for East 36Th street between the Tunnel Approach Street and First Avenue. I actually have to admit I'm not as well versed on this topic in particular, but I'm pretty sure was it sandy who made an application for this open street and it was denied and were wondering. Maybe colleen has a little bit more information about exactly why it was denied or sandy you could chime into. If you have I'm sorry Sandy did we get back to you why this location was denied? No, so how do you know it's denied? We did. We made two applications and one we received an approval for and we moved forward and did it the other one. We received no information. Okay, can you send me an email after the meeting and I'll find out the status for that location? Okay, certainly. Thank you very much. I believe it was back in May, okay, I'll find out what happened. Okay, thank you thanks Andy. So I think that is set for that agenda item. I'm sorry! Just for the minutes, you said 36 between first and then tunnel entrance yeah, it's 36 east of the tunnel entrance so between First Avenue and the tunnel entrance but eat you know you're going if you're as you're entering the Tunnel East of that is a basically is not that just a park. There is not there. Well that's! That was what I wanted to comment, so that is mostly direct, Amazon and fresh direct, and you know unloading it's just like just free and some cops yeah. So it's just free parking for a lot of people and it's not used for traffic, so the St Martin's park, it's our Parks Committee, is dealing with the whole redesign of the park. They're trying to figure out they're, adding the blacktop is being astroturfed they're all concerned about where they're going to their kids are going to learn to bike and use their scooters, so that just is the perfect spot. This under used street that you know yeah is empty and there's a little bit of a staging area there now for a water main project, it'll leave very you know, it'll be gone soon. It just makes sense and that project the Parks project is scheduled to start in November. So you know I do not know if that's true or how much of the parks project will start in November, but the construction will start in the next several months. So there's some urgency there to get these kids space. It's really a heavily used park. You know all the blacktop and the playground they're trying to push the they're trying to push recommend the bikes and the scooters go on the plate. The small little playground area, so it's kind of it- does not work, and this just seems like a great solution. If we could pilot this open street there, maybe you know future can be. You know truly like a nicer activated space there rather than just a street. That's you know being used, but anyway there there's a lot of potential, and since D.O.T has this test program, this open streets, I'm really hoping to take advantage of that and get those PTA of 116 and 281- are very excited about it. Initially, I think the capacity when Sandy filled up this application many months ago they did not have the capacity to volunteer, but now they're saying we will we're all in we'll help we'll if you know put barricades up whatever we need to do. They really want to help so it'd be great to get. We have support of the families and parents, the schools- and you know our community board so Colleen is there? Is there a time frame for when you can get back to us and what the status of that application is? You know what sure I can find. I can get an answer for you tomorrow, because I'm surprised we did not respond and Sandy mentioned this was submitted in May. So I'm a bit confused here. I will definitely get an answer tomorrow, I'll find out. Thank you Colleen. Thank you. Yes again, send me the email and, let me know exactly when you applied okay, oh I'll, try and take it out. It was, you know, covered Central. I did see a member of the public wanted to speak on this issue. Erica Rand Silverman. Is that still the case or yes? Well, there are a couple of people expressing that you know opinions about the open street, there's Erica and then there's a richard toledo who is opposed to. It sounds like as opposed to the open street, so I can, if you'd like me to let Erica speak, I can do that. Just give me a moment. Okay, can you clarify? I think, Richard might misunderstand where we're talking about. I wish we could maybe screen share a map or something it's just. First, it's just that small chunk next to the park. It's not a full street and it would be a shared street too to say you know I do not know if it's depending on what the final outcome it could be a open street or a shared street. So just I see Richard's comments there that he's asking about it's to the tunnel entrance you're still able to go through the tunnel and enter the tunnel. There is what we're asking for it would block off the tunnel entrance is a good clarification. Thank you, molly hi. This is Erica. I just I feel like molly said everything that I wanted to say. So thank you, molly, but as parent you know, as a as a representative of parents at 116, when they do close off that blacktop, the kids are not going to have any place to do those things that they do on the blacktop and so that extra space would be really important for us. Thank you for joining and affirming the need for this so Colleen's going to do some research for us and get back to us and we'll share with you all what we find out and now. I think we have a report from colleen anything that she wants to share with us, so the only I have one thing, which is the second Avenue gap. I have to tell you: we are moving forward in October with the implementation. We had some other projects that we needed to complete in September. So that's been done so promise October is the implementation, and I had emailed the board the the revised what's happening here. Flyer I sent it to the elected officials and I sent it to the local precinct as well into the bids. So we are there's no changes with that timeline. So that's the only update I have for the Community board thanks, oh and the last thing is that we've been really working very, very hard with the schools with the outdoor learning. We've worked with two schools in your district, and I want to say that you know we've been accommodating. We've helped the schools a lot with their social distancing. So we'll continue to do that and monitor the two schools that we're working with in your district. Okay, thanks Colleen. I think some members of the public have some questions and I also had a follow- up, but I did want to thank you publicly for working out the CitiBike placement issue. That Joan was liaising. I think folks from her building are really ecstatic. That was all worked out and I think everyone's happy with that issue. So thank you so great. Thank you before you move on to the public. I think Ozia had a question yeah I'm seeing like Nazia and Larry, and I also wanted to follow up one question that we had from last time and I'm kind of curious about it. Still. We know that it's like non- toxic paint, the green and red paint that goes in the lanes, but I was wondering if you had any more information about like what the specific materials are in there in case anyone's like allergic to that or sure you know what I think my comment last time was to submit a FOIL request for that yeah. I'm more than happy. I can give Brandon the information. My colleagues again, my colleague, Litigation Division I'll, give Brandon her contact information to submit a FOIL request to get that information. Okay, thank you very much. I remember that. Actually now so Larry had a question very worried about whatever's in that paint. If we got to submit a FOIL request, find out what the ingredients is. Okay, never mind, you know what I my office is nearby broadway when we were painting it, and I'm still here so thank God, we're all wearing masks. I know I hope we do not have to anymore. I'm tired Larry. You have a question: yes, hi colleen on the second Avenue improvement. Thank you very much for moving this forward. We had a representative at the land. Use committee meeting was involved with the water main project and he looks forward to working with you cooperatively, so that if there are any kind of temporary relocations of the lane, as they do their work, that this protected lane will be kept intact for the entire length. Oh yes, Larry and thanks for that reminder, we do have a call with Ddc Liaison this week to talk about the implementation. So yeah we do have a question. I had a really quick question: colleen, thanks for the update on helping the schools, increase their social distancing ability to do social distancing. Can you just mention which schools is yeah? You know what I'm going to email Brandon to two locations, I'll have him with you Brandon? Can you share that with the health and Education Committee, because this came up at our meeting last month and earlier this month? So I think they'd be just curious to hear, because we had the PTA come from some of the schools asking for some help. Sure I can send that to Brandon when I get on you're welcome great okay. I think that's all for Colleen. Thank you for being here again and for taking our questions. I think the next item on the agenda is my report, which will be brief. I promise one kind of important and significant announcement is that in November this committee will be renamed to be public safety and transportation. Matt Roberts and I will be co- chairing this committee and gene will continue to support in his role as vice chair. After several inquiries and conversation, there was a clear need to reinstate the topic of public safety to this board and transportation made the most sense at this time. This move will hopefully support a more active and prosperous relationship with both pricings that serve our board and the community as a whole. So I'm really excited to be working with Matt and continuing to work with gene on these topics and November will be the first meeting with public safety added to the name of this committee. So that's an exciting upgrade update to share with you all. I already thanked colleen for acting swiftly to help joan another really quick thing that I want to say is that Larry had sent me an article about taking the subway and how it's you know safe in terms of coronavirus, so I can circulate that too. I did not realize that the whole committee did not receive that, but I there's no proven link that Associates Mass transit and the spread of Covid-19 as ridership increased Covid-19 cases did not folks, are wearing masks and practicing social distancing for the most part and really keeping to themselves on their commute. So there's not like this transfer of particles, so the article did say that what you do at the end of the trip affects the probability of contracting the virus. So if you have not heard this wash your hands people, but I want to kind of encourage us all to consider taking the subway and the bus instead of you know, ubers or rideshare or own personal vehicles, because it really is not unsafe and tell your friends as well, because yeah I just and thanks Larry, for sharing that article and you might have something to add to you. Yes, the the author of the the study was Sam Schwartz, who was our guest last month right so yeah, it's pretty promising, but I think that funding and money in the subway is really low right now, so they could use all the support that they can get. So that is all for my report here, I'm wondering if anyone has old or new business to share. No, I do not think so. I'm not seeing any virtual hands or real hands so move to Adjourn gene moved to Adjourn and second molly seconded it. So if there are no objections, we will adjourn this meeting, seeing no further business. The meeting is adjourned at got ta, say pretty great 8 15.. Thank you, everyone for keeping your comments short and sweet. It's great to see you and we will see you in the public safety and transportation committee next month, but full board before then. So thanks again have a good night. Thank you.",
            "summary": "The agenda for tonight's meeting was distributed ahead of time by the board office and appears on the screen before you.\nYou see the my proposal is to extend the as you see the curve, a little bit like projecting from Fdr, so people come here, Perusian comes here And then the car driver.\nYour sign is just green, but you never know This is from the street Sorry Pedestrian side, the yellow cab, and that blue car is approaching.\nIf this red thing, I do not know the color right now, but this is extended a little bit so car automatically recognize it and then slow, down.\nI think that the committee members can definitely agree that this needs a serious upgrade It's another project to put online to get DOT to study the area we've been pushing for them to do something about this for years with no success, And so if this is a way to get them moving when the money comes.\nI was there like about probably two minutes after they got hit by a car trying to cross from the river the Riverside there, And I actually ran and got police from the ferry to bring them this.\nThis space is not It's about safety, and Last time we looked at, for example, another infrastructure project with like a nice bridge, which I think is gene, said it's very nice to plan.\nAnd I think maybe that's exacerbated if you're trying to funnel the you know kind of all of the traffic into a central entrance and exit, and while I agree, it definitely improves the sight lines You know kind of fuller, design.\nI, just also wanted to add a comment just to say that, in terms of what was mentioned earlier about potential occupation of the space and encampments, I think that our priorities are to design a space that is functional for the public and try not to get mixed up in anti- patterns and hostility.\nMembers Park and I actually have to tell you, because I do not spend a lot of time at that part of the of our community.\nSo I would actually record recommend that we do a resoluting that we do the issues of great park and deal with the safety, the lighting and make it a community park.\nIf there's any interim or upcoming projects for this particular area, and I, will let the community board know, And, I, think colleen with that conversation.\nIf, there's anything that can be added like immediately to help this situation, because a lot of the chats and questions are- It's, a dangerous situation, So Oh, yeah, I, know one constituent is advocating for a speed hump in the area, for example, just to give a taste of one of the types of safety improvements that are on people's minds.\nSo I'm, not sure if that's you know, writing a resolution to request more speed cameras or to support Brad Poyleman's act, which also extends the use of them on the weekends and outside of school hours.\nI'm, pretty sure that we did write a resolution in the past asking more cameras, and I think the issue really is that we just need many more cameras in the district And, if I recall, I think we are limited by the state.\nAnd I, won't wonder who the resolution went: You want people to stop, speeding, They actually make people slow, down, and I guess- I mean they create tickets for some people and the city maybe will make money right, but I think that if we want like enforcement of or make people slow down, you know I think I really think that's probably more of a police visibility matter like When you see the New York City Highway Patrol out on like, that's a very visible deterrent for people, I'm, just I'm, just closing like.\nOkay, I see a member of the public, wants to speak on this issue and has some kind of antidotal information, so Last year, Second Avenue was so busy that I almost died on a crosswalk being crushed by an MTA bus.\nCameras, work, it's been proven, and the question is simply that we are literally seeing people getting hit every single week in Second Avenue, and enough is enough We really need those cameras and just to the point, there is a parked cop car on 39th and second regularly cars just speed by it.\nThey asked if one could be installed, there, but I think the issue was that we want them.\nI wanted to make a motion that we do a resolution that asks for both speed, but I mean the previous one was for red light.\nOkay, so molly offered to write the resolution It seems like there's some easily googleable information that could support you, but I think Colleen might be able to help as well.\nThat was what I wanted to comment, so that is mostly direct, Amazon and fresh direct, and you know unloading It's just free parking for a lot of people It's not used for traffic, so The St Martin's park , it's our Parks Committee, is dealing with the whole redesign of the park.\nYou know truly like a nicer activated space there rather than just a street.\nA member of the public wanted to speak on this issue.\nI. Think some members of the public have some questions.\nBe the first meeting with public safety added to the name of this committee."
        }
    }
}