{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCBACES Committee Webinar",
            "publishDate": "2020-12-08",
            "shortDescription": "",
            "lengthSeconds": "2:25:20"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "H4vAZ_xbPNw",
            "fillerWordCount": {
                "uh": 399,
                "um": 413
            },
            "readTimeFullTranscript": "92 min read",
            "readTimeSummary": "14 min read",
            "wordCountFullTranscript": {
                "school": 92,
                "lease": 56,
                "building": 44,
                "students": 34,
                "projects": 31,
                "program": 28,
                "capital": 27,
                "funding": 22,
                "street": 18,
                "roof": 17
            },
            "wordCountSummary": {
                "school": 28,
                "lease": 14,
                "building": 12,
                "projects": 9,
                "capital": 8,
                "Covid-19": 4,
                "situation": 4,
                "day": 4,
                "schools": 4,
                "kids": 4
            },
            "fullTranscript": "Hi guys hi this evening, Josephine hi, Alan, hi, everybody. Just a note. Some of you may need to rename yourselves. You would please thank you. Hi kid made it. Oh yes, you may have already seen it, but it looks like you've got a question in the Q&A yeah ready I'll get there miss counting quorum right now. Oh I think it's for you, Jess Amber, okay, one, two, three hi Blake yeah we're one away eleven one two three here we go we're all good. Now, six you've got quorum. We got corn we're good to go. Leftover yeah. Give me one. Second, all right take your time! Thank you, David Warren. How are you good? How are you doing all right? Did we get an agenda? I, don't remember getting one that doesn't mean we didn't get. You got a cup, you got a couple of them. We send you extras. You didn't know that when you asked for dog sauce extra duck sauce, we sent you so would it be? You know, I love those things behind your China cabinet there by the way bells yeah the bells. I love them even the one to the extreme left is a bell. It looked like the top of a Torah or a buddhist thing. Hi amber I, see your question yeah you we're going to move you over to panelists and David, and anyone else this might be helpful for I just dropped a link to the agenda into the chat for Panos. Specifically, so folks can click into that. If they'd like thank you, Kate I, don't see Steve on the attendees. Unless he's calling in stuck in traffic no I, maybe he might be calling in. Let me just quickly ask this question. One thought Alan and Jesse is calling in through either the numbers on the attendees. You just need to raise press star nine to raise your hand and we'll bring you over while we're waiting to see what happens there. It sounded like New, York salt might be bringing a student, so we could have them go so that if the student is here, he or she can get on to other things in their evening. Okay, so we'll start and we'll go with that, oh well, now it looks like I think I have Steve hold on one second, unless you guys do want to do that yeah. Let me give time to okay all right folks. Thank you good evening, panelists and attendees, and welcome to the December regularly scheduled meeting of the arts, culture, education and Street Life Committee and, as you've already heard, we're operating under the auspices of the executive order by the governor and of course we are being recorded transcribed and if you wish, you could view this again on our YouTube site. So we've got a very interesting agenda tonight and before we get started just a little bit of rules of the road again after the presenters present we'll have the committee ask questions comment when they're finished, with their comments and questions we'll go to our attendees and afterwards we'll circle back to the committee for some wrap up and see. If there's any actions that we need to take for those of you for the committee and attendees, please stay on mute until you speak. If you're need to ask a question, you can put that in the question and answer if you want to leave just a comment without having to do or ask for any kind of response, you can put that in the chat, if you're calling in on phone star six to unmute Star nine to let us know that you want to ask a question: oh I am unmuted Alan. What good evening Steven Tozulo I've been trying to contact you guys for the last 10 minutes: okay, yeah! Well. Finally, the star 6 function worked on the phone I just want to. Let you know that I'm here that I heard you mention that I was calling in, but I sent two emails to Jesse telling him I needed to be unmuted, but I didn't get a response back. Okay, I'm glad that I'm on the call. Thank you just want to. Let you know that I'm here and I'm waiting for Umberto to call in okay. So do you want to wait a little bit or what do you think cause? We have another presenter I think that's ready to go if Roberto's not on the phone. I mean I, can let the other presenter go while I wait for my colleague to join us, and then we could go through the questions that you have for us on the updates, yeah Jesse. What do you think Dude Steve? Do you know what phone number Roberto's calling in from yes I do? Can you hold on one second and I'll? Give it to you Sir hold on please kindly hold on I. Have a zero six. Is that him foreign, zero? Six? That should be correct, sir. All right so we're moving him over with you need some mute himself yeah. That's it zero six and then you can up mute them. If you have them now and we're on we'll go okay, can you hear me I'm on? Yes, we can hear you Roberto you're wrong. Number, though, took us a little while to get in, but we're in okay, so Steve you're on well. First of all, thank you for the invitation. Welcome excuse me welcome Steve. Thank you, Al! Thank you. I! Don't have zoom, so I can't see that interesting, collage behind you that somebody else pointed out. You'll have your opportunity. Sometime soon, I'll get an opportunity all right well anyway. I am thank you very much for inviting us for the update. Thank you Jesse for reaching out to us as you're well aware, we've come off the unpause for a lot of projects in the city, most notably for four major projects that we're currently doing in the community board. Fourth district: those projects are Bayard: Rustin, M-440, William, C, Harris, Public, School M-O-11 on 21st street M-111, Adolfs Ox school over on West 53rd, Street and M 600 fashion industries high school on 24th street. We also had some small work over at 834, which was the high school of environmental science that we had concluded a little while back upcoming projects that we will have in your district currently on board. Not yet moving, but we have it being pushed through design phase will be the exterior work on m33 Chelsea prep over on 26th and 9th avenue. So that's something that's going to be coming down the line and at the time, when we're ready to go, we'll inform the board and we're happy to speak with you, then about the work we're gonna. Do there, as far as the updates on the villains, in my understanding with Jesse, he had just wanted some updates on the buildings that we're working on currently and where we stand. I'm more than happy to provide that to you. I have some bullet points here that I'd like to share with you, if you don't mind sure, okay, so at M440, for beyond Ruston we're currently in the process of securing license agreements and permits to do the work, we're not doing actual work at the job site. Yet we have to secure 10 properties for license agreements, we're going to kind of follow an example of that, whatever elevation that we can get West East North south, if we can get the properties along, anyone at elevation will start to work on that elevation right now. We're kind of zeroing in on looking at 9th Avenue to get the work done there and most of the license agreements will be pretty simple: we're not gonna look to put scaffolding on the roof or in their backyards. We're just gonna look to do the usual roof protection to protect their rooms and we'll work off of I. Believe the method that we're looking at is hanging scaffold to do the work on the facades over at M11 William T Harris Ps11, which is a very involved and complicated project. Where about 42 percent of completion for the work we are working on, all elevations, East, West, North and south. We are currently working on the roof cage and scraping that down to refurbish it as part of the scope, work that we're doing and we're working on solidifying the stability of the walls on the elevations of on the east and the West side. I know that the neighborhood has called in asking about completion dates. You know, when are we gonna get out of there? Let's remind everybody that we had a very long and arduous licensing agreement lead-in period with the neighbors on both sides of the school on West, 20th, Street, 327-329 and 313. We also had Covid-19, which put a stop on us for nearly five months, so we are now going to be looking at well now, tentatively, a substantial day. Completion of November of this year, but I'd like the board to be informed, and you should be aware that we currently have a new bulletin and for work on the main roof that will we discovered that it needs work. That was in the course of discovery when we were doing the cage work and we took apart part of the roof, the school roof. The main roof needs to have some more work done on it. We need to redo the roof, and the pavers that'll push us out, probably another two three months to February of 22, and then we should be done with the building. We are still adhering to the stop loud noise at 10:30 p.m, though, of course, there are different opinions from neighbors who call us, but Jesse I want you to know as well as Al and the committee that we are answering every complaint, either through email or phone calls, and we are working in conjunction with the councilman's office and with the Community Board district manager. So, as far as that goes in terms of neighborhood communication, we've been very above board with them, and we've worked with them on any complaint. They've had I, don't think. We've turned down anything so far in respect to what they're asking us to do as best as we can to mitigate it. We do work to do and still more to go as I said the main roof. We have windows around the inner courtyard. We have the stone work above and below the windows to do, and we have an accessibility project where we're going to put an ADA bathroom and a lift system in by the main entrance of the school building, so that we can have accessibility for people who are disabled. So that's where we are right now on M11, I'd like to move over to m111 and give you where we are at the Adolf Hock School, currently we're at the 25 completion the work we're doing. There is the removal of all the terra Cotta facade, which is around the entire building. The skin of the building plus concrete substrate, which was it seems in some areas, severely water damaged and needs to be taken out and replaced. We are working on all the locations, all the facades around the building. We have the scaffolding up around the entire building and we're working as best we can under the Covid-19 regulations, which, by the way, applies to every single job. We're doing. We have Covid-19 safety protocols in place, social distancing, check-in, table safety, masks sanitizer. We have our safety division, come out and inspect to make sure that the general contractors are following the protocols and most notably we're doing social distancing, which unfortunately creates less of a work crew and prolongs the work a little bit more. But the safety factors are what's important and we want to make sure we're doing our part going back to 111. We are working on our roofs in terms of the demolition for the terra cotta. We are at a 90 completion rate for that and 10 of the roof has been demoed so far, we're going to begin parapet, repairs which are the roof walls within two weeks. This job, we expect to be done, we're looking at November of 2021 with the new estimate due to the Covid-19 situation, where we were shut down for about five months at that work site also, and that's where we are with M111,834. The high school of environmental science. Now I put that in because I saw Jesse's agenda and I saw that school was included as a subject, conversation for your board I mean for your community, so the work we had done there was that we had done a code compliance by putting in a new auditorium egress a doorway. So there was a second way out of the auditorium that they have in the building. That job is done. The fire alarm system is operational, and as of now, we have no work planned for the building. That's in the immediate future, I didn't get a chance to speak with our architects and engineers to see. If anything was down the line in design, that's something I could follow up with Jesse. If he's interested in that moving on to m600 fashion industries, we are at 20 almost 20 percent completion on the work. We are continuing to erect the scaffolding on West 25th street. We have one more month to go to completion for the scaffold installation. 24Th street is totally complete for scaffold installation and we are working on our scope, which is pointing raking and pointing the mortar joints, brick replacement and we're resetting the coping stones on all the roof elevations, which are the capstones on top of the power pit walls. We are also following the stop loud noise edict at 10:30 pm and just as an asterisk mark that I have here to let you know that we took also. It took a very long time to get licensing agreements with our neighbors on West, 24th, Street and West 25th, Street, probably about with the Covid-19 shutdown. We probably lost a year in terms of work, so we're looking at an original new date of finishing the work by April of 2022, and that's where we stand right now with the projects. I believe that you guys have an interest in the district. Please, if you have any questions or comments, I'd like to take them and I have Alberto on the line. To answer anything. That's construction related so before we go to the committee, I just want to recognize and thank Carl Wilson from District Office for being here tonight. Yeah you got to speak up. Carl Wilson from call in the Saa have been partners on a lot of the projects in your district and thank you Carl for all the help. You've given us. Thank you. Allen Questions Alan real quickly can I just you also have Emily Barstock from somewhere in the Rosenthal's office. Here, I brought her over. Oh I'm. Sorry I just wanted to highlight that I brought over principle from the high school of environmental science. Who was the second item on the agenda this so okay, any questions I have a couple of questions, Steve, it's more about the four or five year plan. If you want to comment on that, you submitted on the capital plan, yeah, they're quick, you know, and I'm not going to get too involved with it, because it's pretty extensive and I'm hoping, maybe once we kind of like grind us down to what affects our schools. We can maybe do something early next year on this well I gotta. Be honest: we just passed the November amendment and I haven't fully familiarized myself with a lot of the new numbers that have come out, but I'm more than happy to take the questions and return an answer to you. Okay, if you want to send it to me in emails, I'm happy to reflect back to you guys. Okay, all right, we'll leave it at that sounds good yeah, no I wanna provide responses to you, but on the capitol again 637 pages, there's a lot to learn in there yeah. So to pick it up and to look at it, I can call our capital people and I can provide responses for you and make sure that we answer the committee's concerns. Okay, I just have I'm just curious about something in the report regarding Ps11, it states, installation of surveillance, cameras, installation of surveillance, cameras, yeah and there's a price tag. There were like 78 or 79,000, which is something we've been asking for, and we obviously okay. That would be an ipdvs project that I could look up for you and I will find out about that. That's generally work, that's generated. We do camera installations, but it's handled by a separate division of the Sda called Ctf, the citywide task force or the gordian group projects. It can be a mentor job that we do also, but again depends upon what kind of work is being done if there are, if there's a question of camera installation in Ps11, I'm more than happy to look it up and I can come back to you about the ipdvs project. I'll we'll put a list together for you and we'll go in there yeah. That would be helpful to me and again it would. You know, give me a bit of a road map to follow for you guys, but again with camera work. Yeah I can get a response for you on that. If there's anything you're saying that money was allocated for the work, I believe correct, it has a price tag. There I don't know if it was allocated or not. But that's a you know. Okay, but this was resolution. Eight money from an official I have no idea. I'll leave that up to you yeah. We have to find out the source of the funding too. That's okay! All right! Leslie has a question. I just have a quick question and you might have answered this at the beginning because my internet is going in and out so I apologize. All this is all I know. These are a few years plans down the road. Are all these paid for and done like the money's in the bank, because, as we look for these, are fully funded and realized projects that will go to completion? Yes, the money's there we have the money, it's been released by OMB and City hall, we've managed to pry their fingers off the bankroll, and we have the money to finish this. These jobs are coming up and there will be money right now is in there for design for m33, which, by the way I neglected to let you know is that we're actually doing two room: conversions in the building for the school, we're almost completed for the first floor conversion and then we'll be working up on the second floor, hopefully within two and a half months. Great. Thank you so much you're welcome Leslie. Did you see the question in the Q&A out in the Q&A Ryan I can do it? Brian Matlin asks for those schools without classes in session. What are the Cl? What are the plans for work schedule and day durations days of day of days of work etc? Alberto, can you answer that yeah sure if there is no student population or teachers in this building, we will work during the day. However, if teachers are going into the school to conduct remote teaching or if there's any kind of student activity such as I, don't know clinics, sometimes from this building have clinics for the community, we are not allowed to work during the day we keep our evening schedule. That's the rule right. I might also add. Ambredo made me think of a point that I did not bring up and I'll bri my briefing to you and I'm sorry that I didn't bring it up, but we have a policy also that involving work at the site. If there is a blue DOT or a red DOT on the Covid-19 map for the DOE and or the situation room reports, a Covid-19 case that calls for such a closing of a classroom or the building, we do not go on to the work site until the school classroom or the building is cleared. That's a policy. That's been put in place since the beginning, one that we follow and that the general contractors have been told to follow, to lessen the likelihood or the or you know that they catch something or something goes awry. So that's the policy just so you know that if the building has that code on and I'm sure you guys look at the Covid-19 Daily map once in a while, you take a look at what schools may be affected, there's a point where they close the school and then the point where they reopen the school. We follow that and then we come in the next day after the school's been reopened, so just to put that as another piece of information that you'll understand the work practices that were that part of what we're undergoing with the Covid-19 pandemic surrounding us. It's a tough way to work. Carl Wilson has a question before Carl. Oh Michael, Allen, Brian Matlin has some follow-up questions, so I'm just gonna bring him over to speak because I think okay, more help is more effective. Just allow him to speak rather quit doing it in the Q&A, but Carl should go ahead and I'll just bring over back mine's. Very quick I was just taking some notes and I wanted to just clarify something about the timeline for Ps11. You said that it was supposed to be done by the fall of 2020 but 21. No, the anticipation was that it would be done. It would be done by 2021 in the summer, but because of the Covid-19 we lost all that time. Working Carl we have to you, have to put that time has to be made up somewhere. So, unfortunately, it gets backed on to the end, and that brings us to November, but we currently have a work assignment request going through regarding the main roof of the building. During the work on the cage, it's been discovered that the roof needs work on it also and the pavers need to be taken off. There's too much weight up there. There's too much stress the roof needs to be repaired. Also, so that's what we call a bulletin, which is a request for additional work going through. That will add time on to the job we anticipate I. Think Alberto two to three months. Is that correct, sir yeah? That's a good estimate, I would say about three months and that's right: that'll bring us February, 2022, okay, call you're welcome, sir. Thank you. Carl Josephine, before we go over to Brian Joseph Josephine has a question for Steve Hi Steve. This is about Ps 11, and so since the work is not going to be cleated completed until 2022, is there any way that the school can have at least some use of their yard? Because there's a lot of there are cars parked in there there's all kinds of equipment you know. Is there any way in the spring or as we get to the warmer months, where they can make some use of the yard? Thank you. I understand you you're talking about the lodge yard on the west side of the school that stretches down 21st street right, the blue, offense right. Yes, right, I, don't know the answer to that. I'm anticipating that, because it's a construction work site and with the principal's approval we took over the yard, that's something that we're gonna have to talk about and see. I, don't know, I'll be honest with you, I don't know, because that's a construction question and a question between Amberto, the project officer and the general contractor and the school. So I would be more than happy to put that question forward to see if there's a or roberto, if you're listening. If that's something that we could make an ask on and see what the response is for that. Okay, we can make, we could ask that would be wonderful. I'm sorry I would say that most likely, the answer is going to be. No because okay, it is a restricted area. You know, there's building materials, there there's equipment and it is a secure area. So, for that reason, I would say it's not very likely that they would allow kids to go in there. All right, Josephine, we'll still make the ask- and you know, if that's the answer, confirming what the senior project officer has stated we'll. Let the board know that. Thank you. You're welcome, Josephine, any other questions from the committee. Please all right, I guess we'll go over to Brian. Can you hear me now sure? Okay, thanks Alan, thanks Steve, Umberto I, think this is just a clarification follow-up for you, but I'll. Let Umberto or Steve answer whoever's appropriate when you were talking about working during the day if there are no classes in session and no teachers in the school, what I'm just trying to understand is: does that mean day shift instead of a night shift or day shift in addition to the night shift now gimbal? Can you explain the difference? Please yeah most likely it's a instead of not in addition to okay, so we're not looking at a situation where we might have people working from 8 a.m to midnight, for example, no, definitely not for the possible future, but you never know yeah. Okay, great! Thank you very much sure all right Alan, any other questions, Sir, possibly any other questions for Steve, please well, I Steve! Would you be able to stay on because I think the high school for environmental science has a brief presentation on what's what their process, what their with their status is with the their capital projects and I. Think it'd be helpful to have you I, I'm not on zoom, so I won't be able to see it. So the question is what I'm gonna I mean. I want to be helpful, but I don't quite understand. Are these future requests future asks because that would be going through D.O.E to come to us, yeah Steve, let let's let principal Nashville just speak on us, oh okay! How are you thank you I just appreciate you staying on. This is about held up capital projects because of our lease expires in 2023, and it's fine. If you get can't see the presentation, I thought it would have to do with the lease yeah, because some our capital projects have a tendency to run two years or better. If we're looking to do work inside the building, such as we did with your auditorium, ma'am yeah we've been there for quite a while and by the way, I just want to add one of the most beautiful offices in the entire city. I just want to add that yes, I know it's good. It is the old NBC. Oh my god, it's just beautiful in that building better than the White House. Yes, we do know that you have a lease agreement that expires in 2023, so I don't know generally with that kind of a deadline they tend to not you know they tend to be a little skittish. You know looking at the programs looking at what can be done if you'd rather send me an email which should be better for me, because then I can get it to the right people to have the conversation with and get you more appropriate answers. Okay, that would be better. So if you could do that, you still have my email from our Ufc meetings. Yes, okay, fantastic, so email me yeah, I'm more than happy to look at it. It's easier for me, because, with the stay-at-home stuff, email seems to be the way to go. I can get I can send it to the right people and get answers for you whether they're thumbs up or thumbs down, but I can get your responses that way right now, there's no way I could possibly give you any kind of definitive answer other than to say just send it to me, but you do that it's easier for me to get the answers for you. Jesse, do you mind sharing the screen with our presentation, so I'll just get going on it? Yes, I will give me one. Second, I'm just having a little technical, all right! I'll stay on to listen to your presentation. That's not a problem! Alberto! You can go. Yeah I! Think we're done. We don't need Mr Cotes any longer. Do we Al? No I, don't think so. Thank you. No Roberto! I'm going to listen to the presentation. Yeah then I'll be saying good night. All right. Okay, thank you! Take care! Okay! Thank you. I appreciate you taking time to be on with me. Okay, all right. Okay, I just wanted to thank you guys of having us on we. My name is amber. Nashmi I am the proud principal at the high school for environmental studies, which is known as M 400 and located on 444 West 56th street. Although the building is m834, it's an unusual building because it's comprised of actually three buildings, 444,450 of West 56th Street, as well as 850 10th avenue. If we could move to the second slide, we are really here to talk not just about capital projects which have been delayed and our reserve funding projects have also been delayed. It's a combination of work not getting done, and the least expiring in 2023. So, just a little bit about the building, it was built in 1909, it's a historic art, deco building. It was Fox films. During the silent film era, it was converted to offices and then eventually high school for environmental studies moved in there in 1994. they had an initial lease and then guaranteed a 10-year extension, which now expires in 2023. We were the first DOE school with the environmental mission and one of the issues we're having is since 2017. We have not been able to acquire capital funding for building renovations because of the lease. So, for example, we got a 75,000 reso, a from Brewer for bleachers, and at that time they said. Oh, you have about eight years left, seven or eight years left on your lease. We're not going to do anything so right now it's things like that haven't been. We haven't been able to do so if we can go to the third slide, just to show you who's in the building, so I'm the administrative building principal, although we have a couple of other programs, so as you can see, we serve about 1300 students. 80 of them are under poverty level. A combination of our students with disabilities and english language learners comprise about 30 percent. We have alternative high school, which is 850 10th avenue and serves about 350 students with a live center, that is for the students there who have infants. We also house the offices of Restart Academy from district 79, which is actually the building, is 450 west 56 and they use the third and fourth floors. Environmental studies uses all three of those buildings. It's a weird setup, but we do use all three of the buildings, but we are separate as an entity. It's not shared space. If we could go to the just to give you an idea, we do what we were in the New York Times. We do amazing, a food studies class with stone barns, the just to show you a little bit about our school. So this was at stone barns. We have a relationship with them and then next one Jesse. We do a lot about climate change and social justice and environmental awareness with our students and the we did voter registration. We do it starting the junior year. We have an amazing relationship with Alvin Ailey. We have an amazing gymnasium and 15 sports teams, and next one we do have a chicken coop on our roof and those are our chickens and they're surviving our pandemic and they're named after the spice girls. We have three hydroponic labs, which were which are right now shut down, but we grow our food. We also have the beyonce. We have a beehive as well and we produce our own honey, and so we have a beekeeping club Jesse. So here's where we're stuck at because the lease expires in you know. In year, 23 in August we have a rooftop garden. That was, they were supposed to start running. They come in 2006 to do an evaluation. They came back two years ago and they said okay, we're going to do a roof rooftop. You know repairs, of course, that went three months in and the lease became an issue. We barely have any water fountains that work for our students and like two of the six floors of work. So that's an issue for our students, our gym bleachers, as I already told you that we had a grant from the resume funds from Gail Brewer three years ago, and they will SCA will not install them. We have three elevators out of which only one works, because it's a million dollar project and again it's a lease issue. We have a freight elevator that has not worked, and the auditorium renovation that Steve talked about was about the egress, but we also had through the arts funding. They were supposed to do, update our sound system and give us like a wonderful stage so to update it, and that's also on hold right now. I think that is pretty much our presentation. If I could just add it's not just the capital funding. It's also. There is a certain amount of pressure on our school community, not knowing if our space is going to exist for us to use as cool programs in three years, and we keep getting told that it's not a high priority, but obviously for us it is, and the building has been fully converted into school spaces. So I, don't if the people who own the lease where to take it back I, don't know what they would use it for, but it would put our programming at risk and all the pictures that principal Nashville showed you all. Those spaces wouldn't be able to be used. So that's also like the other half of the time, and you know it's putting a really high needs population. We have students with disabilities and, like we need elevators working, we and it's. So our ask is really to help with the lease, as well as getting some of these projects done so I'll leave it up to you for questions. Okay, I got a ton of notes that I just wrote down. The main ask is, basically you want to know whether you're getting a lease extension or not. That's what you're listening for and whether or not one is in the works, because that, obviously that drives the bus for all the capital projects and res away projects being done in your building since, with less than five years to go, it seems that there again there's a hesitancy to want to make this kind of investment into the building. If it's not going to be a realized investment, you know two three years down the line. So if you'd like to send me that email I'll make a call tomorrow regarding the lease I'll send an email on that I know who to ask about that and we'll see what this their answer to me is and what the status is. I might get the same response that right now, it's not a high priority that there may be other leases that are actually up within a year that they're negotiating now. So let me see what they tell me and then we could get back to you. Okay, so let me have an email from you: I'll have your return address on it and I'll respond back to you that that's the most at this moment, I can do depending what the responses are. Okay, that's fine I will send you the email I mean we did contact SCA and they're like it's in the works. But did you tell me who you spoke with this year? That would be hard. I'm gonna have to look through my emails. Michael, okay, not a problem yeah. However, as you can understand, it's posting us. We have three different programs in that building and right now I mean the fact that my students don't have working water fountains or might distribute the working water. Let me give you a direction in which to go. It's very simple: the custodian for the building should be contacting the ddf for that school. Now, that's the deputy director of facilities. It's a school maintenance issue. I just want you to know that it's a school maintenance issue in water, fountain repairs and things like that and the custodian, if he's not able to fix it, should put in, what's known as a Po18 to the Ddf, the deputy director of facilities for that district in which that school is located or for that school, since they're losing guys left and right, they're reassigning schools all over the place. He in turn was submitted to them. That's where your follow-up should be, for that is with the department I mean with the division of school facilities. Dsf, so I can point you in that direction. That's helpful to you and you can get response from them as to the situation with your water, fountains. Okay, thank you. You're very welcome man, questions that you guys may have okay, no I'm good Al is there anything else of me. Well, hang on for a second kit has a question: yes, Steve I'm and everything you and your team are doing for your students and the community, especially over the last. However, many months since March, as you may know, one of the things that we can do is write a letter in support, so just curious. If you might be able to specify the ask a little bit more in an ideal world, you know. Let's say you could get exactly what you wanted for the school. How long would the lease be renewed? What would the priority items be? That would help us to consider how we wait go back to the lease. What are you saying about? Elise he's not asking you Steve he's referring he's asking the question to the principal just so you understand you don't need to answer this question. Yes, I can get you an email in the next couple of days for that's fine yeah, that's fine, I'm more than happy to as much as I, possibly can work with you work with the principals work with the school work, with the board to provide a response or a direction in which to go. So that's you know, I, never had a problem with that as much as my ability allows me to go and I'm more than happy to use it. So going forward, I guess Jesse will come back to you in April, okay Steve. Let me just jump in for a second. This is just between the committee p, the committee folks and the principal right at this point in time. So if you want to jump off of this, unless there's a particular question, no I have something else I have to get on to so I'm you know I'm holding off on that, because I want to make sure I'm okay with you guys before I go okay, I! Think yeah. Can you still have a question for Steve on something one question before you go Steve we sent a letter to your agency trying to summarize what we saw as the learnings coming out of the conversations that you and your team has had with us in our committee over the last several years set of suggestions about how we might be able to best operate. I was wondering if you could see that and if SCA plans on responding to it well, I got to be honest with you. Jesse I read this letter three times and it didn't seem as though I mean it seemed more like you were letting us know what you would like to see going on. You also implied in the paragraph above that these concerns were being met, as well as the new suggestions that you had made. So at the time you know, I wasn't I was kind of caught in between us was. Did they want an answer? Are they just following up our meeting, because this seemed like a follow-up letter? You know detail and everything we had spoken about, so it didn't appear to me. You know I mean if there was a request by the board for a response. I got to be honest with you, I didn't see it I took it as a follow-up for what we had done, confirming what we had talked about and since I was in the meeting and did speak about it with you. I just thought that it was things that we had already previously discussed and I. Thank you for the compliment in this letter. Thank you very much and that's just the way. I viewed it. No disrespect to the board or anything no slight intended whatsoever, so Jesse definitely cut me off and jump in here at any point just to clarify Steve. This is kit the co-chair with Allen who asked that last question. I'm sorry kid I didn't hear the name. I just thought it was the district manager yeah all good and I, don't think any of us felt disrespected or slighted. If you do have an opportunity to reply, we do frequently get responses from agencies when we send them letters and we would be able to get your reaction if your team has a chance to do that. Okay, I have the letter in front of me as a matter of fact, yeah Steve I sent it to you a couple weeks ago, reminding you of this and that this, yes, you did, and it was data from the I think your original date of publication was in March eight days before we shut down. Okay, all right so you'll take a look at it and get back, and let me answer a question. Steve would something like this get on your SCA website in terms of if people are looking at their old school or you know what's going on here, and they would they be able to go onto your site and see what construction protocols are what they need to do in terms of having some of these remarks that we put in the letter on your website, I, don't currently believe that there is such a place on the SCA website. With that kind of information. To be honest with you, that's something I will bring up with them, because everything that we do has a city-wide implication as opposed to borough. So you know in that respect, since they are a city-wide agency, but I can bring it up with the director of external affairs and I'll make that suggestion to him. Okay, all right I mean once we iron out. You know some protocol should be applicable to all the schools. Well, that generally, when I do the UFT meetings in which I do invite the community board I do invite the PTA I do invite everybody. You know we generally. We have those discussions at the individual schools for those individual projects when we're on when we're about to engage in that, and we go through our notification process, which, thanks to Jesse I, took some of his suggestions and actually expanded my letters and respect information that was in them based on his recommendations. So I have been doing that with respect to the community notifications, yeah, okay, so that was helpful right and I looked at it and said that makes sense yeah. So we appreciate it. We are working to put in any suggestions as we go. Okay, I'm a full believer. You know as much as I can get out there in a letter that won't people won't throw away right as soon as they first they read the first side of a paper. You know you got to get that all in somehow, so you got to figure out the best way to explain it and just leave them with a contact information number to get a hold of me so that they can discuss it because you know there are interests in it by a lot of people and there are groups but like everything else, it's organic. It grows. You know not everybody who's made aware of it react to it right. You know it's just so many different ways of looking at things from different parts of the city when I go into different neighborhoods and different boards. So, okay, you know it's just like I said it's something that grows with you: it's organic! It works itself on as we go and I'm more than happy to try to make it work as best. We want to try to get something formalized, but let's leave that aside to say: I, don't know I, don't yeah, I'm not quite sure, because again, okay, we'll work on it, we'll work on it together. Steve. Let me just take one more question from Josephine on with you, then you can go and we can well I have to go I, I'm already 10 minutes late for this meeting, so I want to make sure I can make this home. So please don't be more happy yeah. This is very quick. Steve I just want to know as a board. How can we help this school? Would it help if we wrote a letter asking for an extension on this lease and if so, how many years would you know like how? Typically, why would you want an extension on the job at Ps11? No we're talking about the high school that we're just talking about right. That would that's something that you could submit to your city, council, member and to your borough, president yeah, that's not good, and then it would find its way, probably to the Sa in respect to support letters. Yes, yeah, because again, that's the real estate division. That's totally separate from me got it I, don't get involved in that kind of discussion, but we have a whole division that if you wanted yeah there's never a reason. Not to have a support letter written for something that you guys believe in never a reason not to do it. Okay, can you just give me an average like how many years will the lease have to be in order for construction? I can't answer that I honestly do not have an idea. Some places have two years. One year three years, I was kind of my eyes opened up when I heard that a 10-year extension was given I thought that was great at the time. So I just don't know everything is in and of itself its own situation. Thank you. I can't tell you how long it would be or how it should be right. Okay, Steve we're going to let you go, but you know we always appreciate you coming here and we look forward to seeing you in the sometime beginning of the year on some other missions. Josephine I actually can Alan. Thank you very much for you and the board's time again. We appreciate the opportunity to present you good, have a good holiday, Steve, Happy Holidays for you and yours stay safe. Thank you! So Josephine one of the things is they did a 10-year extension, but what happens is as soon as like three years into the lease they stopped doing any work, starting. You know like they renewed it in whatever 2013 and then I stepped in 2016, and they refuse then won't do any work. So I, my ask is like at least a 20-year lease 15 to 20 years, so that I can serve that student population and it's just really stressful, because, like so many things, just don't work at the school right. Okay, thanks so much for coming, I mean I, think that's the least that this board can do. We can certainly write a letter asking for that. Well, I mean we're going to have a discussion about it, but thank you for letting us know. Yeah can I ask who the letter will be sent to like what's your audience so that we know where what information to provide you like kit was talking about it before. Okay can I make a suggestion principle. It is a complicated issue. It's got a history: okay, I think what we might want to do, instead of just popping out a letter that you know, we support your request. I think we need to get a little information from you. Some background requests that were made some hard facts, some data, and then we can put a letter together so we'll. Maybe what we'll do is we'll contact you and get a separate meeting with a couple of the committee members so that we can have a you know, a discussion strictly based on what the facts and get some information, maybe on what we can ask for maybe get some feedback from Carl Wilson on this, I'm sure their officers had experience deal dealing with these issues. So what I would suggest at this point is we propose to do a letter, but I think we should do some homework and we should do so a little bit of conversation with you and a couple of members, and you know, and moving on from there yeah I thought I threw that suggestion out to the committee. If you guys think you want to do something different, please feel free to jump in yeah. Sorry, Al can I just say two. Since we were referenced, hi principal Najmi, my name is Carl I work in Corey's Johnson's office, so we I think well over a year ago, maybe had engaged in this some and I don't think we were at a point where you know serious negotiations had happened yet, but we're happy to go back and take a look at this and revisit to get an update because it has been some time since we were last engaged on this and you know we're. Certainly we certainly wouldn't want to see the school close or the least not be renewed. So let me go back and speak with my colleagues and we can look back to the board too and we'll we can also nudge SCA on this too, to jump in quickly. I want to directly answer your question principal najmi, and then we have a couple of folks who have raised their hands: Katie, Elzora and then Chris Lebron, who is a member of community board for but not on this committee. So we'd love to give him a chance to speak as well. I think the question was, who these letters go to? What are they all about, and so my best answer? That is the main thing that we do in order to try to influence city agencies. Is we write letters to share the perspective of the community board, which is the representative of the constituents of community district four, and so in this case we might address a letter to SCA DOE, other relevant agencies and or individuals to just say you know the principal and her team came and shared Xyz with us. We suggest you know a b and c because one two three, it sounds a longer lease is one of the key. You know planks here, curious that I hear from you are there other things that we should be prioritizing if the committee, either tonight or at a future date, wants to write a letter in support of what your team wants to provide some continuity and stability in terms of your facility situation? So I want to give you a chance to answer, and then we have at least three more folks who have questions for you. Michael. You want to jump in I. Think you pretty much covered everything for those who don't know, there's a stipulation with the res away funding that you can not use capital funding on a project if it doesn't have a five year shelf life, but they started implementing that before the five years even started, counting so I think going back to 2016. We haven't been able to request through the resulay portal for certain kinds of capital projects, because the shelf life was expiring in 2023. So you can imagine a 10-year extension wouldn't really help us, because after three years we wouldn't be able to do upgrades on our building and that even includes smart boards. I mean smart boards are old now, but we're not able to replace them because they're fixed to the wall and if the building won't be there in 2023, they can't remove or install them. So it's created so many hiccups, just with even just upgrading technology, so that everything's up to date it's creating a lot of problems. We had to get ones the promethean boats that don't go on the walls that are movable as a way off. If we had to leave the building that we could guarantee through the grant. Just and that's how we got that. Okay, but any other questions Katie, you have a question yeah. Thank you. This has been a really helpful conversation. I was just wondering, I mean. Obviously the priority is to have your lease extended, but that does sound like that's, obviously a complicated and long conversation, and I'm just wondering if there's a second back way in I have no idea how realistic it is. But I was wondering if it's something that you would be interested in like are there I, don't know if there are ever any exceptions to this? You know five year shelf life rule up for resume funding because you know like if we could say like, as you said, you already had this money allocated and could you know at a minimum? Could the money be expended and here's? Why and it's really pressing, because it affects the students lives in the school right now, I just didn't know. If that's something that would be worth us also asking for on your behalf, yeah I mean you know. I would have appreciated my bleachers four years ago, when I was given the resume funding or the elevators need to be fixed right or like all of those things. If they can fund the school, but again they I don't know. If there's a bad way about getting some of these things done, you know they fixed our that we had a ventilation issue where they fixed that the SCA, but when it comes to specifically asking for an additional capital project through the res away process through any result funds, we can't use them on projects that we specifically request and we haven't there's no way around it. Okay, we can explore that. Okay, thank you nobody's talking right now. Do we have any other I think Leslie and Chris both of their hands raised Chris Committee members, First Leslie, I'm anticipating a letter right guys of some sort, kit and Allen. Is that a correct assumption? It's a good assumption. Okay, Jesse I want to ask you that we talked about this in our budget task force right whenever the high school comes up, it's hard to kind of put them in the budget because of these parameters. I just want to look a few steps down the road, so we can look at the picture a little broader. First of all, who owns the building and like can the parameters of the lease be in play here. You know what I mean as far as improvements capital improvements, so it's not all on D.O.E, like I, didn't know if that could be in play here at all, I don't know who could answer that, but I think maybe we should educate ourselves on that before we send a letter. I don't know Jesse like who? How does that go because I'm sure the primary of the lease can be modified so I? Don't think we have the answer to that question and so just to, but just to clarify what you said. The budget task force just so we're clear, high school environmental science is in our budget task in our budget priorities. You guys remain in our budget priorities. I will say right. We discovered right early a few years ago right when you guys communicated this to with us that the struggle was that we were initially advocating for the rooftop I believe the rooftop project. And then you guys, let us know about this issue, and so then we moved more to lesser projects or, let's say less money, projects or even expense projects. Things like that so you're in there for I think this year. First I don't want to use the wrong word, but some technology amount of technology, so you're still on our list for that I. In my opinion and I, don't want to I, don't want to push the committee in one way or the other, but I do think. There is probably some there's some information that we could try to get right in terms of what could be I think what you're implying lazies are asking about. Is you know what can be done now without having to worry about a lease negotiation in terms of any type of capital work, whether it be DOE, whether it be the building owner, whether it be the I mean the property owner or whoever? And then obviously, if there are things that can be done that are outside of the capital. You know pipeline like the water fountains or something along those lines. I think, in my opinion, I think you have Corey's office. Who's attempted to work on this I know for a fact that Gail Brewer's office, Matthew Washington, has is more than frustrated he's pulled out all his hair. If you haven't noticed about this one, that's a joke because he's he bits his head, but anyway he's been working hard on this and so I think getting everybody in a room together, like Alan said, is good and I think that, but that does require a letter and I think that I think a detail. Letter is exactly right and what we're asking what we're pushing for listen. We have dealt with this on our end, as everybody knows about simply trying to find office, space, okay and that's always a problem all right. It's a it is a multi-year process for the city to negotiate a lease with a private landowner. So you can imagine from the end of the site of the landowner, the property on the building owner. They have to sit there and negotiate this out for years, hoping that this works out right and not just go off and sell it and rent it to another space, and so you know I, don't think the process is the best it can be and I think that's part of it and I think we should definitely highlight that because it does, you know what might work for just negotiating office. Space for DOE is not the same thing for negotiating. You know educational space and programming space for a print for a school and so I think that's a part of the issue and I think also that you know every situation is unique and so just saying, oh, we're not going to really deal with this until we're a year out that doesn't work for a school that might listen, it work it might. We survived because we're a small little office of three people, but the school does not survive that you know like you're saying it's cyclical, so you know electeds might not always fun projects for school that they know is having difficulties, and so therefore, then the school isn't getting the funding and the school isn't getting the capital needs and the in the expenses, and that means parents might not be wanting to send their kids to the school and it becomes this really sick cycle and so I think it's to me it's and it's been years that we've been that they've been dealing with this, so I don't mean to I, usually try very hard to stay out of this out of committee business, but this has just been really frustrating to watch this happen and so all especially because it's happened to us as well with this, how long it takes to get a office space and stuff like that. So also Jesse, you don't know anything in the pipeline or anyone that this lease is not going to be renewed, I mean they're, not going to just I mean. Do we have a realistic? No I don't know any information that we don't know. I, don't know any inside information about the realities of this situation and so I. Think, though, getting Gayle's office, Cory's office, SCA and I'll be honest with you getting them to Carl's here. So he'll hear this getting them to put some pressure on SCA to just get the ball rolling and get it moving, and you know it's going to be a painful pro long, prayerful process anyway, but waiting until your year out, you know, is to me and I understand, there's money issues right now. So, but that's we're just talking about beginning the process in you know getting the ball rolling right. Okay! So do we have something on the table to start off with okay, really quick, there's two people who have raised their hands, who have not had a chance? I'm sorry, okay! What's this Al Zora and then Jesse is Chris able to speak when we're through the folks who are on the committee. Yeah I'll be able to move him over. That's why hi everyone I mean again it'll be great to call in all the advocates we possibly can right. So all of the elected officials that are attached to that building. That area, of course, will be included in this extensive letter of outreach right, but at the end of the day, we need to know who is the mayor's representative that is working along with the panel for education policy to find out. What is the expectation? What is the behavior of renewing the lease on this building? Is there some reason why they wouldn't renew that's the kind of information that we need to know that we can work with before we make a demand that we want these repairs to be go ahead and do everything that is being requested there isn't. There is no possibility that this lease won't be renewed right and that's going to come. Definitely from the Doe's office from the mayor's office, and that's just going to be the start and again we can call in city council. We can call in Gail we can call and Senate. We can call assembly members all the advocates that we need to jump on board. Everyone will be supportive. The public advocate, I'm sure they will all be supportive, that if there is no reason, why any reason why this building shouldn't be this leash shouldn't be renewed. Then we absolutely need to take action now to get them up and running, and so we just need to look at the behavior of the renewing the lease in that space and we can get that definitely from the Manhattan representative on the pet probably has access to get that information to us, but definitely other people from the DOE that we have connections with. So there's some work to be done, but it's not something that you know. It's gonna take time to push it, but immediate action to the context that we know right away so definitely a letter or two. If we want to separate out how we get advocates and then the does work, all right, I think we have Chris and then I think we're capping this. So we can move on to hopefully your emotion. So thank you very much shares. Thank you. Jesse for emphasizing Carl for being on El, Zora I think you're kind of spot on, although I'm just concerned that, if we ask them to give us a reason as to why they won't extend the lease, then they're just put their feet in the ground and will lose the emerald gem of high schools in New York City in the country, I've known principal nozbery since 1998 she was an english teacher at high school for environmental studies and in 2016, when it was announced that she was going to become President, Matthew Washington got a hold of me and I wanted to get hands on immediately. She just brings so much energy and vitality to a school that lost its leadership and luster and emotional. Please for me, because I became a man there. You know where I learned what it meant to become a man there being awoken to the issues that our world has to deal with. So I think if there is a letter it's to emphasize that this school is not an Shsat entrance school. This school serves the totality of all five boroughs. It's every creed, race and nationality and religion. In there training students to think in an academic way and an applicable way to deal with the greatest problem, we have right now in front of us, which is climate change right. So please emphasize that you know principal najmi mentioned that the school has an 80 student population that lives at the poverty level. That's incredibly important to note this is a matter of education equity. When you bring up something like that, and because the SCA has decided that it does not want to upgrade, we have to call the question how they prioritize the upgrades of those Shsat schools and their buildings. Hell's kitchen can't lose this school New York City can't lose to school and, if possible. Just please make a note in the letter that it's the high school for environmental studies, because it's not the Academy of Environmental science, it's a completely different school. It is not the first in the nation. This is that's all as to a second letter regarding getting everybody on board. As I just said, everybody knows what this school means to the city, and everyone knows how it can shape people. In fact, I'm going to embarrass principal Nazbe, real, quick I, was locker mates with her little brother, Ali and Ali's been doing incredible work with election law and the abiding campaign, as well as along with Senator Biaji, he's I mean single-handedly help change the way votes, get counted in this city and the state and the country, and it must be highlighted so principal najmi is it comes from incredible family and she has an incredible brother and thank you very much for considering two letters. It is a family issue for me and, as Chris talked so passionately about the school I started my career here in this building in 94 and then left to move on and I came back in 2016 January. So for me this is my full circle and yes, my brother went there and now my son goes there as a freshman. So for me this is more than just being the this is my life. The school has been my life, so I appreciate you taking the time to hear us out all right. We really appreciate you taking the time to present answer our questions and again all the work that your team is doing for students in Hell's kitchen across the city who travel to the school, we're going to shift gears now and I'm curious. If there is a motion, you all are welcome to stay and listen in. Does anyone want to make a motion to write a letter or two or three or ten I make a motion? Obviously, yes, I make a motion. I heard, Katie's voice first and I think we may have gotten a second before we heard exactly what Katie was proposing Katie you want to voice over. Do you just want us to cover all the things that were said? I've been taking notes? Is there a specific angle that you want one letter versus another to take? What are you proposing here? I think that was Josephine. Oh sorry, I thought that was Katie. Right Josephine am I wrong. It was I, mean I, don't know there are a couple of voices but I just we should absolutely write a letter. You know in support of this school and extending the lease I think that Alan's right we need to do another. We need to do another call and get more information. Alzora brought up some really important points too. That I don't want to get missed so I, don't know, I can't really separate what letter needs to be written. You know or how many different letters that we need so I think we need to do that first and then figure out how to move. How can we most effectively move forward because, as you say, you know, Cory's office has been involved. The brewer's office has been involved, I mean a lot of people have had their hands on this. So why is this not moving in the direction that it needs to move in, so I think we need to figure that out first. That would help okay, so doing my best to synthesize. It sounds like a follow-up meeting at which we would try to get the info and the details we need to write a letter. Is that right, Josephine, yes, I mean I'm definitely saying we making a motion to write a letter. But if you're asking me the contents of the letter that we need to work out on a separate call, Jesse does that fly. If so, we can ask for a second I think if you're broad, strokes, I think you need to have some broad strokes. I think the broad strokes would be that we are one in support of the size school being renewed police being renewed right and that it's staying here and that its capital projects be funded right, I think that's in broad, strokes, I think in broad strokes. You can say that we believe that the current way of or process for negotia negotiation, the city negotiating lease renewals with for school property. It seems to be in conflict with how and the way that a attribute you know a regular school would operate and it being able to fund its capital projects and broad strokes right I mean again, you guys can tell me if I'm wrong, you know and if that is I, think that's sufficient and the details with this particular school will find from probably talking, like everybody said here with some of the elected officials getting the right people on the phone with the mayor's office DOE and you know, and basically getting you know and getting that information, and then we that can be included into the details of the letter. I think that's sufficient. If everybody agrees with those broad strokes, yeah, yes and then Katie, I'm sorry was it. You called me first, oh fantastic, yeah, Jesse love what you just said, but definitely want to make sure that where yes, we want to put a whole lot of strength around making sure that lease is renewed. We definitely want to make sure what's highlighted most is that work begins that they get started? You know the least being renewed is the expectation, but again this it sounds like the principal is saying: we really need them to get started on these projects. You know, if there's absolute comfort, that the lease will be renewed. Then we should start that's the real push here. That's what it sounds like to me. Katie yeah, I was gonna, say something very similar. I fear that if we make this a conversation about the lease being renewed, we're gonna be pushed off. Oh yeah, don't worry, we're gonna, be thinking about it. Oh yeah, we know the importance, but we really have to say we support the lease being renewed, but in the interim work needs to be done. These things can not be held up at this high school anymore. What can we do? Who can we speak to? But we need to help encourage this work being done now. Right and that's I think the important thing the emphasis has to be on what they need now, not on the lease being done. Maybe in a couple of years, Betsy and I would actually pose questions in the letter to like to the elected officials, because I think if we say that and Katie is right, but if we say that they're just gonna say: oh there's this provision, it's a rule, we can't do it see here's the rule, so I think that we should push the envelope a little more and say. Listen. We understand this is wrong, but on the flip side, these kids can not go without elevators or bathrooms or whatever. So we have to have reasonable. You know logical, a situation there, so I think we should put push it and push that question a little more right, because isn't that rule your principle about the five, the yeah so they're, just gonna I think push that off on us right or no I don't know, and we should what I'm saying is. We should address that before. You know that we understand that but too bad. This is what we want. So, are we back to two letters or just one general all-encompassing, I, think what Jesse's suggesting is something brought spokes, something to get the conversation going and then get specific in terms of I mean we could certainly indicate things have to get done. You know you need to, but whatever couple of things, but just to be clear, I was talking about broad strokes, for you guys voting on something what you guys want to put into the letter in terms of questions. What is who we're sending it to that's a whole different thing? I'm just saying you can't just vote tonight. What I think kit was asking me was right. Everybody feels strongly about voting on something. But what are we actually when that reporting? What are you voting on? What we can fill in later from our conversations that we have, we can fill in those details to be had, everybody is going to say. Yes, we understand on this call, there's details that we don't know yet that we're going to probably add into that letter right, but broad, strokes, wise and I. Think, from my understanding, what Zora and Katie just said right is that we're, including another foundational bullet point, which is that we're all in agreeance that no matter what you know, what we're saying is the process to start negotiating that lease. So therefore that needs to happen now. You know and not wait until not right and I understanding that that's the other, that's the. Let me give recapping what I've heard a shot. I've been doing my best to listen, which my wife would probably say, is not my strong suit. Here we go so it sounds like there are at least five key points and if I'm missing anything folks should definitely chime in one is first and foremost you care a lot about the school. Staying two is work should begin. Asap three is to talk about how we wanna see improvement in the process for schools to renew their leases. Four is we support the lease renewal which we wanted to save until later, so that it doesn't end up derailing the rest of the content, and then the last piece is what Leslie was talking about in terms of this might not be separate. This might be the theme of the letter. What is reasonable for students to be able to expect and for their parents to be able to expect versus the way the current process is playing out and what folks are really experiencing, because you have to wait until way too late to be able to get a renewal in order to be able to do the sorts of upkeep that school buildings require. Let me just jump yeah. Let me just jump in on one thing: I think that the process aspect I, think that's a different conversation I, think that's a different meaning that we need to get S-c-a-d-o-e down and ask questions and find out what are the nuances about? What is this deal with this five-year thing? How do leases get renewed? Who the that's I think that's a separate issue. There's a comment in the chat regarding possibly separating out maintenance issues and capital improvement issues. I mean we want to get things done right away, in other words the fountains. So if I could jump in all of the projects on the list, are capital improvement, not maintenance, so with the water fountains, we do in fact have working water fountains, but our ask through the capital improvement portal was to have you know where you put the water bottle underneath and then it refills it, because we want to create a culture over sustainability and refilling water bottles, and that was what the ask was for and then with the elevators I believe what we were told by SCA is oh well, you have one working elevator, so that's fine, so the second one isn't a priority and obviously that's an issue. We have students who you know are on crutches have physical disabilities when the one elevator goes out, which happens multiple times a year, they're stuck on the first floor and they can't access their classes and we have to bring worked on it's terrible. All right, no I was on the impression that there were some maintenance issues also involved that weren't getting done, but if they're all capital improvements, then that's a whole different thing. All right, I'm a little bit close to the bathrooms. Actually Michael. You can correct me if I'm wrong, but I remember taking a tour last year and there are many bathrooms that are not functioning in the building, so students have to go to different floors to use the bathrooms. No that's been changed. That's gonna change! Great! Okay! Thank you! Oh Amber Stallone. Thank you. I'm a little confused how to keep this moving forward here. We are actually committee. I'll. Give you one minute: David you're next technically in a committee discussion at this point, so very much appreciate your perspectives, Chris and Michael, but hopefully we can get to a point where we're agreeing on what we want to vote on and voting on something David. You are next. My confusion is, if there's a regulation in there about the lease that they can't do capital improvement. Then of course we have to put in. We need this lease to be done asap because you can't go. You can't expect people to break the law. These laws were put in for a reason: they're not going to spend a lot of money on an elevator and then all of a sudden, the lease isn't renewed and they have to go to another building, so I mean even if it's a formality, you can't take that chance. You don't know landlord. Could then all of a sudden decide to do something. So I think we have to emphasize the least renewal and the reason why I want this lease renewed is because we can't wear our hands are tied because of the capital improvements or the capital project. Whatever the terminology is so you can't just say: okay, we want these done and then push the lease down the road. It's just not you, it's just not I, don't think it's gonna work that way. Maybe I missed something who's, not renewing the lease. We don't know that we don't know if it's going to be renewed or not renewed. I'm not saying that. No, I'm not asking that is the landlord saying you can't live here anymore. Your lease is over goodbye or is the always saying you know we don't want to do anything with this building anymore. The school has to leave and we're not gonna renew the lease. We don't know, that's why we have to push for the lease renewal because either way David we had a similar situation with I think. Is it Knowles I forget what school it was, but what I'm saying is a hypothetically. We combined two schools, so if Doa or the landlord, whoever doesn't want to renew why they're going to put capital? Why would you expect to put capital money in there? Then? We have to know that this lease is going to be renewed and work on that you have to know who's, not renewing the lease yeah. That's what I'm that's right, so we've got to find out that who's, not renewing the lease and push okay hold on a second. We have a new voice coming in Maria. Can I make a motion that we write one letter with the points that kit mentioned: yes, okay, as much as I appreciate that Maria I think Jessica was actually raising her hand and I do want to make sure we hear from everybody. Oh okay, sorry get in under the buzzer I agree actually with Maria's suggestion, but I also meant what David was saying just in case when you bulleted out your points, you said like start work immediately and I think that just has to be written in a way that acknowledges that requires this lease being resolved. That's all like Dave I agree with David. If we don't talk about it, they're gonna say sorry: our hands are tied, so they have to just be tethered and then I'm happy to Second Maria's sounds good. I just wanted to add one last thing: if I could yes, I understand exactly what they're saying, and so when I was saying about doing starting their projects immediately, it is with a lease guarantee because they're not going to renew a lease three years before the lease is due for a renewal. But if you have a lease guarantee that is established with the mayor's office and the dealey, you can start your projects. Okay, Maria. Do you want to present your emotion again, a motion, any more questions, any more conversation at this point. Okay, we're closing out the conversation Maria. Would you please I was going to make a motion to write one letter highlighting the bullet points that kit mentioned: okay and what Jessica just emphasized, okay, and also thank you short and sweet, sounds good. Thank you. Anybody opposed to that wait. There has to be a second to that motion. Yeah I'll. Second, it this is Jessica. Okay, sorry can I ask, can I add one thing: I'm not opposed to it. I don't vote but right just because we were talking about two letters and I think it is a little complicated I just want to clarify I. Think in my opinion, I think. What we're saying is, though, if we're right, this letter is going to SCA, DOE I. Think we copy electeds I think we can add language into the letter saying we will be following up with our electeds to get further information, which is what Alan and I think elzora and a couple other folks were talking about. So it's all into one letter, but we're sending it to are the power brokers, the ones that are actually going to be talk about the deciders of this process, which is you know, a city hall and basically read street. So I just want to clarify that, as you know, what we're thinking we're doing? Okay, that's accurate! Well, sorry, in my mind, I was thinking about who the letter was going to I failed to say that. But yes to what Jesse said all right, I think we got a motion in a second all in favor opposed president, not eligible extensions, all right. One. Second Judith: do you have a am I president, not eligible I, don't know if I'm present not eligible or not. No, this is not your school. Okay thank God. All right, I wouldn't consider it I, wouldn't consider it a pne issue for you, okay, cool. Moving on before we move on. Is there a volunteer to write the letter? Most fine perk of our time together, I can I nominate somebody, that's cool I would nominate Katie. Would you like to take a hand at this? I would be happy to take a crack at it as long as it's not due in the next two weeks. Well, I think that's cool I, don't know. Yeah I'd be happy to take a crack at it. As long as I can get some detailed notes from you kit, it sounds like you took the best and then maybe there's a somebody who can help you out on this. Anybody want to volunteer on this with Katie. This is Jessica. I'm happy to I can't do the heavy lifting, but I'm happy to like support edit, contribute, lovely great you'll edit and follow okay cool super cool, okay, who's. Next, delicious that we are up to New York Salt Jesse, are we able to move them over I just want a flag for everybody that we are already at eight o'clock. So hopefully we can hear a really rocking presentation to keep this moving. I just moved Alicia over I believe she's should be here with us. Alicia, oh, maybe not coming, looks like she at 7:55 said that she was up next and she's asked the student to join, but she asked us for an eta which we did not share, so she might be trying to line up the student who's going to help her out all right, I just moved over again, because I think there's two of them. Oh yes and then sorry hi, I'm here and then there's a Malik Sadebay is the student. There we go you're, both under Alicia to say Malik. Just so you know you're listed, you can rename yourself. You know if you know how to do that up in the corner of your little screen. Okay, so, while Malik's renaming himself I'll, just I'll, say hello, and thank you so much for inviting us to come and present my name's Alicia Hanson, I'm the founder and CEO of a nonprofit organization called NYC salt located on 29th and 7th and we're a visual arts program focusing on photography and video storytelling and college preparation with kids from underserved areas of the city. So we have kids coming from all five bros to meet with us and Malik is one of our students and alumni part of our fellowship program, which we started this year. A young artists fellowship helping them to launch their careers in the arts and Malik is a very accomplished photographer if any of you guys are on Instagram. I. Think you'd be quite amazed to see some of his work and if anybody remembers the cover of the New York Times magazine from June on police reform, that was Malik's story. So that's the quality of work that we do with our students. I've been a professional photographer for over 25 years, working in different facets of the media and then doing a lot of production and shooting for editorial publications in New, York City and when I came to New. York I worked with a photographer named Joe Mcnally and we launched the first all digital project for National Geographic, and so we take that social network and we work with kids in the city to help them discover careers in the creative industry to see what is available to understand the career paths, but also helping students that are from first generation families go to college and specifically major and artistic pathways. So I have a whole powerpoint presentation, I'm not sure exactly how that works, because I don't have control over it, but I think just maybe. First, it's always so much more interesting to hear our students speak than it is me and maybe Malik. You might wanna just talk for a little bit and tell these lovely people about the program and about your experience and about what salt is and how you're involved now and how you have been involved. Hey guys, my name is Malik and I'm originally from West Africa I was born in ivory coast and I grew up in guinea. I moved to the states in 2010, so it's been 10 years now and I've been part of the program since 2000 I think 14. When I was a senior in high school I found out about it from a substitute teacher who was a photo teacher from another school at the time, I had just saved up and bought my first camera and I. Actually, she knows any after school programs that I could join and improve my photography and she recommended Saul and a couple. Other programs and salt happened to be the one that was a few minutes away from my high school. So the same that I walked over and signed up and yeah. So since being part of the program when I first joined it, I didn't really know about how to use my camera. I knew I wanted to do. Photography I had an aesthetic that I wanted to do, but I didn't know how to use my camera at all, and they helped me with that. At the program, we were only supposed to be there Thursdays every week and I literally was there from Monday to Friday on to the class, and the building is closed. Asking them questions about the camera and bringing them photo examples and asking them. How could we create some of the photographs and things like that? So that's how I learned do also through the weekly classes and everything, but also one of the things when I first joined the program college wasn't really the main thing on my agenda. So ever since joining the program, they kind of helped me figure that out along the way, I remember when I first graduated the first year, I didn't go to any college, because I didn't get accepted to the school that I wanted to, and Alicia set me up with sat prep teachers that helped me retake the sat to get my grades back up and then helped me with my college application and I. Remember her even walking with me to Fip and just to be my application to talk to them about getting me into the program. So she, the program, pretty much, helped me the same way that a parent would help their kids in order to get into college all the little things from sat prep helping you build your portfolio and making sure that you have answers to every question you need, and we also did. We went around campuses that were around the East coast. We went to Boston Umass and different colleges on the East coast, just for us to kind of be exposed about campus life. All these things I didn't know prior joining the program, so that really helped me figure out my path and photography and also give me an opportunity to attend college and but yeah since joining the program. As you could tell just been going up, I guess: I, don't really know what word to use for it. It's been one thing leading to another thing: every year we do a gallery show to kind of exhibit the work that we've been creating over the years and through that we get people in the photo industry. That comes you on the show and then, through that we get higher for jobs and we've also been said to portfolio reviews and all these little things I know. I'm missing a lot of things right now, but that's like the kind of things off topic that I could really think of right now and even now, as an alumni after four years of graduating, I'm still pretty much very involved in the program. I still go to the facility, even now, during Colgate I go into the studio since there's no one. There and I'll go sit there and edit my work using the computers and sometimes even prep my work and I'm always calling Alicia to phone on the phone and asking her to help me with certain things. Now. Even now still so, the program has pretty much been part of my life since I joined it back in 2014 and I've been there every single way from the little assignments I used to get to photograph birthday parties to getting my first assignment and doing the New York Time cover and then photographing a lot of Simon for Time Magazine and I'm currently sponsored by Nikon. So I've been working closely with Nikon all those relationships wouldn't have happened if it wasn't for the program and for the people that they've introduced me to and the things that they taught me so yeah. Thank you. Malik. It's great to hear a bit about your story totally agree with Alicia that moving directly from a student and a participant is the best sorry one last thing, I'm forgetting Alicia I. Remember because I'm when I first moved here, I think I came here as an immigrant and I didn't have a passport and Alicia introduced me to one of the board. Members in the program and I started my passport application last year and today he finally got mailed to me. So that's actually, why yeah pick this up. So all these amazing things from you know the art and photography and also education and life. Lessons as well and even I. Remember at some point: Alicia was helping me figure out like a housing situation for my family, so you like pretty much the program's been involved in every aspect of my life. If you had to talk about it but yeah, so these are just some of the few amazing things that salt has been helping me with, and if you hear the stories of all the other students and friends that I've made from the program, I'm pretty sure you'll be surprised. Awesome, Congrats, Malik, Alicia I want to be respectful of the fact that you did prepare a deck for us Jesse. Are we able to pull that up? Is it helpful to still talk to her quickly or would you prefer to take questions from the committee at this point? Alicia yeah I mean so the with the deck I also sent a pdf. So you are welcome to if you haven't already share it with the committee. It gives a lot of it. It's essentially our deck that we use for most presentations, but it gives a lot of information about the organization and the nice part about it is it's got lots of great pictures if you want to just go through it, while people answer questions just to see the photos, I won't be redundant in repeating the information, but it's kind of I know time is precious, so I don't want to overstep in taking up too much of your time tonight. So I'm happy to go either way. It's your choice. Okay, are there any questions for Alicia and maybe Jesse you could click through while we're seeing if there are questions and or answering questions, this pdf is in the dropbox for folks to access. It is now and after the meeting, but any questions either for Alicia or Malik. It looks like David Warren got there first. This is a great program. Thank you, Alicia, just quick question. You know I work for the photo unit for the New York City, Fire Department and we're always looking for interns. Obviously it's going to happen in cove with vaccine, but do you especially college students? Do you help arrange that I know it has to go through if, especially if they're getting paid has to go through kosher or one of the city, agencies or general services? But do you ever work with city agencies because I'd love to get a you know intern photographer? We would love to we haven't, but we provide interns with our college students all the time. The one unique well actually there's several unique things about our program. One is that we believe in long-term relationships with all of our students, so we're not like a 10-week cool photography, class, we're very holistic and we serve kids from anywhere between two and four years in high school. So it's a really big commitment for a student to be a part of our program. We work with students for probably over 400 hours a year in high school and then in college. We provide mentorship for persistence and then mentorship for just career path decisions, and then we matched kids with interns. And then we have a launch fellowship program for our kids that are coming out of college and trying to launch in to the creative industry. Okay, I mean I'll, probably contact you offline and other times. I, don't want to waste people's time. With this now but and I have made my coworker who's, a senior call you about. That sounds great. Thank you got Sarah and then Alan. Thank you so much for being here tonight, Alicia I wanted to know a little bit more about the exhibit that you guys I, think just closed out. That was at the park on 22nd and 10th I think it was the to each their own project. How did that come about, and are you guys planning on doing any more of those initiatives in the future and if so, I would love for them to be in CB4, but it was just curious of how that came about. Did you put? Did you partner with the parks department? How did how and how was the reaction? I mean, I went down there and walked with some friends, and it was absolutely breathtaking and I appreciated art being displayed in this season that we've all been in. It was a joy to take in some beautiful colors around the park. So thank you yeah. No. Thank you, I'm so glad that you enjoyed the exhibit. We do an exhibit every year at the end of the school year. We do usually do a big exhibit in a big gallery. Space in June this year. Didn't work that way for obvious reasons, and so we kind of spent most of the summer figuring out like what would an outdoor exhibit look like and one of our volunteers found. The park found a proposal process with the New York City Parks Department, which is quite extensive. It's free, but it you know, you can't just be anybody you have to have. You have to be an organization you have to have insurance, and so we spent several months working through their system to fill out the proposal, and we were looking for a location that was close to where we are because we consider this. Our neighborhood we've been in this neighborhood for 13 years and then the exhibit kind of changed directions pretty quickly in March when Covid-19 hit and everybody was quarantined and all the regular projects the kids were working on since the fall moved towards what they could photograph being quarantined, and so our teachers, Scott Dodie and Adam Chinetz and Lauren Wells came up with the idea of launching a book, which is what that project is in the park. It's actually a book that we've published, which a lot of the work is on our website and it's a project of how the students interpreted the quarantine and in some of the protests and the black lives matter movement. A lot of our students are young, so their parents weren't letting them out of the house in June when all that kind of came about. So there wasn't as much there as there was with just covering Covid-19 and their experience in Covid-19, and so that's what that exhibit is about, and then we would love to do more projects. Thankfully, we had Dougal as a partner and they printed everything for free. It's it costs about. Five thousand dollars to do a show like that to wrap around a park, and so that made it possible for us to put it up, but we got a great response the day that we went out to put it up, so many people stopped and were curious. I assume a lot of people from the neighborhood but I think probably a lot of people that were just walking by and were curious about what it was. So we hope to do it again. Part of it will be about cost because we're a very small program and this year has been hard, but it's a great location, and you know we've even thought. Maybe we could do our end of year show in June in the park again, because the students are all working on stories now that will extend through the year and it's just so nice for them to be celebrated. That way for the kids in the public school system to be celebrated that way so yeah alan I think you're up hi Alicia, it's Alan! How are you good, as far as exhibit goes being that I live across the street from your exhibit? It was a pleasure to wake up in the morning, go to sleep looking at it at night, and a lot of the folks that I bumped into being around the park really impacted them quite a bit. So you really made a profound impact on a lot of folks with that exhibit, but speaking of funding, which is always I, guess an issue, could you speak a bit a little bit on that and what you know, what help? Maybe you might need and where, who? What did you want to speak on? That role? Of course, do I talk money, we're always in need of funding. Some of our funding has been cut this year because of the pandemic and I. Think it's been well I mean I. Imagine it has been for everybody a different year, one of our foundations, that funds, our entire college prep program just decided to change their funding priorities and so we'll be looking to replace fifty thousand dollars to pay for our college guidance counselor this next year, which that was a surprise to me. So that's a big need right now, but other than that we have we've partnered with the professional photographers and specifically the photo agency of Bernstein and Julie, and their artists have donated prints for us to sell this holiday season. So we have a big print sale going on right now, and this is the third print sale that we've done this year from donated work. Professionals and they've been great they've, been a way for people to give a donation and get something back so I mean if you guys have funding ideas. Where else we could look to write grants or raise money, I'm always all ears, especially now, but if you just like art I think actually Buzzfeed is going to come out with a story about our print sales and just this print cell culture. That's going on I, don't know if any of you have noticed, but now's a great time to buy art, because so many artists are starving and looking for a way to sell their work and so there's actually quite a bit of art. Sales going on and Buzzfeed is coming out with the story on the 14th that will be included in so it looks like we've got two more questions, one from Judith and then one just got dropped into the chat that I'll read from Maria I. Believe we recently had someone speak to the Ninth Avenue Festival, being an arts festival related. Perhaps the student from New York City salt can do something too so I guess the question is the Ninth Avenue Festival on your radar and might that be an interesting opportunity for Oregon your students and then we'll? Let Judith have the last word in terms of questions after you answer that one. Unless Jesse did you want to jump in yeah I'll, just say, I think the ninth Avenue proposal is still in its very kind of beginning phases, and so it's not really even been submitted officially to the city. So but I think what we'll do is I'll connect, Alicia to the Ninth, Avenue, Association, folks and so I think that's a fine. It's a great future partnership, possibly perfect, all right, Judith your show and then we're closing this one out. Okay, thank you very much Alicia for your presentation. It was wonderful, my husband's a photographer and it was absolutely amazing to see how photography can inspire students. I would like to invite you to our ACES meeting next month, because next month we're going to have a presentation from a group named Shoshoma I. Think Jesse's confirmed the presentation is some: it's an agency, that's working all throughout New, York City to take over the empty spaces and when you said five thousand dollars for that park, that's really shocking because they don't charge anything. Oh no, it wasn't five thousand dollars for the park. It was five thousand dollars in printing costs. So if we were to pay for what dugout did the cost of printing, all those banners is five thousand dollars. So, yes, it was totally free from understanding. Thank you very much. If you'd like to come back for next ACES meeting for next month, we're going to be talking about Shashoma, if you know about them already, I, don't know but they're taking over more buildings in New, York City and it's a great place to show art and photography. Thank you for your presentation, yeah. Thank you Alan. You want to close out this item, or would you like me to say our thanks? Sarah thanks and it's always a pleasure look for. We look forward to seeing more your students work in our district and hopefully throughout the city also, but especially in our district Jesse can I just go back to what Alan is saying Alicia just so you understand, we have a statement of district needs every year and we have a number of budget requests, so I think what Alan is referring to also is. If you are applying for the for funding through the city at any time you know going forward. You can always come back to the committee and at ask or advocate to for us to support that budget that particular budget request, whether it be through department. You know consumer I mean not consumer affairs, cultural affairs or even you know another in parks or something along those lines like just so. You know that's our role in a funding component we can advocate for it. We can put it on our budget requests priority list, and so, but it has to be something that you're submitting funding for asking funding through the city. For so that's just wanted to clarify that, okay, so the Department of Cultural affairs, we get funding from right so like, for example, let's say next year with the budget cycle next year, you're applying for a particular program or expanding your program or to hire additional staff or of some sort and you're doing that through the funding request to DCA, you should definitely circle back with us in October and even earlier, if you know that and you wanna- and you would like this board to for this committee- not say the board, but this committee to advocate for that potentially advocate for that request. So because we would be sending our documents to the city saying you know solve NYC. We support that particular question from swapper NYC, which okay thank you I appreciate that I definitely will great all right. Thank you very much. Thank you. Alicia. Thank you. Moving on kit. You want to follow up on the next one. Please yeah, absolutely I'll kick us off and then Josephine can take over. So a lot of work has gone on behind the scenes, with Josephine leading the charge to figure out if we can get a Learning Bridges site in Midtown, West folks likely remember the letter that was ratified through exec and then voted on at full board. Hopefully we can get a site, but a couple things that I would encourage people to think about. As many people likely know. The city has said that as much as possible, elementary schools will phase in to being five days a week, there's going to be facilities and talent challenges at many sites with that, but one of the implications is these sites will be more so for middle school students than they historically have been, which is also an opportunity, probably not tonight- and maybe not even next meeting, maybe two or three meetings from now for us to. If we get a site, maybe invite folks who are working there, students who are attending their parents who are sending their kids there to share with us what their experience has been because one thing to flag for this group is sites like Learning Bridges are being operated in cities around the country, and many school systems are being a bit more expansive in their thinking about what these sites can be. So far. These have really been a supervision in New York City, whereas there are districts who are thinking about. How do we recruit folks from the community and then put them on a pathway to certification becoming a teacher? How do we, you know, try out a new and better ELA curriculum? How do we integrate culturally responsive teaching practices that we want to scale up next year for the full school year? So there's a lot of potential opportunity for thinking differently about what school will be like when kids do get to go back to it. Hopefully next school year that has not yet been tapped into, but that's I'll get off my soapbox and pass it over to Josephine. I. Definitely agree with that. There's so much opportunity right now to change. Make change for the good. Quite honestly, you know to use: what's happened to really make some significant changes, but we don't really see any of that happening right now. The good News is that the Department of Youth and I'm forgetting I, can think visualize the acronym, but I'm sorry, I'm blanking on the name, but they have looked at Hartley House. They have done a tour of it, so we are waiting to hear back. Carl might be able to speak more to it on that, but I did to I did receive an email from Andrew Miller today. So hopefully we will hear back on Hartley House within the next couple of days, and that would be a great help to ps51. It would also be great help to some of the shelters that are close by with students still having internet issues and some of the middle school kids. As kit was saying, and especially in the shelters, they could walk to this Hartley house on their own and have a space to work, which is you know, it's been very difficult for these kids to work in their rooms with multiple, siblings and family members. The remote learning has been almost impossible to do so. I'm really hoping that this goes through and we should hear back in the next couple of days. So that's good News Carl did you have anything else that you wanted to add? You I think you covered just about what the update is. I just want to. You know, give a special shout out to you and your leadership on this and help with us. After you sent us the Fri, we were able to send that out and that's how you know. We heard that Hartley House was being considered because we think that would be a great spot for it. So you know thank you for your, and this committee's help on this issue, but- and I've last I heard- is that the conversations are good are positive, so I hope we'll have a you know more to report on shortly. Great thanks. Carl can I just say that you guys wrote a letter asking for there to be exploration into a space on the up, West side of men. You know Midtown west and then the extension of the deadline, and you got both things rare Jesse, but at least we got something right. It feels so good when something happens. There's a movement on both I think that was a pretty successful day. On that letter yeah do. Are we I, I'm not sure where on the agendas this happened? But do we have time for public comments, because I think some parents had wanted to I, don't even know if they're still on the call? At this point, I'm not sure if how public sessions work during our committee, yeah Jesse, one I, think if members of the public are in attendance and they submit a question or they raise their hand, we can acknowledge them. If there's someone who wants to speak on this item and there's no one on the committee who has a question or a comment, they want to share first, we can certainly do that. Josephine right. We only have one person in the attendees section, it's Elko, Samuel, Smith I, don't know if they did I believe out. There did put in a couple different statements into the Q&A previously so, but if you're talking about in General Josephine, just in general, public I would say, if they're not specific, about a specific agenda item on that's listed and it's more about a new item or a different topic, then that always comes up at the end under new and old business. Thank you. Unlike the full board, which is the public session, is that the first thing you I see got it I have a comment: I want to give Josephine props. That's my comment. Thank you. Leslie well done: okay, I, go the props to Josephine and I. Think if there aren't other questions, we can close this one out and move on to updates from subgroups. That was the next item. Right Blake. You want to take us through what street life is up to or has done or is thinking of, doing yeah for sure, so I'm losing track of what I said last meeting, but you know in general street life I had a subcommittee chat and started a google doc just to compile everyone's ideas of some of the issues that we could work on related to street life. And anybody is, you know, more than welcome to you know, add in other items that we could take a look at, or especially, if you know it's an area that you wanted to look into further, and you know I think one approach to it and definitely not the only approach is trying to find some data within the community. You know in the newsrack example, you know just looking around the community for the news racks or you know, and then looking at some of the regulations that are available online in order to bring a perspective into a conversation with the relevant city agency at an ACES meeting, and so you know, I think Judith brought up another imported street life issue. The issue of derelict bikes, which you know I, know Judith, has been working a lot on and is problematic with all these bikes chained to public property, which is an area that DSNY looks after, and if the bike is not in usable condition, it's considered derelict and vsny is able to remove it. So the process there is, you know, I think a similar one where we could take a look around the neighborhood. You know look at the regulations that are currently available from Bsny, compile 311 reports, and you know just document the issue and then bring that a conversation with DSNY at one of our future ACES meetings. You know whether that's improvements that need to be made in terms of regulations. You know more outreach that should be done into the community about how to report derelict bikes. You know and or improvements in just actually following up on the 311 complaints, or you know, maybe even proactive enforcement of some of the most problematic areas for derelict bikes. So you know dude I, don't know if there any other thoughts you had on this one. You know, but I think a good next step might be, for everyone to you know, make these 311 reports and have us you know bring in DSNY at one of the future meetings, and you know we all have a point of view on it. Well, Blake thank you for bringing that to the community board's attention. I from my observation. We need a lot more bike racks. You know, I think there is a big problem with the derelict bikes, but I don't know about you, but I see lots of bikes chained to tree pits expensive tree guards. Bike pits. You know buildings, scaffolding and I think they would be chained to the bike rack if they were there, but I see them change to street poles. You know: that's not good, for that's, not good for the buildings, so I don't know is that you we would go to the department of transportation to put that initiative in there or. How actually would that happen. Carl's got the answer on this one. So department of transportation does have a request function on their website to request bike racks at certain places. I it's usually best to go through a I, think a community entity of some kind, whether it's you know a block association or you know something like that, and you know once that request is put in the DOT- will come out and review that spot to determine if it's a permanent one they have to. You know determine if it's an acceptable place. You know Et cetera, they have a process that they go through and then they'll make a determination on it. So if there are areas that the board- or you know, a community group are interested in pursuing additional bike racks, I'm sure you know that's something we could have DOT take a look at because we've done that in the past. I would also you know, might want to check in with your friends at the transportation committee about that as well, but that is definitely a function that we can help facilitate with DOT. What's that blank, I'm sorry, I didn't hear what have been the characteristics of successful bike. Rack requests, you know, I can't do it in great detail to be honest with you, but you know I think it has to do with you know, distance to other street furniture or whatever the infrastructure is underneath the sidewalk, where things want to go. Yeah I could get more information on that I. Don't know it to the letter. Maybe Jesse might know. Actually he knows a lot of things. I would I don't know. Are you do you know any specifics other than the ones that I mentioned about those places? Oh, you know who's gonna know. The answer to that question is okay, so yeah I think rather than get into the too many details here about it. I do think there are things that we know are going to overlap with transportation planning in general in terms of just the topic, but also maybe previous policies that a committee is and therefore, and the board has put out I- think it'd be good to circle back with them and come up with a strategy going forward because I don't want us to get going in one direction and then having to be turned around in a point and so I do think. We should talk to the co-chairs and see find a way of how we do it in a productive way, but do it in a way that's going to get the most bike racks for our request and we're happy to help in whatever capacity, because oh cool, any other suggestions for our Street Light Committee Leslie. Did you have something you want? No, you don't want to say anything. Okay, no sorry I was talking. Ah, okay, Jesse yeah I would like to ask to see if- and this doesn't have to go up to the subgroup, but just maybe to the committee in general. There's a woman I know Carl. You probably know her who organizes all of the clean does organizes a number of the cleanups and she has a newsletter and Katie and she yeah Katie haven't she right. Everybody seems to know it in Hell's, kitchen, yeah, right, now's, kitchen and she's being pretty creative with the way she's doing stuff and getting things out there about how to you know, keep the sidewalks clean and all of that and I thought. Maybe it would be helpful to her also to have give her a platform to present and discuss what she's doing, maybe at next committee, and also maybe some collaborations with other organizations that we know of you know. So that was my only suggestion to street life yeah. It would be possible to invite both Katie and DSNY to our next meeting. Just because I think that would be a you know, really productive dialogue, and then we can also bring up the bike issue at the same time. Yes, I will do so yeah and that'd be great yeah and you know maybe we can. The street life group can help to. You know work on some free questions that we can send over that'd. Be great. Anybody has questions that you want to ask DSNY, I'm happy to compile the bike issue. You know years ago, I don't know if maybe things have been updated, usually I mean I know I had a there was an illegal, an abandoned bike, parked right where I was doing yoga on 22nd street. It took me this is where I was on the community, but like 15 years ago it took me months to get rid of that bike. I called the community board. They filled that just it was pretty computer range, they had the carbon paper or they would you know, and then they would send it to DOT I, don't know how things have changed. So, usually the complaints you, if you go through the community board, that's how it usually happens and then the sanitation would have to tag it for a while and if no one claims it it's time consuming and as far as DOT and Jesse mentioned, this too DOT does have a program where you can order bike racks, but you know I think the landlord has to agree and if the landlord doesn't agree and space isn't right, they won't do it either, but it is a program I. Don't they haven't done in a while? It's actually slowed down a lot. There's been a controversy. It's a process, any other comments on the street. Life Committee just want to quickly give Blake a shout out for the approach. He's taken, really appreciate that there's a opportunity for folks to collaborate, give input and to bubble things up to the committee. It's very much what I think Alan and I were hoping to see when we set up this whole subgroup deal schtick thing so I want to say great work, Blake! Thank you, arts and culture. Anything on your end, I think you have an update on our yeah hi guys. Can you hear me brief update? Can you hear me yeah brief, update, David yeah sure so, just in terms of the open culture letter, which frankly, is something that I've been focused on for the last couple of weeks and haven't really been able to talk with these, the arts sub group? To the extent about you know some, you know, town hall, that we haven't made much progress on that. Yet just and I can talk about that later. I did want to give an update that there, the city has just kind of pulled the carpet out from under us in terms of the legislation that we thought was going to pass or be up put up for a vote on which is now going to be Thursday morning and basically they, the Mayor De Blasio's agency. He they do not want to have any other groups other than the cigs or people who are receiving current funding from DCA to be able to be apply for a permit for to perform on the streets or to rehearse or to do whatever and from the League of independent theaters point of view that you know kind of ixnays, hundreds of small neighborhood organizations that are not city funded but know their neighborhoods and feel like they're, really a part of what the whole legislation was supposed to support. Sarah and I are invited to we're going to meet with Jimmy Van Bramber shortly so I don't know if I'll be able to stay until the end of the meeting, but we're just going to hear what Jimmy and his legislative liaison wants to you know. Let us know what how the legislation is shaping up. Apparently it's been negotiated heavily all day, long and I just found out about it earlier this evening. So I wanted to. Let you guys know that was going on we're talking with kit and Allen. We didn't know if we were going to rescind our letter revise our letter at this point, with the vote being scheduled for Thursday morning. I, don't quite know, I, don't think our letter would get out in any event anyhow so, but it could be the substance of a future letter about how this bit of legislation is going forward and how what we think is right with it. What we think is wrong with it perhaps, but, and that is something we could share with the subgroup. You know when we have more time to deal with what we want to say in the future letter Sarah wait. Sarah did you want to add anything to that? No I think that sums it up very well and we are going to jump off here in a few minutes to get on that call, and so just hoping for a good conversation and to hear him out and see what he has to say. I did want to mention to Alan. Thank you for looping me in I am going to be working with the Social Justice Working Group, as well on some arts and cultures. Initiatives as it applies to some diverse theater groups and different cultural organizations in our neighborhood that we can kind of spotlight highlight get to know things like that, so excited to be working on that great, that's great I'll, just say: David and Sarah, based off of your conversation with the council, member and their staff, I mean it's completely appropriate to have you know, information subsequent to a full board vote. Obviously, if you feel like the information is given to you that just it really goes against what the committee and the board voted on. Obviously that's one thing, but I think if the heart of the part of the content that was voted on by the committee and the board is remains the same, but additional information needs to be added to create and explain the nuance of it. That's completely sufficient. So you know I just want to say that so don't feel like you have to scuttle. We've done that in the past, with land use letters where information, something changes on the way out, and we have to then write that into the letter to explain it, but at the end of the day, if we're still supportive of this concept- and we want it- maybe we need to say that we want it more expanded now that we know that it's limited to those groups that then that's something else you know, but that we that's doable as that's good, to know thanks Jesse. Thank you, Josephine, anything on Education Leslie, anything on education. You guys wanna anything in the pipeline. You want to discuss or we're pretty much good, we're good, you're, good, okay! Judith has your hand up. Yes, dear I'm sorry Josephine I wanted to know. If you could answer the gentleman Steve who spoke about the work that was being done at ps33, he said some buildings. Some rooms were getting renovated. Is that the cafeteria that we were talking about that long time ago? I didn't want to interrupt his presentation, but I was going to ask you I just wanted to ask what rooms are getting redone at 33 right, I can find out, for you I, don't think it's the cafeteria, though he said two rooms were getting redone, then I'm sorry, Judith I, don't know the answer, but I don't think he was I. Don't think he was talking about the cafeteria there yeah my notes could be wrong. Judith, but I wrote down its exterior work. Yeah. There was something about some rooms, but there yeah all right I did want to address something in the chat from Erica Smith. Regarding what's been going on in the shelters in and around the city. That's something that another committee has been working on: Elka for quite a while housing, HHS committee and the board, with a number of letters going out something that Carl Wilson, the speaker's office and a number of the electors have been working on, and it will probably come up at one of the other committees which are involved with this. So I don't know if you want to check our website for the HHS next Hss meeting, you might want to speak or raise the question and then that they've been having more involvement with that than we have. But it's something that's has been worked on for quite a while and hopefully they're getting some resolution to it, but it's as they say in the trade it's complicated, but hopefully the folks on these streets really do need some relief and we're trying to work on that. Alan can I just plug some. This is Maria hi Maria, yeah hi can I just plug the coat and sock drive. That's happening this coming weekend. We're collecting coats and socks this coming weekend at Metro, Baptist, Church and collecting also on Saturday, and then we're doing the distribution of the coats and socks on Sunday like new or new. Maybe even gently used coats, please new socks or like new socks, not like this, but I have sex I've never used it is you can have a gently used coat. You can not yes to Jesse what Jesse is saying yeah, so I'm just plugging that. If so, you folks can donate some coats and new socks. Please! Thank you. Okay, Maria are we do we need volunteers? Still? Yes, maybe one or two I was going to mention that next I, just don't want everybody trying to join at once and say I want to do it. I want to do it so yeah. If we could have maybe one or two more volunteers, I've got Leslie. I've got Sarah, who else do I have from here? I, don't remember who else, but oh I've got Eric I, I'm losing his last name right now, Eric fought you. Thank you, Patrick Carl that don't tell him about that. Yeah we'll have a moment somewhere. Sabrina would help but Sabrina's not able because she's finishing up her master's degree anyway. So I want to give somebody a chance. I know: Brian you still there, no okay, all right, yeah, okay, all right still, here, okay I know, you've been very patient. You had some things in the chat and I know you're. You know an advocate for you for your area. I just wanted to give you a couple of minutes. If you wanted to, you know, mention anything that you wanted us to think about, or you know anything you want to bring out or just to make that brief. Oh I appreciate that Ellen thanks so much boy. This meeting has gone on so long and it's been interesting, but I'm sure everybody's anxious to wrap it up. So I don't want to take up everybody's time. I had you know my hands up in the chat was it was something for Steve, but he clearly needed to run and I wasn't going to press it now. I could just send up a follow-up email to you, okay, on the sa, but just to headline it. My sensor said Steve was reacting to the ACES portion of the letter, which was largely a reiteration of things that have been discussed with the ACES committee and was very intentionally not responding to the ccba letter which I drafted on behalf of the ccba, because that didn't quote unquote come from the board, which is where there were a lot of issues raised. Like the question you asked about putting stuff on a website which the SCA did with Washington Irving High school at one point, so we know it's possible even if it's not something I like to do on a regular basis, so I'll send you a note about that, but that was the gist of it. Okay, thank you, Brian. Thank you, this being the last meeting of the year kid any words you want to anything to wrap up our last meeting and, if we're looking to me for words of wisdom, we are in deep trouble. Okay, that's good elected and very good I do want to give a shout out to Jesse for all his hard work, I know Janine and Nelly and sorry that Katya, who also did a lot of work for us during the course of the year as an intern or a paid intern I, don't know exactly what her position was, but she was a real help. I know in other ways, but thank you very much Jesse for everything that you do here in this committee and all the committees and all the other things that you do, that we don't even know about. So. Thank you very much and thank you guys. All of you really thank you and wish you all a great holiday, and you know looking forward to some good things next year and any ideas, any things you need. You know what you want, maybe get started, somehow send them off to kit myself and Jesse and we'll try to kind of feed that into the system, somehow we're through before nine o'clock. I guess, that's it happy new year and Happy holidays, everyone, okay, happy holidays, bye, guys! Thank you, everybody! Thank you.",
            "summary": "Oh well, Now it looks like I think I have Steve hold on one second, unless you guys do want to do.\nThank you good evening, panelists and attendees, and welcome to the December regularly scheduled meeting of the arts, culture, education and Street Life Committee.\nYou can put that in the chat, If you're, calling in on phone star six to unmute Star nine to let us know that you want to ask a question: oh I am unmuted Alan.\nWe also had some small work over at 834, which was the high school of environmental science that we had concluded a little while back upcoming projects that we will have in your district currently on board.\nDo there, As far as the updates on the villains, In my understanding with Jesse, he had just wanted some updates on the buildings that we're working on currently and where we stand.\nWe have to secure 10 properties for license agreements, we're going to kind of follow an example of that, whatever elevation that we can get West East North south, If we can get the properties along, anyone at elevation will start to work on that elevation right, now, We're kind of zeroing in on looking at 9th Avenue to get the work done there and.\nCompletion of November of this year, but I'd like the board to be informed, and you should be aware that we currently have a new bulletin and for work on the main roof that will we discovered that it needs work.\nWe are still adhering to the stop loud noise at 10:30, p.m, though, of course, There are different opinions from neighbors who call us, but Jesse I want you to know as well as Al and the committee that we are answering every complaint, either through email or phone calls, and we are working in conjunction with the councilman's office and with the Community Board district manager.\nWe have the stone work above and below the windows to do, and we have an accessibility project where we're going to put an ADA bathroom and a lift system in by the main entrance of the school building, so that we can have accessibility for people who are disabled.\nThis job, We expect to be done, we're looking at November of 2021 with the new estimate due to the Covid-19 situation, where we were shut down for about five months at that work, site also, and that's where we are with M111,834.\nI saw that school was included as a subject, conversation for your board, I mean for your community, so the work we had done.\nWe, probably lost a year in terms of work, so we're looking at an original new date of finishing the work by April of 2022, and that's where we stand right now with the projects.\nSorry I just wanted to highlight that I brought over principle from the high school of environmental science.\nIt can be a mentor job that we do also, but again depends upon what kind of work is being done if there are, If there's a question of camera installation in Ps11, I'm more than happy to look it up.\nIs in there for design for m33, which, by the way I neglected to, let you know is that we're actually doing two room: conversions in the building for the school, we're almost completed for the first floor, conversion.\nHowever, If teachers are going into the school to conduct remote teaching or if there's any kind of student activity such as I, don't know clinics, sometimes from this building have clinics for the community, We are not allowed to work during the day we keep our evening.\nThere is a blue DOT or a red DOT on the Covid-19 map for the DOE and or the situation room reports, a Covid-19 case that calls for such a closing of a classroom or the building, We do not go on to the work site until the school classroom or the building is cleared.\nSo, that's the policy just so you know that if the building has that code on and I'm sure you guys look at the Covid-19 Daily map once in a while.\nThen we come in the next day after the school's been reopened, so just to put that as another piece of information that you'll understand the work practices that were that part of what we're undergoing with the Covid-19 pandemic surrounding us.\nOh Michael, Allen, Brian Matlin has some follow-up questions, so I'm just gonna bring him over to speak because I think okay, more help is more effective.\nSo, unfortunately, It gets backed on to the end, and that brings us to November, but we currently have a work assignment request going through regarding the main roof of the building.\nThis is about Ps 11, and so since the work is not going to be cleated completed until 2022, is there any way that the school can have at least some use of their yard.\nI'll, Let, Umberto or Steve answer whoever's appropriate when you were talking about working during the day if there are no classes in session and no teachers in the school, What I'm just trying to understand.\nOkay, So we're not looking at a situation where we might have people working from 8 a.m, to midnight, for example, no, definitely not for the possible future, but you never know.\nYou be able to stay on because I think the high school for environmental science has a brief presentation on what's what their process.\nYou know looking at the programs looking at what can be done if you'd rather send me an email which should be better for me, because then I can get it to the right people to have the conversation with and get you more appropriate answers.\nThe silent film era, it was converted to offices and then eventually, high school, for environmental studies moved in there in 1994, They had an initial lease and then guaranteed a 10-year extension, which now expires in 2023.\nSo I, don't if the people who own the lease where to take it back I, don't know what they would use it for, but it would put our programming at risk and all the pictures that principal Nashville showed you all.\nThe main ask is, Basically you want to know whether you're getting a lease extension or not.\nThat's, what you're listening for and whether or not one is in the works, because that, obviously that drives the bus for all the capital projects and res away projects being done in your building since, with less than five years to go, It seems that there again there's a hesitancy to want to make this kind of investment into the building.\nI might get the same response that right now, It's not a high priority that there may be other leases that are actually up within a year that they're negotiating now.\nI just want you to know that it's a school maintenance issue in water, fountain repairs and things like that and the custodian, If he's not able to fix, it, should put in, what's known as a Po18 to the Ddf, the deputy director of facilities for that district in which that school is located or for that school, since they're losing guys left and right, they're reassigning schools all over the place.\nHowever, many months since March, as you may know, One of the things that we can do is write a letter in support, so just curious.\nWould something like this get on your SCA website in terms of if people are looking at their old school or you know, what's going on here, and they would they be able to go onto your site and see what construction protocols are what they need to do in terms of having some of these remarks that we put in the letter on your website.\nYou know as much as I can get out there in a letter that won't people won't throw away right as soon as they first.\nYou got to figure out the best way to explain it and just leave them with a contact information number to get a hold of me so that they can discuss it because you know there are interests in it by a lot of people and there are groups.\nYou know it's just so many different ways of looking at things from different parts of the city.\nSteve, Happy Holidays for you and yours stay safe, So Josephine, one of the things is they did a 10-year extension, but what happens is as soon as like three years into the lease they stopped doing any work, starting.\nWell, I mean we're going to have a discussion about it, but thank you for letting us know.\nOkay, I think what we might want to do, Instead of just popping out a letter that you know, We support your request.\nWhat we'll do is we'll contact you and get a separate meeting with a couple of the committee members so that we can have a you know, a discussion strictly based on what the facts and get some information, maybe on what we can ask for maybe get some feedback from Carl Wilson on this.\nHere, curious that I hear from you are there other things that we should be prioritizing if the committee, either tonight or at a future, date, wants to write a letter in support of what your team wants to provide some continuity and stability in terms of your facility.\nWe haven't been able to request through the resulay portal for certain kinds of capital projects, because the shelf life was expiring in 2023, I mean smart boards are old now, but we're not able to replace them because they're fixed to the wall and if the building won't be there in 2023, they can't remove or install them.\nI would have appreciated my bleachers four years ago, when I was given the resume funding or the elevators need to be fixed right or like all of those things.\nIf, there's a bad way about getting some of these things done, You know they fixed our that we had a ventilation issue where they fixed that the SCA, but when it comes to specifically asking for an additional capital project through the res away process through any result funds, we can't use them on projects that we specifically request and.\nIf that could be in play here at all, I, don't know who could answer that, but I think maybe we should educate ourselves on that before we send a letter.\nYou know what can be done now without having to worry about a lease negotiation in terms of any type of capital work, whether it be DOE, whether it be the building owner, whether it be the I mean the property owner or whoever.\nTogether, like Alan said, is good and I think that, but that does require a letter.\nThey have to sit there and negotiate this out for years, hoping that this works out right and not just go off and sell it and rent it to another space, and so you know I, don't think the process is the best it can be.\nAnd I think we should definitely highlight that because it does, you know what might work for just negotiating office.\nThink also that you know every situation is unique and so just saying, oh, we're not going to really deal with this until we're a year.\nThe funding and the school isn't getting the capital needs and the in the expenses, and that means parents might not be wanting to send their kids to the school.\nThat area, of course, will be included in this extensive letter of outreach right, but at the end of the day, we need to know who is the mayor's representative that is working along with the panel for education policy to find out.\nSome reason why they wouldn't renew that's the kind of information that we need to know that we can work with before we make a demand that we want these repairs to be go ahead and do everything that is being requested there.\nI think you're kind of spot on, Although I'm just concerned that, If we ask them to give us a reason as to why they won't extend the lease, then they're just put their feet in the ground and will lose the emerald gem of high schools in New York City in the country, I've known principal nozbery.\nWhen you bring up something like that, and because the SCA has decided that it does not want to upgrade, We have to call the question how they prioritize the upgrades of those Shsat schools and their buildings.\nAs I, just said, Everybody knows what this school means to the city, and everyone knows how it can shape people.\nAgain all the work that your team is doing for students in Hell's kitchen across the city who travel to the school, we're going to shift gears, now.\nYou know in support of this school and extending the lease I think that Alan's right we need to do another.\nSo I, don't know, I can't really separate what letter needs to be written, So I think we need to do that first and then figure out how to move.\nIf you're asking me the contents of the letter that we need to work out on a separate call, Jesse does that fly.\nI think the broad strokes would be that we are one in support of the size school being renewed police being renewed right and that it's staying here and that its capital projects be funded.\nYou can say that we believe that the current way of or process for, negotia negotiation, the city negotiating lease renewals with for school, property.\nIt seems to be in conflict with how and the way that a attribute you know a regular school would operate and it being able to fund its capital projects and broad strokes.\nThe details with this particular school will find from probably talking, like everybody said here with some of the elected officials getting the right people on the phone with the mayor's office, DOE.\nOh yeah, We know the importance, but we really have to say we support the lease being renewed, but in the interim work needs to be done.\nI think the important thing the emphasis has to be on what they need: now, not on the lease being done.\nMaybe in a couple of years, Betsy and I would actually pose questions in the letter to like to the elected officials, because I think if we say that and Katie is right, but if we say that they're just gonna say: Oh there's this provision, it's a rule, We can't do.\nYou know you need to, but whatever couple of things, but just to be clear, I was talking about broad strokes, for you guys voting on something.\nRight is that we're, including another foundational bullet point, which is that we're all in agreeance that no matter what you know, what we're saying is the process to start negotiating that lease.\nI, think that's a different meaning that we need to get S-c-a-d-o-e down and ask questions and find out what are the nuances, about.\nWe have students who you know are on crutches have physical disabilities when the one elevator goes out, which happens multiple times, a year, they're stuck on the first floor and they can't access their classes and we have to bring.\nIt's, just not you, it's just not I, don't think it's gonna work that way.\nYour lease is over goodbye or is the always saying you know we don't want to do anything with this building.\nWe combined, two schools, so if Doa or the landlord, whoever doesn't want to renew why they're going to put capital.\nI just wanted to add one last thing: If I could yes, I understand exactly what they're saying, and so when I was saying about doing starting their projects immediately, it is with a lease guarantee because they're not going to renew a lease.\nSo, it's all into one letter, but we're sending it to are the power brokers, the ones that are actually going to be talk about the deciders of this process, which is you know, a city hall and basically read street.\nSo I just want to clarify that, as you know, What we're thinking we're doing.\nWell, sorry, in my mind, I was thinking about who the letter was going.\nOkay, so, while Malik's renaming himself I'll, just I'll, say hello, and thank you so much for inviting us to come and present my name's Alicia Hanson, I'm, the founder and CEO of a nonprofit organization called NYC salt located on 29th and 7th, and we're a visual arts program focusing on photography and video storytelling and college preparation with kids from underserved areas of the city.\nActually, She knows any after school programs that I could join and improve my photography and she recommended Saul and a couple.\nI'm missing a lot of things right now, but that's like the kind of things off topic that I could really think of right now and even now, as an alumni after four years of graduating, I'm, still pretty much very involved in the program.\nIt's got lots of great pictures if you want to just go through it, while people answer questions just to see the photos, I won't be redundant in repeating the information, but it's kind, of.\nYou know I work for the photo unit for the New York City, Fire Department, and we're always looking for interns.\nDo you ever work with city agencies because I'd love to get a you know, intern photographer.\nTonight, Alicia I wanted to know a little bit more about the exhibit that you guys I, think just closed.\nThat's going on I, don't know if any of you have noticed, but now's a great time to buy art, because so many artists are starving and looking for a way to sell their work.\nA lot of work has gone on behind the scenes, with Josephine leading the charge to figure out if we can get a Learning Bridges site in Midtown, West folks likely remember the letter that was ratified through exec and then voted on at full board.\nIf we get a site, maybe invite folks who are working there, students who are attending their parents, who are sending their kids there to share with us what their experience has been because one thing to flag for this group is sites like Learning Bridges are being operated in cities around the country, and many school systems are being a bit more expansive in their thinking about what these sites can.\nThere's a lot of potential opportunity for thinking differently about what school will be like when kids do get to go back to it.\nBecause I think some parents had wanted to I, don't even know if they're still on the call.\nYou want to take us through what street life is up to or has done, or is thinking of, doing, yeah.\nIf you know it's an area that you wanted to look into, further, and.\nSo, you know, I, think Judith brought up another imported street life.\nSo the process there is, you know, I, think a similar one where we could take a look around the neighborhood.\nI do think there are things that we know are going to overlap with transportation planning in general in terms of just the topic, but also maybe previous policies that a committee is and therefore, and the board has put out.\nJust, because I think that would be a you know, really productive dialogue, and then we can also bring up the bike issue at the same time.\nYou know work on some free questions that we can send over that'd.\nSo I, don't know if I'll be able to stay until the end of the meeting, but we're just going to hear what Jimmy and his legislative liaison wants to you.\nI, don't quite know, I, don't think our letter would get out in any event anyhow.\nYou know when we have more time to deal with what we want to say in the future letter.\nInitiatives, as it applies to some diverse theater groups and different cultural organizations in our neighborhood that we can kind of spotlight highlight get to know things like that, so excited to be working on that great.\nYou know I just want to say that so don't feel like you have to scuttle.\nJudith I, don't know the answer, but I don't think he was I."
        }
    }
}