{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCnSXdCNbGIrWH0l1yC3YULw",
            "title": "July 2020 CB8M Parks Committee Meeting",
            "publishDate": "2020-07-09",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 6,
            "um": 11
        },
        "wordCountFullTranscript": {
            "people": 87,
            "park": 71,
            "parks": 57,
            "community": 52,
            "dog": 41,
            "lot": 40,
            "equipment": 38,
            "time": 34,
            "money": 33,
            "things": 31
        },
        "wordCountSummary": {
            "people": 20,
            "community": 11,
            "park": 10,
            "parks": 8,
            "lot": 6,
            "board": 6,
            "dog": 6,
            "money": 5,
            "committee": 5,
            "area": 5
        },
        "fullTranscript": "Tricia, it's 6:30 to one of you on mute until you're ready to go. Yes, I am thank you. So much is I. Just I, don't see been Kalos here, but she obvious here great Abbi. Do you have an ETA on councilmember? He is joining rectus logging on okay, so Barry do you want to just given the whole introduction sure good yeah good evening? My name is Barry Schneider co-chair of the parks committee of Community Board, a this is a July meeting. Welcome aboard. We have a easy, it's simple agenda, but it's very packed with stuff, and we knew we appreciate your joining us by a zoom we'll get started in a moment just very quickly. This first item the discussion of the Rupert Park, the current state and look into the future we're going to limit that discussion of 45 minutes. We have two guests with us. We have done the Honourable been callous New, York, City, Council, member and we'll be joined if we have not already been joined by the Manhattan borough. Commissioner of parks, william castro, without further ado, I'm turning over to my co-chair tricia Remora will conduct this portion of the meeting trifa. Really we just wanted to kick it off and thank councilmember kalos for joining us and invite him to give a few opening remarks. Council member just to give you a little bit of backstory, which I think you already know, but of course we were all very concerned about open space, we're so proud that you have helped champion this issue during your tenure in the city council. We particularly we're talking about rupert parts for and the future of this park funding. What we need to do in terms of advocacy on our end to ensure that there's money in the budget to go to a redesign of rupert and over and over again, we kind of just said. Oh, we should bring councilmember k, listen to talk about this and talk about. The idea is that you might have with regards to this, but really we'd love to just get your thoughts on all the parks in our community and then, if you could give some kind of specific thoughts on Rupert I think that's where we're going to naturally transition to afterwards bringing the board. Thank you and I see I see a lot of friendly faces here. I want to thank the folks from parks. I see, mark Vacarro, who is here, I know that we'll be joined soon by more folks. I also see mo bean from the Muslim volunteers, one of the commitments I made when I got elected as I wanted to start a neighborhood association or Conservancy, or partnership for every Park and Muslim volunteers has been an amazing partner for Rupert, which has been hard to get had been hard to get off the ground. Historically. I also want to acknowledge that I see Rita hopper on this committee. Rita I was known as a troublemaker on community board aid until Rita, joint and now she's. The troublemaker and I love her for it, and she is the eye reader. You were still present to the Knickerbocker ta tenants, association, yes, and so we work together to make sure that ninety first was designated a place treat by the Department of Transportation, and she is pretty much her and David Rosenstein who I missed terribly and I know. Many of you do work together with Lisa La Jolla to make that place, treat and so Rupert has been a park that has needed a lot of work. I actually brought the previous parks chair, burger den check to that park to show him, and he said it was one of the parts that needed some of the most work, and this isn't actually the parks department's fault. This is actually HUDs problem and that's because Rupert Yorkville and I actually live in the complex. That's what you see outside the window. I live in one of the rentals in the building when they put up the building long before I was alive, so I can't be blamed for this one. It was under HUD and they had to do a park as part of their urban renewal project and that Park is a HUD designed park. Not a city parks designed, which is why there are so very many large trees that eat up all the sunlight in the park, so I just want to touch base on a little bit of some of the partnership we've been able to do. It was this parks committee that we worked with the previous chairs to open the Oval. It was previously only available three months a year as kind of a dirt field. Now it is available half the year for free tennis and then there's still three hours throughout the year. That wouldn't have happened without this committee, starting from 60th Street, south we've already broken ground on a 100 million dollar extension of the Esplanade down to 52nd Street. Many of you joined us to break ground on three point: three million dollars to rebuild Carl Schurz Park playground, which I am hoping and I'm hoping you have an update, but I'm hoping we can have it open in September, because the kids will need it. Moving northerly. We have John Jay Park, where we've been able to secure funding with the parks and where we've opened completely new basketball courts working with Greg Davis and the kids there, and then we also recently. This is outside of the district, but we reopened the Sutton Place Park with the Sutton Place Conservancy and then along the Esplanade, which is kind of the pride and joy, and this really has to do more with Congress member Carroll Maloney, who co-chairs the task force with me and Jessica laughs and who founded the task force. We're now up to 198 I, think it's actually 278 million dollars and that's 4.6 million dollars to rebuild Andrew house well, Green under Alice Aycock sculpture, which we all cut the ribbon on twenty-nine million dollars from Memorial sloan-kettering, which I believe the Schneider's were key in securing for phase 2b from 60th. The 61st I believe they've already begun construction, 15 million dollars from Rockefeller University, that's already done, which we cut. The ribbon on I have allocated a million and a quarter from seventieth 268 to redo that portion. I know the mayor has matched my dollars with another million dollars and we're hoping to get that under way. Hss is already renovated from 70 it's a 72nd to the tune of a million dollars, and we will see them redo from 70th Street, all the way up to 78th Street as part of the master plan that we all negotiated with them. During my first year in office, 15 million dollars rebuilt the stairwell from 78th to 81st Street. We have a new pier coming from really that's the overhang for the million dollars I allocated $500,000 with Civitas to redo from 81st 284th. We just reopened a new ad, a ramp at if I believe, 82nd Street I mentioned the Carl Schurz playground and then from 99th 90th Street to 88th Street, one of the first money I ever secured 35 million dollars in my first three months in office went to that and that is actually already open. We are waiting to cut that ribbon when we can. We opened the 90th Street Pier as a park before the ferry service came, and now we have the ferry service and, as we moved from 90th to 96th Street, there's a million dollars. I've been cooking dinner, so I'm going to step out for one second and I'm, going to just take my chicken off the grill and hand it over to my wife and daughter to eat, and then I'll be right back to talk about Rupert well had must comment on the councilmembers haircut good for him. I also want to know I just want to mention the big verb. The chairman of community board, a talita cab has joined us salute leader. Welcome, go ahead, I'm, sorry, Trisha! Thank you and thank you to the co-chairs of the parks committee and so some of the money that we still have is. We have John Jay Park a senior space that this committee did a lot of the public hearings on that we need to move forward with and so for. Rupert Park we had initially allocated about a hundred thousand dollars for the irrigation that turned out not to be enough. Rita popper has been very vehement in her advocacy and wanted to make sure that there was at least half a million dollars allocated. So I'll tell you that in this past, budget I have allocated at least half a million dollars for Rupert Park, and so I am interested in hearing and I have about 10 15 minutes before I have to hop to my next page I hear another baby. My baby is going to bed as we speak. Sorry I know it's the new normal and it's my life too. What I would say is one question that we've had and I would like to say that this should be off topic, because I know that one of the co-chairs has devoted at least one or two meetings on this is whether a dog run would be appropriate for Hartford for Rupert, given how many people bring their dogs there. Naturally I will. Let Park speak to it, but I do know that David, Rosen, cien and other neighbors who are nearby would mention that there are a lot of dogs barking and historically, as far as I know, at least in our neighborhood. A lot of the dog runs are not where people live, so we have one in Carl, Schurz Park. We have one in the 60s on the Esplanade next to the FDR, so that we don't have to deal with noise issues or any smells or what-have-you. So I think there's that one conflict. The other issue is when we did the when I was on community board aid back in the arts as it were, and I'm sure, Barry and Judy may remember. This is along with a lot of other people were on the board. With me I remember: we did the smoke we had, one dog run in Carl, Schurz, Park and people were up in arms that there was only one dog run, so I believe we ended up having to create a second dog run. I believe was in Carl, Schurz, Park I, don't remember, or maybe it was in the 60s, but I remember we ended up needing to create two dog runs and we have this similar complaint down in the 60s. So if we ended up doing one dog run, we would need to have a big dog run in a small box oghren, and at that point we might not have much Park left. I am a big believer in infrastructure, can determine human behavior. So are there ways to change things in the park? Are there ways to make it more approachable? I know that I think in 2015 Mark Vacarro there was funding available to make parks more accessible. So the idea was to take down the fences and the gates and I think the board had been opposed to taking down the fences and the gates, because there are already there may already be an individual who sleeps in the park at night, and we didn't want to make it easier for people to just come in. But one question is like how do we have a park that people aren't sleeping in at night but is still approachable and not necessarily just through those gates? So are there things we can do we want more green space? Do we want less green space? We want more seating areas throughout and do we want to set up instead of having the hill as it were, having a lower level and an upper level with the youth programming up top and the passive space down below, but I'm, hoping that with at least a half million dollars and I see sahar another member of the Muslim volunteers who I want to recognize there? They are there. They bring up hundreds of people to try to improve the park. I'll just say the other big challenge we have is just no matter how much amazing work the Muslim volunteers do in terms of the plantings we end up at having all that get torn up very soon thereafter by folks who are not being good neighbors and are letting their dogs off the leash and then the dog ripping things up. So I live near Rupert Park. It is the park that my daughter and I are used and I'd like to do something there. It is one of the last things I'd like to get done as your council member I hope. I can continue to do it and I think that the half-million is a starting point and I hope to have more to announce in a very immediate future. Thank you. So much council, member and I know that you have just a short amount of time. So I think we should just go straight into questions and go with the public. First I think that Betty Cooper wall I've seen I'm, not sure, but if you have a question on this or on another perk, that will can you I'm here I'm here and I'm, ready with my question. Thank you so much hello! Yes, okay! Well it's over eight years now, as you know, been that we have John Jay Park theme, one section, the it's actually a playground and it we were expecting to fix a section, so people could sit down there. I'm gonna go to the last meeting that we had was witches Commissioner Silver's office, where we were getting the go-ahead, and not only did you put aside money Ben, but also we had funding from the Commissioner for these tree guards. So now what has happened since, just yesterday, a call to Steve Simon told us that this is still on hold. What is happening so we in preparation for tonight and also I just want anyone here to know that Betty Cooper wallerstein is a force of nature and she will not stop and won't give up till what she would hope. Not what would be what the community needs. So we Justin in response to Betty's advocacy. We had reached out to the parks department to get a status of all of the projects that we are currently working on and we do have quite a lot and so two of the projects. So anything in construction is continuing, so Carl Schurz park playground is continuing, but the John Jay, Park seating area and even the East River Esplanade project that I funded with the mayor have been a contractor, is close to being selected they're ready to do the contract award, but the city has placed a hold on any of these new construction projects. So in response to Betty's advocacy and we reached up- we have the meeting with sparks yesterday, we're very honest and helpful about where things are and that is being held up by the Office of Management and Budget, so I actually reached out to the Office of Management and Budget yesterday, requesting that these projects be taken off the hold, because this is not mayoral money. This is council money, there's a little bit of matching here, but they have no right to stall these projects. The other thing is these, because they're taking away the exercise equipment that has nothing to do with construction or Deek, excuse me or deconstruction- that's still there. So we really have to talk about it, then, because this is not fair to the community, the three seniors, two of whom were on board eight, who asked for it so badly and needed it eight years ago, have passed away and we have so many people who I'm sorry I was just trying to get something to eat. Oh, we have so many people who cannot walk over to Carl's shirts and it really is in terrible shape, but at least the equipment should be removed and I'll speak with you in the office further on this. Thank you so much. Thank you. I see a lot of board members, but I also see I got a message that Jennifer Ratner has asked to ask questions. Of course, our chair of our and founder of the East River Friends of East River Esplanade, so we'll let Jennifer p.m. you did. Will sure you hear me. Yes thanks everyone I know this was also not on the agenda, but councilmember Taylor's address me as so not a lot. So thank you and thank you for the amazing funding. I just want to address some kind of immediate and I, see mark sicarios on the pole and we brought them up with Wesley, but there is a lot of vandalism and the southern part of more attention to that area, since more and more people are using it since there's such a dearth of public state in the area and the waterfront of so beautiful here, that's one thing number two you're talking about exercise equipment in John, Jay and one of our next project, because we've got a lot of requests for it to put exercise equipment in some form on some part of the Esplanade. Now that people will be exercising outdoors because I know, there's Jennifer I knew mark as well, just in case. He wants to comment on that. Yes, their exercise equipment farther salad, I'm, not including East River Park, because that's a whole different ballgame, but on the Esplanade between Montgomery, Street and Brooklyn Bridge. There's a contingent of you know fairly similar some equipment similar to what's at John, Jay, there's a lot of body weight equipment, and then there are a few of the equipments. Where you know you have moving parts on and that's particular section of exercise equipment, it's actually fairly heavily used by people of all ages and you know to mix community down there. So it's a racially an aged mix and it's heavily used the equipment that John J is moderately used. It's usually more the body weight equipment at the southern end of exercise area that I generally speaking, when I go, there I see somebody working out or a personal trainer working with somebody in that area, but there is the, but there that exercise used, yep great I, believe Commissioner Nicastro's, actually on the phone, so I think I just had a muted him Commissioner. Thank you yeah. Thank you. The limits of technology becoming amazingly started in mark did a fine job, so I don't need to elaborate, but I just wanted to. Let you know I've been on for the last 15 20 I just want to answer the question about the vandalism. One of my neighbors sends it to me. My staff has probably let the parks department know about it, as well as the appropriate agencies in terms of the vandalism will work the Department of Sanitation to try to clean that up. So one of the reasons that it's important to have, conservancies or friends of or neighbors groups is so that there is somebody paying attention to that. So Jennifer a few folks to make sure you got the three one request in. Let me know that the parks department, you know, will work with sanitation and others, something that you may have heard about in the city and that I tweeted about today is that one of the reasons I voted no is because they've been cutting random things that we didn't want them to cut. So, as you may have read, we have Park Rangers and kept officers, and officers are the people who do things when people are setting off fireworks in our parks and things like that, because we don't aim police officers to do that work. We can have our prep officers who make a fraction of that cost doing it, and so we haven't laid off any police officers or done anything to police officers, but they've just relate off fifty Pepa and Park Rangers. Is that correct and they may not get it correct? Not yet not yet, but so we will. We will work with you to do so and I'm just very disappointed in this year's budget, and we have another question from another member of the public, so apologies for members I just want to get them first, Mubeen City, quick, had a question so will a new blue bean high at Highbury and Tricia? Thank you for making this time for Rupert Park in particular, so glad that you brought every all the players in question in one forum, so hi Ben, hi, Commissioner, Castro, wonderful to hear from you after some time, I just want to first thank both of you and CB. It's so much tremendously for supporting Rupert Park. We're a volunteer group that you know serves as stewards of the park and they're very grateful for this collective support. We get from Commissioner Castro and Ben in particular, has been giving us monetary support from the very outset, and cb8 has been incredibly supportive. One of the concerns I do have you know. We've talked about a lot of the issues that were aired at today's meeting over the years and we would really encouraging everyone granted its covert environment, but we can have a zoom called and I think all the players need to sit down and actually hammer out future renovations improvements to the park. As we, you know, we've done the best we can under the circumstances. We are doing the landscaping, whatever we can to make the place more appealing to the neighborhood and the community, and we've also been trying to police, as best as we can. Neighbors have been incredibly supportive and notifying us from time to time that people are cutting the plants that we've just planted or as the plants are blooming. Someone is coming and chopping down the plants and we have notified on New York, City parks, usually Wes or somebody there immediately, but I think we need to take it to the next stage. As Ben said- and you know, while we appreciate the funding that you know he's providing we're really grateful for it, and thank you so much for that ban. But we need the players to be now sitting in engagement together in Consolidated fashion, for us to just go in need. You know either ban or cb8 or new york city parks. Discreetly I think we will not get the synergy and the momentum to make the next change that thing. We've taken it as far as we can in terms of just general maintenance, but we need to make certain more long-lasting improvements for the I know. The community man John video movie. But after when we coalesce the discussion, we have now I have a very specific suggestion to make regarding moving forward with Rupert wark into the future as what has been done with the park here in community district 8 early on. But let's hear the rest of the comments. I want anything Craig from the public and then we'll go to the board. Members will have asked me to say that if you have a question- and it's not going to do anything to chat, will you must raise your hand, which is a little blue button with a hand blue hand under participants in order to ask a question so yes, -, yes, -, Craig and then move on. Thank you want me to respond. That would be great Commissioner. Thank you. I just quickly want to say, I want to thank everybody who have done work, volunteering and it's been a great effort. The volunteer projects that we've had there and the community who are interested in keeping it a beautiful park and making it better. The dog, the use of the northeast corner of the dog run, is not really working out very well and has been a problem for a number of years. One of the suggestions that I received in the letter is an excellent one, which is to add more plantings in the park and I. Think that's an immediate thing that we can do you know in September when the weather is cooler we're in for a pretty hot summer. It seems like for the next few weeks, at least so I think we need to do that. As has been pointed out, the southeast corner is in pretty good shape with the plantings, but the area chosen for dogs is really not in some of the other areas because of the unusual nature of this park. It really is not the best ground to put a park in of this kind because of the slow causes, erosion as I'm sure most people know, but I think that's the initial thing that we should do the September's doing a major planting throughout the park and I'll work with the councilmen, as we have in the past, to see how we can do any capital renovations temporal renovations are increasingly expensive. It's really a challenge for us to do the kinds of work we'd like to do given the budget limitations and the increase in cost, but we'll figure something out, but we can definitely make it a beautiful park again and secondly, the park enforce patrol has gone in there with ticketing, but we'll have to go in there with education as well as ticketing. If that's necessary, we try not to do that and they will have to go in the early mornings and in the evenings, as everyone knows how that works and we'll stay on it. So thank you. I just want to add one person who is missing. It is my good friend and everyone's good friend, because they're perhaps for Movember Manhattan borough, president Gale Brewer council members have a very limited amounts of capital compared to what a borough president has. So we if we want to see some of the big changes, I think parts for the kinds of changes for small changes, we're talking, hundreds of thousands to millions for the big kinds of changes that I think the park actually needs in terms of a major overhaul where I believe parks is saying six to eight million. Is that correct yeah? That is so that doesn't happen without money from the borough president and even perhaps the mayor's office. So we will. We will need to widen it because I'm happy to put in might like my couple of hundred thousand here and there may be a million if I can. But if we need six to eight million dollars, that is how much a councilmember gets over two years, not over one year. That is incredibly helpful to know and I guess, council member just said just because I know you have limited time and I just wanted to follow up with that. What do you mean? What cannot we do then, as a board I mean? Should we be starting to gather petition should be expert, starting now to be writing letters to the mayor's office. What can we be doing to really start advocating hard for those larger funds that, if I may jump in here, that's the point? I was about to get when we finally reserve resolve the some of the issues were discussing I'm back in the Ortz, where the councilman was talking about. The community board got together and formed a 197, a plan which told the city how one wanted to use the various areas. One of the areas was it Andrew, Haswell, Green Park. The community would then set out to raise funds. We got money from each councilmember city. We got money from the from the borough president from the seven state assemblyman from the state senator carolyn Maloney. We Bailey a federal funding in that Park I, don't know that federal funding be appropriate for the part we're talking about Rubert Park now, because that was multimodal money. But in any event the point is we have to organize ourselves and get moving toward a concentrated effort to raise the six to eight million dollars from the various stakeholders who we can call upon to fund this. The way we did and who has well Green, ten or twelve years ago and the money but bothered when the money doesn't come to the Community Board we decide. That was a bad idea. The money went to the parks department through a conduit and it worked perfectly well I. Think Berry is right and I think that the community board can start the campaign now I. Don't necessarily think you need petition so much as resolutions is bringing other elected officials to this floor and be. Secondly, Rupert is lucky because it's I'm the president. It is in Dan courts district. It is across the street from Rebecca C Wright's office. It is my district, but Keith powers starts at Lexington, which is a block or two away. We have our borough president. It is correct the East River Esplanade parking who, as we agreed, was on the highway. So it was technically multimodal money and actually I was working for something being when he allocated $300,000 they had to has concrete park, pays to a so I. Remember it fondly so I think that if the assembly members each did half a million I could probably do another million, and if the borough president kicked in a million now we're talking about three or four million dollars and then we're talking we're cooking with gas. Also, the mayor had given money about a million dollars. Twenty four sycamores park he's given he's puttin money on the Esplanade, so it is possible that if we advocate with the mayor so I think if we move forward, it might be appropriate to bring Gale Brewer. If you invite her I know, she shows up the assembly. Member is that this Liz Krueger the state senator all these different elected officials, to let folks know that this is a park that is a priority and then just one other part, but I don't want to get lost. Is the park at family Isaac's at 96th Street and trying to put pressure on the group of folks who do the roller hockey there to provide capital improvements to the rest of the park and that they receive a huge cost savings by able to use that park? I think almost that very low fee or no fee, and we have that we also have Samuels, see very playground. I think Samuel, see very playground is actually a much better condition than the other two, but I would just say. Rupert and Stanley. Isaac's playground need the attention and I think finding for the money and then also just trying to figure out the future of the park. I would hate to get the six to eight million dollars and then end up getting caught in the middle of the dog run a big dog small dog what-have-you. So trying to get that settled up front of like this is going to be a park. This is going to be what it does, or it's going to be an entirely dog park and what-have-you, but trying to figure out what that's going to look like. So that comes from the community versus the elected officials and then other key features so yeah happy to work with you, I see a lot of folks on the call Abbi damn see from my office is here. She will take notes and continue to listen. I have to hop, but thank you for having me Thank, You Ben, greatly appreciate your being here and your inspiration. Thank you, my pleasure I'm. Sorry, we can't swim had to jump off, but Craig I think that you were next with a question. Will you Craig, please thank you may have to push a button on your screen. Thank you. Unfortunately, councilman Kalos left after I wanted to address the issue that I thought was really important and I know attrition you've been to the John Jay Park numerous times, as we discussed previously, but I think it's very irresponsible to go ahead and remove the equipment at John, Jay, Park I'm, considering all the gyms are closed. The area where the equipment's are constantly filled. First of all, there's numerous personal trainers there and I asked to have this looked into previously. I never received an answer from Steve Simon. Some of them hang banners up as to the as to brand themselves, and the whole class is at John Jay Park, which is ludicrous. There's people who regular members of the community can't use this facility and people are making money. While there are people who are laid off in the community, I just think it's really unfair and there's no room for people to exercise and honestly I'm, not sure when the gyms are opening and when people are going back. So I think that there needs to be a little bit of common sense here and not cutting off our nose to spite our face. I understand how the vote went previously and I understand that Ben wants to get this accomplished, but I mean I. Think you just need to go there and see what's happening and Trish like I said: you've been there so I understand and another point mark I understand, really understand what you were talking about: adding new equipments versus the equipment, all the way downtown. If you could just reiterate that downtown, has a broader selection, it's a large area, so there's a much broader selection of different types of exercise, equipment and equipment. That's you know that you know equipment usually designated by age, but down there it seems everything is being used by everybody and I. Don't I, don't see a lot of I'm not down there that section a huge amount but I don't see a lot of personal trainers down there. I do see them up on and off at John Jay and some of my other parts yeah in the morning there's three or four every morning, I'm, probably the person that you see there every day by the way the police comes. Please come say hi, but I don't understand like I. Have I'm familiar with some of the equipment that I've seen around other parks in the city and actually the equipment that it wants to be removed, not the pull-up bars or the jungle, gym, dump or monkey bars. Scuse me I mean those are excellent pieces of equipment, but the other equipment that was put in there had lots of moving parts are not useful pieces of equipment, they're easy to break, which is really what happened, but I have seen other equipments in other parts in other parks in the city that are very functional, so you were talking sounded like there was the possibility of adding additional equipments on the squad further down, but no one from the upper east side is going all the way down to Chinatown with a lower Eastside to go exercise. No I wasn't saying adding equipment. I was just describing what's down there. That's okay! So is that something that's a possibility? And because, at this time the park, honestly, you go there after work at 4 or 5 o'clock, it's very crowded, that's 7, 8, 9 o'clock, it's very crowded also and those in the path where the equipment is being removed for the new benches. Those are used every morning. All of them are completely full for exercise less good morning. Let's handle this, please never have to move on. Thank you, I wouldn't be my decision or are designed to add or take away. My operations well you're doing a great job because they're doing a good job opening the park this year. So congratulations. Thank you. Sorry, everybody on my I think that the next person who had their hand raised was Justin hi how's it going yep, hi I'm, a resident of the neighborhood 79th Street I grew up in this neighborhood grew up in John, Jay Park went to PS 158 with my wife. So now our two-year-old frequents the park, and it's it's been great- that the park was opened for the neighborhood and the children in the neighborhood. During these these crazy times so I just kind of like to reiterate I was Craig's sentiment. He invited me here so thank thanks for that. A Craig the fitness equipment in john jay Park is heavily used pretty much all times of the day. Some of the fitness equipment was actually installed incorrectly. In the area that is designated for exercise, there was a set of parallel bars that were actually instead of installed parallel to one another. They were installed head-on, so I'm of the mind that specific area could definitely use some sort of improvement. As for the rest of the seating areas that they're trying to install the entire back area is a seating area, there's, like maybe 30 square feet of area to exercise on. So those just my thoughts on that. Another issue that I was hoping to express while mr. Calus was here, was that of the John Jay Park swimming pool me and some 500 other local residents and signed a petition which was I'm assuming brought to mr. callouses office yesterday to petition to open up the swimming pool. It's it's been a mainstay of the neighborhood I think it's absolutely crazy to not open the swimming pool. The children really deserve and need it open. That's one another issue and lastly, I'd like to address the issues with dog walking in John, Jay Park I know it's. It's been mentioned as an issue in Rupert part, but it's also concerned to many parents in John, Jay Park, there's a cabal of dog walkers who like to bring their dogs into the kitty playground and also on the ball court area, which some years ago recently was renovated. Forget the large sums of money went into improving the basketball courts there and every day in the mornings and in evenings you have dog walkers, bringing their dogs onto the basketball court really to do their business, and it's really unsanitary and I've spoken with some Parks Department officials. There apparently is misleading signs about whether or not all walking is allowed in the park. I think technically dogs aren't allowed in John Jay Park, because there's playground equipment in all areas of the park which I think by rule you're not allowed to have dogs walking in areas with playground equipment. So that was one issue. I spoke to a Parks Department official about, and he said they were going to update the signs and since there's been no update and there's no sign whatsoever, the area is where dogs can and cannot go. Just gonna have to call you number two look good mark has heard about the signs and regarding the swimming pool, we're going to be deciding we're gonna pick that up under new business. So thank you for bringing it to our attention. Thank you. So much good is next. Remember: Benny Lewis! He left I just wanted to thank him as well. For his sake, you know such wonderful words that he said about Rupert, Park and Muslim oranges for New York's I just wanted to add a couple of things just wanted to mention about that. Like you know, we did have a virtual event, although we couldn't have any physical events at Ruppert Park, but just to engage the neighbors and to offer more opportunities. We did do a virtual day event. A few weeks back and Barry was also registered for that. So, like you know, it was really nice to see many on that. So we did. We are still trying, although given that, like another fact, was closed off to continue some of the some of the activities related to parts so just to keep that interest going now that the parks are like, you know, they've opened up, hopefully like my October is our next event on the calendar and hopefully by then you know, situation would have changed and we would be able to bring in and invite everyone to come, and you know clean the park and also to launch new paths for the next season. So just wanted to update on that. We already have plans for that, obviously tentative and dependent on the board at 19 situation, and you know the advice that we would receive from the fireworks and everyone else. The other thing I really wanted to mention was that my I was just so excited to hear about when Barry said to share spoke up. You know finish: the cash flow spoke and also you know. Ben was mad about the fact that, like you know for loop at heart, next, we would be engaging in some bigger projects and to release try to revamp it. That has been you know so close to our heart as well and I. Think that's what moving was also mentioning and I want to just I kind of emphasize that as well, that we would definitely cross to be a part of that yeah, big role in that in engaging the community in helping in many ways. So thank you. Let me get together and moving on this and let's really work on this there's so many things that can be done and the part can be made so useful and more much more beautiful, Thank, You, Sark, Thanks I. Think that just so we're all on the same page, this was still under the larger umbrella of asking questions to both Commissioner Castro and to Ben kilo. So we'll continue with this, but then we'll go I. Think I want to just circle back at the end, to what Barry had said that we would circle back to about River Park, so stay tuned, don't leave the Sahara Mubeen, because I want you guys to be a part of that at the end. But since this was technically questions that people had raised their hands with regards to kind of a broader scope of parks, I think we can continue Jen her Ratner was next may I. Ask you to keep your remarks to two minutes, please, with what we're going to be running into a time crunch. Thank you. It's Jennifer, Leonard and from friends of the interest when I was just responding to the subsequent comments about exercise, equipment and just because Parks is on the line. I just wanted to reiterate that we have had a lot of requests that Esplanade friends to put exercise equipment on the waterfront, because again people can't exercise indoors. So if you do end up taking the maturity equipment out of John Jay Park I am suggesting that it should be moved, or at least some of it could be moved to areas on the Esplanade and it's really unfair to the community in eternam and the Upper East Side, which are very mixed communities and very heavily used. I would argue as much or more so than further south, but there's no exercise equipment for you know literally miles and miles and miles so I. Don't think it's not it's not really a big issue of design. You know there are lots of water spots where there's small little areas where people can do chin-ups or whatever they want to do pull-ups, and it would, you know, be a great location for people to use that kind of exercise, equipment and would certainly be able to help coordinate. That is not speaking as co-chair, but as just an Esplanade user. A Jennifer I think that sounds like a great idea. I think it sounds wonderful and what I think draw more people, so the Esplanade I was wondering if Commissioner Castro could or mark could speak about the possibility. I, don't know why I forgive me. It's been a while I can't remember what exercise equipment was being removed from John Jay. Forgive me, but I am wondering if about the possibility of, if anything does get moved or whatever it does get moved it that can be realized in our community on the esplanade bill. Well, we could certainly look at this if you want to suggest some locations and then we'll also take a look to see whether this can work or not and they'll be happy to look into them and Jennifer keep us posted. If there's anything that our committee can do to you know to support you. We want to the final member of the public who has asked to speak is betty again. Hi penny hi I'm, usually very quick. I came back because I hear that Commissioner Castro is there and I have a question and then I want to answer a question that was raised by someone commissioner on I. Do remember that the Esplanade was one of the places that we did talk about that might take the equipment. But what I wanted to ask you is everyone is complaining about the conditions that you heard just a while ago and John Jay with the dog feces and with all the money and the wonderful things that were done for the other parts of the children's unit and the basketball courts. Why is the park not getting enough help to with keeping it clean? The problem is that the I'll answer in two ways. First of all, there's been a tremendous budget reduction, which I think everyone is aware of. The city has taken a big hit, as I think everybody understands, just as the public has taken a big hit because of the coronavirus, with businesses closed and tax revenue down dramatically something we've never seen in this country since the Great Depression, so that has factored into this. We have. We had our seasonal budget significantly cut this year, so we have about over 250 I, think about 250 fewer people working at this time in the summer that we had last year. Don't hold me to that number, but that's roughly what it is, but so that and other people who we usually have available have not been reporting in as much as we would like, and there are some real, legitimate concerns of people who have health conditions, who you know, have difficulty coming in and need to stay home, it's very important that they take care of themselves. So that's the main reason now. The second part of this, my answer is that I've spoken with our regional managers and mark Vaquero is one of them and a very good one and I've asked them to look at locations where we are having problems because of use primarily for litter, where we found this to be true at Carl, Schurz, Park and other parks throughout the borough, where people go out because they're going nuts inside and that makes sense they want to get out. They need to get out it's very important for their mental health and physical health. What this has done is it's started to have an impact on your local parks, whether it's grass areas have become worn as a result of this other things that you're seeing people using them in ways that they and been, as one gentleman said earlier this evening, or it's been an increase in some of the uses. All of these things increased literate cetera even with the subways closing early for cleaning. It's made it harder for us to lock parks at night because our staff has to get home and they need to leave earlier than they ordinarily would they usually work fairly late, but we're I've talked to our staff and I said: look find the locations that seem to be problematic, and let's do a number of things to address that, because I want the public to be well served and I want their parks to be clean and well-maintained. Even though we have several hundred fewer people, there is a way to focus on those things and they will be working with me. We met this week about this problem, and I should have several strategies to mitigate this and make it a much better. You know place for everyone to be, but those are the reasons, and this is what we're doing about it. Okay, good bye, am I still on. Oh, yes, I had a second question in my own. Now, yes, you are okay, the other question very maybe you want to answer this was voted on a very long time ago. There was for the past three or four years there were exercise classes done regularly at the park paid for by been in East 79th Street Neighborhood Association, because of people at that time preferred to have the ability to stop and rest a minute, and that was very successful. One of the pieces of furniture was dangerous and was recalled by the company and I meant to mention to Commissioner Castro I forgot, but you know when you buy something and it turns out not to be good, it's usually refunded. So now this was a very expensive piece of equipment, I'm sure you know which one it was because I can't remember the name of it, but that was causing problems, and so the manufacturer had it removed, have you removed, but we should get the money back, for that was one of the things I did want to mention, but the other issue had been voted more people wanted to have. There is no place, it's a playground, it's called John Jay Park, but it's a playground and there was no place for people to sit, and so a retreat was going to be for seniors. But as the years went by, the Commissioner silver was right when we met when we talked with him more recently, and it should be open for everyone, it should be open, for people can have a place to sit when they go to the pool and afterwards to have a little place that they can have a picnic. And so the idea was to put in more tables to keep these. You know the weeks to chairs the way they are to make. It really look a little bit like a park. All the trees were dying, some of that equipment, as someone mentioned Wilkins birthday, but the large pieces were going to be replaced more by tables and the oak hole open. They hold the hole under the surfacing all had to be redone, but there was enough space so that people would be able to do different things and move around, and that was almost nine years ago. That was decided to do, and it's just taken a very long time. But that was the reason so now I'm, just hoping that we'll be able to do that. But I do remember that the people were asking for their furniture and wanted it and I'm very happy to hear that the Esplanade I would like to have it because I believe there are four pieces. There were five and now they're four and the and the other part that was there before that people were going on. There's two left I, don't know what you call this high places, but that was to remain so. You agree with that Barry. That was how it was left, not quite frankly, I. Don't recall the details and, quite frankly, lots of like look forward. Let's look back if this furniture can be relocated to the Esplanade and it meets the needs of the senior population. We use that it's senior equipment I think it's ideal. So let's thank you. Thank you great. So we're going to the board members now Rita hi I want to just thank Mubeen and all the Muslim women of New York do an incredible job at Ruben, Park I, don't have a dog, but I do have grandchildren who do have a dog, and they did come to visit this past weekend and we only met outside and my daughter-in-law, who is not afraid of anything decided to walk the dog in the area where it's a dog area I never saw Jackie move at the speed of lightning to get out of it. I said what happened. She said it is absolutely filled with feces I am concerned. A I can smell it as I go by, but I am concerned during this pandemic that this is not healthy and is there a way to disinfect it all right, so I'll answer that the well it has to be picked up, but the part of the problem is that I, the dog, a number of the owners of these dogs have not done a responsible job I'm, not saying all of them. I, don't know all of them, but I've seen it myself where they ignore the signs and you're testifying to it that they are not picking up, and it is the law of New York state that you have to pick up after your dog and many of us remember what it was like years ago before the pooper-scooper law. Remember that when we have to walk down the street- and you got your shoes messed by it all the time- I don't know why we stood for it so long, but ed Lerner saved the day and the pooper-scooper law came into effect and it's still in effect, as is the park rules and regulations, said you have to pick it up so well. We do have dog runs, the dog run, group is responsible for cleaning their dog run and they all seem to do a pretty good job of it, and then they put in the cans and then we empty the cans, but we can't as park workers to go in and clean up other people's dogs do, and the fact that this is happening is terrible. We will go in and deal with it and thank you for raising it, but this is just another reason why we can't allow this kind of behavior so I. Thank you for that. We will take care of it. Thank you. It really is a very big problem and I didn't expect park workers to go in, but somebody some entity deep. You know environmental or whatever it is. It is scary, especially during this time, when we're all very conscious of health things and permeating in the air, and it really is I mean I passed by today, and it happened to be very hot humid day and the smell on Second Avenue was overwhelming. Thank you. I appreciate it. Thank you. We have a leader camp next, her chair. Thank you very much. Tisha and Barry I just really wanted to thank councilmember Kalos Ben for financing the parks and looking after them and the Parks Commissioner. One thing we've learned during this virus crisis is how important open space is. So thank you so much and to the parks committee as well. I'm glad that we have the money and the inclination and also to moving in her Muslim group that looks after I'm, sorry, I'm, so bad at names that looks after the park and takes care of it because I know what he's talking about. I walked by and second, everyone was stunned at what rooper Park looked like so I know: I called Tricia in a panic from the street as I was walking by. Thank you all so much. That's all. Thank you great Lita, I think as much as you can stand, no, you must be exhausted from a million zoom meetings, but as much as you can say on I think that when we get into a little bit deeper conversation about Rupert, it would be great to have your input as so our next steps with that next is great. Hi good evening, everyone I just wanted to briefly mention, especially while Abbey was online. My concerns regarding the Esplanade and the lack of connectivity that occurs on an almost daily basis as a result of police barricades that have been set up with continuing protests going on near Gracie, Mansion and obviously I'm. A huge supporter of the protest and the black lives matter. Movement and I would like to see them continue and impeded. My concern is that not only are they blocking off East End Avenue during those times, but they're blocking off the Esplanade from the back side of Gracie Mansion, all the way to 87th Street and for anyone who's trying to get from one side to the other or taking advantage of the Esplanade. It becomes a frustrating experience because you have to exit the park and go all the way to York Avenue to be able to come back on the northern side, and there have even been instances where there's where there's been lack of access to the ferry I know they. That issue was corrected after numerous complaints, but there was a time I believe it was last week where, for much of the day or a good portion of the day, they closed off the 89th Street entrance as well. So anyone who was coming to try to access the ferry north of 87th, Street and didn't know would have to go back to York Avenue and come back by at 87th Street in order to get around all the closures. So I just wanted to point that out and see if there is any way that we can have an arrangement so that there is still security provided for Gracie Mansion, but perhaps that it doesn't result in these closures that are in commuting people well mark I, don't know if you can shed any light on this, but I'll certainly talk with mark Recaro tomorrow and he's in contact with the Gracie Mansion police on a regular basis and we'll find out and get an answer for you great. Thank you. Lowell hi I, just I, want to talk about the funding and parks and the frustration that every Community Board has across New York City is when we gather funding for jobs in parks, especially we don't really see by the time to get design chairman, maybe four or five years have gone by, and this is a little long process, and especially now within times changing and the funding going down I'd like to see everyone take advantage of. The design-build Cuomo announced that New York City now on parks projects up at 1.5 can do design-build I haven't seen any come out there, but I know that design-build takes a shorter time and it's cheaper and I'd like to see with some of the smaller projects, because, like a dog one or tree planting, I, think there's six or seven people on this phone call I can design and build that. It's not that hard of a reach, but planting a tree right now is between twenty three hundred and four thousand dollars. The bids are coming in now on. An article I read I'll share what everybody, but it's an outrageous amount of money that we're paying for tree planting and for a Dogma I believe we should give design-build a shot see if it is better. It's proven to be faster. It's now legal to do, but you know thanks Cuomo and I'd like to see parks, take the initiative to do that and make it also inclusive more minority businesses and workers and women workers, not just the businesses, but the people who live in a city and represent the city be included in those projects. I do believe: design-build should be given a shot. I think we can bundle these smaller jobs each tree planting like toe tips on city-owned trees or sidewalks. We get a lot of lawsuits from them and we pay the price, the taxpayer and they're not getting done fast enough. I. Think design-build is a good option for the small and simple projects. It's throwing it out there I yeah. Let me respond I'm, not an expert on design-build. Unfortunately, the agency has used that in the past occasionally but you're right, we don't use it on a regular basis and I really want to get back to the committee chairs about this. It's understandable everybody is sort of frustrated by the length of time. I was reading, August textures memoirs when he was commissioner of parts under Mayor Lindsay, and it's a great book, and you know it's like Harry Truman said you know the new I'm going to said it's wrong, but the only thing new in the world is the history. You don't know and Heckscher wrote about the same frustration that it took too long to get capital projects done and I think he was talking about Duvall Park in the Bronx, which I know well. But a point is that a lot of the delays are it's not you're right. It doesn't take a long time to design something or say it's. The it's part of it is the restrictions that the law sets for what must be done to assure an equitable and proper product, and it's very frustrating and design-build does help shortcut that so I won't bore you with the rest of the details about the capital process. But it's a it's a good question. It's understandable, but the delays under the current system are not because it takes us too long to design something or anything like that. We have actually done a number of things to make things: go better, Commissioner silver, as advanced the timeframe, to make things go more quickly in terms of our internal approvals and the way we organize things and that's really sped things up. We've also, instead of going the Capitol full capital bid out, we've started to do more in-house work and, for example, replacing artificial turf fields where we're able to do this in some cases, and we do it in a matter of a couple of months, as opposed to like a couple of years when you have to design and build and do all these other things. So we're doing a number of things like that. We're always looking to improve and make things faster, and we have a good record in doing that, but we will look at the design-build question and I'll get back to the co-chairs I. Thank you for the question and thank you little I think this is really interesting very if we have the ability to I'd love to make sure that topic is on our September agenda, just so that we don't forget about it, and we can revisit this conversation and see if there are ways to better integrate a more streamlined system. Duly noted. Thank you. I think the last person who has this and then we'll a little bit more of a discussion on Rupert is moving first I just want to thank a lead and Rita for the very kind comments we truly appreciated. We really couldn't do anything without the collective support of the community and the Upper East Side to help with Rupert Bart I have a question for Commissioner Castro I know the parks such as beginning to open up and in this current covert environment I'm. Just wondering that, as we are looking at a forward calendar, you know we currently have planned our fall planting for Rupert Park, which is the big planting in the fall that we do I'm just wondering as far as going to provide all the necessary PPE, etc to make it a safe event for us to invite volunteers and participants to come and work in, and city parks. Well, we'll have to sit down and go over that. So you know it's a good question. We have to see what our budget is, because we have taken a hit on the budget, significant budget cut and will make do with what we can do, but I can't promise that at the moment, let's talk about this next week and see what you haven't planned, how many people etc and then I can give you a good answer. That's not fantastic Commissioner Castro! We will reach out to your office, so we can orchestrate a time to talk and need very good. I have a question for the Commissioner Castro we've been talking about the lack of pep officers that are currently available. Would it be beneficial? Would it be prudent to have the community board pass a resolution encouraging greater funding, be made available for pep officers? Well, I, don't I mean I couldn't hurt, but you know we're in a real budget situation and you know I'm sure the decisions weren't made easily I think really with Pep. It's Park enforcement I think the City Council understands the value of them and they've, and certainly the administration does and so they've been built up over the years when I ran the park enforcement Patrol, it was very small. It was like 50 you had like seven or eight officers in the borough. It's really expanded greatly over the last few years and the mayor is done a great job in helping with that and Annis has the council. So right now we took a big cut with the Ranger program or not park enforcement. But yes, I mean you know. If you want to go ahead with a resolution that can't hurt- and it's always good to hear from the community boards about what they think is important- and you never know when it comes to and saved the day, thank you for that direction. I think we should make a pretty resolution on the floor or urging the council to provide additional budgeting for the top offers at this time. Tricia. What do you think I think I want to look to the committee and see what the committee says generally I think sounds good. Is there a second oh I, see Judy and I see Rita good. Thank you any further discussion before we take a vote mark. Can you oh I'm, sorry I, see I saw Marcos hand for a second, but thank you second name. Oh okay! Thank you. If there's not any further discussion Barry, can you just clarify? Are you calling for more pep enforcement all of our parts or on Rupert Burke or no, and almost because community district a community great a number of top offices in dedicated CB 8? Oh, it's cd8 rather -. That's all we can deal with and when we told you Ben, kalos and Keith powers, particularly in brief. We had the urge the council to make additional funding available to pep officers in community district, 8 great, take a vote. Then we will presume that everybody is saying yes, unless you raise your hand and then I'm, just gonna read it aloud so that we have society everybody who's here, so Barry, Aleta, Billy, Craig, Elizabeth scale, Jack, Judy, low Marco, Rita, taka, ko-- and Trisha. Okay. Great! Thank you very much Barry. If you don't mind, I just want to spend a few more moments. We've had a lot of comments about River Park, but I think that we don't really have. We haven't really addressed or fully come to a conclusion on whether our next steps are one. And so, if you don't mind me summing up what I think our general feelings are about, this is that we've heard from Beck councilmember Kalos that there's four hundred five hundred thousand dollars but he's allocated for this space but in reality to get those big, meaningful capital changes that we need for this park. Going on beyond irrigation, but towards overall design and use we're talking about six to eight million dollars Barry, you had suggested that we form a 197 a committee to accomplish this and to start really targeting larger outreach. I would like to just make sure that nobody else has any additional thoughts or feelings on that piece to it, because what I ideally would like to see is that's come together with a proposal or with a plan for what we're gonna do next over the summer and move on from there. Yes, sure one thing: we don't need it, we don't need it 197. A per this. The fog exists. Now we need is a subcommittee and a little task force directed to put their minds together in a heart together and go out and get the funding from the council from the assembly from the Senate from everybody who wears a hat in Manhattan, including the borough president. Okay, thank you for the clarification. Barry I read I go ahead. What does this committee have to go in with other than a verbal request? You know tell us how I mean. Certainly, you know I'm not shy about going in. Look I want to know about what is expected when we go in. What do we go in with okay? As you know, the part Department will not put a pen to paper on a new design, a new plan until they have the money available. So we can't we can't prepare a design or a plan and peddle that we can do is we can sit down and get the best thoughts from the member of the community from our leaders at in the council and the and at parks, particularly from bill castro, and on to what let's get a vision going for? What we think this park could be I mean, maybe we'll do a sure, ed or something along those lines to at least have a thought that can be visualized that what your money's going to go to this. The idea that the park or exist is fabulous because a new hassle Green did not exist. It was an old heliport when we went to the to the various entities to I get funds funding for them. Here we have a park. We, the vision, is almost complete. Now we just have to flesh it out, so her so am I still moved in or no you're absolutely wrong. I would like to be on that committee. I live a question in my talk for many for many years for forty some odd years, and you know how hard we work to get the play. Street I hope the Muslim women of New York will join us because they are a very intricate part in this and I think we should have the committee if we can have the committee tonight I'm getting so tired of this years and I'm learning out of years. Well, let me let me suggest a very I want to get our thoughts on there and I. Just I just want to use my position as co-chair to just suggest that, instead of us forming another subcommittee for something that we try to see, if we can't make some actionable steps tonight to in our committee as parks to see if we can take steps forward on this, if we need a separate subcommittee or when I'm okay, but I would like to first see you if we can't I, like the I, like what you're saying so you're saying that we first come up with opportunities to get visions done on what Rupert Park can do. That's something that I think can actually work in a in a virtual setting. I think that you know that that's not something that everybody has to be there to do so. I like that idea, I like the idea of gathering together different stakeholders, speaking of which we have sub-sahara who's next on the line. So maybe Sahar can then speak to it to what her thoughts are on this, but I think that for us to say tonight that we will start to that, we will start. You know an effort to reach out to these different stakeholders and get these visioning statements in and to get them their input in I. Think that that's something that we can do so hard good, yeah I just wanted to say the same. What you're saying so share that I think it would be lovely to maybe get I can I have another call where we can maybe all come up with ideas and discuss how we can play a role, so I mean it's so lovely that you guys are saying that you will reach out to all these different. You know the borough president and the council, member he's already I mean like he's so involved. It's amazing and they're. Both amazing council members, but yes, they're sembly member. He can be the dancort, he can be there. You know the congresswoman she like you know they can play such a role and maybe allocate some money at the Rupert Park events. You know the one I remember the last of Tober events that Dan court had mentioned that he would like to be involved right. Barry I mean I, think you did exactly that. That's what propelled this exactly so having everybody put in some part of it and then I think also having maybe we can all and obviously you know the Commissioner has Troy and Mark and everybody from the parks. They can play a role about the technical detail, but we can also have the neighbors involved like an ass I'm, a neighbor, my name, I'm 78. I live very nearby. We can also have you know like a pool that can be created for rupert part where people chip in and give some resources as well, so that we do have the financial resources and I'm sure the amount that has been mentioned is not like over one year that we need to like that will need to be come up for like two years, but it's going to be, and I think that somewhere where commissioner castro can mention that over how many years does this kind of money need to be collected or like would be needed and again then, maybe having all of us on a call where we have kind of part of it in detail which parts of the quadrant how they can be worked and with various ideas. I think we can all pay at all and we would ask volunteers with less that they like to be anything like to be involved in this great, oh I, wonder, am I wonder what our very your feelings are, or others are on. Maybe trying to plan some sort of town hall on this. That's just any good, like it's just dedicated to this super Park and as a kickoff towards this. That really then allows us to invite some of those other elected officials to getting people's input and that sort of thing, my immediate reaction is you we will have a mob. I think we needed. We need to focus our thoughts on this and when I said a committee, I don't mean 15 people I mean four people, eight people, nine people tops we could do it by zoom. We had to do it by soon as a publicly, but I would I would and I certainly wouldn't make it a public meeting. I would be terrified if we were to have a public meeting. What do you think about rubra Park? We would be here from 1 6:30 meeting until the next six already mean the following day and still have nothing to show for so let us sit down step back, let's put some of our good minds together. We all have good bye, but let put them together and come up with a direction right now, where we thought we have a beginning of a plan of a plan, I'd like to speak to Commissioner. Cashews I've had chats with him about this, and he has very strong feelings about getting referred forth to the place where it has to be, and I've certainly start with him and then being the BU end and end. But they say he perhaps give us some direction as to how other parks in the city have accomplished what we are trying to do and I'd like to suggest that we get names of those folks who think they shouldn't be a part of this group within the parks committee, and we will put our heads together. We'll put our thoughts together and if it doesn't work within two months, I will know it doesn't work we'll find another four minutes a leader. Thank you. So you have a lot of pieces here and one big issue that a lot made the term a ride upon is what about the dogs and the dog park, and that would seem to be something to figure out is how much if any of the park is devoted to the dogs and I'm wondering Trisha you're at Columbia. You have an awful lot of connections up there if it's worth talking to someone from the school from the urban planning school, an outside point of view, who can who can look and maybe have some ideas that they'd be willing to share about how to get community buy-in to the idea of what ultimately is done with the dogs about the dogs, because that is so central to all of this, it just seems like and I have more of an outside because I'm not as involved in the parks on a day to day basis and then for the funding. There are a lot of buildings around a lot of businesses, say: Bar C still have the vinegar factory and I do first, Street I, don't know no gone, because maybe there's some not a private public partnership, but maybe there's some fundraising that could be done with local. Although I know the time is really hard right now, but some of them the buildings around there whose residents use the park, maybe there's something possible there, but I was just thinking it's it. There's no I know that there's nothing quite like it really close by and near it and a lot of people use it, who can't get to Carl shirts and with their dogs, or just to go and sit in, and so there are a lot of stakeholders just outside points of view and getting all those stakeholders at the table and making sure you have the right representatives. So if you can reach some kind of idea that there's a buy in to it and that's all thank you, I'm gonna, just like sahar speak, sorry, I didn't so I wanted to ask about the same thing that we have also been hearing about. The you know, partially from the dogs, dog holders owners and then, like you know ones who don't have one and you know so I was just wondering. Is it possible to start with step one just to determine what needs to be in the part, I mean. Obviously it plays a role with, like everybody, like kind of the local community's involvement. So is it possible for community board to maybe send a small form to all the neighbors, and then they fill it up and say what would they like to see in Ruppert, Park, I? Think that would also engage people because it would they would feel hey we. This is our part. We are being asked how we want it and that way, then, next step if their resources I'm like. If a you know, a fund is formed where people are pooling in their resources, they will feel heart. You know they would feel like they are involved in it and they would feel interested and also this would give an exact idea what the neighbors want right. -, there's like a majority warranted, do the majority. They don't want a dog, Iran and obviously Commissioner Castro can mention the technical aspects and play a big role here that whether it should even make sense to us but I just feel like, if weakens us, since this is something a part, is something that belongs to the to the local community, to the people to the neighbors. So what do they have to say? And for that, if a forum can you just send a simple form with getting all the details and start from there and then step two would be to get everybody involved to get the resources and Commissioner Castro can mention hey. These are the things people want in the part. Maybe we want people want from the back quadrant the North East quadrant that they want, like maybe a tennis court, or maybe they want, like you, know a something: a basketball hoop please and make it also like you know like have no green, like no grass make it all concrete so that the kids can play on it. You know people can give ideas and will also feel involved and then step two would be getting everyone in I. Just thought, maybe that would help I see you moving and then I'm gonna give Judy a chance to speak because she hasn't spoken yet I. Thank you all the comments everyone has made has a lot of value and relevance to the issues. Barry I Patricia I appreciate the fact that I think we need to now move on beyond just conceptualizing two actionable steps so I'm completely. Second, that Barry I, two hundred percent agree with you I think we need a very focused committee at this point. In order to achieve what Tricia saying have actionable steps when we did a very first event at Wingfoot Park, we invited all the elected officials and a lot of people asked us. You know volunteer group you're coming here to plant. Why are you calling these all elected officials and we felt that all the stakeholders, whether it was assembly member borough, president congresswoman, they all needed to be there, because this is we're all trying to fix a problem that affects everyone in some way at some level and I just wanted to mention that in the past, I saw her alluded to it that Dan ports, Assemblymember baru, president they've, all actually verbally told us that if we move to that in that direction, they would be supportive, so that I just wanted to put it out there. So that's at least a positive that we have in the past. We also had a lot of conversation with Commissioner Castro about the dog run issue and I. Don't want to belabor that point. He had some very valid concerns. Consideration, so I agree with Barry that we need to. You know, start there and figure out what is truly feasible before we even poll neighbors I, think what is feasible, sustainable and then actually get down to brass tacks and have you know to actually very concrete action steps that we can all work on otherwise Eunice? It's a lot of wonderful conversation. We all have our hearts in the right place, but you really want to be able to deliver to the neighbors. You know some development, some improvement in that direction. Right. Thank you. Judy hello, I asked Pam. Can you hear me my computer died so I, okay, I, have a question for Commissioner Castro and then just a comment. Commissioner Castro is it parks who is going to ultimately decide whether there is or is not going to be a global them in group, and if so, could we have that decision sooner rather than later I'm having a little trouble hearing? You is your question: could you just restate it again? Are you being parts the one to decide whether we're going to have a door run in groupid, Park or not? Is that a Parks Department decision? It is I mean we go through the community board to get their recommendation whenever people want to put in a dog run, and it works very well so I like to hear from the community board first as to whether they thinking it makes sense or not, it doesn't mean I'm going to do it if they say they want it or not, do it if they say they don't, but it's taken seriously. The thing I want to avoid is to do something that the community doesn't want and so I listen to the community. A lot about dog runs, but you know I reserve the right to go overrule it. Although I don't generally do that it doesn't it's not a wise way of proceeding, but if I feel that you know there's a reason one way or the other then I'll go that way. But so that's my answer on that. I hope. That's helpful! Yes, it is my general comment and this is based on our doing the new parks through the 197 a and from how I've seen the parks department functioned over the years. Normally, when there's planning for a new park and Commissioner Castro connect me correct me if I'm wrong, the parks department has meetings with the community one two, three, four: whatever is needed in the planning stages and then they come back and they bring a plan to us for our approval and discussion and maybe redesign etc. So I think a small committee, maybe to put some ideas together, is good, but I think we should let the parks department do their job. But what we can be doing now is asking our elected officials for money, because Steve Simon gave us a price for between six and eight million dollars to redo this park. So no matter what the design is, we kind of have a price range for what we have to start range raising. So while a small group may be talking about what they desire to see, there I think it's a community board chairs the parks chairs or the committee can put a letter together and write to all of our electives asking them to support this project, and please give funds understand that when we ask for the funds, the funds go directly to the parks department. They do not come to the Community, Board and they're designated for rupert park, and I think it's not too soon to start that we should start doing that as soon as possible, respectively and to work out the plan. I think, though I mean we can continue to discuss this judy. My reservation with us doing. That is that I don't. I don't necessarily like asking for money when I don't know it. What it's going for exactly. I can broadly say what I would like to for it to go to, but I don't know if I'm asking for money for more plantings. I don't know if I'm asking money just level the whole thing just the hardest plant. I don't know if I'm asking money for a bunch of concrete and take away all the plantings so that there's nothing for the dogs to ruin. So I kind of I sometime, I I personally think I'm more err on the side of trying to get a more comprehensive understanding of where the broader community want. What's what the broader community wants to see for this for this space in the future before I start to because I guess I, just don't see how I'm can justify saying, give me a million dollars without a more concrete proposal in place of what I know that I should go to. But that's me out what we did read ago for years mantra. Karo has been saying you can't have a job run because of the incline of the park. Now has that changed I mean if it would be impossible because of the topography of the park to have a dog run. We shouldn't really ask the public if they want one, if we know that they can have it. So that's number one and number two is that if you ask you used to have a saying in advertising that a camel is a horse designed by committee- and you know you ask a hundred people and you get a hundred and twenty-five answers and we should ask them but I think one of the things that we should do. There are parks around the city that were not designed by the parks department but were instrumental in building and I. Think that we need to do that. We have I need to do homework, I feel like they need I'm, assuming that I will be on this committee, because I don't know it's my Park that we show what we can have, but we should know definitively what we can't have because of the acute angle of the park. This is like no other Park in the city that I know of I mean I'm sure in the Bronx learned about later so mark. What do you say? I was commenting on the current structure of the park if it's sloped, it's gonna erode and if it's gonna erode the dogs are gonna increase. The speed of the erosion I mean I'm, not making any fancy claims. Yeah. Thank you, but you know so. Therefore, you we have this. So why are we? You know like saying: do you dog run? Then we don't give it to them, because you can't give it to them. You know I go along with Harry and Tricia and Judy that we really need to. We need to start we've been talking about starting for so many years and we haven't started it's a hard time to start both financially and pandemic lis, but we need to start and to start to see, I think that one of the things to do is to go around to some of the parks in Manhattan, because what I don't see going to Staten Island to look at a park, but let's go round Manhattan Battery Park has parks that would war have a European flavor. You know this park is Jack was a disaster from the beginning, so I think that we really need to go around. Take some pictures up parks and then come back and say what do we like, not even imagination? This exists? You can have this, you could take one from column a if you take one from column B, but they exist. It's just my suggestion. Hey I agree with you and I'd like to make a proposal for next steps. I'd like us to I, know Leah tell me, but if I, if we can even do this or we'll, if we can even do this, but I'd like us to have to use August in September to envision what this part can be and to solicit our community members for feedback on it, we can do it through email. We can ask them for input. We can bury to avoid a three day long meeting we can invite. We can invite people to send in their comments as like a prolonged period and then come back in September with, as Rita had said, pictures and ideas and feedback from various stakeholders and look it all together and say, and just pretty much weigh it out and see where what people have said. I think that I can't do it without the broader community's input in this, and so I would like to suggest that we use August and September to solicit people. We could get a survey out of some kinds. We could ask the Muslim volunteers from New York to reach out to their list - for whoever is around and just try the best we can to get as much community input as possible in this, not any one meeting, not in a one town hall standpoint in a prolonged way, people can send us feedback, and then we come together in September in a separate meeting led by whatever small sub committee wants to lead it, to discuss this vision and to then discuss how we go about advocating for the pieces that are most common and that kind have the most common ground. What do you all say about that and I'm? Sorry, I guess: Elita raise your hand to respond to my question if it's even feasible, thank you, I think it's feasible I think you need to get as much community input as you can so August is problematic. A lot of people -. Well, traditionally were away, but with the advent of zoom that shouldn't matter, I think if you're going to look at and I'm sorry to keep bringing this up the dogs, and if it's not part of you need to have the parameters, as Rita pointed out of what is impossible or what's not ideal, because if people are all talking about how it should be 90% a dog park and that can't be done, then you have to be able to deal with it. So maybe part of it is to see whether there is another and I don't know that there is another location for a dog run that is or a dog park. That is nearby. That becomes an all turn ative to make. Maybe rupert park workable. So you have to think I mean there were a lot of alternatives and it's best to come. I think yeah people may go away and come back with a brilliant idea or ideas, but in the meantime you need to figure out what is possible, what is impossible and what and just some different ways of looking at it for the community to be able to respond because you need you need buy-in. Obviously what is there isn't working, so those need to be I'm. Sorry I have to cut in as an emergency I have to deal with at parks, so I have to get off the phone I'll try to call back in a few minutes if I'm able to resolve it. Okay, thank you so much, commissioner. Sorry, thank you. I hope, I didn't say anything wrong, but so that's just I'm. Sorry too, sir, for taking so much time, that's just what I would suggest is to. Yes, you should have the meeting in August. There's no reason that you can't the full board doesn't meet, but there's no reason: landmarks, Main Street, like these there's, no reason that you couldn't do this so and then also it's fine to I was just suggesting that we again we take some sort of action now and through the summer, and we don't wait until September. We could. We could draft an email, create a survey do and or still it just solicit, somehow reach out to folks in at one of our glass and solicit feedback from them now on. What they think is could be done. I go ahead to I'm, sorry, I'm, sorry, I'll just finish and then stop. We did a survey as Barry knows for our small business program. We okay and we ask people for their priorities and various categories, and that's we determined our program. So that's a way to go is to have categories and then ask people within those categories what their various priorities are, and that gives you an idea of how to approach it. So I think you're good to go in August and I. Think having that information for September when everyone's all geared up again is a great idea, there's a reason. You're. The chair of the book is read minds because we do have the model the will has the Google Doc or whatever. Is he put together? So the format is there? Well, we have this. Plugin are priceless thoughts with that thought. I see it's 8:15 I say we be wrap. This up at 7:15, wasn't gonna bout an hour late, but a dollar short. In any event, let us like to move the agenda. Unless is a very serious problem. Redo you have a problem, have a question around them, which one me please. We live in very strange time. So I'd like to put out an idea. There is a parks committee in each of the community boards in the city. If we could ask them to take a picture of the parks that are in their area and send it in to us to will and so that we almost like wallpaper and do it as a process of elimination. The reason I say this is because of best transportation that we don't really want to put a lot of people on mass transportation during this time. So I, don't know how you feel about that. But at least we can get. The ball rolling is to find out what exists on the island of Manhattan I'll. Save you 12 stamps reader out of the burn. The poorest parts committee I bet has a picture of each of the parks in community district 8 and in the citywide we rather than going to 812 different boards. We just call mark and say mark get us the pictures we needed tomorrow morning, 8 o'clock question it does that also be we go on the parks website and find the parks website does have fixtures of almost every Park. Yes Oh every part that they did or what about parks that they did not do. But if they're responsive, if it's in the city's Park inventory, then they have a photograph of it, but like ruber Park, that's a start yeah! So, let's so, let's just let's do this? Can you just let us know if anybody on the committee or anybody who's at this meeting would like to be part of a small subgroup. We can. We can create that before the before August recess, Barry and I will work together on creating a survey and that will go out to the broad community asking for their thoughts on River Park and their and what they think a large redesign would look like and what it should have and what who it and how it can meet the needs of the most stakeholders will share those will and then in September we will hold both a subcommittee meeting and a parks committee meeting to have a subcommittee work on looking at those pictures that Rita have said and looking at these designs and looking at the feedback that came in and then we'll address it at our September meeting as well. Very good move the agenda if I find they interrupt and Ryland discussed the rules in Central Park, which is on the agenda, which I don't even want tell it means. Even though I am co-chair of this committee. Let us put that off for another time and let us go to mark the carrot mark. Have you any updates for us on the status of proximate community district 8, as you all are pretty much aware, we're opening everything we can at this stage of the game we have a fair number I was trying to find out before the meeting, but if there were any basketball hoops left to be put up, you know, as you may guess, there's literally thousands of basketball boards and hoops in the borough when we have like six guys putting them up so. But we got a fair number done in district 8 I think we're pretty close to being finished, because I believe Carl, Schurz, John, Jay I think Seabury was done, but if not Friday by Monday, my guess would be by the end of business on Monday, we'll pretty much have all the basketball hoops up we'll have all of the playgrounds open. There's no volleyball here very close to bocce court. You know so that said, that's in terms of the playgrounds, the in terms of the Esplanade in the near future. We're going to have to close off another section of the Esplanade completely, you know either this is all depending and what the engineers tell us that an 80 year old piece of infrastructure that hasn't been taken care of is not in the best of shape so that that's a possibility coming forward. I know the engineers are doing some surveys. There are some preliminary work. You know by consultants on some of the may be forthcoming contracts on the Esplanade. So, but you know, as we all are aware- that's expensive stuff that takes a long time, so I mean I. Think that's the biggest news is that we're trying by we I mean parks is really trying to get some of these bigger. You know more structural, more important jobs onto the plate and before they get chopped, do you clarify what piece of the Esplanade are you thinking about? You guys it would close down or shut off yeah? Well, we just we just closed off a section 76 to 77 near John, Jay yeah, so anybody's been running there and all of you was complaining complain to West. Not me please, anyway, there they're gonna, take another look at that section, because that that's really bad. You know that section so and that section wasn't actually funded in the next round of funding that we have. That was not funded at all, so you know so I, don't know what kind of time window that would be I know the Capitals been pretty good about trying to move fundings around for different emergency sections, but that's what they do. You know not what I do so I, don't I, don't know what that status is, and you know how much priority is going to be given to it. If it does happen, okay, this is I just want to say it. Barry and I know you want to move this along. We have to just talk about Central Park for a second, because I think Elizabeth Ashby was waiting to hear about Central Park, yes right, but I just wanted to say that this is extremely frustrating, because I sat in person listening to parks, talk about which was what was funded not six months ago and I said that it was bad that we didn't fund 76 to 78, Street and I said I said it and I said it even in her in our full board meeting I told our the committee and the full board meeting we need to advocate, for this is not good, that this isn't funded. This is in bad repair then, and to here and I and I do use the Esplanade, so I have seen it just disintegrate in the last three to four months and I've. Seen more that yellow tape haphazardly wrapped around our benches over there and I know exactly that. It's bad, but you know the I really urge this committee to think about ways that we can more strongly advocate for funding on this. We saw this coming. We saw this coming six months ago. It's happening now and now I just want to say, with budget cuts the way they are. It's extremely concerning to just hear that we're going close it and we don't know when that's gonna get fixed and we don't know when it's we don't know how we're gonna shift money and there's a lot of priorities. So I would urge this committee to think about ways that we can bring this to the attention of our elected officials again and those who are the decision-makers on this, because I mean I'm feel like I'm, seeing the same things over it again, except in a different light. But this can be. This is a really bad situation. It's just gonna get worse without fixing it immediately from you know, I've been doing yes mine for quite a bit and what I've noticed is that you know you can have a section that's listed as moderate, and we just that for whatever reason you know the next time the divers insert you go. Suddenly it's extreme or you can have a section that severe and it stays that way forever. And then you have another section that severe that suddenly, for whatever reason goes to you know extreme, you know. So you know we had to close that section off, that's above your community board, but we had to close off like an entire, not closed it off completely, but take a big chunk out of the runway. You know those sidewalk and bike paths up and a hundred one hundred and first, and that section was supposed to be one of the better ones it just you just can't tell I mean that's the that's. Why they're constantly sending the engineers out and the divers out the boats and there I see two hands? I, don't know if these are just left up from before Moby Nora later. Do you have anything that you want to comment on Trisha I, think I kind of just wanted. A second orderly I said: I loved you I love your idea for what to do in August and September of the only thing is I again would reiterate: we've had so many conversations with New York City Parks, where they've talked about the almost impossibility of having a dog run there. So before I would only just say before burying you figure out how to frame this survey that you might want to, you know see what is truly even doable. You know we can send all the photographs, but you might get a million iterations of what people want and I think it would be easier to have a narrow down survey where people have a focused option and what to choose what is actually also sustainable and doable, because we've had so many conversations with so many constituents and always to be told that the dog run is not a feasible option. Hmm so I just want to put it out there, but other than that. You know again thank you for keeping parse as a primary consideration of your work, and we really appreciate it as neighbors and New Yorkers I did I either. This is for more I, don't understand the basketball courts and how they're opening there are so many cases of the virus. Delaware, which is not very far away, is one of the new states. That's been shut out of New York I, don't understand, singing is a problem because people are exhaling to such a great degree and at basketball they're not going to want to wear masks. It's hot and people are sweaty Moisture effects, the transmission of the virus. I really just would like an explanation of how basketball courts are open at a time, then that this virus is surging around the country. I don't make those decisions. Basically, my understanding is that the mayor's office- and he has a coded task force on opening and closing they make those decisions, and then they talk to parks about. You know, possibility when to do what and then it goes back to the mayor's office and they decide so they decided that at phase three we could we could open the basketball court so we're opening the basketball courts. I mean it's pretty straightforward, I mean I'm, not a neurologist. No I know that, but I thought you like able to have some clues as to how it can be. It can be a safe activity. I appreciate that you're not making the decision. Yes, thank you mark unless you have other, unless you have other comments or updates, I would like to go. I know I, appreciate that, but Barry I just wanted to remind you. So the Central Park thing came up in two pieces and we can be. We can be very brief with this I. Don't honestly know if Elizabeth is still on, but Elizabeth had brought up the adherence to rules, particularly as it pertains to fights, because I spoke with a pink. Are the D-O-T commissioner who's on paternity leave, but he did respond to me and I spoke to captain bill Gallagher. The commanding officer of the Central Park precinct on those two issues and Elizabeth had and I have my report right here and I'm going to read this because that's the way it's written, Elizabeth Ashby community board member had brought up two items regarding Central Park traffic signals not being a DA accessible meaning when people new wheelchairs came up to try to push the button on the light to change the signal from goddess to stop. They could not in her fin and could not reach the button and also she also suggests that maybe get rid of those buttons altogether and use the old system where traffic stop regularly at intervals. Okay- and she also was concerned about enforcing bicycle rules both on the tabs and in the transverses. So here's what we got- we say: I referred this two items to the parks department, dear chief for traffic enforcement and the Central Park precinct 18 cog, Manhattan Diggity Commissioner replied that, although he is still unfortunately, D-O-T is being with parks and Central Park Conservancy about the operation of the loop roads, including the potential for a larger study of overall signals. Infrastructure. Khoa vat19 has interrupted those conversations, but he expects the will that they will resume later this summer, Captain William Gallagher, the Central Park precinct, called to report that, with the current increase in violent crimes and the recent shooting in Central Park there's a murder which he was in. He was on the scene when it occurred. He has had he's, has rethought - stretched thin. He will address our issues by bicycles in the park when things be more under control and he is looking forward to the attending our next person to person meeting in the pub regarding Park when he can come and bring two wood to us. His ideas on the problems today that that's pretty much what Elizabeth had to offer and those responses we have I've shared those with Elizabeth. She has at those reports. The other item I would like to bring to your attention that was mentioned earlier, that some 500 people have signed petitions to have the pool at John, Jay Park, open I'd like to suggest. While we could pass a resolution and that would be acted on by the committee- the full board next Wednesday and go out if their resolutions passed go out next week. I think if we ask the if it's a census of the board members to ask the Board Chair to write a letter to the parks department suggesting that they consider reopening the pool at John, Jay Park, we might facilitate that process. What is your opinion? Raise your hand if you have an opinion, yeah Barry, you have a couple. Members of the public I will say: Kathy is, though catherine is the one who put together the petition. So if you want fine letter, young hi everyone, this is Kate Corkery and with my little grassroots efforts of the last six days in about 25 hours, I had collected over 523 signatures from the local residents. I live on East 78th, Street I'm, a homeowner in the Cherokee building I, have lived on this block for 29 years, and I have swam at John Jay pool for the same amount of time, not only myself, but this is a neighborhood full of a lot of love to that pool. In that Park I've listened to everything that you've had to say about the equipment and the dogs and everything else and I am all for it. I can't do anything, unfortunately, about the budget being cut for the 53 pools in the city and last week, when they announced that 15 pools would be opening up just for in Manhattan. I would never take anything away from any other pool. That's been given the checklist to open up, but, as has been discussed, no one really wants to travel that far Governor Cuomo did go ahead and open up all the state pools with very strict regulations on how are they were to operate. I would assume that the city would follow the same course of action with regards to that doctors and nurses and moms and dads and policemen and park supervisors, and quite a few senior citizens signed this petition. It's this little neighborhood is very old and very young. There's a lot of moms I feel like I know all of them right now. If you go to the park every single day with their children and I, feel it very unfortunate that the parks budget was cut so much because they think more now than ever, we need our outdoor space. We need to be walking around and getting some exercise. I can hear everything that was said about the parks and how much everyone enjoys them. I just really hope that something can be done and not just for just John Jay I hope. Someone else has another grassroots effort going on at their local pool, because those pools everyone's pool I, think in the city if they live in a nice cool neighborhood wherever that is, and whatever borough I think everyone has their summer friends and it's their summer, it's fine and I think that I asked you to wrap it up. Please that's it! Thank you. So we have a lot of people looking to charming Sahar. Very briefly, please I just wanted to say. Yes, we will send out the details. I mean you can do that we'll reach out to our board and discuss this further with them. What you like your email, just to kind of support you in getting more information from the neighbors but I also had an idea that our town, the local newspaper, if you want to just mention on that in that as well, because they are also at a stakeholder right like they are also involved, then that would be another way of reaching more people in the neighbourhood. You talk about that a little bit. Are you talking about in the pool? No, nothing I'm told us. No, we moved on we're not talking about the pool. Please Jordan, hi I sent I've mentioned several you that when they put up the new pedestrian crossing signal and the controls on the east side, they positioned the giant control box so that it blocks the button I sent a will. An image. May we share it is that okay, thank you. I am now looking in order toward 5th Avenue and the box is number 7 and you can see the button, but the people who are approaching it have no idea that there's a button and in fact, when you turn right to cross the road, you have the same problem. It's ubiquitous on all of the new installations. The box is too low or it's on the wrong post. I. Don't want to do any more with this now, but I hope that some of the members of the board would be willing to explore the park. I'm happy to do it with you and see if you agree that they're hidden. Thank you. So much and I'll send that tonight to the Commissioner of DDOT, commissioner and the Conservancy and send it to Captain Gallagher. Maybe he can shoot it down with the gun. I, don't know, but we'll address that this evening I have that fight. I'll get that photo of him. Will you welcome? Judy, Schneider I was just saying I. Second, the resolution for a leader to write the letter, Thank You Craig hi since I, haven't seen the petition. I was just curious if it included any stipulations regarding social, distancing and other public health measures that are in place right now. I guess I would love to see polls reopen I'm, just a little unsure as to how it can work in terms of making sure that I know the pool gets crowded, I used to live on that block, making sure that people are able to remain safe and that tensions don't ever rise. If people are forced to wait on long lines to get in the limited space that is John, Jay Park I'll suggest Oleta that you include that in the letter she says, if we agree to that, send the letter. Thank you. Barbara, however, you muted yourself back again try that one more time: okay, yeah thanks I, kept clicking I'm, just very worried about it. I understand a leader being worried about basketball. This I can't imagine how this could be anything, but the most dangerous thing is there a plan of how to do it that you come by reservation that you only stay a few minutes that you I can't in ordinary days it's very crowded and if a limited number of pools are going to be open, people will travel to come here that will make it that much more crowded. What about the bath house? What if people need to use the bathroom we do here? The toilets are a source of kovat of danger and I. Don't know if we're asking for trouble in our area. I do convinced me my to convince you. Barbara I know better than that I. What I want to just say is that I'm, Barry and I have had many conversations about not making a statement on public health issues. We have both felt very strongly that it's not our place to urge when I mean, for example, when the playgrounds were still full closed. People told us you should you should call on the parks department to open up the playgrounds, and we said that when it comes to a matter of public health that we that we had to trust the people who were in charge and making those decisions, because we do not feel equipped to do so. This feels different and I applaud, Kate and what she's done with gathering signatures the powers that be have already decided to open up pools. They have already done so they are doing so in a way that they feel is safe. And so this is not a statement of you should do something that hasn't been done because of Public Health. This is a you are doing this in some areas we were deciding to allocate your limited budget in some ways and unfortunately our community was left out of that, and so in my mind this is not a question of public health. This is a question of equity in our community and making sure that, if that the families and individuals who use our pools have the same opportunity to do so this summer- and just this is us advocating for a piece of the pie in my in my general opinion- I wholeheartedly agree that if we were to send a letter out- and it wouldn't be a resolution because we didn't post about it because it came to us later on- if we did send a letter, it would I would absolutely encourage us to put in language or ask Aleta to put in language to make sure that all safety precautions are in place. Everything was in importance with the CDC. Everything was in importance with what the other pools are doing. So is never. This was not in my mind, at least, and from my perspective, it's not a public health matter that were taking consideration of it's just a it's a piece of the budget that we're advocating for what she said. Barbara I can't see what you're saying I can't hear what you're saying I said what you said: okay, I guess I said. As always, you have convinced me, you convinced nutrition, so I guess I, don't think we need to I, don't know if we take a vote or not to decide on the pool matter or if it's just something that Aleta is able to do, I'm, not sure if it is still on the line. I think she believed she did absolutely oh good. Let's make her do with them notice. Let's suggest that she, unless is very strong opposition among the board members I'm, going to suggest a lead off center, an email when we get done with this- that the in the sense of the board members that she write a letter using the butyl language. That Tricia did that it's equitable to consider opening John Jay Park a John J Poole rather, and can I just I. Do not the word. The word adjourn is coming to mind. I know I know, but give me two seconds here. Two minutes: I promise I just want to say to Kate that I think it's great what you've been doing and the advocacy you're doing and I think it's wonderful to have another community member join our participate in the community board process, so I hope that you'll come back and as somebody who lives and uses John Jay and come and be a regular attendant attendee at our meetings and I. Think it's wonderful that you're here I wanted to just mention one other thing, and this was something that when we talked about Central Park, it happened about a month or two ago. So it's obviously the world just spin so quickly. Now that people forget, but part of the reason why I had asked Barry to bring up rules on J was about the Amy Cooper situation in the park and adherence to the rules there and making sure that we that we knew the rules in the ramble and just general just racial justice. Things too in that Park and so Barry had dutifully confirmed with the Central Park folks that and as I'm sure, you've read in the news a million times. At this point that there are no there, no dogs are off leash in the ramble and really, if and you talk to, neighbors I- just hope that as good park advocates, you would remind everybody of the rules and try to make sure that spaces that spaces is preserved in the way it should be, and I guess I just wanted to say that I'm gonna talk to Barry about this more but as we move forward as a committee, I do would love to think about equity in all senses of the word and this committee, and what we can do with that. So I would hope that in August, as you all take some time and hopefully have some peaceful respite from the craziness that is going on everywhere- that you might also take some time to consider what that means to this committee. I know. I would certainly like to hear your thoughts on it and I think that it all comes back. I think that Rupert Park and The Esplanade and the fact that the Esplanade connects three or three or more different communities with very different populations of people that you that use it and there's a lot there. So I think that, just if you, if you might afford me sometime during up to August, to think on this and to come back, maybe we can talk about this a little deeper in September and the fall I did I took three minutes very good thing. You did that. Having been said, I would like to suggest that we adjourn this evening. I wish you all a very peaceful, happy, productive, August and we'll see you back here in September, all God willing you stay well stay safe, good night be safe.",
        "summary": "My name is Barry Schneider co-chair of the parks committee of Community Board, a this is a July meeting.\nCouncil member, just to give you a little bit of backstory, which I think you already know, but of course we were all very concerned about open space, we're so proud that you have helped champion this issue during your tenure.\nYou were still present to the Knickerbocker ta tenants, association, yes, and so we work together to make sure that ninety first was designated a place treat by the Department of Transportation, and she is pretty much her and David Rosenstein who I missed terribly Many of you, Do work together with Lisa La Jolla to make that place, treat and so Rupert has been a park that has needed a lot of work.\nWe have John Jay Park, where we've been able to secure funding with the parks and where we've opened completely new basketball courts, working with Greg Davis and the kids there, and then we also recently.\nWe just reopened a new ad, a ramp at if I believe, 82nd Street I mentioned the Carl Schurz playground and then from 99th 90th Street to 88th Street, one of the first money I ever secured 35 million dollars in my first three months in office went to that and that is actually already open.\nWe have John Jay Park a senior space that this committee did a lot of the public hearings on that we need to move forward with, and so for.\nAnd I think the board had been opposed to taking down the fences and the gates, because there are already there may already be an individual who sleeps in the park at night, and we didn't want to make it easier for people to just come.\nWe want more seating areas throughout and do we want to set up instead of having the hill as it were, having a lower level and an upper level with the youth programming up top and the passive space down below , They bring up hundreds of people to try to improve the park.\nSo anything in construction is continuing, so Carl Schurz park playground is continuing, but the John Jay, Park seating area and even the East River Esplanade project that I funded with the mayor have been a contractor, is close to being selected they're ready to do the contract award, but the city has placed a hold on any of these new construction.\nSee mark sicarios on the pole and we brought them up with Wesley, but there is a lot of vandalism and the southern part of more attention to that area, since more and more people are using it Since there's such a dearth of public state in the area and the waterfront of so beautiful here, You're talking about exercise equipment in John, Jay and one of our next project, because we've got a lot of requests for it to put exercise equipment in some form on some part of the Esplanade.\nNow that people will be exercising outdoors because I know, there's Jennifer Yes, their exercise equipment farther salad, I'm, not including East River Park, because that's a whole different ballgame, but on the Esplanade between Montgomery, Street and Brooklyn Bridge.\nLet me know that the parks department, you know, will work with sanitation and others, Something that you may have heard about in the city and that I tweeted about today is that one of the reasons I voted no is because they've been cutting random things that we didn't want them to cut.\nIt really is not the best ground to put a park in of this kind because of the slow, causes, erosion as I'm sure most people know, but I think that's the initial thing that we should do The September's doing a major planting throughout the park.\nThe community board got together and formed a 197, a plan which told the city how one wanted to use the various areas.\nLet me get together and moving on this, and let's really work on this Since this was technically questions that people had raised their hands with, regards to kind of a broader scope of parks, I think we can continue.\nYou know there are lots of water spots where there's small little areas where people can do chin-ups or whatever they want to do pull-ups, and it would.\nWhat I wanted to ask you is everyone is complaining about the conditions that you heard just a while ago and John Jay with the dog feces and with all the money and the wonderful things that were done for the other parts of the children's unit and the basketball courts.\nDon't hold me to that number, but that's roughly what it is, but so that and other people who we usually have available have not been reporting in as much as we would like, and there are some real, legitimate concerns of people who have health conditions, who you know, have difficulty coming in and need to stay home, it's very important that they take care of themselves.\nAnd I've asked them to look at locations where we are having problems because of use primarily for litter, where we found this to be true at Carl, Schurz, Park and other parks throughout the borough, where people go out because they're going nuts inside and that makes sense, they want to get out.\nWe use that it's senior equipment I want to just thank Mubeen and all the Muslim women of New York Do, an incredible job at Ruben, Park, I We only met outside and my daughter-in-law, who is not afraid of anything decided to walk the dog in the area where it's a dog area.\nI, don't know why we stood for it so long, but ed Lerner saved the day and the pooper-scooper law came into effect, And, it's still in effect, as is the park rules and regulations, They all seem to do a pretty good job of it, And. Then we empty the cans, but we can't as park workers to go in and clean up other people's dogs do, and the fact that this is happening is terrible.\nI'm glad that we have the money and the inclination, and also to moving in her Muslim group that looks after I'm, sorry, I'm, so bad at names that looks after the park and takes care of it because I know what he's talking.\nI, just I, want to talk about the funding and parks and the frustration that every Community Board has across New York City When we gather funding for jobs in parks, especially, we don't really see by the time to get design chairman.\nAnd I'd like to see with some of the smaller projects, because, like a dog one or tree planting, I, think there's six or seven people on this phone call I can design and build that.\nYou know we currently have planned our fall planting for Rupert Park, which is the big planting in the fall that we do I'm just wondering as far as going to provide all the necessary PPE, Etc to make it a safe event for us to invite volunteers and participants to come and work.\nYou want to go ahead with a resolution that can't hurt- It's always good to hear from the community boards about what they think is important- I think we should make a pretty resolution on the floor or urging the council to provide additional budgeting for the top offers at this time.\nYou know the borough president and the council, member She, like you know they can play such a role and maybe allocate some money at the Rupert Park events.\nAnd I think that, somewhere, where commissioner castro can mention that over how many years does this kind of money need to be collected or like would be needed and again then, maybe having all of us on a call where we have kind of part of it in detail which parts of the quadrant how they can be worked and with various ideas.\nAnd I'd like to suggest that we get names of those folks who think they shouldn't be a part of this group within the parks committee, and we will put our heads together.\nThe time is really hard right, now, but some of them the buildings around there whose residents use the park, maybe there's something possible there, but I was just thinking.\nI know that there's nothing quite like it really close by and near it, and a lot of people use it, who can't get to Carl shirts and with their dogs, or just to go and sit in, So there are a lot of stakeholders just outside points of view and getting all those stakeholders at the table and making sure you have the right representatives.\nIs it possible for community board to maybe send a small form to all the neighbors, and then they fill it up and say what would they like to see in Ruppert, Park, I?\nI mean we go through the community board to get their recommendation whenever people want to put in a dog run, and it works very well.\nSo I like to hear from the community board first as to whether they thinking it makes sense or not.\nIf I'm wrong, the parks department has meetings with the community one two, three, four, whatever is needed in the planning stages, So I think a small committee, maybe to put some ideas.\nThere I think it's a community board chairs, The parks, chairs or the committee can put a letter together and write to all of our electives asking them to support this project, and please give funds They do not come to the Community, Board and they're designated for rupert, park, and I.\nWhat the broader community wants to see for this for this space in the future before I start to because I guess I, just don't see how I'm can justify saying, give me a million dollars without a more concrete proposal in place of what I know that I should go to.\nI think that I can't do it without the broader community's input in this, and so I would like to suggest that we use August and September to solicit people.\nAnd, I'm, sorry to keep bringing this up the dogs, and if it's not part of you need to have the parameters, as Rita pointed out of what is impossible or what's not ideal, because if people are all talking about how it should be 90% a dog park and that can't be done, then you have to be able to deal with it.\nThere is a parks committee in each of the community boards in the city.\nWe can create that before the before August recess, Barry and I will work together on creating a survey and that will go out to the broad community asking for their thoughts on River Park and their and what they think a large redesign would look like and what it should have and what who it and how it can meet the needs of the most stakeholders will share those will and then in September we will hold both a subcommittee meeting and a parks committee meeting to have a subcommittee work on looking at those pictures that Rita have said and looking at these designs and looking at the feedback that came in Very good move the agenda, if I find they interrupt.\nAnd I'm going to read this because that's the way it's written, Elizabeth Ashby community board member had brought up two items regarding Central Park traffic signals not being a DA accessible meaning when people new wheelchairs came up to try to push the button on the light to change the signal from goddess to stop.\nOther item I would like to bring to your attention that was mentioned earlier, that some 500 people have signed petitions to have the pool at John, Jay Park, open, I'd like to suggest.\nIf you want to just mention on that in that as well, because they are also at a stakeholder right like they are also involved, then that would be another way of reaching more people in the neighbourhood.\nI think that Rupert Park and The Esplanade, and the fact that the Esplanade connects three or three or more different communities with very different populations of people that you that use it Maybe we can talk about this a little deeper in September and the fall."
    }
}