{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB2",
            "channelId": "https://www.youtube.com/channel/UCeqCi8HfzVlmLyhjJePMh9Q",
            "title": "CB2 Full Board Meeting  2020 April 28",
            "publishDate": "2020-11-16",
            "shortDescription": "",
            "lengthSeconds": "1:55:06"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB2",
            "normalizedName": "Bronx Community Board 2",
            "twitterName": "Bronx Community Board 2",
            "youtubeChannelName": "BronxCommunityBoard#2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCRfzp2GSHg6CIjALtX73JGw",
            "twitterHandle": "@2_bronx",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "hefTaf2xHLM",
            "fillerWordCount": {
                "uh": 298,
                "um": 355
            },
            "readTimeFullTranscript": "67 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "health": 24,
                "care": 21,
                "business": 19,
                "testing": 17,
                "chairman": 16,
                "food": 16,
                "manager": 15,
                "day": 15,
                "council": 14,
                "generators": 14
            },
            "wordCountSummary": {
                "health": 8,
                "help": 7,
                "food": 6,
                "mayor": 5,
                "care": 5,
                "governor": 5,
                "manager": 4,
                "boards": 4,
                "need": 4,
                "resources": 4
            },
            "fullTranscript": "Give me a text message, but if you do have an issue with your building like right now, I'm working with Miss Brown from 941,951 hoe Avenue. So they were having a huge problem there with kids hanging out in the building, not social distancing. So we went in there. I did an operation between April, 23rd and April 25th. We affected five arrests and we issued sea summonses. Now, listen, I'm not we're not going out there and hammering the citizens. You know these are kids that are in the hallways, they're playing dice and they're smoking marijuana, so I mean in the middle of this epidemic. They should be out in the hallway period. We also had complaints from a couple of different locations of bars and clubs that are open. So what these clubs are doing now is that they are they're keeping the gate down, but they're operating and they're letting people it's almost like speakeasies, it's like being back in the dark. What are the people? I'm sorry, so one of the locations actually I shut down last week was third 1302 lock there. Yet it's mexican bar. It's like right by hunts point in Lafayette right around Seneca and Bryan that area, so that was one of the locations and it was another location trying to see here now. I was on southern boulevard, I'll get you the address, but we shook those places down and we we did SLA reports. You know because, obviously we're not supposed to be functioning, we're not supposed to be using bars, but the important thing is- and this is what I told Miss Brown is that you guys reach out to me, because you know we're running on Minimum Manning right, we have about a third of the NYPD. Total is out right now with the Covid-19, so the NCOS are doing a lot to help out with patrol and answer. 911 calls as well, as you know, trying to do our NCO duties. So if you guys can be our viewers out there, if you guys see something in your building, please let me know, and the minute it's on my radar it'll get handled, it'll get taken care of. So if you guys are ready for my phone number I'll give you guys my cell phone number. That's all right: it's 914-879-9990, Serge and I'll give hold on my email address, so it's gonna be Louis L-O-u-I-s, DOT, grielmo, G-U-g, l m o two at nypd.org all right. So it's just one question: hey Bobby, anything on West Chester on those bars. No, you know what honestly a couple of my trouble spots. They shut down and they closed down. Tequila bar exit, though, which was a big problem for me. They shut down. We've been going down there. Every night I had the plain clothes guys out there. So most of the you know what it is most of these guys don't want to lose their liquor license because that's what's going to happen if I catch them operating I do an SLA report like this place on Lafayette 1302 Lafayette. This guy's gonna eventually lose his liquor license because he was operating during the pandemic and it's the governor's it's a bar, but it's connected to like a store like a bodega, so he's got no location there. I! Don't understand that. We know the guy was telling me I mean I, understand. People are frustrated right now, and people have to pay the rent, so I mean the guy's, a business owner and he's trying to feed his family and I. Understand that, but I mean the bar is closed. That's it there's no bars, you know, there's no bars or clubs open right now so and then we've had a couple of trouble spots with, if you guys walk by any stores that are shuttered and you see any kind of suspicious activity. Please feel free to call me because we've had an uptick in commercial burglaries, mostly along Westchester Avenue, there's a 99-cent store that was burglarized, 998, Westchester Avenue and what they did was they smashed the window went in there grabbed as much stuff as they could and took off. So my guys responded right away. I mean we missed them by maybe 30 seconds. If you watch the video, but that's what they're doing now, they're doing a lot of smash and grabs so, but if you guys see anything going on even stores that are not supposed to be open, you know definitely shoot me a text message or give me a call. Like I said my phone is on 24 7, okay sergeant. Thank you. So much I appreciate it. No hi guys Chief Dan, Sheridan, Battalion, Commander Third battalion the FDNY lots of the running is down since the Covid-19 hit big time. Everything is down from two just in the month of March I. Don't have April's figures yet because they're not up on the years, but you know, fires are down from 16 to 14. Non-Structurals are down from 10 to six. The big thing is the emergencies are way down, especially on the medical I guess, because of the way they're segmenting, the calls. So for us we're not responding to the segment twos and the threes just the ones and I've seen a good decline in the we call it a 1037 code, one which is the Covid-19 fatalities. So we went down from 206 to 102, on the regular running and total running, for all. Emergencies is down from 372 to 217. talk about manpower. We had a. We had. Our medical leave rate was up to about 19, it's slowly coming back down again and but you don't have to worry, because we have what we call minimum manning. So we have to be staffed at a certain level regardless. So we're using what we call an AB abcd chart, so we're working straight 24's in that way, a b c d and then it repeats itself I think we're going back to our regular schedule. Maybe may 10th I heard so, but you never have to worry about companies and the firepoint being out of service, because we've also activated in Longwood and hunts point. We call them rrvs, you might see them around. They look like utility trucks and the firehouse on Prospect. 42 truck has an rrv 47 truck as an rv, so you might see them responding to medical calls as well. Just a question for the sergeant. He said about 1302 Lafayette. If you find that these social clubs are operating illegally, you can let us know in a battalion and we'll I. Don't think we have the task force anymore, but I can notify the marshals or fire prevention. If there's any kind of fire prevention issues, my email is, you could use my personal one, it's just Daniel DOT Sheridan, it's my name Daniel.Sheridan at Fdny.Nyc.Gov and my cell phone is 646-734-0524 and if you have any fire prevention concerns any kind of issues that you need to be dealt with, feel free to reach me anytime. I, don't know if sanitation is here. I got one of the issues that I'd like to deal with sanitation. The residents on Seneca Avenue are abusing our dumpster to a point where now it's becoming a health hazard, we called 311 last night, the captain of the engine, and they spoke to about possibly getting some surveillance from the sanitation police, because you know it's bringing rats into the you know into the area and the next thing you know there'll be in the firehouse. So, chief, what's the address on Seneca we're 1226 Seneca? What's 12, I'm sorry, 12:25 Seneca? Okay, so that's your office right! Sorry, that's your house right! That's the address to the house there! That's the firehouse yeah. What and that's the address where the this is happening. Yeah the dumpster is in front of the firehouse. Okay, all right I'll follow up with conversations it's really getting out of control, I mean it's just been and I even think, there's some commercial people using it as well. So it's like it's flowing into the street now and it's a it's unsightly and it's drawing rats, so we really need to be addressed. Okay, thank you. Yes, go! It's good, seeing you you're a friend of ours. You've been here for quite some time. Please keep up the good work and stay safe. Sir. Thank you. Do you need me to stay up late, it's up to you. If you want to it's fine yeah, there's anything on this meeting. Brandon Sorry! Listen! If please, I'm muting everyone! If you're gonna, unmute yourself, I'm gonna, kindly put you in the lobby, so there's a reason why you're muted, because everyone echo come in the background chief you're, more than welcome to stay on. Thank you. So much okay, thank you. All right. Take care all right, real, quick, hello, all right. So if anybody any other presentation speaking, they should put all their information or email a number in the chat. So everybody has it and also there's a raised hand option. If someone needs to interrupt, they can press that and they can interrupt if they need to all right. Okay, thank you. Danielle all right, we're now going into roll call and what I am going to do is I am going to open it up for everyone and I will kindly like if people can just remain quiet and then let Yvonne do her roll call, and once we do our roll call, I'll mute everyone and we can move on the agenda. Okay, is that I hope everyone understands that, so I'm gonna mute everyone Yvonne! You can start whenever you're ready, didn't work out right. I got him so Ron here, I see a lot of people. I see a lot of people on the participants but I. You know I think we have to do a formal way. Okay, cool! Will they unmute themselves when they hear their names once just go down the list? If you want to acknowledge themselves, you should click on this and then move everyone back on. Okay, awesome, all right and she responded all right. That's not working guys, I'm sorry! We will come back to the roll call. I'm gonna me and Yvonne are gonna, just chat right now and just see whose names will come up and we'll do it. Please keep yourself muted, like I said if you're gonna, unmute yourself and I am going to just put you in the lobby, so please stay muted, I'm trying to be nice and give people their own option. But if you leave it up to me, I'm just going to view everybody and take everyone's cameras off. Let's just go back to the agenda, and now we are up to the adoption of the minutes. So I'm going to put Bobby on to explain what we're doing with the minutes: Mr child so good evening, everybody and I. Thank you for your attempts to try and stay on and be heard. It's a little rough, but we wanted to make sure we had some kind of a meeting today and I hope. Everybody's family is healthy and safe, and you know let's continue practicing what the mayor has stated as it pertains to the minutes. What we will do is we will con from what I understand from Ralph everything that is being said tonight is being recorded and we can then download it and have it ready for everybody when business opens up for the community wards. It's my understanding from the from what I've understood from the mayor's office. It might be in June, and so and that's a maybe. So if that's the case we you know, we will then have this month's meeting for you guys to adopt and next month's meeting to adopt right now. There are no minutes to adopt other than the February meetings which have not been adopted, and so I know you guys have not received it and don't have any don't have any minutes to adopt, but what I will do is suspend them the action of the minutes until we are all present for it go ahead. Ralph we're up to the chairman's report all right on chairman's report. I think the councilman is on by the way Ralph I have the council member Salamanca and I have state Senator Sepulveda. So if you want, let's have them on first, let's have them on first, because I know that they they're doing some other stuff. Okay, oh good evening. Everyone first I want to I really want to acknowledge and thank your district manager, Ralph Acevedo and your chair, Bobby Crespo, because not all community boards are doing what you guys doing so really I want to. Thank you guys. You know to ensuring that these meetings continue just to give you some information. I'm gonna try to do this in three to five minutes. My office is closed. Like many of you know, I mean we are working from home or working remotely I closed my office on March 12th. It was important for me to ensure that my staff's safety and my constituent safety was was priority. To me. As you know, the city of New, York or the state of New York is on pause. The governor announced that we'll be on pause to I believe sometime in mid-may, but you know hearing from his press conferences. It looks like they will be. Extending it. I know that the board is working and communicating with all of your board members, but, to be quite frank, I, don't see community boards meeting again to September. Just keep that in mind. You know in terms of how you can operate, but whatever support you need from me, I am here. You know, I am homegrown. This is my board and I will do whatever I can to assist you just to give you some information. As to some of the work that my office is doing. As some of you know, we have been going around to different parts of the district. Doing full distributions. I really gotta, give a big shout out to the produce market for really stepping up and helping out giving food to those individuals that are in need. I have not had an event in community board. Two I've only had three events: I will be coming to community board too I. Actually, I'm gonna do a few events in community board too. So please be patient these putting together. These events take a lot of work. You know we need to I need to work with the different markets and the different businesses to ensure that we're getting the appropriate supplies for the community. But when I do come to community board too, you will be really happy with what's happening for those of you that live in the Huntsman community. As you know, the hunts point Rec center is being used as a full distribution center. There was a big hiccup from the mayor's team where they took parking on Spotford Avenue from Tiffany to Manida, and there was about 75 parking spots that were lost and it made absolutely no sense for those parking spots to be lost and again this is a failure from the mayor's office, because you know they never communicate. They just make decisions as if they know what's happening on the ground here in the south Bronx. It took me about two weeks to get this rectified, but we were able to get the line moved from spafford over to Lafayette side and, as a result, we were able to get the 75 parking spots back to the residence and hunts point on the spot for side. What we did was that we we moved the line over to Lafayette and it turns on Tiffany Street, which I was okay, was giving up those parking spots because, to be honest, there's really not a lot of residential buildings or residential or parking in that area and, as we all know, the banknote building is closed. So, as a result, we've converted mining street a one-way going towards Spaffa street. As we all know, Monitor street was a one-way going towards Lafayette and it has been a smooth transition, and so I'm extremely happy with that, and also as a result of moving that line, we've kind of made a deterrent for prostitution. We all know that process. We have a prostitution issue on the corner of Lafayette and Tiffany Street and that has calmed down because we've we've moved that line over there. I'm sorry, I'm just trying to read my notes here to to give you guys so the community board reappointment applications have been out for those of you that have not filled out your application. I recommend you reach out to Tom Lecania or your district manager, because if you did not reapply chances are you're not going to get reappointed for those board. Members that have have more than three absences in a row. I recommend that you reach out to your district manager, your chairperson, because attendance is important. This is you know your attendance is quorum and that's how we move business and, if you're, not attending meetings. You know, therefore, you know getting forum is a difficult thing and, as a result, you know business can not be moved and there's many people in the community who want to join the community board and if you can't make it to meetings and then we're going to fill those slots with individuals that actually want to come and attend meetings in terms of what we're doing in the city council. Last week we held our first stated meeting online on Zoom, which was really exciting, and you know what was really exciting. Also was that all 50 council members showed up you know, and and so you know, we there's some pieces of legislation that are being proposed. One of them is basically doubling the the annual Audi rate for businesses that have over a hundred employees. I, don't know if I'm supportive of that, because to be quite frank, businesses are struggling and we have many businesses in our community who are doing the right thing paying if they have over 100 employees they're paying their employees. You know they're paying their employees appropriate salaries with benefits, and so I want to ensure that whatever legislation we pass on, the council we get to, you know, keep and save jobs, and so I, I'm not too sure where I'm at with this bill, that's being proposed and at the last stated meeting I also propose the bill whenever the parks are open for those of you that have children such as me and then those unexpected parents. We all know that when you have to change your child, a changing station is important and if you've ever gone to a parks bathroom, they do not have changing stations, and so I have a bill that basically requires parks department to install changing stations in in all of the the parked bathrooms, and with that you know, I really don't want to continue going on and know that you have your business, but I just want to tell you I want to give you words of encouragement. I am so proud of Community Board too. The work that you guys do to being able to hold business. You know as needed and having this online session is I'm just really proud of you and I want to congratulate you all on the work that you're doing so Congrats to you, Mr, chairman and Congrats, to you, Mr, District manager, and with that I would take. Maybe two or three questions. If you allow me to, but before we take any questions, Mr Councilman, Councilman, Salamanca I, want to thank you on behalf of the board for the help on the distribution center, and it was a big fight. It was a two-day fight that we all had with the city. It was good for the city to realize that what we were saying was the safer and faster way and I want to thank Captain Sherbling, also who worked with us on that issue, but most of all you who brought the commissioner from D.O.T the downtown commissioner Commissioner Pollock to come down and speak with us, and it's like that. We can then explain what our objections were: yeah and Mr Chairman. Thank you for your words and I also want to give I want to thank everyone. I reached out. As many of you know, my dad passed away in the beginning of the month of April from the Covid-19 disease. You know my dad. You know for the last couple of years he was suffering from advanced dementia and my dad was being taken care of at Saint, Vincent, De Paul. To be quite frank and saying, Mrs Depaul did an extraordinary job in taking care of my dad, ensuring that he had 24-hour care, ensuring that my dad was comfortable and I got to give a big shout out to Julia Cruz Julia. Thank you and your team for all the work that you guys did. I mean it means the world to me, and you know I, I'm gonna get emotional here. My dad went to Lincoln Hospital when they couldn't. You know when, when the Covid-19 hit, because he needed medical care and Lincoln Hospital as well did an extraordinary job. I know you know being born and raised in the south Bronx. You know people talk a lot about Lincoln Hospital, but Lincoln Hospital has been a mecca in our community. You know they take care of us and they can hospital took care of my dad and I just want to really thank everyone for your condolences for your warm remarks for your messages but, most importantly to you, Julian saying Mrs Depaul, you know what you did for my family means the world to me and I. Thank you, I, don't know if Julia want to say something can I just say something. Absolutely yes, Ralph it was my pleasure and I am so glad I got to know better and your dad better, so I. Thank you for trusting us. Thank you, okay. So with that, remember that please continue to get done and you know that you have a strong support. Please mute yourself back next up. We have Senator Smith, Mr District manager very quickly before I just want to let all the board members know. I know you see me on social media, I'm you know I've done this is my today was my third event that I went I did a full distribution. I am you know I'm trying to get the kinks in and out to figure out how to make this work. I promise community board too. I'm going to do something big, it's going to be big, and so I asked you to please be patient with me. You know we will get the word out, but we're going to you know, drop the mic. You know just to say community board, so we're going to do something. Big for you guys, so please just be patient with me. I'm working on it. Okay, god bless you all so much council member. Thank you. Take care senator hi good evening. Everyone again I also want to thank you, Bobby and you Ralph, and all the board members for this meeting and for the work that you continue to do it's extraordinary the kind of work that all of you are doing and in the community like ours that need as much help as possible to have each and every one of you do and participate and contribute. The way you are is a testament to the community that we represent, so I want to thank each and every one of you and hopefully one day. I can go and embrace each and every one of you as a show of thank you, some of the things that we're doing well. Most of us have had close to our have closed our district offices because of the Corona crisis, Corona Covid-19 crisis, but we are doing a lot of work with the community. My office fields about 250 calls every single day helping people in the community. Most of the things that we're working on right now is on helping people get tested, delivering or getting food for people helping people with evictions, especially unscrupulous landlords that are trying to exploit tenants. In this situation. Now we have been working with the world central kitchen we've given out about seven thousand meals working with some of my other colleagues, including sunroom and Michael Blake. We've given out about seven thousand meals per week, something we're gonna continue to do. I'm working with East Eastside House at Mitchell, Houses Community center from 10 to 12 on Wednesday and Milba Community center from one to three they're going to be giving out a lot of food for people who are in need, so I urge you all to make it there as soon as possible, because sometimes when we open up these, these pantries the food goes quickly, and so anyone that you know that needs help can always reach out as a backup in case. Anyone needs help remember that the schools are giving grab-and-go meals and the senior centers are giving them out and if you need to know which senior center is closest to you or you can call 311 another area where we are providing a lot of help is with domestic violence issues. Again, you can call our office it's a confidential. We don't divulge any information, we protect the confidentiality, but there's been a an uptick on domestic violence issues in our homes, and we can see why, if you need help, but you can't get to my office for any reason, you can call 311 and they'll help you same with people that are in need of mental health issue assistance, 311 or you can call our office and we'll connect you with providers. If you know anyone that's having symptoms and want to know if there are symptoms that may be related to the Covid-19, they can call my office and we'll connect you or help connect you to a medical, professional from health and hospitals corporation. You know that the Bronx has the highest percentage of positive results when people get tested for Covid-19, but unfortunately we're being shortchanged, because we have this the lowest number of tests done in the entire city, even though our people are suffering at a greater rate. Latinos are suffering at 34 infection rate african Americans at 28, again we're not getting our fair share, so I've been raised in hell with the mayor's office and with the governor's office to secure our testing sites. The last one we had is with NYCHA with a group called our ready responders. They started at Jackson, Houses and they're, going knocking door to most of the residents that want to test, because not every resident wants one. Surprisingly enough and getting you tested right there, they will have telemedicine people available to give you information on the spot, and if anybody tests positive, there will be medical help and all of this the important thing is free of cost. Now the objective is to get this to all of the nitro developments that we can and I'm working with the governor's office and other electives to make sure that we can bring this program throughout the entire nitro development and then get locations so that the testing which is critical for us to go back to a relatively normal life. The testing is critical and I know there's been conflicting information. Certainly the president of the United States has created a chaos, but please keep in mind that until we get the amount of testing that's needed, we should not stop taking the precautionary measures that will help to stop the spread of this virus. The this New York State Senate. We had a conference last week and we have determined that clearly we have to go back into session to do the people's work. One of the major issues that we're going to be tackling is revenue because the governor has refused to tax those that are extremely wealthy in this country and we are proposing four taxes that help us cut the deficit and provide funding for programs like like medical care and schools, but medical care, very importantly, because there is a proposal to cut Medicaid something that I find completely insane under the conditions, especially in our communities that, unfortunately, despite a lot of the work of our leaders, we still last in terms of health care indicators, so we're raising hell with the governor to make sure that the Bronx, especially these areas in the Bronx, where you have a lot of health issues, do not get the shoulder under the stick on housing. Many people are concerned about rent and people that have homes that are less than three owners. Three or less owners are concerned about mortgages. As a result of that, the leader of the state, Senate Andrew, Stewart Cousin, has created a working group to essentially tackle with legislation, funding or otherwise the issue of rent and mortgages. Now, because, prior to me, being elected, official I was primarily a housing lawyer with 28 years of experience. She asked me to serve on this committee so as I. Do that I'm going to do it with that in mind that the people that I represent, especially in the south Bronx, are suffering. Many of them are going to need assistance with rent, but also individuals that that are trying to reach or have reached the american dream and have a one to two to three family home that need help with things like paying the property taxes and paying the emergency they're, also taking into consideration and their needs. My office number is 718,991. 3161 I urge anyone who needs assistance to call us I have a 16 member staff that have been working diligently every single day, including weekends, to help the community. You can also follow us on social media. If you have any questions or needs, please feel free to give us a call, or you can call the board and maybe Ralph or Bob. You can connect you with us, either way we're here to serve you, and we know that the needs of the community have and I will be there 100 percent to help you in any way that I possibly can. Thank you all stay safe and God bless you all. Thank you. So much senator please be safe and please continue the good work. Mr Crapman before we get on with the chairman's report. I just want to acknowledge that we have the director of community boards with us, Tom Leukenia I, don't know if Tom wants to say anything or maybe give the borough president's report, maybe Alexa will do it, but I just want to afford Tom the opportunity now if he does want to say a few words huh. Okay, moving on Mr chairman I, just also want to acknowledge also that the secretary and I did a roll call. We presently have a minimum of 21 board members, so Quorum is established and we can go on to the chairman's report now. Thank you and thanks Cynthia and Danielle for doing that. It's good to know that everybody is taking their positions. Quite how should I say being responsible for their positions as board members? My me, my report's going to be very short. You already heard about the meeting that we had concerning the the distribution center at the youth, the community youth center up on spotford from the councilman, but I also had another meeting with the borough president on February I mean April April 18th and on the meeting was department of Health SBS, the small business Services Boedc Department of Education and Department of Health I. Don't know if everybody knows that the lunches that are being picked up at the distribution centers does not include the senior centers but they're having that done separately and they have their listing of the senior centers that are going, that they have their own dropbox being done to the senior centers. However, my question to DOH on that issue was how about the seniors that do not live in a senior citizens building. So what they had stated that we need to do is that if we know any seniors that do not live in these buildings, so call 311 and they will connect them and they get registered, and then they will start having the lunches delivered to them. I, don't know if you guys have that information, but it's if you know of any seniors that need this service that needs food to be delivered. The best thing that I could tell you is to go call 311 and just let them know that they want to be registered for the senior citizens delivery program, and then they will connect them to that. To that side, I also asked Department of Homeland services about our drop-in center for the homeless, and they us DHS, has stated that they removed the planks that were out on the streets covering the building. I asked them: what are they doing for any of the additional drop-ins that the city is trying to get people to go into the drop-in centers and they did not have a total answer other than they're working on it? I know that those that are homeless and are coming up positive on the Covid-19 they're, putting them in hotels and so I asked them to get back to us on it. They assured me that they will- and there was also with the small Business administration. I was told that there's a listing of sixteen hundred workers that they're looking for and they should be calling 311 and ask for the SBS line and say that they want a listing of the jobs to make sure we can have it they're. Looking for for people to do, I, guess some light construction and there's about 150 employers that are on that list that are looking for people. So I'm asking you guys that if you know anybody, that's looking for a job, that's presently right now, still waiting for the unemployment check that they should start go to SBS and ask go to the 311, ask for SBS and look for the and ask them to let you want to register for the jobs that Fbs is promoting. Presently right now from the Department of education, they told me that they have 11 sites. They're they've dropped off on a daily basis, approximately eight thousand meals and there's still in that they that there's approximately 250 tablets that they still have that if you call 311 and go to d-o-e and register yourself or a child or family registers themselves, that they will probably get the tablets. According to the mayor this morning, he stated that that's what was going to be done in the next couple of weeks, so we have to make sure that we stay on top of it. We have three centers in health and hospitals corporation that have they're doing testing, which is north central belvis and Jacoby they're doing testing from what as it pertains to HHC. However, if you register with yourself with departmental health, there's two more sites, I know of only one which is at the Bay Plaza Center. Anybody that's got any kind of immune disease or have any other kind of problems like asthma, diabetes, high blood pressure should be registering themselves and they'll register you and give you an appointment. It's like that. You can go to the Bay. Chester asks for the bachelor site and you can go there and get tested for that, trying to figure out any of my other notes here, but basically that's my report. Also, one other thing we will be I am going to nominate three people for the nomination committee, which is Jesse Harris, Roland, Ronan, Lopez and Stephanie Cordero who's, a new board member. Those will be the three member committee member for the nominating committee. Anybody that wishes to be interviewed by them. We will set up the same way. We're setting up this particular manner. Of that we're having a meeting Ralph will do the same thing for those three plus anybody else. That wishes to be interviewed for the any executive board positions which is the chair first vice chair. Second, vice chair secretary and treasurer, you have to make an appointment. We want to try I'm going to be sitting down with all three of them to see when they have their dates. Open so like that, then Ralph can make all the arrangements to have this happen, but you gotta send you have to let us know, let Ralph know through writing. If you're interested- and if you are then please forward your resume so like that the executive, this nominating committee can can can proceed with the interviews. Is there any questions on this particular issue? I believe that's difficult. A few questions questions here. So no one has the hand raised, but I think the same question has stated Lewis had stated he wanted to talk about this Lewis Marrero yeah Louis. Yes, I'm trying to work with this. How are you how's everybody good? Thank you. Louis I understand that you wanted to ask something about. This. I was just impressing my concern of what's going on with the Corona or Covid-19 on 19 and to make elections. So I was going to place a motion to see if we couldn't hold the election until September when we all come back because even like Salamanca said that there's a possibility that we're not coming back until September, so I think it's is. You know it's clear that this election should be hauled until then and who knows in September we have to make an addition motion, but for now I'm just you know making a motion to hold that election until September because of the Covid-19 and also because we all need to be present, and anyway we have to sign the ballot. So there's no way, we can do anything right now. Thank you, Lewis I, understand from my email, my contacts here that Jesse wanted to say something also Jesse Harris do. Are you guys hearing me? Yes, sir? Okay I would second that motion because I think it's kind of ridiculous to try to do it under these conditions, and you know at this time rushing into anything. It's going to be very difficult for me for us to set up the appointments, review, people so I think we should I. Second, that motion. Thank you Jesse. So there's a motion made duty made in seconds all those in favor say: is there any discussion hold on so I'm going to have to open it up? Oh yeah, I forgot, I, didn't have five people board members, so we're gonna have to open this up, so I'm gonna open it up, and it's only for board members. Basically there for the discussion period. Yes get it clear. Oh god, Monique do you have your hands up neat! It's Monique I was actually gonna piggyback off of Jesse. If that is a possibility, you know so that we could come together and do that because, if possible, the duties of each person is it in the bylaws so that we could read it. You know in detail before we jump into that. Every position is in the by-laws and I believe that you did get it when we had a meeting. I got it. Okay, I forgot what page it's on, but you could it's in there: okay, it's either the elections of the election of the board. Okay, thank you. Mr chair can I say something else. Yes, I. Just to make sure that everybody has it I just wrote the motion on the chat, so everybody has the motion written. Thank you. Oh you're. Welcome, but before I go any other questions. No, we have a question from Edwin Martinez. When did applications of the nominating committee go out, never got the application. There was no application, the nominating committee, as per the by-laws selected by the chairman, so we heard the motion it was. Second, we had the discussion and I opened it up. If there were any objections from board members. This is board business. So we're only entertaining the board right now. Board members and Mr chairman I, heard no one object. We heard two people in discussion in favor with the motion and the second of it is rolling on I, don't know if rolling his arm, because he might be one of the call-ins and I'll open it back up. I just want to make sure that they all agree, but I just want to announce it to everybody. I'll give them all a call just to make sure we're pushing the nomination committee is selected, but we're doing the nominations in September. Is that the motivation? Yes Sir? So the secretary this is being recorded? The secretary has that and we'll follow up with that. So we do have a voting item. All we need is a call yeah. We have the quorum. So, okay, is that the end of your report Mr chairman yeah, but we need a vote. Ralph well, Bobby, I'm going to open it back up and for board members, but no wait. A minute. I want Yvonne to go line by line on each member Mr chairman. We can not do that. It is impossible to do I'm sorry. We can try it. We can try, it I'll, try it, but just bear with me or just open it up. So anybody that's in objection. You know make them state their that they're objecting to it. Well, that's what I did I'll open it back up if there are any board members that are objecting, let them state their peace, hello, okay whatsoever. Okay, then we could proceed. That was the ending of my presentation, great, so we're going into the district manager's report now I'll be as quick as possible, because I have two presentations from two agencies. Under my report. It's good to more or less make contact with everyone. You know, under this circumstances and it's good to a way for us to communicate and conduct business. I hope everyone that has emails is receiving. My reports there's a lot of misleading information and a lot of information that changes minute by minute, but what I send out is official from the mayor's office and from the governor's office and by any means, if anyone has any questions or need resources, please reach out to me. I greatly appreciate that, and with that being said, I want to first open it up to the Department of Health and I know that we have Erica on the line: Erica Peralta daunting, Erica you're. Still there hi rob yeah. I'm still here. Can everybody hear me? Yes, where everyone can hear you and I'm hoping you have a health department person, I'm going to open it up for them. Also, so the floor is yours: Erica, okay, so I want to first. My name is Erica Polissen Downing, I'm from the New York City Department of Health I handle so I. The blogs go back to what was announced early in regards I. Believe it was the chair that announced you know food for seniors. That is not directly the Department of Health that would be through Vista. We do assist, you know with you know, with the system or sister agencies. Anything related to Covid-19 nursing homes are regulated through the state, not necessarily the new Department of Health, but the the program that was spoken about is through Victor I. Believe Jose can provide additional information regarding that. If anybody has any questions regarding that, you can always email me and I can connect you to Josue. He is the representative for the bronze four dictator. Now I'm going to go ahead and get started with a coronavirus update, so I'm going to start off with a little bit of the numbers, the reporting that we have as of today and then I'll go through my talking points. If anybody has any specific questions or any questions that they think about afterwards, they can always feel free to reach out to me Ralph. You can share my contact information because I am only on the phone, but it my email can be shared and I can definitely respond via email. As so, globally, there are more than 300 million reported cases of coronavirus. This is as of today at 11. In the morning, New York state has 131,507 reported coronavirus cases, New York City has a hundred and fifty six thousand one hundred reported cases. As of yesterday at this Pm for New York City, there has been a confirmed eleven thousand seven hundred and eighty seven hundred and eight confirmed deaths and five thousand two hundred and twenty probable effects of Corona virus a little bit of what New York the Department of Health is working on is, as we all know, coronavirus is a community transmitted. So that's why we're asking all New Yorkers to stay home? As we all know, essential services are still operating and the central staff are still operating. We do ask essential staff and health care workers to wear masks and again, if any constituents or anyone in general feel sick. We definitely ask you: everybody should be staying home, but if you are feeling sick, you should definitely self question yourself and stay home in the event that you are feeling more sick as the days program for you three to four days. We definitely ask you to reach out to your health care provider. What this means is, if you don't have a health care provider, we ask you to call 311. We are currently working with Hmh, in which we assist individuals to get a health care provider in their area. Your health care provider will be able to determine what are the next steps for you I know recently. The mayor and the governor also announced that there is self swap testing. I do know that this created a little bit of confusion, because constituents believe that they can either order a kit, a self-swapping kit. That is not the case. The city has implemented a self-slaving test which allows patients to administer samples themselves at a testing site. So I think that's what got lost in interpretation. It is that a testing set is not a kit that you can order at home or purchased. And again these self swabbing testings are done supervised by a metal, a healthcare professional okay. So this is a safer and faster way to test for Covid-19. It increases our capacity. Currently we were doing 15 tests per hour, but would be this new initiative of the self swapping test that will be in place. Hopefully, by the end of the week, it should increase up to 20 tests per hour. The self farming test will be available at NYC health and hospitals testing sites by the end of this week. Some of the things that we are also you know informing the constituents- and many of you already know- is that face covering and social resistance being. Only workers must wear face recovery when they need to be outside of their home and then that they may not be able to maintain a 60 distinctional social distancing. As we all know, this is an executive order that the governor issued children less than two years old of age should not wear face coverings, people with breathing problems or another health issue that makes them unable to tolerate a face covering do not need to wear one. But again, if you have an underlying health condition, we definitely try to ask you to stay home as much as possible. What does the face cover? You include a lot of people think that it is a mask. It doesn't necessarily need to be a mask. It didn't include a secure paper or cloth or a bandana or scarf that covers your mouth and nails. Essential workers must wear face coverings when they are work or interacting with customers in the public. Employers must supply these space coverings at the at their expense. Again. This is also issued in the governor's order. So, as we all know, we are in a in an applause order that pause or is in effect. As of now, the the false order is only 15, but, like the council members said it may be extended, as once we have that information we'll definitely inform everyone. Community boards and elected officials, as we all know, New York City parks, including darts dog parks, are closed. All none non-essential workers are directed to work from home. Again, this doesn't mean that we don't have social services operating, which are grocery stores, gas stations, larger Mass banks, mass transit, etc. One thing that I do want to bring up is that we're actually I believe that NYPD was also on this call if you are receiving any complaints regarding individuals, not following the social distancing rule. We want to know about this. Specifically, the supermarket is not directly inspected by us, but we're working on creating a list to ensure there are any specific areas that need outreach more in regards to our social business team policy and our faith, everything we want to know so, if the board or constituents, or even you know the elected officials offices that are receiving any complaints regarding specific locations, please let me know you just shoot me an email or reach out to me or, via my work style, I'll provide my work, so I just provided through Ralph, but I can always provide it as well and then a little bit of more information. We did hear some questions in regards to health insurance. You know, New York state is helping tourists friends with state. If anybody's interested in applying through for health insurance, it has been expended until May 15th. You know you could go through New York state of health. If you need the link or any information, you could definitely reach out to me as well and addressing another question is that we have recently in our website public publish the data regarding referrals in general. There are some zip codes that have been affected by Covis integrator rate compared to others again. These are communities that have been have had a severe disparities throughout the years, but we are aware we're currently working on creating initiatives and outreach strategies for these specific communities. We're working with our sister agencies. We have a digital media campaign that we're also working on the city is establishing a fair recovery task force. What does that mean? That means that we're trying to engage communities that have been mostly impacted by club 1919, identifying unique needs of these communities connecting with community-based organizations, elected officials or social workers working with city agencies and officials to address the narrow disparities that we're seeing. So we are aware and we're trying I'm currently trying to work on assisting these communities that have been the most affected by Covid-19 and some of the social support that we're offering as I and, as you know, I won't repeat a lot of what the council member did state, but something else that the health department is working on is with this pandemic. It has caused a lot of stress a lot of anxiety, a lot of depression and we are aware that it can be difficult and it's a hardship. Many of us have lost very close friends, family members, so we are also advertising our Nlsb. Well Hotline. You can chat, you can call. The number is 888-692-9355 emotional support hotline they're available from 8 in the morning to 10 pm 7 days a week. That number is as 1-844-863-9314 and that's it for health. If anybody has any specific questions, please feel free to. Let me know either now or via email. Thank you. There will a few questions. I will kindly ask people to just email me or contact the office either Danielle or Cynthia going forward regarding any questions just for the not only for the sake of time, but it's rather difficult to do it on this. But I really appreciate. If anyone has questions I kindly ask to raise your hand, that's the only way I'm going to identify you. If you start unmuting yourself, I'm going to mute you back and then I'm going to kick you out of the room all right. It's already said that we're trying to maintain some type of order here so there's a way of raising your hand. Ah Lewis raised his hand. Thank you Lewis, yes, I do yes. I just would like to know I know the city is gathering data and I, and every year I get data from New York City in New York state from the whole world from the United States. What I really would like to know if the DOH is gathering data from the community board too or is not from the community board by community boards, if not by zip codes, because if people are getting infected in the in their communities, it would be nice where these people to know where these people live and, if mostly let's say, come from 10459. So now we know that it's an issue in 105.9 but do does DOH gathering that data. That's my question, hi Lewis. So thank you for that question and you are definitely not the first one to ask in regards to specific districts by council districts, for example. We are aware that some community boards do share a certain zip code at this moment. In time we're working on collecting this data, but we don't have those numbers out it once those once we have that information, we gather it and we have it available. I will definitely shoot it out to all the community boards and elected officials, but at this moment in time we do not have that data available perfect. Once you get Erica you're forwarded to me, I can forward it to Lewis who's. The chair of our health committee, absolutely great question Bruce. Thank you. Erica I really appreciate your time. Please stay safe, stay in touch and looking forward to seeing you at the next district service cabinet meeting. Thank you. So much and again, if anybody has questions, please share my contact. Information and I'll be happy to answer everyone's questions. Thank you and have a good night and stay safe. Everyone great! Thank you! Erica! Next up we have EDC we're gonna, give us a quick presentation about the general leaders. This is part of the hunts point resiliency project we've been working on for more than five years and they're about to start installing the generators so we're gonna, get that and they're gonna. Also discuss this truck parking. Stop we have in the peninsula, so Rahira hi. Can you hear me? Yes? Can you hear me? Can you please Alexander keep your thing: muted, yeah? We can okay, Charlie and Wahera the floor. Is yours and let me know about the presentation when to yeah got it thanks good evening everyone. This is Wahira Marta on the government and community relations team at EDC. Thank you so much for giving us an opportunity to quickly just present. You know some updates about the hunts point meat market and these emergency generators. I do hope. All of you are safe and healthy, as all of your families are so Ralph. You can hit the next one and so just some background. The meat market is comprised of about six buildings originally built in 1972. They are all serviced by a single central utilities plant which is the powerhouse building. So on any given day the meat market sources, energy from Con Edisonison in the event of a major storm. The power at the meat market is less vulnerable at the powerhouse building. An elevated backup generator system is really important in protecting the continuity of operations at the market. At a time like this, you know we really want to make sure that we are protecting the city's food sources as much as possible. This generator comes at a really important time. The year 2017 Councilmember Salamanca allocated about 3.45 million towards the purchase and installation of these emergency generators, so the city was able to help with the remaining funding needed to complete the project. Cost is about six million next one and a little bit of information about the generators, so they, as I said, are really crucial to protecting the market in the event of a power loss. They are set at roughly above sea level, so that resiliency piece was really important for us. Two generators will be installed to allow the meat market to parallel all electrical service and they do run on diesel fuel and can run on an emergency basis, so they are tested and certified per EPA standards. Overall, this just means in the event of an emergency. The meat market will have a backup source of electricity to prevent any interruption to food production next one, and so the next steps here are the public Design Commission for review, scheduled for May 18th installation completed by summer 2020, and they are anticipated to be fully serviceable. Last fall of 2020 so right in time for the storm season and then the next one- and this is just a photo of what the generator looks like so you all can kind of see that and then the next one and that's really it. So if you have any questions, you know we're happy to answer what you can the maintenance and everything will be done by the meat market themselves, so they would have to answer some of those questions, but we're really excited to you know play a small part in providing them with this backup service. Thank you so Rajira. Thank you so much for that. Council, member, yes, yeah! That's your question! Yeah I do have a question for EDC. Thank you, Mr District manager. So my question to EDC I funded this project in 2017. You know here we are in 2020 and you're discussing that you're going to complete this project in the summer of 2020. What was the delay? Why did it take so long for EDC to move forward the funding that I allocated for this project? So the as and we've discussed this in various rounds with you, council member good to see you? There was a number of issues on the procurement side. The original contractor is multi-smaller companies and for the EPA has different standards for testing of this type of equipment, depending on the size of the company that is implementing them in the middle of this process. That company was bought out by a much bigger company and that bigger company had to adhere to a much more stringent set of standards, as it relates to testing, and there were some back and forth with the meat market around the type of generators that they would want, and that also played into some portion of the delay for getting this installed by now. All right. So how do I know that this time around we have our ducks in order and that this is not going to get delayed again? Well, the doing this presentation is to get the public design commission to approve the design, the installation, the generators picture that you saw there. The generators are already on site and installed. There was, you know, mix up towards the end that Pvc had to review these, but generators are already on site and installed. The Pdc processors allow us to officially get them commissions, so we're wrapping up a few minor items to get the construction process completed, but they need to be commissioned and they'll be commissioned after the Pdc review process. So just to be clear, because I'm a little confused are the generators installed and are they operational or they have not been installed. It is installed. They are not yet operational and commission-free. When will they be commissioned for use, as we noted in the presentation towards the we want to have it done by the we need to get the Pdc review process completed and punchless items. For instance, the public I say like a Pdc means. What the Public Design Commission any yeah, what does the public Design Commission have to do with backup generators like it just doesn't make any sense. It's just like bureaucracy. On top of your bureaucracy, you know like it. You know again, I allocated this funding in 2017. You know we are in 2020, and these generators are still not there like a total waste of time from EDC. Every process project that happens on city land has to get reviewed by public Design commission. We can't just at a whim, start investing buildings and projects like this. The commission plays an integral role in ensuring that design standards are met and that there is a process to ensure that their designs are reviewed. If this is the internal project, it'll be very different, but this is essentially we're constructing a new building for their energy. All right, well, I. Just hope that you know we stop wasting tax payers, money and fine and get these generators up and running. Thank you said: there's two presentations rock yes, I mean after this I think we will have we're. Gonna ask the district manager to email, this presentation and the design packet, and that will complete what we need from the community board. With respect to the public design. Commission, we simply need a letter acknowledging that we emailed you, the presentation and I think you guys wanted to discuss truck rest. Stop that's also in the fusion center go ahead, Charlie yeah, so as it might not come as a surprise, but you know 90 of the city's freight comes in by trucks through various different studies done both at the city and the state level. We know that on a peak day about 15,000 trucks come into the hunts point peninsula. It is, you know, it's been a historic issue that trucks have not been able to find legal places to park and right now, there's a lot of truck drivers that are coming from across the country, delivering food and other essential items into New, York, City and in science point in particular, and we want to make sure that we had a safe rest stop for these treasures through park. So we set aside the piece of land that is dedicated for the future home of grow NYC, which is between bald doors and the meat market. You know, so you really wouldn't be able to see this location from the street set aside for 55 trucks to be able to park per federal regulations, truck drivers within a 14-hour period they have to, they can only drive up to 11 hours and anytime shift. They have to log a mandatory 10k. So we set aside this. This truck, stop one insurance point and another one in Staten Island to be able to serve as rest stops for these truckers that are coming into the city to deliver essential goods and, in particular, hunts point delivering essential food that the folks need. You know in any given day, if you drive through hunts point you're gonna, see probably hundreds of trucks parked all around the neighborhood men. Some of those are resting story hours that they need. So we felt that this was a good way to leverage a piece of property that was currently vacant for us a safe place to rest. They have portable toilets. They have there's lighting, OEM and NYPD, make regular rounds to make sure that the location is, and we are in as of right now we know that it's about 20 percent utilization, so the 55 trucks we know based on daily counts it's somewhere in Indians utilized, as of yet Mr as district manager may I ask some questions on this. Oh my god, I'm sorry Sandra that I'm asking questions, but the question here is this operational right now as we speak? Yes, it is and who is going to be doing enforcement there, enforcement in terms of what aspect enforcement of you know hunts, point prostitution, drug selling. You know you have these truck drivers driving you know for days coming in who so we're asking the forward precinct to do. Enforcement yeah so NYPD and OEM are both daily rounds to get in touch with the truck driver to see where they're, coming from how many spaces are being used and answer any questions that these truck drivers and who is operating this location who's in charge of this location. This is a collaboration between OEM, DOT, sanitation and us EDC. So again, you know. Look I'm in favor of this plan. I'm excited that we're taking the trucks off the street, but my question here is: why are we adding more responsibility on NYPD is EDC, adding funding to the Forum precinct to add more officers so that they can properly patrol this area? I'll have to get back to you, no I mean, but these are questions like you should have these answers. You know we. Yes, this is a positive thing, but you're just adding more responsibilities to the forward precinct, meaning that they can not patrol you know they you're, taking them away from our streets to do security at these bus stops so they're not there on a permanent basis, it's as part of their rounds, they're making rounds through here in the event that there may be an issue but there's no permanent presence of NYPD at this location, and so there's no proper enforcement. We haven't heard any issues as of yet with safety and other things. So you know we are in touch with these agencies, and you know we haven't heard any reports of any negative activities. I don't want to keep on hitting on this, but Charlie I want to have a conversation with your team in my office about this, because there needs to be better enforcement and we can depend on the same resources that should be protecting our community to do something that EDC could put funding for to actually have proper enforcement Ralph yeah how many trucks it has a capacity of up to 55 trucks from what I'm here, for that the utilization rate is pretty low somewhere around the top right. So, regardless of what happens, no these trucks should probably be off because they're resting they're not driving the truck and who's going to ensure that that's happening I want to get back to you once I touch baseball too again Charlie. My concern is that I know that my mouth has told me that there have been some discussions with Maria Torres and you guys on this issue. But my thing is: why spring it on us at the last minute, right before the day you opened matter of fact, on the day you opened, it was the day you notified the boy again, the city doing as they please is, which is what the councilman had traded before. This is getting out of hand, and it's always been your agency EDC. That continues to do the same thing over and over again at the last minute and you're not is going to be able to monitor the feeling unless you have police there on a steady basis, hello, probably yeah, again I. The only thing I can tell you is we know from reports. You know, historically, that these trucks are already in hunts, point already parked on the streets, giving them a safe place to be able to rest that they're not driving around looking for a place that they're not in many cases. You know on Tiffany, Street, they're occupying parking spots adjacent to the monastery or it's a spot for that they're taking spaces that belong to the community, we're actually giving these truck drivers safe, a central location for them to park, and we believe that the right move to get them into one location, I understand that there's questions safety, security and we'll get back to you on those answers right. You know this was at the direction of OEM, DOT and other partners. Location was a location that is under the management of EDC you're, saying OEM. Is it OEM for the emergency management we're all working together, we're all working together but Charlie again, I gotta, reiterate what the councilman has stated. Somebody has to be there to make sure about the prostitution now you're talking about you, can't see it from the street, so who's gonna see the prostitutes in there. Okay, you're saying you can't see it from the streets: who's gonna make sure about the drug activity. That's that'll probably go in there who's going to monitor that. If, right now, the 4-1 is at skeleton bones, with all the officers that have called them sick because of the coronavirus. So that means, if it's online now nobody's monitoring it. Nobody and it shouldn't, come down to the guys at the 401 when they got so many other things to do when we're calling them for Corinna virus sickness, because the ambulance hasn't gotten there, they got to respond to domestic violence. They gotta respond to other issues in the community. Cars are being broken into already. I've been told by Ata Gracia about cars being broken into in Fox and Kelly and stuff, like that. I had two cars broken into him on my block. This is getting out of hand. You guys got to give us more support on these issues. You want to do it fine, but give us the manpower to cover it. You just can't you guys are just really coming in and saying: okay tomorrow, we're doing this, and that's that, even though you guys have discussed it, but you never gave us time to plan it out, never talk to us about it. These are issues that every that the district manager has the councilman has and I have darling you still there yeah, I'm still here, yeah, I'm sorry, okay, so Charlie is there any way that we can get the poor one. Possibly the council member you mentioned OEM. Can we have a briefing on this? Like? Can someone give us a briefing other than Edc yeah? I'm not gonna say that I mean. Obviously this is a big concern. I know that the chairman also mentioned about idling, and your answer wasn't too affirmative? Yes or no I know that the mayor's office did this big initiative now with Billy Idol about idling. So here you have on one hand you know the city emphasizing and enforcing idling. On the other hand, they are allowing it to occur. So I think this is something that I just want to correct. I. Do not I can not confirm or deny if these trucks are idling I will get. You back. I know that your answer was an affirmative. Yes or no. That's my whole point here and I know it might be difficult to do a site visit, but even if we can, you know when you know things calm down, this is only temporary I get it, but for the meantime, you know we're probably creating a safe haven, a lot of illegal activity at this location, so something that we would want to follow up with you, okay, you might need to tell me well if I think that something has something to say no I mean look I, think that we need to have another conversation. Mr chairman, I, think you're right in terms of the way information is communicated to us. They just come up with these ideas and tell us this is what they're gonna do, but there's more underlying questions that we have here enforcement. We can not depend on the full one to continue to do. You look they're doing the hunts point: Rec center they're, asking the 4-1 to control traffic, now they're doing this they're doing this bus depot or the trump people that they're doing at hunts. Point they're asking the fourth one to do enforcement. When is the forward going to do what they really need to do, which is protect our communities? They can not do that if the city continues to add things to them and not give them the resources that they need. So I think that this is a conversation that we need to have as soon as possible this week, with EDC with the 401 and NYPD to figure out how we're going to give them the resources that they need so that there's no interruption and services for our community. Okay, thank you. So much for that Charlie and Rahira Charlie you and I will follow up regarding the generators and then we can all follow up regarding the trump disrupt site. Ralph I think the Ncl captain wanted to say something Lewis, the new. If you can reach out to me, this is the first I'm hearing of this I have to report to Captain Schumann immediately, we didn't even know this was going on. I need I'd like to do a site survey as possible and also Charlie I got to ask you. Is this a private? Is it private grounds or is it public like I? Don't even know what this depot? Is it private property, because that changed the whole landscape of how we can enforce again? It is a piece of property that the city owns and maintains inside the food distribution center. What it might comment, it's not private! On the street, it's not a! If you're walking on high Lake Street, you couldn't just see your property, it's behind a number of buildings. Okay in the chat room, feel free to send me a quick email. We can talk offline. This is customer Salamanca, I'm sorry Charlie. Can you tell me who did you inform in the form of precinct that you were going to do this folks? I was I personally, did not speak with NYPD I know, but you're representing EDC. So you should have these answers. Hello, yeah, I'm here this is I. Am it's disrespectful that the foreign precinct is unaware that this is happening again? This is another slap in the face to the south Bronx Charlie you're from this community man. You know- and so you know I'm asking like- why does not, as a foreign president know that this is happening, I'll have to report back to you. I personally was not the person in touch with NYPD all right. This would not go unanswered. Thank you. I'm going to Charlie I'll reach out to you separately on the message board. Thank you, yeah. I'm here, I just want to see if Tom Lukini is around Tom. Are you here all right? So, let's go over to Alexis should be still with us, Alexis hi. How are you Alexis hello? How are we doing I see that Tom is my name is here, but if you're more than willing to give us the borough president's report our degree thank you yeah. So we hope that everyone is staying safe and doing well. During this time, I would like to start off by thanking all of the city workers who are helping us through this crisis. On behalf of the borough, president I want to say thank you to all the board members that are here today for any members that are up for reappointment. We anticipate that letters will be sent out by the end of may for any updates on Covid-19 information resources, food assistance, laboring issues, please feel free to check the borough president's website, as is being updated regularly, and if anyone has any questions, please feel free to email. Me I'll put my information down in the message board and stay safe. Everyone. Thank you, Alexis! What's going on with the new board members, not reappointments hello. Can you hear me? Yes, oh okay, sorry so, right now, there's no timetable yet for the new appointments. Okay, to get more information, I'll update you, okay! Thank you! No problem, Alexa! Thank you! So much. If you need me, you know how to get a hold of me. Okay. Thank you all right. Let's move on to the elected officials report. I know we have a couple of them here. Let's see if Anthony Jordan is in the house, Anthony you're here you can hear me. Yes, Sir, hello, all right! Thank you, Mr district manager. Can you hear me hello? Yes, thank you Mr Chairman, thank you! Mr District manager, ladies and gentlemen of the board, I'm happy to represent Congressman Toronto I want to congratulate first of all your board. Members, for this is a I think, one of the first board meetings that I've been to in an innovative kind of way using technology as a way to make sure that the government is still doing its job in a local community-based level. So congratulations to Chairman, Mr, District manager and your leadership, making this happen and I'm sure that many more other community boards will follow your lead on this particular endeavor. I just wanted to bring a message from the congressman Toronto. We are happy to join our elected officials and bringing more testing opportunities to the our district and the borough of the Bronx, especially our hard hit community. As we know, this unfortunate pandemic is has affected, so many communities especially has a negative adverse effect to people of color African-Americans Latinos, and so we want to make sure it's important, no matter how much we hear from the White House that what they have in mind, we are working to make sure Democrats and the Congress and other elected officials are making sure that testing tracing tracking are made available. But in addition to that, we're working to make sure that not only our hospitals but our health care centers have the capability to do working with in the community to have the resources they need to be able to help, treat and hopefully have currently and will be near future. Positive outcomes as this pandemic moves across our community and affects so many of our people. I want to offer condolences to everyone who has lost someone who is close to them or aware of someone who's close to this pandemic, and you have the congressman. Sympathy I wanted to make you aware of some of the things that are happening in the house. That I only have two minutes, and the chairman wants to keep me on my time schedule. So, every day we see the need for further action to combat the coronavirus crisis, the numbers devastating more than 985,000 confirmed cases throughout the country, nearly 55 deaths and more than 26 million people across the country have suffered from unemployment claims in the in the past five weeks. So last week the house passed an interim emergency funding bill that will provide emergency resources that are desperately need to sustain the life-and-death fight to protect the lives of livelihoods of Americans and american people. Democrats, along with congressmen, are working on this to help bring a package that you recently talked about. So let's talk about numbers for small businesses. We have strengthen the paycheck protection program which provided over 310 billion dollars in additional funding with 30 billion dollars reserved for community-based lenders. That means we, if you do not have a traditional bank like large bank like Chase and Manhattan or Citibank, we're working with small credit unions and small banks that are in our throughout our district to make sure that these resources are made put aside. So that you know a small business or you have a small business that needs to be able to have access to this money, because we all know the first package didn't go further far enough, and so we wanted to focus to make sure this money had more of a grassroots community-based ability to be lend out. The SBA disaster lending program, 250 billion dollars in loans, 10 billion Std, SBA disaster grants. We have also secured stronger protections to ensure that our nation's farmers have access to this vital needed assistance for hospitals and health care workers. Democrats along the congressman, has occurred over 75 billion dollars to provide resources and for frontline workers, including personal protection equipment. We all hear stories a lot about hospitals. They don't have supplies hospitals that have enough supplies. This money puts the money at where our mouth is and brings the money to the hospital to ensure that the hospitals have the resource they need to purchase the supplies and have them regularly available. The administration has has also agreed to the key improvements to be made to including two significant lowering interest rates and advanced payments. Linking the repayment schedule and distributing the payments for general revenues, not just for hospital insurance fund, so for all Americans, we have to occur 25 billion dollars with testing, which is the key to responding to the economy and restoring our lives. The administration has agreed to work the nation's strategic plan and testing policy, which is focused on increasing domestic testing capability across and providing more testing supplies. In addition, our office has been like many of our colleagues. Offices are working through technology and teleworking. So if you have any complaints, whether there is about unemployment, about having access to small business loans, about trying to rent or having access to food stamps or figure out that to your family, our phone number 718-620-0084, the congressman's office stands ready to help. Please feel free to email me Anthony, Jordan, at Mail.House.Com, Thanks.Gov, excuse me and I. Think I did my 10 minutes. Thank you chairman. You actually get two minutes, but that's fine Anthony. If you can also in the comments, you can leave your the office phone and your email, that'll be great and I just want to respectfully let all the other elected official reps know you have two minutes. So please get your report in two minutes. Anthony. We have an issue with the post office and I know it's nationwide, but I'm getting multiple complaints about mail being delivered late mail not being delivered. This is something that I'm going forward. The complaints that I receive I'm just going to make sure that you're included on the email and we can document it. I know that during this pandemic that the post office is extremely short-staffed. However, some of the performance is on call for and I. Think communication from the congressman's office to our local post office can pay dividends moving forward. So I'm going to be following up with you with that: okay, yes, so Mr District manager. If I could add to that. Thank you for acknowledging that we are deaf. We are in constant contact daily contact with the Bronx postmaster about post offices. We know many of our businesses, especially the a hundred point. Co-Op market needs to have access to regularly mailed deliveries, because it depends on making sure we have a strong food chain. Supply payments have to come in on from the vendors on time, especially since some of our restaurants are still doing deliveries, and so we need to make sure that we don't cut that off and so as much I appreciate it. Yes, as much as those complaints need to come in to make sure our post offices are possible, please feel free to communicate with that with our offer. Thank you. So much all right be safe. Next up we are going to have Christina from the Bronx district attorney's office Christina good evening. Everyone am I on me. Can you hear me? Yes, I hope everyone is safe and well condolences to those of you who have lost a family member or friend, due to the coronavirus. I just have a few announcements. I need to make. The D.A is asking those of you who have neighbors who may have children to please be vigilant of any child abuse that may be happening or going on I've shared with Cynthia a press release. If she can't get to it, you can email me and I can email it to you, but we all know Cynthia is very efficient. She gets the word out also I want you to know that we also shared some resources for those who may be experiencing domestic violence in the household on what they can do. Our crime victims assistance unit is still operating, although remotely and finally, just a reminder that Thursday April 29th is denim day and that's in lieu of awareness of domestic violence and sexual assault Christina. Thank you. So much, please be safe. Take care hold! Thank you. Next up we have Emmanuel Martinez, Office, hello and good afternoon good evening, so I just want to kind of thank the community board for all they have done so far. I just want to reiterate some of my information. As of now, as you know, I'm one of the representatives for Alexandria Biaggi, representing the 34th district, we're working around the clock just to make sure that constituents are receiving the help that they need. Our senator has been doing a full pantry about her most recent one was on Pelham Parkway, we're looking at trying to see if we can coordinate something with CB2 I. Don't have the information off hand off the top of my head, but I will provide information once we find out more details on that. If anyone is interested or trying to need help in anything, I can give you my information again. My name is Emmanuel Martinez. My contact information is E. Martin, NY, Senate, DOT Gov. Our office number is 718,822, 20, 49 again 71822 2049. Thank you. So much Ralph appreciate it. Just please no problem. Thank you. Manuel. Thank you for being on. Please just put your contact information in the comments, so everyone can get it there. Thank you. I already have I'll put it again. Next up, we have Gloria Cruz from councilwoman of Yala's office good evening. Everyone- and thank you so much for being part of this I, want to congratulate Ralph and his new addition to his little family and Michael. Thank you to Ralph and all everyone. Who's lost love. As you know, they appreciate the that member was falling ill. She was head covered, but she's fine, now she's doing much better and she's back at work diligently. As always, we have a newsletter that we send out weekly with all the resources and services and I put that in the comments for anyone who needs it. But our office is open every day to phone calls and emails. I'm here working every day, so you can reach out to us at 347 and I, wish everyone to stay safe and be well. Thank you Gloria. You do the same and I appreciate the kind words thank you Gloria and, on behalf of the board, send our get well to the council member and you stay safe, because I know you like to be walking all around that area. I gotta make sure that my people are good and that everyone is good and that I can do what I can for the community help our central workers, our small businesses and our immigrants. So thank you. Next up, we have Mr Cabrera from Blake's office, I'm still new to all of this, but I'm working through this they're getting everything acclimated, but I just want to update everybody about what the office is doing. We're doing a little bit of we're. So we've been doing a lot of food delivery. We've been in partnership with world central Kitchen. So if anybody seniors included we're doing we're working through getting them delivered, we're working our office is working through delivering meals to seniors. So, if you know of a senior that is in need of food other than what Chairman Ralph Ralph's I mentioned before about calling 311 and registering through the program to get your meals, if you're a senior, you can do that. But you can also call our office and we can work to get you a meal. We don't have a set schedule as of yet and if you have questions about what kind of meals are delivered you can give us, you can give us a call. I'm gonna include information on the chat to everybody, but if you have any questions, any other ques any of the concerns, if you have questions about res assistance or your stimulus, if you were supposed to get a stimulus check- or you know of anybody who has questions about the stimulus relief program that the that they have, they can give us, they can contact us contact me as well. It's a pleasure to have everybody here to be here with everybody and to be able to share this information. Thank you all for the time and I hope you all have a great rest of your week and great rest of the month. Kelvin. Thank you. So much for that. I appreciate it. If you can also leave your information in the comment section that'd be great. Thank you. Okay, I, don't see any more representatives for elected officials. I just want to see if we can get Mr leukemia he's still here and just afford them the opportunity, if you want to say a few words Tom are you here, okay, so moving on we're going into old business. The last time we met was in February. We had no meetings in March. This would be the only meeting, I guess not for April. We did have one vote there, which is to push back the election until when we return I, don't know Mr chairman, if you have any old business, none whatsoever. Okay, new business I do have some new business I just want to thank everyone for participating, whether you're on the phone or, if you are called in and you're using your smartphone or you're on your computer. In the comment section, there's been a lot of discussion on switching the format in particular to zoom. So personally, I'm a zoom fan, I, love zoom. However, this is the cities of software and the city is, you know the city wants us to use this type of software. There's another function to this, where, basically, you won't see who's on. As far as the participants, you won't see the comments, it will only be the host, which is me and the panelists which I would designate would be the executive offices. So I'm trying this format so that everyone can is a public meeting. So at least everyone can see each other and everyone can read the comments and as long as we remain respectful, you can continue with this format. I do understand the audio and the video comes in and out, but that is not a webex issue. That is a broadband or Wi-Fi issue, because mine's never broke up and I'm sure there's a few people that if possibly there possibly didn't. But if this doesn't, you know, let's see how long we're gonna be using virtual video meetings and if it's something that we need to explore, switching the format with certain vote. So that's it for me for new business. Mr charity in the business yeah I just want to thank you, Ralph and the staff on behalf of the board, because all three you have kept us up to date with all the new guidelines and all the news from the city and the mayor's office as to this coronavirus issue and every morning, I get mines early in the morning and so I. Thank you, I think you're. Before the even the mayor. Now you come on before the meal, so when somebody said you're running for I just want you to know that I know that and I want the board to know that Ralph and the staff has worked very hard, even though they're not in the office they're always talking to me calling me up letting me know. What's going on I, let them know who to call and if it's a board issue to inform the entire board when it's a board issue. Hopefully we don't have to continue doing this for much longer, but, as the mayor stated this morning that it may go after June and this we're gonna have to get used to it. I've gotten also text about the site and how people come in and out. You can't hear too well. Unfortunately, I didn't break up so I. One thing for sure: I could see that Guadalupe works for a carpenter's union because she's doing a hell of a job wherever she's working at and she's still on right, but I also want to I didn't mention Mr, chair I. Thank you so much for the kind words the all community boards we've been pinned pegged actually, which means our operating budget is frozen, so we're not allowed to you know, spend any type of funding, allocate any type of funding and we're not allowed. What we were actually looking to do was purchase our PPE for our seniors and our nursing homes in the district and, unfortunately, we're not allowed to make any purchases on items as such. So you know it's been very challenging for us. You know, as far as what we could do and what we can't do every day things are changing, so I just want to acknowledge that. I'm glad you reminded me on that rough, because I hope the councilman is on I. Don't know if we're going to get the 42-5 back again, but if we do get to 42-5 if they could put it just as one of our budget as a budget, because this is an operating budget here operating budget, because this as an issue has created a tremendous amount of head, exploits Mr chairman. This. Is your council member, so look I we're negotiating the budget now I don't want to misspeak, but I would recommend that you do not depend on that. 42,000. The city has a negative balance of six billion dollars and I. Don't know how we're gonna be able to justify giving all community boards forty two thousand dollars on top of their operating budget. However, I would recommend that your district manager look into the 42,000 that we gave you for this fiscal year, because while the city did a peg on your operating budget, they can not dictate what the council gave every community. So I would really recommend that you look into that because money left over from that 42. You have an opportunity to purchase things and they told us they couldn't spend it on what OMB can not say. No, because that's not their money and if they do give you a hard time, you let me know, and we will address it. We had a bunch of events lined up. We wanted to do a silent disco for seniors before the Panthenic. We was budgeting everything accordingly, OMB and I. Have it documented on emails. It struck me not that we can't spend the money moving forward and I will more than happy to forward that over to you. But thank you so much council member you've been a strong advocate and a champion for all of the community boards in your district and that reflects on all community boards, not just in borough but throughout the city. So thank you so much for that. We're going to move right along just for the sake of time and we're up to announcements, I think we covered a lot of announcements and Mr chair. We had a roll call of 21 board members initially and I still see relatively that same amount of numbers. Actually people did drop off, but the same number of board members are on so I know: it'd be a little bit difficult to conduct a roll call. But let's just take a motion to adjourn that: okay, I'm gonna open it back up and people just wanna just mention anything they can for maybe the next minute or two. So everything is underneath. It I think you can mute it wow. Can you hear me now? Can you hear me all right, as you can see, that gets a little bit complicated and I can manipulate and form at the meeting where no one was being. You know, you won't even know who else is on I'm refusing to cut that up. I think we did a good job here now of being respectful to one another and I really appreciate that and I. Thank you. So much. I'm sorry at one point, I was threatening to kick people out, but I was just for the sake of moving the meeting along. So I'm sorry and I. Thank you guys. I can only tell you. They've only kicked me out of good places. So if you kicked me out of this, one I would have been alright he's still here. Yes, I, don't know if he can hit you go ahead. I'm here, I can listen. Hi know, I, give you a hello of grief when I come to you tonight. I need to tell you and I know. Everybody here feels the same way when I say that you are a warrior tonight and I commend you and all I can say is get them Salamanca and don't let up, because that was amazing. Thank you guys. Thank you, hey, so Mr check. That concludes our meeting. I guess so before hey Roland, if you get a chance, give me a call on my phone. You I think you got it if not actually off and he'll give it to you hold on what's Roland's number. Maybe this is rolling right here hold on Roland, yeah, listen, I didn't get a chance to speak about something, but I'm I'll leave it for later. But during the roll call you guys fell out. You know I couldn't get you okay, yeah! Let me get your number so like that. Well, I got your number I got your number, I'm going to call you in a little while. Please call me okay, thank you. Everyone please remain safe and we look next month to possibly have another board meeting or if any committee meetings come up contact everyone stay safe, God bless, you take care, a good job.",
            "summary": "Give me a text message, but if you do have an issue with your building like right, now, I'm working with Miss Brown from 941,951 hoe, Avenue.\nYou watch the video, but that's what they're doing now, they're doing a lot of smash and grabs so, but if you guys see anything going on even stores that are not supposed to be open, you know definitely shoot me a text message or give me a call.\nIf you have any fire prevention concerns, any kind of issues that you need to be dealt with, feel free to reach me anytime, I, don't know if sanitation is here.\nThe residents on Seneca Avenue are abusing our dumpster to a point where now it's becoming a health hazard, we called 311 last night, the captain of the engine, and they spoke to about possibly getting some surveillance from the sanitation police, because you know it's bringing rats into the you know into the area and the next thing.\nEverybody's family is healthy and safe, and you know let's continue practicing what the mayor has stated as it pertains to the minutes.\nI really want to acknowledge and thank your district manager, Ralph Acevedo and your chair, Bobby Crespo, because not all community boards are doing what you guys doing.\nI know that the board is working and communicating with all of your board members, but, to be quite frank, I, don't see community boards meeting again to September.\nYou know we need to I need to work with the different markets and the different businesses to ensure that we're getting the appropriate supplies for the community.\nThere was a big hiccup from the mayor's team where they took parking on Spotford Avenue from Tiffany to Manida, and there was about 75 parking spots that were lost and it made absolutely no sense for those parking spots to be lost and again this is a failure from the mayor's office, because you know they never communicate.\nWe all know, Monitor street was a one-way going towards Lafayette and it has been a smooth, transition, and.\nI recommend you reach out to Tom Lecania or your district manager, because if you did not reapply chances are you're not going to get reappointed for those board.\nSo I want to ensure that whatever legislation we pass on, the council we get to, you know, keep and save jobs, and.\nYou allow me to, but before we take any questions, Mr Councilman, Councilman, Salamanca I, want to thank you on behalf of the board for the help on the distribution center, and it was a big fight.\nAnd I want to thank Captain Sherbling, also who worked with us on that issue, But most of all you who brought the commissioner from D.O.T the downtown commissioner Commissioner Pollock to come down and speak with us, and it's like that.\nYou, know when, when the Covid-19 hit, because he needed medical care and Lincoln Hospital as well did an extraordinary job.\nWe have Senator Smith, Mr District manager very quickly before I just want to let all the board members know.\nI also want to thank you, Bobby and you Ralph, and all the board members for this meeting and for the work that you continue to do it's extraordinary the kind of work that all of you are doing and in the community like ours that need as much help as possible to have each and every one of you do and participate and contribute.\nMost of us have had close to our have closed our district offices because of the Corona crisis, Corona Covid-19 crisis, But we are doing a lot of work with the community.\nMost of the things that we're working on right now is on helping people get tested, delivering or getting food for people helping people with evictions, especially unscrupulous landlords that are trying to exploit tenants.\nThey're, going to be giving out a lot of food for people who are in need, so I urge you all to make it there as soon as possible, because sometimes when we open up these, these pantries, the food goes quickly, and so anyone that you know that needs help can always reach out as a backup in case.\nWe, don't divulge any information, We protect the confidentiality, but there's been a an uptick on domestic violence issues in our homes, and we can see why, if you need help, but you can't get to my office for any reason.\nYou can call 311 and they'll help you same with people that are in need of mental health issue.\nYou know that the Bronx has the highest percentage of positive results when people get tested for Covid-19, but unfortunately we're being shortchanged, because we have this, the lowest number of tests done in the entire city, even though our people are suffering at a greater rate.\nThey will have telemedicine people available to give you information on the spot, and if anybody tests positive, there will be medical help and all of this the important thing is free of cost.\nAnd, I'm working with the governor's office and other electives to make sure that we can bring this program throughout the entire nitro development and then get locations.\nOne of the major issues that we're going to be tackling is revenue, because the governor has refused to tax those that are extremely wealthy in this country, and we are proposing four taxes that help us cut the deficit and provide funding for programs like like medical care and schools, but medical care, very importantly, because there is a proposal to cut Medicaid something that I find completely insane under the conditions, especially in our communities.\nThat, unfortunately, Despite a lot of the work of our leaders, we still last in terms of health care indicators, so we're raising hell with the governor to make sure that the Bronx, especially these areas in the Bronx, where you have a lot of health issues, do not get the shoulder under the stick on housing.\nMany of them are going to need assistance with rent, but also individuals that that are trying to reach or have reached the american dream and have a one to two to three family home that need help with things like paying the property taxes and paying the emergency they're, Also taking into consideration and their needs.\nWhat they had stated that we need to do is that if we know any seniors that do not live in these buildings, so call 311 and they will connect them and they get registered, and then they will start having the lunches delivered to them.\nThe best thing that I could tell you is to go call 311 and just let them know that they want to be registered for the senior citizens delivery, program, and then they will connect them to that.\nI was told that there's a listing of sixteen hundred workers that they're looking for and they should be calling 311 and ask for the SBS line and say that they want a listing of the jobs to make sure we can have it.\nSo I'm asking you guys that if you know anybody, that's looking for a job.\nThat's, presently right, now, still waiting for the unemployment check that they should start go to SBS and ask go to the 311, ask for SBS and look for the and ask them to let you want to register for the jobs that Fbs is promoting.\nI am going to nominate three people for the nomination committee, which is Jesse Harris, Roland, Ronan, Lopez and Stephanie Cordero who's, a new board, member.\nSo I was going to place a motion to see if we couldn't hold the election until September when we all come back because even like Salamanca said that there's a possibility that we're not coming back until September, so I think it's is.\nYou know making a motion to hold that election until September because of the Covid-19, and also because we all need to be present.\nI, didn't have five people board members, so we're gonna have to open this up, so.\nBut what I send out is official from the mayor's office and from the governor's office and by any means, If anyone has any questions or need, resources, please reach out to me.\nA confirmed eleven thousand seven hundred and eighty seven hundred and eight confirmed deaths and five thousand two hundred and twenty probable effects of Corona virus a little bit of what New York the Department of Health is working on is, as we all know, coronavirus is a community transmitted.\nWe all know, This is an executive order that the governor issued children less than two years old of age should not wear face coverings, people with breathing problems or another health issue that makes them unable to tolerate a face covering do not need to wear one.\nCommunity boards and elected officials, as we all know, New York City parks, including darts dog parks, are closed.\nSpecifically, the supermarket is not directly inspected by us, but we're working on creating a list to ensure there are any specific areas that need outreach more in regards to our social business team policy and our faith, everything we want to know so.\nYou know you could go through New York state of health.\nThat means that we're trying to engage communities that have been mostly impacted by club 1919, identifying unique needs of these communities connecting with community-based organizations, elected officials or social workers working with city agencies and officials to address the narrow disparities that we're seeing.\nYou know, I, won't repeat a lot of what the council member did state, but something else that the health department is working on is with this pandemic.\nYou know some updates about the hunts point meat market and these emergency generators.\nAt a time like this, You know we really want to make sure that we are protecting the city's food sources as much as possible.\nThe year, 2017 Councilmember Salamanca allocated about 3.45 million towards the purchase and installation of these emergency generators, So the city was able to help with the remaining funding needed to complete the project.\nYou know we are in 2020, and these generators are still not there like a total waste of time from EDC.\nGonna, ask the district manager to email, this presentation and the design packet, and that will complete what we need from the community.\nAnd right now, There's a lot of truck drivers that are coming from across the country, delivering food and other essential items into New, York, City and in science point in particular, and we want to make sure that we had a safe rest stop for these treasures through park.\nYou, know in any given day, If you drive through hunts point you're gonna, see probably hundreds of trucks parked all around the neighborhood men.\nYes, This is a positive thing, but you're just adding more responsibilities to the forward, precinct, meaning that they can not patrol you know they you're, taking them away from our streets to do security at these bus stops so they're, not there on a permanent basis, it's as part of their rounds, they're, making rounds through here in the event that there may be an issue.\nI don't want to keep on hitting on this, but Charlie I want to have a conversation with your team in my office about this, because there needs to be better enforcement and we can depend on the same resources that should be protecting our community to do something that EDC could put funding for to actually have proper, enforcement.\nYou know, historically, that these trucks are already in hunts, point already parked on the streets, giving them a safe place to be able to rest that they're not driving around looking for a place that they're, not in many cases.\nOr, it's a spot for that they're taking spaces that belong to the community, we're actually giving these truck drivers safe, a central location for them to park, and we believe that the right move to get them into one location, I understand that there's questions, safety, security and we'll get back to you on those answers.\nMr, chairman, I, think you're right in terms of the way information is communicated to us.\nWhen is the forward going to do what they really need to do, which is protect our communities.\nThis week, with EDC with the 401 and NYPD, to figure out how we're going to give them the resources that they need so that there's no interruption and services for our community.\nSo you know I'm asking like.\nI think, one of the first board meetings that I've been to in an innovative kind of way using technology as a way to make sure that the government is still doing its job in a local, community-based level.\nAs we know, this unfortunate pandemic is has affected, so many communities especially has a negative adverse effect to people of color African-Americans Latinos, and so we want to make sure it's important.\nBut, in addition to that, we're working to make sure that not only our hospitals but our health care centers have the capability to do working with in the community to have the resources they need to be able to help, treat and hopefully have currently and will be near future.\nAnd I just want to respectfully let all the other elected official reps know you have two minutes.\nGood evening, so I just want to kind of thank the community board for all they have done so.\nAs of now, As you know, I'm, one of the representatives for Alexandria Biaggi, representing the 34th district, we're working around the clock just to make sure that constituents are receiving the help that they need.\nGloria and, on behalf of the board, send our get well to the council member and you stay safe, because I know you like to be walking all around that area.\nSo, If you know of a senior that is in need of food, other than.\nI just want to thank you, Ralph and the staff on behalf of the board, because all three you have kept us up to date with all the new guidelines and all the news from the city and the mayor's office.\nAnd I want the board to know that Ralph and the staff has worked very hard, even though they're not in the office.\nWhat's going on I, Let them know who to call.\nYou know, As far as what we could do and what we can't do every day things are changing, so I just want to acknowledge.\nDon't know how we're gonna be able to justify giving all community boards."
        }
    }
}