{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UCRWur6iMQnSZfA9fbj_YaDA",
            "title": "November 24th, 2020 - Budget, Education & City Services Committee Meeting",
            "publishDate": "2020-11-25",
            "shortDescription": "",
            "lengthSeconds": "2:26:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "HjwTKWr4Iho",
            "fillerWordCount": {
                "uh": 212,
                "um": 567
            },
            "readTimeFullTranscript": "91 min read",
            "readTimeSummary": "14 min read",
            "wordCountFullTranscript": {
                "street": 114,
                "services": 42,
                "outreach": 41,
                "shelter": 37,
                "clients": 33,
                "tobacco": 32,
                "teams": 30,
                "individuals": 29,
                "vendors": 25,
                "health": 24
            },
            "wordCountSummary": {
                "street": 35,
                "outreach": 13,
                "services": 12,
                "shelter": 8,
                "individuals": 8,
                "business": 8,
                "vendors": 8,
                "teams": 7,
                "health": 6,
                "clients": 5
            },
            "fullTranscript": "Luchu is the co-chair, so I want to thank everybody for attending tonight. There are four action non-action items on our agenda. The meeting for this evening. First we're going to have a discussion with the department of homeless services, breaking ground and they're going to discuss homelessness within CB5. Second, is a presentation from New York City smoke free we're then going to have an update regarding the Flatiron 23rd street partnership, business improvement, district expansion and finally, we're going to discuss street vendor policies. Just a brief overview of how the committee works, presenters are going to be introduced and they're going to have the opportunity to present to the committee and the public and after their presentation is concluded, the committee will be permitted to ask questions of the presenters when all of the committee's questions have been answered. Members of the public will be permitted to ask questions. We're going to use tonight, as Luke mentioned the question and answer the question and answer function, which is in the bottom of your panel. There you'll see it next to participants I, don't it's to the far right. So if you click on that, we are not going to use the chat function. We have a lot to cover this evening, so I'm going to ask if someone has already asked the question not to repeat it, to try and be respectful of people's time. Thank you. So, let's start with homelessness within CB5 we have DHS. We have Lalani Irvin here to explain the extraordinary work that DHS has been undertaking since the beginning of the pandemic. We also have Nick Urban from the program director of breaking ground street to home Manhattan he's going to talk about what's been happening in the district with regard to street homelessness, and then we have Dr Christila Brace, the director of the heat teams and she's, going to talk about how these teams are coordinating. The street outreach I'm going to again ask you to use the question and answer function only and not the chat, we're not going to respond to questions in the chat, but we're going to monitor the question and answer box, and if we don't have time to get to some of the questions and answers we will follow up. So please leave your information. The board office will follow up with you. There's a lot to get through we've allotted about one hour for this conversation and Luke's going to give us the heads up when we're about 10 minutes away Lalani I'll hand it over to you great. Thank you all for having me good evening. Everyone, it's great to see all of you. I wish it could have been in person, but it's always a pleasure for us to still speak. Virtually I just want to I'm Leilani Irvin, I'm the Manhattan borough director for the Department of Social Services, but I'm also joined on the line with my street outreach DHS colleagues, so just want to allow them to introduce themselves before I jump into it. Everyone, I'm Shane Cox, I'm an interim assistant commissioner, in a street homeless solutions unit at DHS, I'm Julie Harrison, the program administrator for the Manhattan outreach consortium, hi Julie, hi, everyone, I'm Tanya, Tilly, I'm the interim assistant commissioner at the street homeless, solutions and I oversee the joint command center. Okay, great I, think that's everyone. Thank you guys for joining me on this call. So, just really quickly just to give a general overview of how we got here and where we are, as it relates to the department of Homeless services and the services that we're providing in the community board. 5 district in light of Covid-19 I want to say sometime in early April, the agency moved swiftly and quickly to move all of our single adult populations shelters. These are these were sites in which we would call congregate, shelter settings. So these are settings where there would be five or more individuals in a room. We immediately moved those single adult population out of congregate, shelter, settings and into commercial hotels. We did this with the goal of trying to ensure that we can allow clients to effectively social distance until we did that at the top of early I would say early April, so we moved single adults out of these settings and into commercial hotels. This community district I want to say we have a contract with with the hotel associations and I, wouldn't I want to say in community board 5. You guys have pretty much the most hotels in the city of New York, and so we currently are occupying temporarily. We've entered into approximately 11 density reduction, hotels in this district, all again temporary. So we have single adult populations in this district from single adult women to single adult men. Each of these locations are attached with a social service provider who has full oversight of these locations. This security on site and security that also canvases outside of these hotel locations as well, and then the goal of them canvassing outside of the shelter site, is just to ensure that you know residents are being good neighbors in community if our clients are observed or are identified, staff is trained and advised to provide clients with PPE masks if needed, and also encourage them to you know if they're not being compliant, they will case conference them and work with them and assess if this is a good environment or a good location of space for them, and so we have security at all these sites, temporarily that we're temporarily utilizing we canvas outside of these locations. Social services are still being provided throughout the day to clients in these hotel settings, so clients are still being met with on a weekly basis. They have meals three times a day morning afternoon and night, so they have breakfast lunch and dinner. They meet with case managers, frequently folks are still trying to exit our clients out of these settings and into permanent housing. In the beginning of the pandemic, there was somewhat of a stand still with trying to get folks to exit out of shelter and into permanent housing as viewing apartments kind of stopped at the top of the pandemic, and then viewing apartments became virtual, so that kind of picked up and now we're able to you know kind of see some uptick in the exits in terms of clients exiting out of permanent out of temporary shelter and into permanent housing or supportive housing on the street homeless outreach side. You know we have streets, outreach on the line, but I'll allow breaking ground and speak to the work that they're doing but want to say, citywide we're still out canvassing. When the pandemic first broke out, our teams never pulled back. We never you know, told folks not to go back out. We were out. We were canvassing for street homeless individuals in need, doing assessments with them on the street, doing a Covid-19 assessment to identify if any individuals on the street were presenting Covid-19 like symptoms, also providing PPE masks hand sanitizers. This is the work that the street outreach teams have been doing as well as with the end of line subway outreach efforts, we were doing the same. We brought on a lot more bed capacity for our street homeless population, so you know folks. If they need a bed, if they're in need of a bed, we will identify one and provide one for them and the same you know with our shelter system. We have not seen a significant increase in our in the system, but I wanted to say it's seasonal. In the winter time where we do see a slight increase in our single adult population, which is a trend, it is a seasonal thing that we see, but it's it's not at an alarming rate, as one would think or imagine, given the climate that we're in this pandemic and also there's a moratorium on renovations on eviction. So we don't see an alarming increase of individuals coming into the system, but just saying that to state that you know, shelter is still operating, we're still 24 hours. Anyone is in need of a bed. We will provide one for any individual in Need. New York City is a right to shelter city. So we have a mandate to provide temporary shelter for any individual in need, so I think I, hope, I kind of covered the DHS aspect of the work we are in temporary hotels. Unfortunately, we don't have a definitive date or timeline to share at this moment in time as to when we will be exiting out of these settings. You know we are following the guidance of the CDC and the State Department of Health, so whenever they make a determination as to when it's wise and safe to exit our clients out of these settings and back into congregate, shelter, settings I will be the first to come to the community and convey that message on what that will look like I know that we're in ongoing dialogues and conversations from city hall and other you know state officials on what this will look like, but we don't have anything concrete to share just yet, as it relates to the timeline, we have renewed the contract for our temporary commercial hotels for another six months. Folks and I want to say health department. Health experts did flag to the agency that around this time of year, they do anticipate. You know seeing a spike in Covid-19 cases, and we do see city-wide, I'm gonna, say also nationwide, that there is a slight increase, and so you know we fingers crossed we're hoping for this to clear eventually. But, as you can imagine, this has been. You know, I want to say a difficult time for our clients. As well, especially our street homeless population, you know so with the with this pandemic. Folks can't see their families. You know as much as they'd like to folks can't have visitors. I, know folks, think that folks can have visitors in shelter. That's not the case. Folks can't have folks, you know, come into the site to visit this strict rules. So you know that's tough on our population, that's a hard thing for them to deal with, and so we, you know we're appreciative for the community board and other stakeholders who have organized for our clients. Donation book drives clothing drives toy drives. We appreciate all of the support. That's been provided to our clients in shelter and on the streets. So just want to take the opportunity to thank many of you that I've worked closely with on those efforts. But you know the season is: holidays are coming up, Thanksgiving and Christmas. So I know shelter, sites are always open to donations. Requests have been made around, you know, PPE. We provide PPE to sites, but I think a lot of shelter providers will tell you that they they would like additional PPE, as they think that this may be a way of life force for a while, so they they won't turn down mass donations in your district, you have in total, 10 DHS operated, shelters, but out of the 10, nine are family with children, shelter sites and a part of the turn in the tide plan. We and we have a goal to exit out of commercial hotels by the year 2023, and you currently have nine families with children, commercial hotels. So these are sites that we want to exit out of as it's not the best fit for families with children. There aren't kitchenettes in these locations, and so our goal is to you know, bring online more high quality shelter sites, especially for our families with children, locations where they can have their own personal kitchens. We call those tier two facilities, so we're hoping to pull out of close down, pull out of commercial hotels and provide you know, put families in a tier 2 facility setting where they can be provided with additional support services that can live on site and can have their own kitchens. So that's a part of the plan by end of 2023, and so you know we're continuing we at this moment in time. We haven't exited out of any of these families with children, shelter sites, but that is the goal by 2023. I just want folks to be aware of that. It's been a while, since I've come before this board, so I just kind of want to do a refresher for those who may be new voices faces to this conversation, I'm gonna close with that, because I don't want to eat up too much time and I also want to allow some time for Q&A, but I do want to turn it over to the street outreach teams. Unless you want me to break and then answer questions, maybe we can continue to stream and then do questions at the end. Okay, this is Shane from DHS. I can give some pretty quick context as well, so I work in the street homeless Solutions unit, and we are the unit that is responsible for all individuals who are on the street and in the subways we do that work. 365 days a year, 24 hours a day, hurricanes, holidays, Covid-19 everything we have teams out in the field. So there's a couple of ways in which we're engaging people and what we do is we contract out with non-profit providers in each borough and they're responsible for providing that 24-hour day homeless, outreach and they're doing things like engaging everybody? They see they're, answering 311s and really what their work revolves around. It's all oriented around placing individuals getting individuals who are on the street inside, and that is the basis and doing everything they can when they encounter people who are homeless, who want to come inside everything they can to get them inside they're, identifying monitoring, engaging everybody who they think is homeless or who says they're homeless or who their reports around, that they may be homeless and offering them an array of services. They're pretty persistent, but they're. Really, you know it's appropriate and they're, always engaging in a client-centered way, trying to find out what these individual barriers are. What people need, what they're looking for what the situation is, and obviously we know every case is different, but their job is really to break down whatever barrier do what they can to get that person either inside or if they're not really willing to come inside. Just yet also connect them to services, and we have an array of services and there's I can get into there's transitional housing as well. So we have different kinds of housing for individuals who do not want to go into the shelter system. Obviously, as everyone knows, if somebody wants to go into the shelter system, the outreach team can get them in the shelter system in no problem no, but for those who do not necessarily want to go into the shelter system, there are other forms of housing and the outreach teams will work with them to get into that housing, safe havens and stabilization beds and there's always drop-in centers as well, which are you know. These are very low threshold models that are really built for this population and for individuals coming in from the street. They have different rules in the shelters and they're really again based kind of clinically therapeutically around these individuals and helping them get back in the feed and get into permanent housing. We also at DHS have staff who were out in the field as well 24 hours a day and Tonya Tillery is on a call, and she could certainly speak to that, but through the street Homeless Solutions Command center and what these staff are doing. We have staff in the field and then staff who are in the office kind of operating from a command post, for if you will and what they're doing, is they're also engaging individuals on the street, responding to reports of homelessness and then triaging and coordinating with a lot of our partner agencies in real time, as well as the outreach teams, so they're engaging somebody. If somebody wants to come in then in real time, they're talking to other agencies talking to the outreach teams talking to providers and figuring out solutions in real time and I guess, I can turn it over to Nick just to explain a little bit more of the kind of particulars of your area, but again we're primarily we're engaging and trying to get everybody we encounter. Who wants to come inside great thanks very much. Jane I appreciate that good evening everybody, my name is Nick Urban, I'm a licensed clinical social worker and the director of breaking ground street to home Manhattan program as Shane mentioned, or a non-profit that is contracted to do street outreach in the city as part of the larger Manhattan outreach consortium which covers the entire island. Our catchment area is 23rd street to 59th, Street River to river, and we operate 24 hours a day. Seven days a week have throughout the pandemic and continue to with multiple teams out in the field at any. Given time. We also have a dedicated team of case managers and a caseload at this time, that is around 350 individuals throughout the catchment area and we also partner with Cucs, who is a part of the Manhattan outreach consortium. They provide mobile and street based psychiatry, as well as a mobile medical team that is comprised of nurses and nurse practitioners, in addition to the psychiatrists, so a multi-disciplinary team that includes licensed social workers, psychiatrists nurses and so forth, and essentially we are out there 24 hours a day, seven days a week, trying to bring people inside and barring that linking them to the appropriate services based on their presentations and throughout this community board. We see some aspect of what I call a tri-morbidity typically of medical concerns, mental health concerns and substance use concerns that are compounded by folks being either street homeless or under-housed or otherwise dealing with a circumstance that brings them out into the street. So I am happy to answer further questions, but that's basically it in a nutshell: we're the ones that are responding to community concerns, we're the ones that are responding to 311 calls, and we are out there day in and day out, trying to bring these folks inside. Thank you, okay. Thank you. So much that was very comprehensive and gave a wonderful background as to what's happening in the district and the services that you're providing, which is phenomenal. I want to ask the committee if they have questions that they would like any one of the three that who have spoken to answer. I'm going to look for raised hands from people on the Bex Committee I see a hand raised by Mary hi Mary. Thank you. Thanks for a great presentation, guys I was wondering if we could drill down a little bit and if you could give us specific numbers on any increase in either safe haven beds or other low threshold beds. I'm very concerned with the continued closure of the subways in the evening. It's my experience just here in the Union Square area that I'm seeing a lot of people that were displaced from the subways that are sleeping were off on the streets. Obviously they have no interest in going through the Bellevue Portal to get something more stable and I'm wondering also what the situation is with Brc's contract. If that continues in Penn station. Not too long ago, the state comptroller had a pretty scathing audit of their services or lack thereof that are being provided at Penn, Station and I. Think we're seeing a spillover effect to that. So I'm not sure who exactly I'm directing these questions to. But if somebody could give us more detail on the situation with the people who were specifically displaced from the subways sorry, I can speak to that a little bit. We have outreach teams every night working at a series of the end of line stations to catch those individuals as they come off the street as they come off the train, sorry and try to talk to them about coming inside and providing transportation to a series to a shelter if they wanted or destabilization bids. The stabilization beds we've increased it to about 1100 and again we're being very intensive and about getting people on. Very you know we're really working with everybody to get them inside in real time and we're trying to utilize these stabilization beds and we're utilizing them at end of line, but also in our day-to-day work and to offer people a place to come inside and again very low threshold, and in the moment, in real time when people are interested we're saying to them, we have a place for you to go right now. I guess I appreciate that I guess I'm saying that there were literally hundreds of people who were displaced in one fell swoop. Thanks to the governor, I'm wondering if you have had any luck, trying to follow those particular groups of people and getting them the help that they need. I realized that they are among the most difficult to engage. But when you say you've increased the safe haven beds to 1100 is that a total of 1100 increase or increase to 1100 from what those are stabilization beds. So it's a different kind of bed. It's again, it's low threshold beds that are for this population, so we've increased it to 1100 from what from well. These are different kinds of beds so from zero to eleven hundred. Really. Okay, could you give us a breakdown, and did you know I can get you guys? We can get you a breakdown of the more details on them. Thank you. So much I, just wanna add one important note to something: a statement that Shane made earlier. We no longer folks don't have to go through 30th street. So you know the teams are able to do assessments on the street and make direct placements for the street homeless population into a into us into a stabilization bed. So just I think that's a big game, changer and I. Think a lot of folks are under the impression that they have to go through this long process where they have to go to 30th street first and that's not necessarily the case with this population. Thank you, I just want to back up for a minute. We have Dr brace here as well who's the director of the heat teams and I wonder if she could just explain what he teams are. I'm sorry I don't mean to change the focus away from questions, but I jumped over her and I apologize for that. I'm sorry, Dr Grace! No, it's okay! Good evening! Everyone so I mean we've. The heat teams have basically he does the health engagement and assessment teams within DOHMH, so the heat teams are compromised of a coordinator which is a clinician, mental clinician and a peers or a person of lived experience. So what that means is that, though, as a team, they go out and conduct outreach, and then we also have referrals that we receive and therefore have a caseload, that the teams kind of always, in addition to outreach, maintain the primarily focus of outreach is within every single borough of the city. They are about four to five different locations within the city, including east Harlem, that the teams go to. They conduct outreach about six days a week and we also receive referrals. So if a referral came in through New York's NYC-WELL, they go through the triage process and then it's assigned to heat if it meets the criteria for it. Our main focus is obviously working with individuals that have concerns with a homelessness. So therefore, we work very closely with DHS and collaborate in real time, if need be of individuals that might need shelter, whether it's immediate, whether it's long-term. So obviously those things depend on what the actual need is when these individuals are being engaged by the teams, but then the other primary focus as well within heat. Is we work with individuals that have a behavioral health diagnosis? Maybe experiencing you know some risk psychiatrically if they're previously incarcerated? Obviously we would be working with them and maybe even couldn't you know, hope connecting them to re-entry services and programs where they could maybe be part of an internship and therefore they will lead to employment if they, you know, need obviously mental health services, substance abuse services, those are things that we will connect them with and work with them in a more I would say in about a short intervention period. So about 90 days they could be our clients and therefore our staff will continuously manage their connections with these services depending on their needs. Thank you. You said that they can become your client within 90 days or you work with them for nothing, no so like they could be basically be within our case load for 90 days or less right so, depending if they just need to be connected to specific services. For that point, in time, that's fine, but if they're referred for the most part, they become part of our caseload, so our staff continuously works with them. Where we conduct case deployment, you know we go see them regularly on a weekly basis, obviously connect with them, where we follow up with the services that we connected them with whether it's mental health substance abuse, whether it's you know receiving Medicare, if they don't have any types of health insurance or if they need, you know, SSI, whatever they're, missing or needing that would make their everyday life easier or fun. You know functioning better. We would be able to assist in those things and obviously we work with individuals who also have previously been incarcerated so connecting them to different various programs or our needs of what whatever they might be. Thank you. Let me ask members of the committee for further questions. Thank you, Dr Brace sure am I seeing any hands from members of the committee. No other questions, I'm seeing none Luke. Are you seeing any? No, I'm, not okay, seeing none. What I'm going to do is I'm going to do to go to the question answer panel that has been submitted by people attending, and we also received some questions in advance. One of the questions that we received in advance and I think you answered this Alani is just to give an overview of the social services that are being provided in the temporary hotels right. So at all of our sites, clients are met with caseworkers on now a weekly basis. They do wellness checks with all of our clients on site. Just to you know, do I would say: Covid-19 wellness checks and ensuring you know they ask them a series of questions, making sure folks feel well and are okay, but they meet with the caseworker. They work with a housing specialist. We try to connect folks to employment opportunities, so we have the case. Workers who work on you know if you don't have work on employment. Your case worker assists you with trying to secure employment. We have housing specialists that trust to help you identify housing. They created what we call an Ilp plan, an independent living plan with clients, and so that means that maybe you don't have a voucher or you don't have employment, so they try to figure out what do they need to do to help transition you out, but also successfully transition you out where you're not returning back, and so we also do something caseworkers on site whenever someone's about to exit into another location and they secure permanent housing or supportive housing. They connect them with different linkages in that community or in that area, to off to ensure that they have the supports that they need going forward. So that they're, not returning back because at shelter you have an array of services and supports that folks, don't necessarily get when they leave and they exit out. So the goal is to ensure that they have all that they need around them to thrive when they exit out, and so the case workers assist them. With that I expressed earlier that there's three meals being provided a day, breakfast lunch and dinner. So that's ongoing all of the same services that was being provided to clients and in congregate, shelter settings is being provided now in these hotel settings. The space just looks very different, obviously so in terms of recreational space, where we could engage clients and do rec activities that looks different, we're limited to how many clients can be in a room. You know we have some rooms that are online in the hotels that are now used for office space or you know, recreational activities for the clients. So it's just been a real challenge, but you know the providers are very creative staff is very creative and they've been very innovative in the way in which they've been engaging our clients in the midst of this pandemic. So we we've had some awesome community linkages. We had magicians in this district. Adult magicians come to the site to do activity. There's been some. You know yoga mindful meditation workshops. Many of them are virtual, so you know we're trying to just be very creative and keep folks engaged throughout the day, but always also looking for community the community to let us know what's happening in the community. There might be activities or virtual things that our clients can participate in I know this the high line. We created a partnership with the high line, and so they do a lot of virtual band concerts and things of that nature for clients. So we're always looking for those types of creative community linkages and partnerships as well. I hope that answers that question. Absolutely. Thank you. Another question we have is: could you please provide recommendations on steps? People should take to send help if they see a homeless person on the street in crisis or having an apparent mental health issue or creating a pro a problem that may be drug use. Are there different responses, depending on what people are seeing and what's the best response, so I I've, given you four scenarios, a person in crisis, an apparent mental health issue, drug use and then courting or camping? What would be the best response for people in the community to help I guess I could answer related to mental health and maybe even crisis a little bit when it comes to individuals that might be approached or might be appearing as if they might be going through a crisis or have some mental illness that might need assistance, I, think calling NYC-WELL and therefore they will be referring that individual to the triage desk, which basically assigns a case whether it's for heat or Crt, which is the core response team within DOHMH. So I think that would be the best way that those individuals could be assigned to whether, whichever team might be appropriate for them. If it's more crisis, then obviously might go more to the core response, because they're responding with NYPD, if, if it's more mental health and therefore longevity of connections with mental health is more appropriate and needed, then obviously triage will make that decision and then assign them to heat. And then our teams will go in and follow up with the individual engage them. You know conduct mental status exam where we also will be interviewing them to see what kind of services they might need. So I think that's the best way to go about it for or I mean I think even 311, but I think NYC-WELL is where normally all our referrals come from. Thank you and yeah and I would mention for homelessness. You know, if you do see somebody who's homeless. You know 311 again, I mean it is really one of the most efficient ways to get in touch with the team. And if you want Nick's team to be notified about something, if you go into 311 and put in the details, Nick's team and or the outreach team covering will have to respond within an hour, and then we also use it. You know as an information gathering source, meaning if you're seeing a particular condition or a particular individual, and we see a series of 311 say in the evening or during rush hour or maybe early in the morning, then we would know how to kind of you know, devote our resources to that. And maybe we wouldn't go in the morning. Maybe we'd specialize and have teams go by at night instead of in the morning when we've been going by and not seeing the individual in question. So you know 311 for homeless. Individuals really is the most efficient and quickest way to get a team out there and again it'll be Nick's team and you can simply what they do, but again engaging that individual and they'll always be offering them services and offering them a chance to come inside and doing what they can in the moment. Or you know, following up with them and continuing to you know, see how they're doing and check in thereafter, but that that's really the best way. Thank you. One of the questions that we received is from the 29th Street Association is they are seeing an increase in homeless people living on the streets and I. Think Lenny you mentioned or breaking ground. Maybe mention that. Maybe that's not the case. Could you just address that of the you know what the census is. Looking like, I know, you probably touched on it, but yeah I I'll, let breaking ground expound, but in short I would say you know it's a pandemic and in the pandemic our street homeless population no longer has access to general things that we would we I mean we may have taken for granted. But you know they no longer have access to Starbucks, maybe or Mcdonald's where they would use restrooms or want to say public libraries are now closed and those are locations in areas that our street homeless populations took full advantage of. So you know you see, I, don't think that they're new I think it's just more prominent to the eye to see folks now you know it's less foot traffic on the street, and so our clients are more visible. Folks are seeing them do things that maybe they used to do in hiding, but now there's no place to go to do these things in hiding or in nooks and crannies, and so it's more visual to the eye and apparent to the eye. So I wouldn't say I, don't think this really is I'd, say an increase. I think it's just folks have been somewhat at a standstill at home and now when you go outside and go outdoors, it's more visible to the eye. I'd say, but I would turn it over to the street outreach teams if they want to weigh in, but obviously that's just a general assessment. I believe yeah I agree with Leilani. We haven't seen any indication that there are actually more people. We haven't been engaging a greater number of people who are truly street homeless, that is to say living on the streets sleeping out every night I will point to some of the issues that we come across more frequently, substance use being one of them. Prior to this pandemic, there was already an epidemic that was really tearing through the city, the state and the nation at large, and that was the opioid epidemic which hasn't gone anywhere. You know what has happened. Is opportunities to use inside have disappeared for folks treatment options have reduced a bit, so I think we're seeing more of these kinds of behaviors that really pop to the eye, but I don't think that the sheer number of people who are truly experiencing street homelessness has increased at this time. Thank you. Another question from the neighborhood associate 29th Street. They wanted to know if you're, seeing any positive Covid-19 results in your population and if that happens, how do you deal with that? Yeah? That's an excellent question. So we have policies in place and procedures in place at all of our standing, shelter, sites, density reduction, hotels, other families of children's shelter sites, as well as our safe haven, wherever there's a contract with DHS for homeless, New Yorkers, there's a procedure and policy in place. So if, when folks, either folks come to staff and express that they are presenting symptoms or when staff's doing their rounds and they're doing their survey, screening clients on site, if anyone is identified or flagged as having Covid-19 like symptoms, they're immediately ice are isolated, provided a mask and then we have isolation, Covid-19, isolation, density reduction, hotel locations for those individuals, so we would move them immediately into one of those settings and then they would be processed screen tested to see if they in fact have Covid-19 and if they do have Covid-19, then they would remain at the at that particular location until they, basically until their symptoms, go away so they'd quarantine for 14 plus days or so do another test, but they're closely screened and monitored. So that's the procedure in place. I know that street outreach has a separate process when they're engaging folks on the street. I know that they also have their own somewhat, like a checklist of questions that they ask folks, betting down on the street and the same. If anyone is presenting those types of symptoms, we connect them. We make the appropriate information referrals for them to connect them immediately to care, but maybe streets can speak more to that process and what that looks like yeah, absolutely I. You know I want to give a really good overview there, but really quickly, every single person that we engage, we put through a Covid-19 screening and if they indicate any positive symptoms, we immediately contact this number that allows them to either enter an isolation site or if the situation is severe enough and they're interested, we'll transport them to receive medical treatment, and we have brought a number of people to hospitals in addition to these isolation sites. On top of that, we also offer PPE to every single person that we engage on the street in the form of masks, hand, sanitizer and so forth, and we've been doing that. You know from day one basically, we've got an internal source for that equipment and we have distributed it basically around the clock, since this happens. So if folks are on the street and unwilling to come inside, we're at least making sure that they are not presenting with any of these symptoms and that they have the PPE to keep themselves and the folks in the community, safe and the office of medical director for DHS is heavily involved in tracking any suspected Covid-19 cases for isolation or quarantine. We do follow the executive order, so even if we engage somebody on the street that says they came from another location, we will call the number for our isolation or quarantine for that individual. So, even then they don't have to have. You know enter our shelter. That is the regular way go through our assessment site to be screened for isolation or quarantine, and the data is kept by the office of medical director. Like I, said on an ongoing basis. There is a call every day where we discuss positive zones within the city of New York, where DHS might have shelters are in those zones. There is our daily testing since Covid-19 has come upon us. We test all at all our sites, stabilization, safe Haven, drop-in sensor, and it's on a like I, want to say a four to six week: rotation. So every four to six weeks, every individual site, every shelter, has testing providers that come on site and do testing when we think the maximum amount of clients are present within the brick and mortar. You know it could be early morning. They are test up to nine o'clock at night when people are coming back for their bed or whatever. So this has been an ongoing thing within DHS, since Kovac has come upon us, we test continuously, so in the rotation every four to six weeks, each site that is contracted by DHS or directly run is tested. Thank you. Another question that I see in the question and answer and I know that you referred to this Salani. We have a question: how many permanent shelters are there in CB5 and we know that there are nine, and then you mentioned that there are ten and there are 11 temporary ones operating now. The question is DHS concerned about the effect on clients and neighborhoods of concentrating so many total beds in close proximity, both the clients and the neighbors, and how to temper that yeah. So we keep our line of communication completely open. If there's any issues with any one of these locations and sites in which we have, since we've entered into this location, have had several ongoing dialogues with community stakeholders residents, the local elected official representatives with Gail Brewer, Councilmember Keith powers about a number of these sites in the beginning and the purpose and the goals with those meetings were to address. You know residents concerns in the beginning. It was just you know many concerns about loitering, you know or clients not wearing masks when they exit the sites. You know not it's to my understanding that there's been some improvement, but wherever there are concerns or issues we're, not we don't say no to having a dialogue or meeting with community residents. We actually want to get on top of those issues if they are. If there are issues, if there are concerns- and so we've been having individual meetings with each site of concern- you know now- there aren't any issues with I, won't say: there's issues with every single site right, you know, so whichever sites seem to present some challenges in community we're more than happy to meet and with those providers and stakeholders, the community board or whomever else needs to be a part of the discussion. But we that's what we've been doing. We are aware, you know that there may be some challenges with the density, but you know our clients. You know this is a temporary. This is a temporary situation. We don't plan to be here long term at all part of the turn. The tide plan is to exit out of commercial hotels. We don't want to be in hotels, but we have to be to save lives and so we're here. But as long as we're here, there's a good neighbor policy that we that every individual coming into the shelter system has to sign when they get assigned into a shelter site. I mean it's simply, a policy that just you know, goes over rules of you know what being a good neighbor means in the community, and should anyone be in violation of that policy? They get case conference. You know, there's an assessment that happens to you know see. Maybe if this is a good fit for this individual or perhaps maybe they need to be in another setting, but that you know that's a case-by-case situation depending on the situation and the client. But you know staff is there to support the clients. We have house meetings with residents at each of these locations where we go over different announcements. Make community announcements share with residents, you know locations that are open to the public, so it's always helpful for communities to let us know as we try to temporarily integrate. You know a lot of these individuals. They've been uprooted, and you know this is not then this is these are new communities to them as well, and so it's always just helpful. If the if I've always asked you know, if there's anything that sites should be aware of community can be made aware of locations. That's open to the public, where our clients can take advantage of in communities. So please you know, let me know I'll, let the providers know, but that's how we've been managing these locations. If that makes sense, absolutely thank you. I have a question. I! Don't really know that it goes to you it's from the Olympic Tower condominium. They want to know about the outdoor pop spaces on Madison Avenue and whether limits can be placed on the usage of these parks as there are on public parks and indoor pops. So actually yeah I, don't know. If that really is something you could address or not really in this form, maybe we need to figure out and follow that up later, yeah I think we could yeah I think it might be worth following up outside, but I can just say generally I mean you know the outreach teams, one thing I should say, is they're, not enforcement agents they're not out there enforcing code or parks regulations or any other regulations. They're really there to serve again a social service function and to engage individuals but again I think I can certainly probably speak for Nick I mean we're more than willing to work with anybody if they have a homeless individual or they know of somebody who's in the street, we're more than willing to partner with them and do what we can to engage the individual and bring them in off the street, and we can certainly talk offline about the specifics and I wouldn't be able to speak to exactly what the regulations are and what they're able to do or not do. But you know again, we work with parks and we work with other agencies and organizations throughout the city, and we work together in whatever way possible to get people inside so great. We can definitely follow up and find out what the situation is fabulous. We'll do that offline. I know that Mary had some additional questions: Mary yeah just quickly again, I, don't know if anybody on this call is positioned, but does BRC still have the contract for Penn State and what is being done in the wake of what was pretty scathing yeah about it? So I can certainly speak to that. I'm sorry, I know you brought it up earlier, so yeah I mean you know. We did take that audit very seriously. I mean- and you know, BRC is a very- is a valued and essential partner of ours and they do good work. But we did take that audit very seriously, and you know there were a lot of opportunities for us to change how we do as well as change on what they're doing so there were some corrective action plans and they're. Definitely a series of performance, metrics and different levels of oversight were in terms of reporting and just day-to-day monitoring. Everything from encounters to strategic plans, I mean so we're really working with them in whatever way we can to get them back on track again. I think they're, valued and doing very good work. I know your question earlier was about Penn Station, but yeah. It's not a DHS contract, so I wouldn't want to necessarily speak to that. Is there any timeline to the corrective plan? I would have to get back to you, I, don't know it offhand to balance it. Sorry, okay, I guess. My other question was just given that the huge shift in taxpayer dollars from NYPD to outreach DHS has there been a plan put into place on how that's going to be effectuated is the assumption that funds have been diverted from Pd to the agency. Well, that's what there was a ton of press around it. Yeah I, don't know if that's actually happened yet or if there's a again a timeline for that. Don't quite I, don't think, there's really much validity to I. Don't think! That's I can't really speak to that. I. Don't believe that there's been funds diverted from one agency in particular to another. It was the largest reduction quote yeah. There was a rejection of like whose monies was taken away from one agency and given to another. I can't speak to, but I'm happy to circle back with clarity on that I. Don't have I, don't appreciate that yep sure luke I think you also had some questions that came in yes, so we got a few questions by a form that we asked people to fill out before the meeting. A couple of the questions are in regards to constituents wondering how they can shut, shelters down and I. Don't know if you want to respond to that or you know if there's anything that people should know. You know about the temporariness of this situation. Maybe it's better if you just explain how shelters are cited or how you choose a site. Well, we have an open-ended RFP. That is it's open all year round providers submit proposals through that system, I think it's the HHC accelerator system. Dhs then looks at those proposals rate them, and then they get awarded a contract. So we send out, at the top of every year a letter to all community boards and elected officials requesting for communities to send us viable shelter locations. As this is a right to shelter city, we have to provide bed capacity for those coming into the system. We don't have a choice we have to so we always look for communities to send us locations a part of the turn in a tide plan. Is we realize that we've in the past can't speak for previous administrations, but just looking at the data in the past, we have, you know, opened up shelter. Sites in you know and concentrated more shelter sites, in particular communities of color, and so this plan has been a borough-based approach to how we're citing shelters. So the goal is to keep individuals coming into the system close to their support networks and their communities, so not particularly keep them close to their zip code, but keep them close to the boroughs where they're receiving services of support, and so this is a borough-based plan and in this plan the goal is to give you know every community a site depending on what the system looks like. So you know we respond to the system, but that that's a letter that goes out every year to community boards and to elected officials, and so we just it's. You know we have one system that works. It's you know all year round. That's the RFP, that's providers who submit put in a contract proposal, and then we have the other side where there's sometimes elected officials or members in community. That brings us locations. That brings us sites as well. Thank you. Another question we got in advance is if somebody is encountering like, if there's a homeless person who is continually in front of their building, they keep on calling 311. Nothing seems to be happening. What can you tell us like what is going on there? What should somebody do if they feel like 3-1 calling 3-1 isn't worth it? So it's the I would just message that folks who are using 311 should just put you know, requesting homeless outreach. Think there may be some sensitivity around the language and what is being said to the in the request being made and how it gets flagged. So, if you're requesting homeless outreach by way of 311 that will go to our JCC unit. So if you can send me those tickets numbers where folks may be having some challenges or issues send those to me and I can follow up on those particular ticket matters, but all calls three on one calls. If you put if you state that you're you know, you're asking for Street homeless outreach support, it will go to our JCC unit. Well and I should just say: is it just general matter? I mean it. You know again. 311 is helpful, no matter what I mean I know people the teams are, they may be frustrated with it, but the teams are responding and it can just be a very long process, but Nick can certainly speak to it, but his team does not give up and what they are doing is they are going to continuously engage people around coming inside and connecting to services. Even when people say no, not interested Nick, Team is still checking up on them, making sure everything is okay, seeing if things change, they're, offering them different resources and different combinations, engaging in different ways engaging in different times. You know some people particularly been on the street for a long time. It does sometimes take quite a while for someone to get to the point where they're, they trust us and are willing to come inside and even sometimes when it comes inside people still return to the street, and it's just it's a very long process, but we're there every step of the way providing whatever support we can be to make that successful and I know. There are people on the street and we are really focused on those chronic people. The people who have been out there, the longest and who are really entrenched and through the winter, will be out there. Every night next team will be out there doing rounds continuously through the weather through snow. Whatever the case is to engage them and 311 again, you know it just it helps us detect patterns, and it also just you know. People may disappear for a little bit and come back and it just. It may be an alert to Nick's team to go re-engage any of the outreach teams so I. You know I just want to stress that it does take some time sometimes, but the teams are continuously working and trying different ways working in different combinations, working with the heat team working with another agency. Whatever the case is whatever they can do to make that impact and get through to the client and build that trust so that they feel comfortable coming in off the street with us into a new site, we'll do it. Thank you, I want to be respectful of everyone's time. I know we're at the seven o'clock mark. We have two more questions in the question and answer: if that's okay, if we may get, if you just have a moment, one is from it's saying that there was. They had heard something to the effect that the city was buying up every available hotel to turn into shelters. I, don't know if you want to address that and the question then becomes will neighborhoods have less control over what happens. You know in terms of what would be cited there. So I don't know if you can answer that, or is that something that's happening or not happening or yeah, I'm not sure about the second part of the question. But to answer the first part of the question: the city, the agency, isn't buying up commercial hotels, we entered into a contract agreement with the hotel Association, a hotel association provided the agency with what hotels are available. So that's to answer that part of the question. I don't know about this second part of the question, but we a part of the turn in the tide plan you know, is to get out of commercial hotels, and so we will be exiting out of those settings. That's just to touch on the hotel piece whenever we notify on a shelter and if it is, was a hotel. What we do it would be a report we repurposed that facility. It goes to construction and then it's you know it's no longer deemed a commercial hotel. It gets gutted, you know, gets re-renovated construction happens and now it's a new purpose-built facility, but those will come to us so that comes to us by way through the provider submitting an RFP to the agency and as it relates to the co, the hotels that we're using for density reduction purposes. Again, that's the hotel association that shared what is available as it relates to hotels and in their system to the agency. Thank you there one last a question and then for the questions that we don't get to tonight. The board office will be certain to follow up and we'll discuss with just the last question here. It's a big thank you for the work being done during the difficult time for all of us, the homeless, folks and other residents. The question is: do surveys include consideration of proximity to existing shelters, permanent or temporary, and are the recurring unmet long-term planning needs that DHS and shelters have that could perhaps use added community advocacy and how to do that? That's a loaded question all right. Where is that question? Is it in the Q&A very last question from Mackie I feel like I have to read this one to know how to respond I, don't quite, and when the survey we don't do a survey. When we entered into these commercial hotels, there wasn't a survey assessment that was done. This is very. This is a very. This is a very different process. This is something that the agency we've never had to do this before this is a global pandemic and we literally jumped into action to isolate staff and clients to the best of our ability quickly to save lives. Our Covid-19 numbers in the system went from 1,000, plus cases that we were tracking down to 41 currently, so that kind of speaks volumes, I want to say the metrics speak for itself, I think it speaks volumes to you know the fact that we were able to bring down those numbers because we made these moves. So this is a separate part from citing standard shelter. This is not the same. Whenever we cite a shelter location, there is an environmental study that goes in there's a fair share assessment that that's a separate process from where we are in this moment and I just want to differentiate the two because they're very different, so where they would. Maybe folks may think that this is the same whenever we entered into a hotel. But it's not it's a different process. Again, it's temporary. We don't plan to be here forever. We don't want to be in here forever, but we have to be to save lives. Thank you so much Lonnie. Thank you. So much for answering all the questions. Nick Shane Julie, Dr Christila for your public service for all of your work in this area. What we're going to do? If we didn't get to your question, you can always contact our board office at office. Cb5.Org, we'll follow up with you we'll share everything that we learn and any questions that we get with DHS and follow up with everyone and I just want to. Thank you all for being here and all of your work. Thank you so much. Thank you so much for having us and thank you to my colleagues from DOHMH for joining us and my DHS Street Homeless outreach colleagues for joining the call. Thank you all happy holidays to everybody. Thank you. Everyone. Thank you! Happy Thanksgiving! Thank you. Okay. That was a lot that was amazing. The work that's being done to help the homeless. What we're going to do now is we're going to turn over to Lisa Spitzner from a New York City smoke-free, New York, and she is working with high school students from the school of the future, who are part of the New York City smoke-free youth, advocacy group and they're called reality check. We have here, Athena Katsu, Privetus, Sabrine, M, Meisha, Hussain and Barisha Hussain I have sent to you and they shared with us. A copy of the black lives, black ones, video, and they are going to talk to you about that. Luke is also going to put it in the chat for anyone who didn't get a copy of this video. The film is going to look at social injustices and health disparities in the black community that they have faced from big tobacco. I will turn it over to you Lisa. Thank you, hi everyone. Thank you. So much for having us tonight. I know it's a little bit of short notice, but we're really appreciative that you got us on this agenda because a little bit of a timely issue as last week was the great american smoke out. So we are working on our tobacco prevention, education and increasing awareness that much more this month than we usually do, but just a really quick intro to our organization. I myself am the community engagement coordinator in Manhattan, I'm joined with my partner, Io Ali, who is the youth engagement manager from Manhattan? I'm not sure if you're there io yet, but you will be hearing from our youth group as well, but NYC smoke free is a program of a larger non-profit here in New York City called public health solutions, but our specific program focuses primarily on reducing tobacco use and secondhand smoke, exposure for all New York City residents through education policy and advocacy. So we work on a number of different initiatives that really all relate to policy change. Environmental change to reach those goals and everything we do is evidence-based, primarily funded through the New York State Tobacco Control program. So we have worked on a ton of different advocacy and policies in New, York City that have helped drive down the smoking rate to what it is now, which has been the all-time low at 13. We as a city and state, have some of the strongest. You know tobacco prevention regulations and policies. However, you know, in the face of all of that, we still have groups and communities that have high much higher smoking rates than the average, and we really are working on health disparities, health equity and really working to close those gaps within our city, because there are certain policies, unfortunately, in our city that do not help reduce tobacco use, they're not as strong as they can be to reach certain underserved groups that are being negatively affected by tobacco use and one of those large health disparities is which, with what you saw in the black lives black lungs film. And if you know you haven't had the chance to watch it any of the attendees out here participants. Please do it's a 15-minute film that really showcases the exploitation of the tobacco industry on colors of communities and communities of color, and you know we do know that communities of color have much higher smoking rates than you know their white counterparts- and this is not a coincidence. This is something that has been deep rooted in very targeted and strategic marketing and advertising to these communities for decades, and it is still present to this day and one of the most influential ways that they've been able to increase smoking rates in communities of color is through menthol tobacco products and menthol tobacco products is a flavor of tobacco products that is disproportionately advertised to African, Americans and hispanic populations, and it is, coincidentally, the one flavor that we still have legalized in New York City. So without saying too much. This is a short intro to what we're going to be talking about. We do have our youth group here today. Reality check who we do have some students from a school in your district, but I'm not going to steal their show, I'm going to let them introduce themselves and what school they're from and let them take it away. I think Athena. Are you sharing your screen because I think? Oh, she got it. Okay, yeah thanks Lisa, so hi, my name is Nicolette Briefies good afternoon. Oh can I press present so, like Lisa said me as well as my counterparts, Bashira, Maisha and Sabrine will be presenting on the film that Lisa mentioned. However, I want to introduce myself I actually attend school, the future, which is on 22nd and lacks it's like a block away from Gramercy Park and we I actually joined Realitycheck in November of 2018. and since then, we've added on new additions to our little to our team and today we're just really wanting to focus on the importance and significance of the film when I first joined reality check I actually joined via youth summit, and that was like a collection of a bunch of kids from all five boroughs, and we were. This was my first introduction to the topic and I. Remember something that really stood out to me was when I learned about the advertising, because we had like little sections. It was kind of like classes on a Saturday, and we had little just the thing that stood out to me most was that the deceitful advertising that was used to lure consumers in via the big tobacco companies- and this relates to the black lives black matters- I'm sorry black lives, black lungs film. We were watching today, because Truth Initiative actually created this film along with Lincoln Monde, and some other significant facts of reality check is that throughout my membership with reality check, I've actually visited Albany this past February and I directly. Excuse me: I directly got to talk to state legislators and their their teams, which I was like stunned about, and we were basically sharing our experience with tobacco, either in our households or friends. Experiences. What not, and in this particular film black lives back lungs. We will be talking about how the big tobacco companies targeted black communities. Okay. Thank you, Athena Welcome, ladies and gentlemen, thank you for attending our presentation today. I'll be talking about african-american representation in mainstream media, so after World War Ii many African-Americans moved to the north, which in return, caused special products to be made specifically for African-Americans, such as foods and hair creams tobacco companies caught onto this new demographic and started implanting commercials of African-Americans smoking, their menthol and tobacco products. This was crucial to targeting african-american communities because they were more receptive to TV commercials at the time they soon profited off, of taking advantage of the african-american community and in the we will talk about different methods. They used as my peers, the brain said, they're being targeted and represent represented, but this is not necessarily a good thing because with that came in them to be shown, the deceitful marketing and essentially be given them, and one of these tools was the misrepresentation of these products, and one of these include saying that they were becoming younger, that it cured their asthma and it gave them good health. Overall, however, this is actually found to be false information and not correct at all. They also use medical endorsements where they got doctors to promote their products, saying that if you use it, they recommend it and that it's just positive for you, which is actually insane because with them. We know today that this is false advertisement and just using them to promote them. They also give scholarships and sponsored festivals, which was a big factor because they got in more customers and younger generations, especially also with the advertisements they gave off a cool and uncomfortable look, so more people would be able to try it and celebrate endorsements where you actually got black celebrities and used them to get in more black customers, because they treated them like an ally, however they're actually being against them. They also funded black organizations and the congressional black caucus, and though many of them don't take in money, some of them still do, which is very big to consider, because these are the same people that were supposed to be supporting them and support supposed to be helping these communities, yeah and I. Think it's really important to note. You can see Elston Howard here. He I'm pretty sure he played with the Yankees and relating back to just overall like the black representation. There weren't often positive examples of black representation, especially in the 70s when these ads were produced and when, like this epidemic, really heightened and as Bashir was talking about like they were even like free, giving out free samples during this time, and so you can really see how, like these types of community feels and like oops I, don't apologize, and these like really just uplifting type of ads that really want to lure consumers in and especially during that time, when there was very little representation for black people, especially positive positive representation in the first place. But then you see these ads that contain things like black liberation and just being able to like be free and be in the country, and things like that, and all of these tactics are a major reason as to why still today, 9 out of 10 African-Americans smoke menthol products, black individuals are still affected. Today by having long lasting health issues. Bouncing off of my peers lives about black representation and disease marketing. We feel it is crucial to demonstrate how we can relate this to the events we've experienced in our daily lives. As you already know, the Covid-19 pandemic drastically changed all of our lives in more ways. We could have imagined whether directly or personally, this meeting virtually is a testament of that, though members of all races have lost their lives. Black communities are among the most vulnerable to this pandemic. In fact, studies say: black individuals are two times more likely to die from Covid-19 than an average individual belonging to a different race. This is not because they have a different genetic composition or mutation within their race, but simply because they have pre-existing conditions that generally stem from tobacco use. Black individuals smoke methyl cigarettes in higher numbers, and this in turn, causes them to be predisposed to Coppin because of the health issues that can develop. This includes heart disease, lung cancer and respiratory infections, from what we promote you've, most likely seen for your own family friends, and even the news badly coped with the past disease. It's not ideal because the survival rate will ultimately decrease. We've lost thousands of members of our black community because of these past conditions from tobacco products that cause them to fall victim to the virus. You can also see the relevance of this issue today through the Blm movement, also known as the black lives matter movement, which was largely present during the month of June, but is still of great prominence. Today, five people were protesting their rights because they are being seen as inferior in today's society, the black community is not being valued in the same way. Members of our privileged races are and continue to be, the targeted race in the black lives. Black lungs, film, Julia Assange, poses the question: what is the worth of a black body in the United States and from the times where now we can definitely see that the black bodies are not being shown the desert birth and so tobacco use can really be seen in a broader light with the Covid-19 pandemic and the Blm movement, the black community, being targeted is really no surprise that these issues will continue to prevail. All flavors, besides method were banned for a clear reason, and so we hope we can rely on your support to aid in this issue and protect the black community, which is ultimately the mission behind reality check yes, great job everyone, and now we're opening the floor up to questions you can type them I think the Q&A function. I, don't think you guys are utilizing the chat right about now, but yes, and if you also feel comfortable to verbally, say that that's cool fabulous work that is fabulous. Work I want to ask the committee if they have any questions Luke, if you can, let me know, I'm am I seeing any hands or if you guys want me to like go back in the slides refresh. While people are thinking of questions. I just want to point out just in New York City specific data is 85 of african american smokers in New, York, City use menthol products and seventy percent of the hispanic smokers use menthol products in New, York City, as I mentioned. You know this is a problem for our city and state, because we have a flavor ban for tobacco products that was passed a couple years ago banning flavor tobacco products, and we also have a new flavor ban for electronic cigarettes. However, Menthol was left out of the tobacco flavor ban and still is, and really it's the most dangerous flavor, because it is cooling to the lungs it's cooling to the throat. It is shown that those who use menthol tobacco products get addicted at higher rates, and it's also harder for them to quit. So it is the most dangerous flavor. However, it's still left out there to be legalized and obviously affecting you know different communities at disproportionate rates. Could you explain why it was left out? That's a good question. I think at the time, maybe that the awareness may have been not there. That's I mean that's. All I could speak to I'm not sure otherwise. I also think you know that's. This is why we are doing what we're doing and why Realitycheck is doing what they're doing is to create the awareness. I. Don't think a lot of people realize how this is a health disparity. You know, I think a lot of people think we have so many tobacco laws and we've done so much like what more is there to do. We've beat the tobacco epidemic and that's simply not true. We do have a large health disparities and menthols tobacco use among communities of color is one of them and I. Think. Unfortunately, just in the last couple years, public health has started really focusing on health disparities as we're realizing that there's a lot of gaps in our policies and regulations. So that's my assumption as to why maybe that wasn't done in the first place, but I think it needs to be obviously a larger discussion involving our communities of color and our residents. You know and creating awareness that this is something that is still happening to this day. It has not gone away. If you go into some neighborhoods in communities of color, the ads are primarily mental. You know that the ads that you see on the bodegas and the convenience stores- and things like that, so it is still happening today and it is something that still needs to be addressed and obviously, as they mentioned. This is very timely because we know that tobacco use is a exacerbator for Covid-19 related symptoms and we do see that Covid-19 is disproportionately affecting certain communities, so this again doesn't need to be happening. Really. I should also mention before. If anyone has any questions the quit line, if anyone is interested in the New York state quit line is offering up to three months of free nicotine gum. That's a lot. They usually offer like a two week supply of nicotine replacement therapy. So if anyone is looking or if you have anyone that you clients are frequent in your organizations, have them check out the quit line. Now is the time they're, giving a plethora of free nicotine replacement therapy. That is the state's quit line. I wanna, add something I think it's important to say that if there's anyone on the committee that did not watch the black lives black lungs film. Prior to this, as was expected, please definitely do because a lot of the issues that our youth are speaking to are urgent and very important and I do know that we will take questions, but they wanted to come in and make sure that the the committee and the community board at large could play a certain role in this educational aspect and I. Think I may not mention that, but I think it begs on mentioning again because there's a reason they're here today. So we really do welcome your questions or clarifications and, more importantly, we would love to talk about how we can work together going forward, because when we say this is an epidemic, we're not exaggerating the tobacco companies have targeted the black community systematically for 30 years, and it's just incredible how much people do not know about this. So please not see the presentation by our young leaders as exhaustive, because there is more to be learned from the film, and this is a continuation of the work that they are open. They can do with this committee and the community board at large going forward. Thank you. Rachel I see you have your hand up yes. Well, first of all, thank you so much to the presenters as a really informative video that you sent and presentation. So thank you so much for coming and speaking. Sorry if this got mentioned, but is there any current pending legislation in the city council that addresses this problem in any sense? Just again to the previous point that was made thinking about ways that maybe we can help here yeah. So there was talks about at the time. If you recall, I'm not sure if you all know, but again, the electronic cigarette. There was a flavor ban that was passed a couple months ago on all electronic cigarette flavors. There was talks about introducing a bill that also covered menthol tobacco products. However, I think it just needed more talks amongst the community and certain things to figure out how they would do it making sure they did it. You know smartly, obviously there's we don't want to create a situation where communities of color feel targeted if they have mental tobacco products or anything like that, and it's not simply about not being able to have mental tobacco products, but it's just obviously the sale of mental tobacco products. But, as we know you know, we want to make sure that it's done correctly and that there's not going to be any concerns in those regards. So I do think that our city elected officials are still like talking about it, but it's not on the table right now and I do think they want to hear more from the community honestly about it and to hear that you know this is something that folks find important, not that they don't find it important. But you know obviously things get shuffled around and then priorities take over and things like that, but I do think it needs to be reintroduce the community and talked about, and you know more awareness happening. Thank you. I want to ask the committee if they have any further questions. Looking for raised hands in the function any raised hands, I'm gonna I'm seeing none. So I'm going to turn to the attendees and see if I have any raised hands there. Any questions. Okay, I'm not seeing I'm seeing none I have a question you mentioned that you would like to partner with us going forward. What is the best way that you see us as being helpful in working with you on this issue? Well, that's a perfect segue to our ask I'll propose to ask that we came here today and we came here today with a purpose and a main goal to educate others and help make a change in your community. Of course, we believe that reaching this film to a greater audience would be beneficial in making the change. Firstly, we would like to work with you to screen this film to the people of district 5 in a form of a webinar. The community's awareness of tobacco companies, strategic targeting and advertisement, can help make them aware and not be a victim towards it. Secondly, reality check members, including myself, have all written, informative, Op-Eds regarding menthol smoking, second-hand smoking, vaping epidemic targeting of a new generation and many more amongst those topics, and would love the opportunity to be featured in your newsletters. If there are any other methods of raising awareness or taking action that come up, please feel free to email us we will post our email in the chat below fabulous. Thank you so much for presenting and all your work on this. It's really an important topic. What I will say is our district manager. I believe, is on the call, and we do have a newsletter and we'll figure out if we can include your op-Eds in that and we'll continue to keep the lines of communication open. Thank you so much. It's really an impressive film and something that's very important. Thank you for having me for having us. Thank you. We will keep in contact. Okay, I'm going to turn now. It seems a lifetime ago, but back in February of 2020, the Flatiron bid came to Bex in person and presented their expansion plan, which was unanimously accepted by this committee, and then that support was confirmed by our full board you're, going to recall that the plan extends the bid north up several blocks to about 31st and 32nd and west over to 6th Avenue James, Metham and Kurt Cavanaugh are here to update us on what's happening with the expansion I'm going to thanks turn that over to Kurt and James thanks everyone thanks Renee. Yes, it's been a it's been quite a road since we last met in person I think about a week before things really hit the fan, but we're grateful to be back in front of you with some updates. I'm happy to give a quick overview again, just to refresh everyone's memory. We walked through similar slides back in at the end of February, but got some updates and, of course, while everyone's been working so diligently to stem the tide throughout the past eight months, particularly our businesses, things don't stay static as well when it comes to initiative like this. So we do have some updates and we're happy to report that this is closing in on moving forward more formally, which is why we're back to talk with you so I'll run through this quickly. Kurt's gonna, Kurt Kavanaugh is going to be driving. This he's our director of streetscape operations and capital, so Kurt. Let's, you can hit the so we're going to start with some quick facts again, just to refresh everyone's memories on what we're talking about when it comes to this expansion and then we'll go into some further items. Okay, thank you Kurt. So, in the orange the map in front of you, the orange again is the existing Flatiron 23rd street partnership. It's been roughly from about 21st street, up to 28th street kind of tapering away from sixth avenue on the west and extending past Park Avenue south over to Third Avenue for the Baruch campus. We've been in existence for about 14 years now, providing business improvement, district supplemental services like cleanliness, public safety, almost outreach, beautification and district marketing promotions and advocacy. During that time we are proposing, after many several years of planning and outreach to expand our service area upwards, to 31St street, as Renee mentioned up sixth avenue, and that corridor really, including the nomad area of Midtown south here and kind of squaring the district fully making this rather than a blob around Madison Square Park. This would be a firm rectangle of Midtown south from 6th avenue over to park Avenue for the most part and there's also a 20th street extension as well to be our southern boundary and all in all this is a hundred block faces additional block faces. Nearly 1400 properties are included here. That includes condos condo units. That's made up of 300,344 commercial mixed-use properties over a thousand residential, some bacon, and some government owned properties as well. We're talking about just under a thousand commercial tenants upper floor ground floor included there 30,000 residential units, roughly a workforce of you know you know- was it was thirty, seven thousand we're hoping it returns to that number as soon as we can in 2021, and we use an assessment for the formula based on the square foot of a property to determine how these businesses these properties are assessed and I'll get into that later. So, just for a reminder on why there was a need and there continues to be a need to expand the bid and provider services. You know number of streetscape conditions, quality of life concerns that you know were. Certainly we were faced with before the pandemic have been exasperated in many regards since the pandemic started. You heard some of that earlier tonight with department of Homeland, Services Social services and the outreach teams, but in addition to that, there's just as I like to say, there's a good amount of tender, love and care that just needs to be looked after and provided on a daily basis when it comes to the kind of curb appeal of the greater area, and we do that every day in the current bid and there's more to do in the expanded sixth Avenue corridor and nomad. And then, as I mentioned. You know, there's been a number of things that have occurred over the past six or so months. Whether it was the aftermath of some looting and vandalism in early June up and down Fifth, Avenue, Broadway and sixth avenue. We work to help. You know, go work with our businesses, both in the bid and outside of the bid to help clean up after those tough nights. There's been certainly a number of corners and nodes that have been impacted by you know just trash conditions, some illegal vending working with some encampments. We've worked with our city partners to try to address many of these, both in and in the expan in the district and the expansion area. There's certainly a good amount of development, too. That's happening, whether it's around Broadway or just off Broadway and we've worked with our business partners in the expansion area to help with open streets and outdoor dining Broadway has been a pretty good success as an open street one of the first of its kind in Manhattan, and we're really happy to see the number of businesses take advantage of that for dining opportunities to keep them afloat as well as 20th street down on between Park Avenue, South and Broadway, and so over the years I've mentioned this before when we mentioned you know, we've surveyed every businesses we've surveyed residents, we've kept that stakeholder connection strong to inform what types of services would resonate in the district in the expansion area. If we were to provide services on a daily basis and, of course, cleanliness, public safety, we're at the forefront of that, as well as homeless, outreach, streetscape improvements, horticulture urban design, safety enhancements for the neighborhood and ongoing business support, district marketing and regulatory navigation for businesses, and then, ultimately, you know we filling out an advocacy role. You know, in addition to the community board the 29th Streets Association, you know having another voice to really push the agenda of the greater flat iron nomad community on issues that pertain to it in its businesses, and so that's very much about what we as a bid as a business improvement district. Do you know we're a liaison to government we're we I like to think of ourselves as a clearinghouse on important economic trends and information to help. You know, especially going forward push for the the return to vibrancy and intending in Midtown south. You know we promote neighborhood events and attractions that make the area so vibrant in the institutions and culturals that are a part of it, provide that access to city government serve as a resource for emergency management and relief efforts. We've certainly got a big dose of that over the past nine months and again, prioritizing local business needs for economic recovery, which is obviously going to be a driving force of the work over the coming years. So how do we get to the services and programs that we provide on a daily basis? Those you know whether it's clean and safe or economic support and resiliency? We assess properties. This is done through the city's real estate, taxing authority. We collect currently about 3.25 million dollars from commercial property owners in the current district. All that money comes circles back through the city back to the non-profit responsible for administering these services on a daily basis. That's the Flatiron 23rd street partnership, and what we're proposing here, given that this is nearly doubling the size of the current district, is a it's roughly, a 2.75 million dollar assessment on the expansion area, making this full operation, if and when expanded about a six million dollar operation and we break down those costs across our core services. Sanitation, public Safety, Marketing Social services, which includes homeless outreach in collaboration with the city, are public improvements and beautification work and then General administration and a reserve and how these assessments are applied to specific properties for the most part they're applied, as I mentioned, to retail commercial and professional uses, so commercial spaces pay roughly 16 cents per square foot. If this is a big driving force of this expansion was to peg that amount to what current property owners are paying in the existing district, so that it's equal across the playing field in the district and the expansion area, and we've done that here and we have a couple other classes. The one of note that is a little bit different in this case is this mix used over 200,000 square foot assessment. That's a2 on your chart that is looking at income producing mixed-use buildings. These are the large rental Reta residential buildings that, for the most part, lined 6th avenue. In this case, we apply a reduce rate on the full building, we're proposing a reduce rate of about 40 percent of what commercial properties pay. So this is about six and a half square six and a half cents per square foot that that's necessary in order to do the you know the real work, particularly on sixth avenue, between 23rd and 31st street, otherwise, residential condos and co-ops pay just one dollar a year, it's more of a symbolic gesture and contribution, but obviously, given that this is a mixed-use neighborhood, you know it's critical, that the services we provide are you know shared in benefit to both the businesses and the residents that make Flatiron and nomads so great. Otherwise these are the standard rates that we apply currently in our district Kurt. There we go so how what we've been up to some of this is a rehash of where we were in February, but there's been some updates. As many of you know, we've been at this for a few years. The process of expanding a bid before we even get into the formal approval process is very extensive and meant to be very transparent. So you know, Steering Committee has been in existence for over nearly three four years. At this point, we've done conducted needs assessments, developed an expansion plan, we've held public meetings, we conducted ongoing outreach and documenting of support, and then finally, after we met with with Bex in February in April of the spring, we did submit our proposal to the city and the department of small business services, who is the usher of this of bid, expansions and business formations and that you know at that point they review and determine whether or not it's going to go into public review and legislative approval. So that's where we were in April and I'll just pause here for a second Kurt. You know, given the fact that we were in the teeth of the pandemic. At that point, you know rightfully, so we expected this. You know things paused, and so this had been sitting through most of the spring and the summer until the city had re unfrozen, its land-use processes, and so since October since September October, we've been working with the city to kind of talk through some issues update them on some further up outreach that we've been doing in anticipation of actually moving this into the public review, which is essentially a uniform land use review process a ulurp for bids I'll get into that shortly, so just a rehash for everyone again. Our steering committee consists of both commercial property owners, residential property owners and developers, small businesses, big businesses, residential stakeholders, residential groups, hotels. So it's really across the spectrum of Pl of local stakeholders in flat iron and nomad, and it's been in existence since 2016. and that as I mentioned earlier, you know lots of outreach. So that's been, you know, ground floor canvassing, that's been newsletters and it's in a dedicated expansion website brochures sent direct mail to every single address in the expansion area, direct mailings to co-ops and condo associations, speaking specifically with some of the sixth avenue rental towers, to gauge their interest, press community meetings, elected official and community board updates, and then, of course, as we went into Covid-19, really focusing on how our services and relief and recovery support efforts could be implemented in the expansion area, despite us not being permanently there keep going Kurt so yep, here's just some collateral, that's been out and about in the district. In the expansion district over the past year, some community meetings that we've held throughout this both pre-pandemic and in the time of zoom and yeah. As I mentioned. You know, we really shifted our efforts as a bid come last March and through the through now on ways. We could support our businesses and get them access to both information and relief, and that's been you know, advocating for legislation with the rest of our business improvement. District colleagues, it's been educating our our small businesses and our tenants on legal guidance that they can had. We had a seminar with the legal aid society this summer. We did a an initiative this spring in May, where we coupled small local restaurants to help keep their doors open, providing meals to our first responders for 30 straight consecutive days, feeding the Ems, firefighters and local precincts. We've worked on. We really dove into the city's all in Flatiron, all in NYC campaign to support our businesses in hospitality, running our own, all in Flatiron and all in nomad district deals campaign, this September and, of course, providing PPE to as many businesses like as we can in collaboration with the city, and during this too we've looked at like we looked at ways to think about a bit a better Flatiron, a better nomad that really further embraces the public realm and the open spaces that we do have, whether that's sidewalks and streets that have really strongly been illuminated through the open streets and outdoor dining and open storefronts campaigns this year. Thinking about Broadway with the department of transportation and really enlivening these streets. So that they're both places that people want to be in, but can also you know, places where business residents can feel safe being in as we you know, cult as we get through this as we get through this coming year, and so most recently this fall we've. You know: we've upped our outreach and awareness, more we've mailed out 6,000 postcards about a month or so ago to everyone again, just letting them know that the effort was still you know, moving forward and open for feedback and suggestions. We've done that continuously throughout the fall- and you know continue to gather support for this as we awaited the city's decision on moving ahead or not, and so where we are right now and what we've shown the city we've been documenting support for this, as I said for now over for over a year now, and some of the key metrics that we are we've been tasked with conveying to the city to show that there's backing for this proposal is looking about. Looking at the total amount of assessed value in the expansion district, we set a target of 50 percent total assessed value commercial space, assessed value, we've hit that threshold and exceeded it. We're about 56 percent of the total commercial assessed value in the expansion is in support of this, and we have documented support for that. Nearly 40 36 percent of the total residential supports this 21 of all. The prop commercial properties have shown support for this forty percent of residential properties and commercial tenants, and, of course, there are thousands of the them. Nearly a thousand of them in the district were at six percent and residential tenants at 23, and one of the big things here is that, throughout all this, we've had less than one percent of owners, commercial or residential. Come back to us and say you know what we're not interested in this and that's been throughout the past year, despite you know, constantly giving everyone an opportunity to come back to us and what we found is that there's just overwhelming support for this, and now more than ever frankly, given the state of affairs and lack of some of the lack of the funding that the city and their services can provide in Midtown south so where we are and before I, just stop there and open it up. As I mentioned, we've submitted this to the city, we're told now that they are close to filing it with the city, Planning Comm Department of City planning, which would kick off a eulers of sorts, which means that they'd be sending the proposal to the community boards in the district. Looking like the beginning of December, so we wanted to come back to just refresh everyone's memory and again ask for your support and also you know, field. Any questions, of course that have come may have come up over the past six months, six plus months since we last met. Thank you so much. Thank you. I see a question straight off: James it's from Victoria Watkins who's, not on our board, but she's asking why the proposed bid boundary has not extended to the southeast corner of Madison, Avenue and 32nd street. She said on Park Avenue South. The proposed boundary is to the southeast corner of 32nd street I. Don't really pull up that Kurt's going to get the map you said Matt at Madison and 32nd was that yeah we for the most part we, you know we spent a lot of time thinking about boundaries here and I've. You know, we've gotten. A lot of you know feedback from folks, both west of Us East of Us, south of us and north of us about going further. There is another bid that is just due north of these current boundaries. It's not a perfect contiguous, it's not a perfect boundary line, but we decided that 31st street, with the exception of the one right corner at 32nd and park, that particular that's where Nyu Langone is between 33rd and 32nd. That would be the one extension that we included otherwise 31St street. I'm sorry the 32nd street would be one. It was going to be a little bit too far and we felt it was more of Herald Square Midtown 34th street partnership focus okay. Thank you. I'm going to turn it over to the committee for questions. If you use the raised hand, I have married Brosnahan a great presentation, I'm a bit confused on page 22 when you're breaking down your summary of support. It seems to be weighted to frankly the big players, because when you drop down to the commercial properties and commercial tenants, the support really dwindles. So I'm wondering how you are gauging support versus opposition right. So we look at these specifically we broke it. We break it down by property owners and by tenants and so right, so commercial properties there there's some 1,350 or so properties, we've garnered and actually Kurt. If you want to there's a real breakdown, if you want to, if you scroll down a few more I didn't include it here, but if you go to the bottom of the exhibit section here, this will give you a merry. This will give you a a much more detailed breakdown of how this all works so right, so commercial properties, we have some 340 properties. We've received 75 responses in total from those three 344 73 of which said they support this and have signed on to it. We've received two that say that they don't when it comes to the commercial tenants. There's some 900, plus 924 tenants that we've identified. We have about 56 that have actually put pen to paper and say: yes, I want this now a lot of those 926. You know the vast majority. More than three quarters are upper floor, tenants, a lot of which are small offices, and you know, we've done everything in our power to reach out to them and find out if they have any concerns of support. As you can see, you know we don't have a you know the highest level of response rate, but those that have responded have all responded in support of it right, but so they're obviously worried. Are they not that whatever bid tax is going to be levied is going to wind up getting baked into their leases right? Well, I would say: I, don't know, I, don't think we consider them worried, otherwise we would have expected to hear from them in act and getting back to us saying that they do not support this in terms of how the assessment is passed through, that's all tied to individual agreements and with their landlords. You know, for the most part, our assessments about 16 cents. A square foot is a cut few for most typical, let's say for a ground floor retailer of 3,500 square feet. That's a few hundred dollars and I totally understand at this point. In particular, any amount of money extra is difficult to provide, however, that gets them daily, sidewalk cleaning that we do that provides them with our public safety unit. It provides us provides them with our marketing department, our advocacy work. It provides them with another voice in a channel to work with to advocate for their concerns and work for them to make sure that their you know, their storefronts or their district as a whole is functioning well for them. Thanks I have a comment: I'll hold that till later more questions from the committee. You use the raise hand, function, I have a question James. Do you imagine that you're going to have to rejigger, given what's going on with the pandemic in the coming years, the 16 cents per square foot or the budget that you've originally prepared I mean we're prepared for anything. You know it's we're. We feel that the 16 cents, a square foot is probably is one of, if not the lowest one of the two lowest assessment rates in Midtown south I mean there's good five or six other bids in our neighborhood that all have assessment rates. Far above that amount, we pride ourselves on doing a lot with a little, but by all means, if you know the circumstances dictate, we've had to cut our budget this year to make do we will do it at the same time we're finding that it's more necessary than ever to be providing the services that we do on a daily basis, given the much more substantial cuts that city services are taking at this time. Thank you I'm going to ask if there are any more questions from our committee members, I'm seeing none. So I'm going to turn it over to the attendees. I see two questions there. One we received James is how can I confirm it's from Leslie Hendricks? How can I confirm my building is noted as supporting I'm my co-op president and talked to the bid last year, but haven't gotten any contact other than a mass mailing thanks, Leslie yeah, no under that's, certainly understandable I mean we were hoping to have moved this forward a lot sooner since we spoke. Of course, things got stalled over the past nine months, but yes, I'm happy to confirm it. Leslie I think we've been in touch so I can get back to you, but if anyone has any questions about whether or not their you know, property business residence is one in the district they can reach out to us. On our website. Flatirondistrict.Nyc there's a section devoted to pit to the bid, expansion and there's a statement, support section as well as reaching out to me I. Can we can confirm that you're in it and it's been really? If anything I mean look, we've received such an overwhelming level of support, particularly from residents those numbers that you see here. You were nearly half of that when we met in February, and so, if anything over the past that 408 number you see, that was about 260 when we met in February. So it's just. It's only grown significantly over the past nine months. So yes, we're happy to confirm and hopeful that next steps here is that this will go into the public approval process that takes six to nine months and we're looking, hopefully for some time this time next year, perhaps when we can actually be providing direct services to the neighborhood. Thank you I'm going to refer to another question that we have. This is again about the south side of 32nd street I know you addressed this, but the panelists are saying that the 34th street partnership does not cover the south side of 32nd street she's, urging us to support extending the boundary on Madison Avenue to the southeast corner of 32nd Street, and she wants to know how should the public submit comments to encourage that? What public agency I? Don't know if you want to address that I think it's that little cutout 30-second stream thanks. Yes, thanks Kurt yep, there you go yeah, there is there's. Certainly there is a gap. Some of this was assessed by some initial feedback over the years about whether or not to include it or not. Koreatown was one piece of this as well, but by all means you can the way this works once this is submitted. Is that there's an opportunity to so? You can submit anything to us to the department of small business services who are the guardians of this process, and then there will be if things move forward, there will be hearings at both the city, Planning Commission, which will likely take place in January of this moves on the schedule that I mentioned, as well as the city Council. So you can also mention it to your city, council member powers as well, and you know, while you know we had to draw the line somewhere, we're moving forward and we're happy to hear if there's a real interest in expanding it can't promise it ends up happening, but by all means understand the sentiment. Thank you any more questions from the attendees okay, seeing none I'm going to move back to our committee members I know. Mary. You had a comment: yeah I'll just admit off the top that having had a history with having to sue the grand central partnership successfully in federal court because of their treatment of homeless people. I, don't know if you guys are aware of it goes back a few years, but you know they had a quote-Unquote homeless outreach program that essentially paid homeless people a dollar an hour to evict other homeless people from atms and other private properties. I just would caution. It just seems to be this creeping privatization. What of what our partic? You know historically public realm duties, and you know it's no reflection on you James or Kurt, but I. Just would add that note of caution, I'm not sure, especially given the pandemic, that we're facing that I could get behind leveling a new tax on already struggling businesses thanks Mary I, understand I, do have some of the history on on that with grand central partnership and look by all means. Look. We I think the Iowa Homeless Outreach program has been in place now for nearly 14 years. We work with the with urban pathways as our client provider. We consider honestly, we consider the Palmer's population. You know part of our neighborhood I mean there's so many there. We have a number of chronic homeless individuals on the street. Who've been here with us for a number of years, and the role we play here is simply to establish a relationship similar to what you heard earlier, so that if and when somebody wants to ask access service and get support, they have a a welcoming and familiar face to do that and that's how I intend to continue it. Now, more than ever and so and of course, you're right I mean we do hear you'll hear from property owners you'll hear from businesses about how do I get rid of so, and so it was set up in front of my shop or under my scaffolding, and we try to use our a balanced approach of making that constituency understand the rights of individuals that are without shelter, while also trying to also make sure it's a safe environment for them and for the community as a whole. So it's something we take. You know we pay very close attention to, and- and you know it's you know, working with this committee working with Renee, it's Renae sits on our board, which we're very thankful for- and you know any issues or any guidance on any of that. We're always open to it. Thanks James I appreciate it thanks any more comments from our committee. I see none so James and Kurt. We are on record as supporting the fullbodies on record. We have the resolution in support of the expansion of the bid. How do we move this forward with you? What's the next step? Yeah, our understanding and Kurt you jump in anywhere if you feel I'm getting this wrong. Our understanding is that, at the end of the month, the department of small business services and city hall will officially certify and file the proposal to this department of city planning. They in turn send it out to all impacted community boards. We happen to be in three of them. 95 percent of this expansion is in CB5 a little b. A little piece on the west is CB4. None in Cv6, so they'll be sending it out, and at that point it's up to the community board as to whether or not they use your recommendation as the clearing if it needs to go to the full board or the executive committee. We're open to it's up to you and I know. Maurice is on the call, and so we have we know you're. We know that the calendar for the dates I think it's the eighth and the tenth executive in full board. We're happy to attend. If you need us there, but yeah. That would be the next step. Okay right, so we will just keep in contact with you and figure out how we move forward in that once we have the timing. Thank you very much really appreciate really appreciate you being here for the update guys. Thank you thanks everyone. Okay. Last but not least, our last item involves consideration of some of the proposed legislation around street vending. Our fellow Committee member, Zach Bahar, has done incredible work in researching and putting together a document. I sent it to you earlier. It summarizes what's happening in the area. Again, this is a non-action item. Tonight, it's complex. What we're doing is we're just going to spend a little bit of time. I know it's getting late, we'll spend about 15 or 20 minutes still has the timer on teasing out all the issues that we need to understand. So when we bring this back to the committee and Tne together, because it's not just a vex issue, we'll have all the information that we need and answers to questions that we can post tonight. I'm gonna turn the presentation over to Zach who's, going to give us a brief summary, and then we can move to the questions or comments that we think we need the answers to great thanks. Renee I'll probably keep it higher level, and you know people feel anyone feel free to ask questions as I go and I'll first just kind of give an overview of the street vendor market in New York and then some of the legislation that was proposed back in 2018 and then followed by some of the views expressed by business improvement districts by the street vendor project, as well as by some public officials. But you know on page two of the deck I really you know the street vendor market is you know the issue it's very similar to the taxi medallion market and that they issue a fixed number of permits and then those permits you know oftentimes are either returned to the city or trade hands among different holders, and so in New, York City limits this the total number of city-wide mobile bending permits at 2,900. It's a number: that's been capped since 1983. there's an additional 2200 permits that are issued each year for seasonal food vending, but you know, based on you know, based on a number of articles demand, you know pretty clearly exceeds supply, you know, and so this kind of ends up resulting in a market. You know, as I said it's very similar to the taxi medallion market. Where permits can often you know trade, you know well in excess of what they're issued for I think it's a few hundred bucks generally to you know, buy a permit from the city, but there's examples of the I know of them trading and what would be the secondary market, for you know thousands tens of thousands of dollars and so that doesn't really create really so that creates kind of a you know, unique environment, for you know the people that are operating or owning these street vendor cards because they're generally, you know not, you know, probably the in the highest income, demographic and so that's ends up being a lot of money. For you know someone that's operating a street vendor street gender car. You know on the next few slides I kind of give an overview of some of the legislation that was proposed back in 2018 when a few of the New York City Council members, you know wanted to increase and significantly increase the number of permits that were issued each year. They would be issued in batches starting in 2019 and kind of ramping up to 2029, and so there are three pieces of legislation: Intro 1116, Intro, 0288 and Intro 0287 Intro 1116 is probably the most. You know significant of these, in that it deals with the number of street vendors sorry street permits that would be issued as well as some of the regulation around. You know how those street vendors would be. You know what might have to operate. The following two pieces of legislation are more. You know, while still important more I'd, say almost logistical in nature in regards to the stipulate how far street vendors must be from certain signs and how far they need to be from the curb. Ultimately, the you know- and Marisa was really helpful with this, because I think she was, if I'm remembering correctly, the chief of staff of a former city council member, but I, think the legislation was never brought to a vote partially because the you know the current head of the current speaker of the New York City Council was considering a run for mayor, and this is a pretty controversial topic. You know he's no longer considering a run for mayor and so I guess there's a chance that this legislation has revived at some point. I just thought. I'd give a little bit of the historical context there you know. Marissa was also really kind of helpful in kind of getting putting me in touch with a few of the business improvement districts. You know some of them have more formal statements. Some of them had testimony in front of the New York City Council, so I tried to summarize you know some of their views. You know I would I don't want to insert too much opinion in this I think there's some things that the business improvement districts as a whole. You know claim that our statements that they make that are fair and some that are, you, know, kind of unfair. So you know to summarize, you know the claims that I, you know view is fair or that you know street vendors offer increased competition for existing restaurants and cafes. You know, especially given the strain put on restaurants from Covid-19. You know. A second point they make is regards to quality of life. You know carts street vending carts vary in size, but many of them, you know, can be quite large and they take up space on sidewalks in some parts of CB5. Are you know the sidewalks are larger or smaller in certain areas and they can create. You know increased congestion areas that already suffer from congestion issues. The third point- a lot of the bids often make- is that the enforcement of existing laws that govern street lenders is street. Vendors is relatively weak, and so, if there would be a you know, a market increase in the number of street vending permits. You know the laws would be even further ignored. You know the street vendors then sorry. The bids, however, make a number of claims that I would view as somewhat unfair. You know, for example, you know one bid claims that street vendors don't or you know don't pay taxes, that's very likely, not the case, given that they probably pay personal income taxes. You know from their you know: what's you know, in effect a sole proprietorship or an llc? You know, like some claim that you know the carts are not clean. You know, I, don't think, that's necessarily a fair generalization. You know, I'm sure there are anecdotal examples of street vending carts, not being cleaned but I. Don't think it's fair to paint the broad swath of them. As you know, unclean you know. Another point is that pedestrians in Midtown are often compelled to walk in the streets. You know I think all of us have been in Midtown at various points. You know, I, don't think most of us are walking on the streets. You know 90 of the time and then there's comments about how the increase in the number of street vending licenses would enrich. You know quote: unquote: fat cats, I, don't know if a few extra, if you know, if a few thousand extra street vendors necessarily gonna enrich you, know entrenched interests, then kind of you know pivoting to the other side of the argument. There is the largest kind of group that advocates on behalf of street vendors is called the street vendor project you know and similar to the bids they make claims that I think are you know some are fair and some are unfair. You know I, think you know a fair point that they make is that the number of permits hasn't been increased since 1983. You know thus creating a market. You know similar to the taxi medallion market. That's 20, 30 years, without a over 30 years that increase in the number of permits, while the population of the city has grown, you know pretty significantly. Other issues they raise are those of kind of economic equality. I don't want to. You know, prove, but I want to put forward an opinion on that. Just given it is a sensitive issue. You know some of the unfair claims I think they make are in. Regards to the economic interest impacts on Manhattan, you know which does have the disproportionate number of street vendors. They claim or maybe carry the economic impact on the city. They you know claim you know that supposedly nearly 293 million dollars is contributed to the city's economy. Through you know, street vendors there's no mention of whether you know they really evaluate the negative impacts on local restaurants and cafes, and then there's you know, taking a step back. There's know, I think a value judgment that needs to be made about prioritizing. You know the quality of life of people that live in the community board districts of Manhattan versus you know, opportunities for folks that live outside of Manhattan. Who are you know more often than not the ones commuting into Manhattan to you know to work at through that street as a street vendor? And so and then you know at the back their last page, I just have a few statements relatively recent statements from public officials, local public officials that you know have been advocating on behalf of of the street vendor of street vendors. So I'll pause there I know I didn't go into any necessarily great detail, but you know I think there's a lot of you know that was kind of intentional that there's you know this is some somewhat controversial issue and I didn't want to. You know I'd rather kind of solicit questions and opinions before going into more detail. Thank you, Zach. The way that we're gonna do this. If you remember, we had the same issue, we were talking about the budget, particularly with regard to police funding when we're putting together our budget statements in the summer, so I want to break it up over two sessions. This is not an action item again. This is to use out how Rachel always says we want data driven information, so I want to figure out how what it is that the committee is interested in what we want to know as we think about this Zach's done a great job in terms of putting together what he has. But how do we think about this, and this is our first cut at it, but it's not an action item. So, let's take some questions and comments from our committee. Anyone Joe Mafia, hi, Zach, I, don't I know that the 34th street partnership, just for your information and for everyone's information, the 34th street partnership has worked with some vendors to help them upgrade and replace their carts to make it look, have a more modern look to get rid of some of the neon signs and and to really upgrade the look for the district I just thought you would you should know that I think that's helpful to you and I mean in all candor. We didn't, you know, get feedback from every single business improvement district, so you know that hopefully, will be kind of part of the next iteration of this. Thank you more questions from the committee. What you know, as you think about this, what are the things that you Rachel? I'm just wondering if this is something we should work with, parks on I was on the committee for a year and I feel like Clayton and others have like pretty strong opinions about vendors and that type of activity. I, don't know if it's something they've ever like. Well, obviously, they deal with like newsstand applications on a regular basis, which I feel like has like a similar kind of feel, but I don't know if it's something that they've ever looked at in detail or dealt with on a more regular basis. All right Zach is working on this we're going to work on this with tne. We are going to work on with this in tuning. This is just the first cut to gather as much. This is a a multi-faceted issue. As Zach said, it's potentially controversial, there's different pieces to it, and so, rather than just dumping it into you know one session and quickly going through it. I know we like to consider all of those pieces, so I just wanted to try and get as much as possible, but we will be doing it with Tna, eventually, yeah. Oh I definitely agree, and this is an awesome, comprehensive presentation. So thank you. Zach I think it could be good to work with parks in some capacity too in the future. Thanks Rachel. What would you like to know in terms of thinking about this? Is there something that would help? You think about this in a more critical way or help you come to a decision on how you think about some of the initiatives that are offered by the legislation. Is that a question at me or at the before generator I, don't mean to put you on the screen? Okay, it's like I, don't know if it's taught me I do think. If I'm gonna take a stab at answering that I think it's always helpful to see how other community boards have, if they've taken a stance on the issue. More broadly considering this as a city-wide issue, got it Mary, yeah, sorry to take up so much time tonight. Folks, I just have tremendous respect for Muhammad at the street vendors project, and you know we've given time to the to the business improvement district, albeit on a separate topic, but I would really welcome the opportunity for him to address the committee directly at some point. If time permits in future meetings, yeah I neglected to mention that, in fact, we would get both the vendors and the bids potentially with Tna. When we decide or talk about this as an action item for support or not I'm just trying to tease out what it is that we need to think about and what Zac may need to you know what other areas, what information is missing, for instance, I'd be interested to know. One of the questions I posed to Zach can a vendor once they get their license, just go and set up anywhere. What I think is the answer is that it's more of a question of what they're not allowed, where they're not allowed to go more, so were that more of so worth relative to where they are allowed to go, and so you know it's rules that prohibit them from being. You know a certain distance from certain signs from sidewalks from you know on streets that don't that prohibit street vending, and so that's how I kind of generally characterize it right. Are there any SBS promotions now to look at helping people move inside as opposed to street vending, because we were concerned about all our open, all our open, storefronts, sorry, it's SBS! So, in other words, I'm thinking that we have been concerned and we're on record as noting our concern for all of our empty storefronts in the district, and so I'm wondering are there any programs that help vendors maybe acquire a storefront or you know a permanent. You know brick and mortar establishment, I'm not sure, but yeah. Definitely a good question to look into right. Are there any other things that I know? We would want vendors, what other aspects of this, and maybe there's nothing but I just wanted to make sure that we tease this out. Is there any other information that you would want to consider when we move this forward, that we need to find the answer today? I can't raise you for some reason, but can I. It goes if yes, yeah thanks and yeah thanks Zach. This is your document was super helpful. I think you know in response to the some of the concerns that you listed from the bids. I mean I, guess the one that's kind of more implied that I think could be valid, is just this fear of like a wild west, where I think people are afraid of having a block where there's like half a dozen street vendors crowding the sidewalk. It's just like cluttered and dirty and I, get that and I. Think probably other people don't want that either. So I wonder if there's ever been any effort like in council member Chen's bill or elsewhere to be more specific about the geographical distribution I mean you talked about where you know how they specify exactly where the street vendors can not be. But has there been any talk of like a cap on like the number of vendors that are positioned on a certain block or a certain group of a group of blocks just to make sure that we don't have everyone crowded into the same kind of like micro area, because if I don't know, I think I would support a bill that expanded permits. As long as it did make sure that you know there wasn't going to be a whole lot in one small place. Yeah! No I think that's a very valid concern. I, don't know the answers to that. Okay and then I guess. Another question is that it looks like in council member Chen's bill. She was trying to address this concern about enforcement, which it seems valid if the existing kind of cleanliness and kind of permit regulations haven't been enforced, then why should we expand them, so she was advocating for a new unit, I'm assuming that was a new enforcement unit in NYPD that she was talking about, but I just wanted to confirm that, and if so you know I feel like now, especially with our board's kind of recent conversations about the NYPD. You know I think I would want to know whether there could be a different agency that might oversee regulation of street vendors. That might be better positioned to do that. Job, yeah, I, don't I, don't know if it's part of NYPD, but that's a good question, can I jump in for just a minute. They just to clarify that point for you. They are moving all enforcement of street vendors away from NYPD some similar concept around the homeless. Similarly, also they haven't quite figured out. What is the agency or funded that particular agency to do the work and the current administration has said they will come out with some guidance on that in January, but, for example, right now, NYPD is really not doing the enforcement and there won't be much through the end of the year. I don't know if it'll be department of Consumer Affairs Department of Health. You know it might depend on the type of vendor. It is whether it's a food, cart or some other type of vendor. But that's I think that's a big question. That's out there is what is the agency that will be running the show on this right? One of the things that Joe Mafia added as well is. It would be interesting to know how many licenses are in our district operating in our distance and a map with the location of the vendors. So we can get a sense of if we're seeing clustering now or what that looks like. So maybe if we could put that together as well, it would help us, as we think about this and I- think that Laurie put something from the speaker's office in the chat about the speakers, support to extend the opportunities but understands the need to bounce and increase the number of permits with real enforcement of vendor regulation. So she'll circle back for updates, I, don't want to I, don't want to keep anybody too long. We've had a very long meeting. I just want to see if there's any more comments or questions as we put this together. So when we move forward again on a very complicated issue, we have as much information that you think that you will need to consider as we you know, actually get president presenters and work with Tna. Are there any more comments or questions? Renee I have one more I kind of no. This is what this is. Yeah go ahead thanks, I, guess, kind of a comment: I think the kind of Zach's work you did a good job kind of surveying the bids and kind of the business community's opinions and concerns, but and I think this is harder to find so I don't even know where we've looked for it, but you know I, don't think I understand kind of what the average resident of the community board. The community district would think about this, and what the average employee right, like I, think the street vendors serve a lot of construction workers. A lot of commuters who come into the neighborhood from elsewhere, and a lot of people have just lived here- and you know, like I know, like it's kind of a different market like I, think people go to restaurants or you know, establishments that are more that actually have a lease. They want to have kind of a nicer meal, sometimes, but like a street vendor to me, that's like serves a different need and it's a lot cheaper, so I think I kind of take the businesses and the bids position with a grain of salt because they have an incentive to limit competition. It's like classic gatekeeping, but I'd also want to like make sure we're thinking about people who work and live in the neighborhood, yeah and I. Think I mean so I, my I, I'm kind of speaking off the cuff. My guess is that it's going to be, you know the best way to kind of get the average view of the resident is probably from quotes and newspaper articles, because I'm unless some survey has been done, which I'm guessing it hasn't and then you know yes, like different street vendors serve different purposes. If you were a cafe, you probably wouldn't want a street vendor serving coffee right outside your door, because you know that's immediate competition. If you're, you know, however, you know Maria, it probably isn't going to care. If they you know have you know a street vendor serving gyro. You know heroes 15 feet away. Other than that. You know it's going to annoy the clientele, but you know people dining at Maria aren't going to be know, buying street venting. You know buying heroes that evening, so I think it just depends on you know the restaurant or cafe the location. You know who the who you know, who are the who is the targeted demographic, so yeah I think there's a lot of nuance to that question: cool thanks. If any of our attendees have a question or comment that they want to add to this or anything else from our members all right, seeing none I think I'll wrap this up. We can also send any comments or questions to Zach as he continues to work on this and we move it forward to work with teeny and think about the issue again is just to tease it out and get your thoughts and get as much information. Thank you so much everyone for this evening. I know it was a long agenda. You were great with your comments and questions and I hope you all have a wonderful Thanksgiving. Thank you me too. Thanks. Renee good night, thanks for that bye, good night.",
            "summary": "We have a lot to cover this evening, so I'm going to ask if someone has already asked the question not to repeat it, to try and be respectful of people's time.\nI'm, the Manhattan borough director for the Department of Social Services, but I'm also joined on the line with my street outreach DHS colleagues, so just want to allow them to introduce themselves before I jump into it.\nThis security on site and security that also canvases outside of these hotel locations as well, and then the goal of them canvassing outside of the shelter site, is just to ensure that you know residents are being good neighbors in community if our clients are observed or are identified, staff is trained and advised to provide clients with PPE masks if needed, and also encourage them to you know if they're not being compliant, they will case conference them and work with them and assess if this is a good environment or a good location of space for them, and so we have security at all these sites, temporarily that we're temporarily utilizing we canvas outside of these locations.\nTo, you know kind of see some uptick in the exits in terms of clients exiting out of permanent out of temporary shelter and into permanent housing or supportive housing on the street homeless, outreach side.\nYou know we have streets, outreach on the line, but I'll allow breaking ground and speak to the work that they're doing but want to say, citywide we're still out canvassing.\nWe brought on a lot more bed capacity for our street homeless population, So you know folks.\nWe don't see an alarming increase of individuals coming into the system, but just saying that to state that you know, shelter is still operating, We're still 24 hours.\nWe have a mandate to provide temporary shelter for any individual in need, so I think I, hope, I kind of covered.\nYou know we are following the guidance of the CDC and the State Department of Health, so whenever they make a determination as to when it's wise and safe to exit our clients out of these settings and back into congregate, shelter, settings, I will be the first to come to the community and convey that message on what that will look like I know that we're in ongoing dialogues and conversations from city hall and other you know state officials on what this will look like, But we don't have anything concrete to share just yet, as it relates to the timeline.\nSo just want to take the opportunity to thank many of you that I've worked closely with on those efforts, So I know.\nWe call those tier two facilities, so we're hoping to pull out of close down, pull out of commercial hotels and provide you know, put families in a tier 2 facility setting where they can be provided with additional support services that can live on site and can have their own kitchens.\nSo there's a couple of ways in which we're engaging people and what we do is we contract out with non-profit providers in each borough, And they're responsible for providing that 24-hour day homeless, outreach.\nIt's all oriented around placing individuals getting individuals who are on the street inside, and that is the basis and doing everything they can when they encounter people who are homeless, who want to come inside everything they can to get them.\nWe have staff in the field and then staff who are in the office kind of operating from a command post, for if you will, and what they're doing, is they're, also engaging individuals on the street, Responding to reports of homelessness and then triaging and coordinating with a lot of our partner agencies in real time, as well as the outreach teams, so they're engaging somebody.\nThey provide mobile and street based psychiatry, as well as a mobile medical team that is comprised of nurses and nurse practitioners, in addition to the psychiatrists, so a multi-disciplinary team that includes licensed social workers, psychiatrists, nurses and so forth, and essentially we are out there 24 hours, a day, seven days, a week, trying to bring people inside and barring that linking them to the appropriate services based on their presentations and throughout this community.\nI want to ask the committee if they have questions that they would like any one of the three that who have spoken to answer.\nWe have outreach teams every night working at a series of the end of line stations to catch those individuals as they come off the street as they come off the train, sorry and try to talk to them about coming inside and providing transportation to a series to a shelter if they wanted or destabilization bids.\nWe're utilizing them at end of line, but also in our day-to-day work and to offer people a place to come inside and again very low threshold, and in the moment, in real time when people are interested we're saying to them, we have a place for you to go right.\nYou know the teams are able to do assessments on the street and make direct placements for the street homeless population into a into us into a stabilization, bed.\nSo therefore, We work very closely with DHS and collaborate in real time, If need be of individuals that might need shelter, whether it's immediate, whether it's long-term.\nTherefore, they will lead to employment if they, you know, need, obviously mental health, services, substance abuse services, Those are things that we will connect them with and work with them in a more I would say in about a short intervention, period.\nYou said that they can become your client within 90 days or you work with them for nothing, no, so like they could be basically be within our case load for 90 days or less right, so, depending if they just need to be connected to specific services.\nKnow, do I would say: Covid-19 wellness checks and ensuring you know they ask them a series of questions, making sure folks feel well and are okay, but they meet with the caseworker.\nThey connect them with different linkages in that community or in that area, to off to ensure that they have the supports that they need going forward.\nPeople should take to send help if they see a homeless person on the street in crisis or having an apparent mental health issue or creating a pro a problem that may be drug use.\nI guess, I could answer related to mental health and maybe even crisis a little bit when it comes to individuals that might be approached or might be appearing as if they might be going through a crisis or have some mental illness that might need assistance, I, think calling NYC.\nOne of the questions that we received is from the 29th Street Association is they are seeing an increase in homeless people living on the streets and.\nI'll, let breaking ground expound, but in short I would say you know it's a pandemic and in the pandemic our street homeless population no longer has access to general things that we would.\nYou know they no longer have access to Starbucks, maybe or Mcdonald's where they would use restrooms or want to say public libraries are now closed and those are locations in areas that our street homeless populations took full advantage.\nI think it's just folks have been somewhat at a standstill at home, I'd say, but I would turn it over to the street outreach teams if they want to weigh in, but obviously that's just a general assessment.\nDon't think that the sheer number of people who are truly experiencing street homelessness has increased at this time.\nThey wanted to know if you're, seeing any positive Covid-19 results in your population and if that happens, how do you deal with that.\nI know that they also have their own somewhat, like a checklist of questions that they ask folks, betting down on the street and the same.\nYou know, I want to give a really good overview, there, but really quickly, every single person that we engage, we put through a Covid-19 screening and if they indicate any positive symptoms, we immediately contact this number that allows them to either enter an isolation site or if the situation is severe enough and they're interested, we'll transport them to receive medical treatment, and we have brought a number of people to hospitals.\nSo, if folks are on the street and unwilling to come inside, we're at least making sure that they are not presenting with any of these symptoms and that they have the PPE to keep themselves and the folks in the community, safe and the office of medical director for DHS is heavily involved in tracking any suspected Covid-19 cases for isolation or quarantine.\nSo every four to six weeks, every individual site, every shelter, has testing providers that come on site and do testing when we think the maximum amount of clients are present within the brick and mortar.\nI mean we're more than willing to work with anybody if they have a homeless individual or they know of somebody who's in the street, we're more than willing to partner with them and do what we can to engage the individual and bring them in off the street, and we can certainly talk offline about the specifics and I wouldn't be able to speak to exactly what the regulations are and what they're able to do, or not.\nBut, you know again, we work with parks and we work with other agencies and organizations throughout the city, and we work together in whatever way possible to get people inside so great.\nThe goal is to keep individuals coming into the system close to their support networks and their communities, so not particularly keep them close to their zip code, but keep them close to the boroughs where they're receiving services of support, and so this is a borough-based plan and in this plan the goal is to give you know every community a site depending on what the system looks.\nIf you state that you're you know, you're asking for Street homeless outreach support, it will go to our JCC unit.\nI know people the teams are, They may be frustrated with it, but the teams are responding and it can just be a very long process, but Nick can certainly speak to it, but his team does not give up and what they are doing is they are going to continuously engage people around coming inside and connecting to services.\nYou know some people particularly been on the street for a long time.\nI, Don't know if you want to address that and the question then becomes will neighborhoods have less control over what happens.\nOur Covid-19 numbers in the system went from 1,000, plus cases that we were tracking down to 41 currently, so that kind of speaks volumes, I want to say the metrics speak for itself, I think it speaks volumes, to.\nWe have worked on a ton of different advocacy and policies in New, York City that have helped drive down the smoking rate to what it is now, which has been the all-time low at 13.\nHowever, you know, In the face of all of that, We still have groups and communities that have high much higher smoking rates than the average, and we really are working on health, disparities, health equity and really working to close those gaps within our city, because there are certain policies, unfortunately, in our city that do not help reduce tobacco use, they're, not as strong as they can be to reach certain underserved groups that are being negatively affected by tobacco use and one of those large health, disparities.\nI want to ask the committee if they have any questions Luke, if you can, let me know, I'm.\nThis is very timely because we know that tobacco use is a exacerbator for Covid-19 related symptoms, and we do see that Covid-19 is disproportionately affecting certain communities, So this again doesn't need to be happening.\nAnd I do know that we will take questions, but they wanted to come in and make sure that the the committee and the community board at large could play a certain role in this educational aspect and I.\nThere was talks about introducing a bill that also covered menthol tobacco, products, However, I think it just needed more talks amongst the community and certain things to figure out how they would do it making sure they did it.\nBut I do think it needs to be reintroduce the community and talked about, and you know more awareness.\nThat time we are proposing, after many several years of planning and outreach to expand our service area upwards, to 31St street, as Renee mentioned up sixth avenue, and that corridor really, including the nomad area of Midtown south here and kind of squaring the district fully making this rather than a blob around Madison, Square Park.\nYou heard some of that earlier tonight with department of Homeland, Services Social services and the outreach teams, but in addition to that, there's just as I like to say, there's a good amount of tender, love and care that just needs to be looked after and provided on a daily basis when it comes to the kind of curb appeal of the greater area, and we do that every day in the current bid.\nAnd we've worked with our business partners in the expansion area to help with open streets and outdoor dining Broadway has been a pretty good success as an open street one of the first of its kind in Manhattan, and we're really happy to see the number of businesses take advantage of that for dining opportunities to keep them afloat as well as 20th street down on between Park Avenue, South and Broadway, and so over the years I've mentioned this before.\nWhen we mentioned you know, we've surveyed every businesses we've surveyed residents, we've kept that stakeholder connection strong to inform what types of services would resonate in the district in the expansion area.\nIf, we were to provide services on a daily basis, and, of course, cleanliness, public safety, we're at the forefront of that, as well as homeless, outreach, streetscape, improvements, horticulture, urban design, safety enhancements for the neighborhood and ongoing business, support, district marketing and regulatory navigation for businesses, and then, ultimately.\nCertainly got a big dose of that over the past nine months and again, prioritizing local business needs for economic recovery, which is obviously going to be a driving force of the work over the coming years.\nSanitation, public Safety, Marketing, Social services, which includes homeless outreach in collaboration with the city, are public improvements and beautification work and then General administration and a reserve.\nIn order to do the you know, the real work, particularly on sixth avenue, between 23rd and 31st, street.\nThis point, we've done conducted needs assessments, developed, an expansion, plan, we've held public meetings, we conducted ongoing outreach and documenting of support, and then finally, after we met with with Bex in February in April of the spring, we did submit our proposal to the city and the department of small business services, who is the usher of this of bid, expansions and business formations and that you know at that point they review and determine whether or not it's going to go into public review and legislative approval.\nSo that they're both places that people want to be in, but can also you know, places where business residents can feel safe being in.\nLooking like the beginning of December, So we wanted to come back to just refresh everyone's memory and again ask for your support and also you know, field.\nWell, I would say: I, don't know, I, don't think we consider them worried, Otherwise we would have expected to hear from them in act and getting back to us saying that they do not support this in terms of how the assessment is passed.\nSo I can get back to you, but if anyone has any questions about whether or not their you know, property business residence is one in the district they can reach out to us.\nShe's, urging us to support extending the boundary on Madison Avenue to the southeast corner of 32nd Street, and she wants to know.\nOkay, seeing none I'm going to move back to our committee members, I know.\nWhen we bring this back to the committee and Tne together, because it's not just a vex issue, we'll have all the information that we need and answers to questions that we can post tonight, I'm gonna turn the presentation over to Zach who's, going to give us a brief summary, and then we can move to the questions or comments that we think we need the answers to great thanks.\nYou, know the street vendor market is.\nYou know on the next few slides, I kind of give an overview of some of the legislation that was proposed back in 2018 when a few of the New York City, Council members, you know wanted to increase and significantly increase.\nYou know significant of these, in that it deals with the number of street vendors.\nVendors is relatively weak, and so, If there would be a you know, a market increase in the number of street vending permits.\nYou, know, I, don't think most of us are walking on the streets.\nThere is the largest kind of group that advocates on behalf of street vendors is called the street vendor project you know and similar to the bids they make claims that I think are.\nI, think you know a fair point that they make is that the number of permits hasn't been increased since 1983.\nRegards to the economic interest impacts on Manhattan, You know, which does have the disproportionate number of street vendors.\nYou would you should know that I think that's helpful to you.\nFolks, I just have tremendous respect for Muhammad at the street vendors project, and you know, we've given time to the to the business improvement district, albeit on a separate topic.\nI mean you talked about where you know how they specify exactly where the street vendors can not be.\nHas there been any talk of like a cap on like the number of vendors that are positioned on a certain block or a certain group of a group of blocks just to make sure that we don't have everyone crowded into the same kind of like micro area, because if I, don't know, I, think I would support a bill that expanded permits.\nI'm, assuming that was a new enforcement unit in NYPD that she was talking about, but I just wanted to confirm that, and if so, you know, I feel like now, especially with our board's kind of recent conversations about the NYPD.\nI. Think I would want to know whether there could be a different agency that might oversee regulation of street vendors.\nWhen we move forward again on a very complicated issue, we have as much information that you think that you will need to consider as we you know, actually get.\nBut, you know I, don't think I understand kind of what the average resident of the community board.\nThe community district would think about this, and what the average employee right, like I, think the street vendors serve a lot of construction, workers.\nThey want to have kind of a nicer meal, sometimes, but like a street vendor to me, that's like serves a different need.\nIt's like classic gatekeeping, but I'd also want to like make sure we're thinking about people who work and live in the neighborhood.\nYou were a cafe, You probably wouldn't want a street vendor serving coffee right outside your door, because you know that's immediate competition."
        }
    }
}