{
    "YoutubeMetadata": {
        "author": "MCB12",
        "channelId": "https://www.youtube.com/channel/UCKgAB8lqTbqbwXC-e6_9lhQ",
        "title": "Licensing Committee Meeting",
        "publishDate": "2020-06-10",
        "shortDescription": ""
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB12",
        "normalizedName": "Manhattan Community Board 12",
        "twitterName": "Manhattan CB12",
        "youtubeChannelName": "CB12M NYC",
        "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
        "twitterHandle": "@MANCB12",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "You, if you are there, when is a please set up a committee member running cruel you folks that we're waiting for Carmen once we have chrome we're going to start the meeting you folks. It seems that now we have quorum and we start out a meeting shortly, I'm going to perhaps active at two minutes and then we'll start I do not see the NYPD here. So the point that they come in Odyssey, the 34 of no-return autocracy. Do you know father both 33rd and 34th are confirmed by the meeting. Have anything she now are you there yeah hi? They were invited to the meeting, but I haven't heard anything. Can you please uncheck I with every nation to see if they come from, see now an award from ELISA? Yes, Ysidro I mean sir: did we get any confirmation from 30 toward the 34 prison? No I didn't get any confirmation from them. We send the invitation like a week ago more than a week ago. Would you be so kind perhaps to give them a call of reason to sleep? They can come on board because I would like to have them as part of this process. They do have information that will be critical to the licenses for this okay, I got a call they now when I saw you start spoked without turning for precinct they're going to be joining us in two minutes. Okay, let me see if I, can you tell someone a 33rd? This is I just spoke with someone at 33rd and I, trying to get some officers on board I think we should start and hopefully that by the time the dogs step in we'll be on our way. With the meetings at 6:50 on this Wednesday June, the 10th I'm calling this meeting to order with quorum. You see the remedies are presiding over the meeting. It's my pleasure to be sitting before you, even British, Pearlie I'm, happy to see you all happy to see our committee members here, Rosie, always a pleasure to see you actually, while these the new faces of the license committee welcome once again so surely I'll see you guys know not. Everyone knows us is participating on this meeting. So let's go to the traditional greetings and introduction, and let me start and again just don't say your name, you know say something about. You know your background, your community, because we don't want to kill more of an intimate feeling as to who's who and why you guys are mean to a community so I'm, going to start with ID right leave me -, Roy, dangle I, believe you here with the seizure on the rest of our committee, members, Ashley hi, everyone Ashley, Fernandez I, am on licensing committee under Ysidro and yeah I'm living in Washington right, Robin, Cruz, Rosie, hi, everyone, my name is Rosie got something about me. I've worked for city government for a couple of years and I've worked under assisting in the I guess. Approval process of sidewalk cafes very well did I miss anyone from the license committee. Well, this UN! Yes, sir I'm here so hey everybody, its voltage, Cruz, lifelong resident of district 12 and happy to be here. Thank you now, let's start to do some fellow officers and detectives from the 34 prison that I see that are just joining us officer. Panna, a maternity I detected, Matthew, Penner, 34th, precinct officer, Martin Eugene. Three four precinct will cut out the 33rd once at a login start with a meeting. Very grateful to be part of neighborhood really have been proud to be one of you, one of you very proud for the support that we have kind from merchants residents and obviously our NYPD, the precinct of both 33rd and 34th. It's been quite an experience. The fact that you guys mean anything with a PD put your lives at risk every now and then makes us to think that you know we have to make sure that we treasure what we have and I'm glad that but I know of we have had an excellent relationship and it's something that I'm going to continue to make sure that is emphasized, because this idea that the NYPD communities can now work together can be acting found in this community. I have the highest respect for this starter before prison at 33rd, and now we do not have to agreed on everything. Obviously Panna. They took a penny. You know that you and I don't mean everything, but there is a sense of respect. Yes, I respect the work that you guys do and I understand that you know we're going to work on this community to push it forward, because that too many inches affecting our communities and the last thing that we need is to have divisions within the community. So thank you so much for your support. Thank you. So much for your service you're welcome. Thank you for working with us. Thank you. So let me do some quick arrangement on how we're going to a proceed with a meeting dear I. Will you be so kind to please keep the timing for residents and I, since they tend that? It's not that long I'm going to entertain that we have a two minute time limit. I will do that. We will do that and Waldi if you so kind to please a monitor like other comments and who raises their hand. So we can address proper questions and you know if you see comments that tamarick are comments. Please bring it up and we'll be more than happy to recognize those comments and those concerns. Yeah, yes, I know the Sindh, it's not online, yet she usually takes care of the stipulations but I'm going to ask perhaps Rosie and I'm not I'm, not sure when other steps, but we do. How can you how to do the steps, not a very complicated process, but I would like for you to learn. It I think I hope that you stay for a while this community, because I think that you all have a lot to bring to the table number. Okay, that's a part of this very well. So, as usual, we're going to listen, an entertaining application on the and we're going to listen from the merchants after we listen from the merchants, we're going to listen from the priests and then the restaurants and then I, say committee, we're going to decide or vote on each applicant when the residents have a comment, they're going to get a two minute time limit dear ah, who will be keeping the traffic alert and if the residents have any questions, please do raise your hands and we'll be more than happy to entertain your common on your concerns. Are there any questions are going to proceed? I, don't see any hands still going to move forward. So, let's not with that in the item one. Is they renew your license for brown sugar of the subpoena? This is when the predatory for prison, but let me see if this someone from a brown sugar ID received a letter from one of wrestling. Modern Collins, give support to brown sugar study that they have been a great emergent and that there will be someone that you p22 support for the great service that they provide. In other my hand, do I have representative from brown sugar I have can I say, can I say something real, quick, I think there's a member, a board member that would like to be added as a panelist. I, just don't know how to go about it. Bobby, don't mingle, panic scream, please I pray the Mingo to a panelist. Thank you. Thank you. The English have fellow board member. Let me see if we do have a board member, so I mean go. Please introduce yourself. The rest of our committee are the rest of our committee. Please yeah. My name is Domingo Estevez I'm, the chair of business development very well, I see now. We also have OSI come in here policy. Please introduce yourself, please. I am obviously I'm the assistant chair for Housing Committee and on land use and a previous previously assistant cost system. Chair to the licensing committee. Wait you did an outstanding job and I'm still grateful for your work. I see that we also have. It was ended from the aqua salon, our president's office Natalie SP. No, not it can you please introduce yourself, hello, dadelus, vino from the offices. Manhattan borough, president Gale Brewer that evening Thank You Natalie, welcome aboard, do I have presented it from a brown sugar yeah for the purpose of the minutes. Please state your name and affiliation to brown sugar, yeah Eli, Garcia manager, I'm also I'm. Also the president of the Cambridge East Oh for Street Merchants Association over in the Bronx right. Well, so ask he is a renewal from for this license based on previous four solutions, fast right, this Takamine report, the last time you came on board I was turning 18 and there was no objection from this Community Board I'm, going to pass out before creasing of Japan on any comes from 32 operation. No issues, 34 prisons indicated a no issues with this particular applicant. Do I have any concerns from my residents: I see a hand and nasty pressing massing. You have Pro, yes, hi Nancy Preston from moving forward on Ito's and used to see. This was a previous are no objections. You know there are only good reports about this operator, so we have to say that happens. - all right, well, I, see a hand from one of our board member also, you have a parole. Thank you also in support. There are great neighbors and we hope that will continue on so absolutely positive support. Thinking, Picanto. We have positive comments from our neighbors and the priests and I recommend that committee members to our police are considered put on this application right away. An objection, question yeah, Rosie you're, the president of what looks. Are you going in and out? Oh sorry can hear me now: oh yeah, because I'm pologize I'm, actually driving okay I just wanted you to clarify what are you the president of on the Broad Street Bridge? Thank you. Thank you. Thanks everyone for their support business. We can only get better from here. See there I'm, just gonna, emanate, ask it and I'm gonna write it down so Ysidro. How do you vote yes or yes? Robin? Yes, Rosie! Yes, Ashley yeah! Well, these yes do I leave anybody else out, you're right it. This is this passes unanimously. Yes, Thanks 0:06, yes, six! Zero! Six in favor very well come on tenacious to brown shoe and we hope that they continue to be excellent, operated now to the next agenda item, which is Florida restaurant uptown. This is a locate on pony, wants to broad in motion mystics on a semi, seven, listen with the purgatory Teresa, what sandra fear from the 33rd and if so, please identify yourselves okay, Krista Astro supposed to be joining us from every third. Let's proceed to the next agenda item: I would not be I'm. Sorry say that. Does that mean? Let me check that without the rest of I'll come in to see something Toby every don't do you think I? Would you proceed out into the next agenda item to appear at in that number four they'll be in the purgatory for prison, say the character is not here Gerard, your are you muted. Pardon me I'm, sorry is number three are wolf, so number three is when the prior 33rd precinct, okay, both I'm sorry, so looks like what I'm sorry you're right, I, second, that if you want to go in episodes, no committee members yeah, let's do it. Let's do it over for let's proceed number four, yes yeah! So the ask here is sound to change other mental operations by FEMA tires doing. Businesses are Havana tacos. This is some to ten to twenty. Ninth Avenue Academy. Do I have a presented here from our attackers. Yes, sir, yes, we doing right, Dominguez, yeah! Yes, it was required that you submit a copy, a transcript or a questionnaire. You have not submitted that questionnaire. I just send it in about thirty minutes ago. Sorry about that I didn't have it. Let me a quick question before we proceed how long you have been having this license going on six years, I transferred it over from Broadway to me since 2014. We cannot obtain your application because we have to have that questionnaire completely filed and sent to the office at least by Friday, so this document should have come to our office on Friday. The fifth before 5:00 p.m. so I recommend that since we don't have a questionnaire, we don't have much of background as to what is that you would like to do. I recommend that you withdraw this application until you proceed and fill out all the required documentation and I highly recommend that you check now on with the community for staff. It's always a good practice, then, when dealing with the licenses of alcohol, making sure that you call the office because now we're going to wait, you have to wait for three months. We're going to come back, be in recess, so we're going to return in September. I will also ask the perhaps that you should check with your accountant or your attorney, because this should have been sent out completely filled out. So that's just my advice. I recommend that you withdraw this application because we don't have how we're going to proceed in entertaining this application. I mean. Is it I just send it in I, don't know v IV I can hold on to the end no way treatments. Now, because the committee members don't have access I, don't have access to what you wanted to hear. It's just a mess. I just want to ask for DJ. That's all it is now. This questionnaire has to be in place. You aren't you're not that your mood, it minute, you're right, you murdered I'm, sorry, I, apologize or question. Did you post at the site that you were probably for a method of operation change? Yes, what was that time? Two weeks ago cause I haven't opened since the my last day, open was March. 15 two clubs remain well the Mingus. So what we had to do with this I, don't know it's a man. I know it's my fault, I emailed it about 6:30 I. Can it has to be in the office before five o'clock, the Friday before this meeting that was on June 5th yeah, so we're on the spring of our next meeting. That's three months from now peep how this September, the beginning, September so check with your accountant check your attorney, make sure that they informed me of the process on how to do this thing. Thank you so much yeah! Yes! Indeed, thank you. Have we got someone from the predator? So let's continue. Let's move guys help me out to see if you guys see someone from the military. Do we have representative on 33rd precinct, I, guess not before we proceed, see a hand up by irelia or Eliot to have a question? No. That was it that if nobody I don't think they have an objection to the corporate change, and that's probably, why they're not here to further for that. They I don't think they have an objection so, but it looked anyway go ahead, I'm, sorry, okay, let's proceed in with agenda and now we're going to move to agenda item number 6 and there'll be a new liquor license Tweel m-sport pong incorporated doing business as TVA no DBA, yet it's located 13 SEC 40th Avenue between 211 and 212 Street. This agenda item number six. Once again, my name is so. This is a four liquor license for this premise, based on my documentation here, I see that there was a resolution passed by Business Committee, going back on 28 2019, and so there was some a solution passed by the committee and then a general Board by about 21 to 6 it was possible woman. So why are we having this as annual basis? If that was approved back in October? Can I? Can I address that? Yes, please? Okay, again, my name is Martin Miller I'm, an attorney and I represent the applicant. The applicant is two eleven to eleven sports, barring and the owner is a Francisco Guerrero on information belief. The application that you are referring to was an application filed by something called IG Restaurant Group I NC, and what happened there was that the I didn't represent that corporation and that corporation went before the Liquor Authority and the Liquor Authority had no problem with the premises, but did have a problem with the apple to the principle of the of the applicants, so they denied that application. This gentleman came by and the sort of a sale sign I mean a for rent sign when spoke to the landlord got a lease and is now applying himself. He had nothing to do with there's a brawny owner right, correct, okay, so this application is completely hostile. Questionnaire. We answered, has a copy of all the blueprints of the program and also a copy of the menu. Please tell me the specifics here and also for the committee members, who will have an idea more or less. Where is the tractor place? Okay, so we all know the history of this location. We spoke about that ad nauseam over the last few years and the last time they came before the board. What was clayton or they were closed, this new location. We see that there's an occupancy of 256. If you look on the application, they state that they have 20 employees, 75 chairs, five barstools, that's a hundred people where's, the other where's. The other hundred going I answer that hold on I'll get through everything. I have and then you can have anything. So it's where's, the other hundred as extending room. Are they dancing, you know? Is it a club? What's the deal also we'd like to know what experience friends we're Guerrero has you can get into that later? Previously, this location would have like 15 or more security guards on the weekend. You see that they only have one to four on their application. They think that's sufficient and also for the community board, as we've been doing with all the locations. We would just like to add that they can only have hookah if they have a hookah permit and that's all we have right now. Let me address your issues. Number one has a capacity of 256, but I asked my client who, by the way, is on the line. If you want to speak to him directly, but they don't anticipate any more than 100 to 150 people to be in the premises, there'll be no dancing inside the premises. Oh, we do I asked I, think one of the Corrections who to what I submitted Saturday and Sunday. We indicated it'll open at 6:00 p.m. it's gonna open for brunch as well on Saturday and Sunday. So I just I mean let me go through all the math upper register. You don't mind no problem, okay, so you have indicated that they'll be on nor do boxed right, no jukebox DJ. Yes, the internet. You know iPod kind of music, no karaoke live music, our sound a mirror will be properly installed correct and the space has been properly sound, proofed, correct, there'll, be not their party promotions. No and us officer indicated at Ravenna there'll be one to force a killer. Divorce can I, can I, stop you if the board would feel more comfortable with more security guards, they'll hire more security, sure that session we booked. You do understand, however, that they have to be ready still in New, York State, oh, absolutely license absolutely. Yes, we have to. We have to show it to the New York State Liquor Authority as well. Yes, very well, so there'll be a no patio or rooftop no garden the backyard there'll be no enclosed or on the course, our cafe the hours of presence you have now. It's Mondays through Thursdays from 6 p.m. to 2 a.m. best Friday subs and Sundays from 6 p.m. until 4 a.m. I'd like to amend, Saturday and Sunday for the opening and have it for brunch somewhere around 11:30 or 12:00 o'clock, Saturday Sunday. He wants to Sunday start to open up by 11:30 yeah Levin 30, someone also and also Saturday as well. Saturday and Sunday very well got pasta only 56, that's great honey employees there. Yes, let me ask you these said police with any rule, obviously management. How many managers are gonna happen out there? The owner himself will manage and I think he's, anticipating one or two, but he's here he can. He can explain that more fully if you want, but I also I'd like to go back to that 2:56, like I said they don't intend not having 250 I mean that's just the capacity of the premises. They don't intend on having 256 people on the premises. They anticipated most there'll be something like 150. What are you plans to hire law? That's what we want higher and we're gonna when you said that you want to hire what was what process have you step out put in place? We haven't put any process in place because we need approvals by your board and we have to go before the Liquor Authority. But once we are, as we are saying, wait, I mean I, don't say we will inform the community board and ask them to assist us for local help. We will I'm sorry, what's your name again, Martin Naylor, Martin Naylor, hello, select I. It would be really no that can hit really hard. We to hire local to engage the community. This is what I have to do. I will not wait until you get your license and then come back and say like we want to do this. You might not come back. You might not have an opportunity to come back to this community port, so I would have hoped that you don't have at least a plan or what intention would be to hire people from the community, because you know I am NOT the players to hire low people from the community. We're not looking to go outside of the community I mean we will advertise, we will put it. We will put signs up in front of the store in terms of wanting locals to come in and look for employment. That's what we're looking to do. This is going to be a neighborhood restaurant and that's what we're looking to do. Have people from the neighborhood come in and join it food and also be the media employees. Let me see fire francisco guitarist on the line to select from him see the line. Yes question: you see it or whenever you have a chance. Yes, how you doing nice to meet you guys? Yes, I'm here to be the manager there right, yes, I'm, the owner and a manager also great, so you know that this, like really hard you're Tony, just said that you to come back after lies has been approved. You guys don't have to come back to community board for two years. I'm, not gonna waste. Repeat this. So do you like to know what the plan is all about and how that's going to get done? Okay, actually, we have no plan at the moment, but definitely we know many people from the community and we're planning to definitely hire from the community. That's totally the plan. I mean I live here in the city and I live in the Bronx and, like a my sister, has restaurants. For many years, so we know like lots of people of the community and we definitely be working in that area. How? Well you know this community I mean I, haven't lived in my hand, but I definitely know many people from watching to heights. What has we experienced with other restaurant? What other Buster's have you managed before my sister has a restaurant for over ten years in the Bronx and I used to work with her all the time over there and my part for eight years? What's the name of that restaurant, the restaurant is a Lila King in King, Street, right, I'm, sorry, yeah, Eddie, Cambridge, Road, the Ming, the master, the question of lb yeah. So my question is more pertaining to the current situation in the current status. You see that, although recommendation I would give so, the business owner is just make sure you put signage or hiring local and that you have developed some sort of flier that you distribute amongst the community because there's gonna be a certain need for employment after this pandemic. Now my question is more around and the reason I'm here is because I would like to have a dialogue with the licensing committee as the chair of a business development on how we're gonna move to truly tackle this issue of racism. And how could we come together with a joint plan? What the beauty of it? You are a new business owner, so I just I'm just here to try to figure out what type of anti discriminatory practices are you looking to institute and also how will you deal with any allegations of that as a business owner, because I think the point to note that the times are demanding more of us. You know we're looking at situations like defunding the police, just because of that represents, but also have to be able to step up as community members to hold each other accountable, so I'm interested in knowing what would you say or potentially how would you seek to combat any sort of discrimination as a new business owner, uptown? Okay, so I mean being an immigrant I, have like no discrimination at all for any kind of race or religion or anything, and even if it's an employee or customer, we everybody's welcome. We don't have like any problems with any type of race or religion. I, don't know if that answer your question yeah sure so I'll keep in contact with receiver, because I want to be able to work hand in hand with him on this, but I just want you to let you know, welcome I, know, you're doing an investment in Washington, Heights and Dyckman, and about discrimination and race be tolerated in Washington, Heights and we'll look. We are looking to collaborate to make sure finally, business owners accountable for that. Thank you yeah. Definitely, thank you. So much Mingo for your input. Again. This is a community diversify. We really have been getting along for a while as a community and I want to make sure that if there's any variation from what is the normal will be holding you accountable, they'd be here. The idea is not to punish just a business but sure that we come together as a community, and we have the same approach that we can not discriminate against anyone for anything and we're going to be very vigilant because I think that any time that we collect one small, regardless how small the issue might be, can become big and we're going to address it right away and very harshly so again. Welcome guerrero, we're going to ask you later on that stipulation. This is past my community, that you put a sign, adjuster Domingo, indicated to hire local, because I think this is going to be a good. It could a part to the community and yeah, hopefully believe the popular taste drop. You have a question, then I would go to a Marilla Mariella Rock questioners of Francisco more or less how many employees around twenty employees, including mine, including managers, 1507 yeah. That's the plan. A small local as we could get I mean usually is I mean not all the time you could get. Everybody local well like yeah, maybe 70% 75%. Remember that we have a lot of unemployment people right now because of the Kobe yeah thank yeah. I totally understand I mean I I've been a victim of the cops. If my brother passed away like two months ago, I know I know the feeling so condolences. Thank you. Thank you. I see, I just want to step back. This kind of kicked off. I was also pleased me yourself, I'm. Sorry, it's not me. Sorry, Ozzie Nancy, thank you. You're right, yeah, I, just want to I just wanted to touch on something that kind of began last meeting where it was the first zoom meeting and our format that we've been sexually successfully fought for many years that kept these very disciplined very focused and everybody got to speak sequentially as we spoke I'd like to get back to that. So it's easier. If you don't mind I kind of like to say what our format is and what the format has been and it gives space for everybody and time for everybody but sequentially and it respects an order and it you know that way, we move forward and it's not a four-hour meeting so typically for the past number of years, and we could always change it, but that would be under new business at the end. So the way the committee runs is the chair runs. It precinct speaks right after that, the applicant after that, it's the committee members on the committee. They speak first and then we roll it out to the residents and others anybody else that could be residents board members and such elected officials, and then we roll back into committee for discussion and for a vote. The committee welcomes and encourages any new business that fruit is brought up at new businesses and we don't interrupt committee meetings, for you know like last the last meeting where we had a lot of back-and-forth. Thank you. Thank you right and everybody got two minutes and I'm keeping it for chairman and CEO. He asked for me to do that you're right, but thinking March. We started changing the meeting where we allow the merchants to speak first, but before we could do that, yeah purchase for in the present residents or members committee members, so I see no Thiele Marilla neglected are not calling you time. Do you have a floor? Hi? My name is Maria I'm new to the community board. I just had a question about the application that was put forth and is there a time that it becomes like that we would get to see it that it becomes more public I hear you see that are reading off some of the information that's on it, but I was just wondering if there was a time that I would be able to review it, or this information is given to the committee members for them to review it. It's not given out to the entire community board members, so it's mostly for community members. This has been what we have done for since day. One and maybe before was the last community was how it was conducted. But if you need to have access to that, you can always I check the staff and they'll be more than happy, because this very well I'm going to also now recognize a Jerry : Jerry minutes getting back to the actual business. I classify the location on Monday afternoon at 2:45, I took a picture of the outside and actually send it to UFC draw of the community board. There is no notice of this meeting at the location. The frontage is actually boarded up as a construction site, and there is no sign of a permit for doing construction in the location over it. There's a glass piece that has a notice from I think it's Turco lighting, which, if you look up their site, deals with club lighting. This is a 275 location and putting in club lighting. The final thing is: there's only the front entrance and I'm not familiar with the location but where's, the second egress from this location. That's what I have that's all I have to say. Okay, you can answer that. Please I'm! Sorry me odo EUR me battalion, which I'm one of you yeah first team. When I rent a place, it was a rent side. I got it with everything that is inside. We have gone and renovate the place for the restaurant, but I took it as this and I mean for the sign. For this comedy, the design was the air. Maybe it was brought for the for the wood or something like that. Having check I haven't been there today, but I definitely I mean we definitely put the sign in the front of the business and for the second exit. They have a main entrance in the front and they have the emergency exit through the back right wrong. I see now RN conception arm. You have two minutes, however, see lieutenant on 33rd precinct. Just did I miss the fish market, just when I'm here I am here Francisco before this was a closed down. This place was very active with Zumba classes that the community in joyful Wow, what's gonna happen without the Zumba classes. Again, we closed shut, what's gonna happen, I mean I was not related to the old business there, but we definitely open to listen to the community and we could make those practice well. I am NOT, I mean I since I, don't know the business that was there. I am not related. What were we doing? I mean what they were doing there. That was an excellent group took advantage of the venue that was and I said. Good community engagement, I highly recommend that he checked perhaps with the previous owner and see if this group can be integrated back into this process. Kasab it was well-run. It was packed. Extra memory see the road they gave not heelas. They gave backpacks in the summers. There was a lot okay, so if I were you, I will check back with them about the great things that this place used to do for the community, and hopefully you could, you know, attach summaries. Definitely I will get in contact with my lawyer after this to try to get some information from their activities in the past. Before closer conversation within community members, only I'm going to recognize Ozzie. Thank you is it true? This was more relate to Mariela, with you mentioned before, the information is not available to the rest of the board member. The district office refused to give me the information about different applicants prior to the meeting after and the minutes and I'm sure Rosie did like the best she could, but she was probably it was not informed that she had to provide more information in the minutes. So right now, I, don't know when we get to the general meeting, I'm, not sure exactly what I'm voting on, because I don't have full information. So how many people? What is the maximum capacity of that venue and also the old business on there IG group, is not available? I could not find it on my files maximum capacity. As far as the minutes are concerned, you know we have our own different, unique styles, I'm gonna work with Rosie, but do take into account that, because of the pandemic, everything was thrown off I'm, not giving out excuses, but I think that the substance of meetings that has taken place- and they will continue to do that as far as staff- not providing documentation to the rest of the memberships. That is something that the chair has to decide on, not true. Legally I am entitled to get the documentation as a board member with the president of the board and the staff. As a committee chair, I, don't have any right in the mean and if I had the right I would have done a long time ago. So, let's move forward now. This is a conversation between the committee members committee minutes. Of course you see drew no real. Quick just want to comment, because this is on behalf of the public, but somebody I believe named by the name. Willie Polanco mentioned that this is common verbatim in the chair says: I am an active member of the community. We support the slices right. So 11 sports and bar very well did just let him say that. Okay on the record so committee members, any issues are: do we want to provide some steps? You know go to Street boat, how you want to do this I like to have a list signage to be a spiral? Stick there was product by the Wingo who is the chair, the common community, because again it's good that we work together, because Domingo Yukimi will be more of an extra leverage, because now I can put any more pressure in making sure their businesses do bind by the principles that they are assigned to, which would be to hire local and easy little and I think one important thing. An important stipulations are considered moving forward, potentially adding if you've been discriminated or feel like you've, been discriminated against, potentially adding the managers number and posting that at the business just so that we co hold them accountable because they'll say oh I, don't know, but when they come to you or they come to me, it's like oh I, didn't know. Well. This is a good way to be able to start addressing it before they come to us. This is suggest we have yeah. We have this stipulation where practically all of new merchants. They have to have display a phone number with any issues that I can be calling right away. So those are steps. Do I have any other steps, so I'm going to recommend the following. First I'm gonna go sign Cindy's, not here. So, what's a Tony mind, so please write down this stipulations is because they're going to be requests that you get to assign them not erase them and send them back later on to other community board. We can yes, so the first won't be signage on the front that you hire locally and then, once you have a paid to open, you can post signage, saying that this place going to be open with our local x-ray, an info. Please contact, sy and see what that means. Something that'd be great. Thank you, my idea, and they don't get to worry about. That's good. That's! We need to do absolutely. Yes, very well, Dana we're going to request that we have a good neighbor sign posted, so the patrons that would not stay outside I mean our quarantine. Third, no problem that will be a phone number listed, invisible somewhere in the front. If there are any restaurants that may have any issues and all clients that they will have access to someone directly right away, that that's fine and then I'm also going to request. They have a portal narrowed effect on what at the middle detective. Yes, based on these four stipulations, does the rest of the committee for your comforter to move forward, or should we add some more steps come to the forward saying that let's move forward unless the photo is our I did the item above our number six I give our please start at about zero. Yes, okay, I'm gonna upstair on there, Robin, yes, Rosie, yes, actually yeah and world leaves yes, hey. Everyone is sending them here. Hey Cindy, yes, be Nolan, hmm, okay! That's it there's one two, three, four five there! Six, yes, is one abstention, so that you're not get passes process at 6:01, community and I hope you guys prosper. Thank you very much. Thank you for the situation's. Just so I get this straight. Are you going to give that to me so that it's signed by my client or do I make one up on that so check right to the staff or the community board? Vanessa Smith he's the district manager. So it's the cinnamon note and ask him to send you a copy of the stipulations, which is a template that looks like this. No I got it okay and you will sign that and send it over to because we gotta have that absolutely you know. Thank you very much. So thank you. Thank you. Thank you very well. Now, let's go back to agenda item number two. If they'll be okay with the committee members and the residents attend, the item number two is flora deep, and this is every new one officer, concepción I, don't know lieutenant young so lieutenant. This is Linda part of your 33rd precinct. The last time that this applicant came to the board. That was October, 2nd 2018. The community report found no objection. Renewing this application. The question to you is, but before I go to, you do. I have presenter here from Africa restaurant, yes, irelia Taveras for foodie, the restaurant and I saw is Sonia Rana GI. Actually it's a renewal, and this is just we just reviving it, though it's with the corporate change. It's the same thing. We just came back because it expired, so she didn't I took if you need me, I can get her on the line. If that's, if that you know that's a request, we don't have any issues or concerns with very well. We have some comments from residents. I see non-record Ysidro, somebody from Cisco actually was asking for the NYPD verbatim, so the NYPD do we have any updates on those who were involved in that shooting I know that this was not the location specifically if I'm not mistaken, but yeah. But I wanted to ask that question, because it's in the Q&A chat, that's the 34th location, pretty location, so that is the location on 10th Avenue. We've made a lot of cars. In a case it is still an active investigation, so information that there's a lot of information I cannot share publicly. But there is a lot of progress in that case very well. I recommend a local street volt take into account that there are no comments or concerns from the residence nor my peepee. Unless you committee members, have some issues. I recommend a lot of straight vote. Good, let's call a vote. Almost the same I mean I you're a please call the vote. The Sidra yes, okay, Jerrod, yes, Robin, yes, Rosie! Yes, Ashley yeah! Well, this yes and Cindy. Yes, right this passes unanimously! Thank you! So much and Elliot. Congratulations to you and Sonia. My regards to Sonia, please I'll, send my regards and I hope you guys do. Well, you see it a quick question. If I may, we have a corporate change also, now that we have the 33rd here, can we it's a formality, committed, feel comfortable jump to the next agenda? I know you never go to the next agenda item, which would be addendum number three will be a renewal or you want to jump. Vijender item number five show fan who wants to proceed with our agendas, assess item three I say we go every most well, no one supposed and I'm going to continue. The agendas assist, we're going to entertain our agenda and number three, which is a sea flower fish market, and this is also in the private 33rd precinct officer. Concepcion, any no concerns we haven't had any noise complaints or not what one calls for the location so we're. Okay with the location I know that any a representative from attended either number three in the house. Do we have some representers here from agenda and I'm, a dream which is a sea flower, TN swimmer named James, just one happy PNG and I'm the river as a video? Yes, how long you been in business? You need business over 30 years, Wow from how is that business know for feliz video format. For my clan yeah they are you business about. Do I. Have any comments of concerns from the residents. I see none committee members any issue. Should we noticed a boat, Runanga? Okay, let's go straight out. You write. A police are proceed with a boat. They see zero. Yes, Terron, yes, Robin! Yes, Rosie! Yes, Ashley yep! Well, these yes Cindy! Yes, there's not this pierces unanimously! Congratulations! James! I, hope you do well and prosper from a coalition thanks. Thank you very well. We now move to agenda item number five, and this will be a corporate change for 48 the restaurant. This is when the purgatory third Precinct Aurelia booster, for my name, is coming out. It's actually its own has been the person running the location, the entire time, but she has a partner Jose who's like 75 or 78, so the co zayday's coming out and Sonia is just gonna. Take over you know, take over the whole entire now she's gonna be entirely. Sonia will have one percent of the shares right now and blending that will do the other ten but he's staying in at ten. We just want to finish that formality. He just in case he gets sick. You almost got sick, but Kovac. You know we can't have those things happening very well, so this is a straight corporate change of where stocks are going to be transfer from one end to another. The tactical sub C on any comments, no concerns with the location, we're all good on our end, I see that we have no comments from residents, but we have one coming from mostly oh, so you have a flow for ten minutes. I'm. Sorry, I, don't have a comment, but after you guys vote, I just have a comment after you done with the vote on this particular matter. I have a good question. I just want to know: do you have the partners name because I have Sonia Rendon, but I don't have the partners? Okay, thank you, yep! Any other committee members, I, don't know how you doing. Do they post that they're going for corporate change or everything's posted. If you want to contend your picture now, what's been posted since Friday night, Thursday, yeah I gave it to them personally and they took they're pretty good about that. They took care of it. That's great wonderful! A lot of these. Do we have any comments? No very well I, basically thought so it's is about. How do you vote on this? Yes, Jerrod? Yes, Robin! Yes, Rosie! Yes, Ashley yeah! Well, these yes Cindy! Yes, okay! This passes unanimously. Congratulations! Thank you! Game one regards to Sonia. If you guys have any time, please drop by the food. There's this really great, and now the price really reasonable. Great food. Congratulations are very well we're not going to move on to agenda item that I. Don't have a seven. How strong real quickly see the row? There's a new member name. A job asked. Was that asked a question in the Q&A I said your panelists, but he said that he's a new board members. Okay, you had a question right. I have a comment: I just I know it's all new platform. We are on, you know virtual, but can we please keep the questions? The same question to all applicants because you didn't ask a half of the applicants so far if they post the note the flyer so either you don't ask anyone or you ask everyone, because in the past we had some situation where we refused. We voted against an application because there was no posting. So before you move on. Have you seen me asking for posting the public notice what we have been on this pandemic? The answer is: no I have not asked because I only today, you did today for at least one applicant, which one yeah just for clarification. I think it was the birthing. There was somebody else that made mention of it and I, don't think it was necessarily see dried I'm, not mistaken I always go back, go back, I, don't recall ordering for notice. That's the one that you asked to come back in three months. Who was that I'm sorry I forgot his number mattias? Okay, him. If I did I will check the record, but something that I would not. You should be do because usually I will only trust myself and only the vice president vice chair, the committee to see those notice have been posted because I'm not going to take anyone's word now that I do not trust you, but because, if there isn't an error, those reasons are going to get blamed and I want to make sure that we have to write accommodation for that recall, I always took pictures and I always showed it to you guys. Every time that someone didn't post a notice, I took a picture and I showed it to Russell committee I. Understand that I'm going to walk in and out on this pandemic to make sure that Moe has executed. What are secure, I'm, not I'm, not saying that all I said it either. We don't ask anyone or you ask everyone that that's all I'm, saying yeah. If it's on the record that I asked you're right, then there's some inconsistencies there, but I do not recall ever asking someone during this pandemic. For this part, Norris I think what happened was someone from the public had asked, and then he had asked it again, but I don't think it was an initial question that came from him. It came from the public, it's just FYI, Gerry culligan on one of these had asked that it wasn't mentioned. He would no notes or no posting. They noticed 36 hours before meeting now means nothing. This was a comment from her I believe in residents, and it is I didn't speak on it because I didn't think it pertain to a specific it popped up after that comment was made and yeah it wasn't specific to it. So like a business or anything so III thought adjust it like. So it's the ladder into the meeting guys. We all make mistakes if I make mistakes and mistake, please feel free and make sure that it gets rectified. I, don't have problem with that, but be very careful how you say certain things, because that can come as an accusation that I'm not being consistent. Let's be clear, right, I think that I've been consistent and transparent right. Okay, you are, you want to say something. No I agree with you. Mate I agree we'll see, though we should remain consistent, always I. Just think this was just a kind of like a Miss, a mishap. You know this is what I say in the beginning, because we are virtual things we'll miss it just point it out: that's all I'm, not blaming anyone yeah here we know that it's just attempted, but I just think it was a mishap, though you know, but the committee member brought it up and then you know in APIs, as committee members, you have every single right to rectify a problem that you see if you see that I'm wrong, if you're, free and reach out- and let me know right away- no problem with that, but I wanna make sure that this is clear. If I make a mistake, you have every single right to practice. I the problem. I'm open so for the new members wanna make sure that is clear. I'm not controlling this. The fight here, I make a mistake. I see, will be rectified. Let's move forward agenda number 8. It's going to be a new wine restaurant wine license. Would you follow a comment to one thing the service street is with the perioperative visit. Do we have history fear from chapolin yeah I good evening? My name is masta and Sansome, I'm an attorney with shankha Russo and Clark, representing the app and I'm joined here, I believe by phone by Patrick Vasquez, who is the field leader for Chipotle and again we're here for, as you had mentioned, or Susan mine? What's the name of the branch our manager, please Patrick, Vasquez ba has Hugh. You easy I believe again is on by phone very well. This is a new license with the purview 33rd precinct I think that we don't have to go through the menu for Chipotle. Let me go through the math operation: there'll be no jukebox, no DJ, no karaoke background music to be played hours, operations, 11:45 a.m. to 11 p.m. on our daily basis. Like a pasta, dough, we said before and OB Friday was the 39 our seats detective our concepción. What is the opinion? We don't have any any issues at the precinct here. We just had a one three one call about two weeks ago claiming that the workers aren't wearing masks at the location, the are observing the mayor's executive order. I, don't know if the representative, the location, has anything in response to that. We got the rear seat of this call on C April 28th Patrick. Do you do you have any response to that? So this is a for the location that it's currently not opened. It's not a call from a different folder just to make sure right. This is for the one on 3781. Broadly, yes, so currently we have no triple-a employees on day. We just have the workers on site building the actual person, the actual restaurant inside. That's all power Patrick question: are you familiar with this community here? Yes, embroidery already well, 161st Street for Washington that I moved to 176 and st. Nick and now I live on one five, seven, a block away from this new location. Great pretty happy that one is going to be married into space. Our question: have you had experience on managing restaurants before oh, yes, I've been managing restaurants for the last five years, yeah take the h3 and 3rd Avenue 110 and Columbia University 100 and Columbus Avenue, 138 and Broadway. What do you have specific name? Southwest places? Yes, they're all Chipotle Mexican Grill locations, ok, pony, yes, correct! How many place are you going to hire we'll need to hire 25 to 40, depending on obviously, sales volume very well I got some steps. Perhaps do I have any comments from attendees, seeing none I'm going to strict our conversation now within committee members. Guys I think that, for this particular applicant same as the one before I had to ask that'll be a signage to hire local it once they open and I. Think they'll be the owners that I have a place to sell there'll, be no music there'll, be no security cards. I think that to us anything else would be counterproductive. What is so? What's your take? We actually already have signage may at every Chipotle for hiring locally they're called the hire. Now cards they are already displayed in front of every Chipotle and they will be included in this location as well. So Patrick is that Spanish is already up there. Can you please send us a picture, be fine inch in front of the erector right once what's, construction is and that's when the designers will go right now this card, like boxes covering the front of the restaurant I, thought that you said that it was a signage already had to hire a local, no, my fault. Well, what we said was every trolli location once obon already has signs up. I was just giving reference to different restaurants locations, but this one once open will also have a sign posted on the front door for hiring locally, very well committee members, any other recommendations, guys all right. There was, this always say, managing place that all depart from what I recall right. Patrick. I'm, sorry, could you please repeat this, so is someone? Are somebody in charge of Archie politics or franchises right, I pull? It is currently not franchised, but their. If you mean up there, if there's a manager always there. Yes, that's correct. All right so guys how one step will you be? Okay with that all right? So, having said that, you are going towards a stable okay, so for item number eight, a Caesar: how do you vote? Yes? Okay, to run? Yes, a Robin, yes, Rosie! Yes, Ashley yeah! What are these yes, Cindy? Yes, congratulations unanimously passes. Welcome to the community. I hope you guys the world. Thank you, hopefully, will be participating, see Joe if I could just add one thing before we go. This is the last break before September. This is the last meeting before September yes! Well, this is definitely my last meeting is I will be promoted by then. So. Thank you for all these years of working, Brian, Wolfe. Okay, continue to work with the precincts to make sure that the community is safe and the businesses prosper as that's been our goal since day, one which is to make sure that the businesses prosper and flourish and the community is safe to attend these places. I know I, don't think I think our we might I got missed on that stipulation for 211, which was something that I know we're gonna be asking going forward from now on. Is that if a location, just a stipulation that a location has they're going to so hookah that only sell hookah with Department that takes pressure off of the precinct takes pressure off of everybody and that that's about it again? Thank you for always working with us and I hope that the trend continues. Thank you so much officer for your service and again we have been really grateful for all the information we have provided, but also the commitment that you have abused. This community is second to none and we're going to miss you much success to you and I'm sure cross rose got willing as we move forward. Thank you so much officer, detective Anna officer, Martinez, you thank you. So much I guess we'll be seeing you by September. You say thank you as well. For the three days, - officer, Pena, wish you the very best and I and I know I know many people feel that have been on this committee for many years residents showing up that care as much as you guys do, and the effort that you made in terms of getting great information was made out of an interest for the community and of concern so that people can sleep at night and live in peace and that businesses can thrive. Thank you for making that effort. We really appreciate it as a lifelong resident of this community. That's been here the whole time. Thank you for your service. What did you get promoted to the Titan opinion? I will be promoted to sergeant very soon, both Koretz Thank You, obvious conception. Thank you. So much for attending this meeting - have a good night. Thank you. Sorry, as late I'm gonna make. Thank you. If there is the moisture for the meeting, I have a statement real, quick, that I want to bring up and I realized earlier I, just only because I don't want to be out of order when, in terms of the meetings, this is not a transcript. This is a meeting and I just want to let everyone know that I spent three hours going over the video now, if I missed something I apologize, but you guys can give me suggestions, I'm, always open to it, but don't tell me what to do and how to do it. Thank you, Thank You Rosie. Thank you for your assistance and I'll call you. So we could coordinate and we don't take new business. So we could come more organized than September with a strategy very well really appreciate the meaning for your import Rosa. Thank you. So much for your sisters and you'll be taking the minutes. I'll write the resolutions owner I. Have the minutes right. I'm! Writing it now, but this is. This is more towards OC I'm, just because she brought it up twice. I had to clarify. Thank you. So much sorry can I. Do I have a right to reply for this. Yes, absolutely was not judgment by anyway, I'm, sorry, if it was sound this way, but I know for a fact that it took three over three years to get to the minutes. The way it was written before I was removed from the committee and many times that had to be approved by the committee and then by the office and all and so forth. So what I see here and again I will say it again. It's absolutely not your fault whatsoever. What I see here that there is a change and how the minutes are and somehow I don't think this was decide or anything and I wonder why not no I'm, not asking you Rosie I, wonder why, when I proposed to have all those changes that had to be decided and voting or whatever, but when somebody, if somebody come a new person come in, there is no again nothing to do with you rose. They just want to make sure that it's okay to do it in a different way that actually really doesn't reflect all the little details and Gerard and I was sitting about the actual application and what need to be there and whatnot, and somehow this is now okay. So if you think you decide it's, okay, that's fine, disgust or greed. How the minutes were to be rain by you. Anybody else, I recall yeah. The minutes you put on the format that you had. It was your decision. No I mean not even mine, I'm sorry. This was now I. I'm! Sorry did you are I'm sorry to say that but you're wrong, because you specifically said you don't want to have more than two pages and we went over the questions. What's your name, that's one question there. Another minutes, no question! Yes, but not been minutes, but the question here is the minutes. It's not as a new member I was really excited to see the push for local employment and I. Think that is something like I hope to continue seeing I mean. Maybe you've always done that I, don't know, but I think that that's a great way of making this a really like a community board and not just some sort of like approval process- is that there are commitments that people make I. Think just the way you ask questions about where people live, where they've done business I think that kind of commitment to the neighborhood's I think is what's going to make the community stronger, especially after pivot, so that was really nice to see Thank You Mariela and you know it's a new member. We tried to maybe process, as you saw it flow by too quickly, but we try to minimize the time. At one point: we were in community for five hours yesterday, the clerk's one for three and a half hours. So no. This is great with the input from Gerard in Austin, who was the vice chair a little while ago we find phone everything from the questionnaire to the stipulations, to the resolutions. How documents will be you know, kind to the community, so all of that was fine-tuned thanks to the effort from both our art and OSI and was what I was saying so also recall that the minutes will usually be up to gobis right in the minutes, the format, the questionnaire. We always try to improvise up to work on it and we try to make sure that we improve the questionnaire. What you say about the questionnaire being approved. Yes, you're right I was surprised when the questionnaire came out differently, but as fast a minute. It's a separate issue with you that a questionnaire I changed without consent. I was very concerned about that and it's something that I'm going to address once we go back and we meet in person, so it was I have to say something just to gesture everyone clear. This was not my own decision to have the minutes. The way they were. This was an absolutely a group decision and we went over that gazillion times, including the office that was involved and so forth. So it took a very long time to get there and so to say that there was no discussion about it. There was no vote about it. I I disagree and it's I want to say it again. It's nothing to do with what the work that Rosie is doing. She is probably not aware and Rosie. Yes, it took you three minutes. It took me sometimes the whole day and I totally understand where you're coming from, but you know to in order to capture all the details. This is one of the things in this committee, at least, and not only but in this committee that has to be done. Listening to the tape is one of those and thank you for listening to the tape season. We have mode I just wanted to say to the group is first off have a great summer and I just want to say: I didn't want to anybody to misrepresent what I did earlier. The format that we have is actually not to control or to manipulate it's actually to create a transparent, consistent approach so that everybody that comes to these and are on nua members you're going to see that we have some really engaged of residents and it's great it's great to see people I wish more people would come to our committee meeting every month. You know the more the better actually more is better and that format again is not to kind of control or manipulate it's just to create a space. That's consistent, so that everybody feels when they step into their space, whether it's the applicant, the precinct many members residents and others electeds and then committee votes that everybody really feels that they had their time in their space and everybody gets to see and feel more comfortable with so I just wanted to say that's why I said that earlier it was not in response to any blast me of that, maybe was just you know. We have new members. I just want to share that I just wanted to add something that might be helpful. You right II see that minutes do vary in style and we see a range among the committee's on boards and from board to board and row C. You are correct that they are not meant to be a verbatim transcript, but I think that zoom presents an opportunity. Other boards are subscribing to a feature that allows the zoom meetings to have closed captioning intended for the hearing impaired, but because you can download it the same way that you can download the chat or the Q&A for your records. It kind of serves as a transcript for anybody who would want to request it. So just something to explore, think about have Jonathan look into to it and if in its and if it's an additional widget that we have to subscribe to, call us and we'll see what we can work out. I would be amazing, because that'll save me a lot of time cannot hear ya. So as a new board. Member first of all, I want to echo my dnr sentiments and in regards to making sure that we prioritize, like our local businesses, commitment to the community. I'm glad that you like pointed at our mighty Allah, so I appreciate that and I want to echo those sentiments but I also as somebody who has never been a board member but has participated in many community forum members through my previous employment opportunities here in Washington, Heights and in word. I definitely want to commend the board for being able to move through this and a very effective and efficient manner. I have sat through community board meetings that have gone on for four and five hours, so it like really it's something to applaud that the fact that we were able to move so effectively and efficiently this time around. Thank you and your jewelry cause that at one time we left the licensing meeting at 2 o clock in the morning from 7 o'clock at night until 2 a.m. so we have fine-tuned. All the questions also did a stunning job in fixing the questionnaire the stipulations, and you know we. What helps here is that between the committee members and myself, most of you have grown up in this community, and you know this place inside out. So when we bring a place in, we know something about that business and if there's any way, shape or form the we can support that business. We will at the same time we will get to know issues that are affecting the clients and emergent, and we will always bring that up because we want to be a very transparent community. We want to support our businesses presentin. We help accountable to all residents so anytime that we have a merchant that doesn't do right for the community. Trust me, the members and the rest of you will come to this million dollars now, but angel and really you know, welcome you guys- can now always check with the president of the board to see Jenna be part of this committee. We always welcome new applaud, even though I have all the bows here and nationally, as new members will be more happy to have new skills, new ideas, a new plot I'm in spirit and in the comments I recommend to go for I. Think we mentioned this in the last meeting and this meeting as well in terms of creating some sort of it's not a task force, but trying to find a way how we can have businesses hire locally. So I, don't know if you guys want us, art like I, can send people emails to try to brainstorm or ideas, and then that way we presented in September and how we can go about that. It's a great idea, perhaps a complete, we'll, have asked trying it in the merchant expect to open how many positions which positions would be open. So we can so maybe and perhaps provide that to community board, so they could do like perhaps email blast through other stakeholders, and perhaps there we'll have more to choose from more talents to choose from choose from plus. We do have a lot of talents here in this community. I mean look at you, guys, young, talented, smart and handsome beautiful right. You right absolutely all right, guys, john ii, guys look at yourselves! God bless you off again. Thank you. So much.",
        "summary": "While these the new faces of the license committee welcome once again, You know your background, your community, because we don't want to kill more of an intimate feeling as to who's who and why you guys are mean to a community believe you here with the seizure on the rest of our committee, members, Ashley hi, everyone Ashley, Fernandez, I, am on licensing committee under Ysidro Approval process of sidewalk cafes.\nI, hope that you stay for a while this community, because I think that you all have a lot to bring to the table number So as usual, we're going to listen, an entertaining application on the and then I say committee, we're going to decide or vote on each applicant when the residents have a comment, they're going to get a two minute time limit.\nYou see that, although recommendation I would give so the business owner is just make sure you put signage or hiring local and that you have developed some sort of flier that you distribute amongst the community, because there's gonna be a certain need for employment after this pandemic Now. My question is more around and the reason I'm here is because I would like to have a dialogue with the licensing committee as the chair of a business development on how we're gonna move to truly tackle this issue of racism.\nYou are a new business owner, so I just I'm just here to try to figure out what type of anti discriminatory practices are you looking to institute and also how will you deal with any allegations of that as a business owner, because I think the point to note that the times are demanding more of us You know we're looking at situations like defunding the police, just because of that represents, but also have to be able to step up as community members to hold each other accountable, so I'm interested in knowing what would you say or potentially, how would you seek to combat any sort of discrimination as a new business owner uptown?\nThe idea is not to punish just a business but sure that we come together as a community, and we have the same approach that we can not discriminate against anyone for anything and we're going to be very vigilant because I think that any time that we collect one small, regardless how small the issue might be, can become big and we're going to address it right away and very harshly.\nIn the past Before closer conversation within community members, only I'm going to recognize Ozzie The district office refused to give me the information about different applicants prior to the meeting after and the minutes How many people?\nWe support the slices right, So, 11, sports and bar very well did just let him say that Okay on the record, so committee members any issues are: do we want to provide some steps?\nand I think one important thing: An important stipulations are considered moving forward, potentially adding if you've been discriminated or feel like you've been discriminated against, potentially adding the managers number and posting that at the business just so that we co hold them accountable because they'll say oh I, don't know, but when they come to you or they come to me , it's like not erase them and send them back later on to other community board.\nvery well Dana we're going to request that we have a good neighbor sign posted, so There are any restaurants that may have any issues and all clients that they will have access to someone directly right away that that's fine Does the rest of the committee for your comforter to move forward, or should we add some more steps?\nLet's go back to agenda item number two If they'll be okay with the committee members and the residents attend.\nThey are you business about I, see none committee members, any issue: A police are proceed with a boat We now move to agenda item number five, and this will be a corporate change for 48.\nNo, my fault I was just giving reference to different restaurants locations, but this one once open will also have a sign posted on the front door for hiring locally, very well committee members, any other recommendations, guys all right, Having said that, you are going towards a stable okay, so for item number eight, a Caesar:: how do you vote?\nThis community is second to none and we're going to miss you much success to you I know many people feel that have been on this committee for many years residents showing up that care as much as you guys do, and the effort that you made in terms of getting great information was made out of an interest for the community and of concern so that people can sleep at night and live in peace and that businesses can thrive.\nWe really appreciate it as a lifelong resident of this community Thank you for your service and I just want to let everyone know that I spent three hours going over the video now, if I missed something I apologize, but you guys can give me suggestions, I'm, always open to it, but don't tell me what to do and how to do it."
    }
}