{
    "YoutubeMetadata": {
        "author": "MCB3",
        "channelId": "https://www.youtube.com/channel/UCEYJmG7Z92iWHsIwwDoPWoA",
        "title": "CB 3 Manhattan Land Use",
        "publishDate": "2020-05-14",
        "shortDescription": "Agenda:\\n\\n1.    Approval of previous month's minutes\\n2.    DCAS-led report on 70 Mulberry St demolition and process/options for rebuilding\\n3.    Vote to adjourn"
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB3",
        "normalizedName": "Manhattan Community Board 3",
        "twitterName": "Community Board 3",
        "youtubeChannelName": "Manhattan Community Board 3 NYC",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
        "twitterHandle": "@CB3Man",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "Good evening, everyone again, if you can take a minute to read the text, that's on your screen about how the meeting will be run today. We're learning new things since we're doing everything virtually now. So for those of you joining us from the public, which there are a lot of you. If you can take a minute to go into the chat box and type in your name and if there's an affiliation, your affiliation as well. This is how will we do in attendance for non committee members? We are recording the meeting as part of our Open Meeting Law requirements and though after the presentations, the chair will take questions and comments from committee members first and then we will open it up to members of the public and we'll be using the raised hands function that comes with zoom. So if you're on a computer or other type of device, you just go into the participants tab at the bottom of your screen and go to the bottom of the list and click the button that says raise hand and then we'll know that you want to make a comment. Comments will be timed to minutes if you are on the phone is star nine, to raise your hand to mute yourself and unmute yourself on your desktop. You just click the microphone button or hold down your spacebar on the phone. You hit star six to mute and unmute yourselves. We are going to leave everybody, including committee members, muted, during the presentation, so that there's no background noise. Thank you Michael! Thank you! So much so it's already 6:30 force and I'm gonna start the meeting I'm good evening. Everyone welcome to community both real and use committee meeting for Thursday May, 14, 2020 and I. Just I already said it before, but I just want to I'm. Officially thank Michael Moreno again. Michael Moreno is our first vice-chair. He has been taking a lot of his personal time to help us with this assumed technology in I cannot speak up on behalf of all the committee chairs, but I think we all share the same appreciation for Michael again. Think thank you so much Michael, so we so. The first item on our agenda tonight is to approve the minutes from our last meeting, which is February and do I. Have a motion to approve the ten minutes. I move to approve, thank you all limpia and you second all in favor I'm. So sorry, thank you Olympia. So because we need to we probably better total calling so that we know who is present at this committee. Michael perlis. Can you do the roll calling? Please sure thank you. Michael promise is here Dominic bird, yes I'm here, Thank You, Jonathan, Furman Hewitt is any word I'm searching the participants. I, don't see his name. Okay, Lisa I know you are here, Olympia I know you are here Damaris Ray's motion to adopt the minutes as well. Yes, oh I'm, sorry I thought we were doing I'm. Sorry, I, apologize I should go back. Sorry, so Jackie Wong. How do you vote yes, Linda Jones? How do you vote yes, Michael? Yes, Dominick Burke. How do you vote? Yes, Jonathan shoot Jonathan, yes Herman here it is still not here. Trevor Holland is still not here. Okay, Lisa. How do you vote I vote? Yes, thank you Lisa Olympia. How do you vote yes, Thank You Olympia, Damaris race. She doesn't seem to be on. Yes, thank you, Steve Herrick. How do you vote on either and then thank you Michael, so any opposition to the to the to the minutes and no one Epstein is that abstention? Okay? So the other item on the agenda is 70, Mulberry, Street and I expect. This is going to be a very passionate discussion, but before I go on, I just want to lay out the order of the meeting tonight so I see. We have some politicians with us tonight, so I'm gonna. Let them speak first, as we always do, and each speaker would have two minutes and then follow the pipe dicas and presentation. And after that I will let a committee members to ask questions and after the committee member questions, then the general public to make comments and tonight I'm, seeing all the tenants four of the burn down buildings are also here so out of respect I'll, let I'm gonna. Let them speak first in the general public comment session and again, each speaker would have two minutes to speak and after that would be the committee discussion. So first I would like to invite our councilmember market chain to speak. Margaret, it's nice to help you tonight. Would you want to say a few words sure want Jackie. Thank you and good evening. Everyone and I hope that everyone is safe and well, and thank you to the community for three members and the Land Use Committee for having me speak today and also thank you. Just D casts and the mayor's office for being here to do the presentation. 70 Mulberry Street is a neighborhood cultural institution that has served our community since 1900. During his first hundred 20 years of existence, it went from being a form of public school to housing. Some of our important community nonprofit organizations I remember going to PS 23 when I first landed in Chinatown, and these nonprofits are so critical in our community cpc's Chinatown Senior, Center, Chinatown manpower project, CMP, HT, Dance, Company, Museum of Chinese in America MOCA, a United East Athletic Association, since the fire on January 23rd that devastated the structure of the building. My office has been working diligently to assist these nonprofits in retrieval and relocation, and to urge the city to engage in a community process to discuss the future of this site, and today is the first step of the engagement process and I. Remember the mayor coming down to Chinatown promising the community that he will rebuild the Center for us. The Chinatown community has endorsed significant hardship from both the pandemic and the loss of a major community resource. As we look towards the future 470 Mulberry, it is important that we plan for a facility that served both the current and future tenants alike. Chinatown deserve an ad, a accessible centrally located community facility and with the proper planning and some vision, we are ensuring the future generation of Chinatown and low Manhattan families, nonprofits and community partners will have a place to thrive and I really look for it. I took the discussion tonight. I really wanted to thank everyone for being here today. Thank you. Thank you. So much Margaret next I would like to invite our senator Brian Cavanaugh and to say a few words senator. Thank you very much and I. You know echo many of the sentiments of Margaret chin. First of all in thanking the community work for convening this. You know we were having conversations the elected official and the community board representatives about with the city about how they were going to move forward. There was some concern that they were taking steps that I think people in the community had not fully had the opportunity to understand and appreciate. So you know he had asked for a special forum on this, but of course bringing this to the community board, which plays this role in so many important issues in our community is really a great and appropriate way to do this so appreciate all of you adding this very important issue to the agenda and I also appreciate Adi Cass being here to present this evening. You know I'm, not gonna. New Margaret has smoked and so eloquently about the significance of this building in this community I obviously do not represent Chinatown nearly as or and that's about it nearly as much time in Chinatown as well as Margaret chin. But you know I was there the evening of the fire and I've seen in many conversations both you know the real. You know powerful significance of this building to this community and, of course, the many organizations that were housed there and continue to be critical parts of the community. So I'm, not gonna. You know I'm not going to sort of talk about what my thoughts or priorities would be for this other than to say that I am very committed to making sure that any decisions that are made are fully vetted and have you know real opportunity for the community to have input, and you know at times and what it matters along the process and that it be you know, transparent process and that your community is respected as the city moves forward. But again, thank you all for being here and for the opportunity to speak with all of you, Thank You senator, thank you and for the support you can give us, and next I would like to invite our Assemblywoman ru, nning new, to say, hi. Thank you so much for giving me the opportunity to say a couple of words. I love seeing everybody here and I just want to say thank you to our Community Board and our Community Board, who worked very hard to get this together and I want to say a couple of words of thanks to all of the tenants who have been in constant conversation with us on v-cast and I also wanted to say that I really appreciate the words that Margaret spoke and also what Brian had just said right now. I think that one of the biggest things we just want to make sure of is that, of course, you know, we know how precious and how important this site is to our community and still is it's literally in the center of our community, and it's like the heart right and at the community space and I think that one of the things that you know our community had prompt gotten promised by the mayor was to make sure that it stayed our community space and that we would be able to have what it was back and I. Think that you know right now. There is a lot of you know. Distrust I think that we have to address it head-on. Right. I think that the fact of the matter is there's some distrust in our community and folks have gotten their hearts broken before by promises made that were broken and I. Think that we have to make sure that we address that fear and we have to make sure that people actually see what's going on and I know that you know folks wanted to have a town hall and we pushed for it. I want to say that I commend Brian and Margaret and media for pushing with all of us together to try to get that Town Hall together and we're still working on it and we're still trying to get that date because I think more than ever, I think it's really important that we have community input and a time for us to really be able to talk about things together and be able to address some of the issues that we have. And you know when people are seeing cranes coming out and like lifting things out and when there's demo happening. People are afraid that you know that promises are being broken and so I think that we just need to head on, say it out loud and also be able to have these conversations very straightforwardly, because you know we have said that you know over and over again that we want to see like what's going and Saudi cast today is coming and presenting for us and I just want to say thank you to D cast for being willing to do that and I think. That's really important that folks see for themselves with their eyes like what's going on inside the building, because, obviously what we see is the facade and then we don't get to see what's inside and so I would like to. You know, be able to have the community be able to give input and what Brian said is very true, that we need transparency and accessibility and an open dialogue for us in the city. So thank you so much to all of the elected and thank you so much to all of the community members that have written have fought and have expressed their concerns and I want to say. Thank you again to Student Center and the community board three for all of your efforts and being able to put all of this together for us, because this is the first time that we're able to have this conversation due to Coe bid and I. Think that it's really important that we are, you know, still very much a part of this process even without being able to gather together and be able to discuss it. The way we usually would so. Thank you. Thank you. Assemblywoman next I have iris from our Congress lady Anita media of Alaska, so Sophos iris. Would you like to say a few words iris? Are you on the phone or you are yes, sir? Can you hear me now yeah? We can hear you okay, thank you so much and good evening. Everyone I'm glad that we have in this meeting today is really important and I want to say thank you to our local elected officials for the input and leader commitment and making sure you know that anything happening and the future of 70 Mulberry Street is being transparent and is real community input, a collaboration in feedback, so I want to thank you. We have a congressional velasquez she's right now and DC flying low for making sure we have a secure additional funding. They working on making sure we receive additional funding for our heroes. The first responders another for hello, another round of two hungry esteem, witness check for our community for all Americans. That being say, I just want to thank everyone for having this meeting tonight and now looking forward to working with the community and all the little fishes, we have the congresswoman Thank You iris. Thank you so much. You know. In the last few weeks, I have been hearing a lot of community members are asking so many questions about this building and there are also some speculations on the street, but I think some of them may not be true, and tonight we are very happy to have a representative from dicas to give us an update on the demolition of the building and also tell us what to expect for this site in the future. So do we have the team from the dicas here come I am I, see you on the screen and I. Think Quinton is gonna, be the presenter right. Yes, how are you doing good doing good, so I'm going to share my screen and while Quinton is sharing his screen? I just want to let all the participants know he is the executive, Deputy Commissioner of dicas I hope I get this correctly right. Yes, that's correct! All right! All right. Can everybody see this screen? I can't see the screen perfect so good evening and thank you, chair board members and I. Look at officials in the public for the opportunity to prepare tonight up here tonight: I'm Quinton Ames I'm the serve as the executive Deputy Commissioner for the Department of citywide administrative services, I'm joined tonight by my colleague and chief engineer, Joe Wagner. Together we will go through the status of the building and the current activities that are happening on site after our presentation, we'll be happy to answer any questions that you may have so to start, I wanted to provide some information on the building so, as we all know, 70 ml Barry as a city-owned building located on the northeast corner of mulberry and Bay yard Street in Chinatown. This is a five-story building that has approximately 41,000 square feet. It was condemned by the city in 1889 for the developer. Ps 23 folks can mute their thank you. So, as I was saying, was condemned by the city in 1889 for the development of a public school that was PS twenty-three years. I know so much of you have talked about after the school was closed. The property was transferred to D caste in 1977 and, as we all know, the devastating event on January 23rd. There was a five-alarm fire at the building. During that 511 fire, the top three floors of the building were destroyed and the remainder of the building was significantly damaged immediately after the fire do be instituted vacate order stating if the building was unsafe to occupy and now I also wanted to talk a little bit about the occupants of the building. So, as we all know, there are five nonprofits located at 70 Mulberry that provide community services to local residents, Chinatown Senior Center, who operates a Senior Center, the United, aesthetic Association, who provides youth services to the community Museum of Chinese in America, who operates a museum Hg Dance Company who operates a dance studio and Chinatown manpower project who provides educational and training services and shortly after the fire we work with them and neighboring community organizations to locate temporary space for them to continue their service. I mean I wanted to say where they currently are now Senior Center patrons were accommodated in nearby senior centers. Mochou was able to expand its use at its primary location, on 215 Center, Street, Chinatown manpower project, relocated, its operations to a nearby facility, 96, Baxter Street, and the Uniting set the lytic Association in HT Dan Center. We provided temporary administrative space and another D cast building 115 Christine. In addition, over the past couple of months, d, Katz and other city agencies have worked directly with the tenants to retrieve as much as possible their salvageable property from the building. Now this included over 95% of mochas culture and historical archives and I would be remiss if I didn't take this opportunity to publicly thank the tenants for their steadfast patience and partnership throughout this process, as well as the all the other city may agencies that may be as possible. Now, as we get into more of the details of the buildings conditions, I wanted to start off with a very high-level assessment now, as I mentioned before, the building is currently unsafe to occupy and the top floors have an immediate public, a danger to the public life and safety. There are structural and environmental concerns with the building, the utilities and infrastructure of the building are inoperable and unsalvageable, and the building would have to really rehabilitated to comply with current codes. I'm now, I would like to turn it over to our chief engineer, Joe Wagner, who will go into more detail on the assessment of the damage back floor. Joe. Are you with us? Here's some here, Quinton, okay, I, don't say: okay on the pip-boy and including the roof, as you can see from the photos here that, basically it was destroyed by the fire. The structure itself is a basically a wood structure. The upper floors are completely wood floor joist, you do have masonry the primitive walls and everything perimeter. Walls are all masonry, as you can see, with the Wyeth and plaster plans to finish on the interior walls, which now are so wanna log all the walls all the way down. The building's have mold in the in the back base of the walls all the floor. Joists as you can see from the pictures what are remaining, they were all charred there. What a the what a log there unusable- and that would be the fifth floor you can see instead say most of the demo put a fifth floor is I would say: 95% done would be done with the demo of the crypt floor by the end by the end of the week, the beginning of next week. Okay, let's go to both for before for a similar situation, the framings the same. It's cast-iron columns and Gerda's wood floor joists, as you can see above the floors, are all wood, tongue-and-groove wood boards that are all generated, they were all walked if you walk well, if you can get on the second floor, first, like a walk on a floors, and you can see that the floors are all buckled up and it's they're a really old tripping hazards. The ceilings are all coming down light fixtures will the electrical service that a whole building is, and you don't see it in this fit, but when going low floors, you can see some of the cables hanging down all the electrical services. Really, it's finished. You cannot use it again well boom. It has to be rewired going to the third floor third floor. You can see it's evidence you could actually again. You could still see two little flaws that the extend to the fryer. You can see the cabling hanging down. None of nothing that you see here is usable. You can see that we got shirring, that's going up to support the floor so when the people are working, Oh nobody's floors, and so we have Shores that go all the way down through the basement. As you can see in the other photos, the ceilings on ceilings are coming down. I. As we're trying to take out some archives. I tried to nail in some anchors, so I could hang some light fixtures. The wood is so saturated the floor. Joists that you couldn't actually the nails pulled right out in Wrightsville, so I want the pews and stand so you could tell that you can't use these floor joists and that's basically a whole system. That's there for second floor again. You can see these ceilings. Everything is this water there's a tremendous amount of mold in the building. Now the building is open. Today, Paul. It's open to the sky, he saw rise over water, I mean we were there two weeks after and we were in the first floor and we were walking in water, Quinton, Paul, so they're walking in water. Oh, you can see the water damage to all the ceilings the world behind the wall. So all those walls have to be ripped down even the parental walls. Behind anything that was plaster walls. All of those walls have to come down the duct, the duct systems, the any duct work. Any attack that's contaminated, there's between the asbestos that, even though the asbestos was a friable, none of the ductwork is usable first floor again you to see pile of debris, you can see everything's charred and you can see even how the columns some of the columns kicked in again. We have those we have those for short. We did empty. Some of that. We did clean up a lot of debris out of there, so we could do some of the demo and again, it's zooming all the way into the basement. Let's go to the next one, the basement. You can see somebody showing this up. There is a concrete slab in one area that is substantial, but, aside from that concrete slab, well that took work well, none of that equipment is usable. It all has to be replace all the piping throughout the building, then, would have to be replaced to meet the new coats. You got more than fine building departments gave us a destroy notice up to the third floor, which means this to make it safe just so nothing, it's not safe to walking it's just safe that they don't feel anything will fall out into the street to hurt somebody, but that doesn't mean it's a safe building. That's only means that it's, it could stand there for a while, but it's got to be protected and you're the model. What it goes in the more damage that happens to develop nothing in nothing that we see is really salvageable now, because of that, we you get more than 50% of the building that has to be renovated. You would have to apply to the new building code, which means that it has to take all the which means the columns the beams and everything would have to be able to take a seismic load. It would have to take all the energy code has to be all Company. A DA has to be applied. The elevators have to be put in the building. All of this would have to be done to the existing building. No matter what you do, so there really isn't anything. Iess I could see that you really could save to reuse again and that's really a quick summary what's there and what we're doing right now. Thank you Joe. So we are hearing a lot of screaming in the background, so now that touch a little on redevelopment to the miracle minute following the fire that the city will rebuild the side and return the tenants to the building and that commitment remains. Given our assessment, the city decided to move forward with the full demolition of the building by taking down the existing structure and removing all the related degrees from the site. This work is scheduled to be completed by October of this year and also in regards to regarding the rebuilding process. The administration will engage in a community visioning process with local residents and stakeholders to determine what this rebuilding looks like, and we look forward to partnering with all of you in this process, and that is our presentation. Mr. chair, thank you for your time and I. Now turn it back over to you. Thank you so much Quintin and also Joe next I'm gonna open up for the land-use committee members to ask questions and so I see some going on the chat box. A one question I think everybody wants to ask is about investigation of the fire, so I wonder if there's anything I'm dicas cashier with us tonight, she were so. According to the FDNY investigation, the fire was the result of an adverse electrical event on the third and fourth floors. Okay, in any details, we can share like more than that. So, if folks would like to request a copy of the fire investigation report, they can go to FDNY's website to obtain the report and mr. chair I can also send you actually, since we're on zoom' I will drop into the chat box in just a few seconds. The link that folks can go to and they read the full report there. That's wonderful, thank you! So much I'm, Quinton, Olympia I, see you have a hand. Let me unmute you, oh I'm, sorry I did so hi. Thank you for the presentation. I mean one thing. There was a little bit of lack of clarity. If I understand you correctly, you said that actually only the force, the top two floors force and feet were compromised, but that the structure of the rest of the building is good. Is that what you said no ma'am, so the entire building was compromised, as we showed in the pictures, and just we have some I am an architect by training when I say it was structurally compromised. Are you are you presenting as a building that you are planning to demolish 100%, or are you presenting us with a building that you believe there is complete come from then the last two floors need to be eliminated, but the rest of the structure can be refurbished. Gotcha I understand your question, so we are. We are recommending and moving forward with the full demolition, so we will be taking down the entire floor. The entire building- yes ma'am great. That was not clear in your presentation, sorry and then the second thing you said that this will show you you're going to demolish the entire building and then in your first slide, you enumerated certain considerations, including the last point. That was monetary considerations. Do you want to elaborate on that right? So this is just because it is a city building. We would have to get funding and have received funding to actually demolish the building. In addition and a part of the revision process, these are just things that the city would have to consider. Thank you. No problem. Yeah first question is: have you done any initial consideration of what the maximum floor area could be according to the new code for this property compared to the existing building? Would it be more or less essentially the same so no ma'am, so the current building is about 41,000 square feet. I think it's around 36 to 37, actually usable that was actually leased space. We have not done a comparison to look at what the future of that space would look like as I had mentioned before. We would do a really a kind of visioning process to understand what the community wanted this site, its to be I mean look like and then that we would go from there. I was really just asking a computation based on the square footage of the site, and that me, if they are in the neighborhood I, don't yeah I, don't know what it is offhand I don't know if anybody does, but I mean that could be done in like very right and we have and I personally have. We have not done that and also I wouldn't be able to tell you on this call. The second question is then, with this visioning and all the rest, what is your expectation with regard I know it's early, but give us your general sense of what the timing might be. How long would the visioning be? How long would it take you to make sure you had all the funding in place and that sort of thing before constructions start might happen? So, given the current crisis, we are not prepared to provide the details on the timing on this call, but we will remain in contact with you guys on next steps. As of right now we do not have an outline timeframe, and so we can be in touch with you on how that develops. Thank you. Thank you. Quinton. Do we have any more questions from the committee members? Yes, I put in the chat that maybe Antonia Drummond who's with us who does land use for consider woman team. Maybe he knows about the answer about the API, because it's very important that was asked it's a 6.0 and Michael Prados wants to ask the question: Jackie Michael I. Thank you for the presentation, I'm wondering if there's been any discussions in das about the conveyance of this land. If there's been discussion about selling this land to a private developer, so no, we have not had any formal conversations in that regard, as have any private developers lobbied or reached out to deke ass about that. No great. Thank you any more questions from the committee members. If this is being demolished and is this, is this what we today we can no so Olympia if this is going to be redeveloped with the like in compliance with the current cement, and we don't have to go through Europe, but if we are doing something different or like beyond or changing the zoning, the current zoning, then we will have to go through Europe, but I. Don't know if dicas have to have anything to add. Thank you. But in order to understand- because you know in our community there have been various instances of deed restrictions, of the places that were previous schools or other things, this location right now as it is, it would require no Euler, because there are no restrictions. If they do it as with the current, the allowable area, so if it is, if we are doing it within the allowable FA out, then we don't have to go for I mean we don't have to go for you look and if there's no sale of the property right exactly okay. So if the city develops, if that's what you mean I mean so great okay, you would need if it was being sold to a private developer. If there was a conveyance of land, then it would go through Euler, but otherwise it wouldn't that this position of city properties, I, don't think it has to go through Europe. Only if we change the zoning but I think now, conveyance of conveyance of city, where you have a developer, would trigger you lurk absolutely. Thank you. So we're gonna. If there's no more questions from the committee members, I'm gonna go to the public session. So, as I mentioned before out of respect I'm gonna, let the tenants of the building to speak first and so I'm, just gonna go to CMP. First, do we have home be here? How are you here right here? Hi hon hi. Thank you, everyone for inviting us to attend this committee meeting I'm home, saying the executive director of Shanghai manpower project we've been in the building since 1974 GMP is a not-for-profit workforce and economic development organization. Our mission has been helping immigrant communities immigrant workers to become you cannot recreate self-sufficient through approaches of helping them to prepare for a career, trained for job skills, find jobs, place them into jobs or help them to start up a business or have them to become successful in their small business. I'm self-employed we've been using the top three for third fourth and fifth floors of the building, with classrooms for SKUs training, work, readiness, providing workshops on various skills, a financial literacy. Of course. A big part, is also to teach about education, about literacy, mostly with population English as a second language, and one of the key concerns that we have as tenants of the building is, of course, we assurance from the city that we will be able to go back to the building once the beliefs be developed and, at the current rate that we've been paying. As you know, a lot of the nonprofits in the building operating on a very tight budget and this building as a community asset allow us to put a majority of our budget into services rather than paying rent. So this is a critical factor for considering us back to the building and I think. We certainly would appreciate the city and the community board to be receptive in like when you start the visioning. We would like the voice. We would like to be able to have our input so that the rebuilding of the 70-mile Murray will into account the space usage the need for programming into that plan, so that the building is reflective of the program services that we providing to the community. Thank you. Thank you. Hong next I would like to go to HT Chen HT. Are you here? Ishika he's here associated depend on going to the sand. Okay, so I have something times to 90 seconds until January 23rd Chen dancin, to serve thousands of New Yorkers through performances, classes, workshops for visiting school groups outreach the hundreds of community children each week and support for dance artists, local artists and visiting artists. When seventeen Mulberry Street burned, we all mourn the loss of an immense presence in our community in 1891, PS 23 signified a renaissance of the Lower East Side from a reputation as a notorious five points to a place where generations immigrant children could receive an education when it was repurposed into a community center in 1977. A second Renaissance occurred, five tenant organizations pioneered to provide cultural, educational and social services to the community for the next four decades. The building was filled with activity seven days a week serving children, families seniors as well as artists and audiences to local residents, tourists and New Yorkers 70 Mulberry Street was a centerpiece of Chinatown. The historic beauty of the building was noted on the National Registry of buildings and all who walk by or entered the building could sense is Grace and humanity. The architecture of the building should be preserved. So that a third Renaissance can take place with the return of essential services, why is five tenant organizations who were displaced during the fire and the blessing of CBJ Snyder's vision with the original lower facade? As a reminder, we all stand we united to restoring these services to the community, to being able to afford to start all over again and to being stronger together as we oversee leadership and the role of the building to lift up and enlighten new generations of New Yorkers. Thank you. Thank you. The end next I would like to as a cooperative, East, Affleck Association, to say a few words HECO. Yes, Thank You Jackie. Thank you for inviting us and inviting dicus for this presentation, echoing harm and Dion. We are five not-for-profit organizations that been in the community for our long term. You know that yeast I think HT is the earliest ten in the first ten and that's been there for 40 years, but United years and the rest of the organization's been there for more than third close to 40 years. You know the years occupied the smaller space, but we serve a variety of clients. We have summer programs that serve 300 kids and also train 200 youth to become leaders and commitment and committee volunteers every year, but we don't limit ourselves to just youth and children. We have a group of members that are 55 and over and still playing suckers with us, and we have the chess team that will come. The senior will come and spend their time at United years at 70mm Street room 201. It is important for the building to be rebuilt and we can move back because you know that yeast is 100% volunteer base, none of ours there, none of our volunteers get paid. We don't have government funding, we fundraise from private sectors every year and we depend on members donations as well, but running. All this program was never funded. We are self under, we are warranty or organization, and one of our major concern is being able to move back to 70 Melville Street after the restoration and be paying the same, affordable rents that we've been paying in order for us to continue our service to the community with a lot of milk immigrants, juice, kids and also residents of the community. All tenants have been working together and we appreciate DK's and the city have invited us to be to be involved in this process from that from retreating or stop the demolition. The future plan. We have been a sewer by the mayor and city officials that we will return and we just want to make sure that commitment will stay regardless. How the building is going to be built. Weather is going to be expansion to include additional space added organizations, but this is importance for this building to stay in the community and it's important for us five tenants to come back and continue our surface clean Quintin did mention where we are right now, but we're nowhere. We have in a miss administrative space that is provided to us through decals, but we can run our service. The space does not allow us to one services and we continue to go to other organizations like the YMCA. Here's one 3124 to have activities before the Covid-19 19 to close the entire city down, but we will have to continue with this until 70 mobile street is we built so we can move back. Thank you. Thank you. Thank you, Aiko. Thank you. So much for sharing your opinions and thoughts. Mixed I would like to ask Nancy from MOCA to say thank you to the members of the Manhattan Community Board, three Land Use Committee Jackie Wong. Thank you so much and the community members who have called in tonight. Thank you so much for your support over these last few very difficult months for all of us. Moga could certainly not have gone through the aftermath of the fire without each and every one of you so we're deeply grateful. My name is Nancy I have the honor of serving as a president of MOCA. This month, our country celebrates Asian Pacific heritage. Yet, as a country, we still struggle to understand the contributions of Asian Pacific Americans. We struggle to properly recognize a hateful discriminatory unconstitutional nature of the Chinese Exclusion Act of 1882 that was executed 138 years ago this month, an act that stated that Chinese are endangering the good order of American life, the story's lives and journeys of Chinese in America during that period of time and the period thereafter is exactly what the Museum of Chinese in America. Does we document we research, we present we share. We do this work, not to say that it's our turn or it's our time. We do this work to make sure that others can see American history through a critical perspective, making their own connections with their past on January 23rd, the five-alarm fire devastated us. We are so deeply grateful to councilmember Chen Dee cast Quentin, Jo or friends, DOB FDNY, NYPD, other city agencies. You have worked tirelessly to salvage Chinese, American history and our own dignity and MOCA will always be indebted to you for that. We stand by our neighbors HT Chen, CBC, United, East and Chinatown manpower when my mother, in fact learned job skills in English in the late 1970s mocha underscores the important role that 70 mulberry plays as a home for children to dance adults, to learn, skills seniors to socialize associations, to gather and most critically, in our mind, histories to pre-recorded for future generations. Mocha encourages a stabilization of rental rates for the existing tenants. The fire did not change our budgets and a rise in rental expense would certainly put undue pressure on organizations like mocha. It is imperative to maintain aspects of the history of seventy mulberry and the new design and outfitting within mocha salvage 85,000 item collection, our number of artifacts related to seventy mulberry NPS 23. We would be so excited to curate an exhibit of semi mulberries history in the new space, and we encourage decals to respect the historical components of that building and milk would love to engage in that process. Knowing that we are active members of this community, alongside our neighbors at seventy mulberry and other community representatives, mocha is committed to playing a thoughtful role and an honest and truthful one in the visioning process. 470 Mulberry. So thank you so much Thank, You, Nancy Nicks can I have a car from CPC to say a few words. Okay, I got perilla yappin here, I'm, just I'm muting, myself yep. How are you everyone I want to thank the opportunity to actually speak. Thank you. Our community I want to take this out, but you need to thank other CUNY councilmember Margaret Rayne Assemblywoman Yulin, all the elected officials, who have been very generous in ongoing supporting CPC in regard and all the other tenants in regards there are hard times I want to take, especially thank Quinton and deke. As for the untiring work that they've done in helping us with regarding the building, as you know, CPC has been in the building. With all our feathered tenants for over 30 years, we've been providing senior services for close to three hundred seniors on a daily basis. Not only do we provide a means for a warm meal, a place for arts and a recreational activity or for seniors, but it's a place as well put by Nancy a place for them to socialize, and without that, without the building, it's very hard in especially now during these trying times during this pandemic, it's very difficult to have our seniors content without a means of aspiration or something to really motivate them and having this building rebuilt again is what they're thriving for and hoping to see in their near future. Just a couple of things that you want to add. We can't wait to see so many more baby rebuilt and have the ability to be moving back in, as stated to with our fellow as everyone who stated earlier, see mph and dance at MOCA as well as ue8. We really want to see the rent stay, as is as Nancy put it very well in the sense you know before the fire we were set in with our rent with because of our, and because all these talks we were hoping that nothing changes that and that we still go in with the same rate in the same price that we're all doing with that. We believe that the building should be preserved for the and respected for their historical significance and the agriculture of the architectural design, so I'm, hoping that when we have these conversations when we rebuilt the building that all these things are kept in place and kept in mind and just not change it into a monstrosity within the neighborhood, but keeping it in place and keeping it in Sen said open to the community and open specifically, as well as all the members who have been in occupy the building before we hope and we look forward. Everyone involved that the tenants have a say the decision-making and would be part of the future of 70 Mulberry. Again, thank you for everyone, and especially the city of New York, as well as the mayor as well, who is been very supportive in this process, with all the support. Thank you again. Thank you like before I go on and there is a correction I have to make, and that is Olympia. I think you are right. Even if the city dispose propping properties without changing the zoning, they still have to go through the EULA process. I just want to make that correction and before I allow before I allow public more public members to come in I just want to share with you guys that the district office, actually, we see some letters from public members in eye for an interest of time. I cannot read every single one of them, but I would say. Five of them is asking to create more new space with current zoning and also and also want to see the current tenants to be able to move back to the future building and also once the future building to be remained for exclusively for nonprofit use and also, they hope, the key architectural elements and could be honored and also incorporated into the new design. And there are also three letters just to social part, to the tutor to mocha and HT Chen and other tenants and there's one letter asking that the current building to stay to the lower floor to stay, as is so, they can build something on the rooftop and there's also another letter from a Chinese Chamber of Commerce. They suggest to add a housing to affordable housing to the future. A building and that's all I- have about the matters mix out. I'm. Sorry, it's Michael! There is also I just sent to you a private chat with a comment from somebody who is a member of the public who's in the meeting right now, but doesn't have a microphone. So what I'm gonna do is that I'm gonna, let the public members to speak first and then I'll see what I can do with waste toys comment so I. So what we're gonna do is that we're going to open up the for everyone to speak and please be reminded again I'm for the interest of time. Everyone please and keep your remarks within two minutes, so I see and you can raise your hand, so I can call your name in the order. These hands are raised. The first one I see Eric hi, yes, I'm here yeah, so I won't go into too much depth about my deep emotional attachment to the site. I'm my wife's grandmother went there and I remember picking her up in the 1970s and I understand what a critical resource this is. My focus would be how to get you back online as fast as possible when you look at a total demolition of the site and building back a completely new building. I can tell you from my lifetime experience in construction that were I to start tomorrow morning on this between design environmental engineering impairments, the fastest that we could do this in the private sector would be for a new building like four years and the public sector, where I used to work and build things for the city and for the state you're. Looking at 50 percent to a hundred and fifty percent of that number, so you'd be looking at anywhere from a six year to ten year timeline. The next part that disturbs me is restoring and rebuilding an existing structure is always way money than building a new one you're looking at in the private sector, or something like 600 to $1,000, a square foot to rebuild a building of comparable, and so in this COBIT environment, where we have no money. My deep-seated fear is that you end up with what amounts to a vacant parking lot for like the next six to ten years in the very heart of Chinatown and I. Think Olympia picked up some points and I'm gonna. Ask some questions now. I see a skid steer, loader running around the first floor of this building and they're telling me this building is unstable. That machine weighs like 8,000 pounds. It doesn't make sense to me they're telling me that you have rotted wood joists in this building and Radha would just take years to happen so quickly. My quick question for you is: what's the demolition budget for this project. Thank you because do you want a response? All you want to you don't want a response at this moment, so I can ask. Actually I can answer I'm. Sorry, it's Erik I can answer your quick question in the budget. The budget is around 6 million Wow. Okay. Thank you. Next question next hand. I have is a mitchell go ahead. Please yeah! This is another example of the city, really not respecting the community, that visioning section listening session that he spoke about. That should be done before the decision was made to demolish this building. This building is one of the most significant historically in Chinatown. It's at the very heart of trying to tell me, both literally and figuratively, generations of Chinatown residents have personal and collective histories intimately involved with this building, and it's part of the state and National Register historic district. It's contributing to that historic district. It is the first school building design by CBJ Schneider, who was the superintendent of the Board of Education, and it was a prototype for the reform of school buildings, not only in the city, but in the country and modeled throughout the world he built in paired windows to bring extra light into the classrooms. He designed the building walls of masonry and put an auditorium in which was a first for school buildings. It's something that if any federal or state money is involved in it needs to be reviewed by the state office of his for preservation. It's in a Revival style that we will not see anymore today, those masonry exterior walls are with standing, they're solid. They can be braised with new construction, so I'm, all in favor, of restoring the exterior of the building rehabbing it for state of the art, dance, studios, storage for the community. Thank you, Joe. Thank you mix, colin chen colin you on video. All right, can you hear me? Yes, okay, I have a question full of gentlemen from yes all right has there been a cost comparison as to a sudden death or a full demolition and then rebuild right, and if there hasn't, why hasn't there be Quinten? Do you want to response to that question? All you wanted sorry I was trying to get off mute. There can I. Can you repeat the question for me again, calling yes sure I was a warning, has dipped in a cost comparison to a guttin restorer as opposed to a full demolition and then rebuilding a new structure? And you know I agree what everyone who spoke earlier before me that we need to keep the architectural lines of this I. Don't see the ground floor needs to come down right and it hasn't been a cost comparison. Why hasn't it been? So we have done some cost analysis to the building, for both that I would turn it over to Joe. To talk about your a latter part of the question in regards to keeping the kind of the architectural feel aesthetics of the building, but we did do a cost comparison and that's where we ultimately made the decision to move forward along with other things, to move forward the pool demo Joe. Did you want to add anything to his question? No, it's just that what we have to restoring the inside of the building is this astronomical. It cost me ten times more to restore. What's inside the building, to stabilize that building, the fact of the matter is no matter what I have to do. The first three floors have already gone and taken down. I have no choice: that's building departments, water and based on that I have to make this building a seismic design building and you got cast-iron columns. You cannot take a seismic load out with cast-iron columns. Your foundations aren't made for that. The building isn't. Yes, you got basin walls out there they're heavy in the seismic zone, some of those masonry walls, your enemy, the wait! You don't want rigidity that much resented in a seismic zone. But besides that you know, we did do a course analysis and it would cost us more to restore what's there and then build up on top of it, because no matter what I do I have to put a new foundation in and I have to go up with new columns, new beams and everything in the inside just to brick on the outside the red brick, most of us going down, it's all coming down and the rest. Now the windows are just typical windows to be energy windows that look the same is there's no reason we cannot mimic. What's there, the brownstone, that's there. If you take a look at it, it's deteriorated, it's got a lot of Dutchman its and all the carvings and stuff is deteriorating. You can't make them out anymore. The stone has, you know it's a source stone to begin with it's over 100 years old and it needs to be replaced. Yes, could you leave make a stone? We could get stone similar, but first war you wouldn't put a fire escape on a new building. You would put elevators in a building, so there's a few things you would do different, but you could definitely restore it to make it look the same in it and in the long run it would be cheaper because I still have to build the top three floors and the reason why you saw a bobcat on the floor. We are short in the basement and it was one section of the floor there that was made of concrete for a fallout shelter, and that was the reason why that area was able to be were able to ride on it, but we do have snoring underneath. Thank you, Joe. Thank you. Little quick follow-up to that. Yeah I mean came within the city or anyone really put a price on history that Thank You current. That is more like a statement and a question. I guess so mix. Can we I'm gonna move to K black? Thank you actually, I'm cari Cole here and I am an architectural historian and the author of the National Register nomination for Chinatown and Little Italy, and this is a nationally significant, historic district. Yet in this district there are no local landmarks that tell of the italian-american or the chinese-american experience and I think that this is a huge oversight on the part of landmarks and I've, been petitioning them for weeks to try to pay attention to this actually for years, but most recently acutely for weeks and for a number of reasons, this building should have been a landmark long ago. Mitchell addressed many of those reasons: architectural innovation, the first New York City public school, designed by CBJ Snyder, the first, the home of the Chinatown history project, which became oka and then the central community center. For so many organizations, hd10 trying to town manpower you might at East. This is literally, as everyone has said, the heart of the community with an F AR of six. This site could easily host a six story. Building with a bonus for community use, damage to the upper floors is actually an opportunity to restore the historic roofline and a half behind me a photo of what it looked like historically, and that corner tower is actually a symbolic Campanile, a which was a reference to the Italian community. That was centered here at that time. In the early 1890s I, don't know if the city has explored the use of tax credits, but this site is eligible for 40% tax credit and even though the city owns the building, they can get investors to buy the tax credits from them. Therefore, 40% of the cost of rehab would be taken as a so that's actually a very valuable incentive to rehab this building with the extra AR that is available beyond. What's currently built, a very modest rooftop addition could be, how could house more community space and I think it is really essential to say this needs to stay a community center and given the overwhelming significance of this building any proposal, any proposal for the future of this site needs to consider preservation and even land marking as an option. Thank you. Thank you. Next I would have Anthony Yip Femi it's funny here. I'm gonna go to next person, I'm here, oh yeah, sorry I was trying to unmute myself, so I just want to say that you know the mayor said that it was going to be restored. So I don't understand what happened to that. You know it's like all of a sudden we're hearing that it's gonna get demolished. When the mayor made a big speech, how it's gonna be restored, you know, and it sounds like restoration is possible. So I don't understand why there's this demolition schedule already I mean what happened to community engagement, you know and speaking of which community engagement. How are you gonna? Do community engagement, I mean shouldn't there already some sort of community engagement already and then- and another point is that you know we're losing the aesthetic of Chinatown every day to private developers. You know we do not need another big glass of the tower in Chinatown and we definitely do not want our tax dollars going to do that and that's all I have to say Thank, You, fanny and I really agree with you about the community engagement points. That is actually the most important thing about all the public projects and next I have Olympia. Yes, thank you. So my question was actually for mr. Becker, the engineer just because now it's becoming apparent that there is this huge issue of preservation and the fact that the decision of demolishing it sounds is a monetary decision that if the building could be retrofitted, so in your analysis that you described, did you also consider what most European countries that have a lot of landmark preservation? Do that is preserving the facade and rebuilding inside? Have you done that? Costanera I actually done that before you know those states, but in this particular instance I, don't think the stone I think we should replace I think we should replace it in kind and build that you know I have more for building it in kind, but I think you should replace the stone in it with a little more durable stone right now. Yeah. The other thing is you would really you know you really would want to change the way your entrances to the building. You really would like to enter the first floor. Without going up steps, you would like to bring that down bring the basement a little lower, so you could actually we hit the when you come in on the first floor between being a mulberry that that's great level so when you're coming you're, not walking up a flight of steps or trying to get to an elevator because the rear entrance, the way you coming in is illegal entrance. The whole rear courtyard is illegal boy. It is. There was an extension put on the building that was never SEDOL, see it all was built before 1970 cinnamon, but it was it was there and it's there's no record of that extension on the back being put on so there's a lot of things in that building. That is a is a right to begin with and I think even for the community and people occupying the building you may want to it, be to restore it, make it look relatively the same, but yet take away two fire escapes and have interiors their towels and everything to leave to the outside and utilize the property. You know get the most out of the property, because if you go to the back, you see a lot of jogs in and out the way that so you know there's a lot that could be done. I mean yes, you can, if you need to stabilize the building, I have done that before the facade, but you would take it only down to the brown break, the red brick, it's too common and you wouldn't want to match. You could never match the same. Color apiece good record is one color 3/4, the other color, so you wouldn't want to do that anyway, on a new building. Thank you. Thank you. Joe yeah I mean my concern is that you know again I understand what you say about accessibility adn, not having steps etcetera. However, if this is a landmark, that's the whole story, less things that are grandfather's, that just don't make sense, but they have important that is beyond that, but Tory has to be made, but you can meet it with another way. You note by tearing down the facade, that's not the only way you could meet it, but you could do ramps. You could do other things. But fundamentally my concern Jackie here is that it sounds like there are a lot of decisions that are made without any discussion, and maybe they would worth of a public discussion because they're, not you know mandatory if they are, there is discretion here made by dicas, and so it's great that we're having this conversation. Maybe there should be I, don't know. Another conversation right, I, agree with the Olympia I think they should stop demolishing Wow, so I'm for the interest of time. I'm gonna move to Nexus speakers, Amy, chin, Amy, yeah, hi. Everyone I'm here today, just to shift on my support for time, town's, iconic, 70, Mulberry, Street, community space and all of the tenants displaced by the fire I mean it goes without saying that the fire blew a huge hole in the middle of Chinatown and rebuilding 70. Mulberry Street must be a priority capital project and it should take precedence over all of their community capital projects at this time and I strongly say that it must be done and completed before the first shovel of dirt for the proposed jail for decades. The city neglected, 70, Mulberry, Street and for centuries a neglected Chinatown as a whole, and this is an opportunity to write some of those Ross and build back better than before and as the city develops, a plan. I advocate for restoring the historical structural facade, as others have said, in whole or in part, and the significant structural architectural elements of the building the city has to have the will and the imagination to create something special on this corner in the heart of Chinatown that will serve as a beacon for our community and cemani Mulberry Street must remain a space only for nonprofits keeping in line with the current zoning regulations. Whatever it's built should also take into consideration the needs of the former tenants and ensure that they can return to affordable customized spaces that suit their needs and operations on this structure should also make accommodations for other nonprofit and community-based organizations that serve Chinatown and I. Just want to give a special shout out to advocate for an expanded theater space for Chen dance center, which is critically important for the future of the neighborhood Chen dance. Centers theater was the only professional theatre space in Chinatown. It was not only special. It was not merely large enough for the community's needs in major cities around the world. We've seen how good design can bring the community closer together and imaginatively. Weave in the historic past, with thriving future and right now is hugely important, tiny town hangs in that balance. So thank you, everyone for my doing. Next, we gonna go to Korra whoo I'm from UAA hi, everybody so I'm, a member of the Yui, a you ain't and a big part of my life for the past seven years, I've attended the 70 mulberry and you know worked out there with my team for quite some time. Every Sunday, every Wednesday, almost every other day of the week, is taken a lot from us as a community from less as a team and as an organization to not have a home for the next couple of years. You know it might even be 10 15 years. That's a long time. I think what I'm looking for here is more transparency and visibility into what's happening. I think you're kind of hearing that from everybody that's on this board meeting right now. So my question is: how does D chaos in the city plan on involving the community more? You know, moving forward in the plans, the reconstruction, the design, all the decisions that are being made. You know, rather than having community constantly, have to beg you reach out and ask what's happening: what does a city plan on doing to involve the community I'm best aware we good question and there's the city. The speaker's won't answer that question so I think the community visioning process is the is the first opportunity and a continued engagement with both the local residents and the community to decipher and determine what's gonna happen at 70 mulberry we're committed to continuing to provide the community with up-to-date information on what's going on at the building. I think this was the first good step and really communicating what has transpired over the past couple of months since the fire, and so we planned our open to continue this dialogue. Thank you so much Quintin, the last question I have is gently Thank, You Jackie. Thank you for everyone on this call and all the great information that you provided I want to ask D cast. How did the building get this bad? How did you, as the owner of this building, get this building to be so bad that the wires were crumbling and that there was a fire caused by none of the tenants that this was something that was negligence on the part of the city of New, York and now you're coming to us with no schedule, you know it's gonna cause 6 million dollars to tear it down. Hmm, you don't have a schedule as to when it's going to be brought up to street level. How did it get this bad? You owe that as an entity who is looking after this building, just as the city, we called a private sector landlord accountable. How are you, how is this city answering to the fact that, now that we know the fire was caused by negligence and that it was electrical wiring or whatever it was that was under your watch? You have a responsibility to answer to this community. You can see the passion you can see the love of that building. How did you let it get like this? You deserve to have that answer and obviously Quentin you probably weren't, even born when a lot of us were we're occupying that building as students. But the fact of the matter is this is a city issue. There was a trespass even when the fire was out so you're not taking care of it. How do we have any faith that Dee caste is going to take care of this building in the future? Intend? Do you want to answer that question I? Think I'll. First start by saying I apprec appreciate your expression, but as the FDNY investigation report states, that does not indicate that any actions either by the tenants of the city were the cause of the fires. I did want to make sure that I clear that up with you first and I think that I hear you loud and clear and I understand your concern. When you talk about the conditions of the building, you know we take that back and we will address it as we think through the next part of the rebuild process. This call knows that the building was in horrible condition on this funded upper floors. It was never taken care of well and the reason we lost our archives is because the city of New York neglected our building. How do we trust the city of New York when you come to us, and you tell us all of these things about schedules and expenses when we have, you have proven to us that you let the jewel of our community dissolve the way it did in front of our faces. So again, I hear you loud and clear and I appreciate your comments and your sentiment. What I can tell you as you as you mentioned, I, wasn't I, wasn't there during that time. What I can say now is that we are fully committed to being transparent with the process moving forward and, if there's any information that comes our way, we're happy to discuss it with you, and both your concerns are valid and I appreciate you expressing them, but what I can offer you can tell you is that you know moving forward. We will be transparent and have been transparent, with everything that has transpired, post, sapphire and I can only commit that we will continue to do so. Thank You, Clinton and so I'm for the interest of time I see Canaris is here I'm gonna to allow two more questions and the last two questions will be Rob hollander and Damaris drop. Thank You Jackie I want to speak first. As the secretary of the Chinatown working group community planning group created in 2008, our community Jon zoning plan would limit buildings in the core of Chinatown to 85. Any development behind beyond 85 feet high would violate the plan as well as endanger the neighborhood and its community. In addition, the plan identifies 70 Mulberry Street as a building of significance. Now that plan was signed by 42 community groups, from Chinatown in 2014 and since then by another 18 books, folks at the Chinatown and Lower East Side community organizations, including community board 3 as a resident of community district 3, who worked for many years in Chinatown and as a published historian of Chinatown and in particular of its architecture that consider 70, Mulberry Street, not only to be the most beautiful building and in Chinatown, but also I, find it a unique design in all of New York, specifically for it's in our well tower with its diagonal windows. It's a brilliant innovative design found nowhere else in the city to my knowledge, pacing the park and visible from three directions: its distinctive and irreplaceable, in the streetscape of Chinatown. For the city to fail to preserve it would be a municipal embarrassment akin to the city's failure to prevent the destruction of Penn Station. Now 70 Mulberry Street is, of course, not on the scale of Penn Station, but its design is maybe more inventive and surprising. It's one of the great unique structures of New York, and just because it's in Chinatown the city shouldn't assume that it can demolish it with indifference. Thank you. I'll include that in the in the record, thank you, and next I have an Damaris. Yeah I mean I. Just my comments are really brief. You know I really support what the tenants of the building and people who are you know in and around Chinatown and their sentiments about the preservation of the building. I just want to say that I think that moving forward the next time that Dee cast comes to us or to any part of our community, that they should come prepared with information about how they are going to engage the community. It is not enough to just say that we plan to be transparent. It is not enough to say that we will engage them, but you need to work with those tenants and interested stakeholders to come up with a community engagement plan that is representative of the Chinatown area and all its diverse needs and I feel like we shouldn't accept anything less. This is clearly, you know a historic building. It has served this community for so long and it's just unacceptable to me that at this stage, there's not really even an outline for what could be. You know considered involvement and input from the community, and you know at this point. People are not trusting for I. Think a lot of good reason and if you come back with a real plan, you know. Maybe the tone of the conversation can change. Ok, Damaris, I wanna say thank you. I think you I absolutely right. Having the weekend, I'm asked a city to cut me to a more detailed engagement plan. What would be that the plan to engage the community and also the transparency that those two things are very important? Thank you and Damaris. So let me see so. The public has a lot of opinion to say tonight. I see the chat room is overflowing and I'm reading those chests, as we speak, even is a little bit PC to do that and before I moved to committee. Discussion. I just want to go back to a lady who a participant's who doesn't have the audio or video to talk about her point. Basically I think she type something into the chat box. I just want to go back to that. Lady. Just give me one second I think her name is Grace toi. Let me see ways: can you copy and paste your copy and paste your message to the chapel? Second? Okay, all right I can't find her I because of the because of the scroll okay, so I have it yeah. Thank you. Thank you. Oh limpia, so I'm just gonna briefly read it so grace toi, hi I'm, a Chinese poet and writer, based in New Jersey I have a long history with Chinatown Ian Pony in Chinatown. My dad work in various restaurants and my mom in is garment factories. Later I turned it at MOCA and I worked for Chen and Dennis's. They were some of the first organizations where I learned formally about my Chinese Asian American roots I urged a 70 margarita be restored, justly we need to maintain this heart of Chinatown. Thank you thanks a lot okay. So next I would like to go to the committee discussion. So we've been hearing a lot tonight. A lot were throw at us and I'm just wondering if committee members have any thoughts about that or any open years, I have I mean. Do you have options for like because, obviously like should we be doing a resolution where we articulate the points that came up to the in today's conversation there are some very important points that I don't think because was able to address also because they may not be in their purview like landmark and stuff like that, right, so I think I. We are going to vote on wrestle and I think what we can do is that we can at all these points to the to the rest. We can team and week has to engage us, engage in a transparent and in the process, they're fully engaged to local community and also recognize the historic nature of this building. I'm gonna go to list wait. How do I Lisa yeah I'm here? Can you hear me yeah I? Well, this was going on. I was starting to draft a resolution and I probably could think of a few more things. I haven't finished it a hundred percent, but I have like a page worth it. That's already so I also have something. Maybe we can like try to work together in a bit: okay, yep, so Linda do you I'm sorry, Linda has a hand yeah a brief point. Okay, I think we've heard quite an overwhelming sentiment for preservation of the existing building and dks has got a plan to demolish the existing building. So we have a point of contention here. So I believe that our resolution should recognize that community sentiment regarding preservation, I agree with you and I also, but I also hear opinions about needing more spaces creating more so. We need to put both of them in that resolution and I just want to add that normally I really I myself as a member from scraps from Chinatown as well I normally would really support the preservation of building of a historic nature, especially I really have a love for brownstone buildings, but for this particular site, I agree with the certain preservation is opinion that brownstone buildings are due to last. Intake can be restored, but I also agree with the city that the cost to restore brownstone viewing is actually very high. From my own experience, we have not heard those come comparison, of course, at all right, I think it would say it would cost less right and there is a I bet. They say I'm opinion to us for the comparison I mean just general like feeling about it, but I also want to mention that, from my general observation, China can really in need of community space. Whether this is for cultural use or for nonprofit use. We have a big need for it and I think we have. My general observation is that Chinatown has the least community space compared to other neighbourhood in cities. Free so I mean yes, I raise my hand to answer exact form, sort of saying yes, so I. Actually you know architectural II. This is not an either/or. You could definitely both preserve my building and expand more space. So it's not an either/or I think what we should reflect in our arezzo is that we want both, and there is a way to do it. Yes, I agree with you and I. Don't think we need. This is not conflicting. So let me I'm not able to raise my hand so I just wanted to make a comment. I'm, sorry, yeah, I think the resurrection Utley include what's clear from the community that we should demand that there is some type of community engagement before the city continues to deconstruct the building beyond what is obviously necessary to protect the safety of people and the building surrounding it. I mean I. Think also. We should reiterate in the Rezo that the it's clear that the community does not want the building sold to anyone and that we don't want the land use to change. It's the public facility and institution land use. The entire lot should remain for public facility and institution in perpetuity, so yeah, that's just my two cents on what we should include in the raziel you're, absolutely right, so tougher, yeah I, just have a quick question. I know heard from a lot of speakers, but I really wasn't always able to distinguish the public members from the actual tenants of the building and I heard both sides of those who wanted preservation in those who wanted more space. But can you just give me a summary of what the tenants who actually occupy the building had said because I'm just trying to struggle with those two things so from I understand from the what kind and said I think most of the tenant wants a bigger space. They want more space, but they're hoping the rain will remain affordable in the future. Okay, thank you and timely, rebuilding and the same rate. Mm-Hmm I'm. Sorry, anytime. Really building right, so how about this Michael? Can you pull up the wrestles that the draft wrestle that we prepare, so everybody can see it? Yes, I can do that Lisa. You said: you've worked on some things. Do you want to email me what you have so do I have your personal email I? Can private, oh and also share my screen? I guess unzoom, but, whichever is easier, I think you'll be easier to share Michael screen, because so we don't have tools against going back yeah. Why don't? Why? Don't we share this I'll read through it and then Lisa? We can add edits and if there's a lot you can, you can send me privately. Can people see the screen, not big enough? Sorry I. Have the map of the zoning lot behind? Okay, can people read that no yeah, so committee members would that be? But well because is Michael doing the scrolling and you don't have control of the speed of the SPRO? Do you want me to email you would that be. That would be nice. Thank you. So let me just email, you really quick. While you do that. Do you want me to read the reso yeah? That would be great. Thank you. Michael sure I mean, and this is not incorporated, the majority of what was discussed here. So obviously we can add more so. It says where, as on January 23rd 2020 a five-alarm fire destroyed the top three floors of the historic 5 storey, 70 Mulberry Street building and caused significant water and structural damage on the other floors as well. Whereas the 70 Mulberry Street building was constructed in 1893 to house PS 23, the first public school built by CB j Snyder, who went on to oversee the construction of more than 160 schools in NYC, many of which are New York City Landmarks. One of its innovative features was the basement auditorium the first step in the movement to provide community centers and neighborhood meeting halls within schools. After the school closed in 1975, the building became home to five Chinatown nonprofits and cultural institutions, Chinatown Manpower, HT, Chen and dancers, Chinatown Senior Center, operated by the Chinese American Planning Council and United East, Athletics Association, and the archives of the Museum of Chinese in America, all of whom are currently displaced and as the diversity of community uses and services. These organizations provide to Chinatown residents include, but are not limited to programming for seniors vocational training, workforce development, small business assistance, dance performance and education, archives and artifacts from 40 years of MOCA, curation and collection and youth education and athletics programming, and whereas the Department of Buildings and Department of citywide administrative services have determined that there has been extensive fire damage on the top floors, as well as additional water and structural damage to the remaining floors and building shell, and that the most appropriate course of action at this time would be full demolition and whereas Chinatown Menezes is an important cultural destination in New, York City. Yet 70 Mulberry Street was one of the only spaces in Chinatown that supports and houses nonprofits and cultural institutions that provide cultural programming, education and training to the community and whereas Chinatown has very little community facility space and the neighborhood lacks accessible spaces for community meetings and whereas in a January, 27th 2020 statement, Mayor Bill DeBlasio committed to rebuilding at this location and working with current tenant organizations as the process unfolds and whereas, while demolition has begun at 70, Mulberry Street, the process and timeline for planning a new building and starting new construction is unknown at this time and whereas, in this challenging time for city finances and operations due to kovat, 19 and budget shortfalls, isn't particularly important to make sure that there is a well-conceived plan to ensure these vital resources are returned to Chinatown community to the Chinatown community as soon as possible. During this, in my oral administration, therefore be it resolved. The city should formally commit to redeveloping the 70 Mulberry Street space for community use as soon as possible and therefore be it resolved. The city should establish and share with the community a clear and transparent timeline for planning, design and construction of a new 70 Mulberry Street space, which will include regular community outreach and appearances or the community board to receive input and ensure community needs are addressed and the community is represented in the planning process and therefore be it resolved at the current tenants will have a right of first refusal for community facility spaces that are at minimum equivalent size to their pre fire units with rents, cap pre-fire rates and therefore be it resolved at for guaranteeing community space for the existing 70 Mulberry Street tenants. The city should ignore all opportunities for additional community serving uses at this location, all of which should be guaranteed in perpetuity and therefore be it resolved that any redevelopment should include commemoration of this building's importance in the history of our city. So I think right off the bat. The resolution is not I, don't think it makes it clear that demolition I think that we could parse out a little bit more of the fact that it's not absolutely necessary for a folk to have a full demolition from what we've been discussing and then also the things I mentioned before, about keeping it in the public trust and ensuring that public facilities and institutions land use remains the same for the whole lot in perpetuity Mike. Before we discuss it, can you incorporate the leases staff this way? We don't do double the work. Elisa send her. You know, send a you know to Michael. Yet, yes, okay, I'm gonna, stop sharing my screen, so I don't share my email inbox with 150 people on this call real quick. Well, you do that. I just agree with you that we should not include in our resolution an assumption that the building will be demolished and rebuilt, because so much of the possibility of partial preservation and expansion. Also, can you guys hear me? Yeah I also feel like the resolution and the part where it talks about community engagement and transparency, makes the in the presentation is the same thing as engagement and that the community board is the only representation of our community. So I think that you know we should be clear that it's not just presenting what the city decides, but creating a process outside that residents can be engaged in or stakeholders can be engaged and to give real meaningful. Could I read my therefore clauses that I think might be a little stronger? Can you enlarge the screen because we cannot see? That is that? Is that better yeah? That's better! Oh you have it did you did you want to read it Lisa? No, if people can, unless you want to I didn't know, I was still on my word version that a city of New York am ownership of the building and that is used to that is used to be continued into perpetuity. As a community facility. We already have fun the perpetuity as a community facility, so you want a city to have the ownership of this building. No, we don't have it in perpetuity. We have it's. It just says the guaranteed community facility space, for it doesn't say explicitly to me personally that the entire lot should remain for community facility purposes and that language is clear. Stronger I feel Jackie, okay, so let me see so we can replace these are. Where do you want to add that be resolved? Why don't we through the whole thing and see how many of these we just want to insert and worry about where they go? Okay or who cares where they go? All the occupants are building at a time of the fire being on the right of return. We have that at least the same square footage at a cause that is comparable visit your a charge at a time of the fire. Okay, we have that we have similar thing. We have similar thing not exactly the same language that the design of the rebuild begun, with a strong emphasize of retaining the architecture and historical heritage of this structure, which is very good this one we can replace the last one in that a few things we redesigned and we use exclusively for the use of either for nonprofit neighborhood base organize they are possibly in cool, affordable or supportive housing. Okay, do we want to do? We want you at the housing here, because what we want to open for the community to have a input first, I'm, just like the de Marisa, is that before keep reading keep reading, it goes on to talk about that. Okay, also, I, see that Jim Shelton has his hand up I don't know. Do you have something to say that it's urgent? Why don't we go through like all these points, and then we go to Jim yeah, it's not urgent. Please continue, yep that the building be redesigned and okay. We have said that every step of the process of moving this building forward toward to a redevelopment be done with the full, meaningful participation of the prior tenants, residential neighbors elected offices and community pottery, that the participation should be at every sorry, okay, every phrase of the planning from decision about it about either the renovation wait. You have it yeah I, think that the IDA renovation I think there's a typo as a redundant versus the reconstruction to redesign the construction and, finally, the administration and management of the final building that this community engagement process became immediately and that dick has returned to Savitri with a more specific plan describing how this participation will be accomplished in no later than July meeting of the Land Use Committee that the city must do everything possible to expedite the reconstruction of the property with the goal of reoccupying it within three years. I have no problem with most of the points. Jim is there anything you want to add. You know I'm sorry, I was coming in and out. I may have missed some. What was mentioned and leases and additional points that may have addressed this, but I just want to flag, and this is not an endorsement. You know making a decision on this one way or another, but I just want a flag that you know one thing about it, so we'll look out for about setting into stone the e land use in perpetuity. Is that your then you know you're a Solis you're saying no to two things to stand out in my mind that are that are a possibility with. As of read, zoning may not be preferable, but their possibility I mean that's. You know ground floor commercial uses for small Chinatown businesses that are struggling right now, and you know those don't have those could be small spaces, they could be serving the local community. I mean the additional one would be. You know some sort of affordable housing or senior housing. You know that's a whole other bag of worms to open up and get into, but it is allowed by zoning. You know it's wouldn't be allowed if you were to say that this is the only land use that can exist here. So and I think like in Barrett in previous conversations about this, we heard rumblings about that from different community stakeholders. We didn't hear it so much from the public tonight, so you know that's not pressing that issue one way or the other I just wanted to bring to everyone's attention. It's something yeah. You were thank you or India. Yes, so I was thinking. Maybe we should add some, whereas about today's hearing and the people who spoke today and highlight clearer what Linda talked about. So the fact that there is obviously a disagreement with the assessment of dicas about resolution about the demolition and that this decision is at their discretion right. They did it because they did all this financial studies and they decided on that. However, what has become clear today is that we could say when I said the hearing the community wanted you to understand, you know and have input on that decision-making. I, don't know! This is not a you look, I, don't know what we can ask, but I think make it more clear, because right now we're just mentioning what they stated, but we don't clarify that this is this. Is a decision made behind closed doors with numbers that they're and that we know we have no way of assessing their veracity or you know the criteria that they use. Someone in the audience said like: how do you value culture, so mr. bridge is really something that is very important and I think we need to clearly state in our Asia. Thank you so Lisa and I look at the points you made. A lot of them are very similar to the wrestle we already have so now. The point is that how do we merge two documents and also I think certain, like that, the wrestle we created has more or less have some assumptions based on some assumption that a building will be demolishing I think we can add a certain language that we want a city to be open about test I mean I, think the only way we can ask that is if we come, you know, Linda said it. We have at the right point right. So if we say suspend the demolition calendar for October 2020, because if they don't suspend that, if cb3 doesn't ask for that, all the other things that we're asking he they demolish the building, they have no meaning I agree. I was thinking we can add, or we're asked somewhere in there something where's there a strong community support for preservation of the building. We should not. You know it's too soon to assume that that's not possible, I, agree, I, don't think it should be aware, as it should be. Therefore, right I mean how the reason I said, probably both it back in that somewhere back in the early part. It says if it's already decided that the building's going to be demolished I propose that we remove what I've highlighted here. The course of action at this time would be a full demolition. I think we should take that out. Yeah, yes, agreed. We I'm sorry do we can we are we free to edit this right now or do we have to do motions and things like that? No I think so. I think what we should do is that we want to move the wrestle first and then we can modify the languages and if we think that part I mean if the majority of the committee thing pepper, want to be removed and I think before removing it and rewrite it, you use the information that you have there, because those are important information that they evaluate it like that. But there is disagreement is what is missing there? Can we let him talk first, Jim, a very brief: this is I, just I, don't know if D cast is still on the line. This might help I. Don't think this changes, how you on a phrase I'm sorry, it doesn't change the sentiment that you want a document support preservation but might help to get clarity. So I was understanding from then, but just the decision for demolition has already been made, whether we agree with it or don't agree with it and want to stay that opposition in the resolution is a different question, but it might be helpful to get clarity and whether that decision has been made or not. I, don't think it's been clear in the discussion so far, I'm personally not clear on it, but I, don't know if they're still on Thank You. Mr. long, okay Quinton. Do you want to add to your answer that question? Yes, so the decision has been made to move with full demo. So, as we currently state, the city is moving forward with full demo. So Quinton can I. Ask you a question. Of course, though, is there? Is there any way to change that or it will move forward in there and there's no way to stop the demolition of the building? So, based upon the assessment that we gave you that's what we're moving forward with, you know as I always say: I'm open to hearing what feedback folks have been talking with folks about their concerns, but, based upon you know our assessment that Jo articulated earlier today and other factors we have made that decision. So it's already in the process and as we described earlier, you know we Wow. We didn't go through the I'd, the timeline or itemized timeline. Exactly when each floor is scheduled to be a part of the demolition process, the idea would be that demolition would be over or done in October of this year, and so we are moving forward with that timeline. Can you share that timeline with the board? Yes, well? How about this Olinda? Can we say something like a due to the amount of people also mentioned about preservation for this building, so we advise the city to take another look to see if there's any possibility to partially preserve the building yeah language like that, would that be? This decision was made with no community input whatsoever and I'd like to say this is demerits I'd. Also like to say that you know this is a very critical and crucial time in Chinatown, and you know the stakeholders, residents and community organizations really need our support because they are going through a substantial amount of hardship right now due to covert 19. This is not the time for the city or any of us to be rushing to further demolish or change the integrity. The historic you know, integrity of this community and so I, don't I feel like I, haven't seen enough at this point to convince me that this is the only way I think we need to speak with a sense of urgency. I agree with the comments. I think it's completely inappropriate that there was absolutely no community input and the city has just decided to demolish the site point-blank. Is there any process that, because someone mentioned that they reached out to landmarks, I, think an expert from the National Building like a woman who's? The preservation is who has been petitioning for this. So is there any process in which a letter can be sent from cb3 to landmarks to understand what is the status of these or a copy of this ratio? I don't know, what's the best way to do it, email communication with LPC, but they have been dragging their feet on an official response and they are well aware I hope there are no Chinese, American or Italian American landmarks and certainly no landmarks in the core of Chinatown, but they have not come up with an official response. Yet could we attach if this is a formal preservation organization? Could we attach their testimony to this riser or something like that? We normally do. We normally do that I, don't think we normally do that I mean we can ask the district office to find out more info. It would be, it depends what you so. What so look I mean? We would not you can't. We can't send the letter on behalf of the community board or endorse something that wasn't voted on by the community board. I mean that's. You know I, my thinking. If you wanted to do something more specific to landmarks, you know: that's not really. What the stated agenda item was. I mean you know. The proper procedure would be to probably put it on landmarks next month. You know that you're talking about, though, what, like you, know three four more weeks, so you know I, it seems like you might just want to document your concerns about preservation in this resolution, because it's gonna go out in two weeks. I agree, rather than go through the process of a formal letter to see two landmarks yeah, just because it's not really procedurally appropriate, it wasn't the agenda item and it would be slow to do that. You can still do it. In addition, so we're happy to hear it in landmarks. Yeah also, there's no harm and sharing the committee's feeling about this. With the landlord's Commission yeah. Sorry I should clarify I, don't you know this resident could be sent to landmarks, absolutely yeah, LPC, absolutely yeah. So we should go back to the wrestle to the draft wrestle in the interest of time. Why don't we edit the where, as is first and get that in its place, corporate? That, therefore, is with Lisa's right? So why don't we so I see the first, whereas we don't have problem. We should not have problem with it right, okay and the second, where this is hard for some of us to see. So maybe you can make up just a tiny bit of reference to watch it. What is an each we're at the church? Seeing is okay and Damaris I. Also, you know to the file. If you want, oh I thought it was being changed, I'm, sorry, III! We have don't change nothing. So all right cause Lisa presented a reso as well. So no that's a good question. I'll still mention it, because I think people, you know, there's still 100 people I, think they're still interested. So the first was just the fact that there was a fire. The second just gets into the history of the third again is just mentioning the history and the uses in the past of the building. I. Don't think we have any issues with the third either and I have an issue with the fourth right I also when we mentioned to take that last sentence out this, whereas is saying this is the position of D cast, so maybe we can say and that the that D casts has determined without community input that the most appropriate course of action at this time would be full commission, and should we add in here I heard that this building is listed on the National. That's correct, I think we should say that it is new state and national registry register it's nationally significant. Yes, let's put that in the second. Whereas, or should we just create a new, whereas maybe says it would create a new, whereas because this is a very important point, given the fact that they are on the schedule to demolish it, I guess they say the building is contained within the and a town, Little Italy, National, Register, historic district. It isn't the contributing resource to the historic district. Yes is a community. Its computed resource, yes, rather than contained within a place contained with, is a contributing resource. Yes, the Chinatown and Little Italy. What was it? Historic, Registry, National, Register, historic district, yeah, there's no comma in there, and then you can say others of national significance, architectural significance. We should say or school construction we say architectural and cultural significance. This is for just I mean this is for committee discussion. So okay, so we added, whereas the building is a contributing resource with town and Little, Italy, National, Register, historic district and is of national, architectural and cultural significance. So we want to go back to this decaf paragraph. Have you put in the with that community input? That's good! Sorry, I, added and dks, as determined without any community input up the most appropriate course of action at this time would be a full demolition and wouldn't help for us to say and therefore is in danger of, or has been, he said, is now being or is now being planned for complete demolition, replacing that last part Lisa yeah and is now being community input. It is now being planned, yeah, full demolition and I think we should also say clearly that the way they made this determination is for cost-effectiveness, because it's apparent that there are other solutions, but they would cost more so the determination or, if not, but fundamentally, because well, it's a determined if they determined that structurally that had to be demolished. We couldn't be containing that right. You know what I mean. That's. Why I asked that question, because if it was transfer lis irreversibly and in fact we could not be having this conversation, what became apparent in the presentation today is that they made a cost analysis and that was conduced them to decide to demolish I'm, not entirely sure I want to I mean the financial consideration is the only thing because they also talk about like trying to expand the spaces, but you can expand the spaces and protect the building. That's what I'm telling you actually one is not excluding the other. That's done all the time. New stories are added on to old buildings exactly well. My objection is that they might be oh, that might be a winning factor for them. That it is cost-effective and it won't be a decision-making factor on their part, but we can also do we do remember what the difference is and again there was no community input, so I think that was speculating about these things without having legitimate community input. So maybe what we can? We can say that we they all go through their two scenarios. They didn't consider the scenario of preserving only the facade, even though she said that they did consider it, but he thought that the masonry was not replicable or something, but anyway it felt that we needed more scrutiny in that decision-making. I'm in favor of leaving I mean to you guys. Okay, then we move. Can we move to the next way? You say we builded, Mayor, DeBlasio, say rebuilding or restoring I thought I heard one of the local people saying he committed to restoring the building. He did on television on television. So, let's not say, rebuilding okay. Sorry I was on the top when I recall be comfortable with these two paragraphs. Well, Jim, do you recall if the mayor said rebuilding or restoring you know, I'm, not keeping track of every single public statement, but I included the link to the press release from the mayor's office in the resolution. Just so just in case this came up and because, like frankly, yeah I'm not keeping track of his exact, precise language, but we could reference that article is at least it's it's written and documented, and it's posted on their website. I mean I forget off the top of my head. What exact language was used, but I heard someone testifying is the word yeah somebody used an open. Sorry well is easy, Wow, so I'm looking at it says the building can be rebuilt or restore that's what yeah I mean you go to that mean I just want to say that I had him literally safe, restore and he committed to it, and it was literally the day of, and he promised us. He promised us on the ground. I mentioned that I. Think it's really. It's messed up that you know the city is telling our elected officials that things and have legitimate community input, and then they don't. You know I, think that's completely, and we why don't we use both rebuilt and restored? That's what it says in the press. Release yeah plenty of reference to rebuild, but I think the context of the way that he uses rebuild is I, don't read it as we're. Gonna rebuild the whole building, but, like you know, when you're, when you're rebuilding as to make something whole. That's just me I! Don't not that we can explain that in the in this, so I think we should use our best judgment is whatever language he used. He said rebuilding and restoring, and that's what we could say yeah because he said until the rebuild I agree. So should we say rebuilding he said, rebuild yeah or restore and always go right or restore it or repeal or restore yeah, all right, okay, Incans and then can we move the next one, and while demolition has begun or even into process and timeline for planning, anything is unknown at this time. I think ISA has a strong, stronger language. If I remember Cocteau, he said: do you have a stronger language for that? Yeah I like that, therefore be resolved better actually, but thank you Michael right here. It's also were therefore. It says, therefore, be it resolved that the city should establish and share with a clear and transparent design. Construction- and yours is stronger right. I, agree that I'm not sure which one no I think I think we can keep Lisa a stronger language at the be resolved clause and whereas this way, as is naturally okay, because this s will lead to Lisa's a stronger language on for the will be resolved, so I mean, unless you guys have problem with the language here. I just think the language should be stronger and we mentioned it earlier, but I think we should say something like, whereas the demolition has already begun and the way and it's scheduled to finish on October 20 yeah is maybe it's just me, but if we're saying that the demolition has already begun, I think that weakens our case for saying that he should consider a restoration versus demolition. So I think that you're right I think the problem is what we saw in today's pictures is they're cleaning debris from there really like destroyed upper floors, so I think maybe phase one of clearing the building. Is it's not the demolition? We can phrase it like that plus Mike. When you change, did you change the meaning of the sentence, because the is scheduled to finish in October, you needed to say, has already begun and, if scheduled, to finish in October, because the planning and a timeline for setting a new building is still unclear. So that part it should stay as it was right. That's my bad processing timeline for you're working out there, a lot of pressure. Don't worry you're doing really. Well, maybe we should that's a Google Doc in the future. We can find a way everybody came to you. This is okay, so I moved it to the front to say: demolition has already begun, October, actually, I. Think it's really important to mention that again the demolition began without community input, I mean I, don't think, since it's already happening I, don't think not including information about what's going on. Will help make our case? If that's, if that's and it's somewhere, we need to say, stop, wait. We really now we have to finish this in on the first, whereas on this page to know and the timeline for planning a new building and starting new construction as past has not been determined a hand up from Ellen. What on one second, Helen, hey so I, don't want to throw much attention to this, but I just want to note this. For the committee I said on transportation and as we talked about you know, City and also into Chinatown many supporting businesses. We have to recognize that we can't open them streets, apparently where Samuel Barry is be heard and mulberry are closed. So you know, for whatever reasons whether they're demolishing it or they're, still eating close those streets up fully. So it would be nice if there was a plan somewhere to have those streets be up where it's part of safe, Street and accessible and people can walk down those streets. Do we want to add this to this vessel or we want to contact empty casa separately? Just moister concerns for the small business people I mean leave. We didn't do the landmark thing which this is a transportation thing I mean we can add some language I just feel like. We can just ask the dicas to maybe open up half of the street half of pay year, half of model re4 for transportation to traffic's, to move, but I don't know if we just diversity related to this wrestle I. Just because do we still have the thick at. We still have Quentin with us tonight, I Jack here, hi Quentin. So do you want to answer that question and the question was in regards to see if we could be able to open up Bay yard, Mallory yep robbery tomorrow, so currently Marberry? So currently, Bay yard is on the side where we have kind of the site selection, so the site where the construction workers are actually actively working. So that will remain closed until that part, that side of the building is actually completed or we've deemed it safe to actually open it back up, I believe if I'm getting my streets, correct mulberry is open on one side and unfortunately we will not be able to open it fully. Until all of that is completed. So to answer your question, we won't be able to open to open bay yard until that side is deemed safe to do so and mulberry it's the same thing there. If you actually are on the site, you'll notice that some of the trucks, as well as a trailer and things of that sort. So that's why half of that side is also closed as well, but the pedestrian sidewalk on the bay yard street is still open. I. Think I heard someone say that that's not open the pedestrian side on Bay yard is open. One part of the street on Mulberry is open as well as a sidewalk. Stepping I don't need to mean to be technical, but it's open on the outside. So far as one person like me walking one in one direction, it's really like. If someone else is coming towards me, I have we have to move sideways in order to avoid each other. So that's how narrow, open and I think so, I guess. The question we have right now is that do we want to add the opening of those Street to this retro and then and then we can go back to top with dicas about how soon they can reopen the street or later. But the question now is that we want to hit that today. Jackie this kind of issue that our district manager would say is an operational issue. Is it belong in the resolution, but it definitely belongs with the office. - were right, I agree with you, Thank You Linda. Welcome, so can we move to next? Whereas and by the way do we still need because representatives, because I don't want to it's almost nine o'clock I, don't want to keep them for too long -. We still need them. We constantly bump into new questions. Okay, so, let's you know interest of time. Let's just move on: where were we were the second, whereas right andhe's, not for a year okay time for news, I, don't have prob with this parable, but I think maybe too vague. What does it mean? Are we asking because we're I think we're asking for two very important things? That may mean the opposite one is we want them to move fast, because we don't want people to be displaced forever and the other thing is we want them to stop demolishing, because we want them to reconsider the plan about the reopening of the building the restoration may be. Should we maybe praise this clearly here, because otherwise, because someone could frame our asks as contradictory, he said I think they make a lot of sense. We want both of these things, I'm, not sure I'm following you, I, don't see a contradiction, we're gonna, see and therefore applauses that we are demanding I, don't see any okay go ahead. If you see I, do you think this is clear enough that we trusted we have? We can do it therefore be resolved? So we, let's move to the therefore be resolved. The city should formally commit to redevelop the seventy mother's recipe so well, since we are moving to dead for beerus off course. I think we need to also look at leases. Can I suggest that we just changed this one to say the city should commit in writing to redeveloping seventy very street for community use and retaining it as soon as possible hold on developing and retaining in perpetuity seventy Mulberry Street as community for community use. I agree. My only concern is redeveloping. Is this that what we want to use, or should we say the city should commit in writing to restoring I think redeveloping this, but I? Don't I would like to keep the options open at this point for either I feel like I want more information about what would be in the public interest, and then it development includes restoration, exactly the absence. Yeah could open for more community discussion because there has not been enough community input exactly should commit so I'm. Sorry, you said redeveloping and retaining in perpetuity and I like community use better than community facility, because that does keep the open, also affordable, housing. Yeah. Are we? Okay, with this cause, can we move to the next one? The city should establish, hope, I'm, sorry, no I, just added that I think it makes more grammatical sense. Okay, the city should establish a shared with the community, a clear, transparent timeline for planning, design and construction of the new the space, and this one I would suggest we replace with two of the ones I write, I, suggested, I agree, which was it these two? No, that one I think we've covered that. Maybe it's the next three, please let me drop them in and then, if they're redundant, take them out so, but we think we should take this part out the formatting book. I think you want to remove the original, therefore be for the result. Clause is everyone in agreement. Yes, you have a double that that's that Kalina on third line. Okay, can we go to the next beery soft cloth that this community engagement process begin immediately and the deke has returned to see be free with a more specific when describe how this participation would accomplish no later than July? Okay? Why don't we say two months? No, so now we have agenda on it time to spare twelve hours and then next that the city must do everything possible to accept ID reconstruction of the property live to go of reoccupying within three years within three years. Okay, I think I, know that's ambitious, let's hope at least we can ask for. We don't want to wait for too long with the three years. You know what I might recommend it. Maybe three years is fine, but you know you got. You got a commitment from this administration. Do this work right, whether it's realistic or not? They committed to it. When is the end of this administration I'm forgetting next year, so obviously reoccupation is not happening. Well, I mean, ideally it would okay. So then never mind I just wanted to say you know a goal. I think should be the pressure on this administration to follow through with as much of it as possible. As you know, what happens when the agency projects get stuck between administrations, but that's okay: Lisa, can we add something like a lease? A deal is which or agreement is reached within a year or two? Can we as something like that? Would that be helpful three men for what the question would be? What could boys I think I, don't know, I think that we've said that the process move had cooperatively starting immediately and that the whole thing be done in three years is about that we could do, but if anyone has any other suggestions, I'm open okay, if not, then we just gonna go blue didna Linda! Yes, do you have anything to say? No, that's fine! Okay! So if not no comments, then we're just gonna move to the next clause on that which one okay, sorry, that the current tenant will have a right of first review so for community facilities there that are at minimum or equivalent size to the pre-fire unit, with friends, kate, at the pre-fire, we're saying if like if somebody gets the same amount, they'd be paying the same unemployed. You had that in one of these right yeah. She also had that in the good should we just danger with what Lisa sent originally this just can I see the comparison I can read. It says that all the occupants of the building at the time of the fire be guaranteed the right of return upon the completion of the restoration, / reconstruction, with at least the same square footage and at a cost that is comparable on a square foot basis to the race of the fire. I mean I. Don't see that much difference between the two paragraphs, I think it's just a square footage comment. You know. Yeah leaves open the possibility that they have a larger space, which I think is on the table. But at the rate you know it's just it's a it's some specificity that helps with the clarity I mean I, don't see the I mean I, guess both paragraphs capture, the essence of what we want. So it's more clear, the one that the leader says decides not more clear I think is more precise. Yeah cuz I'd have to agree because of the possibility that the a larger Union you know ends up being what we're talking about here. I think Lisa's catch was it more accurately but upon the model of the essex market. Yes, are people comfortable with me replacing with Lisa's language? Are we comfortable with this restoration, /, construction or yeah, and then we go to the next one I'm after Karen guaranteeing community facility space for the existing seven in mauritania, the city opportunities for additional commute serving use at this location of which it should be guaranteed in perpetuity? This is from Lisa, or this is from Jim and I. Think these are have something more descriptive if I remember correctly. Well, the one I think I'd like to stick in the affordable housing or supportive housing. I I just say that the that would entail change of ownership right, I think you d Cass almost never owns buildings. Did we, let me say previously, I'm sorry, it's getting late - did we say previously that we would not support any change of ownership? Yes, okay! Well, you might want to I mean another option is to just put some qualifiers on that, like you would not support change of ownership like other than one that facilitates 100%, affordable, housing or sleek. You know I, don't wanna get too specific, but you know you don't want to close yourself off to things that might be just the privatization you said of change of ownership visit these public. So we cannot for profit, you know, typically it wouldn't be like, but it would my problem with that is it's still public land that's held in the public trust movement. Why did land owned by a private actor and I think that we should? You know I think we should see. If you know people in the community want that and really are asking for that, then that's a conversation, but nobody did I'm. Sorry, okay, I'm! Sorry, maybe we should say guys: I just got the type of the last, whereas it says in surah stead of answered. You should change it absolutely I'm! Sorry, the last, whereas it says a well-conceived plan to ensure this battle. I think it's answered this by our resources. Yeah, it's a and instead of I am the first. The first letter in the third line of that we're us ensure yes, writing of it. Unlike mine doesn't say that it should retain ownership by the city. I think that we should put it explicitly good, just replace it as work minute. Well, so now we're saying we can't do housing because of this. Well, if you retain the ownership of the building, city typically does not own like housing, but it this way. I, don't know what this helps right, but you could kind of conveniently not get into the specifics, because you know that were the ownership to change, you would have to review it as a mini. Euler I mean it's a little bit of a cheap way out of having to define their terms, but it does my you know my point: is we're not going to lose an opportunity by not mentioning it now, instead of community facility, we could say in perpetuity for the public good or something for community use, as it said before, right like trying to try to leave the language a little just big enough. It's continued in perpetuity for community use, I'm just wondering like if we say what would be the difference with if we say to retain the ownership of the land as opposed to the ownership of the building, because you saying you're likely to be a land lease rather than actually just like that, yeah, because if the city of the land in perpetuity that also implies that whatever it develops above the land wouldn't be, is not gonna be entirely privatized. I don't know! Is that it? No because you could own the land and leave it, but you also have like folk in perpetuity for community use, so I mean I. Think it's okay, as it is now no transfer from it merely use distance, especially I mean if it's privatized it has to go through you lerp, so that would be a so. We need to add that the strong their force now strong, therefore, is therefore we want, because to seize the scheduled for demolition by October 2020. So sorry, I, don't think we went over the last right. The last there forward. Is it the last two their force I think that I'm sorry, this section instead of again prescribing what should happen, I think that we should say the city should explore. The shitty city should work with the community when exploring I think its gathered above we're saying that we want them to have community input. We don't need to put it again here now, no say explicitly, including affordable senior housing. Did you go higher up to see what we had added? We didn't add anything about housing yeah, but what it says that every step of the process of the moving of this building forward, so what the development be done, with full meaningful participation of the prior tenants, residential neighbors elected officials, that participation should be at every phase of the planning from decision, but they're either invest their innovation versus and resection the redesign you can either. You cannot there any program, and then you cover it because it can be programmed as housing program as I, don't know a circus or whatever they want and before either I'm. Sorry. This was this paragraph yeah. Yes, where is the program going wait said this is just about if this either needs to be very next rider there mm-hmm? No, it's extra done, okay about either the renovation versus the reconstruction, the design, the construction, the program and, finally, and now we're covered that's great, okay, so I also the last one I, don't like it, because it's defeatist, because you want to commemorate its historical memory. We agreed that it's going to be demolished so since we're fighting for them to maybe maintain the facade or like find other things, maybe you know we just take that out. Yeah say something like we've been discussing something stronger completion program. Sorry I thought we put the last one should be, can I say deeper right. There therefore decal should last immediate I'm impressed doctor we're taking out what's found out second-to-last the one right above yeah I'm, sorry, so we wanted to take this one out or we wanted to keep for allowing us to participate to this evening. Thanks for -. Thank you. Thank you. Thank you. Joe yeah, that's weak. Let's just get rid of it. Take it out, I think so. I don't know if anybody else has an opinion. Okay, I suggested I agree with you. Okay, it's nice to wind up with stop now the hardest thing in the world is doing editing a document. Yeah do you know simply on the spot that it says very challenging? This is one thing that zoom really facilitates, though it's true it's easier to do it here, they're having Google Doc, because it may have gone faster because we could have suggested that it's to you and then it would be faster. You know it. He was a beer. We discussed this I'm. Sorry did we resolve the issue Jackie? If you guys don't meet yes anymore, they haven't gone yet. Could you tell them to go yeah I thought I, thought Michael already well, I'm. Sorry, I thought Mike left. Okay, they've been testing me to see if they could go. Thank you. Yes, it does so Michael. Why don't you? Could you really do the whole less okay, I'm, sorry I, just before we go through it, I just want to make sure. Hopefully this will save time. Did we resolve the language about city ownership? I know we had the discussion I just forget what we settled on. Yes, the ownership of the building, oh right, okay, so the distinction and right because the idea being a change of ownership would come back before the board anyway. Yes, like you, suggested yeah, no I know I, just I could not remember what was captured you're getting all Jim. So if we are okay with the changes, can we have Michael, maybe with yeah I? Think since we went through it, I feel like it was pretty guys. Think so. I mean that we're all fried Michael, so you know to remind you: Michael, please, yes, agree. I agree may be appropriate, so I actually wanted to I'm. Read it again, just be more formal so that we could top it and I mean it's just like we always do so. How about this Michael spend Michael pearlies spend a lot of time. Editing it I'll just really fool myself. So we can move to and I already heard, Olympia wanted to move it right. I'll be real, quick how's that I'm happy to read it. If this is what CB 3 prepares as long as they take away a right, if we want to amend it in full board, better right, yeah so I mean I, can read it. That's okay, so I'll be really quick, whereas on January 23rd 20, a five-alarm fire destroyed, tops real flaws of the historic five-story 70 Mulberry Street building and caused litigant water and structural damage on the other floors, as well as 70 Mulberry Street building was constructed in 1893 to house PS 23, the first public school pew by CP j Snyder, who went on to oversee the construction of more than 100 cities, schools in NYC, many of which are near city limits. One of his innovative features was the basement aureum the first step in the movement to provide community centers and neighborhood meetings, force, convene schools after the school closed in 1975, the building became home to five Chinatown nonprofits and cultural institutions. China and pop ojh dgeren dances, Chinatown senior centers, operated by the Chinese American Planning. How so the United of the efflux, Association and archives of the Museum of Chinese in America of home are currently displaced and whereas the building is contributing resource with Italy, National, Register, historic district and is of national architecture and cultural significance? And whereas Michael can you pull up a little bit? I'm sorry, I, didn't know you, okay, so where, as the diversity of community uses and service, this organization provided Chinatown residents include, but not limited to programming for seniors vocational training for force, development, small business assistance, dance performance and education archives in artifice from 40 years of mocha, curation and collection and youth education and Lakes athletics, programming's, and whereas the Department of Building and Department of City y administrative services have determined that there has been extensive fire damage on the top floors, as well as additional water and structural damage to the remaining floors and building she'll, and that dicas has determined with now any community input and is now being planted for food and militia and whereas Chinatown is a important cultural destination in your city. Yet 70 Mulberry Street was one of the only spaces in Chinatown they're supposed to house their supports and house nonprofits and Cultural Institute institutions that provide cultural programming, education and training to the community and whereas Chinatown has very little community facility space in the neighborhood, laughs, accessible spaces for community meetings and whereas in a January, 27 2020 statement mayor de Blasio committed to rebuild or restore at this location and working with the current organizations as the process unfolds in. Thank you, whereas while demolition as 7e Mulberry Street, has already begun and is scheduled to finish in October 2020, the process and timeline for planning a new building and studying new construction has not been determined and whereas, in this challenging time for the city, finance Sisson operations do to cover 19 and budget show, for it is particularly important to make sure that there is a well-conceived plan to ensure these vital resources are returned to Chinatown community as soon as possible. During this narrow initiation. Okay, therefore be resolved. The city that the city of New York, retain ownership of this building and that I use and that is used- be continued in perpetuity for community use at any language. We want to change that and that it is used to be continued in perpetuity for becoming. Okay, therefore, be further. Will stop I, think you're, right I! Think that's it's a little bit awkward yeah. Do you want to change the wording for community purposes? I guess we could just say instead of use here, I, don't know say maybe say: community purposes. Community needs something that shows that responsive to the local guys that it continues that it continues to be just a cup the youth there, because community, which we chose, don't purpose it be continued in perpetuity to be it continues its designation, its it community use designation in perpetuity I, think we could city of New York, retain ownership of this building and for the perpetual and for perpetual community use and community use in perpetuity yeah. That is also a big get rid of the end right. This building for yeah perfect. There was another technical edit above you forgot to put in parentheses because after you spell the Department of construction, cetera its that where us, where it says the Department of Buildings citywide services, administration services, excellent, exactly because yes- and there is one where asked that we said we were gonna added- we didn't add the. Whereas of today's hearing, that we had from many community members that they opposed to the demolition to the complete demolition, whereas community board three house, the public hearing on May 14, and we received written and spoken commentary from over two doors and I think people that were against the complete demolition or maybe that they want more, that they don't want that. They want more transparency on the process and participate an opportunity for participation. That's what everybody asked and I heard some people wanted to the building to be restored, but I also wanted people here. People said they want to have more space, not a problem, so I said for sure say that the people everybody said that they're very no transparency and enough engagement yeah. Why don't? We just say we're held a public hearing on May 14th, community residents and leaders, including concern about ongoing participation in the redevelopment process, ongoing, meaningful participation. Thank you, okay and then ball that we're at border, whereas and then therefore be resolved, that the city of do retain ownership of this building for community use in perpetuity and therefore be further resolved, that every step of the process of moving this building forward to move moving this building forward toward we development be done with the full, meaningful participation of the prior tenants and residential neighbors elected offices in committee. Possibly this that participation should be of every phrase of the planning from these issues about Haider the renovation versus the reconstruction, the redesigned, the construction, the program and, finally, the administration and management of the final building. It's better not versus it should have a you right. Oh English is the second language I'm, sorry I missed it versus vu. Rsus I, just I, don't know where this is line of that we're right here. The second one versus BER, sua, RSUs, perfect and then next be resolved clause that this community engagement process begin immediately and that teeka's, we turns to CB returns to see be returned to see, be free with a more specific plan describing how this participation would be accomplished. No later than June meeting of the Land Use Committee and therefore be further resolved that the city must do everything possible to expedite the reconstruction of the property, with the goal of reoccupying it within three years and therefore be further resolved, that all of the occupants of the building at a time of the fire, be guaranteed a right of return, a point, a completion of the restoration / reconstruction with at least the same square footage and the cost that is comparable on a square foot basis to the rain to the raised charges at the time of the fire. The first the right to return the right of return. Okay, therefore beaver the resolved after guaranteeing community facility space for the existing 70 Mulberry Street, tenants, the city strip explored or opportunities for additional communities serving uses at this location of which should be guaranteed in perpetuity. Okay, final be resolved. Clause, D customers immediately start demolition at 70, Mulberry, Street. Okay, do I. Have someone to move to motion Michael, you might have to do a roll call if I start showing my screen yeah. Thank you sad Amina for Spain, okay, Jackie. How do you vote yes, Dominic? How do you vote yes, I'm present not voting because I'm the co-chair of the board of the museum, Herman humid. How do you vote? Yes? Thank you, Lisa! No, thank you! Lisa Olympia Kazi. How do you go yay? Yes, thank you. Damaris race, safe way, Steve Herrick did you? Are you here over Tim Laughlin? Okay? So we have eight yes votes and one present not voting all right. So the motion has been passed, and that was fun that was kind of enough for a party tonight and thank you for all your time. I also want to thank karma, who still here most of the I, think the rest of the costume has left. But thank you so much for staying with us and I know tonight is not easy, and this is a very passionate topic and subject and I think the conversation would go on and we really wish the dicas will come into a process to engage the community in creating a plan for this site, and so tonight is the first time that- and we have a meeting in three months so I hope this time we can do it in a shorter time and also I want the fame or the members who spend their time tonight and share their opinions with us. So if no other questions can I have a motion to adjourn the meeting so moved. Thank you Lisa. Thank you, okay, so thank you. Thank you. All you might go. Thank you. Thank you. Michael.",
        "summary": "It went from being a form of public school to housing, Some of our important community nonprofit organizations, I remember going to PS 23 when I first landed in Chinatown, and these nonprofits are so critical in our community cpc's Chinatown Senior, Center, Chinatown manpower project, CMP, HT, Dance, Company, Museum of Chinese in America MOCA, a United East Athletic Association, since the fire on January 23rd that devastated the structure of the building My office has been working diligently to assist these nonprofits.\nNew Margaret has smoked and so eloquently about the significance of this building in this community I obviously do not represent Chinatown nearly as or You know, powerful significance of this building to this community and, of course, the many organizations that were housed there and continue to be critical parts of the community that any decisions that are made are fully vetted and have you know real opportunity for the community to have input, and you know at times and what it matters along the process and that it be you know, transparent process and that your community is respected as the city moves forward.\nI think it's really important that we have community input and a time for us to really be able to talk about things together and be able to address some of the issues that we have You know when people are seeing cranes coming out and like lifting things out and That's really important that folks see for themselves with their eyes like what's going on inside the building, because, obviously, what we see is the facade You know be able to have the community be able to give input, and what Brian said is very true: that we need transparency and accessibility and an open dialogue for us in the city.\nThank you so much to all of the elected, and thank you so much to all of the community members that have written, have fought and have expressed their concerns and I want to say, Thank you again to Student Center and the community board three for all of your efforts and being able to put all of this together for us, because this is the first time that we're able to have this conversation due to Coe bid and I Think, that it's really important that we are, you know, still very much a part of this process, even without being able to gather together and be able to discuss it.\nEveryone I'm glad that we have in this meeting today is really important and I want to say thank you to our local elected officials, for the input and leader commitment and making sure you know that anything happening and the future of 70 Mulberry Street is being transparent and is real community input, a collaboration in feedback.\nThe last few weeks, I have been hearing a lot of community members are asking so many questions about this building and there are also some speculations on the street, but I think some of them may not be true, and tonight we are very happy to have a representative from dicas to give us an update on the demolition of the building and also tell us what to expect for this site in the future.\nWe will go through the status of the building and the current activities that are happening on site after our presentation, we'll be happy to answer any questions that you may have so to start, I wanted to provide some information on the building so, as we all know, 70 ml Barry as a city-owned building located on the northeast corner of mulberry and Bay yard Street in Chinatown So, as I was saying, was condemned by the city in 1889 for the development of a public school that was PS twenty-three years.\nI mean I wanted to say where they currently are now Senior Center patrons were accommodated in nearby senior centers Mochou was able to expand its use at its primary location, on 215 Center, Street, Chinatown manpower project, relocated, its operations to a nearby facility, 96 Baxter, Street and We, provided temporary administrative space and another D cast building 115 Christine In addition over the past couple of months d, Katz and other city agencies have worked directly with the tenants to retrieve as much as possible their salvageable property from the building Now. This included over 95% of mochas culture and historical archives and I would be remiss if I didn't take this opportunity to publicly thank the tenants for their steadfast patience and partnership throughout this process, as well as the all the other city may agencies that may be as possible.\nYou any more questions from the committee members we can no so Olympia if this is going to be redeveloped with the like in compliance with the current cement, and we don't have to go through Europe, but if we are doing something different or like beyond or changing the zoning, the current zoning, then we will have to go through Europe, but I Don't know if dicas have to have anything to add But in order to understand, because you know in our community there have been various instances of deed restrictions, of the places that were previous schools or other things, this location right now as it is, it would require no Euler, because there are no restrictions If, they do it as with the current the allowable area.\nA financial literacy, A big part, is also to teach about education, about literacy, mostly with population English as a second language, and one of the key concerns that we have as tenants of the building is, of course, we assurance from the city that we will be able to go back to the building once the beliefs be developed and, at the current rate that we've been paying As. You know a lot of the nonprofits in the building operating on a very tight budget, and this building, as a community asset, allow us to put a majority of our budget into services rather than paying rent This is a critical factor for considering us back to the building.\nWe certainly would appreciate the city and the community board to be receptive in like when you start the visioning We would like to be able to have our input so that the rebuilding of the 70-mile Murray will into account the space usage the need for programming into that plan, so that the building is reflective of the program services that we providing to the community Chen dancin to serve thousands of New Yorkers through performances, classes, workshops for visiting school groups outreach the hundreds of community children each week and support for dance artists, local artists and visiting artists.\nWe struggle to properly recognize a hateful discriminatory unconstitutional nature of the Chinese Exclusion Act of 1882 that was executed 138 years ago this month, an act that stated that Chinese are endangering the good order of American life, the story's lives and journeys of Chinese in America during that period of time and the period thereafter is exactly what the Museum of Chinese in America We. Do this work to make sure that others can see American history through a critical perspective, making their own connections with their past on January 23rd, the five-alarm fire devastated us cast, Quentin, Jo or friends, DOB FDNY, NYPD, other city agencies, We, stand by our neighbors HT Chen, CBC, United, East and Chinatown manpower when my mother in fact learned job skills in English in the late 1970s mocha underscores the important role that 70 mulberry plays as a home for children to dance adults, to learn, skills seniors to socialize associations, to gather and most critically, in our mind, histories to pre-recorded for future generations.\nKnowing that we are active members of this community, alongside our neighbors at seventy mulberry and other community representatives, mocha is committed to playing a thoughtful role and an honest and truthful one in the visioning process can I have a car from CPC to say a few words Our community I want to take this out, but you need to thank other CUNY councilmember Margaret Rayne Assemblywoman Yulin, all the elected officials, who have been very generous in ongoing supporting CPC in regard and all the other tenants in regards All our feathered tenants for over 30 years, we've been providing senior services for close to three hundred seniors on a daily basis.\nI advocate for restoring the historical structural facade, as others have said, in whole or in part, and the significant structural architectural elements of the building the city has to have the will and the imagination to create something special on this corner in the heart of Chinatown that will serve as a beacon for our community and cemani Mulberry Street must remain a space only for nonprofits keeping in line with the current zoning regulations.\nSo I think the community visioning process is the is the first opportunity and a continued engagement with both the local residents and the community to decipher and determine what's gonna happen at 70 mulberry we're committed to continuing to provide the community with up-to-date information on what's going on at the building.\nYou want me to read the reso Whereas, the 70 Mulberry Street building was constructed in 1893 to house PS 23, the first public school built by CB j Snyder, who went on to oversee the construction of more than 160 schools in NYC, many of which are New York City Landmarks One of its innovative features, was the basement auditorium the first step in the movement to provide community centers and neighborhood meeting halls within schools.\nAnd whereas Chinatown Menezes is an important cultural destination in New, York City, Yet, 70 Mulberry Street was one of the only spaces in Chinatown that supports and houses nonprofits and cultural institutions that provide cultural programming, education and training to the community and whereas Chinatown has very little community facility.\nSpace and the neighborhood lacks accessible spaces for community meetings and whereas in a January, 27th 2020 statement, Mayor Bill DeBlasio committed to rebuilding at this location and working with current tenant organizations as the process unfolds and whereas, while demolition has begun at 70, Mulberry Street, the process and timeline for planning a new building and starting new construction is unknown at this time and whereas, in this challenging time for city finances and operations due to kovat, 19 and budget shortfalls, isn't particularly important to make sure that there is a well-conceived plan to ensure these vital resources are returned to Chinatown community to the Chinatown community.\nThe city should establish and share with the community a clear and transparent timeline for planning, design and construction of a new 70 Mulberry Street space, which will include regular community outreach and appearances or the community board to receive input and ensure community needs are addressed and the community is represented in the planning process and therefore be it resolved at the current tenants will have a right of first refusal for community facility spaces that are at minimum equivalent size to their pre fire units with rents, cap pre-fire rates and therefore be it resolved at for guaranteeing community space for the existing 70 Mulberry Street.\nWe want you at the housing here, because what we want to open for the community to have a input first We have said that every step of the process of moving this building forward toward to a redevelopment be done with the full, meaningful participation of the prior tenants, residential neighbors elected offices and community pottery that the participation should be at every sorry, okay, every phrase of the planning from decision about it about either the renovation wait, I think that the IDA renovation I think there's a typo as a redundant versus the reconstruction to redesign the construction and, finally, the administration and management of the final building that this community engagement process became immediately and that dick has returned to Savitri with a more specific plan describing how this participation will be accomplished in no later than July meeting of the Land Use Committee that the city must do everything possible to expedite the reconstruction of the property with the goal of reoccupying it within three years, I may have missed some What was mentioned and leases and additional points that may have addressed this, but I just want to flag, and this is not an endorsement.\nWe didn't hear it so much from the public tonight, so you know that's not pressing that issue one way or the other We should add some, whereas about today's hearing and the people who spoke today and highlight clearer what Linda talked about So the fact that there is obviously a disagreement with the assessment of dicas about resolution about the demolition and that this decision is at their discretion They did it because they did all this financial studies is that we could say when I said the hearing the community wanted you to understand, you know and have input on that decision-making Someone in the audience said like: How do you value culture , so mr bridge is really something that is very important and I think we need to clearly state in our Asia I think we can add a certain language that we want a city to be open about test.\nA strong community support for preservation of the building, I think what we should do is that we want to move the wrestle first and then we can modify the languages and I mean if the majority of the committee thing pepper, want to be removed You use the information that you have there, because those are important information that they evaluate it.\nAlso like to say that you know this is a very critical and crucial time in Chinatown, and you know the stakeholders, residents and community organizations really need our support because they are going through a substantial amount of hardship right now, due to covert 19 You know integrity of this community I think it's completely inappropriate that there was absolutely no community input and the city has just decided to demolish the site.\nIn the resolution somebody used an open, It's messed up that you know the city is telling our elected officials that things and have legitimate community input , I, don't read it as we're Incans and then can we move the next one, and while demolition has begun or even into process and timeline for planning, anything is unknown at this time.\nDon't I would like to keep the options open at this point, for either I feel like I want more information about what would be in the public interest and Yeah could open for more community discussion, because there has not been enough community input and I like community use better than community facility, because that does keep the open, also affordable, housing The city should establish a shared with the community, a clear, transparent timeline for planning, design and construction of the new the space, and this one I would suggest we replace with two of the ones I write Maybe, it's the next three, please let me drop them in and then, if they're redundant, take them out so, but we think we should take this part out the formatting book That's that Kalina on third line Can we go to the next beery soft cloth that this community engagement process begin immediately and the deke has returned to see be free with a more specific when describe how this participation would accomplish no later than July?\nYou know my point: is we're not going to lose an opportunity by not mentioning it now, instead of community facility, we could say in perpetuity for the public good or something for community use, as it said before, right like trying to try to leave the language a little just big enough.\nPeople said they want to have more space, not a problem, so I said for sure say that the people everybody said that they're, very no transparency and enough engagement, We just say: we're held a public hearing on May 14th, community residents and leaders, including concern about ongoing participation in the redevelopment process, ongoing, meaningful participation, Thank you, okay whereas and then therefore be resolved, that the city of do retain ownership of this building for community use in perpetuity and therefore be further resolved that every step of the process of moving this building forward to move moving this building forward toward we development be done with the full, meaningful participation of the prior tenants and residential neighbors elected offices in committee.\nNo, later than June meeting of the Land Use Committee and therefore be further resolved, that the city must do everything possible to expedite the reconstruction of the property, with the goal of reoccupying it within three years and therefore be further resolved, that all of the occupants of the building at a time of the fire, be guaranteed a right of return, a point, a completion of the restoration / reconstruction with at least the same square footage and the cost that is comparable on a square foot basis to the rain to the raised charges at the time of the fire Okay, therefore beaver the resolved after guaranteeing community facility space for the existing 70, Mulberry Street, tenants, the city strip explored or opportunities for additional communities serving uses at this location of which should be guaranteed in perpetuity How. Do you vote yes, Dominic?\nDo you vote yes and I think the conversation would go on and we really wish the dicas will come into a process to engage the community in creating a plan for this site, and so tonight is the first time that-."
    }
}