{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "title": "September 22nd",
            "publishDate": "2020-09-22",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        },
        "properties": {
            "fillerWordCount": {
                "uh": 223,
                "um": 424
            },
            "wordCountFullTranscript": {
                "bill": 92,
                "business": 65,
                "businesses": 63,
                "questions": 59,
                "committee": 56,
                "state": 50,
                "rent": 50,
                "bills": 43,
                "question": 33,
                "law": 31
            },
            "wordCountSummary": {
                "businesses": 17,
                "state": 14,
                "rent": 12,
                "business": 11,
                "bill": 10,
                "bills": 9,
                "landlords": 9,
                "city": 8,
                "tenants": 8,
                "questions": 7
            },
            "fullTranscript": "Nine yep one more just want to wait. One more minute look did someone just join, I don't think so. My apologies, if I can just wait. I know we're a minute past six, but I'd like to get quorum, and this is abigail joining us. She is. She said she was yeah she's here. Oh she I see her. She raised her hand. She raised her hand. I think jamie just did jamie. Just join us, hey renee hi, I think we're set. Do we have nine okay fabulous? We now have quorum, so I'm going to get the show on the road good evening. Everybody! Thank you for being here. My name is renee kinsella. I'm the chair of the budget, education and city services committee of cb5 julie, chu, is the co-chair of the committee. We have a lot going on tonight, so first we're going to hear about a number of bills that were introduced by the city council's general welfare committee. If you don't know what the committee on general welfare is, they have jurisdiction over new york's administration for children's services, except for the division of youth and family justice. The department of homeless services, the department of social services, human resources administration, as well as the other charitable institutions that do business with the city, so you should have all received a copy of these bills prior to the meeting along with rebny testimony. There was a hearing this week or is it last week. I think it was this week homeless, services, united and thanks to mary, the coalition for the homeless and legal aid. Testimony abigail bessler from council member powers is going to speak to us regarding some of those bills that we then have burton phillips the albany chief of staff for senator holliman who's, going to speak about two bills: 8865 which speaks to the limits of personal liability of Covid-19, impacted business owners and then the clear path forward act. There's going to be then an overview of small business initiatives that are being proposed by local electives ben jacobs of council member power's office is going to speak and laurie h from speaker. Johnson's office is also going to speak to those initiatives. Then I have zina sawaghi sawagan who's, going to speak to us about domestic and gender-based violence and provide some resources and then I'll just give a really brief report. I'm sure everybody will be tired of staring at the screen at that stage of just some updates for the committee brief overview of how we work, presenters are going to be introduced and they will have the opportunity to present to the committee and the public and then after the presentation is concluded, the committee is going to ask questions of the presenter and when all of those questions have been answered, members of the public will be permitted to ask questions and then we can use the raise hand function. So if you'd like to speak, use the raised hand function once all of the questions have been addressed, the committee will then go into business session. Only members of bec's committee can discuss the issue amongst themselves at that stage and then we would decide what action to take. Bex is a little different from the other committees at cb5, in that we do not have applications. So our determinations are not, as always straightforward. We can decide to draft a resolution to support an issue, decide to seek further information or just use the presentation to inform our collective knowledge going forward. If we do decide to draft a resolution, the committee will vote upon it. Should the resolution pass it'll be presented to the full cb board. Our next full board meeting is on October 9th our resolution, which is presented there and then it will. It will be voted on by the full board and what happens at that stage will be the position of cb5 a few reminders. We have a lot to cover this evening and we don't want to lose quorum. So if you have a question, that's already been asked, or you agree with a particular position- there's no need to reiterate the whole thing. Just simply say you agree with so, and so because this will help us move it along. Thank you. So we'll begin with the general welfare package of bills, these bills had hearings last week and they're important because they deal with homelessness. The moratorium on evictions is due to end October. First, what happens after that is anybody's guest, we're not sure how the courts are going to open or how they're going to hear the cases that have been held in obeyance, but we're pretty sure a lot of people are going to be affected, so the bills from the city council's general welfare committee go some way to address those issues again, you all should have received them and read them. There are five of them. I'm going to ask abigail to speak to the one intro 2047, which was introduced by councilmember powers. There are five four more that I will explain after she is done so abigail if I may turn it over to you hey. Thank you. You all have quite the agenda, so I will be brief. Last week the general welfare committee heard a number of bills related to source of income discrimination and in general, trying to reduce discrimination and give people a chance to find housing in the city part of that hearing. We had a bill on that hearing 2082, which prohibits basically expands protections from discrimination based on source of income. So if you have like a housing voucher currently in the city, so the state actually pretty recently passed an expansion of protection, so this is kind of just making sure that we have city level protections so that we can have that kind of city level enforcement and make sure that our laws are closer in line with the state. The city law right now only prohibits discrimination in housing, accommodations based on source of income for buildings. Sorry it only. It only has protections for buildings with six or more units, so this would lower that threshold so that it's any accommodation of three or more units. It also has an exception for ones that are owner occupied, that are three units, and we are potentially looking at making some amendments to it, based on testimony at the hearing to bring it closer in line with what the state law ended up, moving toward, which included you know putting in specific definitions of sources of income into the law, so that enforcement agencies have the you know. The full list of everything that can encompass a source of income and the state law also exempts only two unit: housing accommodations that are owner occupied, so we're looking at basically making it fully in line with the state law, but this was actually drafted originally before the state law had gone into effect and added to this hearing. So we may make some amendments, but we think it's a really important bill and definitely has support from the advocacy community in terms of putting these protections in place in new york city law and then the other bill I just wanted to mention. There were a number of bills on the hearing. There was, you know a bill to require dss provide more information about its rental assistance program online. There was a bill to require that DHS provide services to domestic violence, survivors in all shelters. That's a councilmember rosenthal bill. There was one to give written notice to everyone, who's eligible for rental assistance, about protections from source of income discrimination and then there's a bill 11 bill 146, which is to basically set the maximum rent that rental vouchers can be applied, set it to be applied to increase at the same rate as fair market rents set by HPD. So that would a big issue for people with vouchers is that the vouchers do not cover the actual cost of renting an apartment in new york city, and I know that I've worked with many people in the shelter system who have a voucher but are unable to get out of shelter despite trying very hard to find housing just because the voucher does not adequately cover rent and so it's a program that needs to be changed and then the last bill. I just wanted to talk about a little bit. More keith was a co-prime sponsor on this bill. It's 2047 and it's called the fair chance for housing bill. Basically, it would prohibit housing discrimination in new york city based on a criminal record, so kind of like ban the box, landlords and real estate brokers would be prohibited from inquiring about criminal record information during the process, and it would also be unlawful to advertise or circulate any information that expresses any limitation in housing. Accommodation based on someone's criminal record two exceptions in there are when federal or state law or any type of regulation requires consideration of criminal history for housing purposes for certain housing and then the rental of a room by a roommate, so someone who's in the same apartment or in an owner-occupied housing accommodation. So that's that bill and that bill is really important. I can send around the fortune. Society had great testimony on that, but you know basically, when someone is arrested, may even just be arrested and not you know serving any actual time that could go on the record or if someone has a small fence, it can haunt them for years, and many people testified about how you know years and years later, they're still unable to find housing. They're living in you know maybe illegal housing, because they just can't find any housing that will take them with their record. So we thought that this was a really important thing for new york city to do that, other cities have done as well yeah those are the bills. Thank you! So much abigail. Let me open it up to questions from the committee. If you can raise your hand, can I see the raised hands? I'm not seeing mary yeah sorry about that abigail thanks for that great rundown. I was wondering if you knew offhand who the enforcement agencies are for 2082 and I'm sure you or somebody else is keeping a close eye on the budget, because my understanding is that the enforcement is really a key issue in terms of the discrimination on the basis of income. Do you know anything about that yeah, so we've been working with neighbors together about that issue. Specifically keith was a real champion of trying to increase the enforcement of source of income discrimination at so I think this would be enforced by cchr. I believe commission on human rights, but we keith really wanted to make sure that there were more people in that unit because basically, their source of income discrimination unit has been incredible. It's actually like a very well well-functioning part of city government that has been able to help a lot of people who were discriminated against and solve individual cases, but right now somewhat because you know they reshuffled around their staff during Covid-19 to handle different cases and then also someone left their job. They went from, I believe, having a team of six at cchr devoted to that to one attorney: who's handling, every source of income discrimination case in the city, which is not acceptable and not going to work. So I think keith is really focused in the budget in terms of, obviously, we are facing a difficult time getting you know getting anything funded, but I think I'm going to be focused on at least making sure we fill that unit back up to where it was before, because I know that from the advocates that it was actually a successful program. Yeah. Thank you. Other questions julie, any question for abigail about the timeline of these bills and what are the next steps? The committee will do for amending the bills and approving the approval process yeah. So in order, for I mean the general timeline for bills, is there they'll have to be a vote in committee and then they will be. They would be voted on at a stated meeting. So by the time a bill gets a committee vote. It's pretty. That means it's on track to pass. It stated, so the big hurdle is usually just getting a vote at the committee level, which means you know getting the support of the speaker, and hopefully they can all move as kind of a package. Some of the bills like 146, which was the one I talked about, of making the vouchers comparable to actual cost of rent we'd, probably have to do a fair amount of negotiating just in terms of the budget impact, and so I think some of the bills like the source of income bills could move together and I definitely think we have a. We have a lot of support from. I think we have 19 sponsors on the fair chance for housing bill now. So I think, there's definitely momentum more questions. If you could raise your hand, if you have a question, I was going to ask you: do you even abigail? I don't mean to put you on the spot, but is there a sense of what that would cost just budget wise? I don't. I don't know off the top of my head. Yeah, that's a that's 11 bills. I don't know all the stats on that one. No, I totally yeah, but I think I think, there's a lot of discussion about like how to how to make that work, because it's clearly a something that everyone with a voucher is struggling with, and I think every office gets cases about that. So I think council members, I there's a there's a lot of support on that bill. I think it's just a matter of negotiating the actual the you know cost and how the how far it extends understand, I'm looking for any raised hands. Anyone with further questions from abigail, it's sam, oh sam! I'm sorry! You you're physically raising sorry about that. Sam yeah no worries, so my question is whether this housing excuse me the protection, extends to people and all offenses, or does it exclude, say sex offenders? So right now I mean. Obviously, if you have, if you are a registered sex offender, your housing would be regulated under state law. In terms of you know, you'd have to be on a registry and you have to report your housing and all that, so it wouldn't. It wouldn't interfere with any of the state laws and that's why we have you know an exception in there. That says like if it's regular by state law. This doesn't change any of that, but it doesn't. It doesn't exempt certain offenses in the actual bill test, so this is kind of like the broadest. We could go understood, I'm looking for physical hands and raised hand in the jamie. Did I see your hand raised yeah yep, hey abigail, so I know you don't know the budget, but is there a place where we could find out the potential budget? For this, and also you know, is this: just for the year it will it be extended for, like a few years like, is there a plan or is that tbd which bill? What you're mentioning the vouchers, the voucher one, the voucher one? It's not, it doesn't have a sunset date. I don't believe, but you know it's, and this is that this predates Covid-19 like this- has been a fight for many years to pass this bill. I believe so yeah, but I I'm sorry, I don't know the cost of that one off the top. There may be different estimates. Do you know what the opposition has been to like pass the bill? Then, if it's been around for so long to pass that bill yeah, I assume it's the cost. Okay, yeah mary. I saw your hand just a quick footnote that there have been cost analysis and it's not only budget, but obviously it would save money because the cost family is many times what we would attract that down yeah. I just mentioned that yeah, that's a that's like a key argument of the for the bill, which is that, even if it has a upfront cost to it the long, the long term in the long term, we would see savings just because of the sheer cost of sheltering people versus people actually being able to have their own housing apartment. Yeah, that's massive savings. I just have a quick question. I know this is not your bill abigail and I'm putting you on the spot and so tell me not to do this but 2018. What are the sort of services, the domestic violence services that would be provided like do you know how that's going to be delivered in the shelters or what that means? Really I'm holding you on the spot. I'm sorry! I don't know as much about that. I assume I what I assume and I'd have to read the text closely. I assume they would give the shelters would be provided to like connect people to resources that may already exist for survivors yeah. Thank you, sorry, and that was yeah, like advocacy groups and organizations that exist to help people great any more questions for abigail on the bills or on her on councilmember powers, bills rather, okay, seeing none, I hope, I'm not missing anyone who's physically doing that. I'd like to open it up for questions for the public. I think we have just a few attendees any questions from the public luke. I don't know if you can see that yeah and if you're doing this from phone today, you can press star nine to indicate that you'd like to speak, and I don't see anything there. So what I'm going to do is turn it over to comments. The committee for comments on these bills. Does anyone have any comments on the bill? Sorry, I actually have a yeah great good question. Go ahead, more procedural questions. So are we looking to pass a resolution, or is this more like a exploratory kind of conversation? I think it's more exploratory. I think time is of the essence. Abigail. Do you know what the timeline for passage of these bills? Do you have a sense of the hearings. Were I don't have a set? There's nothing scheduled right now right, so I think that this is more for us to sort of noodle over. We wanted to get them to you just because the moratorium on rent evictions is coming up and we wanted you to think about them. Think about more questions. We're gonna ask abigail to come back and put her on the hot seat again and also ask somebody we tried to get someone from council member rosenthal's office who can speak to the other bills so that you can really formulate your questions and really think about. If this is something that we want to support, I tried to give you as much information now, but I think we should. We should wait on this and noodle over it and it'll come up next meeting is that unless someone feels strongly I'm open to comments as well any comments, anyone feels differently on this any comments at all. Okay, then abigail. Thank you so much for your presentation. I really appreciate it. The board appreciates it. You have a hand raised. Oh, I do have a hand raise. Who am I? Yes? It's me hi joseph hey. I just wanted to say that I support all four of these bills, so I think my silence at least is just support and I think we've had a good explanation. I appreciate you sending out the actual build language before the meeting and yeah I'd like us to move forward. Somehow you'd like us to move forward tonight, I'm very happy to move forward tonight to support it. I I don't want to. I know that some we put abigail on the spot and I want to make sure everybody's questions are answered before we move to support something, and I want to make sure that your all your questions are asked and answered. So let me hear from other committee members. Let me hear their thoughts on this. I think mary raised her hand. Mary probably comes as no surprise. I wholeheartedly support all of the bills and I don't know if I'm breaking up, but in particular I think, if we're going to revisit anything, it's about increasing the enforcement where, with all wherever it's seated, I mean in fact that one attorney is trying to fend off is just it's. Just ridiculous, so I think that's my primary area of concern but great job to powers, rosenthal everyone else and I hope the committee can get behind it, julie, so renee. I don't know if it would help if we start putting together a resolution based on some comments here and that we could review as a committee next month, similar to what we did with the police resolution, where we spread it out between two committee meetings. Let me get, let me get a feel from the committee how they're feeling about this, I speaking only for myself. I fully support these bills. I want to make sure that everyone has had a chance to really look at them and ask all the questions that they wanted to ask and really think about them. Any raised hands any comments, any thoughts, julie, July, thank you, renee and thank you abigail I so this is on my part and I take full responsibilities. I have not had a chance to review the bills. So therefore I cannot ask intelligent questions and or comment in any appropriate ways. So that being said, if the committee, if the majority of the committee tonight decide to move forward starting to put some of the points together for a resolution, I'd be on board, I just would not be able to vote in support or not in support of it tonight, because I have not reviewed it. I understand any other comments by committee members. Thoughts, tristan has his handwriting kristen hi, so I am wholeheartedly in support with all four of the bills and also with moving forward tonight. If the, if the rest of the community agrees, I think that they're, you know, definitely called for given the situation and I think we'd be remiss to not support them. Thank you, tristan any other thoughts by members of the committee any other hands. Anybody else would like to speak to this. What I think on the hearing is that the committee is in favor of moving forward in support of the bills. Do I hear a motion to that effect? Thank you. Sam. Do I hear a second thank you. We will take it to a vote. Our support in favor of these bills, as presented. Our resolution will support these bills as presented here in the you know. As we have discussed julie. Do you have the vote? Yes, renee? Yes, I'm a guest zach. I didn't see him actually, mary. Yes, joseph yes, laura, yes, kristen! Yes, I didn't see, rob sam, yes, jamie, no and joe! Yes, ken! I don't know! Oh thank you evan! Yes, huh! Yes, rachel! Yes in July! Yes, I'm getting the resolution started. Oh thank you. Yes, thank you just to clarify for July. The resolution is in support of the package of these five bills that were presented two thousand two hundred 2018 204, seven 146, 1020 and 1399 that abigail outlined and that were sent out so July. I just want to clarify that. It's not on starting a resolution. It's adopting a resolution in support of these bills, the domestic violence services, the anti-discrimination bill, rental assistant vouchers, in line with annual increases, collecting information, and oh my gosh, I'm losing the other one that which one did I miss. So it's in support of all of those bills that I had sent and that we were discussing tonight. Thank you, renee. In that case, I cannot thank you in that case, I feel that I cannot be irresponsible for me to take a yes vote at this moment. So can I abstain? Yes, you can. I think that would be no support. July. Thank you. I just wanted to clarify yeah. Okay, thank you. Thank you. Everybody thank you abigail for explaining those and thank you everybody for considering these and reading about them and reading and taking time to consider the background and what they mean. So I appreciate that and we'll get working on the resolution to present to our full board, we'll move now to our next presentation, and that is going to be burton phillips, he's going to discuss with us two bills. They are state bills, one limits the personal liability of Covid-19 impacted businesses and the other is called a clear path forward, an act which suspends some rent payments for some residential, some small business, commercial tenants and I think some mortgage payments in response to Covid-19 so burton. I will turn it over to you sure. Thank you so much renee and thank you everybody. It's a pleasure being here with you. Just I guess, from the top the two bills I was going to speak about the first one is the save our storefronts bill, which is the 8865 that that's the one I think you were just referring to and the clear path forward bill, which is about breaking commercial tenancies. We do have a personal liability bill, but since that's something the city has already done, council member rivera had a bill to do that and I believe it's been adopted. I wasn't going to speak on that one tonight. Okay, all right great! I had misinformation, I'm sorry! Oh no! It's okay! I think I handed over incorrect information to annabelle, so the first bill is s-8865 and we refer to that as the save our storefronts bill. It's a bill that brad carries with assembly member harvey epstein, and it's really getting at a solution to the issue of small businesses and non-for-profits that are having difficulty making their rent and it's you know something we've seen across our district, I'm confident it's an issue in cb5, just as it is in cb3 cb2 and in other parts of the district. It's really kind of a framework that we think could work to help address what we think otherwise is a coming avalanche of commercial evictions once the eviction moratorium for commercial entities has ended, and it's kind of premised on a balanced approach of shared sacrifice between small businesses, not-for-profits landlords and the government. So under the proposal that we developed, small businesses and nonprofits that have lost income due to Covid-19 would be responsible for a modest but reasonable percentage of their commercial rent based on the reduced income that they're actually generating. So it would be the lesser of, and I apologize in advance. This is like a complex, math problem. It's going to be the lesser of 20 of their actual monthly income or one-third of their contractual rent payment. So that's what the tenant is responsible for each month. Under this proposal, the landlord of the covet-impacted business would be required to waive 20 of the monthly contractual rent, so the tenant is paying a portion. The landlord is waiving a portion and to give a very basic example, if the rent was a hundred dollars a month, I'm coming to you from albany. That's still dirt cheap, even for albany standards, but if it's a hundred dollars a month, the tenant would be responsible for thirty three dollars of that one hundred dollars and the landlord would waive twenty dollars twenty percent. So now the rent is eighty dollars and the landlord or the tenant is contributing 33. So now, you've got that 47 in the middle and that would be covered by a commercial rent relief fund that this bill would establish you're, marking up to 500 million dollars in federal assistance that comes to the state through which landlords would apply to be reimbursed for that sort of middle portion of rent that they don't receive because we have reduced the rent obligation for the tenants. So we think that this is a model that could work where everyone gives a little. Everyone gets a little to help, ensure that we escape just a complete small business death spiral, which is what we think could happen. Otherwise, I'm confident there will be questions about it, so I'll just save from the top, and then we can talk questions as well. The linchpin of this proposal is the state receiving additional federal funding. So that is a big piece of this. It doesn't really work without it. The funding could potentially come from anywhere, but I hopefully don't need to tell you. The state is in pretty dire financial states right now. So that's that bill we've been working with cooper square committee and a coalition of small businesses. That's growing now across the state for that proposal. So it it's something: we're continuing to build co-sponsors of I'm confident, you're, not swayed by other community boards, but another community board has done a resolution in support of the bill. So we would like this idea this model to be the framework of eventual state legislation to try to address the commercial rent crisis that we think is coming. The second bill see that bill had a complex, math problem. Oh I'm sorry right there may we take questions on this first, absolutely just because we might lose the complex math yep. Absolutely! Thank you. Thank you. So much burton I'm sure, there's questions. Can I get raised hands for questions either physically or on the on the was it evan or joe that had their hand raised? I see jamie go ahead. Jamie hi phil question a few questions. The first is for what constitutes a small business in for this specific bill. Yeah we define small business as 25 or fewer employees, and it's both businesses and non-profits with 24.. This would cover all small businesses in the new york city area. If they've been if they can demonstrate that their business has been impacted by the pandemic or by government ordered closures or business reductions as a result of the pandemic got it and in order to help them what would be kind of like the turnaround time to help these businesses? Would it take a few months to kind of verify this and like all the paperwork and stuff like what do you estimate? So this is something that the businesses would need to be able to demonstrate that they have lost revenue in the prior month, so they the business, would need to be able to demonstrate the loss of revenue on a month-to-month basis. You know we think that's. Unfortunately, it's really the only way to ensure that businesses that actually need this protection are able to benefit from it, but otherwise it's as long as they can demonstrate that for the for the businesses, it's more or less immediate, they benefit from having the reduced rent payment immediately as long as they can back up that they qualify because of the reduced income. And what sorry, with my last question, what how many businesses do you expect to benefit from this bill with like? Is it a few thousand few hundred yeah? That's it's really difficult to gauge. At this point in time we saw some very dire predictions from the partnership for new york city last month, suggesting that up to 70 000 small businesses would end up closing without some form of assistance. So I mean safely, I think we can say we're talking thousands of businesses and to what extent the funding need would be there or you know what the fiscal impact of that would be we're kind of taking a guess. We think 500 million, which is half a billion dollars. That's not a small amount of money. We don't think it would take care of the need indefinitely, but we think that would be a good start for at least several months worth of coverage for businesses and do we have budget, for this sounds like a lot so well, it's the 500 million is what we set out, but is that enough like do we? Where would that money come from? Is that you know, because it's not really foreseen right? So it's we're anticipating that this would be set aside from aid that we received from the federal government. So this would be, but under unrestricted funding that we received from the federal government as part of like a recovery package and at this point in time- and we don't know what that will be or what that will look like with the cares act, though we did have enough in the way of unrestricted funding that earlier this summer we were able to pass a 100 million dollar rental assistance program which could we could have used a lot more of that money. But you know that alone had the 100 million, even after we already. As a state earmark spent a lot of the federal assistance, got it great. Thank you joseph thanks, for that was helpful. Sorry, I have an echo if everyone else is hearing this echo. Let me know one question is joseph we're not hearing you joseph you're, muted I'd recommend if anybody else is unmuted, if burton and renee, if you can mute yourselves just temporarily. Thank you. Okay, sorry, this is better. Can anyone hear me you can hear me? That's weird, I'm sorry, okay, so my first question is to clarify this example that you set out where the rent is a hundred dollars and the 20 would constitute 20 that the landlord had to pay and the bill summary that we were sent out. It was saying that the tenant would be responsible for paying 20 of their income or one third of their rent amount, whichever was lower. So I guess my question is: if the businesses income had been very low or even zero for the past month, would their rent be zero? Yes, the tenant's rent would be as low as zero and the landlord would then be eligible to be reimbursed through the fund for that full amount minus the 20. That would be requiring them to take off the time. Okay, thanks and then. My second question is a little vague, but I've been most worried about restaurants in Manhattan and I'm sure this 25 employee cutoff was kind of carefully configured. I guess my question is: do most restaurants in Manhattan have fewer than 25 employees, or does this only cover kind of a smaller subset of restaurants, so this is 25 or fewer full-time employees. So if the restaurant I mean- I don't know off the top of my head, I kind of have a survey of how many restaurants that would cover, but again it has to be the full-time employees. So we are anticipating. A lot of restaurants would be eligible for coverage under this, and a good number of them are part of the coalition that we're working with in support of the bill. Thank you, July. Thank you, renee burton. Thank you for the presentation of the bill. I think this is a very good thought, a very good direction that the senator is thinking of. I am not fairly certain that the landlord and the property owner communities will welcome the 20 rent cut from what they had been expecting. Have your office reached out to the landlord property owners communities and, if so, how have they responded to the general idea? And my second question is, I think, the bill, the two bills from your office. I did get a chance to read. I think it extends the reduction of rent and the state assistance to 30 days or 100 days after the state of emergency, that's highly dependent on how much longer the state of emergency will be and which also means the amount of funding will be even less clear. How is your office legislation preparing to introduction and specify the sum of founds needed on a monthly basis? So I I'm sorry July. The last part of your question got hung up a little bit. I didn't. I didn't hear that last bit. The last part is how is your office and the other state legislatures? How are you going to prepare, given that we don't know how much longer the state of emergency will be so the uncertainty in timing, the distance and the unspecified amount of the assistance needed on a monthly basis yeah? I thank you for your questions to answer the first part I, to my knowledge, we've not spoken with any sort of umbrella organization representing commercial landlords at all, but I can tell you: we've spoken with a number of landlords in our district. They prefer an approach like this to some of the other proposals that have been talked about that are more just a straight rent cancellation where they would be. You know. If they were passed into law, they would not receive any rent. So you know we don't yet have support from any organizations representing landlords. We do want to make inroads with them. We'd love to have their support for a proposal like this, and this sort of shared sacrifice model, but we're early in the coalition building around it and to your second question: there are a lot of unknowns here, one of the biggest unknowns that we haven't even talked about. Yet is when the state legislature will next be convening and that's a question. We don't know the answer to the you know right now it could be January before we're back in session. I think the expectation is something is going to need to happen on state funding before January, so we are anticipating. We may have to come back. We may have to take up some revenue raising proposals and a lot of what we've been watching is what's going to happen with additional federal assistance, and so there are a lot of unknowns. Frankly, this isn't a bill that I think we snap our fingers and it's in law tomorrow. It really depends on. You know what the situation is with the state's finances, with additional federal funding that comes in and where we are with the pandemic and with government ordered restrictions and closures. So this is a proposal I think we would, if this was to someday, be passed into law would be amended to fit the circumstances. I think we see this more as a framework for something that could be tailored to fit the circumstances in a way that alleviates the rent burden on commercial tenants make sure that landlords are still getting some measure of rent, because we do recognize that they have expenses to pay, not the least of which is revenue. That's going to come into the city in the form of property taxes and government assistance as well. Thank you rachel. I was just wondering which agency would be responsible for doing all the administrative work on this. So we have this drafted as the department of financial services covering it. A similar proposal that applied to residential tenants put the onus on dhcr. You know we think that dfs. This is a little bit out of their wheelhouse, but at the same time they have the staffing capacity and organizational power to you know to manage a fund like that. I'm sorry, I do see a question in the comments just to clarify a dhcr is the state division of housing and community renewal. So it's like the state analog to HPD right more questions from the committee questions from the committee. I have a question burton. How would you resolve if a landlord wanted to opt in and the tenant did not, or vice versa? Is there something that speaks to that? Well, it I mean if the tenant didn't want to opt in, they would then either just not be paying their rent or they'd be paying what they owe, in which case the landlord is getting the rent that they're owed. So I don't think we've anticipated that as a set of circumstances. I suppose that could be an issue if there are still non-payment, eviction protections in place that a tenant could continue to not pay rent not be evicted, they would be on the hook for quite a bit of money once those eviction once the eviction moratorium ended, but I think a lot of businesses would probably like to avoid that type of legal and financial burden at the end of the moratorium. Thank you more questions from the committee. I'm looking for hands either physical or raised on the on the panelist, seeing none I'm going to move to members of the public if members of the public have any questions luke, if you can, let me know if you see anything on that we do have a question from a member of the public in the chat. Okay, let me just go to that. So there's a question here burton I think I think you can see it, who is to say that the landlord deserves 80 of their pre-covered rent shouldn't there be a formula to determine what a fair market value is. Perhaps the landlord should get enough rent to cover operating expenses, plus taxes plus up to some percentage? That's a good question. We, I think, used the 20 waiver because we thought that was a fair starting point. Excuse me in a lot of parts of the state where you don't see the high commercial rent that you do in new york city, that 20 is more than fair, but I think you raise a really great point that you know some of the existing commercial leases may be for highly inflated rates, and we don't necessarily want the state to subsidize that through this through this program. So I think that is something we are certainly willing to look into further and consider if there is something we could do along the lines of what you're suggesting you know to create some sort of formula or further cap what the reimbursement would be to ensure that we're not just bleeding public funds and subsidizing landlords. Thank you further questions. Any further questions from the public, seeing none, I'm going to move to comments from the committee I'd like to hear on the committee's thoughts on this bill. If we move for resolution in support of this of this bill, understanding that it it's still a work in progress, it's the framework, as burton said, to address some of the some of the problems that we're seeing with small businesses. So it's one of the solutions that have been put forward. I'd like to hear what the committee thinks about this. Let me see rachel yeah. I theoretically support it. I support the aims. I think that in a time like this, with everything going on that there needs to be a dual responsibility to you know not have all of our businesses go out of business. I think it's just hard for me to like conceptualize it when, like the money to fund, it doesn't yet exist, which obviously burton you're very upfront about, and obviously we all know that so and obviously that's a huge like kind of up in the air. For many reasons, so I think I'd be comfortable with the resolution that, like supports the aim, but like again it's hard to say it's hard for me to say, like totally support this being passed when, like the money doesn't yet exist, is it okay? If I jump in just a little bit, I don't think we would want this bill to pass and be signed into law without knowing the money piece of it and having it nailed down. I think a big part of what we're trying to do here is again create the framework. I know I've used that terminology a couple times but create the framework, but also demonstrate and kind of lay a marker down for how we would like to use a portion of any forthcoming federal funds. We think it's important to make it clear that we want to prioritize assisting small businesses and making sure that they don't you know, go under during this pandemic that that's very helpful. I think like that is honestly. I feel like that's how government should work like planning for the future in a way that doesn't always happen. So I do appreciate that our representatives are planning for the future, so that, if we are, you know lucky enough to get federal funding, it's not just kind of a scramble of who deserves to have it mary along. I just say briefly that it sounds like a really great balanced approach. I can't think of a better use for federal funds if they come the state's way so really support your efforts. July. I support the idea in concept. I, however, the bill in its current form and it does sound like the bill- is not finalized. There needs to be some more back and forth, including the landlord property owners communities. I find it difficult to be in full support of it when, in the current state there has been no direct support from you know the other half of it. I think the tenants side would most probably very much welcome it and say resident who you know frequent restaurants, small businesses in the city. I I'm in support of that. I want the small business to continue to thrive after the state of emergency, but the landlord pieces, the other half of the piece that I I find it hard to wholeheartedly support the current bill. Without that input, laura. Thank you renee and thank you burton. I am in support of the bill and I like what you said when you said that you are prioritizing to support small businesses and when you emphasize that it this is, this would be amended to fit these circumstances. So it's not like a one-size-fits-all kind of a bill that it'll be amended or to you know again to fit the circumstance. Thank you kim hi. There yes, absolutely support this direction. I I'm sorry I did have a question for burton. I know we're in the comment section, but I was curious about the 30-day look back period on tenant income and just the rationale behind that. Why 30 days, why not longer why so? The purpose here was to demonstrate for the purposes of paying a reduced amount of rent in a given month. You would need to show that your actual income had been impacted the month before. So that that you had a need for a reduced rent based on the previous months forever now, okay, I was just curious and I'm imagining that I guess the rationale behind it is that this is such a volatile time and that 30 months is like an accurate, and you know it's enough of a look back period, but I was just curious about that piece, but yeah absolutely like you know the spirit of what this is trying to achieve fabulous jamie thanks. I also support the concept of it kind of to echo what rachel and July said, like the spirit of it seems right, but I wanted to just add two things. The first is like I know you said small business constitution less than five 25 full-time employees, but just in real time when I look at the businesses around midtown, where I live, they're impo their businesses with like 50 employees, are still suffering. So I just kind of feel like that's a little stringent to be very frank with you, especially since the ones with 25 full-time employees are already gone. Like I know, some of the food places near me are just already gone, so can we maybe think about? I don't know what this proper math is, but extending that to like 50 employees or even 70.. I don't know what that number is, but that just seems really low and I just want to make sure that enough businesses are covered, and, secondly, I'm glad you said that, like budget wise, like there is a plan and contingency to like make sure that we even have the money or like where it's even coming from. That's really great, but I just feel like I think someone mentioned in the chat the landlord deserving eighty percent of their po pro equipment. I'm really unsure about unclear about the specificities about the landlord situation, because without like a place to even have the business, this doesn't even help people. So it's like there's a catch 22 here that I feel like isn't being addressed, but I would like something for a small businesses. I just feel, like some pieces seem a little missing right now, so got it and we'd be happy to take a look to it at expanding the threshold for employees and seeing what that would look like in terms of you know the physical yeah and addressing the landlord situation like. Maybe we need to add a clause to help with the rent. I don't know what how that would really play out because I haven't been in the weeds, but I just feel like it's a circular issue. Right business won't even survive anyway, so pete. Well, I'm not going to beat a dead horse actually July and jamie mentioned what I was going to talk about. I support this in theory and in concept, but I do have some questions about the about. Having more input from you know, property owners from the landlords and also about the the rationale for the 25 people or less for a small business, because I do believe that particularly here in new york, small businesses actually are larger than that, and so that's just something to think about. Thank you, joseph I'll, be quick not to beat a dead horse either. I support this bill. I think it strikes a good balance. You know landlords having to sacrifice one-fifth of their rent. I think it does prioritize small businesses a little over landlords and I think, that's okay. A lot of small businesses have had to sacrifice 80 to 100 of their revenue for months at this point, and I think they might even be in tougher situations, so I would definitely be open to an expansion of the bill to include 25 to 50 employees, but I also think that maybe that could be a separate initiative or maybe there could be a an order of operations like the first 500 million in funding is reserved for small businesses and then you know anything over them that's available. Maybe that could go to more medium-sized businesses and may not. So to summarize, I do support, but there's interesting ideas here, July, I'm just thinking out loud here. I don't know if it's a better idea, I'm sure your office probably already thought of it and discussed that away. Let's cross that out, but how about you know, because currently the assistance is going towards the landlord, how about providing assistance direct directly to the small businesses? I mean it was the state who issued the executive order to mandate businesses closed. It is the state currently issuing orders to restrict the capacity that businesses and the manners the business can operate whereby resulting these businesses to lose revenue and operating on a reduced net income. So how about making up that difference for these businesses directly and oblige the same businesses to pay their rent, as they already initially have already contracted to do so? Thank you, and you know I know we're supportive of you know, efforts to ensure state federal, local wherever it comes from funding that goes directly to the businesses, and you know to employees in particular. The way we structured this was actually to alleviate the burden on the businesses, because, with this model, the business the tenant doesn't really need to do anything. They have to keep track of their finances to be able to demonstrate that they qualify for that reduced rent, but they don't have to go through the application process and you know, put together paperwork to apply for funding from the department of financial services. So we are putting that burden on the landlord to do the legwork to then get the funding so that that's why it's set up the way it is. It was actually to just try to minimize any additional burdens on the businesses. Thank you for that. Any more comments from the committee I'm going through any last comments. So what I'm hearing now is that the committee is in favor of the bill generally conceptually the spirit of it in supporting small businesses. What I've heard was that the committee would be interested in seeing it expand beyond 25 employees and making sure, first of all that there's money in the budget to even effectuate such a such a plan, but everybody seems to think it's a good framework that the structure works and in some respects would like to have the property owners weigh in on it. That's what I've heard is if people are in favor of a resolution that would reflect that. I need to have a motion for that so moved. Do I have a second julie? Can we take this to a vote? Sure renee? Yes, I'm a yes mary, yes, laura! Yes! Tristan did tristan, maybe come back to him. Okay, thanks tristan sam, yes, jamie, yes, joseph joe, yes kim! Yes, evan, yes, chuck! Yes, pete, yes, rachel! Yes in July, yes, okay, great okay, so we will put together the resolution, including all of the caveats that we've mentioned, and we will present that at our full board meeting burton you're, not off the hook. We have another bill to hear from you. Well, thank you. So this one this one's actually more esoteric. This is the clear path forward act and we carry this with assembly, member catalina cruz from Queens, so under current case law. If a business wants to terminate a commercial lease by proving that performance under the lease has been frustrated or made objectively impossible, they have to go to court and they have to prove two different prongs of a test. The first prong is that the destruction of the subject matter of the contract or the means of performance on the contract makes performance of the contract objectively impossible. So you have to prove I couldn't follow through on this contract. If I tried because of xyz- and the second thing you have to prove is that the impossibility was produced by an unanticipated event that could not have been foreseen or guarded against in the contract. So I apologize. That's a it's a dense kind of framework for what you need to prove. If you are trying to get out of a commercial lease, I have a. I came up with an example involving piles of acorns and squirrels that come and eat the acorns. Now you could foreseen it, I'm gonna spare you guys that, although it's a good, it's a good long tortured metaphor, but it boils down to as businesses across the state are struggling. They're gonna go to court and they're gonna try to get out of their commercial leases by arguing that the pandemic and the government ordered closures, made it impossible for them to hold up their end of the contract and a business that seeks to terminate a commercial lease by arguing that is still going to have to prove to the court that the performance of the contract was impossible and the impossibility was unforeseeable. So what this build does is to try to avoid a patchwork of court decisions across the state. Interpreting cases in a number of different ways is to just establish once and for all that, for the purposes of that two-pronged test, the Covid-19 19 pandemic was not a foreseeable event, so a business would still have to overcome the evidentiary burden of saying of proving that their performance under the contract is impossible, but they wouldn't have to prove that Covid-19 was unforeseeable. We would just be establishing that as a general judicial interpretation with this legislation- and I apologize- I've never actually had to explain that out loud to people before so I hope I hope that made some semblance of sense. You know we worked closely with assemblymember cruz's office and some attorneys, who are very well-versed in this practice of law, and they assure us that this is. This is a good method for trying to clear out some costly and time-consuming litigation over a patchwork of decisions. That then, would have to be appealed and would ultimately go up to the court of appeals anyway, and my final thing on this part of our goal with this bill is to try to help reduce litigation by tipping the playing field slightly towards the tenants, because we're making it a little bit easier for them to prove their case to get out of their commercial lease and we're hoping that helps, encourage the parties to come together and actually negotiate settlements out of court that are reasonable and keep the businesses afloat for the duration of the pandemic. That's my pitch on that one! Okay! I bet you there's lots of questions all right. Are you ready here? We go questions from the committee yeah. I have a question what's the d, so if somebody has a forced majora clause in their insurance, they would have been covered right. So this is sort of stepping into that. My understanding is that this is a little bit different than insurance coverage and improving. You know forced majora. This is this is separate, and apart from insurance, this is saying I can't actually fulfill the terms of this contract because circumstances have made it impossible. Okay and then again the circumstances that made it impossible were unforeseeable. So someone going out a bit and I'm sorry, someone going out of business because their business fails. It makes it impossible legally potentially for them to then fulfill the terms of their contract, because the business is actually out of business they've dissolved, but if you're a business going out of business is a foreseeable event, it's a risk that you undertake we'd just be saying here that a global pandemic that causes you to go out of business was not foreseeable, got it evan. Thank you, we're just unmeeting. Are there other examples of the state legislature passing laws that lend some assistance to courts and in interpreting contracts? Is there any precedent for doing something like this? That's the short game, short version of the question and the short answer is yes, I can pull you some examples, but I can tell you all the time, especially in the judiciary committee. We pass legislation that clears up judicial interpretations that have strayed or have diverged out of case law. So in a way we would be preempting that by seeing the you know, foreseeing the the problem and trying to address it ahead of time, although usually what the legislature is clarifying are the words of bills passed by the legislature and not judicially created standards for interpreting contracts. Is that fair to say I'd say? Yes, most of the time I'd be happy to look into whether I can pull some examples of other recent legislation that we've passed, that more go to clearing up or codifying case law that comes out of judicial interpretation, renee, you're, muted, other questions, July. Thank you renee, so burton. Let me just ask you know straightforward. The purpose of this bill, then, is to allow businesses who have signed the lease has terms remaining to be able to say my business is not going to go on. I need to be out of this lease, and you cannot go after me. Is that the purpose that is part of the purpose here? Yes, so the other, the other part of the purpose, because to do that, even if this bill was passed, there's still a high evidentiary burden that the business would have to meet to convince a court that it was actually impossible for them to perform on the contract. We would just be with this bill taking care of the second part of that two-part test as to whether or not the pandemic was foreseeable, and so what we're trying to do. That makes it a little bit easier for the for tenants, not a whole lot easier, but a little bit easier yeah and we're trying to encourage the parties to come together and negotiate. Let me ask you another question, and this may be totally uneducated and silly. But since I don't know, I'm gonna ask if a business is already going out of business. Isn't that enough to have the landlord not go after the business owner? What would the landlord be going after the business owner for if there is no business, so that probably becomes a question of bankruptcy law which is separate apart? That's a whole federal process, but you know there may be assets of the business that the landlord could still go after. This is this is in part if a business was trying to get out of a commercial lease midway through the lease due to the pandemic. They probably want to stay in business and remain in business, but feel that they cannot under the terms of their current lease, so they it may not be a situation where no matter what else happens the business is going under. This could be a business that could, you know, remain in business, but the terms of their current commercial lease are so onerous that, under whatever restrictions are currently in place or whatever circumstances there may be, if people don't want to go to their type of business right now, due to health concerns, they may try to get out of their lease and that again is still something that they would have to prove in court. Thank you. So I have okay. Thank you. That's very helpful burden. I have two points or questions with that information. One is isn't that the purpose of the other bill, the previous bill, that we were talking about to help the businesses with their rent payment. Second, is. It sounds like we're just choosing to use taxpayer money to bail out businesses who want to just reorganize and keep their assets to not have the landlords go after collecting their assets. So, with this bill there's no, there would be no financial burden on the state. With this proposal, there's no there's no fiscal attached to it. It actually probably saves the state money by trying to reduce the amount of litigation, that's going through the courts, and I apologize the first part of that question. Helping businesses with their rent obligations isn't that the other bill is trying what the other bill is trying to accomplish. Yes, it is so I guess the two things there. First, there's no size restriction with this bill, so this would apply to the larger, the larger employers and not just small businesses and the other piece of it. And I'm glad you asked this because it's something I think I meant to say earlier. You know, as I'm discussing the other bill is a framework and as we're discussing this idea- and as I mentioned, we don't yet know when the legislature will reconvene, take up legislation and what the circumstances will be on the ground at that time and, as we saw with some of the rent residential rent relief proposals and as we saw with the housing, stability and tenant protection act last year a lot of times. The legislature will take bits and pieces of several different proposals and come up with a consensus bill that they end up. Advancing and there's all sorts of considerations policy-based politically financially that go into that decision. Making part of what we're trying to do here with these bills is have some ideas to be at the table with when it comes time for some sort of legislative approach to be taken. We want these ideas to be considered. Some may be complementary. Some may be mutually exclusive, but we at least want them discussed as part of whatever the actual solution is that we end up reaching joe mafia, so for clarification. So this is really primarily for a business that wants to get out of their existing lease but renegotiate a new lease. That's correct, they're, going out of business and they're going out of business. So how would good guy causes or other protections? How do you think that they would work hand in hand with other protections available like limited liability, goodbye clauses, so this bill this bill doesn't really change how you know right now, any business any party to a contract could go to court and try to argue that they should be out of that contract, because it's impos performance on the contract is impossible. That's the status quo right now, regardless of whether you have a good guy clause or any other liability clauses in that contract, and if you convince the court that in possibility you know, there's an impossibility to perform, then typically the court then just you're out of that contract, but that it really is a steep hurdle to overcome courts. Don't tend to just let you get out of a contract, it really tends to be pretty dire circumstances and again, the status quo is dire circumstances that were unforeseeable, so we're just changing the foreseeability part of that two-part test. So I don't know exactly the answer of how it works with those other clauses when you, when you try to terminate a contract, but nothing about this bill, changes that dynamic. If that makes sense, thanks more questions, any more questions, all right, I'm going to sing none I'm going to ask if any of the members non-committee members public have questions luke. Let me know if you see it in chat nope, I don't any questions from the public. Okay, all right, seeing none! I'm going to turn back to the committee for comments on this bill. Let me see who's the first person evan, so I completely get the intent of the bill and understand where brad is coming from on it, and I certainly respect brad immensely and his motives here. I think this is going about it. The wrong way for a number of reasons. The first and most important reason is just at the most basic level of law. Contract interpretation is the province of the courts. There are few things that are more established than that, and so you know there may be instances relating to government contracts where the legislature puts its thumb on the scales or has something to say about it, but in terms of private party contracts like that is not the role of the legislature, which is just, I think, the fear of having lots of lots of litigation and divergent opinions on this topic is a little overblown too. My instinct is that this is not going to be a possible path to success for commercial tenants and courts will almost uniformly sought uniformly side with landlords on this issue, and even if they don't, I mean there is a very well established means by which we settled divergent opinions and that's through the intermediate appellate courts and, if necessary, the court of appeal in new york. If trial level courts disagree with each other there'll be a very quick appeal on this, and someone will have an answer. I think you know it takes a year and a half so be it, but there'll be an answer again. My sense is that this is not going to be a path to success for tenants and they're, not gonna they're, not gonna waste, a lot of legal resources and money to do this, and I'd also be a little fearful that the bill itself is just over broad. I don't know that it's actually true that in every instance, Covid-19 was unforeseen by commercial tenants and the reason for that is you know. We see lots and lots of examples of you know especially sophisticated commercial tenants, but even those that are very small and just took out. You know something more than the usual insurance policy taking out insurance contracts that you know will pay them in the event that there's a communicable disease issue in their place of business and even in a minority of cases you see some pandemic related insurance policy, so it could be a situation where you pass a bill saying categorically it's unforeseen, but that's not actually true, because you had a number of commercial tenants buying insurance. That indicated it was somewhat foreseen. So again, I totally backed the motives and I'm happy to tip the scales in almost every instance in favor of tenants over landlords. I just think this is. This is not a good precedent to set and I would be pretty hesitant to do anything related to contract interpretation through the legislature, thanks evan joe mafia. A point of order. Can I ask a question of burden clarification? Yes, you may okay burton. Is there a time frame on this on this bill? If someone signs a lease at the end of next year, they can claim covida. I apologize for not kind of knowing that off the top of the head. It's certainly not intended to allow someone who entered into a new lease or even renewed elise amid the pandemic, to be able to argue that it was unforeseeable and I'm just wondering under the actual language of the bill. If I mean I can't imagine, a court would allow that. So in the interest of time, joe I'd be happy to follow up with you on that, but it is certainly not the intention that someone would be able to benefit from this post pandemic. This is something that would apply to people who had entered into leases. Far in advance of the pandemic. More comments, we've heard evan's point any thoughts on evan's point regarding this bill, joseph I guess renee point of order. Can I ask a question. We can ask questions, but I will allow it case. Given yes go ahead. Well, it's actually for evan. If you don't mind, because I thought he made some interesting points and there's I guess, could you could you create a? Could you do it as a comment and then we'll see? If evan could make a comment? If there's no cross conversation, you do it that way. I will phrase it as a comment fabulous. I appreciated evan's points, I'm curious to hear what unintended consequences this type of legislation might have for future judicial process, which I've been mentioned a couple times. Thanks for your comment about concern for judicial process, are there any more comments on that issue? So I guess I have a comment on that issue. So one of the unintended consequences would be passing legislation that- and this is the point I mentioned at the end- that is not consistent with what the actual parties did in real life. I think for most commercial tenants- and this is this- is more anecdotal than anything. Data-Driven, I'd be the first to admit that, but just from what I do for a living and what I've seen in the insurance world, there is a meaningful minority, not a majority, but a meaningful minority of commercial tenants who took out insurance that it doesn't protect them to the extent of making them whole on the revenue that they have lost. But it gives them some recourse to seeing some money in the event of something like Covid-19, and if you did that and sort of by definition, you foresaw something like this, and so the landlords will look. And let me preface this like there is. There is an emotional appeal, and I feel it myself to saying to voting yes in this committee on anything that dings landlords at the expense of tenants. But I just like I want to make sure that we do it with like a level of sort of like 30 000 foot sophistication about what it means for the legislature to do things that are very much in the domain of courts and contract interpretation is just like that's like law 101. That is what courts do and the legislation passes laws and occasionally it's called upon to clarify those laws, if there's confusion in the courts, but in terms of two private parties signing something instances of the legislation legislature weighing in on that are far and few between and there's a reason for that. It's because we trust the courts to do it. So I guess I do feel a little protective of that as much as it pains me to do that in the context of struggling tenants. Thank you for that comment. Evan July. I agree with evan's points. I tend to look at it from even though you know, certainly I'm not a lawyer I'm, but I, but I wanna. I tend to think if the state of new york passed this law and allowed people to for purpose of renegotiating their contract obligations to get a better deal or to keep their business going, especially when their business would have kept going anyway. It is just it's tipping the scale. It is changing. The rules of the game, two parties entering into a contract both were willing and able to fulfill that obligation. Yes, there's a pandemic, let them figure out. I don't. I don't think it's helpful for the legislatures to be involved in this way. Thank you, July. Do I have any more comments? Can I can? I add one thought quickly and I would just say you know again appreciating the intent in the bill. I would be totally in support of you know, finding ways to financially support and backstop small business under small businesses that are struggling. I would love to learn more about and feel like. I would likely support bills that consider some sort of either rent, freeze or rent vacation for commercial tenants and that definitely interferes with you know contractual arrangements, and so let the legislature pass it and let courts consider whether it's okay, what I'm less okay with, is the legislature weighing in on something that is very much the domain of the courts. So you know we can make policy, but when we're sort of him hamstringing courts in what they do every day that I think it creates a slippery slope. That would just make me a little wary more comments. What I'm hearing from the members so far is that we believe this is really the province of the courts, not the role here to weigh in on individual contractual law and there's some fear that the bill is over broad. So that's what I'm hearing from the committee that we're not in favor are there any more comments? Mary yeah, I guess I'm just confused this burden. Maybe you could clarify this sort of two hurdle situation. Is that unique to new york, or is it different in other states, and is it different in other states because they've legislated it to be different, we're not in we're not in questions anymore, but I'll? Allow it just for clarification. Thank you sure. I can't speak with absolute certainty about other states, but I can tell you that this is. I mean somewhat to evan's point. This is a principle of contract law that goes back to I mean this might even go back to like england. You know this is sort of com, common law on contracts that I would imagine, is very similar in other states. Yeah, that's true: you'll find impossibility and foreseeability in almost every state in the country, if not all of them. Those are those are like burton said, common law doctrines that weren't created by the legislature. It's not like a law that new york passed. This is something that predates those laws in a sense, and it's just something the courts have lived by in this country for as long as it existed pretty much. Thank you joseph. You have your hand raised, you're still, muted joseph. I am torn about this because I'm not an attorney, and I think I can't speak to the points that are being made about precedent and how contract laws interpreted, but I think I would like to clarify that. I that I am in support of this. You know as a late person, it seems that new york just defining kind of how contract law they're basically defining. I know we're not using the word force major but they're, basically defining what is, of course, majora's situation, and so it comes down to us to weigh in on whether we really think businesses should have anticipated this pandemic. I think our government should have, but I don't think that businesses could reasonably have anticipated pandemic, given that this hasn't happened in such a way to affect our everyday life in over 100 years. So I guess I want to say I appreciate evan's point and I'm a little torn about that, but I would really like to support this okay, so we have another viewpoint, any more comments for the committee. I have two very different points of view expressed by the committee. I'd like to hear what everybody else is thinking renee. Do we need to take this to a vote? We do not have to take this to a vote. I just want to understand that if we are, if we had the opinion that the committee was trending to not supporting this issue, and so I wanted to clarify that we don't need to take it for a vote. We do not need to support a resolution in this, but I want to be clear where the committee stands, which is why I'm asking for the the comments of the committee so rachel. What is your view on this? My view is that I support it in theory, but I also hear evan's point as someone who doesn't have a legal background I feel like I can't I don't have enough information to go either way, so I wouldn't really feel comfortable supporting it or writing a resolution, not in support of it. So that's. I guess why I'm wondering if maybe the best thing to do is just not really take a stance on it right I mean, if we're not writing a resolution, which is, I think, I think, is where the committee's headed we're. Not writing a resolution right we're not supporting this. So it's not that we're going to take a resolution in opposition to this. It's simply we wouldn't be supporting for the reasons that have been stated. I just want to make sure that I'm capturing the full committee, joe mafia. I would echo what rachel just said: okay, anyone else. What I'm hearing from the committee is that it's not necessarily that we're unsupportive of the bill. I would say that we are what I'm hearing is that we're supportive in theory and of the idea of the bill where the bill wants to get to the methodology is not something that we can support for various reasons, so why we like what you're doing burton and what the bill attempts to do we're not on board with the way in which it's being achieved. So this is something we would not support with a resolution tonight, but we appreciate you explaining answering our questions and happy to hear if there's some new iteration of how you're supporting for you to come back to us with it. Okay, great, thank you again for having me, and you know if there is any other information or questions, that anyone has. That would be helpful. I'd be happy to field those down the road if you want to pass them through annabelle or contact me directly, will do absolutely and thank you so much for this evening. Very much appreciate it. Yeah, absolutely okey-dokey. All right! We're gonna, move right ahead and we're gonna go to ben ben is from council member power's office. I sent out the open for business document, which is a little bit outdated on some of the initiatives around small businesses, so ben's going to take us through what's happening now with respect to some of these initiatives, and we also have then laurie following ben from council from the speaker's office who's going to talk about some bills that have already been passed and what's happening to support small businesses. So ben I'll turn it over to you right now sure thanks, hey I'm ben jacobs from council member keith bauer's office. I work with abigail. I don't handle legislation for us, so you guys know abigail. She does I've been on listening for the last hour and a half here, I'm not gonna, be able to answer all of your questions with some of the specificity that you guys want more than happy to follow up. You guys, you all of abigail's email mine is just jacobs at council, but and then the so. The document that renee sent around is the the open for business report that that councilmember powers afford at the at the end of July. So it's almost two months old now and two months in pandemic time is much longer than that. As we are all aware, and a lot has changed since then. You know: there's a there's a plank in there about expanding outdoor dining and keith actually announced today that he's gonna be introducing along with councilman antonio reno, so next week a bill to make permanent outdoor dining. You know not that everything has to be out there all winter, but that it could be. You know in the future and that we can use our public space better than that, but small business, and especially a lot of the the restaurants and bars are struggling, are really near and dear to keith. His his dad was a bar owner. He and he cares a lot about that. He knows how important it is to our community. I don't want to waste your guys time. I do want to jump in and talk about something. That's not in the document that you have, which has happened since then, the last couple weeks, which was something that keith announced along with his colleague brad lander in Brooklyn, and two state legislators, senator brian kavanagh and say and sorry as assembly member julie, knew who, before the small business recovery lease program, and if I have heard- and I have listened intently enough to the discourse that you all just engaged in over the other small business lease programs- I think you'll be pretty into this. I don't have all the specifics. All the specifics haven't been hammered out yet which I think actually works. Well, basically, what the small business recovery lease program would have to be passed by to say both house of the state legislature signed by the governor and then the city council would have to introduce a bill and create a local law to actually enforce it. What it does in short, is it establishes a program where small businesses and there isn't a hard and fast definition on that I some are. Some of the programs are 25. Some are 10. Some are 50 somewhere 100. I said I think the paycheck protection program had a definition of 500 employees, but so that I am anticipating that question. Don't have that definition, but it would allow small businesses to renegotiate their leases with their landlords, and the landlords in exchange would get property tax credits which, and then the rent increases, would be capped and regulated for 10 years and along with the property tax abatements that the that the city would give out, so it doesn't cost the state any money. It costs the city money in terms of lost revenue, but it doesn't actually cost any money. You know it's, not the city isn't putting any money forward, it's just not receiving this much money. These are property tax abatements. It's a lot like what happens with affordable housing in the city. You know with the 421a program, where the you have it's a residential rent regulation with lottery units or what have you and new buildings, and we get that affordable housing in exchange for losing out on some tax revenue. This would be to a larger extent. This is for commercial, small businesses, which is brand new. I think it solves a lot of the problems that you that your committee had raised with some of the other proposals. It's a it's a much newer proposal. I think there was a rally that keith and his colleagues had with some small business owners. I believe in chinatown last week happy to take questions on that or move on to any other topics. Let's take questions on this specific bill. Can you do you have the bill the details of the bill? It's s, 8904 I'll drop, a link in the chat, fabulous questions to this bill. That's the senate version there's also an assembly version which you could see in there. Okay, any questions. I have a question, and I know that you said you don't have specifics. What is the anticipated loss of revenue in terms of the property abatement so that essentially, the state would leave up to the city? To that, that's what would be decided in the local law that you know after this passed out of the legislature? That's something that councilman powers and councilman lander when they introduced us as the co-prime sponsors in the city council, because the city can't do this on its own right. You know, because the state doesn't let us control our own tax structure like that, so the we would we would set that up. I'm sure there would be extensive negotiations and the exact amounts that both of the benefits and of the of to the bet the requirements for the negotiations, as well as the property tax abatements, would be set, and it would it would determine all of that understood. Are there any property owners that have partnered and championed this? Not that I'm aware of, I think that the focus really has been on on the small businesses and working with small businesses and the bids, and I know the hospitality alliance has been pretty involved, but the I don't know if we've heard from any property owners themselves, but I would think that it's more of a common sense solution. That's a little simpler and a little easier to wrap your head around that, I think works for all the parties. As long as the numbers work out- and we don't have the numbers in front of us, but when we get there, I would think that if this is the route we're going that, then that's how it would work thanks ben questions. Does anyone have a question? I see joseph you had your hand up. Did you? No? If I did I get that wrong, no questions. July. Do you have your hand up? Yes, I do thank you renee and hello ben. I know you don't have all the specifics, but perhaps you can take the questions where you don't have the specifics and bring them back to us when you do so one is I love the idea? I actually you know this has been on my mind since April, so thank you and thanks to council member powers office, you know for sponsoring this. I think this makes the most sense, because you know landlords have got responsibilities and property taxes within the borrowers of new york city is one of the top expenses that they have to meet in order to keep the buildings and tenants in tenancy and operating love. The idea I would be in support of this- I don't understand, however, why mandating the rent increases for 10 years? What does that have to do with lease renegotiation and tax abatement and- and number two is- can is this up to the landlord's intended to select to enter into the program or will the law mandate? You know certain sides of landlord tenants who must entrain to this program. I would I again, I would imagine that the bill would favor defense on that end, but, in terms of you know, mandating the rent increases. I think that would be one of the guidelines set forth for what the what the what the outcome of the negotiations could be. You know it wouldn't be that the city would be giving out property tax abatements as a free for all for anyone wants to enter in negotiations. The negotiations would have to have substantial enough sustainability for the tenants in order to receive the abatements, if that makes sense, thanks ben in the interest of time. I think this is a bill that we want to look at more closely and I may ask you to come back either you or abigail at our next meeting to talk about it more fully. So we can share the text amongst the committee members going forward. You had I actually. I have a comment, a question quickly from the public member I'm going to jump to. What do you foresee is the estimated timeline from now until implementation, ben yeah. I can't I can't tell you that you know there are two. There are too many things for me able to be for me to be able to say anything definitively. There are six co-sponsors of this in the state senate. You know, along with brent hoyleman, you have brad hoyland being the chair of the housing committee, who does a ton on rent? You have liz kruger who's, the chair of the finance committee, who you guys know well and zelda myrie from Brooklyn, because I've rivera for the Bronx elisa polvo from the Bronx andrew bernard is also from Brooklyn. So it's a good mix of support there, but we don't know like you've heard from burton. We don't know when the legislature's coming back to me and if this is something they would consider, I think a lot of it also depends on what's going to be happening federally, so you know because we could at some point in October, get a surprise stimulus package. You know that's something that could happen. We could end up getting that in in february or March. No one knows I can tell you that the program would be in fact for two years after passage, so this isn't something that would go on forever. It's for the recovery. So when it's passed it goes into effect for two years and then the negotiations start, I'm sure when the city, when the council passes local law, would outline more specifics. Okay, if there's no more questions from the committee, I'm going to ask then to move into the other issues. He was going to present the other initiatives anymore I'll just give through this stuff quickly. If that works, you know, there's the there's also because you know keitha proposed at that point, it looked like we were probably going to actually get some federal stimulus so keith to propose some direct. You know ways to use direct payments to small businesses from the federal stimulus, of course, as you all know, and I've heard several times at this point- the city and state have no money and the federal government doesn't have any money either they can just make it up, though we can't do that, so that was there another thing that we were going to do relative to, and this falls in line with the discussion that we've been having the a suspension of the commercial rent tax, which you guys are probably all familiar with, or I can go into if you're, not that's the resolution in favor of that. So we're we yes, perfect great, greg you're great, so that would be like a four percent rent cut right away. Most of the stuff. Is there there's a support for a federal bill, the restart act for saving our stages. It's about live music venues, specific money from the federal government that senator schumer's actually gotten behind that recently and as a minority leader that would hold a lot of sway. Hopefully next year, potentially that's something he's been very supportive of looking at removing regulatory hurdles by ending fines, creating grace periods. That's about you know, making sure that the businesses can operate. What else do we have here that we should go into talked about outdoor dining, already capping, third party fees beyond the state of emergency? One thing with: oh, I probably shouldn't step on what the representative of the speaker's office is going to talk about relative to what we've done in terms of the third party fees for like grubhub and seamless, and all that you know just extending that and so making sure that the businesses are able to do that targeted employment assistance, so extending financial assistance, undocumented workers. You know one thing that that hasn't been discussed enough, probably that the city did is the mayor had worked with the open society foundation to work on direct financial assistance to undocumented new yorkers, who might be not be eligible for federal funding and just working on expanding that to make sure that no one's that we don't exclude people who really need help that's about it. There have been a few things that have happened since then, but the I mean the headline today is extending the outdoor dining but happy to take questions on any of that. If you guys want to get into it, but you have it all there: okay, any questions or comments for ben from members of the committee. If not I'll ask you ben if you could send the outdoor dining bill once I think you said it's has that been introduced yet or it's I think it's being introduced next week, if you could send us that, so we could circulate it and that's something that we could get and dig into a little bit more when there's more details and other bills that are supporting the small business. I think that would be great yeah, definitely fabulous, just any more questions from any of the committee or comments seeing none, I'm going to turn to the public say none, I'm going to say thank you very much, ben and we'll be in contact. I'm going to. I know that laurie h is going to speak about the speakers initiatives on small businesses, but very quickly. We have zina sawage from the mayor's office to end domestic and gender-based violence, she's going to give us a very brief overview of the services that they have available. She has to leave at eight o'clock, so I'm going to quickly ask her to jump in here, introducing her to the committee and xena I'm going to turn it over to you hi everybody. Thank you for taking me in I'll go through very quickly, so I am from the new york city mayor's office to end domestic and gender-based violence, who's, switching, the slides there you go. Thank you at the new york city mayor's office to end domestic and gender-based violence, we're developing policies and programs to end the high rate of domestic violence and gender-based violence that we would endure within all boroughs of new york city and so just to touch briefly. What we're doing is that we have a new york city, family justice center within each borough. Those family justice centers are free for any survivor of domestic or gender-based funds and their children we are currently taking in calls and taking in calls from any survivor victim who's experiencing violence at this time and the services that we provide is are is a multitude, but some are case, management, social services, civil legal. We also have a grant program where we're offering, literally of up to, I think, 1500 thousand dollars to any survivor 1500. I'm sorry 1500 to any survivor who is in need of this quick funds to really make sure they're in the same situation that they're in and we're also providing housing, housing assistance and a multitude of services. And so, despite that, we are servicing we're trying to get the word out to everybody from the public about, in the case that they do hear somebody experiencing domestic or gender-based violence, if you're going. If you can go to the next slide, the domestic violence. Gender-Based violence consists of anybody experiencing sexual violence, human trafficking, stalking, family violence, intimate partner, violence, elder abuse and sexual harassment. So if anybody does come in with such does, if you experience or you know of anybody experiencing such violence we'd really like it, if all of you can participate and try to console the person, always not to come and come to the to the point of where you're judging them, but rather listening them believing them, it's not our place to investigate our places to support them in any way we can, and so when anybody does disclose that information. The next slide. Sorry after yes, if anybody does break, does resp. If you do receive such a disclosure, it's always important to come from the point of view of trying to offer the help that we can do always be realistic as much as possible say. How can we help you? What can I do for you to make you feel safer and then from there we can xena. For some reason, I can't hear you anymore: can anybody hear xena, no xena? Okay, I think, given the lateness of the hour xena are you there? I think, given the lateness of the hour, all right, she's, obviously, we've lost her. It looks like if we could stop sharing her screen if she comes back, we'll revert to it, but in the interim xena are you there. She might have had to go to that other meeting right. Okay, so we can get her back and I can disseminate the information that she was sharing on the office and the resources that are available and we will move on to laurie h from the speaker's office. I thank you for being so patient laurie. I'm very sorry about that. That's fine over to you about the small business initiatives yeah! Well! This is going to be very quick. This is really just a recap. So thank you for letting me have the opportunity to do that. Just to remind people of the work that we have done this year, you know the speakers worked very hard throughout this pandemic small businesses. He knows the heart and soul of the city. I think you all know that he's been leading the way on outdoor dining. He is now pushing for safe and clear guidance for indoor dining. This year we passed the small business relief package that included alleviating fees and posts on business, such as sidewalk, cafes, protections against commercial tenant, harassment, suspending personal liability provision leases, that's something that burton referred to earlier. That's 1932 a and a delivery cap, and those are just some of the significant bills that were aimed at helping small business owners. There are others, but I will leave it there because those were, I think, very successful. Thank you lori. Does anyone want to ask larry any questions about any of those provisions quickly? I'm not seeing any questions. Thank you. So much laurie for the update, really appreciate it. I know it's getting late, I'm just going to just give a quick report to the committee and some updates I just want to let you know that the information we have on the harmonia- and maybe laura you have further updates- is that family addictions have been halted and they're not going forward. That's very different! Definitely let you know so that's been some good news. I think you all know that some of the sanitation budget has been restored, so we're getting more basket pickups and that's good that a little bit of that has been restored. Third, on our website, we have a link to the NYPD disciplinary matrix and that's currently open for public commentary. If you'd like to jump on there and have a look at that and leave your comments. Fourth and hats off to laurie the speaker's cleanup day, a lot of fun we had a lot of fun was successful and I think maybe there may be more forthcoming. There is a second one. Yes we're arranging it now, all right so great, so hopefully we can be involved in that. The final thing is we're getting a lot of complaints regarding the homeless and some noise and we're just trying to put together a meeting to address some of these issues, we're going to try and get a panel together of our electives and maybe breaking ground, and some of the other people involved in this situation so that they can talk to us about the work that they're doing to address some of these issues. So that's in the works, and then the final thing I want to say is I'm going to ask everybody to put all their all the silos that have been working on budget requests and, as they hear bro consultations to put them into a google document that I'm going to circulate, and we all filled out those two top wishes for the silo which go to our district statement of needs. If you guys could return that to me each silo by the end of the week, that would be fantastic. That's all I have for anyone. Does anyone have any more comments or any questions before we go? I don't see anything. Thank you all. Thank you. I know it's late. So I appreciate your patience. Thank everyone and I'll see you at the full board. Good night, everybody. Thank you, renee. Thank you good night.",
            "summary": "There's going to be then an overview of small business initiatives that are being proposed by local electives ben jacobs of council member power's office is going to speak and laurie h from speaker.\nThe committee is going to ask questions of the presenter and when all of those questions have been answered, members of the public will be permitted to ask questions So. If you'd like to speak, use the raised hand function once all of the questions have been addressed, the committee will then go into business.\nWhat happens after that is anybody's guest, we're not sure how the courts are going to open or how they're going to hear the cases that have been held in obeyance, but we're pretty sure a lot of people are going to be affected, so the bills from the city council's general welfare committee go some way to address those issues.\nLast week the general welfare committee heard a number of bills related to source of income discrimination and in general, trying to reduce discrimination and give people a chance to find housing in the city.\nIf you have like a housing voucher currently in the city, so the state actually pretty recently passed an expansion of protection, so this is kind of just making sure that we have city level protections so that we can have that kind of city level enforcement and make sure that our laws are closer in line with the state.\nIt also has an exception for ones that are owner occupied, that are three units, and we are potentially looking at making some amendments to it, based on testimony at the hearing to bring it closer in line with what the state law ended.\nSo, we may make some amendments, but we think it's a really important bill and definitely has support from the advocacy community in terms of putting these protections in place in new york city law There was a bill to require that DHS provide services to domestic violence, survivors in all shelters.\nIt would prohibit housing discrimination in new york city based on a criminal record, so kind of like ban the box, landlords and real estate brokers would be prohibited from inquiring about criminal record information during the process, and it would also be unlawful to advertise or circulate any information that expresses any limitation in housing.\nIt's, actually like a very well well-functioning part of city government that has been able to help a lot of people who were discriminated against and solve individual cases, but Right now somewhat because you know they reshuffled around their staff during Covid-19 to handle different cases and then also someone left their job.\nIt stated, so the big hurdle is usually just getting a vote at the committee level, which means you know getting the support of the speaker, and hopefully they can all move as kind of a package.\nSome of the bills like 146, which was the one I talked about, of making the vouchers comparable to actual cost of rent we'd, probably have to do a fair amount of negotiating just in terms of the budget, impact, and so I.\nThink on the hearing is that the committee is in favor of moving forward in support of the bills.\nThey are state bills, one limits, the personal liability of Covid-19 impacted businesses and the other is called a clear path: forward, an act which suspends some rent payments for some residential, some small business, commercial, tenants, And I, think some mortgage payments in response to Covid-19, so burton.\nIt's a bill that brad carries with assembly member harvey epstein, and it's really getting at a solution to the issue of small businesses and non-for-profits that are having difficulty making their rent, I'm.\nOnce the eviction moratorium for commercial entities has ended, and it's kind of premised on a balanced approach of shared sacrifice between small businesses, not-for-profits landlords and the government.\nSo under the proposal that we developed, small businesses and nonprofits that have lost income due to Covid-19 would be responsible for a modest but reasonable percentage of their commercial rent.\nSo now, you've got that 47 in the middle and that would be covered by a commercial rent relief fund that this bill would establish you're, marking up to 500 million dollars in federal assistance that comes to the state through which landlords would apply to be reimbursed for that sort of middle portion of rent that they don't receive because we have reduced the rent obligation for the tenants.\nWe would like this idea this model to be the framework of eventual state legislation to try to address the commercial rent crisis that we think is coming.\nThis point in time we saw some very dire predictions from the partnership for new york city last month, suggesting that up to 70 000 small businesses would end up closing without some form of assistance.\nSo I mean safely, I, think we can say we're talking thousands of businesses and to what extent the funding need would be there or You know what the fiscal impact of that would be.\nThis would be, but under unrestricted funding that we received from the federal government as part of like a recovery package, and at this point in time, Act, though we did have enough in the way of unrestricted funding that earlier this summer, we were able to pass a 100 million dollar rental assistance program which could we could have used a lot more of that money.\nAre you going to prepare, given that we don't know how much longer the state of emergency will be Thank you for your questions to answer the first part I, to my knowledge,, we've not spoken with any sort of umbrella organization representing commercial landlords at all, but I can tell you: We've spoken with a number of landlords in our district.\nWe'd love to have their support for a proposal like this, and this sort of shared sacrifice model, but we're early in the coalition building around it and to your second question: There are a lot of unknowns here, one of the biggest unknowns that we haven't even talked about.\nYou know what the situation is with the state's finances, with additional federal funding that comes in and where we are with the pandemic and with government ordered restrictions and closures.\nI think we see this more as a framework for something that could be tailored to fit the circumstances in a way that alleviates the rent burden on commercial tenants make sure that landlords are still getting some measure of rent, because we do recognize that they have expenses to pay, not the least of which is revenue.\nThey would be on the hook for quite a bit of money once those eviction once the eviction moratorium, ended, but I, think a lot of businesses would probably like to avoid that type of legal and financial burden at the end of the moratorium.\nThink you raise a really great point that you know some of the existing commercial leases may be for highly inflated rates, and we don't necessarily want the state to subsidize that through this through this program.\nFurther questions from the public, seeing none, I'm going to move to comments from the committee I'd like to hear on the committee's thoughts on this bill.\nI think that in a time like this, with everything going on that there needs to be a dual responsibility to you know not have all of our businesses go out of business.\nIf I jump in just a little bit, I, don't think we would want this bill to pass and be signed into law without knowing the money piece of it and having it nailed.\nWe think it's important to make it clear that we want to prioritize assisting small businesses and making sure that they don't you know, go under during this pandemic that that's very helpful.\nIf we are, you know lucky enough to get federal funding, I can't think of a better use for federal funds If they come the state's way so really support your efforts.\nThink the tenants side would most probably very much welcome it and say resident who you know frequent restaurants, small businesses in the city.\nI want the small business to continue to thrive after the state of emergency, but the landlord pieces, the other half of the piece that I I find it hard to wholeheartedly support.\nHaving, more input from you, know, property owners from the landlords, and also about the the rationale for the 25 people or less for a small business, because I do believe that, particularly here in new york, small businesses actually are larger than that, and so that's just something to think about.\nA lot of small businesses have had to sacrifice 80 to 100 of their revenue for months at this point, and I think they might even be in tougher situations, so I would definitely be open to an expansion of the bill to include 25 to 50 employees, but I also think that maybe that could be a separate initiative or maybe there could be a an order of operations like the first 500 million in funding is reserved for small businesses, and then you know anything over them.\nKnow, because currently the assistance is going towards the landlord, how about providing assistance direct directly to the small businesses?\nAnyway, and My final thing on this part of our goal with this bill is to try to help reduce litigation by tipping the playing field slightly towards the tenants, because we're making it a little bit easier for them to prove their case to get out of their commercial lease And we're hoping that helps, encourage the parties to come together and actually negotiate settlements out of court that are reasonable and keep the businesses afloat for the duration of the pandemic.\nIn a way, we would be preempting that by seeing the you know, foreseeing the the problem and trying to address it ahead of time, although usually what the legislature is clarifying, are the words of bills passed by the legislature and not judicially created standards for interpreting contracts.\nMost of the time I'd be happy to look into whether I can pull some examples of other recent legislation that we've passed, that more go to clearing up or codifying case law that comes out of judicial interpretation, renee, you're, muted, other questions, July.\nThere are few things that are more established than that, and so you know there may be instances relating to government contracts where the legislature puts its thumb on the scales or has something to say about it, but in terms of private party contracts like that is not the role of the legislature, which is just, I think, My instinct, is that this is not going to be a possible path to success for commercial tenants and courts Will almost uniformly sought uniformly side with landlords on this issue, and even if they don't, I mean there is a very well established means by which we settled divergent opinions and that's through the intermediate appellate courts And, if necessary, the court of appeal in new york.\nI tend to think if the state of new york passed this law and allowed people to for purpose of renegotiating their contract obligations to get a better deal or to keep their business going, especially when their business would have kept going.\nI would likely support bills that consider some sort of either rent, freeze or rent vacation for commercial tenants, and that definitely interferes with you know contractual arrangements, and so let the legislature pass it and let courts consider whether it's okay, what I'm less okay with, is the legislature weighing in on something that is very much the domain of the courts.\nSo ben's going to take us through what's happening now with respect to some of these initiatives, and we also have then laurie following ben from council from the speaker's office who's going to talk about some bills that have already been passed and what's happening to support small businesses.\nAnd I have listened intently enough to the discourse that you all just engaged in over the other small business lease What the small business recovery lease program would have to be passed by to say both house of the state legislature signed by the governor and then the city council would have to introduce a bill and create a local law to actually enforce.\nI think this makes the most sense, because you know landlords have got responsibilities and property taxes within the borrowers of new york city is one of the top expenses that they have to meet in order to keep the buildings and tenants in tenancy and operating love.\nThe, city and state have no money and the federal government doesn't have any money either they can just make it up, though we can't do that, so that was there another thing that we were going to do relative to, This falls in line with the discussion that we've been having the a suspension of the commercial rent tax, which you guys are probably all familiar, with, or I can go into if you're , not that's the resolution in favor of that.\nOh, I, probably shouldn't step on what the representative of the speaker's office is going to talk about relative to what we've done in terms of the third party fees for like grubhub and seamless, and all that you know just extending that and so making sure that the businesses are able to do that.\nAsk you ben if you could send the outdoor dining bill once I think you said it's has that been introduced yet And, that's something that we could get and dig into a little bit more when there's more details and other bills that are supporting the small business."
        }
    }
}