{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCupvZG-5ko_eiXAupbDfxWw",
            "title": "2020.09.08 - CB2 Public Hearing: FY22 Statement of District Needs \\u0026 Budget Priorities",
            "publishDate": "2020-09-09",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nPublic Hearing: FY22 Statement of District Needs \\u0026 Budget Priorities\\nTuesday, September 08, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:09 - Welcome\\n00:00:40 - Public Submissions\\n00:05:01 - Board Comments\\n00:06:38 - Public Comments\\n00:07:52 - Conclusion",
            "lengthSeconds": "0:08:22"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "hybM1GEbnZ4",
            "fillerWordCount": {
                "uh": 4,
                "um": 9
            },
            "readTimeFullTranscript": "5 min read",
            "readTimeSummary": "1 min read",
            "wordCountFullTranscript": {
                "hearing": 11,
                "commentary": 5,
                "budget": 4,
                "minutes": 4,
                "evening": 3,
                "person": 3,
                "bike": 3,
                "lane": 3,
                "ability": 3,
                "email": 2
            },
            "wordCountSummary": {
                "commentary": 2,
                "recognizing": 1,
                "person": 1,
                "two-": 1,
                "minute": 1,
                "maximum": 1,
                "hearing": 1
            },
            "fullTranscript": "This is the cv2 public hearing on the fiscal year, 2022 statement of District needs and budget priorities, so just wanted to make sure everyone was in the right meeting and that we're all prepared to have this discussion. Mr Paris, I'm going to ask you. Would you confirm for me who has registered to speak or present this evening during the public hearing Mr Singletary? We did not receive any requests from anyone who wished to testify tonight. We did, however, receive two comments by email and I'm happy to share them with you when you're ready. Okay, I'm fine. Let's start, let's review those emails, please so the first person who emailed with a suggestion for the for the Community Board's budget priorities noted that or observed that some drivers are driving in the bike lane on Lafayette Avenue, and he suggested that we make as one of our budget priorities painting that bike Lane Bike, Lane green and also installing the raised dots along the line, the marking between the vehicular traffic lane and the bike lane. The second person who emailed was commenting about crime in the vicinity of Fulton and Wave Fulton, Street and waverly Avenue, and she suggested that we make a budget priority, the purchase of an argus camera for deployment by the 88th precinct, and I can confirm that we have received recently an uptick in complaints about drug use in that area and drug use in broad daylight, including sitting on the steps of zion, Baptist, church and shooting up during the middle of the day, and those are the two comments that we receive by email. Okay, thank you for that. So let me let me call this public hearing to order and the time that I asked you to read those emails. That was 608. So do we have someone taking minutes this evening, because I do not believe Jessica is on the call to see okay, so Carol, and this is taking minutes. Thank you, Caroline. Let's reflect that. We started the public hearing at 608 pm. We do not have anyone who signed up to speak. Our district manager has read the two items that have been submitted to the office for community response, and so at this point I see a lot of I see more people joining the public hearing. I do want to remind everyone that this public hearing is being recorded, so you all should be aware that you're being recorded and should you choose to speak or any comments that come up from the community, given that we do not have anyone who's scheduled to speak. It is custom that at the discretion of the chair, when there's no one that assigned it to speak, that I have the ability to close the public hearing or I have the ability to open it up for some limited commentary from those who signed on to speak, and so I'm going to take the liberty now to ask. If there's anyone who has comments now before I do that before I allow people to unmute themselves and to give comments, I'm going to do this two ways. First way I want to do. This is for commentary from board members and then at that point I will open it up to commentary from the public recognizing that each person is given a two- minute maximum to speak. So I'm going to ask that you please respect the fact that we're going to do something a little bit different. It is my progress to Technically. I could close the meeting after you do not have speakers, but I do not want people who, given the time of taking the time to be a part of this not to be able to upon if they want to share something. So I'm asking that if you do have comments, you keep them to two minutes and with that I'm going to start. First start with the board members of Community, Ward, 2 and so rob if you can track who raises their hand or who has given some indication using the technology that they would like to speak, that would be appreciated, and so, if you do have the ability to click on the webex that you have a question or if you want to use the chat to express the question that would be helpful. So it allows the board office to track who's speaking and be able to do this in an orderly fashion. Mr Singletary there are no virtual hands raised, but I see Mr Dew is raising his physical hand on camera, because I do not know how to raise a virtual hand. My comment is that we in 2020 are in an era of both Covid-19 and black lives matter, and that as we move forward, we anticipate the ongoing impacts of both of those clearly societal and worldwide issues that we are all confronting that, frankly, are going to have something to do with practically everything that we have to do going forward. There are some reports that say that a recession is about to hit much worse than what we are currently going through, as these impacts continue to be felt throughout our society and that we just take that into account as we continue to move forward. Thank you. Thank you. John appreciate those comments always need to keep that the information in top of mind. Are there any other community board two members who wish to provide commentary at this time: okay, hearing none or seeing none I'll open it to members of the community who would like to give commentary or ask questions at this time during the this public hearing? This would be considered the public comments or the open session form of the public hearing, and so, if you have any questions or comments, please feel free to raise your hand virtually. If you do not know how to do that at the bottom of your screen, you should be able to enter through the chat or there's a button that lets. You raise your hand if you're not able to do that and you're able to share your screen, and you want to wave your hand we'll take that as well, and if you do have something to share, ask that you keep it to a maximum of two minutes. No one has indicated a desire to speak Mr Singletary all right. Let me give it another minute. I mean if that, if I do not get any other comments and trust me, I'm not trying to force people to speak, we will close our public hearing. Okay, great, listen, everyone! Thank you for participating and coming out this evening virtually, and we appreciate you know your continued. I see some continued faces here. People who've always been advocates and long- term supporters and graduate effort leaders for the community. So thank you for your participation. At this time we will conclude and close our public hearing all right. Thank you. Everyone.",
            "summary": "This is for commentary from board members and then at that point, I will open it up to commentary from the public recognizing that each person is given a two- minute maximum to speak.\nIf I do not get any other comments and trust me, I'm not trying to force people to speak, we will close our public hearing."
        }
    }
}