{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "title": "2020.06.17 - CB2 Land Use Committee",
            "publishDate": "2020-06-18",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nLand Use Committee\\nWednesday, June 17, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - n/a\\n00:03:25 - Roll Call\\n00:06:24 - Informational Presentation*: 69 Adams Street - Rob Huberman and Ray Levin at Herrick, Feinstein LLP // proposal to transfer development rights from a City-owned parcel beneath the Manhattan Bridge to the owner of 69 Adams Street\\n00:19:50 - Committee Q\\u0026A\\n00:30:15 - Approval: Agenda\\n\\n00:30:54 - Presentation: 110 Bridge Street - Stephen Choi, Project Manager at John Furth Peachy Architects // application to modify the openings at the first floor, replace two existing stairs and one accessibility lift, install a new fence for code compliance, and install two new canopies over the redesigned entrances\\n00:40:38 - Committee Q\\u0026A\\n00:43:07 - Motion to Recommend Approval**\\n00:46:25 - Motion to Recommend Disapproval\\n\\n00:46:25 - Petition for Revocable Consent: 69 Greene Avenue (Fort Greene Historic District) - Kevin Kehler, Architect at Eric Safyan Architecture //  application to construct in the public right-of-way a stoop and a new front areaway with bluestone paving, concrete steps to a cellar entrance, a 34-inch high iron fence with gate and a planting box with storage for garbage.The proposed work has already received LPC approval.\\n00:53:20 - Committee Q\\u0026A\\n\\n00:58:50 - **Discussion RE 110 Bridge St vote\\n01:05:25 - Approval: February 2020 Committee Minutes\\n01:06:25 - Chairperson's Report\\n01:11:25 - Community Forum\\n01:42:00 - Motion to Adjourn\\n\\n*The ULURP (Uniform Land Use Review Procedure) application for the development rights transfer is anticipated to be certified as complete in the spring. Community Board 2 will schedule a formal public hearing at that time.",
            "lengthSeconds": "1:44:00"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "HyDVkX3slwY",
            "fillerWordCount": {
                "uh": 5,
                "um": 11
            },
            "readTimeFullTranscript": "48 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "building": 61,
                "floor": 31,
                "development": 28,
                "work": 22,
                "motion": 21,
                "property": 18,
                "space": 17,
                "project": 16,
                "housing": 16,
                "rights": 14
            },
            "wordCountSummary": {
                "building": 12,
                "development": 9,
                "space": 9,
                "floor": 9,
                "rights": 6,
                "work": 6,
                "floors": 5,
                "height": 4,
                "benefit": 3,
                "entrances": 3
            },
            "fullTranscript": "Cities transfer of development rights to the private real estate, firm, rap, Ski group who's joining us today, just to check is Ray Lebanon, as he will be preside, he's presenting that the developers portion of the presentation- this is Rob, I, think I saw his name. Yep I need his name razor Claire. He might be stuck on mute, but I see his name there as well. Perfect I'll just continue, so the transaction will produce job generating commercial office in Brooklyn and outer borough business district. So as we look forward to recovery from the current public health crisis, it's really important to plan for jobs that are close to where people live. So EDC began this project by issuing a request for proposals in 2017, where the sale of development rights from two city- owned Lots under the Manhattan Bridge, which the New York City Department of Transportation, currently uses. So the city saw an opportunity to create commercial office space to create jobs in accordance with our New York Works plan, using that development potential that otherwise would not have been able to be used on remarks. The EDC is facilitating this transaction. On behalf of the city, and we reached an agreement with the Raps key group in 2019 for the transfer of approximately a hundred thousand square feet of development rights to rap skis, adjacent parcel, which would be used exclusively for commercial office development because of the transfer of development rights from the city to a private entity. Neil Earp will be required. So the reason why we're coming to speak with you today really to just introduce the project answer any questions. You have and receive your feedback before. That process begins so we're not yet certain when that land use process will resume, but we'll make sure to keep everyone posted. So I'll now turn this presentation over to the developer team. I think it's 4:11 who will discuss the proposed development and I think there's a presentation as well which he can put up on the screen. You Derek, if you are, can not hear you but I'm going to do in the meantime, is I'm going to share the presentation. So just give me one Sec who is speaking, please I'm, sorry! This is rocky Berman! Well P! Women! Great! Thank you for the secretary. Please yes, go ahead: Mr., Cooperman, sorry, I'm! It's telling me I have to download an app and my computer is telling me it will not. Allow me to do that. Just I'm! Sorry guys give me one more second I'm going to try opening this in Firefox. It's telling me that should work now Carrie what, after the present this particular presentation, I'm with it, you can pick up since it's in your neck of the woods in DUMBO I'll give you the first crack at it and any thoughts you guys may have thank you and Karen. While we're waiting for Carrot Feinstein to load the necessary software. Do you want to do a roll call just so we can confirm how many people are here and new I do not or if you'd like I'll. Do it either way? Thank you. I'm ill-, prepared I do not have the list in front of us. Okay, so Carlton we see you Irene. Are you on the pole? Has Rolly you're going to have to unmute to say yes, I hate these things? Do not we all. So you hear me, do you hear me Kaplan over here? You hear me we do except you're, not a committee member, so we do not need to hear from you. Yes, it's the infamous Robert we're going to continue with the roll call of committee members I see you on multiple devices, but I do not hear you Ernest Augustus. Yes, did that sound like Ernest like artists, anyone who has met him now: okay, Esther Blanc! We heard from you earlier very good, Daughtry Carstarphen right here, great Eric's, Bruhl Allen Washington, we heard from earlier Grandview Illinois I have seen your name a few times. Yes, someone by laptop and also cell. Can you hear me we can write as how Brian how old I mean yeah very good. Cirrus gala is in the chat room and we've heard from him: Elizabeth Ginsberg, Karin Johnson, we've seen you and Judy Stanton has a pet emergency: 1:2 3 4:5 6 7:8 9. You now have Quorum Mr., Rubb, Mr., Gordon and Winkie Rob. Are you? Are you ready to present so now? It's telling me this meeting type requires that you become the presenter before sharing so I. Think someone has to make me the presenter. Ok, we can. We can do that Rob. You should have gotten the notification right just now. Ah, here we go, let's see all right slowly, but surely guys up and it just kicked me out. Can you tell there we go okay, you saying Firefox will not allow me to access the screen. Is there anyone on EDC side who offers the presentation that can do this? Well, tell you, what can any one of you on what your intentions are? Hi everybody Sina Roush I'm, going to try to share my screen right now. So if the developer team wants to start speaking, I can try to pull up the presentation, just least get an idea as to what it is. You guys have in mind sure so, I'll start talking and Christina you. Let me know if you have any luck with the screen sharing and then we can have the visual component to this. Can everyone hear me? Yes, okay, great so this is this is Rob Huberman I'm at Erich, Von, Manstein, Ray may or may not be on here, but he's also with Herrick and part of the project team. As Christina was describing earlier. We have the property here at 69, Adams Street, which is under the Brooklyn Bridge and is generally bound by Adams Street, Front, Street, Pearl, Street and York Street. We have been working with EDC and again, as Christina said into 2017, there was an RFP issued which was designated to the Raske group for the transfer of about 98 thousand square feet of development rights for office use. Only so that's what we're here for the action that we're seeking is approval of the disposition of that floor area, the building itself, which I'd love to show you, but if I can't I will describe to you it's a twenty six story: building with retail on the cellar floor lobby space on the first floor, 90 spaces of for parking on the second floor, but there ninth floors would be for the commercial office use which again, which is what the development rights would be used for. The tenth and eleventh floors would be a unique open space for recreation for the residential units, which would be located on the 12th or 26th floors. Above so, the building in total would have about 250,000 square feet of floor area again ninety- eight thousand that would be from the office. The rest would be from residential, that's what we're seeking from City Planning. If this were by comparison and as the right development, we would have the same amount of residential floor area and the building would essentially be the same height as we're proposing right now. So this really all is kind of focusing on the office component. I see the PowerPoint I see I, see remnants of the PowerPoint in the background of what I'm looking at, but that's the general gist of it. Do you mind if I ask a question? Go ahead. Tell me so you said as of right: it would have the same height and the same residential I do not understand sure so the EDC or anyone else feel free to chime in whenever, but so the we're talking about is only with regard you. Can you hear me now? Well, there we go: that's real Evan, yes, what a pain in the neck, I hope you're, not talking about me all right, I'm, sorry, I do not know who took me a while to get on and get on this website. So I'm, not sure where we are in the presentation. Rob, you can continue sure yeah I mean just answer the question that the residential floor area is unaffected by it by the land- use actions we're seeking here the disposition, the residential floor areas, the residential floor area. The office is what would be coming in through the city approval, so the height of the building may be a little bit skinnier in the as of right scenario, but it would have the same amount of residential floor area and the same height but you're, putting in how many floors that you're putting in six floors of commercial office. So as of right, what is in those what would occupy this Explorer's residential, the built? The building just gets a little thicker. That's all it does not get any higher, so it'll be the same. The same number of floors, but with less floor area. Nine. Something a little ninety eight, ninety nine thousand square feet less because we would not have the office, so the building would be would be a little narrower but the same height. Thank you. Can you go to slide three hi? This is the district office Christina. Would it be possible to click expand screen? Thank you so much. Alright! Well, son yeah slide three okay. This is rain, 11, again, I'm, sorry for joining training late. This shows the site, the property that they're our client owns in Blue. The red line shows the outline of the zoning lot, which includes an hour property plus the city's property that D- O- T. It's assigned to do T. The other property on that block is the beacon which was built some years ago and is also 23. That means 23 stories we're going to be 25. Please, ah, thank you, basically says exactly what I just said what this does. So it gives you the square footage of the various lights. These feedlots will be merged hours and the cities in order to accomplish this and allow the transfer of the development rights, the commercial development rights from the do Te lot to the development site. Next all right. This is the program for our building. As I said 26 stories. The building will have because these the site slopes dramatically from front to York this, the they're. Basically the seller and first floor, our I guess the seller goes underneath the first floor, but on the front Street side, it's open the sellers open up to the second to the floor of the second floor. It's hard to explain, but on the second and the seller and first floors are the lobbies and retail space the entrance to the garage and that's what's on that level, then on the second floor, is the garage for 90 spaces. Third tonight floor are the office spaces 10Th 11th floor are amenity space and mechanical equipment and the 12th to 25th floors are the other residential 225 apartments market rate. The at the street level, as I as I mentioned, are the entrances to the residential portion of the building entrances to the office portion of the building and chooses the garage and street level retail a small amount, something slightly over 700 square feet. Obviously, as part of the zoning all the streets around, the zoning lot will get Street trees if they can't be provided because of fire hydrants or being under the bridge. I think we're obligated to contribute to a street fund. Next here's what the building's going to look like as you can see, the sort of tan lower floors are the office floors and then the sort of inset space between the office and the residential is an amenity space and some mechanical equipment in that area. You can see on the ground floor the retail space the entrance to the to the office unit is at the corner, and the entrance to the residential is a little past, Mid back and beyond. That is the interest of the garage and I think that describes the building. As we said, what would happen and answer that question before you could see how wide the Marshall is? What would what would happen is the building would be the same height except that, basically, this the portion facing the bridge, the one bay of windows down to the ground would be would be eliminated, so it would just be thinner but same height, and it would look similar to the upper floors in this and destroyed that would just continue down to the down to the ground. Next, they, basically, what we've already said is going to be office. Space created from the development rights, which is what EDC in the city, are mandating that it only be used for commercial offices. You know right now that Street and form many years when it was in Watchtower ownership. There was no Street frontages, no transparency, no commercial, so that will change with the new building skree trees, which will be provided, and there are you know, local of W MWBE commitments for hiring fairly straight forward in terms of what we're, what we're seeking what the city is seeking to do in terms of just taking floor area that exists, underneath the bridge which can't really be utilized by the city and allowing it to be utilized for office space within our building within the current zoning envelope and we're ready for questions. Okay, what I do is just I see a lot of questions coming up, given the limitations that we have only one limited to our committee and board members I know Karen, you had I sell you a couple. Your questions come up and then, if you see Cyril and a question as well, so I want to go to Karen and then Sara Karen. You have the first bat right now, looking at Dumbo in general, I do not think that office creation is a community benefit. Forget you're, addressing any of our infrastructure needs as far as transmission schools. Anything else. If it's community as a whole, so any thoughts on that I'm, noting what you said you I can't respond. You believe that the office is not a benefit, so I understand that, because we have so much commercial right now and all I see are people leaving commercial spaces. So we have to accept more density and more people down here without any help of how to bring them in how to keep them happy how to work with the neighborhood there's going to be at least 700 residential units dumped on us and we're getting no help whatsoever with things that actually add to quality of life I'm perfectly happy for a DC if they want to jump in on that yeah. Thank you. I'm trying to unmute tent figure this out are people still seeing the presentation. Yes, I see. Okay, good all right. So, in terms of the office space I mean I would just say that you know the city planning for long- term, job growth and making investments for the city's future. So it's more of a jobs in the economic development play, but I hear your comment. I think there you know there are benefits for the public. You know further than Bob, so the ideas that the developer would create retail space to help further active skate, and if there is no transfer of development rights, the developer would really just build a fully residential so and in they would not be obligated to abide by any of the local hiring probes, including fire NYC in the minority women business. Looking for here is an opportunity to hear your feedback, but initial thoughts. Okay, I think you've had a question. If we can hear you Ciro, can you hear me? Yes, I just had a question about the tenants, go to you in the lobby, the tenants and the commercial uses in the same elevators project. No, not at all, so the rent you're collecting on office is not underwriting the project at all, we're paying for that office floor area. So no, it's not the resident residential. The residential is much more valuable than me than the office, and you can tell me if I'm putting words in your mouth I assume. That's. Why you're not providing any affordability whatsoever? Well, we're not required to and we're not going to provide it. That's correct: okay, Mr. Gordon! Yes! Well, there are some people that might be board members who have raised their hands. We have a caller by the name of John. I do not know. If that's Mr. do we have someone who is Er, NES bite me Mr., Augustus and Miss ally has a question as well. Okay, I guess, give me the net give us the next one. However, you well John. Are you John dude, okay, moving on earnest? Did you have a question Mr. Augustus and Miz Olli? You had a question I. This is a Barbra's all or Gregor I had a quick question. Will any representative who is appearing tonight be of Monday's executive meeting other? There are no plans for anyone from tonight's presentation to be at the executive committee meeting. This item is not the board vote at this time. Oh okay, thank you yeah. This was just an information presentation for the committee for our committee and anybody else who you know is listening. That's all not taking any votes on it at this time. Okay, thanks just for clarification at some point, there will be a Euler application for the disposition of city- owned property. All Euler applications are currently being held in to the coronavirus and the D planning's, not being sure how to handle applications in a virtual environment, and neither am I I seem not to be able to know how to handle it either. But it's we're always happy to see you Ray, because you always bring a sense of humor. These units, rental or Karen go ahead, yeah other units, rentals or condos. At this point, given the environment, I have no idea: okay, Mr. Chair, Final, Bill, flit away nice Peak, Octave, Belt, okay, thank you. So the only reason why we may even see this in front of your lip is because of the city property other than the city property. You have a right to build the way you want to build it otherwise because of the city property part of it. That's why you're coming to Europe and that's the only part that we're going to be discussing star, correct, that's correct! That's correct! That's it's! Whether you want the office space incorporated into this building or whether it'll just be a straight residential building and obviously the city gets, we buy those development right from the city, so the city gets a benefit, a cash benefit and we end up building a little a little more square footage with office space. Basically, a building is going up is just what type of buildings going up it's when it's, whether it's strip yeah it's whether it's just pure residential or a mixed- use building, that's correct! Thank you. 90 spaces are like trying to I believe they were mixture. Rob. Do you know the answer to Mr. Gordon? This is Mr. Washington yeah, okay, good, do not want to take too much time, but I echo miss Johnson's concerns about the infrastructure piece. You know, I know we're just talking about additional commercial density but kind of transit and other infrastructure issues and do not know and I. Just think that should be needed and just for clarification, you know we'll be able to get more into the term sheet when this matter comes through. You agenda that we have I. Thank the presentation. Applications for people who are not speaking if you could just put yourselves on Mute, there's someone right now. It's got a lot of background. It makes it really difficult for us all to hear. Thank you. Yes, I will take that. So that was one of the things that we're going to state at the beginning and I guess well, at this time, I'm still formally starting the meeting and thank everybody for I say coming but being on this. You know conference thing and you are being recorded, so that should make like, let that be known, that everybody will be recorded in addition to Karen Johnson, who will be taking the minutes as well she's doing the best she can on these very tough circumstances. Okay, let's get started we'll just we do I. Think everybody's, seeing the agenda I need a couple of people just to give us a motion to approve the agenda motion to approve Bilson or anybody else. A second serious, caller, okay, I have any objections to the agenda. The agenda, if not I'll, say thank you. We've accepted instead of you doing to you. I will just say. Thank you. Move on okay, laughs next is the 110 Bridge Street, the landmark Preservation Commission application for certificate of appropriateness and the application is to modify the opening at the I just lost at the first floor on the south a secondary floor and to replace to existing stairs and with new stairs, and the accessibility will be accessibility, installing a new fence for the food court. Compliance in the and to exist enter to the existing. What I have here and going on to the basement level and to install new? Oh yes, new canopies at the entranceway, so whoever is presenting on 110 Bridge Street, please step up hi, I'm, Steven, Choi I'm the project architect for this project for John, PT, architects. Sure Karen! Do you have a thing, Mr., Choy right? Okay, can you see my screen? Yes, I see it okay, so the building is 110 Bridge Street. It's also known as the Thompson meter company building and later the New York Eskimo Pie corporation building. You said our application is for work at the first floor of the South facade off of Ridge Street, and work includes modifications to the entrances replacement of two existing stairs, replacing them with new stairs and an accessibility platform lifts installing new canopies over the redesigned entrances and installing a safety railing for an exterior stair to the Sun, so the building is located in DUMBO. This is the tax block here. This is the property lock. All of this surrounding area is public space, and this is a subway station here and the Brooklyn- Queens expressway, going over the lock like I, said the application is for work on the South facade. This is the area of work here. These are just some historic photos of the building. The building was built in 1908 and 1909, designed by Luis Jihad was designed as a designated as an individual landmark in 2004. The building is constructed of reinforced concrete and the facades are characterized by these large four- story. Arcades and the arcades are divided by the spandrels covered in this Herringbone pattern. Tapestry brickwork and the window base throughout have this tripartite design/, concrete mullions and a lot of the windows are still the original steel frames, horizontal pivot windows that have this industrial character to them. So this is. This is looking at the corner of bridge in York Street, and then this is the facade that we have the proposed work on the south side, and then this is an image of the corner of the South facade and the abridge tree facade from bridge from so these are just some current photos. This is the South facade, looking acrosss the park. This is the West area of work, so the building is historically a manufacturing building. The old C of a certificate of occupancy was for manufacturing use throughout the four floors. Currently, the first floor is to remain manufacturing. The second and third floors are being converted to a school use and then the fourth floor has existing residential use. So this is currently a loading dock for the manufacturing on the first floor and entrance to that loading dock. Our proposal is to convert this to an elevator lobby for the school and residential use, and then this is the area where the Exterior stair is that's going to have that safety railing, and then this is a proposed. This is an existing entrance for the first learn manufacturing. That's also going to be replaced. So here's just an overview of the facade like I said this is the existing loading dock area, the existing manufacturing entrance and this Exterior stair down to the cellar. That's going to have a fence here, I'm. So here's that proposed fence the new stair on the manufacturing side and you stay on this side and then yeah canopy, that's going to be installed, bud and then, like I, said we're. Also installing a handicapped accessibility lift that's required for code compliance, so you get to the elevator lobby, here's just some renderings of the existing and proposed so all of the materials. This is going to be a masonry wall finished with stucco and that's going to match the existing stucco color of the building facade. All of the metal work for the fence for the steel for the canopy and the new entrances are going to match the existing window colors. So this is. This is just the close- up view of the conversion of the loading dock to the lobby. So you can see this is the existing loading dock. This rolling gate is, can get removed. This entrance to the stairs going to be replaced. This entrance is going to be replaced. This there gets replaced, and so these are all the new additions. This is the ad a lift, as I said, so the we are moving the loading dock for the manufacturing to another location, but one of the residential tenants still requires some loading use. So this door is actually just going to be a folding glass wall. That's going to be open about, so they can continue to use that, for loading, I mean here's an elevation of those additions, so you can see the new entrance here, a tripartite folding wall. This is a solid masonry wall with the stucco finish and a stone coping the new and then just showing the material finishes to match the existing conditions of its ascent and here's just a couple sections. So you can see all of the handicap lifts and the steps are all hidden behind this masonry wall. So none of that is in sight, and then this is the steel. The new canopy, which is made of steel and glass and, like I, said the steel is to be painted to match the frames for the facade, just a detail with that last folding wall. Here's are some images again of that area and I'm. Moving on to the entrance for the manufacturing side, this their existing metal stairs getting replaced and it should not have the same masonry wall with the stucco finishing the stone coping to match the other side, and it's going to have the same. Canopy, steel and glass canopy match and here's just some images of that and then, like I, said, there's an existing stair exterior stair, going down to the cellar so we're proposing and safety railing. That's required to be installed and that's everything all right, Q Karen I promise that you have up next. Since again, it's a Dumbo building and what you think thank you. This building is amazing. I feel like you're missing a lot of opportunities. I just I. Do not I. Do not know why you're not considering blowing out the windows to make them more historically accurate, like they were in the first text. Photo you showed the stucco staircase is very imposing I. It's just I, really look how beautiful that building is and I just do not think you're really I mean I, know you're complying to a DA and you're, making it more accessible, but it's really not very exciting or inspiring, given the beauty of the building, but you do not have any objections. First time, I've seen it so I mean I, can't object to getting people in and out of it. I just would have liked to have seen a little more effort paid to the historic structure itself, instead of just tacking on a few things. You know. That's all right, any other committee members have any comments. I had a few questions that I typed at 0x0 I wanted to ask a question: why a school and a manufacturing component together I can understand the combination. That's why I'm asking I just understand that right. This was the lieutenant that the owner ended up getting and it is allowed by the zoning. So just and capes are on the building correct and that's okay, it's proper! That's as far as that goes when as school. Yes, the zoning allows for a suit. This is a private schools right, it's a private nursing school, yes Oh, so how many residential apartments there are for residential apartments on the top and they have a separate entrance from school. The manufacturing I understand. Thank you. Any other committee members, all right hearing, none I'll talk a motion to approve in a second I'll start it off I move to approve a second esta blunt. Can you hear me yeah? We have yester, so we have them both to approve and Esther's move for a second any other comments on them. Motion. Okay, now what we're going to do it's a little bit different. We're going to do is like a roll call, since we can't see each other's hands very well, so Aaron, when you, okay, whenever you, when you're ready I, you know start giving up the reading out the names, Karen, you're, muted, okay, sorry, I'm, not sure I have a consist of. Who is here but Mr. Gordon? Would you like me to do the roll call? Thank you that would be awesome. Okay blow, even one second Steven. Thank you so much. If you could please stop sharing screen throughout the desert. Thank You Mr. Gordon. How do you vote? Yes, miss Jana, I, believe I heard a distant yes, miss Ollie. Are you on the call Mr. Augustus Miss Blanc mister? Are you muted? Yes, can you hear me? Yes, thank you Audrey no Brian L, yes, Eric Spruill did you join us Mr. Allen Wanna. Do it here yeah we're about to get to you Sir Mr. Washington, yes, Mr., Doo, I'm glad you were able to join us. How do you vote I've been texting you since the beginning of the meeting I've just been able to get in I will explain: Mr. Flournoy, Oh Mr. Schuyler, no miss Ginsburg. Did you join us, miss Johnson? How do you vote? No mistakin. Are you back from the vet? The motion is one two three four five in favor for opposed in an abstention one, two, three, four, five, six, seven, eight nine ten. The motion does not pass by a vote of five to four to one. Would you like to entertain a new motion? Mr. Gordon, all right, any other member. Has a motion. I have a motion to disapprove the application. This is John. Do second I. Second, starting at the top again Mr. Gordon. No miss Jana. Was that a yes yeah? Thank you, Miss blah! No miss cursed, often Daughtry, you vote yeah Mr. Howell abstain, Mr. Washington, yes, Mr.! Do ya, Mr. Flournoy built that yes, Mr. Schuyler, yes, miss Johnson, yes, seven votes in favor. To knows one abstention. The motion to recommend disapproval passes. Okay. Thank you. We'll move on to the next item. 69 Green Street, which is a petition for replicable consent, which means basically that if you know the property owner wishes to do something on what we call the public highway or in this case the walkway or a sidewalk and you're doing a stupe work, basically coming from their building. The petition is to construct and the public right- of- way, a stoop for before the bill from the first floor to the to the street level and there'll also be some work doing up what is looking here. The you know that we work with them blue, stone and for part of the work at the sidewalk and he'll also be a box for the garbage to be placed in as well as some kind of work on the fence and fencing. So we've worked basically on the sidewalk. It's all going on to what is the city's or our property and could be it could be revoked, but right now they're asking for the city to allow the work to the public thoroughfare for the speed and whoever is ready. Please come up and present: oh yes, hi! My name is Kevin Taylor from Ericsophie and our peanuts. Well, let me share my screen real quick one. Second, no it's this one there it is so this is a project first consent for 69 green located between Adeline and Clinton Street Fort Greene, a quick background on the project. Right now. The project is basically the vacant lot, which is this part right here. If you can see where I'm pointing on the screen build, there was originally building from the 1860s there, but it was torn down in 2015 and with background on things. It was torn down by a previous owner and they had gotten a partition to be built, the building in 2015 by landmarks, but then they kind of decided to sell the property so we've just are. We were working with landmarks to rebuild the building, as per as it was approved by landmarks and as presented to you in thousand fifteen, but I as of what we're here today is we're seeking that cent, which would be the stoop area of paving others area, that's planted and a stair down to the cellar. So you can see the existing condition of the neighboring building at sixty seven green and kind of the other spaces within the zone. You can all right, oh there's, so this is the existing condition between 67, green and 71 green. Both of them were built with 67 Green was actually built in 2000 well and then 60 I mean 60, not 67. Green was built in 2012 in 67 greens. It's basically almost complete. Both of them had kind of gotten consent, we're trying to and the neighborhood Ln this project Austin. This would be. The proposed with us, like should be the stoop up to the first floor. Small few steps down to the in level apartment yeah, another stair down to the cellar, and this would be a painting area adhere which hide the garbage cans from the residence. This is awesome, Oh background. The building is also a two family residence with the primary residence living on the upper floors and a lower floor being a rental unit. You can kind of see the difference between existing proposed and for this fence. This is actually matching the original eighteen sixties fence from landmarks. So we want over them have recreate that as part of the project as well. Oops, sorry, so this is kind of showing of section, so you can kind of see more. This is the upper story can see beyond it's a more modernist railing on 71, but we are going back and actually matching that eighteen sixties railings on ours for the stoop and you can kind of see where the step back and then this is actually a stair going all the way countless. This is kind of sections through different other areas like the area way and kind of through the cellar and presentation is to this. You know you know I'm ready for questions. Thank you. Any questions from committee members, Board members, yes Cyril's here, did they did you get all your neighbors to the delete this? If I'm for the chairman did we get any sort of letters or anything from the neighbors as far as that, he we do the requirements that we asked when someone does renovation I did not I do not know. Rob has received if the office has received it Mr. Scalli. This is not a Landmarks Preservation. Commission application, and no maybe I, was overly literal, but I did not instruct the applicants attorney to contact the neighbors. The building, as the presenter noted, is under construction. The application before you tonight is for the work. That's in the public right away, a rock yeah project. Proof by landmarks, follow the procedure that we had requested. Even if it's that kind of a situation, it would be appropriate, possibly to just discuss that. Have the neighbors at least be aware of it. That's all around it. That's on me, yes, Mr. Augustus resented is basically a restoration of that site. The stupid come to home, had a consent case coming down to the to the street and that the yard gate being restored. Basically he's basically just copying the building. Over again this building would Tom was a now he was, he had bought out landmark for the basin and I've been try to save the building, but you had to take it down, but it's just say it's a brownstone, but the stuff did come out to be site for the sidewalk I. Remember that distinctly fled, but in that house so early question. My question is: there are houses on either side of this proposed application? Do they have the same treatment of the revocable sidewalk, so new construction I think the new one that's been built. B1 desiccation towards the building built, 71 Green had gotten vocal consent within the last three years and the new ones, and then 69, green or 67 green and back in 2012 hello. This is Bill. Flynn I got a comment. Please go ahead, Bill, okay, so what we're looking at is LPC's already approved the work that has been proposed. What we're looking at right now is just to give them the revocable trust. Revocable trust. That's also been sent. Consent. Okay, thank you very much. What we're looking at basically she's, just what the revocable consent that you've gotten from both of your neighboring tenants or buildings, the crest? Yes, so chemic, emotion, I, have no problem like to make a motion to approve the application and I could second it? Yes, okay, we have. You can pick one okay, we have a motion to approve and then seconded any further comments. Questions hearing, none, okay, no! They offered a comment. Hmm I believe Mr. Du has a comment: Mr. Gordon John, your mic is muted. There we go that better, now, you're good to go. My question: is this revocable consent for a sidewalk that will extend further than the adjacent buildings on either side? No, it's matching the adjacent building. I'll say it's creating what had been there in the original 1860's building. I got that piece. Yes, okay, my question! Thank you! A missile Lee. Do you have a question? Yes, I'm, not sure. If you heard me when I said yes for the previous vote was Mike, were you able to hear me? I was not. That was on the motion to disapprove 110. No, the first motion to approve not a motion to approve, because I did not hear you call back my name okay, so you voted in favor of them. Yes, all right, I was not counted or you did. You are not counted. No, but let's do ya Alex, but I deal with. Let Z look green Avenue first right and if we're ready for a vote, Mr. Gordon I will read the names I'm ready and how do you vote so? Yes, miss Janner, MS ollie, yes, Mr. Justice, yes, miss Blanc, yes to approve-, yeah, Mr., Howell, I'm. Sorry I did not catch that yeah. That's thank you! Sir Mr. Washington! Yes, Mr.! Do yes, Mr. Flournoy, yes, Mr., Schuyler, yes, miss Johnson was that I guess in an echo Mr. Gordon. The motion passes unanimously. Thank you. Thank you. I just want to adjust. Mr. Lee says it her vote. She voted in the very first motion, but I think on this instance, I think we'll let the decision that was made by the committee stand, because the sympathy of the committee, or at least I would say the sent to the committee is that they did not like what was presented on 110, Bridge and I. Think what I will do at this point is just leave it at that I think it's going to go over to executive committee and I guess connect. Your committee can also discuss this as well. I like to continue with it Mr. Gordon, with all due respect, I. Think it's unfair that my vote is not counted. Was it going to be a tie, as I think I said? If I recall, I do not have the numbers in front of me, but I think it was very Scratchy. I could not hear and then I did not hear Mr. Paris club back my name yeah I think it was five four one. Let's say it was the first motion for 110 we offer he call correctly is five for one. If you add you, we would have what would it be it's for one everything would be six for one, in which case the motion would have to be fortified. Yes, may I make a comment. This is Bill flowing. Yes, traditionally the way I understand it, because these are kind of this new system is kind of different new if a votes being taken, I step out of the room, okay and then step back in the room after the votes taken. Okay, my vote does not count because I was not present. I was present, Mr. Flournoy answered, but what I'm stating is that no one heard you to overturn a factually technique overturning a vote. He did not. He called me I answered yeah I understand, but what I'm just saying is because of the technology. This might be something we have to look at later on a housekeeper so because we do not acknowledge you should give me the benefit of the doubt and have my body mounted I think we still consider this later on. We, your vote, we understand, will let that we vote it. We understand your vote did not count. We'll take a look at this later on. Let's move on with the committee meeting, we understand what your vote was. Thank you yes. Well, it was going to make a tie. I understand a bat abandoning my vote, but my vote is going to make a difference to prove we're in abandoning it I'm saying we'll discuss it later: okay, hi, this is Jessica Thurston. Just really quick, I think what we will discuss this at the executive committee meeting next week, but I do tend to agree. Mr., Flynn I. Will this? Yes, because the final decision will be made by the executive committee, I'll bring it up at the executive committee that there was this technological problem you just which might make a difference, and anyway the executive committee will ultimately decide if what you know what the what will be the position of the board exactly the committee could change the decision that was reached tonight by this committee. It's within their power to do so. I'll present it again to the executive committee and the executive committee will decide if they want to approve the presentation or go along with the guess. What second motion you having done that we'll move on to? We already did the presentation on Adams Street, so the next thing coming up will be the minutes from February and I saw the minutes and I think the minutes were very well done by Karen, so I'll. This acts for motion each prove in a second for the minutes by Katherine. Unless there's any Corrections that have to be made so moved John. Do we have a second I'll? Second, it all right. Are there any objections to the minutes? No Corrections have to be made to the minutes of none. Thank you. Oh wait a moment just to be sure. Okay, thank you. Next is the chairs report. I have three quick items just to inform people. The first is on 265 Front Street, which we previously did at a it's one of our in- person meetings. Just to let you know that the bar o president will be now doing their part of the Euler for 265 Front Street in vinegar, Hill, and that's going to be coming up on the 20 on the 30th of June at 6:00 p.m. again online, the bar President does have did send out a newsletter with links so for people or anyone who's interested in participating in that part of the ulid process. You might want to bring it up or I guess contact somehow contact the bar president's office, but there was a newsletter that was sent out by the borough president with the links to the meeting. Just like the we sent up the memory information on linking to this meeting. Speaking of you look, my second thing is yes, 1:30 St. Felix Street. Now that the Executive Committee has made the decision to approve the presentation for the change of eyes has changed, but its certificate and landmark preservation, certificate of appropriateness for 130, st. Felix Street. Some of you may be aware of it or not, but well it is a vacant lot. That's right, nuts to the Williamsburg, Savings Bank, building right near the Atlantic terminal, and this is a proposal by both Brooklyn music school and Gotham developers to construct a new 24 storey building at that site, which would benefit the Brooklyn music school and also have rentals and generate income. The executive committee approved it the this is again for the Landmarks Preservation Commission certificate of appropriateness. Now what will be coming up at a later time in the future will be a Euler and I just wanted to state that when the You Lib comes, I will tell you that they will be probable opposition. You know, there's no opposition to the Brooklyn music schools word or the desire to have this. They, this work being done for the building. The property opposition is going to be coming from people who live in the or next to the Williamsburg, Savings Bank, building and I. Think the other building I think that's the Ashland building as well and they're concerned about the height the 21st storey height ever all of coming from the Brooklyn music school Carlton, yeah I do not know if you're aware, or about Saint Felix back in the 90s that whole street collapsed. Yes, how do they say because it's nothing but subway tunnels and separate lines, but that's a fact. I do not know if people on the board is a report and we start drilling and doing foundation work. One that block the history of you know collapsed. Tunnels is maybe a bit of a problem. Joe just want to bring this to your attention. This all yeah I, know I, agree, I mean yeah. There's the subway tunnels, it I know the BMT part of it goes down Aisling and then over default. You know going towards the de callable station, so it is a little tricky around there, as well as the higher teeth portion as well. It's a lot of tunneling under that right by that intersection. So it's going to be it'll be interesting. Just also, you may want to know that A1 Flatbush Avenue, which is a new building right by Flatbush in Fulton, has been sold to Goldman Sachs for fifty seven million dollars and just wanted to throw that out there all right. Having done that, we have the open session for people who wish to speak. If there are people was just busy Mr. Gordon someone named Henry has had his hand up for quite a long time, and also someone named Eve, oh and I do not know whether it is the next you're not up in Ms. Olli has a hand raised as well go to Mythili. First, since she's a committee member my hand, my hand raised, was to bring attention to the issue we discuss. I should have written it down. We will follow up on that. Thank you for bringing that to our attention. Okay, thank you. Okay, all right! So I guess, Henry! Okay! Well and we'll stick our two- minute rule on this. So you listen go ahead. Mr. Gulen I do have a comment after you finish, the public set well I'll. Tell you what why do not you do it right-, no John? Okay. We have submitted a request for the city to study lots of the infrastructure around all of these developments. This is our opportunity with this building to get the city involved in structuring and giving us some validation of the plumbing, the electric all the things that go into these buildings that we have never gotten a report on the infrastructure that supports all of these buildings, whether it's plumbing or whatever. We need to begin that process. This building adjacent to the Williamsburg Savings Bank is a wonderful opportunity for us to begin. Looking at the infrastructure, there has to be city agencies that are familiar with this and Mr. Augustus is correct. Ashland place was every posad collapsed and had to the old somehow that cracks and for years you had to walk on planks to walk down a strong place while they rebuilt the facade on every building. Supposedly, that block was on an empty cavern tunnel that had begun to collapse. So we have not gotten any reports on anything subsequent to the repair of that it's time for us to begin. Looking at that infrastructure, I think yes, just to be careful, I think the this, the BMT subway tunnel and somebody correct me. If I'm wrong does go down parts below she goes down Ashland, he St. the collapses took place if I again correct, please correct me was on St. Felix itself and I. Think that's what you had all those you know all those construction things that was going on for the longest time so but you're right in general is that there is a concern about I. Think it's a legitimate concern is to if we're going, to build another large structure at that site that you know we should be. We should be assured that this is there's not going to cause any damage. You know call-, the other thing is I. Do not know. If those hormone is our this possible development, no I mean I'm quite sure that we sensed a pandemic. You know we have not had any face- to- face communication with the home owners of those brownstone or townhouse. You know I concur. They are aware of the history, but not be aware of this proposed project. You know they say, but a t30 story. Project I mean it's just 24 will be 24 but yeah right now. Well, the people, the larger buildings seem to know. So the word is out and it's an interesting situation, because almost everybody who's come to her. Who came to us even with concerns all said. Yes, we loved the Brooklyn music school and we want to support it. I mean the income that would muscle income will be derived from this transaction. I guess and development would be going to the Brooklyn music school. You know, yeah I know he's experienced, be getting us additional space and additional places for the work that they were doing and the kids to learn music. So there's nothing that it sound like it's not only in the Brooklyn music school does that play it's the handsome place, methodist church that may come into play at the same time as I'm vaguely aware and Audrina classical could tell you because he's a member of that church, how you have predatory developers, lusting after property. Now, no and I do not know how that's going to play out that whole corner is in play. You know so. Yeah I do not know why the Buddhist school I mean I'm not on their board, but if there's an opportunity for them to at least a church property for music Express- and you know- maybe there's going to probably come up as part of the ultimate. The next step will be the Euler band. That's going to be part of it and that's the things that they're going to they're going to have to wear a dress. I know that I know that the church were concerned about there's a beautiful stained glass in the sanctuary yeah. What I like to do is move on to the pharmacy nom- a- nom non- committee members voice in the open, so I'd like to go on I guess: Rob had lined up a person named Henry I believe that Henry has left the call but Mr Strannix. Do you still have a question there? You go yes and give us you a complete name. My name is Brandon pointed out. Even the community benefit is super unclear. So you have to absolutely and then lastly, the building shape with and without this additional night hypnosis, where it's very ornate the developers are glossing over. You know a large stock differences just obviously seen their interest, but it's going to be the same with them without the space. Absolutely do not believe that to our request to the next time is every building to show more detail, there's some sort of renderings or floor class of like what the building looks like before and whatever look like. Actually, though, understand what the magnitude of the difference would be at the time. Thank you, Mrs. Janek, yeah I will say definitely on the Street one New York, Street, F train station does concerned me a lot also. Sometimes I do visit over that way and I come climbing out of that hilly ramp going up, especially around let's say, 6:00 p.m. and it's not only more difficult when you're climbing out when there's almost seems like to be a thousand people coming down the ramp at the same time, and it's a it is it's that's always been something that I know I personally have been concerned about. So I am agreeing with you on that point as well. That's something had weird the York Street Station is something that has to be really looked at by the powers that be given its current now right now. There is not as much use of it there's not as much use of the subways, but at some point that's going to come back and we have a look at. Are there any other open, stash people who wish to speak for a couple minutes at the open session? You have anybody else wrong. You I see Sandeep I, see a Sandeep Chawla says he has his hand up. That's in the chat section. Yes, this is Sandeep travela. Okay, you have two minutes great I'm, a resident of the Dumbo neighborhood, and thank you for allowing me to speak this evening. I would echo some of the points that were made by my the prior speaker. Evo I would say first and foremost, as someone you know, you know, traditional non Covid-19 environment takes the F train every day. I think it presents. You know a real risk to the community, as it is currently mention. The substantial fire hazard and as it's currently configured it does not account for the substantial development which is already taking place and in knock on wood in a post, COBIT environment. What we would likely see is a substantial uptick in the utilization of the F train, which would only increase the risk that already exists. So that would be my first point. My second point is I would request that the builders response, we'll do a study of the impact on traffic in the Dumbo neighborhood, as the neighborhood has grown they've been large numbers of young children, particularly drawn by Brooklyn Bridge Park in the area. The added traffic that would come not only from the increased residential utilization of the neighborhood, but also the commercial specifically, is very worrying to me as the parent of two young children, the three and a five- year- old and the risk that opposes poses to them. Okay, huh! Yes, thank you, sorry, but miss Jemima. Okay, thank you very much for your contribution. August you've. Nor would like to speak as well. Mr. Gordon! You have two minutes. You Oh mister. You've know you are muted August you're. Currently there you go August, go ahead and speak, please: okay, we can see it August. We can see that your and now mister you blur is, he says: I would like to ask about the usage of the D- O- T land under the bridge. Not the presenter I am the district manager for Community Board- I work for the board, but I am familiar with the project. Do t would continue to utilize the space? What the Economic Development Corporation proposes is to sell most of the development rights, which are development rights that are not useable on because there's a bridge overhead, so most of the development rights to the adjacent property of that 69 Adams Street and retain a small amount of development rights in case D- O- T wanted to construct a shop of some sort at some time in the future. I hope that answers the question and Mister you've NAR thanks us in the chat room. Ok I, see that also any others I think we're up we're done. Mr.! Gordon! Okay! Thank you. If the last item is other business, Mr. Gordon. Yes, do you hear me? Yes, under other business with all that is happening with the Co vid and this mask I did it for folk from New York, whether temporary or permanent and alike, and all this construction that has taken place and the construction that is currently scheduled, including what we proposed to vote on tonight. We need to begin to take a look at the impact on all the development, but specifically the residential development. My guess is that the partnership might have some of this information on what is happening in all these buildings, the occupancy the impacts, what their projections are going forward so, rather than it catch up with us. If we can take a look at it and have a ongoing discussion about what is happening, downtown Brooklyn as a matter of fact, I did bring that up. At the exact meeting we were discussing the property and the discussion I mentioned the fact that there probably will be pressure on housing because of the exodus, and we may actually see affordable housing because in a truly affordable housing. So yeah I think that is a definite issue and I did bring that up at the exact meaning already: okay, well yeah, my I was going to even take the you're coming early from the other way. It is that the as you can see, we are still building a lot of high- end housing and a lot of high- end retail. But it's mainly the high- end. Housing is being still either being built at this time or is going to be proposed and I think we should consider. Not only is you know, is this stuff going to be occupied? Will this you know be of any use if people start going elsewhere, who would have taken, let's say occupancy, either buying or renting high- end housing high- end retail that the people who are doing developments in arm area, especially along Flatbush Avenue? Well, they will that continue. I mean that's something that I have I've noticed. You know here in there one person here, one person there, you know loading up the U- Haul. You know we've seen older I, think they'll all the store, all the stories of people who gone out. Let's say to their second home: some people have just left all together because of the uncertainty of things going on at this time. So I think most of us are going to be around here for the foreseeable future. I do not think any of us have any second homes out in the East End of Long Island, so I think you know we'll be he I think most of us will be here, but there is some I think there's a big area of concern on that, not something that I have been concerned. Mr. Chairman will see Mr. Chairman zero, getting back to discussing the affordable housing issue. I think I may be mistaken, but bill had, although quite a few months ago, talked about some sort of in- depth, study on affordable housing and the way it has been proportioned I do not know. If I have my facts together, but I remember there was discussion about it and how it could be much more equalized. It seems to be that is that any discussion there bill is that something that is happening? Are we talking about that anymore? Well, Cyril. My whole point: net. I was that this will all may happen organically without us having to do any input whatsoever. That's what I just mentioned. That's what I was trying to say. He says Reds may come down organically. Just simply because of the points who are just making, which is there's an exodus. Yeah I know that I just would love to have stuff to see something in an ordinance or documented to make sure you know we were going to live through a whole series of moving out moving in with many of us have seen it happen before, and I just was wondering if they could be put in law because, as I understand it, I could be totally wrong. We look at Westchester, County and lump it into the city. I think that's what you had mentioned and I was wondering is that going to still continue issued correct me if I'm wrong Robert, that has to be done in Albany. We can't do it in the city or as far as doing anything with the AMI. That has to be something to ask. You moved at the open and that's my point. Maybe the committee should be thinking about exactly hey, I know what it is. I'm just I think I got the point that it's a federal level. That does not mean that we should not put a voice in and try it in this day of renewal and looking at what's going on today, it may be something for the community Board to look at again and maybe voice its opinion. I know it's just an opinion, but something to put on paper that we would like to see that changed. That's all I'm not saying we're voting on it, or that is just something that I think should be acknowledged and how we are looking at everything rightfully. So we should look at that again, and maybe it is the federal level, but maybe our federal representatives should go ahead and make the change just add to that, because that's a very good point. We talked about that a lot. The other piece to build on that is that the city is working on some plan that would accommodate any Euler have to accommodate more than affordable housing, the homeless population. So if you go into the subways- and you know that they closed the subways- and you know supposedly got all those homeless folk out and put them in programs, I- think three percent of the homeless folk that have been instructed have actually found housing so they're right back in the same position, they were pre Kovach, pre- sub wait, shut down and they're going to open up the subways back to 24 hours, so this homeless issue, which, frankly, we helped to create when we up zoned, downtown Brooklyn thinking we were going to get jumped and we wound up getting all housing and market rate. Housing did not reflect the market that was displaced from downtown Brooklyn anymore. To begin to address, Pat McGrath corrected okay: this is Bill flittle again during I was at the Tsiolis bid the other day, and one of the things that was discussed was some of the residential housing in sale in the bids are actually now have the homeless in their facilities. Okay, so some of the homeless have been moved in some of the bacon facilities in the area already in the bid. Well, I think that's a good point, though. Is there any way we can get specifics on where they are and how many have been accommodated? We should probably find out the information. I do not know if it's a permanent situation or just a temporary situation, because but I can look into it. You know we have all kinds of temporary conditions, but the problem is a permanent problem, so it just gets to my point that I know the discussion has been. We've been talking about the quite a while night and I applaud bill for getting involved and trying to make something out of it. But I still feel that in this time we should be looking at renewing or reviewing the situation of affordable housing and I do not understand it. For my own personal level why Westchester can still be in there and our representatives have not made something of it. That's all I can say: I do not know if we can do anything about it, but I think is something that's very interesting to me to see how that could be piled in Mr. Goos point about action items, I wonder if what one thing we could do is at least try to document the proposed project, what they are, what they're proposing, whether it's inaudible, what kind of affordability it is whether it includes the homeless set- aside, which is what was referred to earlier, and we can. If we can do that, then the next question would be. How can we leverage those proposals and the people who are asking us for things to do better, so I think maybe an action item might be I mean this is kind of a big action item but to try to start to document all the applications that are in our community board and we get those notifications from the do via or we did all the permit applications that are filed within our district. The question is: can we take it to the next level to better understand what those permit applications are proposing and then try to then? Thirdly, try to analyze what the proposal, what we can do to try to make it better. Of course the trick is, we can only do what's brought to us anything, of course, as of right, we do not really get our. We can't get our hands on it. That's a tricky part. We do right now. You said the one on St. Felix Street, it's going to be coming up to us eventually and just I do not know if Rob knows 6:25 Fulton Street has been lurking in the background for quite some time. I do not know if all along they are be curious to see how you lips are coming along in this new post, Cove, a environment they'd only just a Cove it, but the regular protests. That's the number of people have left because of the combination of the two, so I think it's you know that comes along Nicole today. You know this may be academic exercise, but all these housing construction are actually tied to the market as I understand we're heading into a recession. You know we do not know development, it starts and stop returns on no market conditions whose their lending who's borrowing who's planning. You know that's the big Bible for downtown Brooklyn, the horses out of the barn. You know the 2004 rezoning and that just forget downtown Brooklyn Bay. Now being our markets been driven or luxury housing development, here's no way in hell, you're, going to get a proper housing downtown Brooklyn in any way shape or form. It's a done deal I mean you look at it like. Look like the new when blight could be as nothing aesthetically pleasing but 600 by Fulton, Street I do not know where they're at because of this economy. People are unemployed, jobs are being lost now. All I know is that retail and service does not pay the rent, not in New York City. So all this I mean we're dis speculating, so things may be put on hold at this point. I see em spaces. The constructions again have snow stopped. Know until they suggest a market, you know what about housing was will be built in Atlantic terminal. No, then, that stop started and that pushed out to 2025 ai, not there for long now, so I do not know what we're going to do on this. Well. I agree that we do not know what we're going to do, but we do not have basic informations on everything that is going on. How many have we gotten? How many are in the work? How many on the drawing board are they financed? And what so? We need to get a handle on this as it is happening, we need to be able to track what is happening in downtown Brooklyn. We currently do not have a mechanism for tracking anything. We deal with these units on a one- to- one basis. We do not have a big picture, we need to get a big picture and then we need to at some point consider getting our elected officials involved, but we got to know what it is that we want to ask them to do. I do not think we know any of that. Yet I will say that over by my way, I- let's say by round juniors. There is a lot they've resumed a lot of work and say new. The building that went up that next to the old time savings bank building that work is resumed there they're constructing, like crazy and I, do not know how many people are aware that these are huge building right behind Long Island University took part of the athletic field and it's gone up and it's going up like crazy right now. So there is activity. What will happen once these buildings are completed and they open for business and open to try to get people to come and use them to live in them or work in them or whatever? That is the another question. I think we've done a good job unless there is really some other point, I'd like to thank everybody and ask for motion to Adjourn I. Think everybody's, a good job I get a half the census. I just learned that since we have the an executive committee on meeting on Monday I did not I was not aware of it, but now I am so I guess so I'll bring when I have to present for the situation on the 110 Ridge I will bring that up and I'll thank Karen all the work that she's done on this as well. Not everyone! Yes, because thank you, oh I, take it! There is no objection to the yes all right, I! Think I. Thank everybody again. I thank Karen Johnson for the work, so I guess Karen you try to get. You know the minutes to Rob I guess by was it Monday by Monday afternoon at the latest. Anybody I have the vote. Karen. You can give me the minutes of your convenience. Okay, so that's a and I can all right, so we're not wedded to it and I can I can give my information as well. Okay, thank you, I guess! Thank you, everybody good night, good night. Nothing! Thank you.",
            "summary": "Cities transfer of development rights to the private, real estate, firm, rap, Ski group who's joining us today, just to check is Ray Lebanon, as he will be preside, he's presenting that the developers portion of the presentation- I'll just continue, so the transaction will produce job generating commercial office in Brooklyn and outer borough business district.\nSo EDC began this project by issuing a request for proposals in 2017, where the sale of development rights from two city- owned Lots under the Manhattan Bridge, which the New York City Department of Transportation, currently uses.\nThe city saw an opportunity to create commercial office space to create jobs in accordance with our New York Works plan, using that development potential that otherwise would not have been able to be used on remarks.\nAs Christina said into 2017, there was an RFP issued which was designated to the Raske group for the transfer of about 98 thousand square feet of development rights for office, use.\nIt's a twenty six story: building with retail on the cellar floor lobby space on the first floor, 90 spaces of for parking on the second floor, but there ninth floors would be for the commercial office use which again, which is what the development rights would be used.\nThis were by comparison and as the right development, we would have the same amount of residential floor area and the building would essentially be the same height as we're proposing right, now.\nNot talking about me all right, I mean just answer the question that the residential floor area is unaffected by it by the land- use actions we're seeking here the disposition, the residential floor.\nThe office is what would be coming in through the city approval, so the height of the building may be a little bit skinnier in the as of right scenario, but it would have the same amount of residential floor area and the same height But you're, putting in how many floors that you're putting in six floors of commercial office.\nHere's what the building's going to look like as you can see, the sort of tan lower floors are the office floors and then the sort of inset space between the office and the residential is an amenity space and some mechanical equipment in that area.\nSpace created from the development rights, which is what EDC in the city, are mandating, that it only be used for commercial offices.\nThere was no Street, frontages, no transparency, no commercial, so that will change with the new building skree trees, which will be provided, and there are you, know, local, of W MWBE commitments for hiring fairly straight forward in terms of what we're , what we're seeking what the city is seeking to do in terms of just taking floor area that exists, underneath the bridge which can't really be utilized by the city and allowing it to be utilized for office space within our building within the current zoning envelope Just I see a lot of questions coming up, given the limitations that we have only one limited to our committee and board members.\nYou believe that the office is not a benefit, so I understand that, because we have so much commercial right now and all I see are people leaving commercial spaces.\nWe have to accept more density and more people down here without any help of how to bring them in how to keep them happy how to work with the neighborhood there's going to be At least 700 residential units dumped on us And we're getting no help whatsoever with things that actually add to quality of life.\nYou know further than Bob, so the ideas that the developer would create retail space to help further active skate, and if there is no transfer of development rights, the developer would really just build a fully residential, So And in they would not be obligated to abide by any of the local hiring probes, including fire NYC in the minority.\nThat's, why you're coming to Europe and that's the only part that we're going to be discussing star, correct You want the office space incorporated into this building or whether it'll just be a straight residential building and obviously the city gets.\nWe buy those development right from the city, so the city gets a benefit, a cash benefit We end up building a little a little more square footage with office, space.\nYou, said our application is for work at the first floor of the South facade off of Ridge Street, and work includes modifications to the entrances replacement of two existing stairs, replacing them with new stairs and an accessibility platform lifts installing new canopies over the redesigned entrances and installing a safety railing for an exterior stair to the Sun. This is the tax block.\nAll of this surrounding area is public space, and this is a subway station here and the Brooklyn- Queens expressway, going over the lock like I, said.\nOur proposal is to convert this to an elevator lobby for the school and residential use, and then this is the area where the Exterior stair is that's going to have that safety railing, and then this is a proposed.\nHere's just an overview of the facade Like I said this: is the existing loading dock area, That's, going to have a fence, here, I'm.\nAll of the metal work for the fence for the steel for the canopy and the new entrances are going to match the existing window.\nYou vote yeah 69 Green Street, which is a petition for replicable consent, which means basically that if you know the property owner wishes to do something on what we call the public highway or in this case the walkway or a sidewalk And you're doing a stupe work, basically coming from their building.\nThey have the same treatment of the revocable sidewalk, so new construction, B1 desiccation towards the building built, 71 Green, had gotten vocal consent within the last three years and the new ones, and then 69, green or 67 green and back in 2012 So what we're looking at is LPC's already approved the work that has been proposed.\nNuts to the Williamsburg, Savings Bank, building right near the Atlantic terminal, and this is a proposal by both Brooklyn music school and Gotham developers to construct a new 24 storey.\nThe property opposition is going to be coming from people who live in the or next to the Williamsburg, Savings Bank, building and I.\nThe other building The 21st storey height ever all of coming from the Brooklyn music school Carlton, I, do not know if you're aware, or about Saint Felix back in the 90s that whole street collapsed.\nThink A legitimate concern is to, if we're going, to build another large structure at that site that you know we should be.\nWill this you know be of any use if people start going elsewhere, who would have taken, let's say occupancy, either buying or renting high- Housing high- end retail, that The people who are doing developments in arm area, especially along Flatbush, Avenue?\nLet's say to their second home: Some people have just left all together because of the uncertainty of things going on at this time.\nThe other piece to build on that is that the city is working on some plan that would accommodate any Euler have to accommodate more than affordable, housing, the homeless, population.\nWhen we up zoned, downtown Brooklyn thinking, we were going to get jumped We wound up getting all housing and market rate.\nThe number of people have left because of the combination of the two, so I think it's You know this may be academic exercise, but all these housing construction are actually tied to the market as I understand we're heading into a recession.\nBuilding that work is resumed there they're constructing, like crazy and I, do not know how many people are aware that these are huge building right behind Long Island University took part of the athletic field and it's gone up.\nWhat will happen once these buildings are completed and they open for business and open to try to get people to come and use them to live in them or work in them or whatever?"
        }
    }
}