{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "title": "CB7 Full Board Meeting",
            "publishDate": "2020-09-01",
            "shortDescription": "",
            "lengthSeconds": "3:54:00"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "HYUSoN1tHTg",
            "fillerWordCount": {
                "uh": 477,
                "um": 536
            },
            "readTimeFullTranscript": "138 min read",
            "readTimeSummary": "16 min read",
            "wordCountFullTranscript": {
                "street": 73,
                "bike": 66,
                "park": 50,
                "neighborhood": 35,
                "lane": 34,
                "hotels": 33,
                "vote": 29,
                "mark": 28,
                "housing": 28,
                "thanks": 28
            },
            "wordCountSummary": {
                "bike": 21,
                "street": 15,
                "hotels": 13,
                "neighborhood": 10,
                "park": 9,
                "lane": 9,
                "housing": 7,
                "shelter": 6,
                "shelters": 6,
                "money": 6
            },
            "fullTranscript": "Youtube just to make sure it works, hey mark hey there. How are you doing? Oh I've been better gosh too many devices. Oh Christian is here. Yes, okay, actually he's at the beach. I wish his rich where's doug. It's Doug here, Doug's here, I'm right here Elizabeth we have to go walking with our dogs. Even though he's a puppy hey can I come too I'll, bring healthy, Rosie, sure cool completely you guys, yeah and once he gets, you know ready to ready to roll he's still in that three months, he's like a little crazy guys, but he's chimed into a few community board meetings already so he'll fit right in with fit right in with the community on chiming. In all the time really yeah he's like the honorary mascot well, along with all of our dogs and pets, but at any event, it's good to see everyone. I hope everyone's had a good summer. It's good to see everyone back. Oh this was summer, oh exactly whatever month we're in right. Now, I'm glad it's over. Not yet is it 2021? Yet I'm with you Susan exactly summer's, not over. Yet people we have three more weeks of summer. Okay, I'm going to start letting people in okay, we'll start the webinar yeah Richie's with us to mark. I think I just got him. You got him yeah. Does anybody see captain Zuber on the line? No, I do not either okay Jennifer start you're back too. Okay, we've got them trained by the fourth new person. They're all hi mark. It's Jay. Can you hear me hi, Jay, okay, hello, okay, we've got a long night ahead of us. There are still people filing in on the participant side. On the attendees side, I'm going to give them one more minute and then we're going to get started because we've got a long night ahead of us all right. It's 6:33 we're going to get started good evening. My name is Mark Diller, I'm the chair of Community Board 7.. Welcome to our September full board meeting. While we, the first order of business on our agenda, is the business session. I thought a few words of explanation about what tonight is going to be about and how we're going to proceed would be in order. This is our regularly scheduled full board meeting for the month of September. There are in order to meet our responsibilities to city agencies and various other things that community boards are required to do. We need a meeting that includes our business session and so that's what we're going to start with tonight. We are aware that folks are here in part because they are concerned about things that are happening in our community and there is a public session at the end of this meeting. I'll talk more about that in a second, but first I wanted to talk a little bit about what community boards are and perhaps a little bit of what they're not community boards are composed of 50 volunteers. We are there's a paid staff, of course, but all of us that you see on the screen tonight are volunteers. We were appointed by various elected officials. The role of the Community board is one of an advisory body that weighs in on a variety of matters ranging from applications to city government to issues of concern with respect to I know a lot of folks are here because they're concerned about the overlapping issues, homelessness and the presence of shelter, clients that are being housed in some of our hotels. One of the things that is important for everyone to keep in mind is that the Department of services makes the decisions on those matters in this case on a emergency basis. So we've we learned about this when you did. This was not a matter in which we were asked to opine or were welcomed to give our opinion in terms of the decision making process. This is somewhat consistent with our role as an advisory board. Where we try to facilitate discussions, we try to share information and we try to advocate for solutions, because we knew that we had a meeting a business session that we had to use tonight. We scheduled last Monday an information session where we tried to perform some of those functions. We tried to connect and have the community to hear directly from the people who did make decisions at the Department of Homeland Services and the people who are in charge of operating the hotels in the in the persons of the service providers who were there. We would have some folks have written and suggested that we should have had a greater role in the decision- making process, and certainly our board would have welcomed that, but that was not an option that we could require or insist upon, assuming that we knew about it. So there were 1389 people at the highest point on zoom and we gave that precisely to we gave over an entire evening to that one issue in recognition of how important it is to so many members of the community. We will have a public session at the end of this meeting. It will be open to anybody. My two of my colleagues have been putting together a a sign up sheet which they will drop in the chat at various times to indicate what it is that you are hoping to speak about. This is the first time it did not exist at five o'clock this evening. So please bear with us as we're trying to invent this as we fly, but it is our rough attempt to try to make sure that we get a representative sample of all the things that you are here to talk about, so we will do our very best to get as much of those in that said, there were at last count something like 390 people signed up for this meeting. There are 137 attendees right now. There is simply no way that we can call on everyone, even if we, even if we limit the amount of speaking time, and we will limit the amount of speaking time and right now, I'm going to look. This is something that my colleagues on the board know. I is anathema to me, but I'm going to do it, I'm going to ask everyone, including our board, colleagues, to be parsimonious with their time. Please plan in advance what it is you want to say about any resolution or any or any matter at the end of the meeting for the public for the public. We're going to go with a minute and a half you'll get a warning at one minute when that has expired. It goes by quick, but we are committed to hearing as many of you as we possibly can in this meeting. We recognize we won't get to everybody, but we'll do our very best we'll give over at least an hour of our time. At the end of the meeting to hear from all of you, the the sign in sheet will be our attempt to to hear from everybody, but if it does not work out, then we will go to a raise hands function and try to deal with it. That way, since we had representative groups and elected officials speak at the Monday meeting last week, we're going to reserve as much time as possible. There are a handful of elected officials who would like to address us, and I've already asked them to limit their remarks to a couple of minutes as well. It is likely that we will not get to the public session until about eight o'clock. I always live to regret these asses these estimates, but that's a fair estimate, considering that there are one or two resolutions on the board on the on the docket today. That may re may elicit their own kind of public testimony and significant board discussion, so we will do our best and once you've signed up to speak. If you want to drop out for a bit and come back and rejoin us, that is something that I want to make sure you're aware is an option. Of course we welcome you to stay with us for the entire meeting. There have been a number of folks who have written to me. I've tried to respond to as many of you as I can, but I apologize if I did not get to everybody in terms of what else is the community board doing with respect to some of the issues that you have brought to our attention? We are continuing with small group meetings with stakeholders and the future of this. Considering the number of people who have turned out at these two meetings, it is likely that we will need to rely on representatives from stakeholder groups to move our conversations forward. I am actively involved, along with the president and her wonderful staff, in trying to set up the next of small group meetings where we try to hammer out solutions to problems that have been brought to our attention. We hope for one of those later this week and we will continue to have them for as long as there are reasons to have them. We will push the department of homeless services and the service providers to continue to attend, and we will look for solutions together going forward. Our standing committees will be evaluating their agendas in light of all the issues that are coming before us, and I will look for an opportunity to meet with our committee chairs and co- chairs to make sure that they are supported in the best way that I can and to make sure that they have what they need to address whatever. It is. That's within the belly wick of that committee to discuss. As I said, the focus needs to be on representatives at this point, and I know that there are a lot of well- formed groups, and so we will do our best to continue to reach out to them and to hear from them a last thing that I want to make sure that I mentioned before. I start turning it over to the business session and potentially to captain Zuber if he is with us, because I know that the NYPD has limited time to speak with us, given all that's going on. So if I could ask Christian and rich to look for captains, Uber he's here very good, so he'll be next. If he, if he wishes to speak now. The next is that while there's a lot of discussion about Homelessness, both street homeless and shelter, clients- and I encourage all of us to speak about everything in a way in which we would be later find acceptable, not to say not to alter your content, but to speak with respect to all of us, because that's what's going to move this conversation forward. But I've also heard a lot from a lot of you. A lot of folks about the need for affordable housing as permanent housing, and that is something that CB7 continues to push very hard for. We will have more to say about that in the coming months, with respect to funding and options that may be available, that we can use our influence to try to affect so so welcome to CB7. Thank you for indulging my introductory remarks. We will do our best to move our conversations forward and to move our meeting along, but right now, just in case we lose him later. I wanted to call on Captain Neil Zuber, who is the commanding officer of the 20th precinct, welcome to Community Board 7. I understand you'll be addressing us both on behalf of the 20th and the 24th precincts, just as inspector Yaguchi did last Monday on behalf of the two precincts as well. Yes, thank you. I really do not have any prepared remarks except to say that we know what the hot button issues are. We know lightning rods are here in the community. Everybody seems to be talking about the homeless issue, specifically about the shelters going back a couple weeks now. It's everybody has been complaining about quality of life. How have the homeless people on the streets? How have the people who have recently been placed into Lucerne the Belclair, the Beltnord, been affecting the quality of life and there's a perception that there is an increase in drug use, increase in public lewdness, a lot of issues that were not present this time last year on the upper West side, we've been pushing everybody please. When you see this, you have to report it and that's been our primary agenda for the last three to four weeks. If you see public lewdness down the street or if you see drug use on the street by all means, take a picture, send it to CB7, send it to your public elected officials, which is what a lot of people have been doing instead of calling 9- 1- 1. But we ask you please, on top of all that, please call 9- 1- 1. If we're not aware of it. If we're not aware of exactly when and where it's happening, then we can't possibly address it, and I want to say just as a brief anecdote when this issue started raising his head about three or four weeks ago, we went back for within the confines of the 20th precinct for a four week period. 28 full days we had five 911 calls about drug use out in the open. Only five, when the meantime, we were receiving many emails forwarded to us from elected officials around the city. So we have no doubt that the people on the street, the people in the community are seeing a lot more of this than was being reported. So we're pushing. Please get the word out to. Please call 9- 1- 1 and it worked yesterday, I'm happy to say that, based on the increased reporting and our initial investigation, we were able to bring Manhattan north narcotics detectives into the 20th precinct. In a two- hour period, they were able to go out, make 12 arrests of drug dealers and people buying drugs on the street. So this root cause of what is driving so much of the quality of life issues was addressed in a very big way. Yesterday, that's thanks to the partnership that we have with the community. The people who live here who walk the streets who know what looks right, who know what looks wrong have to please report it to us and one day we're able to take 12 people off the street, along with all of the drugs involved, along with all the proceeds. Now that's significant on the surface, but when you look at that is the root cause of so many of the other quality of life issues. The people who are out buying drugs are most likely committing other crimes throughout the day, they're going into the store, they're, stealing a couple of things, so they can sell it for a few dollars on the street so that they can get enough money to buy their drugs throughout the day. That's been taken away, so we see it as a multi-, tiered approach. Addressing that root cause is removing all of those other quality of life issues. It's a success story, something that's very new, that anybody who follows us on twitter saw that we posted it a little bit after midnight and it's something that going forward. We are going to continue to push forward. Thank you very much. Captain! Congratulations on the arrest and to your team. The I've just been told that the zoom is frozen for one of my colleagues. Is it frozen for everybody? No okay! I think it's probably a local issue. With that one person, then captain Zuber just not to not to belabor, but if you could speak for just a couple of seconds about, when does a person call 9- 1- 1? When does a person call 3- 1- 1 and where do they send the video or the or the photo snapshot that you just mentioned to the NYPD yeah? That's been a question that we're getting repeatedly. I just came off another zoom conference just a couple minutes ago. That's why I joined a couple minutes late and that's a question that several people had there. If you call 9- 1- 1, a lot of people are afraid that they do not want to clog up the system. I promise you that's not going to happen when you call 9- 1- 1 our the 9- 1- 1 dispatcher, who gets the call is trained to say. Okay, this is a police issue. It's an emergency! It's a priority, one! It's a it's a semi- emergency priority too, or it's not a police issue at all. In fact, that's something that we're going to reroute to sanitation and we're going to reroute to the fire department we're going to reroute to the department of parks. So if you're, not certain call, if it's a something, that's very simple, like a noise complaint, you're in your apartment and you hear banging on the walls or loud music next door, that's a noise complaint, that's something that can go to 3- 1- 1, if you're, not sure of what you're seeing on the street. If there's a couple of people hiding in a doorway and you think they may be using illicit drugs, call 9-, 1- 1 by all means Err on the side of caution. It's we're going to get there that much faster and we're going to to do our investigation very good. Thank you for captain Zuber we do have to pivot to. I have to keep the meeting moving for as long as you can be with us. We're grateful for your presence and again congratulations on the arrest with all that said, the agenda was posted on the website just to review it quickly. There will be resolutions from a variety of committees that have been voted on over the last couple of months and they will come up for votes. We will then have a new business which relates to an internal board matter relating to our bylaws and the difficulty of voting online. We will then have the we then have nominations for next year's officers for our board. They will be an election in October, I'll have more to say about that a little bit later, and then we will go to the elected officials in the community session. I'm going to keep us moving, I'm already behind, where I hoped to be so business and consumer issues. Committee you're up, I'm not sure which of you is going to make the make a presentation mark. Can you put up our resolutions on the? Can we put so for everyone to see? I only have one of them yeah. Why do not you just describe them? Okay, Chris. Did you have them in front of you yeah? I do yeah okay, so we have two liquor license applications. The first one is for 120 Riverside boulevard that this was. This is a place that is, they run a business and they have a cafe added to it, so they're just applying for the liquor license. Now there was no one was against this and now they were well received and that they were approved by the committee. The second resolution is 483. Columbus avenue, Burrito restaurant there, the several partners are one partner, is buying the business from the other ones and because of that they have to apply for a new liquor license, so that also was well received and approved by the committee. Any questions Gary. What's the name of the restaurant of the last one that you just made bonito restaurant and what was the address? It's it's 4,483, Columbus avenue, yeah! Well the question: well, we have to see. If is there anybody in the attending? Who is here to speak on this issue? I do not see anybody so now. Let's call the question: can we is there anybody who's going to vote differently on one than the other? I do not see any hand in that regard, so I'm going to I'm going to ask for one vote on both both resolutions. If, for those who are able to use the raise hand function, please do so now. Okay, so I'm raising my hand, Louisa Christian Doug I've got Doug Mcgowan with a physical hand, I've got Richard Ash with a physical hand. Shelly has a physical hand. I'm sorry, I should have been counting we'll start again. Leave your leave your blue hand up if you've got it up. Let's see so me is one Christian is two Doug clyman is three Doug Mcgowan is four Richard Ash is five Peter Sampson is six Shelley is seven Paul fisher had his hand up too. That donny, who is eight ethel, is nine. Amy is ten and I'm sorry who was the other person Paul Fisher is 11., so 11 plus 30 is 41.. Audrey is 42.. Thank you audrey. Did you get that donahue? Yes, I did yes, okay, so that's 42 hands all right, so hands down. You may have to lower all the hands at one time I tried there. It is okay, anybody opposed anybody, abstaining. What one abstention: okay and anybody ineligible for Cause Andrew. Are you Andrew Ridgie? Are you ineligible for cause? No, that was abstention. Okay, that was the obsession. Okay! Oh sorry, no I had my hand up. I was voting in favor I'd. Sorry, I'm using that. Okay, then that then it's then the vote is correct. Okay, so we have was it 42 to 0 to 1- 0 on both? Thank you, Bci we're moving on to the preservation committee, I'm not sure who's going to present actually mark the attention that I counted was Andrew. Who correctly said he was actually voting in favor. Also, it's 42 to 0 to zero to zero right. Very good. Did the secretaries get that? Okay? Thank you would not it be 43 then andrew. What was I yes or an abstention? My vote was: I'm not I'm not sure. If you're sorry, I did not lower. Maybe I did not lower my hand in time, but yes Jay. What was your vote? Yes? Okay? So it is 43 because I did not have J. I did not see your hand either way, so that's 43 to zero to zero to zero. Thank you. All preservation, who's here for preservation is Michelle. I am Mark very good. Take it away, hi everybody! We have six resolutions, we met in July and August because, as you know, LPC does not wait for us, but the first one. It concerns the building at 305, West end avenue between 74 and 75th streets. We, the application, was to install rooftop HVAC units, an equipment screen, canopy restoration and a second floor equipment screen installation this building is the everybody's. Still there all right. Thank you. This is the luxury senior assisted living residence as 191 units, the canopy, in effect, part of the restoration of the canopy, has been approved at staff level with the LPC, but they came to us for accent, lighting, replacing the bronze, aluminum ceiling panels down lights, and this is in the front of the building and lights heating lamps for the now. How can you see that these? I do not have that slide up, so you just have to go over that. Okay, this is the Backyard 75th street minimally observable from the street. There's a small cut out there that air conditioning units were installed and they have to put a they want to put a wall with a little bit of fencing on top to separate the air conditioning units from the terrace that the tenants would use the residents would use and the third part of this. I thought it was only two involved. Wait a minute hold on it's. The air conditioners themselves right. The air conditioners themselves that were installed before the applicant came to us and, as Jay pointed out, we're not there to tell people to knock things down and not approve, but and we're happy. They came to us and told us they installed the air conditioners before they got any approval, but without the wall and the wrought iron fencing, it would have been a little harder to do that. Needless to say, that was all resolved and we approved these changes by a vote of six to zero to zero to zero non- committee board members, one zero one: zero! Any questions on that or comments that anybody on the committee wants to make all right. Is there anybody in the community that wants to speak on this issue? Rich? Do we have a anybody from the sign in for this? No, the first sign- in is for agenda item eight, very good. Thank you, okay! So then, I think we're ready to vote. Yes, okay, so Michelle, I'm sorry go ahead, Mark, so we're going to call the question same as last time we're going to do a show of hands. Use your virtual hand. If you can and show me your physical hand, if you can't so I'm one physical hand I see louisa is two Doug is three shelly is four Peter Sampton is five Doug Mcgowan is six ethel, shepherd is seven Bev donahue is eight and that's nine, oh I'm sorry and Christian is nine, so I have nine Paul fisher. Also is ten. Thank you. I have ten plus twenty. Nine is thirty? Nine wait. A second audrey. Are you there yeah I'm voting in favor also, so I'm eleven, I think that's eleven! Thank you. Anybody else that I missed okay, so I have 11 plus 29 is 40 right, so I have 40 yes mark. Yes, Sir! I was awesome. I do not think oh 41 Richard Ashe, thank you Richard, so I'm in the lower hands. Thank you. So anybody opposed not seeing any physical or oh Roberto. Are you opposed or I'm sorry, you're, muted, roberta, you're, still, muted? I'm sorry I lowered my hand. I thought we went back. Okay, yeah, let's start again with the the opposite. All those opposed now, please raise your hand one way or the other, I'm not seeing any anybody. Abstaining I see. Uranus is abstaining. Is that correct arena? Yes, thank you and then one more madeleine. Are you abstaining madeleine? Are you abstaining? Please I'm having a hard time here with my computer. Okay, do you hear me? I hear you now or what's your vote on this, this resolution, my modules for it? Okay, so we have one abstention, so it was 41- 0 to 1- 0. Thank you next, one Michelle. Thank you. The next one is 60 West 76th street. This is a seven- story, apartment flat, structure, renaissance style. This is an application to modify the entrance landing and Areaway and install a ramp and call them they'll set up an appointment. So that's the that's. The best image we can give you right is somebody else talking someone else. I mean I do not mind if everybody who's, not speaking, could mute themselves. Please thank you. So you can see by the picture that this, oh they want to ins. This is the finished product mark. No, this is their proposal of yes, that's what they so all right. So everybody where they have you see those two catch- alls there that, as somebody pointed out catches, that's for the fire escapes which we guess we're not original to the building. But if you want to put up the finished product, because this was already approved by LPC- and the committee got a really nice kudos for recommending that the ramp will be as you're facing the building on the left, the new ramp and we recommended that these pile pilings. What do you call them? They're, not original to the building? We recommended they get removed and are replaced by an equivalent metal structure, and what did LPC say that they liked that the committee suggested Mark they liked it, because it would open up the view of this beautiful entrance instead of instead of having this thing kind of be a visual block. We take this vote, even though the LPC already ruled on this. We take this vote because we want to be consistent with our resolutions, but perhaps it would be wise to call the question on this sure. The committee approved this five zero non- committee, one zero, very good, so all those in favor of this resolution yeah mark there is nothing the hand up. Maybe you want to talk on the I'm. Sorry is it in the is it in the sign up sheet or what no we're taking folks from the sign up sheet right. Got it okay! So folks, please do not raise your hand because we're not going to be calling on folks based on raised hands, we're going to be calling folks based on the sign up sheet. Thank you so raised hands. Physical raised hands. I'm one Doug Kleinman is two louisa is three shelly is four Richard Ash is five Peter Sampson is six Doug. Mcgowan is seven next page, oh fisher just voted yes, Paul Fisher is yes. I see Beb Donahue and ethel. So it's seven. It's nine. I do not see Shelley's hand. Lolita is 10.. Robert SBA is 11. No robert. You can't vote twice, so I got 11. Audrey. Are you with us? Yes, 11. you're, I think you're actually 12. and I did get ethel. I, though you're all set and we've got Paul Fisher, so we've got myself and myself Christian. Thank you. What do you got that would be 17:13 yeah, 13, plus 28 is 41. and Stephen Brown has his hand raised well. Stephen Brown also has his blue hand up. So I count that yeah. I was not sure if it was a blue or a real, so I double so double handed one of the one or the other yeah. Thank you. So it looks like 41 on this resolution. Please all lower your hands. I will actually try to do that now. Is there anybody opposed to this resolution? Seeing none? Is there anybody abstaining uranus? Are you abstaining? Yes, thank you. That's one and I do not see any others and then anybody ineligible for cause. I do not see anybody, so it looks like 41- 0 to 1- 0 again. Thank you. The next one is 55 West 86th street mark. We have photos for that. I think so. Give me one second: I have to do an administrative thing here: okay, 55, west 86th, yes Sir! This is a first and second floor, facade renovation, yeah. I think you're going to like this see the one on the left. You'll all recognize. This was a. Is it a Queen, Anne row house, the top part remained Queen Anne in style and structure. They want to restore the storefront using steel and glass for a retail or restaurant place space, as you can see where it says book culture and that would emulate the 1928 facade. The building, although structured in 1888 1889, underwent some renovation in 1928 and then again I think in the 80s you can see on the left, see these little doorways, that's all going to be eliminated. The effect is to bring this building back to the original 1928 facade. That's about that. I think you're going to be very pleased with this renovation. The limestone is going to match that of the buildings. Next to it. This is all limestone and as well as the the spacing that says, book culture will all be limestone glass on the bottom. You can see glass on the top slightly recessed windows. I think it looks very, is very pleasing and historically appropriate to the character of the building and the district very good, any questions for anybody. Yes, is this a com, commercial block? I can't I can't picture this building. Okay, yeah! Sorry, I should have told you this is allowed on this block yeah. This is 86 between Columbus and Central park, West, the north. Yes, okay! Thank you. Thank you. It's like a little bit east of Chase, Arena yeah. I know exactly where it is now. Okay, thank you. You'll know it is very ugly area, but it looks like they're going to do a really nice job here. Yeah, it's the first hundred feet. I believe it's allowed to be it's allowed to be commercial yeah. I think that's right, linda, that's correct! Yeah, that's correct! Yeah! Thank you will okay, should we should we call no other questions and rich and christian there's nobody signed up to speak on this. I just have one more question. Is the signage as we see it in the rendering? It's just to? Let you know where the signage will go, yeah, that's. What will that be? Will it be that prominent it will be the subject of a subsequent application. They'll have to ask for that. Okay! Thank you. Okay, so I do not want to rush anybody, but I want to rush everybody. Barbara Adler says she has a question. Okay, where is she? Is she? Can you unmute Barbara? I am unmuted very good, just curious. Why does it say book culture? Are they moving in there? That's a good question. They are not that's wishful thinking. No, they just wanted to show us that this would be a retail space. I see thank you, so they picked the most intellectual thing for the neighborhood. Can we call the question? Let's call the question: let's keep it moving guys. So all those in favor of this application raise your hand either virtually or physically. I am one Doug clyman is two Christian is three. I let's see I have Richard. Ash is four Shelley's five. That's all I've got on this page. Doug Mcgowan is six Peter Sampton is seven. Ethel is eight bev is nine. That's why I've got nine and then audrey. Where are you I'm in favor too? Yes, thank you. Ricky thank you is Richard Ashe. Here he was raising him, but Richard Robbins is a yes all right. So that's. Where are we up to now? 11. is 12 and then Paul Fisher, yes, Paul is Paulie said. Yes, I'm on my phone. This is madeline. I have to reboot my computer, yes, okay, thank you madeline, so madeline is no. Richard is 13 and madeline is 14., so I have 14. Plus 29 is 42 right. Yes, we have 42 in favor, please lower your hands 43, you said 14 plus 29 yeah. Thank you, 15, plus 29:14, plus 29 is 43. Thank you have 43 anybody captioning not opposed to zero to one to zero. Thank you. Thank you. Keep going Michelle! Thank you. The next application is 262 central park west between 86th and 87th street. That's a 15-story building built in 1928, there's 796 windows on the primary facade. Next, one mark they've come to this committee from time to time with applications for window replacements, but this time they want a master plan. So they've come, like I said: they've come several times to the community board since 2000 for a separate, app window applications. Their proposal is to replace the windows with one over one double hung all aluminum. The original windows were six over six, none of which remain. There are currently seventy percent of one over one, thirty percent single pane tilt and turn windows in place. This was, as Susan said. Finally, they come to us with the master plan. It probably works out better for them also, but we voted in favor of this. They are. Let me just look at my notes for a second, the Mo single molding, setbacks and brick surrounds will match the historical originals. That's about it. For this, the community, the committee approved it one abstention, four to zero to one to zero. That's it any questions. This is to keep a plan. Now, when you have a master plan, it does not all happen at once, but at least you have one one plan and every time something's done, it's done the same way, yep. The only thing we should add to that Michelle, if I may, is that the original condition years and years and years ago was divided light. I think it was six over six windows throughout the building and I'm correct that there are none left on the facade. Is that correct? That's right! Okay, that's right! 70, one over one, I'm sorry! Michelle! What's the current material, I mean, I know it's a hodgepodge, but have they always when they started replacing? Have they always used? Aluminum? Let me see you know, go ahead Michelle I do not mark. Maybe you know, I do not know because they told me as they replace them. They'll probably keep the same material yeah, although the replacement proposals are all aluminum. My understanding is that the that the replacements that have been put in are most, if not all, aluminum. Thank you, hey mark, like Richard Ash, is yeah. I may have missed this. Is this both the South Facade and the West Facade? It's the South, North and East? Yes, I'm sorry South North and East yeah, that's correct, yep! Okay, all the way around the building! Yeah! That's a good question: it should not just be for one side if it's a master plan, it should be for the yep. I hope Barbara has a question. Yes go ahead, Barbara! It's like a real shame to put in one over one windows for a building that originally had six over six like and to do a master plan for one over one seems to have be totally devoid of any architectural detail and then to do them in aluminum. Besides just seems like a travesty to me, I can't vote in favor of this. Well, that's what mark said. He would have preferred six over six over one minimally yeah Michelle. Did they say why they could not do that? I mean, if they're going to do a master plan. Why can't they go back to the original design? I can't remember somebody help me out, because we did talk about that. Do you remember Jay? I do not remember why they said they would not do so. Well, I remember first, if I can, if I can respond filing a master plan, does not mean that they're replacing all the windows it if, for example, the building- and it happens once in a while, though rarely where a building will require everyone to replace their windows at the same time, that that's not the case, if they were doing that, it would be easy to require the windows all represent. The original historical configuration all filing a master plan means that if anyone piecemeal applies for window replacement, it's consistent throughout the building and what we've typically done and what in fact LPC has done, is where there are no original windows left and the vast majority have been changed to a particular configuration. They typically approve, unless it's some for some horrendous reason. What the majority of the windows are at the current time. In this case, it was, I think, a little over 70 percent were already one over one and as far as the material is concerned, I think it's important to understand that the fact that these are aluminum- you know a lot of people tend to think of aluminum as cheap or aluminum siding. But aluminum is a very typical. Sometimes you know it's clad. It's finished in an upscale way, so so I'm starting to jump in, but I want to move this along yeah, so I mean I voted. Yes, I think it's perfectly appropriate and it's very likely going to be approved at LPC yeah. I just want to add to the just quickly. There was one alternative manufacturer recommend: has aluminum clad wood, just like you said Jay, sometimes not just aluminum. This is aluminum plate. I think Peter wanted to say so he did you remember something Peter yeah. I recall that they already started doing some of that right. So several of the windows were already done. Am I wrong about that? Yeah individually, when they came individually to the community? It's just continuing our process, yeah right and then Richard Ash, wanted to say something just quickly to follow up on Jay's comment: nobody living on central park West would voluntarily install a 16 window, and what that will mean is that nobody will change their windows. We insist on any replacements, there's a great to me: aesthetic value and uniformity. As you drive up central parkways and a one- on-, one window is not an unattractive, it does not stand out as an ugly departure from the building. If probably, if one- on- one windows had been available when the building was built, I'm going to move this along here Michelle, if that's okay, yeah! Thank you. Thank you, Richard yeah. Thank you. Thank you all, but I think we, you know it's 7:18 and I want to keep us moving. So is anybody signed up to speak on this matter? Call the question Christian: is anybody signed up? No still, no one is signed up before agenda item. Eight, very good, so calling the question we're going to take a show of hands. Please raise your hand the blue hand if you can and if not the the physical hand, so Mark is one Christian's. Two Doug clyman is three Richard. Dash is four Shelley. Fine is five Peter Sampson is six going to the next page. Doug Mcgowan is seven, lolita is eight. Do we have Paul Fischer's vote? No Bev donahue is nine ethel Shepherd is ten paulie said yes, so Paul is 11 and I'm looking for audrey. Yes, so that's 12, right, 12 plus is everybody else. Voted robbins is 13., Robbins is 13., 13 and 27 is 40., so I call it call it at 40.. So, okay, thank you hands down. Thank you. Anybody opposed louisa had her hand up. Oh thank you. So that's 41.! Thank you roberta. So anybody opposed looking for hands. I've see sema. Oh that's a that's a virtual okay! So I've got let's see, I've got three virtual hands and I do not seem to have any physical hands so 41 to 3 anybody. Abstaining! I'm sorry! Uranium! Were you? Oh no! I was a no okay. So that's that was four then 41 to four anybody abstaining. I do not see any abstentions and no one's ineligible for cause, so it looks like 41 to four to zero to zero thanks Michelle go next. Please thanks the last one is a 320 Riverside drive, that's at West, 104Th Street. This was to exchange a previously approved door with a Bay window, so the whole plan, the whole fenestration plan was approved. They had with a door and now they want to put a bay window in there instead of the door, there will be no fenestration changes made. It is the colors will remain, they call it. A freedom gray. All materials like patterns, colors and finishes that have been previously approved will remain the same. This is minimally visible from the public thoroughfares because I do not know if I said it is on the penthouse. I did not say that it's a penthouse check a change to the penthouse. The Michelle. Can you just? Can you just say which way that face is please which exposure is? That is it's south? No now. Thank you. It's out wait a minute hold on. It is south. Yes, it says that Michelle, I'm sorry is this. So they're introducing a door. It's currently a window, no they're introducing a window. There was currently a door. A door was approved along with the other fenestration got it. They want to put the Ba a bay window in which will project from the Exterior wall, as Bay windows typically do, but nobody, but that tenant has use of that space right. Any other questions. Ira. Do you have your hand up for a question. Nope okay looks like I was voting already call the question sound. Okay. So all in favor of this resolution, please raise your hand. So Mark is one Christian's. Two Doug clyman is three Peter. Sampson is four Richard Ash five Shelley finds six and louisa is seven robin's. Eight robbins is eight audrey, nine audrey is nine, Doug Mcgowan is 10., Lolita is 11., Bev Donahue is 12. and I do not see any more whoops yes and Paul. Fisher is 13.. Oh and ethel shaffer is 14.. Thank you. 14 plus 30 is 44., so we have 44 in favor hands down please hands down. Please anybody opposed not seeing anybody. Whoops Ken is opposed. Okay, no okay. So nobody opposed anybody abstaining Jay. Are you opposed no okay and nobody's upstanding, so it looks like 44 to zero to zero to zero. Is that right? Okay, that's all right! Thank you. Everybody thanks for helping those resolutions- and thank you all next is next- is the crosstown bike lane on 72Nd Street, Transportation Committee, I'm not sure if it's howard or Andrew I'll do it so Andrew, and I have only one resolution this evening and it's the 72nd street. I do not like to think of it as solely a bike: Lane Resolution, 72Nd Street. I I'm there all the time. It's it's really a mess. There's a wall of double parked cars on each side and I think it and it needs to be rethought. There are a lot of restaurants there and a lot of restaurants that are suffering so what we discussed at the transportation committee was there are very good and plentiful. North- South Bike Lanes, Central, Park West, now Columbus Amsterdam, but there really is not a good East, West Route and we thought 72nd street, given its width and given how underutilized it is, would be a perfect place to put in something different. The resolution calls for a plan. It does not call for a specific lane and we did not discuss the specifics of the committee and the resolution does not have specifics, calling for the DOT and their experts to come up with something that will make the street a better street. Make it safer. Make it more pleasant, absolutely have a protected bike lane. It calls for pedestrian improvements. It calls for a plan to calls for them to use their imagination, to come up with a plan to improve the street and, of course, connect these Northwest bike lanes also connecting central park, which has the loop and Riverside drive, which has the Hudson river bikeway. So this would be an important, connector and we'd like to see what the D.O.T can come up with my suspicion. We're not going to hear back from them very quickly because we all know why? Because but it's just to get the ball started and to try to improve the streak. That's it. Oh. It passed in the committee eleven to zero to one abstention. Eleven in favor questions, comments: criticisms. Can we get the resolution up on the screen, someone other than I is going to have to figure out how to do that. I have a question howard. I have two questions. Actually the first is you said that it's that the thoroughfare is not heavily used, but there's always double parked cars there and it's also a bus route. So could you clarify that? Oh what it is, there's a lot of there's a lot of deliveries there when I say heavily used, there's not a lot of moving traffic. I often drive there to get on the henry Hudson parkway and there's there are a lot of cars there's. Never. There are a few cars in the moving lane, but there are always cars in the the lane to the left, in other words the lane beside the parking lane. So, paradoxically, it's both heavily used for deliveries, but not heavily used for me. Okay. My second question: I spent a lot of time on 70 seconds so when you said that I was like what and then my second question is: I know that you want D.O.T to use their engineering and creativity, but are you thinking like what was the committee thinking in terms of where the bike lane would go when there's bus stops? I'm just trying to understand what you guys are envisioning. I will tell you candidly. I have absolutely no clue. Okay, I'm calling on people who have a lot more expertise than I do to figure it out. I just think the street can be improved and I'd like to see. I think we all should like to see what they can come up with. Okay howard, can I make it well, who's is mark. Are you managing the queue of questions howard? I had my hand up first, I think. Okay, howard, that's fine with me. Let's make sure we just get to everybody and then- and I'm just going to renew my imploring that we move this meeting along, but not at the expense of not having a full discussion. Okay, but if everybody could take a second to gather their thoughts and be ready to speak when it's your turn, that'll move us along faster, too, okay, and I also see we have a lot of comments from the community. So this we have a lot. Okay, we have roberta and clary. May I go first sure or are you I should say? Are you calling on me your gun? Thank you howard. So I live on 72nd street. There is a lot going on there. It's not an easy street to control. No matter what you do, my husband is a cyclist. He cycles acrosss 72Nd Street. I have personally always supported dedicated bike lanes, and the concept on its face sounds like a good idea to ask for a proposal, my understanding and how it tell me if I'm wrong is this is asking for a proposal. It is not asking for a bike lane. Is that right? It is a hundred percent, correct, okay, said it accurately and succinctly. Thank you so much, I'm glad to hear that what I want to focus on just for a moment as we continue as we will over some months, probably to see what comes out of this is the issue of how you get to the greenway, because, unlike other dedicated cycle lanes, this one to get from central park to get to the greenway in Riverside park, one way or another has to get through Riverside park, which is, as we know, a very heavily used park by many pedestrians and others. So I'm going to try to do this really simply if you arrive at Riverside drive in Riverside park, if you were, if you entered the park there, you have a big circle with Eleanor Roosevelt Statue. Then you have a very narrow, shared path that has many pedestrians, with all sorts of baby carriages and et cetera you go by a dog run, that's heavily used. You then go through a tunnel at the end of the tunnel. You either have a very long heavy staircase that goes down so cyclists, obviously can't do that they'd be killed or you have a blind turn with an extreme right hand, blind turn down a very steep pedestrian ramp. That then crosses all the pedestrians who are avoiding or crossing the the rosenthal bypass so getting to the greenway, and the resolution asks for a safe way for cyclists to get to the greenway, but that'll be safe for the pedestrians too. I assume that was just a an error that you're not asking for safety for everybody anyway, so that is not a way that cyclists can get to the greenway. There are two other ways, but I want to point out that there are some problems with both of them the logical and can I just interject clarity that, but we just specifically did not discuss these logistics in the yeah. I know, but I think, as people are thinking about this howard, it's important to understand, because the issue is, how do you is a safe way for everybody to get to the greenway and I'm not going to be long, but I just want to explain something: the phase 5 of Riverside park, which is supposedly opening imminently, but still waiting for some Con Edison work, we'll have a fabulous feature at 66th street, which is a dedicated bike ramp from Riverside boulevard that will go down to the greenway. That is the obvious way just to to send cyclists traffic. If this, if this bike ramp, is done, if the bike, if the bike, the lane is done, that's the way that bike traffic should get safely to the greenway, but we still do not know, even though we're told it's imminent, we still do not know when that ramp is going to open. The second way is to go north and go on the currently dead, currently designated bike, Route Acrosss, 79Th Street. This would be particularly good. North and Riverside drive I'll be finished. In a moment, however, to go north on Riverside drive acrosss. The currently designated route onto the greenway, particularly for people going north, that's the other half of the perfect solution, but when the rotunda is under renovation, which we're told will start sometime soon and last for several years, that will be unavailable, and I'm saying this now because I think when people think about a bike lane that terminates at Riverside park, they have to have at least some understanding about what happens next, to get those cyclists safely down to the greenway. So they are not and absolutely are not cruising along this very narrow path, with all the perils I described. So that's the background that I wanted people to understand, even though I I'm glad that you've confirmed we're not asking for the bike lane we're asking for a proposal thanks for letting me speak Howard, I'm going to speak for 30 seconds, and I think it may save time in the long run. I think a committee and Clara I would urge you to join, to meet with D.O.T once they've had a few months to mull this over and help them shape. Their proposal would be very helpful, I'll be happy to do that. Thank you very much, howard. It's my turn right. It's Roberta's turn answer two questions. First of all, at 70th street, where there's a path up similar to the 72nd street. There's a path and a staircase cyclists are told to dismount and walk their bikes up or down the path, and that has been working very well to answer. Arena's question that D.O.T is very good about figuring out how bus buses can have their bus stops and bikes can go through. If you look at cbw you'll see it. I think this is an excellent resolution and I've taken less than a minute. Thank you. Actually. I wish the m72 bus was more frequent, but it is not. I I'm just going to go down the list, so why do not I'll call? I figure out how to do this. Susan Schwartz is next wow. Thank you howard. So I'm excited so my concern here is that we would be spending any more money on bike lanes. The New York City budget deficit right now is 9 billion. The MTA projects a two- year budget deficit of 14.3 billion- the cares act would only provide 4 billion to cover that and Andrew. Please correct me, I'm sure, I'm wrong here. The MTA has requested 12 billion in additional federal funds and we're going to have to cut the subway and bus service by 40 if we get no federal aid forthcoming. So I'm concerned that what seemed like, maybe a good investment of 1.7 billion dollars to provide 250 miles of protected bike lanes before the pandemic and before the city's tax base fell apart. I'm concerned that we'd be spending any money on this. Furthermore, wrapping up here I live at 71st street, as we all know, and I'm on 72nd street almost as much as arena, perhaps, and that street is not, as it says, in a rebel resolution here, a low traffic street with six lanes consisting of curbside parking blah right now. It's got restaurants burgeoning out the bus goes back and forth and, frankly, I think the way the bus is being handled in Central Park West is terrifying. The bus pulls over directly to the curb and the bicyclists are in danger on Central Park West, because the bus is pulling into the curb- and I do not know where they're supposed to go so to have that same model used on 72nd street. It's just terrifying to me, so my recommendation is to not vote on this right now and to just set it aside and say: listen in a year from now, we can come back and talk about it, but right now this should not be our priority when the MTA is in such freefall. Thank you very much. Thank you. I actually agree with most of what you said. I think a rethinking is an order. I think this is just, and I am way up there with concerns with the budget, but I think that this is a very small actual expenditure. Let's my feeling, and the committee's feeling is, let's see what they come up with Jeanette Wraps. Yes, thank you. I think you mentioned in the beginning that this was more than just looking at a bike lane. What we really need to ask for is for DOT to do a complete streets, analysis of 72nd street and, frankly, also other crosstown streets. A complete street approach looks at the best way for the bus to move whether it's bus, Lanes Bike lanes, pedestrians vehicles, parking. It looks at all the modes of moving them east to West on the street, and so I'd really recommend that, if we're asking DOT to address resources in this, we have them do it comprehensibly, rather than just looking at one mode of traffic transportation, to move this length because it's as the comments you've heard, it gets very complicated when you get to the details thanks chad, it's ironic, it's ironic: it went after Susan, because Susan suggested the budget and- and these other concerns that we do not do anything right now and you're suggesting we look at everything right now. The committee decided for a sort of interim on a middle way approach of looking just in 72nd. So well, I think, if you're going to look at it, you should look at everything, but I think Susan's comment made a lot of sense. As is this. The priority right now and it may be because there's so many people who are trying to walk now to work or trying to take the bus or trying to take them a bike instead of the subway. But I just improved the calls for an essentially we. I know we need to move it howard. I assume you're going to call on everybody that has their hand up is going to be called on, but it's very call that in order nazism, I do not know. Okay, the next one Jay your next. I just have an observation with respect in response to Clary's question and you've said it a couple of times that this is not a resolution for a physically protected crosstown bike lane. But the resolution says that community board 7 is seeking a proposal for quote a physically protected two- way, bike lane or Lanes on West 72nd. That would run between Central Park, West and Riverside drive. So how is this not a request for a proposal for a physical proposal, but I find a request for them to install a bike lane. I wanted to make that very clear. We're asking for them- and I want everyone to understand this and the resolution clearly says it for them to come back to us with a proposal. We are not asking them to install a bike lane by this proposal, yeah but you're, asking for a proposal absolutely or a physically protected way bike Lane, yes, absolutely! But we're asking for a proposal, not the implementation of a bike, link, we're asking for a proposal that would come back to us that we could look, give input and see what works for the community and once they do that, it's conceivable that we can ask DOT to look into all of the things that all of you have raised this evening. Yeah, and hopefully it won't be so much such a big process, because people like Clary will have input, and hopefully you will too Jay and make it a proposal that the board can go for who's next, Steve, Brown, hey, okay, great! So just a couple points, one to be clear. You know I'm going to support this measure, I'm a bicyclist and I support most of the bike lanes or all the bike lanes. I will admit that I sort of agree with Susan's points as well, but I'm going to move forward. I just wanted to use this as a as a few minutes just to make or less than a minute to make a quick point of something that I was about to write an email to, and that is, as we make more bike lanes and as we do this and again, I'm in favor of this. There are some situations or challenges and I've been experiencing a very bad challenge lately and it's became exacerbated by a couple. Recent things. One is with the outdoor seating, which is abutted right next to the bike lanes and number two with all these motorized bikes. I can only tell you that, in my experience, when I'm biking, I'm getting 15 to 20 bikes going the wrong way in a very hazardous way, and I might ask all I'm going to I'm going to send an email to you guys, but I hope that we can come up with a positive way because it's always conflictual when this comes up. But I remember one of the members once said that once you get enough bikes, there should be kind of a herd mentality, we'll all police ourselves. Well, can we get that going? You know and if there's a way to bring groups together, if there's a campaign we can do. I know a lot of these are delivery guys them. I do not mean to demonize delivery, guys, I'm just telling you factually what I'm saying, but perhaps we can send letters and say guys: please encourage people to do this, but I had to pull over I'm 6'3 220.. I got ran off the road twice. I had to pull over five times and I took the time to talk to waitresses, and everyone have said that they're they literally almost every day get almost run over because they only look the one way because they're used to saying it so I'll end. Here, I'm hoping we can address this. I do not mean to bring up the whole thing, I'm not asking for more tickets, but I'm telling you that I believe that this is an issue and I hope in a positive way. We can come up with something that I think it's an aberrant. Behavior, I'm all for biking and I just want to bite better because not considering myself a bike list, so I'll follow up with some emails to you guys. I agree completely steven. Hopefully a network will encourage people to use it by forcing people into the street, maybe you're encouraging that behavior. I do not know, but hopefully that'll happen. Ken. You have to mute yourself. Yes, sorry yeah to Stephen's one of Stephen's concerns. This is a two- way bike lane, unlike the bike Lanes bike lane on Amsterdam or Columbus. So I would not expect people going the wrong way to be an issue or what we're asking for is a proposal for a two- way bike lane and the D.O.T is not going to spend money that they do not have, but we are living in a time when bicycling is exploding. Citibike usage, despite the fact that Midtown is essentially shut down, has increased year to year since last July. So that's an indication of how much it's gone up and this project would be a relatively small investment compared to the enormous benefit of connecting two major bicycle thoroughfares. So we should support it. So howard Louisa had her hand up and then Clary already spoke, but you may want to call on her again: okay, louisa! I do not see your hand but go ahead. Oh she was a physical hand. That's why I'm mentioning it can, I my hand was up. I did not see you, but we got to move this along guys. So please, let's keep going ethel's hand was up for some time. Okay, why do not we do luisa and then ethel and then mark it's your call whether community board members get to speak twice or how to go from there? Well, let's hear let's hear louisa and ethel first and then rich, oh okay, thanks guys, we got ta, move, let's go rich. Is it okay? Thank you. This has been a very enlightening discussion and one that's been very varied. It would have been better if this kind of discussion had taken place at the committee. At this point there is one thing that is clear, although the co- chair of the committee has sometimes made comments that make me think. Perhaps it's not clear, though that may not be his intention. This is supposed to be a resolution to request DOT to begin to investigate a proposal to do what to improve what safety is it to in to implement a bike lane. The chair said not a bike lane, but something grander or something different that deals with the specific concerns that almost everybody has enunciated. I would earnestly suggest that the resolution be simplified or that we vote on it with the following addition, whether we say proposal or not but say that we asked D.O.T to launch a proposal to investigate the need and the design of a bike lane add to it. If you like, and then state that in initiating the proposal that there be a specific timeline and participation and input by members of the community board to DOT as it is studying the proposal, all the other details which are terrific and interesting, can not be put into this and at the same time, we need to make it clear, you're asking for a proposal- and I add, with the continuing comment and participation of the committee for input to DOT and not all the rest of it enlightening as it is now. Okay, just first information at the committee, we extensively discussed this and then we thought several times we're important in the proposal and one was a bike lane and two were pedestrian improvements. That's the conclusion of the committee and that's what's reflected in the resolution: louisa you're up, okay, I agree with Susan that we are going to be. We are in a very difficult financial situation and we should be very careful about what we're asking for what we need and what we want. Two different things. I also agree with Jeanette. We do not want to go in and ask for one small thing and then go back and say: well, we want more and more and more it's better to go in and ask for a master plan study of the entire street in all the aspects of the street, including a bikeway, but you know it's very hard to add later and say: oh, we just thought of it whatever it does not work that way in all my experience very specific of what we want, so maybe we start a little bigger and then see what they come up with and work with them. But one of my questions is: how long does the D.O.T take to come up with these design plans? I do not know, but I assume we'll find out if we pass the resolution again. Our goal was to ask for a modest. There was a strong feeling there needed to be something acrosss town, 72Nd street made sense other than that we're deferring to the D.O.T to come up with a plan. We want to detail, we want. We wanted we're very cognizant of the budgetary realities, so we wanted to ask for something that was deemed important and was very specific, all right, guys understood, but I think that we can I'm sorry about what we asked for. Okay, rich is next yeah three quick points. One is, I agree with Steve people know I have concerns about over enforcement of bikes, but two essential areas that need to be enforced are cycling, the wrong way and cycling on streets. It's a separate issue from this resolution. Apart from that having viable two- way, bike lanes should allow cyclists to ride legally, it's a separate issue for us to work on wrong way and sidewalk cyclists, and I see that as also a bci issue, because I think many are delivery. Cyclists I've been calling for years for a joint transportation, bci meeting to talk about delivery, cyclists, but that's a separate issue in terms of the comments about cost for one. This is a more important issue because of Covid-19, as Ken says, there are many more people biking, including school children. My daughter's middle school is putting up extra racks for kids to be able to ride to school. We need to make sure that everyone, especially kids, are able to ride safely and for those who do not know the D.O.T is a city agency. The MTA is a state agency so saying that D.O.T spending, a small amount of money on bike lanes is taking money from the MTA is not the case. There are different entities, funding them, okay and finally, to Jay's question about we're asking for a proposal that we would then vote on. If we do not like it, we can vote it down. That's the difference between asking for a proposal and asking for a bike lane. That's all. I got okay, so with all possible apologies to clary we're not going to call on people twice, I'm sorry, it's it's 7:50 and we have eight people signed up to speak from the community. So let's go immediately. Help me please to get to Daniel Friedman, followed by Joe R. Are you ready are we on? Are we not unmuted? Can we get Joe R who's, doing the timing, Doug Douglas, my friends should be able to talk now. Okay, thank you, hello, hold on hold on one second, this is you're going to have a minute and a half I'm going to give you a warning in a minute which is 30 seconds to wrap. Okay. Thank you, okay! Yeah! Can everyone hear me? Yes, hi, my name's joe. I live on the upper West side. I'll, be very brief. I really just want to say I approve of the 72nd Street Bike Lane or whatever you want to call it or the proposal for it. There's been over 2000 crashes on 72nd street alone. Since the city started keeping track, four people have been killed. Hundreds more have been injured. Proposals like this are just common sense. Solutions that can save lives, keep people from getting injured and ultimately the city will be better for it. I do not think cost should be as much of a concern as just making sure that these agenda items are like actually capitalized upon in our on people's minds. That's all I want to say thank you for your time. Thank you, let's go to. Did we get Daniel Friedman, I think so. Everybody please mute if you're, not speaking, okay. Well, I think this piecemeal approach to second to 72nd street is kind of a road to ruin a site as an example, the 50 years, I've noticed the devolution of 96th street where more and more infrastructure was put on that street until it became unusable, and I think this is the case where bike lanes will create enough gridlock, so that 72nd street will be able to join 96th street and being dysfunctional, and this whole idea of deferring to DOT is having the correct answer. We have not seen that in the past and you assume that they're going to make it safe and efficient for the buses, yet the buses do not ride efficiently, acrosss town, and then you assume that they're going to spend money intelligently, and yet we do not see that. So it's actually this committee's responsibility to come up with a resolution that works not to defer to say we want an opinion, but at the end of the day we want a protected bike lane so give it to us and we're going to excuse how you spend your money, how the buses run and the safety issues involved. I do not see it. Thank you. Thank you. Mr Freeman we're going next to Hindi Shakhtar. You should be unmuted, go ahead, hi, I'm Hindi Shakhtar, I'm a senior citizen cyclist, I'm also on the steering committee of families for safe streets. I cycle where 72nd street and it is not safe. In its current configuration unsafe streets lead to unnecessary deaths. I would like to prevent mine and that of many other cyclists. When I hear people say we do not have the money for a simple bike lane that can save lives. I think oh no central, Park, West Madison lied in all over again. We get very excited after the death. No, this time. Let's do it in the right chronological order, let's get the protected bicycling where we need it before the death. Thank you. Thank you very much, Justin Gundlach, please. Thank you I'll, be very brief. I've been biking in cities for about 10 years and two cities five years here in New York. I commute I'm going to be commuting with my toddler now that we're not using the subway as much in the last two three weeks, I've had my spouse and multiple different friends. Ask me to shop around them around the city to try to learn how to bike safely. These are people who are eager to do it and to do it for the purpose of commuting, not just as recreation a two- way bike lane for reasons that many have already pointed out is, I think, a significant, a significantly different piece of infrastructure than one- way lane, as Howard mentioned, there is no cross- town artery currently available in this part of the city. This would make an enormous difference and would be extremely valuable to the point about cost. I would say this: I'm not going to present numbers or anything, but this is the chance to push the city to lay down bike lanes. It has been slow. It's been a shame that it's been slow, but if community groups like this can make the point the city, I think, will hear them thanks. Thank you. Let's go to nicole painter who's, the executive director of the Columbus avenue business improvement district. Thank you. The Columbus avenue business improvement district fully supports this resolution, asking for a plan for a protected bike playing along 72nd street and an overall safe for 72nd street. The Columbus Avenue bike Lane has been a valuable and much views linked to Columbus avenue in the upper West side from other parts of the city. We believe a protective bike lane on 72nd street will strengthen the web tying Central park, the Hudson river greenway and the east side to Columbus avenue, stores, restaurants and museums. The protected bike lane and safer 72nd street will make our area more accessible to local residents. Shoppers and eventually tourists. This increased foot and bike traffic will help our local merchants and small business owners who are struggling now more than ever. Thank you. Thank you. Lisa! Let's go to Lisa, I'm sorry, that's nicole! We're going to go next to Lisa Orman Lisa hi! I'm Lisa Orman, director of Streettopia upper West side, as people have said, we're in the midst of a bike boom. Bike stores have sold out even with no school in session, and many people working from home, CitiBike rides are at all time highs. Kids are learning to bike, and I know of many who have purchased bikes in the hopes of riding to school, including my 12 year old and there's currently not one way to safely cross the upper West side in a protected lane. This excludes many people from using a bike to get around town to drop kids at school or bike to work in May our campaign surveyed upper West siders and asked about their commuting patterns and habits. By far the biggest mode shift was from subway use to bike use and not surprising to us. 72Nd street was the most popular crosstown street where people wanted a protected bike lane. If we're talking about money, every dollar spent on a bike lane returns 24 in Healthcare savings pollution and traffic bike lanes, bring business as Nicole just said. Tourists and a neighborhood want where people want to live. I think we can't afford not to invest in our streets like this. The city is expanding, their costs down corridors and a quest to create an actual network of bike. Lanes car lanes do not suddenly stop, but bike lanes do protected. Bike lanes are good for business, they're, good for the environment but, most importantly, protected bike lanes, protect people all people, let's keep building a neighborhood that protects kids, seniors and everyone in between. Thank you. Thank you. Let's keep going to Andrew Rosenthal go ahead. Okay, good evening most people have made some of the points I wanted to make. I wanted to address two things. One is bike lanes mean fewer pedestrian injuries. There's a lot of talk all the time when we talk about bike lanes and people about pedestrians, almost getting hit or even getting hit. But if you look at the data, pedestrians are safer when there's a bike lane one two. I personally collected hundreds and hundreds of signatures on petitions in support of a West 72Nd Street bike lane. So there is a tremendous amount of community support for this. People were literally taking the clipboard out of my hands, as I was passing it down the line. So please vote yes on this resolution, very good. Thank you and our last speaker is Ellen. Azerin Ellen go ahead, hi, I'm Alan Azarin and I live on West, 79Th Street and I'm a cyclist, and I support this resolution. It may not be perfect, but I think it is shameful that on the upper West side we do not have a protected crosstown bike lane so even and to the point about we should take a look at the whole picture. We'll never get anything done. I think this is a start. It's the most obvious place to start, and I wanted to add. The one point that has not been made about 72nd street is that the cyclists who are coming out of the park at 72nd Street add to bike traffic on 72nd street and they need someplace to go. That's safe. So, let's start here I mean it's really time to accept that bicycling is with us, it's it has exploded. We need to deal with it. This is not perfect, it's just a beginning, but let's get started. Thank you very much. Seeing no more public hands and we've already gone through our board. I think it's time to call the question unless there's a change. Oh the question: unless there's a change to the resolution, let's go this one, I'm going to take a roll call vote. So if my, if my secretary is ready, I'm going to call the names, please unmute in advance- and I will call your name- please tell me yes, no abstain or for Cause Barbara Adler. Yes, thank you! Jay Adolf! Oh thank you! Andrew Albert! Yes, thank you! Linda Alexander! Yes, thank you. Rosa arenas. She had a committee meeting a strike vote, so she may not be with us Richard Dash Richard. Ash. Second call mark. Yes, thank you, Richard Stephen Brown! Yes, thank you. Elizabeth Caputo Elizabeth. Are you with us I'll? Come back? Cindy Cardinal? Yes, thank you! Josh Cohen! Yes, thanks Christian Cordova! Yes, thanks Ken Coughlin! Yes, thank you! Paige Cowley! Yes, thank you! Louisa craddock! Yes, thank you! Catherine de Lazaro. Yes, thank you. Mark Diller votes, yes, Bev Donohue! Yes, Robert SBA. Yes, thank you! Lolita Ferran! Yes, thank you, shelly! Fine! Yes, thanks Paul Fisher. Do you want to put yours in the chat? Yes, he said yes, he's a yes! Thank you julian Giordano. Yes, thanks Amy Hyman! Yes, thank you! A madeleine innocent! Yes, thanks audrey Isaacs, yes, Kay carpen! Yes, thanks Natasha Cosmi we'll come back! Doug Kleiman! Yes, thank you! Blanche Lawton, we'll come back Sarah Lynn! Yes, Doug Mcgowan! No! Thank you! Courtney! Clark Matakas! I look Doug's idea yeah and I'm going to go with. Yes, given the lack of that friendly amendment. So yes, okay, yeah. I remember Byron Mitch Nick, yes, Clary newell! No! Thank you! William Ortiz! Yes, thanks Michelle Parker! No thank you! Jeanette Rauch, Mr Spade, I'm sorry Abstain! Thank you! Seema ready, yeah! Yes, thanks, andrew Ridgey, yes, rich robbins! Yes, thank you! Madge Rosenberg! Yes, Melissa Rosenberg! Yes, thank you! Peter Sampton! Yes, thank you. Meg Schmidt is on Leave Susan Schwartz. No! Thank you! Roberta seamer! Yes, ethel sheffer! Ethel! Are you with us? Welcome back polly Spain? I think Paulie had to leave for a union vote uranus in it. No thank you and howard yaris. Yes, the ones I missed, Paulie Spain, Second call ethel sheffer second call ethel. Did you guess the vote? Did we lose ethel says? Yes. Thank you. Second call on rosa arenas she's not here. I did not think so and a second call on Elizabeth Caputo. Is it Elizabeth? I do not see Elizabeth he's not here. Okay. The resolution obviously carries two three, four: five, six, seven, eight nine ten eleven twelve thirteen fourteen fifty I've got 37 in favor looks like one. I had six, no wet epstein. Let's go with that thanks everyone. Thank you all right and the last resolution is going to be from parks and Environment, Clary and Elizabeth. I assume it's clary. I do not know whether Elizabeth is back but I'll start and in any event I was the primary author of this one. So what this is about is and I'll give a little bit of background and then turn to to speakers is Gail Brewer. When she was a member of the City Council did us park users and were all park users an enormous service back about 10 years ago, by getting an amendment of the City Council to the New York City Clean Air Act that prohibited smoking in parks in order to get the votes of some of her co- council members, as she very kindly came to our committee meeting and explained to us she needed to build in some exceptions that have remained in the law ever since. Although, since that no smoking in park, Slow has passed the it has been extended to vaping, as well as other tobacco products, which is how it reads. So we now have enormous use of our parks. We have enormously more concern about secondhand smoke than we did. The cove situation has just made our parks even more crowded. We've had tons of complaints about the. I should say that the three exceptions are sidewalks around the edges of parks, parking, lots in parks and what I will call medians, which is essentially something like the Broadway mall, the pedestrian parts of the Broadway malls. So, while I was the author of this- and this is initiated by our committee, it was really brought to our attention and I want to thank Janice horowitz, a member of the community who really pushed for us to put it on our agenda mark. I just want to say before we continue three a janus and two other members of the community, who represent very broad bases in the community, contacted me before this meeting and said they want to speak, and I assured them that we would call on them. I do not know one way or another whether they've done this sign up thing. I did not know about it until this meeting. I do want to have we're all set, I'm we're in the process of calling on them. Please just get to your resolution and then we'll call it okay. So what the resolution does is it asks the city Council to pass to pass an amendment to the Clean Air Act. That would eliminate the exceptions to the no smoking law in parks, so that essentially parks would be entirely smoke free, that's the shortest way to say it. I'd like to call on Janus, Horowitz and and two other members of the of the Vaginas first to other members of the public and then, of course, we'll hear from the from Board members Dennis. Can you hear me? Yes, we can keep going please. So thank you clary. So it's actually it's kind of a little thing, but I'll just start with everybody agrees about the dangers of sexual health and that's why Gail Brewer pushed to have abandoned her heartland and it's abandoned offices and restaurants and outside in front of office buildings and, as clary said when the land was created, and it was quite some time ago, a decade ago there were these exemptions, with exceptions made for the part of the park that runs around the Edges Dennis. You need to speak up and move closer to your mic. Oh okay! So, as clary said, when this band this decade- old band was created, there were these exemptions made with a park land that runs along the edges of the park where people have to sit on a denture, and we all know that janice. You need to speak closer to your mic. Okay is not that better. I'm like in the mind is that better a little! Oh! Is this? Maybe I'm going to use my husband's computer. Let me take that one. No all right. I hope you guys can hear me how's that that's better just keep going janice, but stay tuned, we're very short on time. So we need you to move along please. So these edges are called park, perimeters, okay, so, as people have mentioned, this happens to be the part of the park that's being used now more than ever. The whole park is so here's why it's critical now, in the time of Covid-19, to close up the get rid of those exemptions and have smoking ban on all of parkland and it's very simple in order to smoke, workers need to remove their masks and that creates a coded risk infection for the rest of us, meaning our senior neighbors, who may not make their way into the park. The parkland that's in the park moms with strollers, who sit on those benches, a kid anybody who wants to enjoy that part of the park is being exposed for long stretches of time to people without masked masks. So, as a result, this area, which is supposed to be risky respite, please wrap up. Okay, is posing a greater risk to the neighborhood, and I really want to make an important point and has become a kind of de facto designated smoking area. But the other big point that I want to make is secondhand smoke poses health problems, as we all know, but there's one other problem, that's paramount in the time of Covid-19 and that is secondhand smoke makes the non- smoker more vulnerable to viral infections. This is something that's been known for decades, so these days, the virus to be concerned about is, of course covered so Ms horowitz. I'm sorry we're going to have to move on. Thank you very much. That was over two minutes all right. So next I'm going to call. I want to call on Ellen Kessler of the West 80S Neighborhood association and then following her Rachel adrico of the Montessori School ellen. Are you with us? I am. Can you hear me? Okay, yeah! Go ahead, hi! Everybody thank you for holding this meeting and inviting me to speak. The West 80S Neighborhood Association totally supports this. We think it's very important to do right now, there's so little we can do against Covid-19, and this is something it's a small thing, but it's an important one. People are going to parks in order to breathe fresh air, yet they have to run the gauntlet of Cigarette smoke, possibly contaminated with the coronavirus. That's not good, and if this committee can do something to stop it, we applaud it. Thank you thanks. So much next one next will be Rachel Adrico and then we'll see who else rachel from the Montessori School Rachel you with Us Rachel Adrico, I'm here. I hope you can all hear me. Yes, okay, good all right, good evening, Community, Board 7! Thank you. For my time. I'm Rachel Rodrico head of school at Metropolitan, Montessori School. Our building is located on 85th street, between west End and Riverside. We serve students just under three years old through sixth grade next Wednesday September 9th, we'll reopen our school to all families. This reopening is based on months of research, analysis policy setting and heavy investment in our facilities to ensure that we minimize the possibility of transmissions as much as possible. During a normal year, our first through sixth graders travel to Riverside park daily for recess classes, crossed at the corner of 85Th and Riverside. Then they travel along the perimeter of Riverside park until usually turning off toward river run playground at 83rd this year. Given the clear difference in transmission rates indoors versus outdoors, we plan to be in Riverside park. Far more often our teachers will be leading classes on the periphery of Riverside several times a day. We hope that these arteries are safe places where people socially distance and wear masks smoking. Cigarettes obviously prevents people from wearing masks as ahead of school. My most important job is to keep students safe, and I believe that eliminating smoking on park perimeters will be an important safety measure this year. May my hope is that you pass a swift resolution to support the ban on smoking in public perimeters of the parks. Thank you so much community board seven. Thank you! Rachel! I'm going to just turn to other people who want to speak. I just want to say one thing. We know that Mark Levine Council member Mark, Levine who's had, I believe, head of the health committee and in the council, is already interested in introducing legislation that we've of the type that we've asked for. But of course we have not asked for it until the board makes its decision tonight. So who else wants to speak? I am not. I guess I do not even know. Okay, let me go back to panelists. There was one more member of the republic who wanted to speak. Thank you very much who is Andrea Troopin and is able to unmute herself well, let's take Andrea first and then go to board members. If that's all right with you Morgan. Yes, please, let's go! Thank you! So much. Can you hear me? Yes, thank you. Thank you just quickly. I want to say that I support very strongly this resolution to ban smoking on the perimeter of parks, in addition to the other areas that were mentioned, like parking lots. I just wanted to ask, however, if there's been any thought given to how this rule or law, whatever it's going to be, can be enforced, because there are two things I'm concerned about. One is increased sort of conflict between you know local residents, people telling people they're not allowed to smoke, you know, arguments etc, and the second thing is a reluctance to send you know people into contact with the police in ways that could be detrimental to them in their lives depending on who they are and what their situation is. So, while I'm very much in favor of this new rule- and I really support it- I feel the same way everybody else does about the secondhand smoke and the Covid-19 etc. I'm very concerned about the practicality of how it might be enforced, and I think it needs to be thought about. Thank you so much for allowing me to speak. Okay, a quick answer to that. We talked about at the committee meeting enforcement is always an issue but having a uniform rule of no smoking in parks period, as combined with another thing we're asking for which is better signage. That's virtually no signage at Riverside park, maybe zero and in other parks should at least help to make everybody understand the rules, the public, please no more than two minutes. Let's go thanks Clara. This is Doug. If I recall correctly, we held two votes during our committee meeting, one for the basic resolution and another specific to the callout for Marijuana, and if I, if I recall correctly, I voted. I personally voted no on the Marijuana inclusion and I'm wondering, if that's your recollection of the vote, and if there is an opportunity to pull that Marijuana inclusion out of the resolution as part of a friendly amendment. I guess I have to respond Doug. Yes, we did have a separate vote because a couple of committee members did not want the part of the resolution that asked to have- and this is just with regard to smoke- it's not regarded in the park not with regard to Marijuana use or brownies or anywhere else or in your house or on the streets. It's all just smoke in the park. There were a couple of board members or committee members who voted against that part of the resolution, but the majority of committee members wanted that in and so it is part of the proposed resolution which makes it very simple. The resolution is no smoking of anything in our parks period. If the City Council will pass that, so that's where it ended up. I think that answers your question. One other quick thing, although he's not with us tonight, Dan Grodnick, who is the executive director executive CEO of the Riverside park, conservancy, has authorized us to say that the Riverside park conservancy supports the smoking ban on the on, particularly on the sidewalks around the park. Okay, next we've got Ken Coughlin Melissa Rosenberger Reign has done it. Okay. I totally support the tobacco part of this, but I do not understand why Marijuana was Gratuis gratuitously added. It's calling for something that's already illegal and while the tobacco thing is essentially self- enforcing and this Marijuana would bring in the police, and I was shocked- I looked up what the statistics are. Marijuana enforcement is just blatantly racist of Marijuana arrests and summonses issued so far in 2020 92 were given to black or hispanic people. Only five percent went to whites, even though use of Marijuana is about equal in the two groups. This tracks data from 2019. Also when somebody is gets a summons, it's a criminal summons and if they miss their court appearance, then that becomes an arrest warrant for them. So we really should not be going here, especially since we just heard from the commanding officer the 20th that they're going to be looking even more closely at drug infractions. That's up to them. We as a board should not be calling for this for more people and Rikers for the deportation of more immigrants and for this incredibly racist enforcement of this law. So I I'm sorry, but I asked for an amendment to to withdraw this. Withdraw the Marijuana part. That's not a friendly amendment Ken. As you know, then I'm making a motion that we withdraw. Well, let's, I think, as we did at the committee, let's continue the discussion and then consult with mark about how to deal with the vote. Is that all right? Mark? Yes, but let's get let's get going Alyssa Rosenberg has done it quickly, agree with everything. Ken just said about not getting Marijuana in the resolution. Also. I kind of wonder if this resolution is meant to you know point to the homeless men smoking in the medium that everyone like hate, that that's happening right now, and it makes me a little suspicious of the timing of this resolution and you know I think we do not need more enforcement by the police on the Marijuana piece and just in general I won't be voting for those. If that's your question, if that's a question melissa, no, the it's not because of the shelters or it's. This is an issue that we've had in mind for a long time and it's about second- hand smoke of any kind in all of our parks. The medians are one example, but it's really about all of our parks arena a couple of comments, but my first is procedurally, I think a resolution that impacts so many residential buildings on the west side of Central Park West, and I'm going to speak specifically about central, Park West. I think this should be we should. We should table this, because what I suspect will happen is that people who currently smoke on the perimeter of central Park and unlike Riverside, there's a buffer there's the perimeter wall, there's shrubs, there's a buffer between the perimeter of the park and a playground or seating inside the park. There are bus stops. There people sit there waiting for the bus, they might pull out a cigarette and I think what may happen is the people who currently sit on the perimeter to have a smoke may go acrosss the street in front of the buildings on Central Park West to have their cigarette they're not going to not smoke on Central Park West, because you've decided that they can't smoke on the perimeter. So it concerns me that a resolution that's going to impact both the residential and park side of the street is not getting a proper airing. I also think that there are people who maybe walk into the park. Smoking might see a park worker. Thank you Doug and then the park worker says you know. Could you just sit on the perimeter with that? There's no parking in there's no smoking inside of the park. So now we've left no alternative place for people to smoke. So I just wanted to say that and Clary. I know you spoke to Betsy Smith, the president of the Central Park Conservancy. Did you ever reach her and if you did, what did she have to say Irena? I did not. I was not my plan to try to speak with her about this. I think one of your community members- I have not excuse me, clary. You called me for her contact information. That's right, but not for me and I got, and I gave it to you, that's correct, but it was not for me. I passed it on the community member that asked for it arena. Okay, so we have. We have that we have a. I do not see any other hands. We have. Oh, I'm sorry, okay, let's go Jay. I just had a quick question clara you describe this as the result would be just no smoking anywhere in any park. Yes and just technically I I'm not familiar with it. The side, the public sidewalk adjacent to central Park, is considered part of the park. Jay that's correct. Around central park. There is a wall most of the way around. There is less of a wall around Riverside park, but in all cases to the to the actual avenues, or you know, Riverside drive that is parkland. That's correct! Okay! I just wanted to be clear: hey could you? Could you explain quickly or briefly why the borough president kept the perimeter out of the legislation? Yes she's, she told us Arena, and I know you were not at the committee meeting. She told us that when she proposed this legislation to amend the Clean Air Act to include not smoking and prophetic prohibiting smoking in parks that in order to get it passed back 10 years ago, or so with some of her other colleagues, she needed to make some compromises at that time, based upon what people were thinking at that time, she would not have proposed these exceptions on her own, but that's what she had to do to get the legislation passed at that time. I think our committee thought that chances are many. Members of the council now have probably somewhat softened their views on these matters. So that's the answer to that mark. Here's what I suggest. I believe that Ken's proposed amendment would be to eliminate the second to the last paragraph, because the smoke the currently the smoke- free air act with regard to parks refers to tobacco products. The second to last paragraph urges it to also apply to Marijuana, if and when Marijuana otherwise becomes legal, because it's as I understand it, it's not now. I want to speak briefly on that point. Then my suggestion is: we take a vote as to whether to amend the proposed resolution to eliminate that paragraph. If it does not pass, we vote on the resolution as it is currently stated. If it does pass, then we vote on the resolution. Minus that paragraph. That's correct! We're coming up, I'm going to take a brief moment of cherish privilege we're coming up on 8:30. This is when I thought we would be further along in this meeting. I want to assure everybody who's holding on to comment that we will have at least an hour of public comment, as promised. It'll just be a little later. You need you all to bear with me, because this is the meeting that we have to have in order to do our work with that clary. Yes, let's let me just say briefly, then, that the the reference to Marijuana and to entirely smoke free and free of all secondhand smoke passed very broadly in the committee and the comments that were made that I'm just going to briefly repeat: were you really do not? At least most of us do not want our kids aside, from the second hand, smoke for everybody, we do not want our kids walking around watching people smoke Marijuana in our parks and well. Let me just leave it at that very strongly as as written in the committee, and so I urge people to vote against Ken's amendment. Does anybody else want to say anything quickly on that or do we vote well we're going to vote we're going to vote on? Oh I'm, sorry, I do want to say something quickly, which is why not just make it all. Smoking is like we're calling for banning of all schools exactly no smoking in the park, not to mention what you smoke. The reason is that the the law is written now defines smoking to be tobacco. That's exactly right! So let me just say one other really! Quick thing: the resolution is not about enforcement. How and when and where, and if ever- enforcement, by whom separate issues not easy issues, but that's not what the resolution is about. The resolution is smoke free, Parks Council, to do that. Okay, let's vote, so we're going to we're going to call the question on Ken's amendment Ken's amendment does this? Can? Where are you there? You are? We're essentially, is to eliminate that second- to- last paragraph that talks about Marijuana. Is that correct? Yes, otherwise, leave it alone all right, so I'm going to take a show of hands vote on this one, and so those are in favor of Ken's amendment. Please raise your hands now and anybody who needs to raise your hand physically. Please do it. So I see Madge is one raising your hand. Rich robbins is two Doug. Mcgowan is three. I do not see any more on this page. Ethel shepherd is four louisa. Craddock is five. I do not see any more on this page and actually I'm going to vote in favor of the amendment. So that's six plus fourteen is two. Oh beb donahue is one more. That's seven plus fifteen. Seven plus fifteen is twenty two okay hands down. Please now those opposed to Ken's amendment those opposed to Ken's amendment hands down for those who are in favor now race. Let's get those hands down, raise hands if you are a second, let's hang on a second I'm going to lower all hands? Okay. Now anybody opposed to Ken's amendment. Please raise your hand. So I see Shelley and Peter is two on the physical hands. Christian is three Richard. Ash is four Steve four, I do not see any other physical hands I got four audrey is five. Audrey is five. Thank you, Paul is six. Thank you. Paul is six. Thank you. So that's six plus eight is fourteen. Did you get Peter Sampton? No, I did not. How did Peter Vote hand is up for what I'm sorry he's voting now. Voting knows all right. So that's 15.! Thank you mark. You did not get me robert. What are you what's your vote against? Thank you. That's 16. anybody else. Okay, we're going to lower those hands. Anybody abstaining. I do not see any physical hands. I'm abstaining. Stop climbing Doug climate is abstaining. Okay, so I've got one plus four batteries going low. I got one plus four: is that right? It's five, so it the so. The amendment fails 22 to 16 to five fails by one vote. Okay, now we'll vote on the resolution in chief, which is what you have had distributed to you and I'm sorry. Clarity hang on one second Shelley, the Res. The amendment failed. Do I have to take a second vote on the resolution you said 22:16 to 5 is not that. Is it that 22 in favor 21 against yes, so passes. Oh, it passes. I'm sorry! Thank you. I'm sorry, my bad a little bit attention tonight, all right, so the resolution carries so now we vote on the resolution with the as amended okay. So now what we're voting on is the resolution that you received in your packet mine. Let me interrupt I'm sorry. Shelley. Do I have to take a second vote? There's a vote, the vote, the vote. Of course we do mark. We have to pass a resolution. Okay, it'll, take less time to debate it. The vote is on the resolution without the last part that was eliminated without the second to the last paragraph. Okay, so now everybody's hands down, please all those in favor of the resolution as amended. I've got me as one madge is two rich is three Doug clyman is four Shelley is five Peter Sampson is six, I've got Christianity seven and that's up for this page donahue is eight Richard. Ash is nine. Louisa is 10., Robert Espir. I do not see Robert. Where is Robert, I see I've got ten audrey Douglas, yes, yeah audrey, yes, Doug Mcgowan is 11.. Audrey is 12.. I do not see Robert SBA. Do you have Robert? Are you? Are you voting? He voted yes, okay, so I've got what I've got. I've got 11 plus. Did you get Doug climbing? Yes, I did Mark, I'm a yes as well. Catherine is 12.. Thank you and a little confused. What are we voting for now? I'm I hate sounds obvious, but this is all smoking in the parks or Linda you're. Voting on the resolution that you received minus the second to the last paragraph. That's precisely what it is! Okay, just strike the second to the last paragraph, okay, so right so I've got all right. We're going to we're going to do this again hands up for everybody who is voting? Yes on the resolution as amended. Please leave your blue hand up. If it's up, I see Beverly Ethel two Richard is three: louisa is four going to the next page. Doug Mcgowan is five, Shelley is six Peter Sampson is seven rich robbins is eight mark, Diller is nine. Christian cordova is ten Catherine De Lazaro was eleven Doug clyman is twelve, and do we get Robert Spa's vote? Did you get mad and louisa Madge is 13. Louise I do not have. I did have yes and audrey is 14.. Thank you. Paul Fisher, 15., 15 plus 22, is 37.. Okay, all right hands down. Please all right! Anybody opposed to the resolution as amended. Please raise your hand now. I see no physical hands and there are three virtual hands. So three against anybody abstaining. Please raise your hand now actually hang on Hang on one. Second, hang on one second, okay! Now anybody abstaining. Please raise your hand! Thank you. I do not see any physical hands, I see four virtual hands and I think that's everybody so the rest of Caputo. Are you abstaining? Let's not talk about votes 37 to 3, to 4 to 0.. Okay. I will tomorrow I'll, send the amendment the final version, with the amendment to penny, and thank you everybody. Thank you all. Okay, so moving on with our agenda, the next thing that we're going to oh the next thing we're going to do. May I have unanimous consent for the approval of the minutes they were sent to. You. Do not moved no moved any objection. I have a comment. I have a comment. There's a mistake on page 10 there's a part about the dogs off leash in central park. It says Susan. I was assaulted by a dog walker in the rambo because and that's it so I can't vote for this. Otherwise I would approve the minutes. I do not know how to handle that mark. What would the rest of the sentence be? Well, the long explanation of what happened, which I do not want to go into now, but just so you will send me so may I have consent to adopt Susan's completion of that port of this portion of the minutes and then adopt them. Please! Yes, I apologize. I apologize in capital letter, not reading it earlier. I'm sorry no worries we'll get it done all right, so it looks like so I unless there's anybody opposed, I will consider those minutes adopted. Thank you. Next thing is we're actually I'm going to pivot and I think there's only two elected officials that are that have joined us unless gail Brewer is here, so I'm going to quickly go to our elected officials, as you can hear in the tone of my voice. My my apologies for moving everybody fast tonight, but we've got a lot of people in our in our waiting room who want to speak for themselves and I promise them at least an hour and I'm going to hold that hold us to that promise. So if our elected officials could out everybody's here all right, so we're going to call in this order. Gail Brewer Helen Rosenthal and Brad Hoyleman, and I do not think there's anybody else unless somebody else okay here also I've been in it. Oh hey, Senator, Jackson. Thank you all right. We're going to we're going to we're going to yeah hello, a procedural question, quick. Yes, sir, in your report you talked about a series of small meetings with stakeholders on the homeless issue, and I was wondering if the board can have notice of these meetings and who the participants are. I will do that offline. Thank you, okay. The I mean the short answer is that so far has been the co- chairs of Hhs and Bci, and I am looking to expand that both with stakeholder representatives and with other members of our board, so is Gail Brewer here and ready to stroke, I'm ready to go and I'll be one minute. I'm going to go very appreciate it. Thank you number one on terms of the hotels without getting into any specifics. Thanks to the board and all the elected officials, we wrote to see banks have a list of questions. We have not gotten an answer. That's the simple version. Number two is in terms of the census, I know we're all sick of it, but I will tell you that we have sent out two postcards 140,000 each. We just got the list of the persons who have left we have and sent and asked for absentee ballots, 35,000 from the borough of Manhattan, and each one of them is going to get a letter in their temporary residence, reminding them that they live in New York city in Manhattan, and they need to use that address. Those are the two things specifically and, of course, we gave out 215 dollars first for President. Do that so community groups, from the top to the bottom of Manhattan, saying get out on the streets and they've been doing that in terms of the census in terms of schools. We know what's going on, but I did write to the mayor and say why is he withholding 12 million dollars of our capital money that we allocated not this year but last year for gems ventilation, technology that could be used for virtual etc? And I do not have an answer. The monumental women's statue is up. I was very pleased to be part of it if you have not seen it in central park. You should go the suffragists look fantastic in terms of the high holidays for the jewish community. We wrote to parks, education and transportation, because so many local synagogues need outdoor space and we're waiting to hear back from them. I want to thank Linda Alexander for joining us all up and down Manhattan for our small business crawl. We gave out it was 95 degrees, but not only on the West side, but from the top to the bottom. We gave out the usual mask sanitizer and cookies fortune cookies, that talk about the census and then finally, we did send Cantilever building 251 West 91St street, I think, is outrageous. We sent a strong letter to Michael Dell Mr computer man saying this is ridiculous. Thank you very much. Thank you. Councilmember Rosenthal. Can you give us just I'm really begging everybody for just two minutes, please. So in addition to what Gail just said, I just got off a very productive conversation with Ps9 and 87 parents who had concerns about their children, walking to and from school. At pick up and drop off, we had a great conversation. Captain Zuber was on the line, did a great job, reassuring parents, letting them know exactly the additional coverage. I think it was a really productive conversation and there will be another stakeholder meeting as Mark is going to talk about offline before school starts, so they are in touch. The principals all are in touch with the 20th precinct, and that is very reassuring and I've told him a dozen times and texted him even again five minutes ago that I really appreciate him for all the work that you've been doing captain around keeping upper West siders safe. You know the Narcotics Drug bust that you facilitated. I just can't thank you enough for all of your hard work. As you know, I called shay, and let him know that I think that and lastly, we'll be sending out an email tomorrow about how parents who want to donate their pandemic ebt cards, how they can do that if they want to donate to families in need again sign up for my emails, you can go to helenrosenthal.com and you'll. Get all this information mark. You are constant, hardly and- and I am so grateful- I mean no disrespect to all our wonderful elected officials. I just have to move us along. So thank you very much and thanks for mentioning that captain Zuber is increasing patrols around area schools. I'm going to go next to Senator, Robert Jackson Senator, you look like you're unmuted. Please go ahead, I'm okay! So listen! First! Thank you. I've been following your community board from the beginning and obviously you have a lot going on, but I wanted to say that I stood with Brad Holman yesterday and activists about the U.S postal service in respect to the lock boxes that we're trying to get all over the state. He said it costs about four to five million dollars. In order to do that- and I said this is about democracy, making sure that everyone has the opportunity to vote with respect to absentee ballots and what have you? So that's one thing number two on September 9th there is a forum on public safety in which I am going to be having Jamal Bowman and others that will be speaking on the issue of public safety. I will email anyone of the 183 people that listening to what's going on now, my upline updated email list which basically has all of the information. But I wanted to say that the budget is a big thing. That's obviously happening New York City, five billion dollars is going to be approved by the state legislature down the road. We do not know when, as you know, de Blasio put the layoffs on hold momentarily, but then the state of New York obviously is waiting for the federal government to come through. If not, then we, the state legislature, is going to have to deal with taxing increased tax on the wealthiest new yorkers, 119 billionaires and thousands of millionaires in order to make sure that the state of New York survived this pandemic. They have a lot more to say, but I can mark I'm going to email you if you send it out to your entire CB7. I appreciate it very much senator absolutely we already have a couple of. I should note for the crowd that all of the staffs of elected officials that could not appear in person have waived their time to speak, and I thank them all for that, and we will do an e- blast tomorrow with any flyers that any of you send to us in a form that we can upload. Thank you very much. Senator Jackson. Turning immediately to Senator, Hoyleman, Brad, Hoyleman you're welcome to Community Board seven, and we are counting on your on you, my efficiency. Yes, thank you mark. Thank you for that great. Thank you for that great discussion about homelessness and to my colleagues and Bro President Bureau for helping organize that it was very informative. I hope the community got a lot out of it and we are, you know, hopefully charting a path forward on that. Secondly, as Senator Jackson mentioned, we had a a press conference to call for secure ballot drop boxes to be distributed. Acrosss, the state 33 states acrosss this nation, plus the District of Columbia, have the opportunity for voters to go to these secure ballot drop boxes to vote rather than going to the U.S postal service, which we know is being underfunded and undermined by the Trump Administration or having to wait in line or go to a polling site which will endanger their health. So I'm hopeful that with Senator Jackson's support and the borough president who was with us, we can get that done and then finally, I want to say, I strongly support our teachers Union in delaying the opening of schools until we have a plan from the Division Administration, where staff Teachers administration feels comfortable, there's nothing more important than a safe workplace. Thank you mark back to you. Thank you so much mark on that point. You know they did delay. Remote learning was start on September 16th and in personally it will start on September 21st. Thank you very much Christian. Thank you very much Senator Hoyleman and apply for your ballots now. Thank you very much. Last but not least, of course, is our other council member from our district is Mark Levine Mark. They set a high bar for you, but here you go, I'm going to try and beat it. By being brief, thank you for running such a tight meeting. Really incredible. Yes, we are drafting legislation on prohibiting smoking in some of the marginal park areas. The input that you all offered tonight was incredibly helpful around some of the points you made. I particularly appreciated so we'll make a point of reaching out to you as a board to discuss how you want to shape this legislation as it's being drafted and as Senator Hoyleman and Kristin just mentioned big news on the school front today pushing back in personal learning by 11 days and introduction of mandatory random testing. This was a major demand of the unions. It's going to mean 10 to 20 percent of every school community is including parents and students are going to be tested once per month a rapid turnaround test of 48 hours. A single positive will mean that a student or teacher's pod will go on quarantine for 14 days and a second positive in a school will shut down the building until contact tracers can determine the source of the spread if there is a city- wide positivity rate above three percent right, one percent right now, but if we pass three percent, then the whole system will revert back to online learning only and because there's incredible inequality in the positivity rate, city- wide right now, luckily CB7 is- has got much lower levels. There's an action plan in place for neighborhoods, which tend to be low- income communities of color if they, if they surpass three percent for testing and social services, and more so big news on that front, I'll, wrap it up there and appreciate the time. Thank you. Everybody be safe. Thank you! So much. Thank you. Council member and I've been told that Linda Rosenthal has joined us assembly member we're trying to move this along real quickly. So if you can have a couple of quick points for us, we'll be glad to recognize, you welcome to Community Board, seven hi. Thank you very much. Mr Diller, so I'll go quickly, I'm having a census phone bank on September 14th at 5:30, and this is to call West siders West siders usually have a great response rate, but not so much this year, which is true around the city and we really have to amp up the numbers so call my office if you're interested we're also having a virtual blood drive. But you do have to go, give your blood in person- and it goes till September 19th call my office if you're interested and the parks Department early decision to deny permits for youth sports was ridiculous and I was contacted by hundreds of constituents. I wrote to the parks, commissioner, and they reversed that decision, which I applaud. Governor Cuomo signed a law into law, one of my bills, granting good samaritan protections for people who use naloxone, and this is like a broad protection. If you're in a beauty salon, if you're in a library anywhere you are, and you administer naloxone to save a life, you will be protected from any kind of suit, but it encourages the use- and we know people overdose everywhere, which is another reason to have my safe consumption spaces. Bill become law, people go there, they use no one dies in any of those places and I think I'll end there. Thank you so much assembly member Rosenthal, it's great to see all of you here with us at Community, Board, seven and given the length of our meeting tonight, I'm very grateful for everybody honoring the the quick turnaround of these comments, and I will call out later the names of the staffs of elected officials. But right now I want to turn immediately to our executive. I'm sorry, our election committee and that's Josh Cohen. It is time for us to nominate officers for next year. Josh. Can you take it away? Yes, thank you mark. My name is Josh Cohen, I'm the chair of the election. Yes Shelley, you have your hand up. I can't hear you not on you jelly. Are you starting nominations? Yes, we are. I would like to well let Josh do his thing. Okay, go ahead, we're going to accept nominations for the board in this order. Chair there'll be two vice chairs and two co- secretaries. So I'd like to first open the floor for nominations for chair. Yes, Shelley. I could nominate Mark Diller Hey. Are there any other nominations for chair anybody? I do not see everybody if there is speak mark. Do you accept this nomination for chair? Yes, I do, and I thank my colleagues for nominating me thank you and I'll move to close nominations for chair, so move that good, okay, I'd like to offer open the floor for nominations for Vice chair. I nominate the climate okay. I nominate Andrew Ridgey second back in okay. Anybody else have anyone to nominate yeah I'd like to nominate sema ready. Okay, second, thank you. Anyone else, okay nominations for vice chair are closed. Would now like to open the floor for close secretaries, I'd like to nominate julian Giordano Second, I'd like to nominate Beverly, Donohue. Second, okay, anybody else. I move to close nominations. Okay, I I'm sorry. I apologize, but I meant to ask Doug if he accepts the nomination, for I do and Andrew Ridgie. Do you accept the nomination for vice chair? I do thank you very much. You're welcome and sema. Do you accept the nomination for vice chair sure? Okay, thank you and Julian. Do you accept the nomination for co- secretary? Yes and Beverly? Do you accept the nomination for co- secretary? Yes, excellent? Okay, so all the nominations are closed. I guess I'll read off the names. There's one nomination for chair, that's Mark Tiller for vice chair. There are three Doug climbing Andrew, Ridgie and seymour reddy and for co- secretary julian Giordano and Beverly Donohue. Anybody have anything they'd like to add nominations are closed. Mark will stay in the election process since we will not be in first okay. So earlier today, I emailed to everybody a proposed amendment. I want to give my special thanks to a bunch of folks who were on a on a training last week that pointed out to us that we have to have a bylaws amendment in order to vote anyway, other than by a written paper ballot, which is what our bylaws say. Obviously we're not getting together next month and exchanging written paper ballots unless the governor has some surprises for us. So so the resolution is a bylaws amendment and I need to or we need to give 30 days advanced notice in order to be able to vote on it next month. So next month we will vote on this resolution. Hopefully it'll pass, and then we will and the resolution calls for an electronic means using something called a Google form, and I will promise to learn more about it between now and then use a google form that will allow you to vote in real time, because the open meetings law still applies to us. It's just that we do not have to be in the same room, and so the open meetings law says that the rest of our bylaws apply and then the voting has to take place in real time, which is why we can't do it by email or by any other means. That would have been a lot more simple. If we can't get that to work, then the only other option will be to do a roll call vote where you announce your votes for each of the things we just said that is always available to us, but please take a look at the the resolution and proposed amendment, which would only take Pl should only be in effect for actually 13 months. It would be in effect for for a year and a month while and hopefully by then we will no longer be holding virtual meetings. That is my notification to you of a proposed bylaws amendment which, according to our current bylaws, is required in order to vote on it next month. If there are any questions I'll take them now, but this is the kind of thing that I'd be happy to answer. Questions about Offline, there's no question to call: we do not vote. I have a quick suggestion: do we need a month notice for any amendments to it? In which case I want to read something new? Yes, no, you do not the bylaws say that amendments can be entertained and adopted. On the night of the vote, we have to move the amendment of the res, the bylaw change tonight. We do not have to vote on it, so we so it's on the table. Okay, can we change it after tonight? Yes, okay and just really quickly. My comment would be that we should not limit ourselves to just a year that if we want the option after this, why not leave it on the table and we do not have to use it open means all will probably prevent that, but I'm not opposed to it. Well, I would say that, as long as we're doing virtual meetings just to apply during that period, okay, all right then consider the consider the proposal amended that, as Christian just said, the movie moved. The proposal proposed Bylaw amendment tonight and we need a second okay and so it'll be on the agenda for our October meeting given the hour and how many people are waiting. I'm going to waive my chairs report. There were two members of our board that wanted to be heard on issues, and so I will ask both roberta and then catherine to be quick, but I'm going to call on each of you so first we now have a link on our website for people who want to get their ballot to vote by mail. So it's on our website so and you can also ask for a absentee ballot, a claiming a an illness and everyone's entitled to it, and you can do it online, so you can email it, so you do not have to do it by snail mail. The other thing I want to say is that the census is finished the end of this month. So please encourage everybody. You know to sign up for the census. Thank you. Thank you very much, catherine. I'm sorry go ahead. Thank you. Roberta Catherine, De Lazaro. You had something you wanted to share. Yes, thank you mark. My name is Catherine de Lazaro, I'm a committed member of Community Board 7.. I speak directly to the board and to the community out of the genuine appreciation for all the efforts that everyone is making to address our community's needs during this challenging time. I respect everyone on the board, the perspectives you bring and the work you do. I especially appreciate the leadership of our chair, Mark Diller. He has been compassionate, fair and inclusive, and he cares just as we all do about our community. Mark's responsibility as share is not to fix problems but to listen, communicate the facts and provide guidance in helping our community navigate the system together he's doing an admirable job in the midst of difficulty. I want to thank Mark and say that many of us respect you support you and appreciate you for the work that you do on behalf of our community. I stand by your leadership 100. It's important that we listen to and see the best in each other and recognize that, as we work together to address contentious issues and sometimes painful personal circumstances, we each approach situations differently, and that is a strength which will help us arrive at better understandings on the board. In my experience, we care about working with those with whom we disagree and learning from each other as we stay grounded in the reality of our limitations and focus on the practical and meaningful steps we can take to establish board processes and structures. We continue to grow and we want to do better and that's because we care our focus should be on caring about all of our neighbors and each other, and that is what mark and many on the board and community model for us. So thank you mark and everyone, and I look forward to working together in the days ahead and that's what I wanted to say. Thank you. Well, thank you, catherine. That was as embarrassing a moment in the community board as I've ever experienced anyway. Thank you and thank you for your thoughts about all the rest of our board. Members and their commitment, it is a privilege to lead a group of so many smart and committed people, and with that I am going to we're going to turn to our public session. But I do so I'm going to ask rich and or Christian to please drop the link for the for the sign up again in because they're not there are not. There are 112 people in the room, but only about a dozen or so people that signed up to speak, which I find you know mark. I I've been posting it every few minutes and just did a few minutes ago. I will do so again, but let's just remind people that if you want to speak in the public session which is coming up now, you need to fill out the form you need to go to chat and click on the link which is bit DOT Lee and then some more text which I'll put in chat. It's bit., CB7 speaker, request, Sept 2020 and you have to get every letter correct, so go to chat and look for that link. So if you go to chat, you can either copy it and paste it or you can just click on it right. Yes, okay, just click on it all right. So I'm going to start with a couple of folks that I know that most folks here are here to talk about Safety, Street, homelessness, the shelter homeless and a few other things. So I will there were a couple of folks with very quick updates, I'm going to call on Zach Campbell from the gilder Center. Sorry, I'm! Since I'm going to be doing the time. I want to be very clear with everyone we're going to be equal and fair. Can we set the time that everybody is allowed to speak, and I will respectfully remind them same as when we were doing public speakers where it's a minute, 30, please, if you're in the middle of a sentence, we'll let you finish it, but we really do need to make sure that, with all these people in the room, I feel a great responsibility to make sure that we get to as many of you as possible. We can't possibly get to 100 people, but we'll do our very best, so zach campbell, followed by my phone turning off no zach campbell, followed by Timothy Harrell, followed by Susan Peters, followed by Peter Arnson, and then we will get to other topics go ahead. Please zach! Thank you! Mark Zach Campbell, here community liaison for the American Museum of natural history. Just levity is brevity here: the museum's preparing to open on September 2nd tomorrow for members and then on September 9th for the general public. The museum will be ready to deliver a blend of physical and digital experiences for all audiences created by staff, working both in the building and remotely and continue to provide unique offerings and benefits to our dedicated community of museum members and visitors. For more details about the plans for the reopening. Please go to www.amnh.org plan your visit or just go to the amnh.org webpage and navigate in the sidebar. At the last CB7 meeting, I noted that work on the gilder center project continued and we were in accordance with phase one guidelines from the city and state with Covid-19 health and safety measures in place. Since then, work has progressed on some of our excavation and foundation phase to the completion of the case on drilling operations. Our work will continue through September, including approximately the same number of truck deliveries from 10 to 20 trucks on average arriving per day, we'll be pouring concrete for the slab on grade, as well as doing below grade plumbing and intermittent soil and rock removal. Thank you very much. Thanks zach Timothy Harrell from the Ccrb he's no longer on, so you want to move to the dozen Peters from us. I think she's, a constituent! Yes, can you hear me? Yes, please go ahead great, I'm here to request that you all fulfill your mission statement of providing a safe environment for our neighborhood. I wish to bring to your attention the mounting on our neighborhood public light posts of 5 g antennas owned by private telecom corporations. This brings into the neighborhood an exposure to high frequency radiation that thousands of independent scientific studies have warned about many ill health effects. In 2013, the American Academy of Pediatrics sent a formal letter to the Fcc, complaining that its wireless radiation exposure limit do not account for the unique physiological vulnerabilities of children, the limits set by the Fcc from 1996 and have not been updated. How many young people and children had cell phones in 1996 and how much radiation was coming from them? How many young people today will be dealing with cancer going forward this law? The telecommunications act left the authority to state and local government to protect the safety and health of their residents. I strongly urge the board to educate yourselves about this monumental issue. I would be willing to put you in contact with experts in the law, the technology and the effects on health. Thank you. Thank you very much. We're going next to Peter Arenson from the Columbus Amsterdam bid. Can you hear me yes, go right ahead. Great thanks! Peter arson with Columbus Amsterdam bid, wanted to alert you all to our open streets for restaurants, starting at 97th street and going up to 110Th street is on both saturdays and sundays, and the streets are open for people to walk or ride on from noon. Till 9 pm and the restaurants are open and have seating out into the street so that it's safer. So there's about 30 restaurants that are able to take advantage of that on Amsterdam avenue, so really appreciate that we also are going to be taking care of trees with a tree stewardship program. We've been doing that for over a year, but we're collecting more stewards to continue that work and people can reach us through our email at info. Columbus Amsterdam bid last couple of things is that there is compost collection happening at the 107Th Street community Garden, that's at 107Th and Columbus Avenue thirty seconds wednesdays from four to six p.m, and then just want to mention that there are really great green markets that have social distancing at 97Th, Street, 114Th, Street and at 110Th and Manhattan avenues so have a good evening or night whatever. It is at this point thanks. Thank you, I'm not completely understanding what rich is sending me. So, while we figure that out between he and I I'm going to call on- let's see, there were two other non- hotel speakers, Martha Dwyer- who should go next, okay and then we have one person, Ashley Gonzalez, who can go after Martha. Let's go in that order, please so Ms Dwyer and then Ms Gonzalez. Thank you very much. I am particularly concerned I'm not for against the hotels, I'm more or less for them. I think we should all share the burden, but my concern is wearing a mask and that's going to end social distancing and that's going to be particularly important when parents and kids are going back and forth to school when that happens, and I'm down the street from Lucerne. So I've continually contacted project renewal and sent some pictures because I see guards outside with no masks of mask down project renewal staff outside with no master mask down and many of the clients without masks. There is a rule that everyone signs saying they will wear masks inside outside and otherwise they can be forced to leave. Project renewal is not enforcing that rule. These would be staff guards or residents. Thank you, I'm going to call on Ashley Gonzalez, but I'm going to take a quick moment to say something: the form that I'm we're asking you to fill out. Please do your best with it. We literally created it at six o'clock tonight because we're trying to make sure that we hear from a wide variety of people there is sort of a for or against, and I appreciate that it's difficult to find yourself in one or another of those boxes. So this is in no way indicative of Community board sevens trying to make this into an on off switch. It is simply us trying to make sure that we hear from as wide a variety of people as we possibly can, and we want to hear from as many of you as we can so with that. Please forgive the in artful nature of my drafting or our drafting of that form. I am grateful to the people who created it and it seems like a good tool for this job. Please make the best of it that you can and please do, fill it out so that we can get it get it moving, get keep moving with more people to speak so Ashley Gonzalez, who I believe is from libraries and then and then I'll be back to you. My name is Ashley Gonzalez. I'm just happy to announce that as of next Monday, there are going to be 50 locations open for non- contact grab and go setting on the upper west side. The locations are morningside heights and Riverside. So more libraries are open. If you have a specific question, you can always call 917 ask nypl. Actually the indoor part of the library is still closed, correct. You can place your holds online or, if you call ask mypl we can they can place them on hold for you too. Then all you need to do is go in and grab your book. It's already checked out for you, so you're going to be in and out really quick. Thank you very much you're welcome. So the next person I want to call on is Stanley graz, Goradeski, I'm sorry if I'm mispronouncing to be followed by William Thomas. I do not think I do not see Stanley's with us any longer. Okay, Mr Thomas, to be followed by Ann Kempferr. There is a person named Stan who did not put a last name. Let's see, if he's the person hi, can you guys hear me? Yes? Are you Mr Gorodeski? Yes, thank you. Go ahead. Hi. Thank you for listening to me. I wanted to bring a couple of matters to kind of attention of CB7. One is that help USA when it comes to Bel player hotel is not enforcing the 10 P.M curfew. There's people coming in 10:11 12,1 o'clock in the morning and I've noted it and I've kind of sent emails about it, but nothing has changed and nothing's been done about it. That's kind of point one point two is that people are kind of standing outside and smoking. It kind of goes to the point of second- hand smoke that was raised earlier today. The guards are not patrolling the block they're, not patrolling the street, as has been mentioned several times. We live on the block. We see people acrosss the street on the church, steps all the time at all hours of the night and the guards are not even walking down on that side of the street and they're, not even walking. They stand on the corner of 77 on Broadway, and they really do not do much and they do not go anywhere and they basically talk to the residents and they're very friendly with them, which is fine but they're, not really trying to make sure that nothing's happening on the block we have witnessed drug deals on the block. We've reported it to the police came said, there's nothing they can do because they did not witness it when we point it out to the people who bought the drugs. The police did not do anything about it because they said they can't do anything about it until they shoot themselves. So I just wanted to kind of bring it to your attention kind of the things that are happening as we see them live, sir. You need to keep calling 3-, 1-, 1 and 9- 1- 1. When you see things we have, we and the police have come and they said they can't do anything because, let's use the data yeah, it is important to keep. Thank you roberta, you're, absolutely right. It's important to keep calling because that's how they collected it as roberta just said so, forgive me for repeating. We will use the data for our DNS and other programs. This is how we try to get more help too, because if I could just amplify Robert is absolutely right and when we ask for more funding for the police department, if that's something that we do as part of our budget requests, they will allocate officers to the places where they have the highest incidences of crime. So it's important to keep okay, so Mr Thomas was it yes. Can you guys hear me? Yes, we sure. Can please go ahead: beautiful hi everyone? My name is William Thomas, I'm here as a member of open, New York we're an all volunteer, independent Pro housing organization, and I just wanted to speak in favor of the continued use of hotels as emergency shelter. I live in the east village, but I feel strongly that these shelters benefit all new Yorkers and I wanted to speak to CB7. From that perspective, we're currently experiencing an eviction crisis on top of a global pandemic and it benefits all new yorkers when those without stable housing are able to social distance. Furthermore, I'd like to add, it is not fair or just to segregate out these emergency shelters to the rest of the city. It's important that wealthy neighborhoods, like the upper West side, accept their fair share of shelters. So poverty is not concentrated in low- income neighborhoods. In fact, I'd say that high- income neighborhoods, like the upper West side, are ideal for people to get back on their feet because they're so close to job centers and really engines of opportunity in their own right, 30 seconds, and then finally, I'd like to address some of the scaremongering, we're likely to hear tonight and emphasize that most homeless people are not troubled, are working and just do not make enough money to afford somewhere to live, but that should not matter because homeless people are human beings and shelter is a human right. So I just want to ask that CB7 proactively, embrace and support these shelters moving forward and make a point to ignore those arguing for them to be moved elsewhere. Thank you, thanks, Ann Kemper, to be followed by Amanda F- I- a- l- k. Is it I'm sorry if I'm mispronouncing- and I only have one these- are I'm quite surprised with the number of people in the in the queue but not signing up to speak? If that's the case, then that's the case, but I want to make sure that I get to as many folks as want to speak. So Ms Amanda is no longer in the meeting. Then the next person is Ankur dalal, followed by Ann Smithey, followed by Jonathan Lindenbaum Mark. What happened to one Kemper, I'm here? Oh, I thought somebody just told me she was not here. I apologize. Please go right ahead. Can you hear me? I guess you can hear me, you sure can go ahead. Okay, great! So I've lived on almost 79 for 15 years. When I first heard about shelter residents being moved to hotels, I decided to keep an open mind and open eyes. I have not seen anything in proportion to the reaction that I've heard from some, although it's of course a difficult time for everybody right now in the city. So since research has shown that for people experiencing substance, abuse and mental health issues which can contribute to chronic homelessness, the best solution is to provide them with housing. First, I'm wondering how CB7 is working to support the transition of shelter residents to permanent housing and increase the amount of affordable housing and sros in the area, since there have already been long- term residents in some of the SRO hotels in the upper West side before the pandemic under a supportive housing program, that's been dwindling as a lack of funding and incentives for owners, and so I'm wondering is helping CB7 work to support getting people into housing and out of hotels and temporary housing. Thank you, I'm seeing in the in a Q&A which we're generally not looking at so apologize if it has not come up yet that the chat button is not working. Is that correct? Well, we found it. No okay, so please use the chat and if I could impose upon rich and and Christian to keep putting the link in there so that everybody can can speak. There's a question in the okay, so I see Nicole Metzger is Ms netsker looking to speak, uncortanal is ready to speak hi. Yes, this is Ankur de La. Thank you for your time. I am a resident of the upper West side for the last seven years and currently a homeowner on 90th street. I'm right, I want to speak in favor of using hotels in the neighborhood for supportive housing. I strongly support the use of hotels for supportive housing, particularly in this time of crisis and Covid-19, and I also want to echo a statement that council member Rosenthal made in her letter about this topic when she said that housing is a human right and I urge Community Board seven to continue with that with the ethic of that of that statement, and I would love for the Community Board to continue to support more housing projects of all kinds, market rate, affordable and supporting housing, supportive housing. This has been a wonderful community and I'm honored to live on the upper West side. I love it here and I want it to be open to as many people who can live here. Thank you. Thank you. Christian do I have another person signed up, they called vesper. Thank you. Miss netsker. Do you want to address sure mark is captain Zuber still on or committing officers uber? I I'm looking for him now. My question is for him. I do not believe someone, no he's, not that I do not believe so, but we can certainly tran well you're, probably in touch with him too, but but we can certainly take your question back to him sure for the record. I just it might be good brothers to hear it as well sure I'd just like to understand of the 12 people who were arrested last night by the 20th precinct, how many of them reside at one of the shelters, either the bella claire or the bellnor or belnord or Lucerne. My answer is that I was told, and so this is secondhand- that nine we're at six worth of Lucerne and three at the Belclair. So I believe that's correct. That's certainly the information I got about 20 minutes before we got on this on this meeting. Okay, I understand there were additional arrests made today and so I'd be seeking that information as well yeah- and I do not have information for you on that- I'm sorry. Thank you. Okay, who's! Next trying to keep this moving maria smithy in that order. Please go ahead, who's, the first one. Oh I'm, sorry, I'm smoothie! Yes, okay, hi! This is Ann Smithy, I'm a resident of the upper West side and like a few people, who've spoken before me. I also just wanted to say I'm definitely in favor of housing. People in the temporary shelters at the hotels, like people have said, allowing people to social distance benefits everybody in New, York City, not just the people who are living in the hotels. I walk around the neighborhood all the time and I have not seen anything like the kind of disorder people are describing and then, finally, just I think it's really important that we all our community we're all part of the same city and we all have an obligation to help people who are down on their luck and going through a tough time, and that includes sheltering them in hotels during a unprecedented pandemic and economic crisis, and thank you for your time. Thank you. Christian who's, the next one you're, not suddenly the bomb. Thank you terribly sorry for the delay. Can you hear me you're all set go ahead all right good evening, everyone! I just want to speak briefly about the shelters I live on, 83rd street. I go down to 79th all the time. I've illustrated some of this in a recent article in Gotham Gazette, and I just want to say that this is a difficult time for everyone and we need to be doing what we can to help some of the most. Unfortunately, situation residents in the entire city, which are which is the massive homeless population in New York, has- and I think, if we can do that, as we've seen based on NYPD reports without really any adverse affects the neighborhood in terms of crime rates, then we should absolutely do that. It's far past the time the upper West side helped our fair share. Thank you. That's all. I have to say thank you very much thanks very much, I'm sorry rich and Christian who's. Next we have Josh Speaker, Tone and Mario left: okay, hey there. Can you hear me? Yes, please go ahead. All right! My name is Josh Pinkerton. I live at 76th, Street and Riverside. I've lived on the upper West side for the last seven years. I want to say that I support the use of these hotels as shelters, visible. Poverty is not an aesthetic inconvenience, it's a call to action instead of trying to move people out of the neighborhood, so we do not have to look at them. We should be trying to face the underlying challenges that they're facing creating more permanent, affordable housing and supportive housing on the upper West side would benefit everyone by providing stability and access to opportunities for low- income residents, reducing segregation and racial inequality and raising wealth, health and education outcomes for all people are homeless, because there are not enough homes we're in the middle of a housing crisis. Our neighborhood has not done its fair share to grow housing in this city, and I think this is the inevitable consequence of that. We need more homes thanks. Thank you who's. Next, I'm Maria Lev hi good evening. Thank you very much. I'd like to just say a second to thank all the volunteers. I'm also a volunteer, I'm working with the group of thirteen 000 residents of the upper West side, who've banded, together as neighbors to talk about and discuss the issue of how hotels, good hotels in our community that have been supporting local businesses and helping our neighborhood really be. A vibrant community have suddenly been used, for you know the important you know goal of helping people who are homeless, but there is a detriment to the neighborhood, and we need to be realistic about this. I want to say that my first concern has to do with the access to decision making. I understand when I wrote to your chairman mark, who was extremely responsive, got back to me immediately that community board seven was not at all involved in the process that led to this and I'd like. I thank you. I'd like to say that I believe that the community board needs to be involved in these important decisions and needs to make sure that the city knows that the community board must listen and must get the community board involved. Second, I am a volunteer, and many of the groups that have spoken on behalf of this issue have highly paid executives and media people who are influencing this, whereas we're just a bunch of neighborhood volunteers with little or no experience in the sophisticated ways of communicating third most important of all. I just want to say that the community has been given very misleading information about sexual offenders and how the reporting of sexual offenders is done in the community level. One offenders are not required to register. We've given been given information that there are no sexual offenders in any of these homeless shelters. That is absolutely patently wrong level. One sex offenders are not required to register, so I just want to make sure that when you have people speaking on behalf of organizations that are making a lot of money, housing, the homeless and providing services to the homeless, that those people are giving accurate information to the neighbors who and I've been living in the neighborhood for 40 years, I'm a lifelong resident of New York City, we have heart, we are heart, we care about our neighbors. We love our neighbors. We want to see the homeless problems solved once and for all. We're not going to do that by sticking our heads in the sand and just going along with the status quo of very well financed groups controlling the conversation and having ex very sophisticated media people controlling the conversation and making the rest of us trying to shame us into silence when we want to solve this problem too. Thank you very much and thank you all for your service. Thank you. Thank you, Ms Liv and rich and Christian who's. Next, I think he had a couple more Bobby Barnett one moment. Can you hear me? Yes, indeed, please go ahead. Great! Thank you! So much hi, my name is Bobby Barnett, I'm a lifelong New, Yorker, a public servant and I live in Chelsea in Manhattan. Like many of you, I walk down the streets of the West side. Every day, most days, I pass a neighbor sleeping on the street. It's really hard not to see how profoundly we have failed. Our homeless neighbors, both our city overall, but also our wealthy neighborhoods, in particular in April, over 60,000 people, acrosss the city crowded into shelters, and that does not even count. The folks who slept on the street homelessness is a real crisis in our city and every neighborhood in New. York really needs to do its part to improve the lives of struggling new yorkers. I urge every one of you to think of your neighbors, who won't receive help without the use of hotels as emergency shelters. Please consider this argument in your opposition and in your votes. Thank you. Thank you. It looks like Christopher Good, followed by nicholas. Is it o- o? Is it who I'm sorry, nicolas who is ready to speak? I have to fight Christopher, okay, go ahead and whisper he's gone hi. This is nicholas. Can you hear me? Thank you, hello. Can you hear me you're good you're good go great yeah. I would like to voice my support for using the the hotels to house the homeless. You know it's. This situation is actually acrosss the city acrosss, I believe, 36 hotels, acrosss the city, not just the ones in upper West side. This is not just an upper West side issue, but a city- wide issue. You know traditional group help. Shelters are major spreading grounds for Kova 19 because you cancelled lead distance, and this endangers the lives of homeless residents and everyone in the city as a whole, and I believe that you know there has been no evidence that this temporary solution has caused any meaningful problems, and I think we have to prioritize the lives and health of the very vulnerable homeless population and all the people in the city over might the minor inconveniences. And, ultimately you know, every neighborhood in the city is sharing in the responsibility of halting the spread of Kova 19, which has already devastated our city, and you know I think the upper West side should also share in this communal responsibility, as with every other neighborhood. Thank you thank you, and the next is Mr good. Is that correct? I have Benjamin Wesler what happened to Christopher good he's gone. Okay. Thank you, Mr Wesler hello. Can you hear me, I think I was having an issue with the mute Button hi. My name is Ben Wetzler, I'm an upper East side resident, not an upper west side resident, but I live or my last apartment before I moved recently, was only two blocks away from a homeless shelter that was operated by. I believe it was open by project renewal if it was not project remote was another one of the really good non- profit, shelter providers that operate in the city, and I never had any issue like the kind that is being described by some of the media reports and some of the people who have spoken tonight describing kind of chaotic scenes and dystopian scenes, and so I am just in kind of utter disbelief, and I would like to say that I support using the hotels you know. I think that there should be if there are not hotels in my neighborhood that are being used for this purpose. I think that there should be because it's definitely better in terms of public health and in terms of our social obligations and I'm really kind of surprised to see. So many people talking about crime and things like that, because that was never my experience. Thanks for joining us is there another speaker signing up Christie diamond go ahead hi, so I just want to speak about you know living here and what my children and I have experienced walking down the street we've experienced men, masturbating walking by cat calling we'd someone follow us home once we feel really. You know uncomfortable of what's going on we're right by the Lucerne. The men stand in front and do not wear masks and smoke and do not social distance, especially since the pandemic gets concerning with what's going on, it seems like it's just adding you know more danger to our neighborhood and for those I'm sorry, that's your 30. Second warning. Please keep going okay and I also just want to say the district shelters. Eighteen, a thousand eight hundred thirty seven individuals as compared to three or five that this district could contribute to this shelter system. Then the district is sheltering six times more people than we were putting into the shelter system, that's more than our fair share, 30 seconds. Now: okay, I'm good! You have more 30 more seconds. You've got 30 more seconds. It was not cutting you up. It's fine! You guys do not really want to hear what we have to say. Oh, that's, absolutely not true! So stop the timer. I will not stand for that, because I'm actually surprised that we that I'm surprised that the way in which the conversation is going- and I want to make sure that we hear from everybody- and I think I think, then you should call on more people that you know have things to say and not just supporters of the shelters that do not live in the neighborhood. So let me be, let me so pause the timer, please. Let me be abundantly clear, miss diamond, because I really think that you're hitting something important and I do not want to be misunderstood- we're calling on people, because these are the people who signed up that's, and there was only one person who signed up in the the category. That said opposed, and I was concerned because we threw this together so quickly that people were reluctant to use. The word opposed, and I wanted to that's why I interrupted before to say that please bear with us, because the terminology may be inappropriate and everybody wants to be heard, as it may be difficult to align yourself with that position. So just please go with the bad language, but we absolutely want to hear from everybody, and we know that. That's why I even called out Ms Metzger before she volunteered to speak, because I want to make sure that we hear from everybody, including all the folks in your group, that we can possibly hear from in one night they're I mean they're. Not no. All right can I just add this and say that everyone who signed up to speak will be speaking. We have three more people signed up, so if anyone is feels they're not being represented, it means that they did not sign up to speak and we have. We have a good another 20 or so minutes that I promised 25 minutes that we promised to listen. So please do sign up. We want to hear from you. We want to hear from you whatever it is that you have to say there is no. There is no screening other than who signed up and who did not. So now I'm going to put the timer back to 30 seconds and give Miss Ms Diamond the chance to finish your remarks. You know what I think I've said enough. I will let other people speak since it's we're crunching on time, so I'll give other people very good, but I do hope you appreciate that or believe me when I tell you that we want to hear from everybody. This is the point. That's why we're extending this meeting beyond its original purpose and we're trying to do our best so who's, next, all right, Miss, Martin and then who's followed by whom, just so they're ready, Kate, Mcdonald and Melinda Thaler. Very good. Thank you, Miss Megan Martin, please go ahead. Do we need to unmute her if she she has the ability to unmute? Okay, Megan? Are you there? Oh hello, can you hear me that's better okay, so I want to make two points. One point is that this is absolutely not a racial issue and that we have a very diverse community. Over 13,000 people are on a facebook page that represent a large proportion of people of color, and many have reached out to us who are particularly offended by the notion that this has anything to do with race. This is a safety, a security and a public health issue, and anyone that wants us to talk about that. This is anything to do with race is being divisive in the community and is totally making this a point that is not enduring about conversation. The second point I want to make is that a large portion of the men who were moved to the Lucerne were from the Washington Jefferson Hotel in Corey Johnson's district, where the same problem that everyone in our community has witnessed increased crime, prostitution, open and illicit drug use, random acts of violence, and it was those community members in Hell's kitchen who reached out to Corey Johnson, and he had them relocated to the Lucerne on July 27th. That also had nothing to do with race, which I want everyone on this community board to please be aware of that had to do with quality of life and the community came up and had spoken to him about, and he felt that it was necessary to do something. So when we're talking about the upper West side as not being welcoming, we all know that is not true. As of 2019, we had 1100 shelter beds in our community. Do you know what the up hurry side had 80.? So as a community, we have always been welcoming to transitional housing. Our own families have always volunteered and lived side by side with many transitional housing and it's been a fabric of our neighborhood. So I want everyone to really take a good look and to see what this issue is about. It's about watching men drop their pants and urinate in front of our children. Having men sit in our playgrounds and openly use illicit drugs and leave needles on the ground. Have our children be frayed? Have our elders be afraid to walk through the medians? This is what this is about, and I think that this is the hard questions that we need to answer. This is not about being anti- homeless, we've always been a welcoming community to the homeless and that's something that we're all very proud about and that we need to get these men's services. They were not getting the services at the Washington Jefferson. They are not getting the services at the Lucerne, they are not getting the services at the Belclair or the bel nord, and we are witnessing this because what is not being given to them within the walls of those hotels are spilling out into our streets, and so, let's maybe take a look and see how those should be addressed because they were what was happened was that all they were done is moved. 30 blocks north to the upper West side. Dhs did not address those problems, they just moved them north and they just moved their problems north. So, let's maybe as a community board and as a community come together and see. How can we really address the real problems, which is the men, need severe services because many are classified as mentally ill and chemically addicted, and that is a very serious problem. Thank you very much for joining the call. The next person is it Miss Taylor? No, it's yes! My failure! Yes, Miss Taylor! Okay, can you hear me we sure, can okay. I want to say that I am very unhappy to hear constant feedback that people walk the streets. They see this as a utopian idyllic community and there are no problems with conflict between residents and that everyone's happy and safe and crime has not been up. I think that we need to be intellectually honest. We can not be dishonest with each other and say that those problems do not exist in our community and for those speakers that already spoke and said you know. Ever since we've had this influx of 700 new residents, I have not noticed any difference in our community. Well, I can tell you I have. There was an incident where a gentleman unprovoked walked up the street threatened to rip my neighbor's dog's head off of his body hurled a trash can at a doorman. This is all caught on video and was called into the police, and then, when I call up Linda Rosenthal's office, and they tell me no, there is no increase in street crime or unrest on the upper West side, that is intellectually dishonest and the prior caller. That said, he supports this situation and you should just ignore the constituents that are not in favor of it. You should not ignore any constituents, we are all constituents and that suggestion to ignore people that you disagree with. That is just as despicable as put telling people they do not have a human right to shelter you. Oh no one's rights are superior to anyone else, and it is not my right to have to be confronted by people that want to rip dogs into shreds and F up the doorman unprovoked. You need to provide security for not just the people that are down on their luck. You also need to provide security for the people that are up on their lock. We are all constituents, we are all human and we all want to be safe. Thank you. Miss Taylor, I'm going to break my own rule and about not commenting on speakers and we'll have a little bit of an opportunity to do that at the end, but I will tell you that community board 7 will always listen to all of our constituents. Thank you very much who's. Next rich. I do not have anyone listed right now and then. The last thing I know like somebody needs okay, very good, go ahead. Hi. Can you hear me? Yes, we sure. Can I just wanted to add my voice to the folks who spoke out in support of the shelter residents staying at the Lucerne. I participated in an event there on Saturday evening, at which a lot of the residents or several of the residents were able to speak out about what it means to them to have the opportunity to stay in that setting where they feel safe safer than they were in the congregate shelters where they were previously staying and that's a voice. That's really been missing on tonight's zoom and I would just urge us all to think about. You know what those residents would say if they were able to be here tonight and consider their perspective as well. Thanks, so much for making the time to hear these public comments. Thank you can we can we put the sign in cheating in the in the chat again just to make sure we're not missing anybody? Okay. So if you're, if you're, if you want to be heard on this- and I do see that there's still 100 people in the attendees and we've got another at least 20 minutes- 15 minutes ready to go. So we want to hear from everybody, and there is no. We just opened up the door. We did not ask anybody. Okay, so let's keep going, but please you know we're here to hear you we're here to hear you did. I say that correctly, so please take advantage of this opportunity and we will do our best to we're just in listening mode. We're not we're not going to comment or anything like that. So mark the someone signed up under the name of Jackie Moffett and there's no person in the meeting named Jackie Moffett, I'm wondering if they signed up with maybe they've got somebody else's and loewy just spoke or just requested, and she can now unmute good. Okay, I'm not sure how to do this. Sorry is that working yeah, we got you. Okay, big noise. In the background guys turn it down. Look I'm going to be really quick. I think Melinda and Megan spoke eloquently. I spoke with someone today who had 10 years working in a psychiatric institution, she's, a medical professional and she got attacked the other day on Broadway lived in the I've lived in a neighborhood. I've been owned on the Upper East side, for you know, four decades, just under four decades. Okay and I'd like to quote a psychiatric professional, she is tired of being and made to feel guilty by the failures of our politicians and the public officials that we elect to help with this horrible situation. We all have a heart. We believe that these people deserve treatment, they're, not getting it in a hotel; they need help, not hotels, and the bottom line is when my daughter walks home at night there was a man last night I saw up alert there. He was having some sort of lewd behavior with the car pulled his pants down on the crime alert. I have three new guests on Columbus avenue. We have the old people as well. Do not tell me that the situation has not gotten way worse in the last few months, and this is a failure not of us as a community who are begging to be kept safe, thirteen-, year- old daughter can walk home from school without me having to worry about her getting attacked. It is not our failure, it is your failure. We do not have a lack of compassion. We want to get these folks help as much as anyone else, but we deserve to be safe. We pay taxes, we elect you to keep us safe and stop guilt- tripping us and stop with the silly racist accusations and the nooses a news. It was a construction wrote Sarah Lind, do not divide us further. Let's agree to get these people help. Let's agree that hotels do not get them the help they need, and let's agree that the situation is certainly worse than it was a few weeks ago or a few months ago, and if we start there, then we can get them to help, but stop pretending that we do not have something here that we have to deal with. That's all I have to say thank you, Amanda Falk hi, thank you for holding this meeting and for giving me time to speak. I just wanted to talk a little bit about my concern about captains. Uber. Sorry, if I'm pronouncing your name wrong. First of all, thank you for the service that you do and I am concerned about recommendations for the public to be taking pictures of either perceived crimes or things that they see going on in the neighborhood. What we know right now is that we are in the middle of a mental health crisis and that one in five people in our country are struggling with mental illness and addiction and that these illnesses do not discriminate. They can impact somebody on a park bench and somebody who sleeps on Park Avenue. They are diseases and illnesses that at their core, are filled and are characterized by a deep sense of shame and self- hatred. You already feel like less of a human when you're experiencing one of these illnesses and to have people take your picture without your approval only makes you feel so much worse about yourself. It's extremely triggering. It is re- traumatizing and it might actually incite violence. It will not keep you safer, it will make them feel unsafe and it could end up escalating a situation. So please do not. Take pictures. Certainly do not post them for 10,000 people to see on a facebook group. I would not want somebody taking my picture. I want somebody one somebody taking my family members, my child's picture, so let's not do that to other people. It's very dehumanizing when we're talking about trying to help disenfranchise people who really need help. Thank you did we call on John June who's? Next, very good, hello. Can you hear me yeah? Go ahead, please! Yes, I just want to share just experience and then one other point, so I volunteer with this group called one block you upper West side where we just clean our blocks, and so one thing that I saw or witnessed myself was walk cleaning, West 70Th Street between West End Avenue. I did find some syringes on the corner and that's just literally down the block from Ps199. So for anyone, who's saying that these things are not happening. I literally witnessed myself. I have pictures of the syringes that I can show, so I mean to have syringes that close to a elementary school is. Concerning I mean I do not have kids myself, but obviously that is of a concern. The other issue is, I was really would want to stress and press that since DHS has not been able to give us a specific time in which they're going to be able to transition away from these hotels, I think it's important that we at least get the criteria that they are using to be able to transition away right. We can't give them a sort of a carp launch to say that they're going to move it whenever they feel like it. There has to be like they said, they're going to use data. So let's get those data points and find out exactly what is the proper criteria to find out when it's possible to move these men from these temporary shelters and then using that criteria, keep them accountable. Thank you. Thank you. Olivia Killian's work. Thank you. Yes, hi can y' all hear me sure. Can okay, I just want to address a couple of the comments that have come recently from some of the other commenters. I am an upper West side resident, I'm at 68th and Columbus. I have not noticed anything, you know any untoward acts on the street, but folks have been asking you know what does this have to do with racism? Why are we accusing people of being racist? First of all, we're not accusing anyone of being racist. All we're trying to say is you know if you can not deny the fact that a majority of the population in the city's homeless shelters are black and brown. I believe the statistic is something like 89 and, of course, Covid-19 is affecting black and brown new yorkers at higher rates and homeless, new yorkers at higher rates than the general population. So these shelters the fact that these temporary shelters are literally saving black and brown lives. The other aspect of this is that it's no accident that our neighborhood is predominantly white and wealthy. It did not used to be that way, but over the years, various urban renewal projects 36. Thank you and other developments have worked to keep the neighborhood, make the neighborhood more white and wealthy and keep it that way which leads to segregation. And you know there is a long history of white people, acrosss all income brackets using their fears and concerns about safety as justifications to exclude affordable housing and homeless shelters from their neighborhoods in effect keeping their neighborhoods majority white. Even if that's not what they say, they intend and, let's be honest, many of these fears are based less on facts and more on anecdotal evidence or unconscious biases and perceptions. So we're not saying everybody's racist. We know everybody has concerns, we just want to find solutions, and we want to be aware of when we might be falling on unconscious biases that have a lot to do with race. Unfortunately, because almost everything in America has to do with race, as we are all learning these days. Thank you very much. Jackie bonfire yeah, I think, is Miss moffitt under christy. Diamond's, yes handle okay! Thank you then go ahead. We can't hear you so if you're trying to speak, please unmute her yeah Miss Moffett. I see you in the chat and we're calling on you and we're. We believe you're under Ms Christy Diamond's login, but is that for me, is that jacqueline off it? Yes, please! Oh, thank goodness. I've been trying and trying okay, so I just want to start by to address the last caller. This whole notion of bringing up racism is such a deflection. It is taking the focus off what this conversation is about, and that is our safety. That is what this conversation is about. I have lived on the upper West side for almost 30 years. I and I resent the Upper East sider, who strolls past the upper West side, wants to give his commentary. This community has always embraced unhoused people we have lived with and continue to live with, 11 shelters. We have more than our fair share of shelters, and I share the compassion and the concern for the homeless and the move to move them here during Covid-19 might have been warranted, but to move them here without the services has been a disaster, and it is intellectually dishonest. I'll quote one of my other speakers to say that there is not unbelievable crime, public defecation, open drug use going on in the street. I live on, West 87Th street. I walked past the belnord tonight there were no guards. There are people hanging out on the stoop and around the corner. There is no one there, so you have taken a mica population and you have provided no services, which we know for a fact, because our own president has spoken to one of the providers who communicated that to her, and you have put this neighborhood in danger and I just want you all to think about that when public school opens and children will be walking past these shelters full of sex offenders and mentally ill men and men who are chemically addicted without access to the necessary services. You are just waiting for a disaster to happen, and it's going to be on all of you all of you you're, not. I have lived here for so long. I have never seen an outcry like this. The reason there is an outcry now is that this is a tipping point. This has gone too far. How dare anyone say we do not have our share of homeless people. Here we are home to 11 shelters that is among the highest in this community in New York City. I am just flabbergasted that you are not seeing what this plan, which might have been done with the best of intentions, but it was not well executed. People are not being well served. This is a disaster in the making. There must be something done about. This is such an unsafe situation for our community and for our children, and I urge you as the board, who have a voice to make the right decision and say, while we did this with the best of intentions, we can not continue to do this. As Megan pointed out, these men were moved from another shelter in Hell's kitchen, where the same problems existed and that Community board acted and they moved them right out of their neighborhood. Unfortunately, they live here now and we are seeing the same problems that existed elsewhere. So I urge the community Board to do the right thing, and I urge the other speakers on this call to think a little bit before you point that racism finger. This is not about racism. This is about safety. Thank you. Are there any other speakers signed up. Yes, did the libyan penis first speak already. She did yes, okay, so Arie Blau, okay, we're coming! You know we're just one or two more. I think, and it does not look like it's a big queue right. I got three right now, three, all right. Let's call it at that three! Okay, so could you say those names, sari Blout, Ben, Roger and Debbie Goldman, very good hi, it's ari black. Can you hear me we sure can alright. So I want to just make four points that I think is getting lost in this debate as an upper West side resident. I think the first is an important point that people want to keep glossing over, but there were multiple hotels in Hell's kitchen, where these men were housed. It was not an emergency Covid-19 action, the same problems existed and instead of DHS and the community. In our legislators working to figure out what failed there and how to fix it when they moved, they just moved them in because they had more responsive elective leaders. I think the second thing I want to note is when you have 13,000 people in a facebook group. You know perception is reality, but reality is perception. You walk around and everybody sees what's happening in the neighborhood. So for people to say it's not happening. Just is not true and we all see what's going on, and people may say: hey we're, okay with that, but a lot of people are not. I think the third you know point I wanted to make is a lot of people on. This call seem to be confusing an affordable housing issue with shelter, bed density issue. The upper West side is fifth out of 59 in shelter, vets. I've heard for whatever reason, all sorts of democratic party leaders from the Upper East side, like Ben Wexler, came on where the Upper East side effectively has no shelter beds. Soho has no shelter beds. So if you, what people want to talk about shelter, bed density, that's a very different thing in the upper West side has always been a leader on, and I think the last point is the racial issue, which is you know. The first thing I would say this is a safety and security issue, but at the same time, if the first thing you think of when you hear homelessness is race or you hear crime in its race, I'd actually say to you might need to check your implicit bias because for a vast majority of upper West siders, including lots of people, we know who are people of color. You know they're offended when people say that, and I think the issue needs to be. Are these men getting the services they need? And why did it fail in Hell's kitchen and what changed here? Nothing's changed here right, we're all seeing it every single day in our neighborhood and at the end of the day, telling these men that, if they want to go, get their method on, they have to either go on a subway or take a van once a week for 45 minutes is not serving the men at all and is not providing them the services they need to get better. And the last point I want to make is simply saying: hey we care about the homeless. We want to get them to have a great life. All of us want that, but the way you do, that is by housing them in facilities that can provide them the services that they need, and there is nobody who realistically thinks that hotels can act, do that, except for people who are really just lost their job down on their luck because of Covid-19 and need the help, but for Micah homeless. That is a very different at- risk population, and we all need to be honest about that and honest about how you help these men and how you provide them the services they desperately need. Thank you. I think we're past time. Are we doug yeah? Thank you. Thank you very much. The next person is brother hi. Can you hear me? Yes, Sir hi, so I just wanted to say I'm hearing a lot about some idea of a fair share of housing for the homeless. It's not a neighborhood by neighborhood numbers rule. The fact that we get this opportunity to help these people in this unbelievable time is a real gift as an upper West side resident. I hear also a lot about these services. Not being enough. We had a great testimony last week from organizations like project renewal, about how difficult it was standing up these shelters quickly during this challenging time and all the services they've been adding since that time it's. There was also mention of like how being about being pro this and worried about those who are against housing, the homeless. That involves racism and that's a conflation there's also conflation of homelessness and crime. That's going on a lot again. This city has gone through an unbelievable shock and you might see changes on your street. I have not seen a huge uptick in crime that other people are anecdotally. Talking about. That's not been my experience living here, but even if it was to conflate that with a couple hundred men who really need a place to live during a pandemic is really inappropriate to me and I'm so thrilled that our community has gotten to house these people. Thank you very much. Thank you and who's. Our last speaker, Debbie Goldman, Ms Goldman. You have the last word from our community. Can you hear me you sure can great, so I did not plan to speak tonight, but some of the comments I thought were warranted a response. My experience are not anecdotal. You can hear I'm getting upset because my life has changed. My family has experienced harassment towards me. I have a daughter and a husband. I worry about her going out she's fortunate enough to have a job, but I have to worry about her personal safety. Every time she leaves the apartment, we've seen drug use, drug deals, public urination, prostitution, harassment towards us and other people. We no longer feel safe in our neighborhood. I personally would love to help those in needs, but not at the risk of my personal safety and the safety of my daughter, and there are a couple of other things. Just many of us struggle. Many of us struggle with mental health and us being stressed out walking in the street only makes our life more difficult. So our mental health matters too, and I would like to tell that woman that said that we're all wealthy are personally not wealthy. So I was offended by that. That's all that I have to say thank you for letting me talk. Thank you for joining us, and so I'm going to wrap this up now, we've kept our word for an hour. We thank everybody who spoke and we will move forward on the ways in which we outlined, and we will certainly, I want to say a quick word of thanks to all of my colleagues, because there's a lot of honest sharing in what we just heard and we did the right thing, which is to listen and not to speak, and so I thank everybody for that. With respect to the board, there are some elected officials still on our call, and I thank them for staying with us well past. I bullied them into a two- minute update and I understand that council member Rosenthal would like to say a few concluding remarks, and so I'm going to call on her and if anybody else wants to do that from our elected officials, I will entertain it and then, and then our and then we'll wrap up our board meeting Councilmember Rosenthal. Thank you for chiming back in thanks, so much mark, and I want to emphasize that you really have done a yeoman's job here tonight I mean it's your full board meeting and you already had a conversation, a community conversation about this topic, so to give people again the space to voice their concerns. I just think is terrific. I really just want to make some points of clarification about a half a dozen people, I'm not going to name them, but about a half a dozen people who spoke tonight about their concerns, we're on the call that we had just prior to this call, which was a call with Ps87 and Ps9 parents and on the call, were the people who really have the answers. So we had captain Zuber there and we had project renewal on the phone and I do not know how to respond, and people are welcome to email me, helen helenrosenthal.com, I mean the same questions are asked over and over and in many ways the same responses are given and I'm trying to figure out where's the disconnect, and I am really wanting to be constructive in helping to make the connection for people. So let me start by saying there's absolutely a problem on the upper West side for those of you who were on the call with ps879 and other school parents. I made that very clear. It is very worrisome. I know people have been accosted. I've talked to many of them. If someone else wants to call me and talk about it feel free to email me, I've returned the calls of four or five dozen people I'm trying to get through them all. So not only do I hear your concerns, I'm seeing them myself, I'm always walking in the district. Today I on the way to work, I said hi to one of the guards you know but saw with my own eyes what was happening on the street. So let's just be clear about a couple of things, because I think we have to notice acknowledge that the NYPD and the social service providers are doing what they've been asked to do so again to clarify any rumors. You know again, please do not believe everything you read in the post, so the reason that people were moved from the project renewal, a shelter that was in the mid 50s. I forget the name. Is it Washington Jefferson or something is because that provider who is located on the lower East side in their congregate shelter at first tried to have some residents stay in the shelter and they moved about half their residence to the hotel. As we said in the call before that did not work out for them, the staff said it very clearly on the call we were just on they stop, which of course, did not double in size now that they have to be at two places. The same number of staff could not handle two different locations. So DHS asked the hotel Trades association, which is keeping the running list of hotels that want to participate and trying to find a match where there would be a hotel that can accommodate all nearly 300 of their residents and all of their staff in one location, the Lucerne responded to that why it was the Lucerne. I can't answer that was that's a job. That is, you know. I do not know why any of the 60 hotels were picked. I do know that nearly all the hotels surrounding the airports are filled in this way with the folks from congregate, shelter who have been moved into hotels, but now all the services are happening at the Lucerne, so when they move social service providers into a temporary hotel situation, all the difference from what they usually do and now is that each of the clients are in their own hotel room or sometimes two to a room, but they still get the services they need. They still meet with their caseworker. They still meet with the mental health professionals, if there's also a psychiatrist where they have telemedicine. Whatever else you can go to my website and see the list of all the services they provide on site. There are some additional health services that are always provided to these shelter residents at the location. On the lower East side, the Van does not come once a week to take people there. The Van transports people there as it's needed and waits there. So people can return. My understanding is they're not on the subway that they in fact use the Van. Let me see there are some other questions that have been answered over and over again, Zuber has said repeatedly: do not risk your own well- being if you're taking a photograph of course, but also, if you've taken a photograph, get it to them, and so- and I congratulated Zuber on this. If you look at from the time the Lucerne came here till now, the NYPD has been doing its work. They reached out to their narcotics unit. Had them come here and do a bust. That is why 12 people were arrested yesterday, four of whom are sellers. The NYPD is not going to stop doing its work. They will continue to watch. They know who these people are. They know if there are going to be new people, if you want to send them a photo, because you see something, of course that can be helpful. He does not want to dissuade you but he's making it clear by sending it to me Helen, Rosenthal or posting it on Facebook. That does not help him, although of course, if you do, I forward it to him, he urges everyone to call 911.. I spoke with a resident two weeks ago, who was as frightened as the woman who just spoke, who was near tears about being harassed herself. Her purse was grabbed by a homeless individual. She fought him off. Some other people helped her fight him off. She was so freaked out rightly so that she went home and talked to her husband about it and three days later, I'm on the phone with the husband. I asked them if they called 911. No, they had not so for all. In all intents and purposes, there is no record of that incident. The pd is simply saying we're here to help with this change, so you have to report these incidents to the pd, so they know about them. Otherwise they can't do their work. So again, if someone has an idea of how this can be communicated more clearly, please let me know, but we are hearing the same questions over and over again and they are being answered. I do not think you like the answers, and I respect that and understand it and hear your fear and concern. Could I know I do not want to take up too much of your time. The last thing I saw this question: what's the criteria to close the hotels and why is it so difficult to get an answer to that question? I feel the frustration. I share the frustration. This whole thing is temporary due to Covid-19, so it is the Department of Health that is making the decisions here. They are the ones making the decisions about schools about restaurants and about when it's safe to return people to the congregate shelters. So as not to have hot spots where we could have a second wave of Covid-19, that's the job of the Department of Health and everyone is leaning on them and I'm sorry, then that means that there's not an answer. We can't say October, 31st, December, 31st, March, 2nd, it's frustrating, I know, but we're trying to have answers to your questions. They are all valid. All of them are valid. All of them are valid. We are trying hard to get answers, but when we provide those answers, I do think that people need to acknowledge those answers. So when people say in meeting after meeting after meeting, there are no social services being provided at these hotels, that is not correct information. It's not please! It's not correct. The correct information is all of the services they were getting when they were in shelter. They are now getting at these temporary hotel placements. All of them NYPD is doing a great job they just and we should all thank them in our own different ways, maybe go on twitter and thank zuber and retweet his tweet about the narcotics arrests. So, okay, thank you. Everyone want to respect and validate everyone's concerns, but I am asking you all to respect and validate the answers that are being given to your questions. Thank you appreciate that Mark. Sorry, thank you. So much council member. I believe that Senator Hoyleman wanted to say a somewhat quicker final word yeah, and I'm going to give him that quick chance and then I think we're going to call this a night. Thank you. I just wanted to thank you mark and everyone who had comments. We, the elected officials, are listening to all of the comments. I wanted to. Thank the council member for her words. You know she's having to do you know. A lot of you know clean up because of an issue that you know was due to Kova and lack of planning. You know was presented to our community with without any notice, and that's just a fact, and I appreciate everything that she's been doing to provide those answers, and it's so important that people continue to speak up in forms like this, so Mark. Thank you for providing that and I do not think being compassionate about homeless, especially doing a Covid-19. You know, 19 scenario is mutually exclusive from needing to know what the plan is going to be moving forward and I'm glad that we're on both tracks. With this conversation. Thank you. Thank you. Senator Rich. I think you had a very important point to make yeah. I just want to make really clear that there are some accusations that not everyone got to speak and that's completely false. Everyone who signed the form requesting to speak was given the opportunity to speak. So. Thank you, Mark. Thank you for everyone for allowing that to happen, but no one can say that they were not given an opportunity to speak very good. Unless I see I believe, we've covered all the business that we need to do tonight and and there's no more nobody else in the sign up. So I'm going to ask for a motion to return. Shelly always seems to be the one that gets to do that. How is it that Shelley is the one that gets in there first. Thank you, shelly. I hear a motion. Do I hear a second back in all right? Is there anybody that objects? Hearing none? I thank everyone for your patience and for your. I I'm actually going to take one more second of your time to thank my colleagues because we were here to listen and that's exactly what we did and I'm certain at one time or another. That may not have been an easy thing to do. Certainly, there have not been a lot of community board meetings at which words like defecation and masturbation are used, and I am just so grateful that everybody hung in there with us. All of us are here all of us, listen to everything that was said by everybody. I could not be more proud of the group that I serve and I thank you for your patience and for your service in this regard. Everybody have a good night thanks Mark. Thank you. Thank you. Mark.",
            "summary": "We are aware that folks are here in part because they are concerned about things that are happening in our community and there is a public session at the end of this meeting.\nThe role of the Community board is one of an advisory body that weighs in on a variety of matters ranging from applications to city government, to issues of concern with respect to I know.\nA lot of folks are here because they're concerned about the overlapping, issues, homelessness and the presence of shelter, clients that are being housed in some of our hotels.\nThere were 1389 people at the highest point on zoom We gave that precisely to we gave over an entire evening to that one issue in recognition of how important it is to so many members of the community.\nThe focus needs to be on representatives at this point, and I know that there are a lot of well- formed groups, and so we will do our best to continue to reach out to them and to hear from them a last thing that I want to make sure that I mentioned before.\nI start turning it over to the business session and potentially to captain Zuber if he is with us, because I know that the NYPD has limited time to speak with us, given all that's going.\nEverybody seems to be talking about the homeless issue, specifically about the shelters going back a couple weeks: now.\nHow have the people who have recently been placed into Lucerne the Belclair, the Beltnord, been affecting the quality of life and there's a perception that there is an increase in drug use, increase in public lewdness, a lot of issues that were not present.\nThe people who are out buying drugs are most likely committing other crimes throughout the day, they're going into the store, they're, stealing a couple of things, so they can sell it for a few dollars on the street so that they can get enough money to buy their drugs throughout the day.\nSo they've come, like I said: they've, come several times to the community board since 2000 for a separate, app window, applications.\nAnd, then Richard Ash, wanted to say something just quickly to follow up on Jay's comment: Nobody living on central park West would voluntarily install a 16 window, and what that will mean is that nobody will change their windows.\nI do not like to think of it as solely a bike: Lane Resolution, 72Nd, Street.\nSouth Bike Lanes, Central, Park West, now Columbus Amsterdam, but there really is not a good East, West, Route and We thought 72nd street, given its width and given how underutilized it is, would be a perfect place to put in something different.\nAnd then my second question: is: I know that you want D.O.T to use their engineering and creativity, but are you thinking like what was The committee thinking in terms of where the bike lane would go when there's bus, stops?\nBut if everybody could take a second to gather their thoughts and be ready to speak when it's your turn, that'll move us along faster, too, okay, and I, also see we have a lot of comments from the community.\nI have personally always supported dedicated bike lanes, and the concept on its face sounds like a good idea to ask for a proposal, my understanding and how it tell me if I'm wrong.\nHow do you is a safe way for everybody to get to the greenway But I just want to explain something: the phase 5 of Riverside park, which is supposedly opening imminently, but still waiting for some Con Edison work, we'll have a fabulous feature at 66th street, which is a dedicated bike ramp from Riverside boulevard that will go down to the greenway.\nSaying this now, because I think when people think about a bike lane that terminates at Riverside park, they have to have at least some understanding about what happens.\nThat's the background that I wanted people to understand, even though I I'm glad that you've confirmed we're not asking for the bike lane Thanks for letting me speak, Howard, I'm, going to speak for 30, seconds, and I.\nSo I'm concerned that what seemed like- maybe a good investment of 1.7 billion dollars to provide 250 miles of protected bike lanes before the pandemic and before the city's tax base fell.\nA, complete street approach, looks at the best way for the bus to move whether it's bus, Lanes Bike, lanes, pedestrians, vehicles, parking.\nThe priority right now, and it may be because there's so many people who are trying to walk now to work or trying to take the bus or trying to take them a bike instead of the subway.\nI. Just have an observation with respect in response to Clary's question and you've said it a couple of times that this is not a resolution for a physically protected crosstown bike.\nI just wanted to use this as a as a few minutes just to make or less than a minute to make a quick point of something that I was about to write an email to, and that is, as we make more bike lanes and as we do this and again, I'm in favor of this.\nSo I, would not expect people going the wrong way to be an issue or what we're asking for is a proposal for a two- way bike lane and the D.O.T is not going to spend money that they do not have, but we are living in a time when bicycling is exploding.\nI would earnestly suggest that the resolution be simplified or that we vote on it with the following addition, whether we say proposal or not, but say that we asked D.O.T to launch a proposal to investigate the need and the design of a bike lane add to it.\nThat's, the conclusion of the committee and that's what's reflected in the resolution: louisa you're up, We are in a very difficult financial situation and we should be very careful about what we're asking for what we need and what we want.\nSo we wanted to ask for something that was deemed important and was very specific, all right, guys understood, but I think that we can Steve people know I, have concerns about over enforcement of bikes, but two essential areas that need to be enforced are cycling, the wrong way and cycling on streets.\nI. Do not think cost should be as much of a concern as just making sure that these agenda items are like actually capitalized upon in our on people's minds.\nIt's actually this committee's responsibility to come up with a resolution that works not to defer to say we want an opinion, but at the end of the day we want a protected bike lane so give it to us And we're going to excuse how you spend your money, how the buses run and the safety issues involved.\nWhen I, hear people say we do not have the money for a simple bike: lane that can save lives.\nThese are people who are eager to do it and to do it for the purpose of commuting, not just as recreation, a two- way bike lane for reasons that many have already pointed out.\nIt's been a shame that it's been slow, but if community groups like this can make the point the city, I think, will hear them.\nDistrict fully supports this resolution, asking for a plan for a protected bike playing along 72nd street and an overall safe for 72nd street.\nA protective bike lane on 72nd street will strengthen the web tying Central park, the Hudson river greenway and the east side to Columbus avenue, stores, restaurants and museums.\nBike stores have sold out even with no school in session, and many people working from home, CitiBike rides are at all time.\nKids are learning to bike, and I know of many who have purchased bikes in the hopes of riding to school, including my 12 year old There's currently not one way to safely cross the upper West side in a protected lane.\nThis excludes many people from using a bike to get around town to drop kids at school or bike to work in May our campaign surveyed upper West siders and asked about their commuting patterns and habits.\n72Nd street was the most popular crosstown street, where people wanted a protected bike.\nThere's a lot of talk all the time when we talk about bike lanes and people about pedestrians, almost getting hit or even getting hit.\nSeeing, no more public hands, Oh the question: Unless there's a change to the resolution, let's go this one , I'm going to take a roll call, vote.\nDid us park users and were all park users an enormous service back about 10 years ago, by getting an amendment of the City Council to the New York City Clean Air Act that prohibited smoking in parks in order to get the votes of some of her co- council members, as she very kindly came to our committee meeting and explained to us she needed to build, in some exceptions that have remained in the law ever since.\nOkay, is posing a greater risk to the neighborhood, and I really want to make an important point and has become a kind of de facto designated smoking area.\nI'm, going to just turn to other people who want to speak.\nOne is increased sort of conflict between you know local residents, people telling people they're not allowed to smoke, you know, arguments etc, and the second thing is a reluctance to send you know people into contact with the police in ways that could be detrimental to them in their lives depending on who they are and what their situation is.\nWe talked about at the committee meeting enforcement is always an issue but having a uniform rule of no smoking in parks period, as combined with another thing, we're asking for which is better signage.\nYes, we did have a separate vote because a couple of committee members did not want the part of the resolution that asked to have- It's not regarded in the park, not with regard to Marijuana use or brownies or anywhere else or in your house, or on the streets.\nBut the majority of committee members wanted that in So it is part of the proposed resolution which makes it very simple.\nI kind of wonder if this resolution is meant to you know, point to the homeless men smoking in the medium that everyone, like hate, that that's happening right now, and it makes me a little suspicious of the timing of this resolution.\nAnd, you know I think we do not need more enforcement by the police on the Marijuana piece and just in general, I won't be voting for those.\nThink a resolution that impacts so many residential buildings on the west side of Central, Park, West, and We should table this, because what I suspect will happen is that people who currently smoke on the perimeter of central Park and unlike Riverside, there's a buffer There's the perimeter, wall, , there's a buffer between the perimeter of the park and a playground or seating inside the park.\nThink what may happen is the people who currently sit on the perimeter to have a smoke may go acrosss the street in front of the buildings on Central Park West to have their cigarette they're not going to not smoke on Central Park West, because you've decided that they can't smoke on the perimeter.\nIt concerns me that a resolution that's going to impact both the residential and park side of the street is not getting a proper airing.\nShe told us that when she proposed this legislation to amend the Clean Air Act to include not smoking and prophetic prohibiting smoking in parks that, in order to get it passed back, 10 years, ago, or so with some of her other colleagues, she needed to make some compromises at that time, based upon what people were thinking at that time.\nWe do not want our kids walking around watching people smoke Marijuana in our parks and well.\nLet me just leave it at that very strongly as as written in the committee, and so I urge people to vote against Ken's amendment.\nMy, my apologies for moving everybody fast tonight, but we've got a lot of people in our in our waiting room who want to speak for themselves and I promise them at least an hour Gail Brewer, Helen, Rosenthal and Brad Hoyleman, and In your report, you talked about a series of small meetings with stakeholders on the homeless.\nOne of them is going to get a letter in their temporary residence, reminding them that they live in New York city in Manhattan, and they need to use that address.\nI've been following your community board from the beginning, and obviously you have a lot going on, but I wanted to say that I stood with Brad Holman yesterday and activists about the U.S postal service in respect to the lock boxes that we're trying to get all over the state.\nWe can't get that to work, then the only other option will be to do a roll call vote where you announce your votes for each of the things we just said that is always available to us, but please take a look at the the resolution and proposed amendment, which would only take Pl should only be in effect for actually 13 months.\nThe proposal proposed Bylaw amendment tonight and we need a second okay, And, so it'll be on the agenda for our October meeting, given the hour How many people are waiting.\nI will do so again, but let's just remind people that if you want to speak in the public session which is coming up now, you need to fill out the form you need to go to chat and click on the link which is bit DOT.\nSo I'm, going to start with a couple of folks that I know that most folks here are here to talk about Safety, Street, homelessness, the shelter homeless and a few other things.\nWe set the time that everybody is allowed to speak, and I will respectfully remind them same as when we were doing public speakers where it's a minute, 30, please, If you're in the middle of a sentence, we'll let you finish it, but we really do need to make sure that, with all these people in the room, I feel a great responsibility to make sure that we get to as many of you as possible.\nPeter arson with Columbus Amsterdam bid, wanted to alert you all to our open streets for restaurants, starting at 97th street and going up to 110Th street is on both saturdays and sundays, and the streets are open for people to walk or ride on from noon.\nThere were two other non- hotel, speakers, Martha Dwyer, who should go next , I think we should all share the burden, but my concern is wearing a mask and that's going to end social distancing, And, that's going to be particularly important when parents and kids are going back and forth to school when that happens, and I'm down the street from Lucerne.\nMoving, get keep moving with more people to speak, so Ashley Gonzalez, who I believe is from libraries And then I'm just happy to announce that as of next Monday, there are going to be 50 locations open for non- contact grab and go setting on the upper west.\nMy name is William Thomas, I'm here as a member of open, New York We're, an all volunteer, independent, Pro, housing, organization, and I just wanted to speak in favor of the continued use of hotels as emergency shelter.\nIt's important that wealthy neighborhoods, like the upper West side, accept their fair share of shelters.\nIncome neighborhoods, like the upper West side, are ideal for people to get back on their feet because they're so close to job centers and really engines of opportunity in their own right, 30 seconds, and then finally, I'd like to address some of the scaremongering, we're likely to hear tonight and emphasize that most homeless people are not troubled, are working and just do not make enough money to afford somewhere to live.\nSince there have already been long- term residents in some of the SRO hotels in the upper West side before the pandemic under a supportive housing program, that's been dwindling as a lack of funding and incentives for owners, and so I'm wondering is helping CB7 work to support getting people into housing and out of hotels and temporary housing.\nI want to speak in favor of using hotels in the neighborhood for supportive housing.\nAnd I want it to be open to as many people who can live.\nPeople in the temporary shelters at the hotels, like people have said, allowing people to social distance benefits, everybody in New, York City, not just the people who are living in the hotels.\nAnd, then, finally, just I think it's really important that we all our community we're all part of the same city We all have an obligation to help people who are down on their luck and going through a tough time, and that includes sheltering them in hotels during a unprecedented pandemic and economic crisis, and thank you for your time.\nI'm, also a volunteer , I'm working with the group of thirteen 000 residents of the upper West side, who've banded, together as neighbors to talk about and discuss the issue of how hotels, good hotels in our community that have been supporting local businesses and helping our neighborhood really be.\nFor you know the important you know goal of helping people who are homeless, but there is a detriment to the neighborhood, and we need to be realistic about this.\nSecond, I am a volunteer, and many of the groups that have spoken on behalf of this issue have highly paid executives and media people who are influencing this, whereas we're just a bunch of neighborhood volunteers with little or no experience in the sophisticated ways of communicating third, most important of all.\nSo I just want to make sure that when you have people speaking on behalf of organizations that are making a lot of money, housing, the homeless and providing services to the homeless, that those people are giving accurate information to the neighbors who and I've been living in the neighborhood for 40 years, I'm, a lifelong resident of New York City We want to see the homeless problems solved once and for all.\nThe folks who slept on the street homelessness is a real crisis in our city and every neighborhood in New. I urge every one of you to think of your neighbors, who won't receive help without the use of hotels as emergency.\nAs a whole, and I believe that you know there has been no evidence that this temporary solution has caused any meaningful, problems, And I think we have to prioritize the lives and health of the very vulnerable homeless population and all the people in the city over might the minor inconveniences.\nI believe it was open by project renewal if it was not project Remote Was, another one of the really good non- profit, shelter providers that operate in the city, And I never had any issue like the kind that is being described by some of the media reports and some of the people who have spoken tonight describing kind of chaotic scenes and dystopian scenes, and so I am just in kind of utter.\nThe men stand in front and do not wear masks and smoke and do not social distance, especially since the pandemic gets concerning with what's going on, it seems like it's just adding you know more danger to our neighborhood and for those I'm, And I also just want to say the district shelters.\nThen you should call on more people that you know have things to say and not just supporters of the shelters that do not live in the neighborhood.\nSecond point I want to make is that a large portion of the men who were moved to the Lucerne were from the Washington Jefferson Hotel in Corey Johnson's district, where the same problem that everyone in our community has witnessed increased crime, prostitution, open and illicit drug use, random acts of violence, and it was those community members in Hell's kitchen who reached out to Corey Johnson, and he had them relocated to the Lucerne on July.\nBut I will tell you that community board 7 Can I just wanted to add my voice to the folks who spoke out in support of the shelter residents.\nThank you for the service that you do and I am concerned about recommendations for the public to be taking pictures of either perceived crimes or things that they see going on in the neighborhood.\nYou know there is a long history of white people, acrosss, all income brackets using their fears and concerns about safety as justifications to exclude affordable housing and homeless shelters from their neighborhoods in effect, keeping their neighborhoods majority white.\nSo I urge the community Board to do the right, thing, and I urge the other speakers on this call to think a little bit before you point that racism finger.\nSo I want to just make four points that I think is getting lost in this debate as an upper West side, resident.\nI think the first is an important point that people want to keep glossing over, but there were multiple hotels in Hell's kitchen, where these men were housed.\nThe second thing I want to note is when you have 13,000 people.\nI. Think the third you know Is a lot of people.\nIf you, what people want to talk about shelter, bed, density, that's a very different thing in the upper West side, Has always been a leader, on, and I.\nWould say this is a safety and security issue, but at the same time, if the first thing you think of when you hear homelessness is race or you hear crime in its race, I'd actually say to you might need to check your implicit bias because for a vast majority of upper West siders, including lots of people, we know who are people of color.\nYou, know they're offended when people say that, And I think the issue needs to be.\nAll of us want that, but the way you do, that is by housing them in facilities that can provide them the services that they need, and there is nobody who realistically thinks that hotels can act, do that, except for people who are really just lost their job down on their luck because of Covid-19 and need the help, but for Micah homeless.\nQuestions are asked over and over and in many ways the same responses are given and I'm, trying to figure out where's the disconnect, and I am really wanting to be constructive in helping to make the connection for people.\nThey know if there are going to be new people, if you want to send them a photo, because you see something, of course, that can be helpful.\nYou know was presented to our community with without any notice, and that's just a fact, and I appreciate everything that she's been doing to provide those answers, and it's so important that people continue to speak up in forms like this, so Mark."
        }
    }
}