{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB10",
            "channelId": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
            "title": "Joint Zoning and Land Use and Environmental Committee Meeting",
            "publishDate": "2020-12-03",
            "shortDescription": "",
            "lengthSeconds": "1:12:10"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB10",
            "normalizedName": "Brooklyn Community Board 10",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "stale"
        },
        "properties": {
            "videoURL": "hZbwyZtZ_iI",
            "fillerWordCount": {
                "uh": 137,
                "um": 202
            },
            "readTimeFullTranscript": "39 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "school": 57,
                "flood": 53,
                "building": 41,
                "floor": 26,
                "students": 25,
                "street": 21,
                "percent": 19,
                "location": 18,
                "buildings": 17,
                "zoning": 16
            },
            "wordCountSummary": {
                "building": 18,
                "flood": 18,
                "school": 13,
                "floor": 10,
                "street": 7,
                "facility": 6,
                "proposal": 6,
                "buildings": 6,
                "change": 5,
                "construction": 5
            },
            "fullTranscript": "Okay looks like we're on so Josh. You may begin with the live stream. Okay, so thank you, everyone for joining it. It's in person or zooming. The zoning land Use Committee always has good attendance and I. Thank you all for that and for your continued commitment. This is actually the third project in the commercial c8 triangle that we're looking at and this application is a little different. This is a they're height, wise they're, building as of right. They are looking for a special permit for a non-permitted use could use for a daycare center and so we're interested to hear the application, and this is, if we remember all the other discussions in the size of the building, is basically what is permitted under current zoning and they're, not there's no extra height. There is just a change of use requests, so I, guess Jay. If you're ready, I made you able to be able to share your presentation on your screen, let me see if I can figure it out. Are you able to see this? Can I just know which firm Jay is from I? Have my own firm, Jay, Goldstein, Law Office of Jay Goldstein, I presume yeah, you can see it okay, good I've presented before you in the past on another school project a couple of years ago, so good evening, everybody, my name, is Jay Goldstein I appreciate your time tonight. I'm here on behalf of the learning experience, which is a day care with me, is Jeannie Cave, who is one of the operational administrators of the school and we'll get into that in a little bit. So we're here for a special permit, as mentioned for from by section 7319 of the zoning resolution, to allow a daycare center in a building that is being built. So we're not asking to construct the building, we're not asking for any waivers or permissions in terms of the building. What we're asking for is simply a allowing the use which isn't allowed as of right in this zoning district. The premises in question is 8902 Fifth Avenue. So if you can see on your screen, it's the corner of 5th Avenue and 89th street. It has 107 square 107 feet of frontage on 89th street and 75 on fifth Avenue. It's a new building, it's a five partially sixth floor building, six or a building with the seller and the school is looking to or proposing to occupy a portion of the first floor along 89th, the entire second floor and a portion of the third floor. Again, this is the building it's under construction. To my knowledge, it's not occupied, yet it's still under construction as we speak, but this is the corner. Looking at the intersection of 89th and 5th Avenue, the layout of the building the school is proposing to take about 13,500 square feet. The seller, as you can see, is going to be parking for the remainder of the building. There'll, be an elevator lift from the first floor along fifth Avenue that accesses the seller parking. The remainder of the first floor along fifth Avenue is going to be commercial with the school occupying a portion of the building and their main entrance along 89th street there's also a separate entrance for additional community facility and commercial that occupy the upper floors, which I'll show you in a minute. This the first floor of the school will be about 3,700 square feet. As you can see, there's a vestibule you walk into the building with a vestibule, then reception and offices. This helps ensure that the children are safe, that nobody can come into the building unless they're admitted and known to the school. Also, on this floor, there'll be two classrooms that can accommodate 18 students with four teachers. The entire second floor will be occupied by eight classrooms, about 7,350 square feet, 95 students and 12 teachers, there's also a lounge and an indoor play area for the students, the third floor or part of the third floor. 2500 square feet will be occupied by three classrooms, as well as a small pantry 39 students and three teachers. The remainder of this floor will be a separate community facility with separate entrances not associated with our use. The fourth floor will be partially community facility, partially commercial offices, and then the fifth and the small sixth floor will be commercial space. This is the streetscape. You can see what the proposed building will look like along 89th street. This portion in the middle is the school's entrance. It'll be a dedicated entrance to the school. We have a dedicated staircase and a dedicated elevator within the building to ensure the safety of the students. The school itself, as I mentioned, is a well-established school. They operate under a license from article 47 of the health code. They have 240 locations in 33 states, including a number of locations in New, York City itself. They service ages, six weeks to five years old. This building building's proposed to have 152 students with about 19 teachers coming primarily from the Bay Ridge area, and the hours of operation will be Monday through Friday 6:30 a.m, to 6:30 p.m, again, not all of the students the entire time, but we have a staggered arrival wherein parents who have to leave early for work or come home late from work can drop off their student, their children at the school and it's a service the school provides. We anticipate the majority of the students coming between the hours of 7:30 and 8:30 a.m and leaving between 4:30 and 5:30 p.m, but there will be other students who, based on the parents, work schedule will be there longer earlier or later in terms of arriving and departing the school. We anticipate 40 percent of the students, will arrive by foot 30 by private transportation and 30 by public transit. There's this our subway station and a number of the bus lines that run close to this location in terms of the findings or in terms of the BSA application. We have to make four findings in order to qualify for the change of user for to allow the daycare to operate in this location, one of which is that we have to search the area to find an alternate location in a zoning district where the use is as of right. So we've done a there are certain criteria that we have to meet in order for the site to be valid or to be a contender. So we did a catchment area. You can see, I, don't know if you can see, but it's the purple dotted line. That's where the students will primarily come from any alternate building has to be about thirteen thousand five hundred square feet with thirty six hundred square feet at the ground floor to accommodate the requirements of DOH Department of Health, which says that two-year-olds can't be above the first floor, an additional 10,000 square feet between the second and third floor. Because again, DOH says you can't have any students above a third floor. Any alternate site has to have a dedicated entrance primary staircase dedicated to the school and an elevator dedicated to the school. So when we did this search, we came back with one site in the area that potentially met our needs. That was located in 9201, fifth Avenue, the coroner 5th and 92nd street, the building's still in its planning stages. So it's not even definite that it's going to be built and the asking price on the rents far exceeds that which we're paying at this location. So, therefore, based on those findings, it's not a valid site or not a viable option. The next finding is that we're within 400 feet of a residential district or a district where this uses. As of right, so you can see from this that we're directly across the street from an R6B zoning district which allows for this school use as of right. The final two findings are kind of go hand in hand that this is separation between noise and traffic and that we can ensure the safety of our students, so the school's working with their through the application, we're working with Dp and DOT to ensure that there's no air quality or noise issues and we're working with school safety program to ensure that the operational plan for the students arriving and leaving the school can adequately protect the students. Additionally, this is a daycare, so none of the students arriving or just or leaving will be walking alone. The school has a strict policy that the only people who can pick up a student is one of the parents or a guardian who's pre-approved and, as I showed you before. There are a number of obstacles to get into the school before you can actually see the children so that, given all of those measures, we are confident that we can protect the students and, through the DEP review, we're confident that the air quality and noise will be adequately separated that we don't have an issue. If there are any specific questions, I'm happy to answer them at this time. Yes, I have a question sure you mentioned about most of the enrollment. It would be local and in reality, though, do you have any vehicular traffic pertain to traffic. You have the post office on one side, you have an empty lot on the other, and that lot is for sale and something's going to be built there also so right that needs also to be considered. No, it's definitely considered it's part of our traffic analysis as well. We gave in that we do anticipate, probably 30 of the students arriving by private vehicles, so we in working with DOT they'll, usually put a or suggested no standing sign in front of the building to allow for drop-offs, and it can be tailored that it's during arrival and dismissal so that it's not disruptive to the evenings not disrupted to the middle of the day when we don't have students coming and going I have a few questions. Oh and I'm sorry, Steve Ann Faludico had her hands up first, and you just have to take yourself off mute Jay if the current tenant, that is your client, should discontinue use of the space. What is the certificate of occupancy going to read and what would be the situation? Should that be the case? What other kind will it will? The space be dedicated to school use going forward? The space will be dedicated to school use as long as the school is there, the Cfo will say school use pursuant to BSA approval, any change to the Cfo. Should the school leave the space if you want to use it for any other use. Besides, the school use would have to go back to BSA and back to DOB for approval, but if the school use were to continue under a different entity with the submission to BSA to clear the change of ownership or change of tenancy, that would be acceptable, correct with the permission of BSA okay, and is this also a day nursery with children under two? We, as men I, think it's six weeks to five years old, six weeks? Okay, thank you. Steve yeah. Actually, Ann asked two of my questions. What does it mean Jay when you said that it's going to be a dedicated stairway? How is it separated from the other property or the other businesses that will be in that building, so it's hold on the other businesses so along fifth Avenue, the commercial district, the commercial use only accesses through that front, and you can see over here that we have a staircase within our space that is solely dedicated to our space. Once you hit the fourth fifth sixth floor, that staircase ends, so it is dedicated to our use. Okay. If the school was not to operate, there say after three four years determined it wanted to move. Another school could go there, which would require a dedicated I assume. A dedicated entry in egress am I wrong, am I right. The schools in general would especially given the fact that schools are not as of right. Any change in use or occup or operator would have to go back to BSA and BSA is very strict on the fact that schools in commercial districts or schools in mixed-use buildings require separated stairs and elevators. Okay. So with no with that in mind, how difficult would it be if a school decided not to come in there to convert this back into a business or an office, because I don't see? How would the connections be made at that point? Just so I can tell you. Let me just finish: I, don't quite I mean then there would have to be construction. That would go on and my concern is that the expense of moving in there under those circumstances would be large for a business and I'm worried about it laying fallow if, in the event that the school moves out right, so it would require, if it's not a so first of all, it would only be a community facility that can occupy this space and it would. The expense is something that the ownership took upon themselves, realizing that this is a tenant that has a well-established business, a well-established school and anticipates you know being in this location for a very long time, I'm confused as to how it can only be a community facility. Why is that? Just because the commercial far is already used up with the commercial spaces, so there's a bump up in the Ca2 district that only allows for certain community facilities, so the conversion of these spaces would have to be to a different community facility use. But the point is that that's very limited and I mean if the school isn't there I mean let's say the school: wasn't there right now, okay, they weren't doing it. What would they be? Constructing there they'd be constructing a an office building right, they would construct medical offices, doctors, offices, other types of schools, other types of community facilities, houses of worship along those lines, all right, but it would not be a business usage. It would be all those, including the medical, would be a community right, correct. Okay, thank you. Dean has your hands up. Yes, I have two questions: do you plan on including any upk classes, because the age is the same age? And the second question is: where is your second means of egress? Okay, so yeah second means of egress I can answer upk I'll defer to Genie, but you see the staircases over here. Yes, these staircases will have emergency push bars and those are the second means of egress that go to an alley over here that exits to the street. Okay and Jeannie is with us she's on, but she can talk to the upk aspect of the school if she unites herself. Okay, sorry about that took me a second to figure that out so upk we with Covid-19 right now. We are not providing those classes full time. We do them in certain locations where we have the demand, so it will depend on the school if the school starts to fill up and they feel that they can substantiate the cost. Yes, they will offer it. So at this point, it's undetermined. Thank you. Michael Devine, hi, two questions am I correct in looking at these plans. There's no outdoor space for the kids in this daycare, so it's to be determined based on DEP review, but that side yard over here is potentially going to be an outdoor space. But we do have over here an indoor play area for the kids. Okay, second question: it was I, don't know if you know the answer to this: did the original developer of the building? Was it their intention to have a school move into this building while before they built I, don't think it was, but the opportunity arose and the developer is doing the construction for the school to entertain the school I think it was anticipated as a community facility space like the fourth floor, but the school came along and it became a good match. Stephanie and then Anne I have two questions. One. You said that there are 152 students at this time. Is it possible for the school to expand beyond that number, so it's 152 students at capacity, okay capacity based on the ratio, Department of Health and article 47, have a student-to-teacher ratios and size of classroom ratio based on that, the max capacity of students would be 152, okay, understood, and then this is either for Doris or Josephine. A couple of years ago a upk opened up on Fifth, Avenue and I think is it? Was it 85th street? It was like a storefront. Was it were there any adverse situations or what was the feedback on that? Is it still there? What is it like to have a school in the middle of that area? So it's still there and we have not received any complaints. We actually have heard positive things from some parents who whose children attend there. It's a small Pk and I'm not aware of any complaints there. Okay, good! Thank you, Ann! Okay, this question is, with regard to potential recusal in the committee, is brickellage the architectural firm for the new building or for your application. Both. Thank you question. Is this school enough for profit or for profit? Okay, a question yes, Steve yeah! Could you just remind me this is on 89th street and fifth, what's across the street, from it on fifth post office or the Post office? Okay? So that's what they're building there? Okay, let's figure that out Lucille Roberts and another school I, just I'm just trying to locate it in my head. What is the actual as of right zoning on there I think you mentioned it earlier, but what is the as of right? Zoning there right now. Are you asking the zoning district or the floor areas? No, just the azerite district. What can be built there? It's what I'm trying to eat district for me, it's the Ca2, okay, what that's so it's a business, Ca2 business, correct commercial, district, Ca2 right is this, and this is not as of right in that district. The building is as of right, the United states. The use is not there's a special permit dispensation from the city which we're asking for which is granted for certain commercial districts and certain manufacturing districts for school uses, and he has no other tenants at this time. Nothing yet the building's under construction. Okay, thank you complete last time, I said it's basically complete we're doing the construction here. I, don't believe that there are any tenants in the building, yet no dean. You still have your hand up was that from before, okay, you're down I, don't see any other hands up. It looked like it was complete the building yeah. It looks like it's near a completion of substantial completion. It definitely is near substantial completion for sure the picture I showed you can see by the picture that it was which was taken a while ago that it was already near completion. I think Doris put her hand up. I have a question. Learning tree has another facility within our community board. What is the capacity at that location, which is on 69th street and 10th Avenue? Can you tell us about the number of students there and the usage and any issues in the community excuse me? I will defer to genie on this one. Sorry. It takes me a second, because I'm in a lobby where Christmas music is we have a few locations in that area. One of them is in Astoria and then I think we have another one that is fairly close. That is not completed yet, which one are you referring to, so I can give you more one in details. Board 10 at Bay, Ridge, Avenue and 10th Avenue is not yet complete. Is that the one on 11th Avenue 11? Okay? Yes, it's still under construction. It will be a corporate location, so we anticipate probably having probably close to 105 kids at that location. It is on two floors and that's all I can tell you because not finalized. Yet that's interesting. Thank you for the rest of the committee. I saw that on their website and I asked Josephine to look for any concerns at that location and she did an open data search as they were done and now we know why we don't know what their about you know and my concern would be about drop off and pick up. Issues surrounding that. So I want to just mention to the committee that 89th street between fourth and fifth Avenue, which is the corner, which is the where the this property lies a number of years ago. I think it's three years now the department of transportation, the Community board, approved a pedestrian safety change at the intersection of 89th and 4th, and as part of that safety improvement project 89th street between fourth and fifth avenues. Direction was changed from westbound to eastbound and following that improvement, there's been a lot of you know: improvement in pedestrian safety, both at the school. That's off of 4th avenue on 89th street, as Jay said, I'm just to remind board members that there is a pre-k site on that corner at the other end on the fourth avenue end. So this loca. This proposal is for the Fifth Avenue and meaning that you know drop-off would be on the right side of the building, which would be the you know. The passenger side of any vehicle Joseph is that the same location where David's preppy was looking to build the high school there? No that's across the street on it's on the same block 89th street between fourth and fifth, so it would be opposite. The Baybridge Prep site was opposite, and that was the same type of special permit application. Prep is no longer pursuing that location. Nice can I, see the lot layout again. That was Jay. Thank you. Let me see if I could zoom in hang on you talking just the I want to see I want to see like Fifth Avenue, where the location is yeah, so this is hey. Where would and Joe? Where was Bay Ridge Prep again remind me somewhere? Yes, right with his hands, 89th street correct and on the corner. You know that is the district community District 20S Office, yes, and the it's a pre-k early childhood center on the corner of 4th and 89th street. Do we have any information as to what's going to happen with the vacant lot over there, where Septender used to be no I do know that the school construction authority was looking at that location, I, don't know what its status is, though, and also remember also that the dealership across the street and Fifth Avenue that also vacate the building. So that's also, we don't know who's going there as well. Right, you know, I mean again. The zoning and land Use committee has identified this area the c8 as we call the Ca2 triangle. There are many vacant spaces. You know large development sites in that triangle. There's been some challenges in securing some of these large commercial tenants. We've talked about that. The Ca district in general is really viewed as somewhat of an antiquated zoning district. It has the special permit to left for the schools, realizing that there's a need and that it can facilitate that goal. Why do you? Why are you saying that it's antiquated, because it only allows for very for a very specific amount of community facility and a very specific amount of you know types of commercial where you're not going to necessarily have small retail there? You won't necessarily have you know a large spread of community facility and you can't have any residential, I'm very concerned about the traffic. It's going to be very crowded. You know it's crowders. It is right now and it's going to be very difficult. As the you know, the parents that bring the kids army in the morning or to pick up in the afternoon and that's my biggest concern yeah. You know to be an advocate if you had an alternate business, whether a medical office or another community type facility, you're going to have an equal amount of traffic to me, that's kind of a moot point. Look at the type of businesses you can put in this establishment facility yeah, but you're going to have 152 kids coming their daily bring abroad there and pick up from there and that's it's gonna be even though this you know within the district I. Don't think anybody's gonna come there with a three-year-old walking or he's gonna come with a car and going to pick up the kid with a car, we're anticipating, based on our research, based on our knowledge of the area and based on our knowledge of our facilities, that we'll have about 70 percent of the students coming either by foot or by mass transit there's also a significant spread of when the students will come and leave. We anticipate coming in the arrival times start at 6:30 in the morning and finish by 9:30 in the morning and the dismissals between 3:30 p.m and 6:30 p.m. So you're not going to have 150 kids at one time coming and going from this location, I see Dean and Steve have their hands up. Dean, yeah, Nick I, don't disagree with you, but thinking back almost every school that's been built in our district. We've had the same concern about you know it: it's not suitable. There's a lot of traffic and yet after the buildings go up and the facilities are open, we rarely get a complaint about that. So I don't disagree with you, but I. Think history shows us that, after the facility is open, that we don't really get complaints about that I agree with you again. But again, if you remember on 18 and fourth avenue, the traffic direction was changed to help the you know to make it easier. Here is already: what are you going to do? What the DOT is going to do? You have the post office? Do you have a double park a triple park you have at the bus, stops there and now you're gonna bring it. You know the school there and God knows what's going to happen with the vacant lot. Who is going to be the tenant? On the other side, it's going to be. It's like you're gonna, be on fifth avenue in Manhattan, where nothing's gonna be moving there very possible. Let's see Steve, you have your hand raised was that from before it was but I might as well use it I understand, Nick's concern, but as long as people keep making babies, we have to put them somewhere and we have to teach them, and it seems to me that this is a community facility. What it's intended for it seems I mean almost anything that you put there. You know her house of worship. Whatever is going to have issues that are going to have something to do with traffic I mean I, guess we could just turn it into a farm, but it doesn't seem to work well. So I would support this Jana. You have your raise your hand raised. Hi everyone, yeah, I'm sorry, I'm late, I just have a quick scheme because I'm a visual person. So I'm like looking at that area the school it's in elementary school. What I understand and it's near it's like where 711 is right. You guys know like we're: ps2 yeah, no, it's not! This is off of fifth Avenue 7-11 is on fourth avenue got it all right. Thank you! Doris! Oh yes, Steve your head, just love to come to the. Thank you. I'm sorry, I can't hear you. Okay, I'm sorry for learning tree. What is the breakdown on most of your facilities on the age groups of the children involved? I mean we know that you're from six months to five years old, but as a rule, what percentage are infants, toddlers and preschoolers, because I think that impacts the drop-off issues? So Jeannie? Do you know the answer to that question? Yes, so we typically only have eight infants and they are the ones that take the longest to unload, but typically they come by stroller and I. Wanna reiterate that we have other locations that are in Astoria and they are right by the subway and there is no parking whatsoever, no drop off spots at all and the parents do come, they walk them and they bring them in strollers. So we have eight infants and then, as it goes up, we have toddlers and we usually have about 12 of those in each room. So in this particular instance, I believe we have two toddler rooms and two toddler rooms. So we have about 24 kids that are under the age of two and then, as you go up, you have preschoolers and the preschoolers are usually the larger classrooms. They usually have 24 kids in a classroom, and those kids are usually much quicker to drop off because they are used to going to school and they are used to saying goodbye to their parents and they're, quick and easy, and with Covid-19 most the kids don't come into the classrooms. The same way that we used to do it. They are dropped off in the vestibule and their temperatures are taken. Their parents signed the men. So it's a much quicker process and I. Don't know how long that will last, but we are looking at putting those procedures into place long term, so our drop-offs will be even quicker and faster than they were before. Okay, Doris: do you have Dan headaches, has his hand raised yeah I, just say that, especially considering that we're expecting a lot of the parents to be local, I'd almost consider the traffic to be very elastic where, if there is a problem, if it does generate more traffic than we're expecting, the parents will notice that the first couple of times they drop off and because they have so many options, we have the bus there. It's mostly within walking distance of everyone who's going to be coming, especially knowing thank you that not many are going to be infant, they will change up their behavior and it will manage itself out because it is such an elastic situation. You see hard traffic numbers mainly when it's very long distances where there are no other options. The fact that we're putting this in such a central location, which is why we have that commercial district in that triangle, in the center there in the first place, is because it is so accessible I'd. Imagine that any issues with traffic would essentially self-resolve within the first couple of months, which is what we see when we build a new school anyway, exactly the same issue, which is why we I think we don't see that many complaints, after one is built, is that everyone kind of figures out how to live with it. So I don't see any problem with traffic. This seems really good to me. I'll go ahead. Steve, sorry, yeah I just want to point out that I live on 79th street and third Avenue, which is directly next to a child care center. That seems to be of a comparable size. I'm not sure. If I mean it is intended as a place for people to leave their children during the day when they go to work and I have to say that you never know that the place was even there and there is no I mean the subway, as I said, actually about five blocks away. I, it's not an issue, it just hasn't been an issue at all and we had the same concerns at first. That people would be, you know, lined up and the whole thing and there's probably at least 100 kids or more there every day. Thank you, Doris I, don't see anyone else's hand raised okay, I think we have effectively covered the issues, all the issues that I have thought of, and you brought up more for the zoning landings. Committee do I, have a motion, any motion. Anyone want to make a motion so moved motion to accept. As written. You have a second I'll. Second it if I can just say there is the reason I'm making. The motion is because I believe that exactly what we're talking about C8 district is intended for this kind of a thing for crowded area and this kind of thing it does not infringe in any way on the local residential population. It's well away from it. I think that, under the circumstances and as I said before, we need schools, we need day care centers, and this is something that is needed. I would, for those reasons, I would support my own motion, I hope so Steve. Since we have a okay very good. Do you want to do a we'll? Do a roll call vote, Sure Doris in Paper, Michael Devine in favor, you take yourself off mute, okay, Steve, hi I do want to point out for Ann that the reason for refusal has to be stated and oh I lost all right, we'll go back to Ann with that architect of record is a colleague and friend good. Thank you. Barbara Gurmak, yes, in favor, Stephanie Mahany in favor, Anthony Marino in favor, Susan Pulaski in Favor, Dean Rasina, yes, Joe, Tulamello in favor. Okay motion carries what about me. Oh larry, no you're, not on this committee Larry. This is just for zoning and land Use Committee. Sorry, no okay! You're on the next now we're starting the 730 portion, which is a joint zoning and land use. Environmental committee meeting Doris I'll hand it over to you part two. Thank you Jay, it's good to see you thank you pleasure to see you. Thank you very much. Everybody have a great night have a good evening. Bye. Thank you want I have to get back to my old notes. Thank you all now we're here to discuss and I would like to share this with my fellow chair, Jenna Talbot. Thank you again and we're here to discuss the flood resiliency rezoning attack. Do we have any presentation, Joanne, Jose yeah, so I want to say that Sanmari is here from department of City planning. I want to also welcome the environmental committee and share the bold shares that we have a quorum in both committee. So that's very exciting, so Samadhi I see that you're here. Yes, how are you hi? Are you going to be giving a presentation this evening yeah I'm going to be presenting and I'm joined with my colleague, Kate Richards, who has worked on this text amendment and would be here for any questions which the committee may have great. Thank you so you're free to share you're able to share on your screen. Okay, oh, can you give me the access, okay, yeah I think I have it. Yes, I gave you access great Dan. I, know you're, proud, huh zoom everyone's come such a long way with. So it's a long way, I'm proud of the entire board. Let me know when you see it: okay, all right. We got it, I think you're on slide. 11, though yeah great okay. Can you see it? Yes, okay, so good evening? Everyone- and thank you for this opportunity. We are very excited to present the zoning for coastal flood resiliency city-wide zoning text amendment. This, as you know, is a proposal developed after years of ongoing public engagement with the goal of promoting resiliency for the city's building stock, and this also proposes updates to the zoning resolution, article 6, chapter 4 and other related sections. So shortly after Hurricane, Sandy happened, New York City put together zoning tax amendments in order to help in the recovery and rebuilding efforts. However, in the situation and considering the time constraints, this was done on a temporary basis and now those flexibilities are beginning to expire, and thus this proposal would help make the post sandy provisions permanent and also it would expand them so that communities have a greater flexibility to adapt, and this is based on all the feedback which we received with the stakeholders, the community members, the businesses on what provisions they wanted and wanted greater flexibility with as we'll see in the presentation and ultimately, this will help everyone living and working in the flood plain area to design, as well as retrofit the buildings so that it would reduce future damage from coastal storms would be resilient in the long term by accounting for future risks from climate change and also, of course, potentially to help save on the flood insurance costs. So this slide gives a very nice concise overview of the main goals of the text amendment, and so these are more of strategies. They were established after a long and robust study and stakeholder research process, so the first is to encourage resiliency throughout the current and future flood plains, and this is really people living in and around flood plains want to be able to prepare buildings for flooding, even if they are not located in what is currently determined to be the high risk, flood zone and people also moving on to the second one people. This is to support the long term resilient design of all building types. People want the option to raise the occupiable or ground floor space a little higher than the current flood level that FEMA projects, because they have seen higher flood levels already and, as we know, with the climate change and the risks involved, that level and risk is expected to only grow in future. The third is to allow for adaptation over time, and so what this is about is just to give business owners and homeowners the option to invest in these measures incrementally, because sometimes the costs are huge and this provision would allow them to make incremental changes and adapt over time, making it more affordable and the fourth facilitate future recovery by reducing regulatory obstacles. We, as from this whole exercise, one of the things which we realized was that city needs to be able to respond faster and reduce the bureaucratic and other hurdles, and this would allow the city to do this, and this addresses some of the issues which were faced. So the first goal is to encourage resiliency throughout the current and future flood plains, and it deals with the applicability. So what you see here is the dotted line is where the current rules apply, and this picture is a great visual, because it shows that the flooding extended beyond the dotted line. So what this means is that for any lot, which is located either in the high risk or the moderate flood risk, planes would be allowed to use the proposed special options for resilient building design and just for those who are not aware, the 0.2 percent floodplain serves as a proxy for the high-end projection of 2050 and the one percent annual chance flood plain, allowing the city to advance the resiliency in the longer term. So this would really go a long way further, where we are already allowing those areas which are considered moderate risk right now to be included in all those provisions. So this shows the areas which the blue ones is the high risk and the lighter green one is the moderate risk. So this is a map which shows the applicability in Bay Ridge and, as you can see, it's very a very small portion really to the top the image on the left. It shows where the rules are available for buildings currently, which is within the one percent flood plain. The image on the right shows. The portions in orange is where the rules would apply, so it expands the area to the 0.2 percent flood plain and in barrage, it's very small portion, so the top the image to the right shows just I think that's barrier Avenue, just at the intersection of shore road. So there are maybe six to seven lots which are covered in that area. So this goal is about supporting long-term resiliency design for all building types, and it includes a number of strategies for the purposes of this presentation and considering the time constraints we'll be focusing on those which have some applicability in a beverage so the ground floors. These regulations are a set of rules that would help promote a good long-term, resilient design and good neighborhood streetscapes. So the current rules allow the ground floor in existing buildings that are retrofitted to be wet to be exempted from floor area. So this helps buildings become more resilient without having property owners to have to lose a chunk of their buildings in the process. The proposal would allow such exemptions to apply to both existing and new proposed buildings, and the intent is really to apply the allowance more consistently and support the new buildings adapting to climate change, and the current rules also include flood area exemptions for spaces that are dry flood proofed, and this is to promote active uses at the street level and so moving on regarding the building envelope. These optional rules would allow building owners to physically elevate habitable spaces and other building support features about x, expected flood elevations. So currently, the 2013 flood text allows the maximum height to be measured from the design flood elevation, which is the dotted blue line, which you see and in the so the design flood elevation in new or substantially renovated buildings. The minim it's the minimum height at which the residential units may be constructed and utilities like boiler, water, heater, etc, may be located. So this allows the minimum height for dry and wet floor proofing measures. However, so currently, this is only available for buildings in the one percent flood plain. That is the area which is within the one percent annual chance of flooding. So the proposal would allow the buildings within the 0.2 percent or the 500 year, flood plane, also known as the moderate risk flood plain to also take advantage of this rule. So while we have all these rules, we recognize that not all buildings in all situations would be helped by the provisions and the options which are envisioned and anticipated are required, and so the proposal would allow, or rather continue to offer discretionary pathways in the form of Vsa special permits to ensure that certain unique situations which has not been anticipated or expected, or any hardships based on lot issues or special constraints, can get relief from certain zoning provisions in order to meet the standards for construction which are given in the flood plain. This goal allows for adaptation over time through incremental developments and retrofits. So what this? What? During the surveys, what was found that some of the business owners have certain it's difficult for them to raise the entire portions up, so this provision would offer either neighborhood services or those that are part of a large industrial economy of the city. Many of these buildings can not be completely elevated or dry flood proof, and that's because it's too expensive or because of some other needs, and but because many of these business owners would like to raise the critical spaces and equipments about the flooding, so that this would minimize the damages which would be caused by flooding. So the key spaces that are located within the basements or sellers would be allowed to be elevated above the flood levels in these cases, so also the flood protection measures. There are certain additional provisions that will enable different types of flood protection measures to be implemented. For example, this shows an allowance for flood panels and landscape berms to be considered as permitted obstructions in open areas. So this just gives more flexibility for the location of these equipments and it would also allow spaces used for the storage of panels to be exempted from floor area to enable all side storage. So there's just this remo. Basically, it's opposite of penalizing the property owners. This just gives them more flexibility and they would be able to store on site. So, moving on to the last, the fourth goal category, so this is interesting. This applies not to a particular area but across the city, so what Sandy showed was that the storm's effect can go beyond the flood plains, especially regarding issues with energy grid. So the proposal would allow power systems like generators, solar energy systems, batteries and other storage systems to be considered as permitted obstruction in open areas across all zoning districts. So this is really a emergency planning measure which would ensure that resources are distributed in all areas and accessibility, so to ensure that all areas of the city can provide ADA access. The proposal would classify both ramps and lifts as permitted obstructions in all required open areas to facilitate accessible design. So another important issue is how disasters, especially those that require evacuation of residents, how it impacts vulnerable populations. So the these storms and hurricanes have exposed the difficulty facing nursing home residents in areas of high risk flooding, so nursing home populations require continual medical care, and research has shown that this dependency can be strained, whether the nursing homes, shelter in place or evacuate prior to coastal storm. Therefore, the city believes it would be appropriate to limit the growth of nursing homes in high-risk areas to lessen the risks and logistical challenges of evacuation. So the proposal would prohibit the development of new nursing homes within the one percent or high risk flood plain and other selected geographies, which are known to have limited vehicular access or have certain challenges during evacuation, and just to note that the existing facilities would still be operating, they would be able to conduct enlargements and modest improvements, so it this would not impact the existing nursing homes, so I think yeah. So the summary this is just a next steps. The citywide text amendment has been referred out on October 19th to all the community boards border boards and border president for 60 days, and the deadline to receive the recommendations is December 28th. So we are hoping the community boards throughout the city would vote and give the recommendation and support this very necessary and useful text amendment and with that I would end the presentation and we can take any questions. What this boils down to is that this would basically allow the owners of these properties, whether they exist or are going to be built to raise their homes, the above the expected flood, if they're in a flood zone, so above the expected flood, so that when a flood does come, it will flow under the house rather than through it. Is that correct? That's basically what it comes down to I I'll, also ask it to weigh in this depends upon I, think also the dry and wet what kind of flood proofing is done, but, yes, it basically allows elevation so that it would be out of harm's way and Kate. Please feel free to weigh in I would also add that this would not increase population. It would basically be what we see right now, but it would prevent a lot of destruction and a lot of money being spent afterwards. If you have done this like 100 years ago, I also point out that these methods are used in many places that have flood zones, particularly on long island, where the zoning allows exactly what they're talking about, and it has no great impact. One way or the other, as far as whether you think it's beautiful or not beautiful and I, think that it makes a lot of sense. So I would support this also Kate, I'm sorry I. Just to add this doesn't change the zoning districts in any way. It just makes it more flexible for property owners and homeowners if they want to do resiliency retrofits on their homes on their buildings, which can include elevation, but there are other strategies as well, and part of this proposal is allowing for people to undertake partial resiliency measures so that maybe they can't do everything all at once and they aren't going to fully elevate their home, but they might relocate their boiler. So it's not in the basement things like that great thank you. Doris. We have two hands: Right, Richard, Day and then Dan headaches, great hi. Thank you for the presentation. I have a question so I understand that all of these measures could be, you know, cost prohibitive for someone who currently lives in one of these areas. You know like you're, saying you're allowing for incremental retrofits, but is there a reason why we're not like requiring these things to be in place for like new construction? So currently, what is required? Appendix g of the city's building code is the flood resilient construction standards and that is required right now for properties in the one percent annual chance flood plain or the high risk flood zone. That Samati was describing that's already the standard and that's not changing. What is changing is more we're expanding the territory for who's allowed to take advantage of those standards, so not just the one percent, but people in the 0.2 chance floodplain will be able to do some of those things as well, and it will continue to be required in the building code for new construction in the one percent annual transplant plan. Okay, thank you, Dan yeah, and actually that swings over into one of my questions. Sorry I have a cat, which is the one percent and the hundred year in the 500 year. Floodplains. I'm wondering if you guys could explain a little bit because I know sometimes that can be confusing for people. They think it's. Oh, it's gonna happen every hundred years that those are just terms right that the actual probabilities are generally much more frequent than that. That's a very good question. Thank you for giving the chance for us to clarify and that's I, think part of why we like to use one percent and 0.2 percent yeah. So one percent or the one percent annual chance flood plain or the 100 year. Floodplain means that in any given year, there's a one percent chance. It will flood and the 500 year 0.2 chance floodplain in any given year, there's a 0.2 chance that it will flood yeah and that doesn't account for sea level rise projections and climate change. That's a right! Now! Look not a future projection! Yeah, because I know that, like the New York City, flood plains had only been updated, I think before Sandy they hadn't been updated for 30 years and they were updated after Sandy have not been updated since, but like this is such a fast climate shines is so fast moving. It just makes a lot of sense that we'd push our the ability to take advantage of these kind of things further out to the you know, 0.2.1 floodplain, just because that might be much more frequent than we think. I know that the National Academy of Sciences I, think in like 2015, had said that, basically, that floodplain would probably be flooded every 25 years give or take in the New York City region. So this just seems like already like we I'd say we should be going further, but this is a good step in that direction. Thank you. Doris I, don't see anyone else's hand raised well. I have a few questions. The community board, the Zoning Landings committee reviewed this three years ago in October, 2017 and supported it, but in that time are there any changes to the flood plan in community board 10, since 2017 has the flag. If there are flood changes in the floodplain, if the floodplain is redefined, would DCP come back to the community and how it impacts them. So right now, there's the 2007 flood insurance rate maps, which are what FEMA uses for flood insurance and the city uses the 2015 preliminary flood insurance rate maps for our building code and zoning regulation purposes, so that wouldn't have changed since 2017. The way this zoning is written. If the flood maps were to change in the future, the zoning text is written so that it's as the flood plain changes that applicability will expand to cover new floodplain. Okay. Does that make sense? Second question who said: there's concern about evacuation from nursing homes? Is this only for nursing homes or any other senior facilities, senior housing assisted living? Is it specific to nursing homes? It's just nursing homes? Yes, okay. Thank you. Stephanie Mahany has her hand raised. Yes, just a clarification. Please, with this new or with the adoption of the text. Amendment are homeowners or current homeowners and business owners mandated to make these changes. If so, is there a timeline for it? That's a good question. None of these rules require any new changes, new things that people have to do to their buildings or properties. It's really about allowing more people to take advantage of some of these options, but they are optional. All that's required is what is currently in the building code for flood resilient construction. So, even if a homeowner were to go and sell their house, there would be no obligation to bring it up to a compliance level. That's correct new construction or a substantial improvement to a home, which is an improvement, that's 50 of the property value home value, so unless you're undertaking really major renovations to your home. Okay, thank you for just to sell your house. You wouldn't have to change these Michael Divine. You have your hand raised yeah, I'm wondering if having the text amendment, if there's any way of knowing if they would impact like insurance rates, you know, would there be this expectation from insurance companies that oh these homes, homeowners should be making these changes to their houses and I? Don't know if anybody would have any insight on that. Many of these provisions were developed with the idea that if people are do undertake them, it can help potentially reduce their flood insurance rates. But to my knowledge there wouldn't be the fact that you are able to do something and are not doing it. I, don't think that would affect your flood insurance. It's meant to help bring costs down. Okay, Stephanie! Do you have another question that your hand is still raised? Actually, I do since it's still up it's just curious when you, if nursing homes are restricted from being built in those areas, are there any provisions or resources to help nursing homes find other places to be built? If there is a need for them not tied to this text, I, don't know a lot about citing for new nursing homes, but it's something that is addressed at the state level and I think the state has to determine that. There's a need in a particular location that wouldn't be changing from this zoning text, but we I can find more information on that for you, if you are curious, I am curious. Thank you. I would just comment that when, if you go to a sheepshead bay, there are a number of nursing homes there and they were built there some years ago, because they were out of the way not easily accessible and so therefore were easier to acquire the land and I think these are areas that are definitely in the flood zone and I think anything that we're looking at in the future. That will be definitely considered. Okay, I think because of the location of many nursing homes. I think they were probably built about 20 years ago that this will all be considered in any future. Sightings. Okay, I, don't see any more questions. Okay, so we have a motion. We have the issues. Is anyone willing to make a motion come on? It's Dean's turn I can make the motion okay and yes, motion to support as submitted and I'll stay. Second, okay: I think we could do a raise hands with everyone you're doing all in favor, okay looks like everyone, it's unanimous recusal, oh one recusal, so the motion carries. Thank you all so much for your time. Thank you. Yes, thank you all bye-bye. Thank you Kate and have a good one. I, don't see the environmental committee as much as I used to and I miss you and I think I love all the issues and what you're doing? Thank you. It was really nice to see everyone tonight, good, seeing everybody. Okay, I will. Second, yes, Dan! Second, okay, have a good night. Everyone.",
            "summary": "A special permit for a non-permitted use could use for a daycare center and so we're interested to hear the application, and this is, If we remember all the other discussions in the size of the building, is basically what is permitted under current zoning.\nSo we're here for a special permit, as mentioned for from by section 7319 of the zoning resolution, to allow a daycare center in a building that is being built.\nIt's, a new building, it's a five partially sixth floor, building, six or a building with the seller and the school is looking to or proposing to occupy a portion of the first floor along 89th, the entire second floor and a portion of the third floor.\nLooking at the intersection of 89th and 5th Avenue, the layout of the building the school is proposing to take about 13,500 square feet.\nThe remainder of the first floor along fifth Avenue is going to be commercial with the school occupying a portion of the building and their main entrance along 89th street there's also a separate entrance for additional community facility and commercial that occupy the upper floors, which I'll show you in a minute.\nThis, building building's proposed to have 152 students with about 19 teachers coming primarily from the Bay Ridge area, and the hours of operation will be Monday through Friday 6:30 a.m, to 6:30 p.m, again, not all of the students, the entire time, But we have a staggered arrival wherein parents who have to leave early for work or come home late from work can drop off their student, their children at the school.\nWe have to make four findings in order to qualify for the change of user for to allow the daycare to operate in this location, one of which is that we have to search the area to find an alternate location in a zoning district where the use is as of right.\nThat's, where the students will primarily come from any alternate building has to be about thirteen thousand five hundred square feet with thirty six hundred square feet at the ground floor to accommodate the requirements of DOH Department of Health, which says that two-year-olds can't be above the first floor, an additional 10,000 square feet between the second and third floor.\nThat was located in 9201, fifth Avenue, the coroner 5th and 92nd street, the building's still in its planning stages.\nAs of right, So you can see from this that we're directly across the street from an R6B zoning district which allows for this school use as of right.\nThey'll, usually put a or suggested no standing sign in front of the building to allow for drop-offs, and it can be tailored that it's during arrival and dismissal so that it's not disruptive to the evenings not disrupted to the middle of the day when we don't have students coming and going.\nIt's hold on the other businesses so along fifth Avenue, the commercial district, The commercial use only accesses through that front.\nAnd I'm worried about it laying fallow if, in the event that the school moves out right, So it would require, if it's not a so first of all, It would only be a community facility that can occupy this space and it would.\nThe expense is something that the ownership took upon, themselves, realizing that this is a tenant that has a well-established business, a well-established school and anticipates you know being in this location for a very long time, I'm confused as to how it can only be a community facility.\nWas it their intention to have a school move into this building while before they built I, don't think it was, but the opportunity arose and the developer is doing the construction for the school to entertain the school I think it was anticipated as a community facility space like the fourth floor, but the school came along and it became a good match.\nOkay, This question, is, with regard to potential recusal in the committee, is brickellage the architectural firm for the new building or for your application.\nSo I want to just mention to the committee that 89th street between fourth and fifth Avenue, which is the corner, which is the where the this property lies a number of years.\nNow the department of transportation, the Community board, approved a pedestrian safety change at the intersection of 89th and 4th, and as part of that safety improvement project 89th street between fourth and fifth avenues.\nThis proposal is for the Fifth Avenue and meaning that you know drop-off would be on the right side of the building, which would be the you know.\nI do know that the school construction authority was looking at that location, I, don't know what its status is, though, and also remember, also that the dealership across the street and Fifth Avenue that also vacate the building.\nAre you saying that it's antiquated, because it only allows for very for a very specific amount of community facility and a very specific amount of you know types of commercial where you're not going to necessarily have small retail there.\nYou know to be an advocate if you had an alternate business, whether a medical office or another community type, facility, you're going to have an equal amount of traffic to me.\nImagine that any issues with traffic would essentially self-resolve within the first couple of months, which is what we see when we build a new school anyway, exactly the same issue, which is why we I think we don't see that many complaints, after one is built, is that everyone kind of figures out how to live with it.\nThe motion is because I believe that exactly what we're talking about C8 district is intended for this kind of a thing for crowded area and this kind of thing it does not infringe in any way on the local residential, population, I, think that, Under the circumstances and as I said before, we need schools, We need day care centers, and this is something that is needed.\nHowever, in the situation and considering the time constraints, This was done on a temporary basis and now those flexibilities are beginning to expire, and thus this proposal would help make the post sandy provisions permanent and also it would expand them so that communities have a greater flexibility to adapt, and this is based on all the feedback which we received with the stakeholders, the community members, the businesses on what provisions they wanted and wanted greater flexibility with as we'll see in the presentation and ultimately, This will help everyone living and working in the flood plain area to design, as well as retrofit the buildings so that it would reduce future damage from coastal storms would be resilient in the long term by accounting for future risks from climate change and also, of course, potentially to help save on the flood.\nThey were established after a long and robust study and stakeholder research process, So the first is to encourage resiliency throughout the current and future flood plains, and this is really people living in and around flood plains want to be able to prepare buildings for flooding, even if they are not located in what is currently determined to be the high risk, flood zone and people also.\nPeople want the option to raise the occupiable or ground floor space a little higher than the current flood level that FEMA projects, because they have seen higher flood levels already and, as we know, with the climate change and the risks involved, that level and risk is expected to only grow in future.\nWhat this means is that for any lot, which is located either in the high risk or the moderate flood risk, planes would be allowed to use the proposed special options for resilient building design and just for those who are not aware, The 0.2 percent floodplain serves as a proxy for the high-end projection of 2050 and the one percent annual chance flood plain, allowing the city to advance the resiliency in the longer term.\nThe proposal would allow such exemptions to apply to both existing and new proposed buildings, and the intent is really to apply the allowance more consistently and support the new buildings adapting to climate change, and the current rules also include flood area exemptions for spaces that are dry flood proofed, and this is to promote active uses at the street level and so moving on regarding the building envelope.\nWhile we have all these rules, we recognize that not all buildings in all situations would be helped by the provisions and the options which are envisioned and anticipated are required, and so the proposal would allow, or rather continue to offer discretionary pathways in the form of Vsa special permits to ensure that certain unique situations which has not been anticipated or expected, or any hardships based on lot issues or special constraints, can get relief from certain zoning provisions in order to meet the standards for construction which are given in the flood plain.\nThe proposal would allow power systems like generators, solar energy, systems, batteries and other storage systems to be considered as permitted obstruction in open areas across all zoning districts.\nIt just makes it more flexible for property owners and homeowners if they want to do resiliency retrofits on their homes on their buildings, which can include elevation, But there are other strategies as well, and part of this proposal is allowing for people to undertake partial resiliency measures so that maybe they can't do everything all at once.\nIs the flood resilient construction standards and that is required right now for properties in the one percent annual chance flood plain or the high risk flood zone.\nYeah, because I know that, like the New York City, flood plains had only been updated, I think before Sandy they hadn't been updated for 30 years and they were updated after Sandy have not been updated.\nI know that the National Academy of Sciences I, think in, like 2015, had said that, basically, That floodplain would probably be flooded every 25 years give or take in the New York City region.\nThe community board, the Zoning Landings committee reviewed this three years ago in October, 2017 and supported it, But in that time are there any changes to the flood plan in community board 10, since 2017 has the flag.\nIs what is currently in the building code for flood resilient, construction."
        }
    }
}