{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCw4JngrDzyLiv6IiCVkFywg",
            "title": "Land Use Committee October 2020 Virtual Meeting",
            "publishDate": "2020-10-13",
            "shortDescription": "",
            "lengthSeconds": "2:09:33"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "i7qICW4AU9k",
            "fillerWordCount": {
                "uh": 606,
                "um": 230
            },
            "readTimeFullTranscript": "69 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "years": 32,
                "street": 30,
                "land": 24,
                "register": 23,
                "libraries": 21,
                "buildings": 19,
                "map": 19,
                "place": 19,
                "dominicans": 19,
                "library": 18
            },
            "wordCountSummary": {
                "street": 10,
                "land": 5,
                "register": 4,
                "drive": 4,
                "history": 4,
                "place": 4,
                "places": 3,
                "designation": 3,
                "course": 3,
                "wall": 3
            },
            "fullTranscript": "Hi, you speak and pause. Okay that looks like an antique cabinet behind you vivian and yes, it is. It has a weird panel that does not look appropriate, but otherwise it's nice. It is nice and it happens to totally match the wood of of the dining room you're. Seeing all this crap, we see. Oh, like Wayne's apartment, very nice yeah. We happen to just find it and it houses. All a lot of photographs is what's what are it what's in there in case you're curious behind me is con. Behind me is concrete. Is that what the walls are you can see? The part of the Wall part of the wall is actually a column and which is co highway. Is that the ponte vecchio? No, the Ponte Vecchio, is in Florida florence, and so what's that this is a chateau in France. Oh got it wrong. Oh, I knew it was french. I think that should know so. Wine is fine. Good, hey, Omar, hi, paola hi good morning. Everybody! So are you with us today? Paiola, yes for the duration of the meeting, okay, Hey, Rosie, Rosie's, muted, good Jim. Are you taking virtual classes right now? Yes, what are you doing, introduction to film and media studies? I now just watched citizen kane again, but with more educated eyes, very good movie. Where are you taking those courses Columbia, we can all take free classes from being in our zip code: hey Simeon, Hey, Vivian, hi Simon. How are you wayne good to see you and I see we have Tim Anderson with us? We have a few of the team members from the I guess the Dominican Studies Institute, who will be speaking with us later good evening. Can you guys hear me all right? Yes, one, two, three, four five, so I am expecting Chris. He said he would be here have not heard from Steve, but it's early yet he'll be the late Steve Simon yeah. Okay. So I do not need to take my notes, I'm probably well, I said I'm expecting Chris is not logged in yet so all right. I remain poised. Thank you so much vivian, because I'm I, if I, if I were forced to take notes, then I would have to concentrate on that and I would not pay attention to the meeting and of course that would be a tragedy about the same thing, but it is what it is well you're a week or two younger than I am yeah, maybe in a while manny what I have not seen manny in a while hi Jim. How are you hi? How are you vivian? How are you wayne good? Ah there's Chris hi Chris. So far we have Chris. You got to unmute yourself, oh hey, how's, everyone doing good hanging in there like the rest of us. That's a nice background wayne. Yes, it's from a vacation nearly 13 years ago. If I'm measuring it correctly, I was only 50, then he's bragging. No, it says I was sitting in. You know one of the courtyards of the louvre. You know by you know: iron pace pyramids with the fountains going, and that was that was the first and only time I've been to Paris and I realized you know. I turned 50 a few months before that and I said what took you so long. I mean until I literally said that, because it was like wonderful, it was like what took you so long. All right got ta get a pillow. I think it's too nice for the French. That's my thinking! Oh okay! Well, the story with this particular chateau, which spans the river one side of the river was in Nazi occupied France and the other part was, you know, freer and so folks would you know, want to either get invited to dinner or to parties and kind of basically sneak out the back. So it was the Berlin wall of its time yeah. So we do have a a quorum. I'm here Chris is here. James is here Rosie's here Omar's here Vivian's here, so we do not have Steve. We do not have domingo, but Domingo has not attended a land use meeting in a while. I wonder if he is still on and Juan Guzman is new, but I think he was new as of last month and did not attend that either. So I will have to check with them to see what's up, but we do have a Quorum. I believe Domingo is he's the chair of the Business Committee, but I do not think he's only a part of that committee. If I'm not if I'm mistaken right, but I mean Domingo, was put on land use, I think in January he attended the January meeting. I believe he attended the February meeting and then nothing since okay, so I'll be. I can reach out to him if you want okay and did I just see Dr Hernandez you're muted, so I put you or your topic at the very end of the agenda before all this, because you said you had another meeting that was not going to free you up until after 7 30.. Yes right, I managed yes, it's okay, but I can. I can move you up. We can talk about our budget issues after you, so I can shift you up later. Okay, I am at your disposal whatever you decide. Okay, so I mean let's begin: it's Chris you're, taking minutes right, yes, yeah, so it's 708 pm and I would like to welcome everyone to the October 7th meeting of the land. Use Committee, I'm Wayne Benjamin, I Chair land use for Manhattan Community board 12, and I would like to have my fellow committee members introduce themselves, and I will just do it based upon who I see on my screen. Starting at the upper left is vivian Ducat Jim, I'm Jim Berlin, Chris, Fencero, Omar, Tejada and down at the bottom. I see Rosie hi everyone, my name is Rosie. So thank you. Thank you all. We did not for the committee's benefit. We did not get around to circulating the September minutes for your review and comment. So we'll take care of that. You know we'll catch up on that today and make sure that for the general meeting they have both the September and the October minutes and of course my phone is ringing. Now that I started, we have a couple of items on the agenda. You know I learned after the last lens meeting that the Fort Washington Branch of the New York public library, was added to the national register of historic places. So we're going to have you know, Simeon Van Gaal from the historic District Council, just give us a little backup on that, and actually I got an email within the last hour or so from Natalie, where holy root is also, you know up to be. Actually it is on the national on the state register and it's being forwarded to the National register. The land use committee and CB12 has always been. You know, quite supportive of historic, designation and I see Natalie has raised her hand. I do not know. Does that mean she wants to be paiola? Could you maybe make Natalie a panelist as well yeah, I'm going to teach y' all okay! Thank you. So you know we can talk about that. A bit we're going to have an update on the discussion of the 857 Riverside project that we discussed last month. That there's been conversations with the borough president's office and, with you know, Councilman Levine's office, on that we are getting an update on. You know the proposed casino heights District- and I probably mispronounced that because I'm cold Dr, Ramona Hernandez of the Cuny's Dominica Institute, Dominican, Studies Institute and her team will be joining us to discuss that everyone, and I happen to be graduates of what the Saint C City college a few years apart and then, for you know the expense and capital budget priorities. This exercise we go through every year so and I think Paiola, if I think, there's Peter Green, who is on the line as a probably an attendee. If you could perhaps we'll switch him over to yeah move up, because when we talk about the 857, he may want to be able to interact directly. So first I'd like to you know, welcome or maybe welcome back because I think HTC has been with us before on a few occasions, simeon Vancouver from the historic Districts Council to speak with us about the Fort Washington Branch New, York public library register, with the listing with the register of historic places. Thank you so much queen. Yes, we have been, but it's been a number of years and I apologize, but one of the only good things about this ridiculous sort of situation we find ourselves in is that this way I can actually come to community board meetings and then commute downstairs to my kitchens to make dinner rather than having to get out of a train or something like that at 11 o'clock at night. So the historic for those of you who do not know the historic Districts Council is the citywide advocate for New York's, historic neighborhoods. We have been around for 50 years. We are a not- for-, profit, independent organization that works with over 500 neighborhood- based groups throughout New York City, to enhance, protect and celebrate the physical characters of their historic areas and buildings. We do this through advocacy, community outreach and education. We have worked in your community a bit with vivian and with Wayne as part of the Audubon terrace Historic district expansion, efforts and celebration of that, and also Inwood, of course, was actually our first one of our first classes of the six to celebrate. We have an annual program of working with six neighborhoods or community campaigns that are, we work very closely with them for a year and then continue to work on those issues. In order to highlight them, we do a nice guidebook for it, and Inwood was actually the first one, the first classes of that back in 2011.. A later class of that was actually picking up an internally generated program of the historic Districts Council, which was the celebration of the Carnegie libraries of New York. Like I said, HTC has been around for 50 years and starting about 18 years ago, people started getting very nervous about our libraries it at least they started expressing it to me. I've only been with the organization for 22 years, so they may have felt about this longer. Excuse me 23. so, and we said wow, you know I mean the Carnegie libraries are one of a class of wonderful architectural historic buildings that sort of exist in their own group, other one other kind of classes similar to that would be the cbj snyder schools and then you get into roman catholic. Then you get into churches and stuff like that, but really the libraries, especially because of their the way they were generated through the Carnegie grants, can kind of be looked at as a class unto themselves, and you can compare apples to apples with regard to the original Carnegie libraries as I- and I should have this number right on top of my head. Actually, I've got this popped up somewhere. There are 46 existing Carnegie grant libraries in New, York, City yeah. No sorry I knew I was wrong. 67 Carnegie grant libraries in New York City, which is considering that Andrew Carnegie gave money for libraries throughout America a remarkable collection, so we start doing these Carnegie libraries with the eventual goal of getting them placed on the national register of historic places. The reason we were going for in our status was because libraries use public money and if we can get something on the national register, the whole purpose of the national register is to make certain that public funds, when they're being used to alter historic buildings, are used in the best possible way and in the most sympathetic way being that the libraries by and large the library systems, the three of them by and large, like their buildings, all they would need was sort of gentle guidance to make sure certain that they do the right thing. Well, the best laid plans right sounds like a terrific idea and really easy you're, just trying to say trying to like list 67 buildings on the National Register fast forward. 20 years we've gone through two official consultants. We raised a bit of money, not a lot a couple of thousand dollars for this gone through two official consultants, a six- pack of interns and kind of endless, I'm a lot more gray than I was when I started this whole thing and we finally get down go. Also. We've gone through like four governors at this point because we started like 2003. it's now 2019. Honey. Well was this was last year when we finish it up right, so we finally get what's called a multiple property resource nomination, which was the idea was that we get a kind of armature for the Carnegie libraries as a class of buildings on the national register. Then, as people wish, they can put their own branches on it, using the context statement that we have created. So we got this, it's a thing. It's taken such a long time and then the state to start preservation fund turns around to Us data start preservation office for giving, and they are the people up in Albany. Who you know are the keepers to the National Register for New York state, they say well, we need a test case. We say what, like we've done, all this work. You said that this is fine. They said yeah. Well, I mean in the last couple of years the way we're doing multiple property resources has changed a little bit and we really want to see sort of proof of concept. So we're going to request you to do a national registered nomination for a branch library that works in conjunction with this multiple property resource document. Well, the final consultant we're working with feels terribly guilty because he's taken three years to do what should have been a nine month job, so he throws it in. We sort of look on a map and say you know honestly. Upper Manhattan is under is under designated on every level and we thought that anything that we can do any kind of historic property that we could bring to upper Manhattan is a good thing. So he looks through his files and says how about the Fort Washington Branch, it's a beautiful branch. I've got all the information in front of me. I say Chris, his name is Chris. I do not just call him Chris, randomly Chris go for it, he does it pandemic hits. We get delayed another action, so we get delayed another like seven months, but finally, in June, when we had anticipated this was going to happen in September of last year that rolls around we've kind of forgotten about. It goes before the State Board, and that is how the Fort Washington branch ended up on the national register as kind of a byproduct of the broader issue of all of the Carnegie libraries- and I do HTC- is the sponsor of that listing. Okay and I deeply apologize. No offense was meant towards this or towards this towards the community Board or the community. It just was one of these things of, like, oh, my god, we're finally getting this done. This has been looming over me since I was a young man of 32. So, let's you know kind of move forward. So that's that is the story the hold on. If can I share screen? Oh wow, I can share screen. Okay, let me just get up. You all know the library, but let me pop you open. I think that was clear when it reopened. Sorry, I think I was there when it reopened after renovation, oh cool, all right so sure screen and we're going for. I do not okay, so this is where the library is. I do not think this one has been renovated. Was it renovated the Interior? Yes, I think I think I think it's been brushed up here. Is you know 179Th street right over there? Let me bring this down a little bit for you now the important news, that's the library I used as a kid that people feel so very strongly about libraries. For exactly that reason. Yes, I was a preschooler not allowed to attend school, because New York state has that ridiculous. You have to be five years old to enroll in school, so I spent two years in this library instead waiting to reach that magical threshold like but you're there now are not you yes, you're here now: here's the Interior! These are reasonably recent pictures. Yeah the Interior is basically unchanged, slightly updated, but still has its original configuration, which is very important to the national register. Beautiful. Oh, my god. Here's just a little detail, wow from the children's corner and that's it. You know the interesting thing. One interesting thing about this library is it was it was designed by. I want to get the name Right, Cook and welch, who did a number of libraries, but cook was designed Carnegie's mansion, the Carnegie mansion on East 91St street. What's now the cooper Hewitt yep, so it was one of the last Carnegie libraries it was built in 1914. It was one of the last Carnegie libraries in New York City to be built, maybe the last definitely the last in Manhattan it was the northernmost branch at the time. The way the Carnegie system, the Carnegie grants worked, was the city had to put up the money for acquisition of the land, and then the Carnegie foundation would pay for the actual building of the building. But the library, the library systems chose the land and then City Hall had got veto power in order to make sure that there was not a little political patronage going on and remarkably for the early 20th century in New York in New York City, because most of the libraries were built between 1898 and 1914. There was remarkably little corruption in the in the Carnegie library. Building out it was. It was actually a sort of a model system. This was also reasonably rare in that it did not replace any existing library. A lot of the libraries which came about were sort of there had been libraries in the area before and then that sort of served as the as the basis for their collections. This was not one of those, so that's I mean if anyone's interested, I'm I know Wayne Scott and I'm more than happy to share. Also it's a public document then out the written national register form for the library, and I shared that report with the land. Use Committee, oh fantastic, and I can also share with Wayne. He can pass it along the 42 page, history of the whole Carnegie system, great yeah. What wayne? When did you sent that to us today? No, I sent it to you a week or more ago. Oh all, right! Let me look for I did not miss it. Simeon Pat Courtney wants me to tell you that the libraries as a whole were six to celebrate and that you should say that I did, but that's so sweet of pat. Yes, they indeed we're one of the six to celebrate. One of our programs search me. If I remember the year, I want to say it was 2013.- is also involved with the national registered listening for Holy Root church, no okay. So we have to find out who's, advancing that I bet you that might be my colleagues at the New York Landmarks, Conservancy, okay. I know we know them as well, so they should not be afraid to speak to CB12 because we do not fight they regularly go around and they try to get national register listings for particularly churches, so that opens up additional ways of funding for their sacred sites. Program yeah, maybe I'll, just invite them to come and have a getting to know you meeting with land use yeah very beautiful science person knows every religious property in the five boroughs and beyond she's fantastic right. Any further questions comments on this topic. Did we thank him for doing the work to get this on the national register? So I mean, I think, we're thanking you for doing the work to get this on the national Register, and I just want you and everyone else to know that both the land, Use Committee and the board as a whole has been very supportive of historic designation and have actually passed a couple of resolutions to that effect. Fantastic. Well, thank you. So much it's really. We depend on articulate informed advocates like this board. I wish all the I wish all boards were like this Dr Hernandez. Were you raising your hand on this matter? Right? I just I mean it's beautiful I mean the library is deserves all kinds of recognition and acknowledgement and placement it's beautiful and then the stories behind the library do you think that it was going to be very difficult or at all getting it on the national Register symbol. You know, I really did not when we embarked on this. We really thought this was going to be maybe a three- year project, not a 13-year project, and what can I say people would you know some people ended up starting families and that knocked them out for nine months or a year, and then it was. It was it's just one of these things. That's just been lingering around. It was through no fault of through no fault and no onus. It was all positive reasons that it took a long time, but it was, it was frustrating slightly frustrating there typically is a plaque place on a building when it's on the national register has that been placed yet and if not where's it going to be located. I know nothing about that. It would be up to the library entirely if they want to do that. Yeah, I've seen them on the facade of building, maybe near the entrance. It says it's a national register and it gives a blur. You know why it's on the national register yeah. I do not know who at one point the New, York Community Trust ran that project. I do not know if anybody's actively doing that these days. There's lots and lots of properties that are on the national register that do not have that. Okay and typically national register properties, unless they, you know just say, National, Reserve, historic places and like a little seal. It's not like a big explanatory thing. It's up to the library really I mean because again the thing about the national register. As the committee might know, it puts no onus on property owners, except in dealing with governmental police right now. Peter did you have your hand up for this topic just to ask Simeon to please stick around for the 8:57 discussion? That's all I look for. I think Simian is familiar with the 857. Yes yep, just a little Jim. I just wanted to comment that the Holy Root church is a really very beautiful little church and you know they redid a lot of the exterior a while ago. So it is now even more magnificent and of course it has programs, and it's been one of the churches in the neighborhood that has you know, had people take sanctuary there. Vivian. Are you raising your hand? Yes, so Simeon, now that the test case has gone through, does the rest of the package go through together? You still have to go one by one. What it is this really it creates an armature so that you can it's much easier to do national. You can get libraries on the national register. They still have to go one by one, but you can just say, as seen in the context of this, of the broader issue, rather in context of the broader document it fulfills this and this and this so it's much simpler to do great. If there is not anything further on this, I want to once again I want Simeon. We can only see your nose down. Oh god, I'd like to see I'd like to see this written up in our local newspaper. Is there a chance, you'd be interest, you would reach out to or the Manhattan times, and let them know that this has happened and see if you can interest them in doing a story about it. If you tell me who to talk to I'm happy to try to do that, yeah Deborah Lee Santos is the name of the editor yeah. Well, maybe Deborah Lee can also reach out to the Community Board for comment fantastic. She is fantastic. Okay, great all right! Thank you, my pleasure. Thank you for inviting me. I will hang around for a little while, but I am also interested in seeing the debate. Okay. Well, yes, a little bit nine yeah, typically land use is finished by 8:30, although last time you went to like 908 or something like that, so the next item on the agenda is in fact an update on 857 and in addition to Tim Anderson from the borough president's office, we have manuel Bellardo billiard, which how do you pronounce that belly yard okay and are have you also been in the loop on the discussions with Mark's office on this on? Yes, I just spoke to eric about this earlier today: Eric, yes, Eric and Icebook, so Tim I'd, ask Tim Anderson who, as you know from the September meeting, is the planning Rep with the borrower President's office who works with CB12? I forwarded, I summarized like a half a dozen questions that came out of the September meeting to the borough president and to mark and to Senator. You know Jackson and to everyone else to you know get them. You know involved in this. You know. Tim has responded a couple times and I wanted him to give us an update, and I spoke with you know: Eric Coelho from Mark Levine's office, and we shared some emails back and forth. So we have both the borough president's office and our council and office here to give us an update on you know what they've learned and what the extent so Tim I'll start with you the floor, or rather the screen is yours. Thank you so much so updates on this from our office. I think Wayne, as you know, with the questions that you sent to us central to what happens with 857, really depends on this wide street designation, and it has been a little difficult to get a response out of DOB and DCP to an extent of what exactly the dimensions of the street are, because I you know, as we've discussed and with the photos that you shared with me earlier this week, you know there's, obviously the change in the topography at that location. There is that green space, and I think you know once we can really get an answer for this on the wide street. It will really kind of, I would say, would limit. You know any potential development and it would obviously that would if the street is not wide, it would definitely, it would definitely come under the sliver law, because I think you also raised. I spoke with ophelia from DOB a little earlier this week, still waiting for her to get back to me on the sliver law question because I you know obviously like it's a matter of the wide street, and you know I know I was recently in touch with Peter and George James. I think we have a meeting that we're trying to you know get in the works to try and figure out what the borough president's office role would be in the discussion on the city map. You know, I think I'll definitely bring this up with gail next week to let her know that you know we may have a role to play a larger role to play in the decision- making process into which map gets used by DCP, or in this case the Ob and yeah we also signed on to. I do not know. We've also, you know been working with Eric at Cm Levine's office on a letter to the developer. So you know we our office is happy to sign on to that. I think the only other update I have is I you know I promised to let you know. If Gail's had a chance to speak with the DOB commissioner, she has not, and I'm still going to you know, keep pushing to make sure that meeting happens. So we can really you get an answer because I know this is a. You know huge concern for you all manuel anything, just two things, two things to add yeah. I had gotten confirmation from Eric that the Manhattan president's office actually did sign on to our letter to DOB about 8:57 we're waiting on one more elected to sign on, and you guys should have it before the end of the week. So the councilman's office is sending a letter to DOB, yes Sir and the gist of that letter is what, from what I gathered. The contents of the letter were something along the lines to have Mr John Rayne come to come to a meeting with CB12 our office and the borough president's office to speak about the situation at 857., who's, John he's the man borough director for me, and I think I think it was. I got Tim in touch with Steve Simon, not wearing his land use, CB12 hat but wearing his park's hat, because what he will be, what DLB is saying in its you know, determination of the street with it's counting, basically from you know, street wall to street wall, so the lower drive, which is actually a two- way street that was actually built before the upper drive based on Matthew Spacey's research, then there's the upper drive, but between the two is, you know, part of a city park, and last month someone pointed out they thought that was part of Riverside park, but state Portland actually is part of Fort Washington Park, but the DOB is comparing it to like the planted malls on Broadway or Park Avenue, which, to my knowledge those malls are part of the street. Although city parks may have responsibility for maintaining them, it's not the same as saying you're going to take the park land and say it's part of the street and measure that so I do not know Tim or Steve did that conversation did they touch basic parts on that at all, yeah Tim sent me an email and I last night I sent him back one suggesting that he contacted our chief of parklands. I do not know whether I do not know what happened. No, I have not had yes, I got your. I have the contact. Thank you so much for Colleen I'll definitely reach I'm going to reach out to her yeah. She should be our expert on this kind of question and if she is not, she would at least have somebody maybe in her shop who can answer the question. But this is you know beyond my comprehension right, but I thought you would be a good person to speak to and you could point them in the right direction and you have never yeah, which is what I did yeah, but yeah, but also Wayne you're yeah. I think you're accurate, that the Broadway malls are actually technically DOT property, which we maintain. They are part of a street. They are being in the middle of between northbound and southbound traffic. So I agree with you that this is not an analogous situation. The parkland between 158 and 165Th Street is officially New, York City Parkland, and it is not between north and Southbound lanes. So it is, I think, it's a it's a distinctly different from the broadway. If what you were told is that this is comparable to Broadway, I think there's clearly an argument that it is not. I believe, that's what the borough president's office was told yeah. Well, I think we have an argument to the contrary. Oh I totally. I totally agree with Steve's analysis. This is not like the Broadway malls at all. These are two separate streets, even if they have the same name but they're. You know and then there's a park between and it's not a mall. It's a you know. Well, the upper drive, I think, is the equivalent of a service road. It's it's not! You know. It's not part of the Riverside drive segment, you know it's can I think it's he in on some maps. I think it's referred to as just a service road. Actually the upper. What is now the upper Riverside drive is the remnant of Lafayette or Lafayette Boulevard, because remember Edward, Morgan place that used to be Rudolfia and that continued up. So when Riverside drive was extended north it took that securities route on what we call the lower drive that upper portion- and you know Matthew Spady, just published a month ago. So the book, the neighborhood that Manhattan forgot or New York City forgot, and we did for historic, Districts Council a sort of a video discussion that I moderated for him and so he's done a lot of research on the area going back to when this was John, Audubon's state and before- and he pointed out to me after the September meeting based on his research. The upper drive was built later, so I mean they were not even built at the same time to be the same room, yeah Peter yeah just point out last weekend, one of my neighbors actually organized a cleanup of the park in with enormous support from the Department of parks. Thank you, Steve, including a woman whose name slips my mind: who's. The assistant commissioner for upper Manhattan she's, the northern Manhattan parks, administrator, Jennifer Hopper exactly and the fella named Malcolm slips my mind. Who's responsible for all the playgrounds and things up there for years been very clear that this is part of the. This is a city park this land and calls years ago to D.O.T to get them to do something about even just cleaning the street. At the bottom, where there's no sidewalk we're met with call parks, it's not ours, but you know, I mean D.O.B seems to think I guess, based on this, that central park is just a grassy median between 8Th, Avenue and 5Th avenue, which just seems kind of ridiculous to me, but yeah. The whole issue of the width is absolutely vital here in terms of 857, and I think what Tim alluded to about the fact that the borough president's office determines the maps is something I'm hoping we're hoping to meet this week. But I guess it's not going to happen, but we'll meet next week to discuss this more precisely, but it's really a Vp's power, apparently to determine which maps DOV can use. I'm not clear why Dod is so enthusiastic about ignoring any community interest in this site, but you know Eob is DOB. Well, let's put it this way. When I was speaking to Tim about this one of the problems and we've discussed this for years. One of the problems with some of the with maps in general is they are, you know, they're flat, it's think of things in two dimension and going back to what Edwin Marshall used to be our contact for city planning. You know the zoning maps, you know look at the sites as if they're flat, when we come up to Washington, Heights and Inwood. We have heights and some of the sites are anything but flat and speaking to Tim. He said he was not that familiar with the area, which is why he sent him a bunch of photographs to show that starting at 158Th Street the upper lower drives. You know, take their paths on different elevations and, as you proceed northward you can see from you know, the lower drive, the height of that retaining Wall. I mean there was a dhl truck parked there, which was good, because you could see the scale of where the street was the upper drive compared to the lower drive and then, when you're on the upper drive, you've got the top of the retaining wall, which people use basically as a bench, but then you're looking into maybe the second or third floor windows of the buildings acrosss the street. So you know the map, if DOB is just looking at it flat might say: oh well, this just looks like it's a median. If you're looking at topography, you would see that it's not flat, but a picture is worth a thousand words, which is why you know I shared those pictures, and you know it's there's a whole staircase there that we can get gail to come and just meet us at the house in a week or two and just see this with their own eyes and make your emotions. I think right, but you know to stand there, see the house talk to the fellow who lives in it now see the exact slope and everything along with others could really. You know help I mean I would leave that to the folks who are coordinating. You know with the Bo President's office. You know to see what her or what her calendar is like. That's what we're working with. If I may just a number of years ago, four years ago there was a situation in carroll gardens in Brooklyn, and this was the area in Carroll gardens where they've got very deeply set back row houses, but the streets had been designated as wide streets, even though they were two- lane standard streets, because the row houses were so deeply set back, that DOB regarded them as wide and mayor De Blasio when he was still council, member De Blasio. As I recall so this was some time ago and because this is like the only thing he ever did to help out development concerns in Carroll gardens. He somehow, through his councilmanic powers, just managed to get DOB to accept that these are now streets, so that you know, maybe he interceded through the Brooklyn bear President's office as a councilman. But I mean that's that you know if you've got gail, who is generally sympathetic to the communities and your councilman on your side. That might be a way of doing it right, but it sounds like what he convinced them to do is to look at where the property line begins, as opposed to where the building line is exactly. I mean so manny, that's something that perhaps Mark can look into, but I mean that's not even the case here, because it's pretty well built up. What we need together to look at is you know from the face of the building to where the street ends and the street ends at you know. You know where the park begins, but that park with no sidewalk either pointed out. I mean if it were a street the medians have they do not have silence, they have curves and things like that. You know. There's no curve, I mean it's dirt, it comes downhill and it ends in dirt, so it may be between the borough president's office and the and the councilman's office. I can look at that. I would also point out that Al Taylor, although he is a state elected official, said that you know he is supportive and whatever we need him to do. He'll do Peter. So I want just to give you all a very brief update on the house. Overall, I think you guys have covered the land use and zoning issue pretty clearly, and there is one last big Zoning Zola issue, which is what exactly the 35 foot 40 foot width is referring to in the sliver act, and there are some people who say it refers to the street wall and others that it refers to any horizontal line on the lot and then others who say no. It's meant to be the actual width of the lock, because the lot has a Christmas three Foot street wall, but it's only 30 front feet wide or less than that actually, and it's 35 feet wide at a diagonal on the rear. So that may also be something that really needs to be resolved as well, because when I spoke with Ryan cody after the last meeting he said yeah somebody could take a lot. That's ten feet deep with a hundred foot street wall and theoretically put up a sliver tower if they could find the steel that would make it possible so that that's also out there. But hopefully we won't have to go down that road, because we have done some historic research and we've discovered some really interesting links to abolitionists a very prominent uptown abolitionist and possibly to the underground railroad rail road. We're trying to nail down a little more about that, and that might make a very interesting case to the Landmarks. Commission Simeon's been giving us some tips on how to make a stronger case, and so we're working on that right now and then, as sort of an aside, which has nothing to do with land user zoning. But the very sad story of the guy who owned the house and had to sell it and that he got caught up in the countrywide mortgage. Easy money stuff in the early 2000s borrowed way too much money that he was never able to pay back. And then this developer came to him in one of these scams that they warned you about and said. Oh I'll buy it at auction for a pittance, and then you will lease it back for me until I'm paid off and then you'll keep the house and the bank will swallow all the money you lost. Of course, the guy had no intention of selling it back to Al Wright. The man who lives there and Al has been squatting there since he sold the house at the end of last year, but he's been told that by October 15th that's eight days from now he has to be out or the developer is going to come in with sledgehammers. So we are working right now with Wendy olivo from Al Taylor's office and an attorney to try to make sure that nothing illegal happens because evictions are stopped right now we want to make sure that we can buy ourselves some time to see where we go with it. So I just want to share that update with everybody. I'd say thanks for that. Lpc and I've pointed this out on a couple of occasions- has not really been a receptive partner at least uptown to either expanding the audubon park district or designating adjacent contiguous districts, and you know the upper and lower drives back in 2008, or so when Autobahn Park was being discussed. We suggested a much broader area to include the upper and lower drives and when it was not included the community board, you know they supported the designation of Audubon park as it's currently defined with about you know a dozen or so buildings, but we also said in the same resolution that we urge LPC to move forward expeditiously with additional designation. They have not done that and you know, while the product, the possible connection to the underground railroad, is interesting. I think that Matthew Spade has pointed out that, when we're looking at the 158Th Street row houses there used to be a sugar refinery. I believe this is connected at the end of the street, which was possibly also connected to the underground railroad and were not there simeon some warehouses in Brooklyn that were connected, or I think it was documented that they're connected to the underground, railroad and ltc just did not seem to be interested, but it was another time no. It was pretty raised in the last couple years. You know, I think those were I do not know if those were warehouses is not that were not those the buildings on Delfield street yeah. Those were row. Houses on Duffield street, which actually landmarks has just out of you know very surprising reversal, has actually had a hearing was a very good hearing and will probably move to be designating the last remaining of those houses. Okay, so they changed their mind right. Yes, okay, they were chair. Sarah Carroll was incredibly clear that it was a priority of the mayor yeah, so, and thank you Wayne for bringing up that sugar refinery. So at the bottom of 158Th, Street was a sugar refinery that belonged to a man named Dennis Harris, and he was an immigrant from England or Scotland who had owned a sugar refinery in downtown Manhattan that he had used to help escape slaves, hide and get on a steam ship that he ran up to Poughkeepsie, but they would then get on to move on to Canada when that exploded and burned down, which seems to have happened, a lot to sugar refineries. He built a new one at 158Th Street and there's we're trying to get more documentation, but there is fun that was used to shelter runaway slaves. Another interesting piece of it is that the same Dennis Harris built a church at the corner of 155Th in Amsterdam. I think where the that housing yeah it's not public housing with some sort of elder housing. No, that's 157! This is the one at 155Th next to the old Welsh Church Dunwell Plaza yeah, which is a CBO housing thing. Anyway. He had built a schismatic methodist church there, the Wesleyan group, because he'd been kicked out of his lower Manhattan methodist church. For being an abolitionist, and so there was a very strong tie to abolitionism and activism, and we want to be absolutely sure before we go completely public with the term underground railroad. But that's what was going on here and there's very little notice of that in uptown Manhattan at all, and so it would be wonderful to preserve a real physical, touchstone and kind of ties in with what Wayne let off with it. At last month's meeting about you, know, iniquities, inequities and ignoring history of the african- american population in New, York yeah. But what was this building part of the part of the sugar refinery? It was built as the we're trying to find out exactly whether it was the home or an additional house built by the fellow who built the refinery, so we're digging a little deeper, but it was certainly owned by him. What year was this? The refinery? What year we're taking the 1840s 1850s, I think 1851 is when we think the house was built and the refinery a year or two earlier, but I mean for 857 Riverside drive. I read somewhere, that was an audubon guest house. Well, that's what we thought it was at first and apparently that was not quite right. It was adjacent to the audubon estate. It was not the main audubon house, one of the main audubon houses was on the site of. What's now river arts, no, not there. It was referred to as at one of their guest houses right, one of the main houses right. We thought that it was, but it looks like that was a misnomer, but it was part of the audubon park. It's a whole sort of already in the 1850s real estate development, history of people seizing on famous names to boost the values of what they're, building on smack and selling yeah actually in his book, and we might want to ask Matthew had or has a map of you know the houses that were you know, built on the Ottawa state, and I believe this area was literally like acrosss the street from yeah, and it has some houses there, but you're right. The people who live there refer to it as Audubon park as well. Yeah like you, do not live in Brooklyn heights. You live acrosss the street, but you say: well: it's really broken ice, yeah, exactly south slope. I can't fit Peter. I'm I'm really troubled by what you said earlier about the the guy who bought the house is threatening to go in there on the 15th with a sledgehammer and if the guy who's living there now does he does. He have a lawyer. Have they put this guy on notice that if he tries to go in there and illegally a victim he's committing a criminal act? Has somebody told him that that's tomorrow, Wendy Oliver and I are going to meet with Al Wright, the guy who lives in the house and try to get some of these facts down on paper and then and then the next thing would be to have an attorney. Call this guy and point out to him that you know anything he wants to do actually has to go through the court or you know, he'll end up back in jail right. No! Well he's got to have a lawyer. We got to get him a lawyer. This is crazy. Yes, so the problem is. I tried housing, legal aid that a friend of mine runs that, but he said it's really just for renters, and this is the person who sold the house right yeah, so he presumably sold it according to the record for nearly a million dollars. He can't get no, he so it was a short sale. So he had to pay the bank pretty much everything that he got for it. He sold it for 9.75, but as near as I can make out that did not go into his pocket because he had borrowed 1.1 million and possibly a lot more against it right, but I mean the point: is he obviously should be represented by legal counsel and he never has been, and that's the I mean I ran into situations like this years ago, when I worked at Harlem cbc, where there were folks and they were like going back and forth, and then we said, okay, you've been doing this for eight years who's, your attorney. We never reached out to one because this person that person and it's like it does not make sense. I mean yes, there are attorneys who charge a thousand dollars an hour. I would say he probably does not need one of those, but he should get an attorney yeah absolutely and that's what we're working on trying to get an attorney that the issue is for foreclosures and evictions. There are different processes and yes, a lot of the legal aid is not available for homeowners, okay, but maybe the assembly, maybe the assembly member's office can yeah has somebody who would do this for them as a favor. Well, that's what we're trying to figure out who we can get? Well, I mean you have the Assemblymen's Rep on the line, so you can offline, maybe the chat function. You know I mean the councilman Manuel yeah right yeah. Maybe Mark knows someone who could help out in this situation. So my point is even on this: you can go into a private chat, email I'll drop, my number in the Q&A or we can. Why do not? We try to chat tomorrow morning sure that would be great yeah. I have your email, so I can get you that way too. All right, I just want to say one more time if this guy actually said he was going to go into that building with a sledgehammer to evict the current occupant. Somebody has got to put him on notice. That is a criminal act. I'm sure he knows it's a criminal act. Well somebody's got to make sure that that he knows he can not get away with doing something like that right. The problem is separating fact from fiction was exactly right to be to be blunt about it. Okay, he made a major screw- up and I do not think he really wants to acknowledge all of it. I'm being you know more than more candid than I should be, but that's kind of at the root of it. It's like sit down with the guy see what he's got write down the story. A second time see how that compares to the first time and then see where we can go with that and compare it to the official record. Okay, whether he had whether or not he has a lawyer, the assembly member or the council member somebody, can contact the owner and tell him if he actually made that threat. That he's good, that he should be on notice that if he tries to do anything like that, he could be put in jail yeah. Well, I would say- and we had, we had a conversation at last month's general meeting, where you know when an issue is raised, that we do not have you know firsthand knowledge of the first thing we really need to do is find out what was actually said so the owner. You know, if he's you know, speaking to one of one of his elected officials or his counsel, you know can say this is what the person told me on what date everyone on you know this zoom meeting. You know we're hearing about it, but we can't say what was actually said right. So that's what I want. That's so wendy's going to come with me tomorrow, we're going to sit down with the guy and see what what's real and how it compare what he has. What he says and how it compares to what records are available and, in any event, you're absolutely right step. One is to get an attorney. Who will fire off a letter to this petrakowski who bought the place and framed his partner and say you know I want to make you aware. Evictions are halted until December. 31St evictions of seniors can't be happen during the winter, and you know any attempt to raise a hammer to anything in this house before then. Will you know land you in legal trouble, and I mean, but beyond that I mean you can't do the demolition legally without the DOB permit, as well, so right but yeah, but you can do interior damage to the house. Well, yeah, but we, I do not know what the interior house is like, but I mean the point is yeah. All of the facts that are related to the situation need to be laid out that you can't do that. That's what we're going to do first and then and then we're going to take it from there. So do we have any further updates questions or comments on 857? If not, I think you know you Peter for joining us again. Thank you, Tim for joining us again and manny for joining us, at least via zoom, for the first time. You know, please stick around the next item on the agenda. I'm going to reverse the order. So what is number five on the agenda is going to number four. Some of the committee members may remember that I think sometime last year we started speaking with Laurie from Council congressman rather about two initiatives in Inwood, one of which was a Inwood apartment house district and there's been some discussion of that district. Going back to when I first joined the the community board, as well as a non- contiguous, historic district, that is, you know, related to sort of the history and culture of the dominican immigrants in the area, and we were, I see, Laura Tobias has joined us. We were curious about the non- contiguous. I mean that can be done, but we wanted some examples where that was done and I reached out to just to get an update from lori on what's happening there. She introduced me to Dr Hernandez, who is you know, with the with Cuny's Dominican Studies Institute and they're working on the research with this and will give us an update, but I think first you have some of your team members with us and I'd love if you would introduce yourself and introduce them as well. So the floor is yours, Dr Hernandez! Ah, thank you. It's quite a an honor to to speak to you about this issue and thank you Wayne for inviting me and I graduated from Lehman, not right. That's the less prestigious right! No and back in my day, which is a few years ago, each of the colleges had the major they were known for, and so city was known for engineering Queens was known, for you know, sort of liberal arts Lehman, I think, was tied to teaching and hunter was social work. So it's not the least fit less prestigious. It's not a different major right, except that city college is the Harvard right. Well, it's the first, it's the right, it's the harbor of the poor in and then you come from the architect architecture school, which is you know it's in a in a league with son yeah. When I was there, it was not the Spitzer school, but you know that's a recent development, gracias Lodi for keeping up this project and giving us a hand as well. I want to see whether I still had other members of my team with me Professor Ortiz. I know he was teaching and I think he was going to be until 7 30. a Paul. Are you with us? Okay, Waldemar? Are you with us Matthew, Jensen, hello, Dr, Anderson, here good evening? Everyone. I see well Demar, yes, good evening, everyone great Matthew! Are you on? Yes, I'm here? Oh thank you. Thank you thank you. Without then I will not be able to do much. The first thing is, we are looking for advice. We are looking for council. We are looking for better ways to improve what we are doing and what we are doing is to try to create a historic memory of the dominican people in a place where they have recited persistently and consistently for over a hundred years. The you know outside was listening to simwad and the others, and you know thinking about the national register the what we. What we found is that the majority of the things that are registered there happen to be a physical structure happen to be things like Simua was talking about either a group of buildings because of their historical legacy, or perhaps a particular property that have to do with also a historical legacy. In the case of what we are trying to do, it's very different here we are trying to register, keep the memory of a people, so we are appealing to what we call cultural historical legacy and have the a historic district declare a name after the dominican people. This is in terms of the largest scope. Here we are in the process of putting the application together and there is a team of people working with me all of them amateur, including the professors. You know we had architects, we we're not engineers, you know I am in sociologists and then I have librarian and young researchers doing the doing this thing, and what I wanted to do is to you know, because you might ask I mean why are they trying to do this, and I, if I can, share the screen briefly, I'm going to give you a it's sort of like show to you the significance of the dominican people in the U.S, and here briefly, I'm going to. Let me see, I'm not good at it. I think that the host needed to allow me to do this yeah, I think paula. Can you allow Dr Hernandez to share her screen? Okay, let's see you're all set, let's see if I can do that. Okay, at least I have it on my own. Okay, any way to share this, you would have to press the share screen button on the bottom of your screen. Actually I did that yeah. This is, I did that and it does not show up in here. Okay, let me see if I go back to you guys and I'm able to okay. I see you here: paola, okay, let's see come on okay, cheer screen here, okay, here and here, okay, I think I got it right. Oh again, they go. He left come on come on come on come on now I can see it. Okay, great! I wanted to see it. This is I'm trying to see this. Oh okay! Let me see okay, if I can do this all right, so this is just a you know, sort of like a graphic image of the dominican people in the United States, and we go from 1613, which is the first recorded immigrant actually in in New York City, and what is today Manhattan and New York City, and this is Juan Rodriguez and of course you know the story about him and from there from one dominican that we know we go to Ellis Island and the reason why we stopped in Arizona it's because this is a a part away of a national history. The memory of really silent, the millions of people who came out to the United States in blackport in the when we think of Ellis Island, we usually think of European coming to the Us through that part. It happens that a little over five dominicans also came to Wellies Island, and this is one of the things that we are documenting in the United St in the Dominican Studies Institute, some of those people who came to Ellis Island, some of those dominicans I'm going to leave in Washington Heights, and we will show you that and of course, the big picture, the one that you know- and this is related to the what we call the massive migration of dominicans that began in the midst of the 1960s. So this is sort of like, in a very brief view, what we have from one person. We are now a little over two point million dominicans, because this data goes to 2018. I want to remind you that the this provides say, I think, a little a picture or more clear picture of that growth of the dominican people. It's pretty scary. It's aggressive in terms of for their demographic role. Of course, this is the United States, and this is also a slide that tells you the number of dominicans when they came in when they came in how long they have been living here. And if you look at this table, what you're going to see is that a little over 50 percent of the dominican people in general in general have been living here since 1990 right since 1990 over 20 years. No question actually 30 years now and the rest are the newest dominicans over 50 of them, and if you see I'm trying to do this and also look at your faces as well, this give you an idea of of how the dominican people are growing and how do the grow have to do? Demographic growth have to do because of very high birth rate. This is New York City, and this is the comparison of two dates: 2005 and 2018 in and, as you can see, these are immigrant groups. This is what is registered in the in this particular pie. Here they are very they happen to have. You know lots of children right, and this is one of the reasons why the population is growing, and this graph show you the dominican people in terms of those who are immigrants and those who are now born in the United states. The reason why we do this is because in many instances you hear people telling dominicans that they are immigrants who are thinking to go back and that they do not have any root here. All the rules are very- and this tells you that the dominican population born and raised in this country, it's growing very fast. Now it's almost half representing almost half of the dominican people, the other way, the other way. The other way- and these tells you the different places. Different states where dominicans are located. New York of Course is the is the place where the majority of the dominican people reside in the second and largest place will be New. Jersey then followed by Florida, and then you have the other Arizona. Do not pay attention to Arizona had to do that because dominicans recently elected a person to office in Arizona and the population is small, but they still managed to do that and they wanted the Dominican Studies Institute to do numbers on them, and then I have it here. But this is the 90 of the dominican. People will be concentrated in this particular 88 states and, of course, a New York is the large component of that so you're also showing large increases, and if you go back to the prior slide- oh yes in Rhode, Island and Pennsylvania. Oh yes, oh yes, particularly Pennsylvania! It's now growing aggressively. They are growing everywhere and I'm going to show you. I think I have a map here, they're growing everywhere. This is a map of the United States. I do not know if you have the the whole view of it, because I have part of my map yeah, but I guess so. They are everywhere in the in the United States, but in some places more concentrated on another, and what is interesting that they are growing aggressively in places like Pennsylvania right as compared to other places are floating. They are growing, but the grow is less aggressive, but, based on your research is, it are the patterns of growth, folks who are moving directly to Pennsylvania and Rhode Island, or these folks who were in New York. I know it's too expensive and then they move. I love your question. I love your question when we compare the all of the states where Dominican are moving right internally. This is one of the newest research that we have done. We tend to lose. New York tend to lose dominicans to places like Florida, for instance, and definitely Pennsylvania. We lose people to to them. But what is interesting is that the the what we see is that they are settled in New York and after leaving some time in New York. There's a portion of them that will move to other places, but the one that leaves are replaced by two other groups, and that is right. That is pretty high, actually the highest one in the city, and then new migrants are coming from the Dominican Republic, so that keeps the population the dominican population growing in a positive way, rather than in a negative way. If we can follow, you know growing negatively, so those two factors right: the high birth rate and then the new migrants that are coming in so the people that we lose and I that we lose- and I love your question- are people that had been living in New York for a long time or young professional. So those are the two people that we see and they floated as one in Pennsylvania it's another one and we suspect that it have to do with it high rent and that kind of thing. So, okay, sorry about that, I think we went through this one. I have not had much time to review this. I'm sorry! I've been in presentation to meetings and meetings and meetings. The I thought that I had another graph another table between the proportion of the dominican people in New York and then in the city or New York. When you, when you think of New York, the majority of the people will be concentrated in New York City, and by that I mean 90, of the dominican people who lived in New York, they will leave or they live in New York City, and that in New, York City, then the distribution of courses, all of the borrowers, will be leased a number of dominicans living in staten island, and we measured it by decades. You know that we do this, for, for everybody who need numbers from the dominican people, so Staten Island is the is. The border has the least number of dominican people today as compared to before the Bronx as the border that contain the largest number in terms of absolute number of dominican people in the case of Manhattan. This is where dominicans have the largest dominican population for decades and decades and decades. The Bronx is a new phenomenon. It is. It is now, and one of the reasons why you have so many dominicans there is because when you look at birth, where are children being born? That's one enclave, where you have lots of women giving birth as compared to other borrow of dominican ancestry, right a giving birth. So and when you look at Manhattan, the the you know, Manhattan, as you know very well, is divided by neighborhoods the a place where the dominican people have been living for a long time in large number, it's Washington Heights, and here you have some of the numbers. I think this gives you a the percentage which I think is sometimes easier as compared to other groups. The mini can have a very strong presence in this neighborhood for a long time, yeah. Well, the these two recent charts I mean they've, raised an interesting question of race, ethnicity and nationality. That can be the subject of you know and probably should be the subject of a completely different discussion. I mean we had some not very productive discussions at our last general meeting. You know on this, and I noticed that Dr Moreno Vega and the Caribbean Cultural center. They have a number of programs. I think, starting yesterday on, you know, grace Smith and ethnicity, and they had an exhibit a couple of years ago. That looked that, and so I there's so much when you look at people and how they self- identify and how they either come together or divide themselves on. You know: race, ethnicity and nationality, and you know some of the thinking just does not make a hell of a lot of sense, but it's worth a an in- depth thoughtful discussion. Well I like to pull the Dominican. You know Studies Institute, into the room with the curbing Cultural center and a few others, and we're going to have that conversation. How about that would be fantastic. I know Dr Moreno Vega for a long time I mean she's, and I come and someone that from many of us have learned from I mean yeah she's, an institution you know pushing that center. You know struggling to keep it open and receive the funding that we need to keep it open and keep going. It's yes. I agree, I agree. So could I ask a question about the previous slide? Yes, it could you go to the previous one yeah. I I find this hello. No, you had it a moment ago. Yeah this one. You know I never could understand how we in the 2010 census how we could have lost so many people in Washington, Heights and inward, and this is very instructive, because it shows that the dominican population remained pretty consistent and you know increased slightly between 2000 and 2010.. What you're, showing here is that there was a drop off of maybe 25,000 other hispanics or latinos of any race. Do you have any idea? What what ethnic group, or what type of hispanics or latinos that could have been, that we could have lost that many people from that group from 10 to 18. I win no from 2000 to 210. That shows a drop off of 25,000 in that in that group, just the one just below Dominic in any race, other hispanic or latino any race. What yeah? That is a big drop, but you know I you know. I could not believe that we could have lost that much population. What kind of what what ethnic group or what group could that have been? Well, I knowing the latino population in Washington Height, and you know this better than I do a group of people that were that was there and that had been losing people systematically throughout the years or humans. You know they had a very you know, but you have cubans above that, and you have you, have puerto ricans above that so who it's not a it's, not a helpful category, because it's my minecraft left just a second. Yes, a second steve. I think that is an aggregate of those of those other ones. The Mexican Cuban Puerto Rican. No, we have them separately. No, we have not separate those other Hispanics, latino or any other race will be your argentinians, your other, your peruvians right, your equatorians, and I'm glad you are asking the question the. If I remember my data correctly, the colombian and equatorial population had been going growing and declining. So that's one of the population that I that I remember as long with the cuban, but I did not remember- I have separated them, yes, equatorian and Colombians, and it would have started to interject, but it probably would have been very fascinating also because if that population decreased in Washington Heights, you probably are going to see an increase out in the auto borough, specifically in the Bronx and in Queens, where that population is actually stretched out from this neighborhood too. So it would not surprise me if you saw the demographics in the Bronx and Queens and you'd actually see an inverse effect there with this time period, seeing an increase in the population in those areas as well. Yeah, especially, I always thought that that, following the dominicans, the next largest hispanic or latino group would have been puerto ricans, and you know we we've lost a lot of the Cubans over the years, but I'm surprised that we could have that many Colombians or Ecuador. I mean what that suggests to me is we have a more diverse population than we acknowledge? Yes and when you have a category that lumps so many people together, I mean you know 44,000 people I mean that's more than you know, not hispanic whites. It would be great to take that 44,000 and break it down and those people are how do they self- identify and then, where did they go when they left Washington Heights but yeah? That's yet another study right yeah. We. If we have time I can, I can ask my people in the Dominican Studies Institute to disaggregate the other hispanic for you. It's it's very interesting in fun, sometimes to to look at those groups and and yeah, because they there they those groups, are there and there's a reason when the population decrease. I agree the other. I think slice that I wanted to show before I call on my people is to, and this is again to dissipate the understanding now that the narrative that dominicans are not here to just stay. If you look at this one, this have to do with naturalization, and the only thing that this graph tells you is that the longer they leave here, the higher the their propensity to become naturalized citizens of the Us. So here you have a group that is, that is very large. That is growing. Other has a presence for a long time here in that, at the same time, you know when the opportunity arrives, set roots, very strong roots in the in this in the country and the city as well as in the neighborhood. What I wanted to do is to show you what we think it's, the area that we would like to have designated as a dominican historical district. I'm going to stop sharing my my screen so that I can ask Matthew to come in Matthew, it's an it's on the line, and so that you have an idea of what it is that we are doing, and then you can guide us and advise us, and I tell you the rationale of for selecting specifically that I'm stopping sharing so Matthew. I will show you a lovely map that he has done in the designated area that we are proposing hello everyone good evening, hi Matthew hi, give me a second natalie. Do you have your hand up for this natalie? No, I you know, I think I raised it just when you were talking about the Caribbean Cultural Center programs, just to remind people that, since we can't attend tonight's, you can see them on Facebook live once they're, they put up the recorded version yeah and they have another one on the 13th, but I'm not mistaken right this summer we miss what they did in in Lincoln Center. I mean yes but yeah, unfortunately, but okay, so Matthew, do you need to share your screen? Yes, I'll need to be able to so paulo. Can you allow Matthew Santana to share his screen, you're all set perfect. Thank you all right. What I'll be showing here is the visualization of this proposed dominican, historic district you'll, see the black border denoting so to speak for parameters. We decided where exactly we cut offset border. All the icons on the inside represent various places. We're highlighting mind you there's still many more to be added. This is a work in progress, especially icons, but it's to give an idea of what exactly we're trying to go for here. Let me let me help you here: okay, so the geographic boundaries of the proposed historic district were adjusted to reflect the following, and that is the a dominican presence in this particular area that spans, of course, over 50 years, which is one of the requirements of this application to be eligible. But in their case, as we will show you in in a minute, it's definitely over 50 years over 100 years. So we wanted to encapsulate. You know that longevity, and also we wanted to create an area that you're you were going to find dominican symbols. Let's say a higher number of dominican symbols per square mile as compared to the other areas where they are. So what I'm saying is that the dominican people will be distributed along Washington Heights from 155 to all the way to 30 right, I'm from north to south, including Inwood, but per square mile. This is the area where you have more dominican symbols than in any other area, and so we decided arbitrarily then to create those butters that I'm sure you are surprised and that we have sliced Washington heights in this way. But it was following that rationale everywhere that you go in this blacks, which I think it's about. 40 blacks. I tell you the borders exactly the proposed Dominican historic district will a stretch extends from south to north from 155Th Street to diamond Street, basically 200 in this case and from east to West from the Harlem River, a dry parkway to Riverside drive it's stopping at 169Th, Street and crossing over Broadway. That's vita that what we are proposing. This was designed by Matthew. Who is a student? So do not you go and think that he's a whole architect. That's right he's a he's, still a student, so in what we are doing with this map, not only describing and writing and also documenting with photographs which want to show in a minute, but also creating this virtual interactive map for the future, so that, whenever we finish with this project, you will have if we are approved. Of course, it will be called by a dominican history industry, but if, hopefully, we will, with the help of you guys and and everybody else, if we, if we are not, this map will remain and people would go, be able to click and then find some of these items that we are describing. Mario, could you please show the cluster of buildings Ellis Island building among the things that we have put in here? It's a cluster of buildings that goes back to the 1900 in with dominicans residents that lived in those places. Some of these people, you know, are notable people. I do not know Jensen if we will be able to share the malagon sister that clip if you can prepare that in 30 seconds. As we continue to talk, some people dominicano, who live in Washington Heights will be at the level of the Madagan Sister right who appear in the Ed Sullivan Show in 1959., okay, I think a little bit earlier than that right, but some other will be merchants and some of them will be teachers and some other will be nurses, and some of them will be regular people in our case for the Ellis Island people, we simply just closed all of them together right and we show you now the the buildings of where they live. Can we can we do that in order for us to do that, we will need to start sharing right and then Jensen will have to show the photographs right yeah going to the map. I'm sorry, I did not wanted you to start sharing your map Matthew. Could you cheer them up matty, please! So in this corridor, oh you're, going to find schools, you got ta, find parks, you're going to find history. Businesses owned by dominican people or you're, going to find businesses that have dominican name you going to have places like the United Palace. Of course, it's not a dominican place. What we are signing signaling and the junior palace is when dominicans began, to have a presence in that place that it's. You know. It was very long time so you're going to have things of that nature. Things are very, there are dominicans owned by dominicans and things that are not owned by dominican, but own Bio, but the dominican people have a very close relationship with that historic place and, as you know, the United Palace. I think I do not know what the United the United Palace has become a landmark already. It is okay, yeah, that's another thing that we had done very tall in writing and you got it. I have to apologize for my memory and not as I used to when I was young. Now it's everything it's particularly with a computer. So all of these I come that you see represent different things, and perhaps you know you have a chance. Just look at the legend we have found political institutions establishing Washington Heights, and by that we mean it's, not the democratic party, it's not the Republican Party, but it's a it's an institution. It's a place that was created specifically to do politics where you will be interested on this. That was created specifically to do politics against you, and it's right here located in Washington. The institution is no longer there, but it was there and had that history in registering the mentality of the people, both here as well as in the in the Dominican Republic. So what I wanted to show module is there anything else that you like to pinpoint on this map the beauty of this map, this the platform? What we are using? It's a platform that was created by city college, so they will be very happy when they see that we are using something that the college created and then everything else inside it's it's our creation! Anything you wanted to pinpoint Matthew on this map that you're, very proud of, and something just to clarify at least one. The software we're using is actually arcgis, but ccny has a provisional business to be able to use it. Then we can take advantage of it. Okay, thank you for also could I could I ask: do you include in this a a there's, a parking garage on the south side of 174th street between I believe it's between saint nicholas and audubon avenues, and it was a meeting place in the early 80s, where the local dominican leaders would gather and where they, I think, first began talking about creating dominican organizations and getting involved in dominican politics. I think it was the place where alianza Dominicana was first con. You know well conceived of is that one of the simone we have Allianz, but definitely not that history that you are talking about, because I mean this is and I'm glad you know that who is a young historian, it's in it's in the call as well, not that history definitely allianza part of the history of Allianza Dominicana. You know, but not the particular details that you're giving us that the garage, for instance and 180 you know it was on 174Th street. It was 100. No, we do not have that it was owned by a man named well, I do not pepe Cuesta and his son, Eddie Questa is still active in the in the dominican community. To me that to me, that's a to me, that's a major point of historic interest for the dominican community. Definitely, and what occurred to me is to cheer Matthew is to share this map, with a request that I know him. I mean the head of Dominicans USA, a good friend of the Dominican Studies Institute, but I did not know that story yeah, please absolutely let him tell you about the significance of his father's garage. Oh my god! Oh god, because you see these are the stories that you know that that tell the other story of a place right, not necessarily what you find in books, but what people still holding so Matthew. We need to share this with Eddie questa at this moment Kevin. This is. This is really good. Anything muddy that you like to highlight each location. It's clickable, you get a small description and at least for most of them an image showing what the what's it called. What the place actually is, I mind you again still working progress. I've literally even to the point of just before this meeting still been editing a lot of the info about it. I'm pretty happy with what we got so far and we're still adding more locations by the day. Could you go back to the icon when you clicked on it, you had a picture of the United Palace, but you had yeah. Is it 165Th and Broadway? Can you look at it because, though the place might be right there right here? Yes, that's not the other one ballroom! No, but he had it a moment right, but it says audubon ballroom, someone, but if you scroll down yeah sorry about that, would you be able to share this with us? Can we have a chance to look it over? Definitely, we beg you for your input on. This is a work in progress and remember. The teen is composed by young researchers and people that are still students. So please we. We would like very much for your input on this thing. Anything else matthew that you like to share nothing else. On this moment. I think I've covered pretty much everything okay. So let me ask you another question, because Steve Simon, you know had you know, used to be the chief of staff for councilman michaels for more than 20 years representing this area, so he probably has lots of stories to tell but Maria Luna, who is you know a board member in the former board chair. He also has a lot of you know stories about the places that were important and have you spoken with her? No and it's a woman that we respect dearly. You know she's considered the dean of dominican politics in the on the Us, but it's a great idea, Maria Luna as well Waldemar. Thank you definitely because she would have stories that are not that you can not find in books all of the stuff that you have here. It's book stuff right, nothing, nothing like that! She is somebody who comes to the Dominican Studies Institute events. Frequently I mean when we were able to do so, but thank you for that. For that advice, Maria and Eneri yeah. Definitely Jensen. Would you like to we're going to show you a little bit of the no? I do not think we we're going to do that. We have identified, I think, over 1,700 structures within this parameters that we have delineated and all of the structures are being described in about two sentences: one and a half sentence or two sentences. Okay, so it's a very lengthy document, each particular structure, whether it is whether it's a garage, whether it is whether it's a park or whether it's a residential building or whether it's a business- and this is a following, of course, the documentation put out by city planning. So in addition to this, so it's also that other part of the application that requires the description of all of the buildings, all the structures. Let me take it back all the structures within the parameters. We are doing that as well. We are also creating photographs of all of the structures to accompany this map and if you can stop sharing Matthew, so that can help they can hopefully- and I just want to point out we're running a little tight on time. So any critical points that you want to make please make sure you get them in okay. Basically, the all the stuff that we are doing is documenting this we photographs and that might they can. Are you able to share that Jensen or not good evening? Can I get permission to share myself yeah? I think if you could let Jensen ortiz share his screen yeah one second, so it's a very large go ahead document, because it requires this level of detail on all the structures that are contained within the parameters, and so that's where we are at now Dr Nandis, which set of photographs. Would you like to showcase? I think the Ellis Island building would be fantastic if you had them, we have distinguished you know the when the buildings were constructed all of them and have also made that part of the application as well. This is, I do not know who lives in there, but I know we do not have time to share their story, but I tell you, but I think, as Steve said, if you're able to share this with us, we would love to take a look at it and review it in detail and get back to you with probably lots of questions, comments and suggestions. Okay, that this is well taken. We will give you stories, such as the you know: Maurice Pa Paniwowski, who came in 1911 from the Dominican Republic and then the person who in 565 west 162Nd. I do not think that that's the building and then you know his daughter, married somebody, and we have little stories like that of people who lived in the area Dominigano and then have other members of their family, so showcasing the root of a in the history of people in the neighborhood and claiming that neighborhood as part of who we are in part of the contribution of the dominican people in the U.S and, of course, New York, New, York, City and just to get to the logistics of it. So is this something you have to file with with shibo I mean who takes care of a non-, contiguous, historic district. I, and in terms of the process, we are very, we are very young. We have it. We have done lots of research in terms of the national register who's there. What you need to do and for we were surprised that what we wanted to do, which is declare a place based upon history and and cultural legacy, that we do not have many of those in the country as a whole, but there are a few. Oh yes, there are a few and I think we list them in our application, but very few, because even in the case or african- american neighborhoods that we have found, you know when you go there's a set of properties yeah. They are identifying with African- Americans right, and this is not the case. We are not claiming property in right in itself, so it makes it a little bit difficult for us at least because we're not expert on this, but the. I believe that what we needed to do have to there's an office that we need to submit the application and we are getting in contact with them as well right, it's. You know when we first discussed this concept of a non-, contiguous, historic district. You know we were all curious on how that worked, and there were a few examples. I do not think any of them were here in New York state, but they do exist, but it strikes me that you know there's a there's, a path to a destination, but along that path there are a number of things that you can do with the information, and I see if you develop this into some kind of a you know, presentation, teaching tool. I could see our youth and education committee being very interested in it and having it shared in schools. I could see you know, parks and cultural affairs being interested in as an exhibit that you know is looking at it from the cultural Affairs perspective. So there are a number of things you know you can do with this. We have the uptown art stroll every year and, if maybe you know, you know at city college, one of the theaters or a gallery had this on a large screen or had a series of discussions about this. So there's a number of things you could do with the information along the way to getting designation. Okay, yes, it would be. I mean for us, the more people learn about the history of of dominicans in this place and the better and the at least the possibility of people forgetting- and you know the goal here- is that we do not rely only on ourselves to remember who we are, but also relied on, others to remind us of that history as well. So the more possibilities of sharing this, whether it's the school system with this festivals, that we have in the community, whether it's the white, the internet, because we have a project that is called dominican landmarks and this register. Things of this nature are worldwide and we have to tell you that it's a very popular project. People do click on these things and they they learn that there is a a park named after the dominican person in Belgium or in Germany. So people like to see pictures and people like to see small history as compared to you know lengthy books. I think that you know your suggestion. It's not! Yes, it's it's going to help us and it's going to benefit the project at the end. At the end of the day, which is you know, preserving this legacy and sharing this legacy, I think this has been wonderful and I would say that you should plan to come back to us in a few months with an update we'd, be you know very interested in that lori. I want to thank you once again for making the introduction. Thank you thank you for those tips. We will follow up on great. Thank you. Thank you. So with that I'd like to move to the next item on our agenda now that it's 8:55, but we're not going to rush it per se for land use and the capital and expense budget. I circulated two things I circulated to the committee. So, within the last few days, the expense and capital items that we proposed last year that each of which were ranked within the top five by the board for both capital and expense. So that's great- I mean land use typically has very few items you have, you know usually one of each and last year it was a carryover. We modified some of the language, because you know the city got back to us and they were not clear what we were asking or you know they thought it was partially done. So we clarified it and resubmitted it, and I think those two items are still relevant and we probably want to you know, submit them again as sort of not continuing support, because it's not clear that they've received support, but you know submit them as items for consideration once again. The expense item that we had called for the dedicated additional planning staff to work with CB12 and local residents to formulate and implement a neighborhood- based, contextual plan. I would change that a bit, particularly given some of the things we're talking about. I would add that we want them to work with us to update the 2007, neighborhood planning and land use study that we undertook with city college by the way. In addition to then update that, and have that be the basis for formula formulating and implementing you know a plan because, as we've learned from the discussion of 857 and other things, there are things that we've talked about things that were in the plan that are still relevant today, that city planning or landmarks have not acted on, and so it makes sense to take a planning study. That's now more than a decade old and to refresh it and for us to be able to do that with the assistance of some. You know, professional planning staff. So I think that's an item that we want to massage a bit but keep and then the capital item. We were asking for the city to allocate capital funds to support a planning and development initiative in washingtonwood, whereby any vacant city- owned, lots or buildings were packaged in an RFP and then put out, for you know, requests for development to do scattered, site internal, affordable housing. We had that before and they said well, it was not a capital request, so we added specifically well. Obviously we want you to allocate capital grants to it in order to facilitate that, I would say that you know that is still a relevant item from the land use and planning perspective. I do not think they've done anything to identify. You know. Vacant city-, owned land and buildings that are sitting follow, and I think we've been talking about this for years. Since Scott Stringer was born that you know the city can map the land and in fact he did then they need to do something with it to address the affordable housing crisis. I would say that capital item we also want to keep. I would any input from you know the board members on those two and there is there any other expense or capital items from the land use perspective that we should propose. I can just say I think the capital item is pretty wordy. I do not. I do not think we need to include this clause. You have after city- owned lots and buildings, or lots and buildings purchased or otherwise acquired by the city. Well, I think someone needs name Steve, Simon added that last year. No, I would not. It makes no sense, so I would just. I was just delete that language between the two commas, but I mean in terms of so conceptually we're saying these two we want to keep. We might want to massage the text, which is why I sent it to everyone to review, and we still have time to do that because I do not think our meeting is not until another couple weeks from now, so we can clean it up, but please get any comments well in advance of that it is there anything else. You know Vivian Chris, Omar Rosie. You know Jim items that we should add or which do we say that we want to keep these two clean them up a bit and propose them. I can't hear you because you're all muted, I think these are okay yeah. I would move that we adopt these two as our committee's budget requests. I'm sorry two seconds I agree. I did all committee members in favor raise your hand, so I could see them. I can't see Chris, I can't see Omar yeah, I'm raising it with the blue virtual hand, so we've got one two three, four five, six seven, so we're unanimous there's no pose no abstaining. Okay, thank you and I would see that you know. Members of the public who wish to vote can also vote, but I would also say that other board members present. If you would like to vote on it, you can as well. So I will start with other board members if you care to vote on the adoption of these two for land use. Let me know- and I think we had at least one other board member. Although she may be gone now so then I will look at. I saw for participants attendees okay, so this is a little difficult. So I'll just go with the committee vote that we have. Is there any old business? Is there any new business? I know we had lori, Tobias and Marielle. Is there anything that you wanted to either you want to share with the committee? While we have you, I was just listening here today. Sorry, I was just like listening to what you all were saying and listening to the presentations that was okay, I just since you were here. I said I appreciate that because not everyone does that, and sometimes we have something to say and then people stop the call. So thank you, you're welcome and laurie. Yes hi. I just want to say that it was an inspired thought on the part of congressman espaiot to begin this intensive work with the Dominican Studies Institute. In order to frankly hand over and the project in its detail, the granularities, you can see it's evolving and they will benefit from more help from the committee and from the whole Community board, and the idea is really ultimately to brand this part of the heights, as you know, as little dominican as the little Dominican Republic of New York and that's you know the end game. A Dr, Hernandez and her team have been put in touch directly through me with SHPO and they will be following up with the application. Things are complicated because of Covid-19 in terms of the ship of staff walking the district, but with time. Hopefully, all of this will fall into place. Okay, I mean Rosie and Omar. I see you have your hands raised. Is it for this? If we're voting? Oh, I was raising my hand for voting okay, so you can lower it any anything else under new business. If not I'll, accept a motion to adjourn it's 905. motion to Adjourn seconded third. Thank you all take care bye. Thank you. Bye, all bye, good night, you.",
            "summary": "Know: iron pace pyramids with the fountains going, and that was that was the first and only time I've been to Paris The story with this particular chateau, which spans the river one side of the river was in Nazi occupied France and the other part, want to either get invited to dinner or to parties and kind of basically sneak out the back.\nYou know: I learned after the last lens meeting that the Fort Washington Branch of the New York public library, was added to the national register of historic places.\nYou know, quite supportive of historic, designation A bit we're going to have an update on the discussion of the 857 Riverside project that we discussed.\nSo first I'd like to you know, welcome or maybe welcome back because I think HTC has been with us before on a few occasions, simeon Vancouver from the historic Districts Council to speak with us about the Fort Washington Branch New, York public library register, with the listing with the register of historic, places.\nBut one of the only good things about this ridiculous sort of situation we find ourselves in is that this way, I can actually come to community board meetings and then commute downstairs to my kitchens to make dinner rather than having to get out of a train or something like that at 11 o'clock at night.\nWe are a not- for, profit, independent organization that works with over 500 neighborhood- based groups throughout New York City, to enhance, protect and celebrate the physical characters of their historic areas and buildings.\nWe, have worked in your community a bit with vivian and with Wayne as part of the Audubon terrace Historic district expansion, efforts and celebration of that, and also Inwood, of course, was actually our first one of our first classes of the six to celebrate.\nA, later class of that was actually picking up an internally generated program of the historic Districts Council, which was the celebration of the Carnegie libraries of New York.\nDefinitely the last in Manhattan The way the Carnegie system, the Carnegie grants worked, was the city had to put up the money for acquisition of the land, and then the Carnegie foundation would pay for the actual building of the building.\nVery beautiful science person knows every religious property in the five boroughs and beyond Did. We thank him for doing the work to get this on the national register?\nI just want you and everyone else to know that both the land, Use Committee and the board as a whole has been very supportive of historic designation and have actually passed a couple of resolutions to that.\nUnless they, you know just say, National, Reserve, historic places and like a little seal.\nAsk Tim Anderson who, as you know, from the September meeting, is the planning Rep with the borrower President's office, who works with CB12?\nI. Think Wayne, as you know, with the questions that you sent to us central to what happens with 857, really depends on this wide street designation, and it has been a little difficult to get a response out of DOB and DCP to an extent of what exactly the dimensions of the street are, because I you know, as we've discussed and with the photos that you shared with me earlier, this week, you know there's.\nThis week, still waiting for her to get back to me on the sliver law question because I, you know obviously like it's a matter of the wide street, and I think we have a meeting that we're trying to you know get in the works to try and figure out what the borough president's office role would be in the discussion on the city, map.\nWhat DLB is saying in its you know, determination of the street, with it's counting, basically from you, know, street wall to street wall, so The lower drive, which is actually a two- way street that was actually built before the upper drive based on Matthew Spacey's research, then there's the upper drive, but between the two is, you know, part of a city park, and last month someone pointed out.\nIt's not the same as saying you're going to take the park, land and Say. It's part of the street and measure that so I do not know Tim or Steve.\nIt took that securities route on what we call the lower drive that upper portion- So, the book, the neighborhood, that Manhattan forgot or New York City forgot, and we did for historic, Districts Council a sort of a video discussion that I moderated for him So he's done a lot of research on the area going back to when this was John, Audubon's state and before- He pointed out to me after the September meeting based on his research.\nYou've got the top of the retaining wall, which people use basically, as a bench, But, then you're looking into maybe the second or third floor windows of the buildings acrosss the street.\nAl has been squatting there since he sold the house at the end of last year, but he's been told that by October 15th, that's eight days from now he has to be out We are working right now with Wendy olivo from Al Taylor's office and an attorney to try to make sure that nothing illegal happens because evictions are stopped.\nLast month's meeting about you, know, iniquities, inequities and ignoring history of the african- american population in New, York It was built as the we're trying to find out exactly whether it was the home or an additional house built by the fellow who built the refinery, so we're digging a little deeper, but it was certainly owned by him.\nDevelopment, history of people seizing on famous names to boost the values of what they're, building on smack and selling Actually in his book, and we might want to ask Matthew had or has a map of You know the houses that were you know, built on the Ottawa, state, and I believe this area was literally like acrosss the street from yeah, The people who live there refer to it as Audubon park as well.\nSometime last year we started speaking with Laurie from Council congressman rather about two initiatives in Inwood, one of which was a Inwood apartment house district Going back to when I first joined the the community board, as well as a non- Contiguous, historic district, that is, you know, related to sort of the history and culture of the dominican immigrants in the area, and we were, I see, Laura Tobias has joined us.\nWe are looking for better ways to improve what we are doing and what we are doing is to try to create a historic memory of the dominican people in a place where they have recited persistently and consistently for over a hundred years.\nIt's sort of like show to you, the significance of the dominican people in the U.S, and You know, sort of like a graphic image of the dominican people in the United States, and we go from 1613, which is the first recorded immigrant actually in in New York City, and what is today Manhattan and New York City, and this is Juan Rodriguez and of course you know the story about him and from there from one dominican that we know we go to Ellis Island and the reason why we stopped in Arizona It's, because this is a a part away of a national history.\nIt happens that a little over five dominicans also came to Wellies Island, and this is one of the things that we are documenting in the United St in the Dominican Studies Institute, some of those people who came to Ellis Island, some of those dominicans I'm going to leave in Washington Heights, and we will show you that and of course, the big picture, the one that you know- We are now a little over two point million dominicans, because this data goes to 2018.\nI want to remind you that the this provides say, I think, a little a picture or more clear picture of that growth of the dominican people.\nIf you look at this table, what you're going to see is that a little over 50 percent of the dominican people in general in general have been living here since 1990 right since 1990 over 20 years.\nYou know lots of children right, and this is one of the reasons why the population is growing, and this graph show you the dominican people in terms of those who are immigrants and those who are now born in the United states.\nNew York of Course, is the is the place where the majority of the dominican people reside in the second and largest place will be New. Jersey then followed by Florida, and then you have the other Arizona.\nWhen you think of New York, the majority of the people will be concentrated in New York City, and by that I mean 90, of the dominican people who lived in New York.\nYou know that we do this, for, for everybody who need numbers from the dominican people, so Staten Island is the is.\nAs you know, very well, is divided by neighborhoods the a place where the dominican people have been living for a long time in large number, it's Washington Heights, and here you have some of the numbers.\nYes, and when you have a category that lumps so many people, together, I mean you know, 44,000 people It would be great to take that 44,000 and break it down, and those people are how do they self- identify and Where did they go when they left Washington Heights We have time I, can, I can ask my people in the Dominican Studies Institute to disaggregate the other hispanic for you.\nWhat I wanted to do, is to show you what we think it's, the area that we would like to have designated as a dominican historical district.\nYou, know that longevity, and also we wanted to create an area that you're you were going to find dominican, symbols.\nMaurice Pa Paniwowski, who came in 1911 from the Dominican Republic and then the person who in 565 west 162Nd. Then you know his daughter, married somebody, and we have little stories like that of people who lived in the area Dominigano and then have other members of their family.\nSo, with that I'd like to move to the next item on our agenda now that it's 8:55, but we're not going to rush it per se for land use and the capital and expense budget.\nI would add that we want them to work with us to update the 2007, neighborhood planning and land use study that we undertook with city college by the way."
        }
    }
}