{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCB4 \\u0026 Housing Conservation Coordinators Tenant Rights Education Event - September 2020",
            "publishDate": "2020-09-17",
            "shortDescription": "Presentations can be found at the link below:\\n\\nhttps://www.dropbox.com/home/Jesse%20Bodine/Full%20Board/Upcoming%20Full%20Board%20and%20Committee%20Agendas%20and%20Materials\\n\\nHCC is currently conducting ALL SERVICES BY PHONE\\ndue to the current public health emergency.\\nWE remain OPEN to serve our community by phone\\nPlease call\\n212-541-5996\\nMon thru Fri 9:30 am to 5:30 pm.\\n\\nHCC actualmente realiza TODOS LOS\\nSERVICIOS POR TELÉFONO\\ndebido a la actual emergencia de salud\\npública.\\nNos mantenemos abiertos para servir a\\nnuestra comunidad por teléfono\\nPor favor llama\\n212-541-5996\\nDe lunes a viernes de 9:30 a.m. a 5:30 p.m."
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 44,
            "um": 192
        },
        "wordCountFullTranscript": {
            "rent": 59,
            "court": 50,
            "landlord": 48,
            "apartment": 26,
            "number": 23,
            "housing": 22,
            "case": 22,
            "attorney": 21,
            "question": 21,
            "cases": 21
        },
        "wordCountSummary": {
            "cases": 6,
            "court": 6,
            "tenants": 5,
            "attorney": 5,
            "people": 5,
            "rent": 5,
            "tenant": 4,
            "reasons": 4,
            "landlord": 4,
            "bit": 3
        },
        "fullTranscript": "So good evening, everyone thank you for coming to tonight's forum, which is co-sponsored by Manhattan kimmy board four and housing conservation coordinators. This is actually the the second form we've held together on tenants rights during Covid-19, and so I'm jesse bodine. I'm the district manager of community board for tonight's forum will be moderated by lynn horowitz, who is the senior supervising attorney for hcc and I'll. Let her introduce the other hcc staff who will be speaking shortly. We are also joined by corliss evans from the new york city department of finance. We'll provide a short presentation about the city's rent freeze program after hcc's presentation, as requested we'll have asl interpreters present, and I want to thank both of them for their service tonight. How tonight is going to run is the following, so hcc will present for about an hour followed by the department of finance. We will then begin the question and answer portion of the event hope, hopefully around 7 10 tonight the public will be able to submit their questions in advance using the q a tab at the bottom of their screens. I would ask that everyone try to limit themselves to one question per person at this point. If you're calling into the phone and cannot use the q a function, you can raise your hand virtually by, like I'm sorry, so you can either after the q a function. You can also raise your hand virtually by clicking on the participant section and then pressing the hand raise function if you're, calling in by phone, you can do so by just pressing star nine and then we'll be going through the q. A quench questions first and then going to the raised hand and raised hand, function questions next due to time due to time limits and some and privacy issues we're asking specific questions about individual cases or circumstances should be referred to hcc for more for intake and now I'll hand it off to lynn to introduce hcc's staff and begin their presentation thanks jessie, thanks to you and Manhattan community board 4 for co-sponsoring this event with us and helping to get the word out. I am very excited I will enjoy and elise levy who is a tenant or you're marie logan bit about tenants doing the pandemic and a little bit about non-payment cases and then you'll hear from the sleevey antenna, organizing. So without further ado, I'm going to turn it over to maria and logan hi. Everyone, I'm just going to take a moment to share screen, because I have a powerpoint prepared presenter mode: okay, hi everyone. My name is maria moore, I'm an attorney at hcc, lakeland set and tonight logan, and I will be presenting on Covid-19 updates to housing court and also about non-payment proceedings which we anticipate will be coming up for more folks in the future. Okay. So the first thing we thought we'd start with is the eviction moratorium. So the first question some folks might have- but many of you might already know- is what is an eviction moratorium? So an eviction moratorium means that a marshal cannot execute a warrant of eviction, which is what a document they use. That says it's legal for them to evict you until the moratorium is lifted. So there have been a few versions of the moratorium so far in the pandemic, and currently the one that applies to new york state is one issued by judge marks, which extends the eviction moratorium until October 1st 2020., there's also been a CDC moratorium issued and logan will talk more about it later, but only applies to some evictions and it's until december 31st 2020 there's conflicting views on whether or not it applies to new york state. Since new york, state does have an eviction moratorium in place, and so we'll talk a little bit about what happens after October 1st in terms of new cases, old cases and everything in between during this presentation. Okay, so some updates in terms of our housing court calendar is that new cases can now be filed, but they're currently not being heard. The court has chosen to dispense with the cases that are already on the calendar first, so new cases that are being filed are putting being put off for the moment, logan's going to talk more about what might happen if you receive a notice for non-payment and what an eviction proceeding for non-payment will look like the exception to new cases being heard, are emergency cases and, as I said, pre-covet cases so any case that was commenced, pre-coped and had court dates. Pre-Pandemic can be put on the calendar to be heard cases where you have an attorney where there are attorneys on both the landlord and tenant side are already being heard and are being calendered on virtual skype appearances. It has not been decided when or how pro se litigants, meaning litigants without attorneys how those cases will be heard moving forward, but those are probably next on the chief judge's list in terms of precovered cases moving forward. Okay, so what type of cases count as emergency cases? So what type of new cases can you file that are counted as an emergency and will be heard right away? So the first type of that case is called an illegal lockout. An illegal lockout is when you are removed from your home without a marshal, so the ground rule here is that only a marshal can remove you or your belongings from your home. So your landlord can't make you leave your roommate, can't make you leave. They can't make you leave because you're you have coded or because you're, sick or because you're tested positive. None of that is legal. If they ask you to leave, you should be sure that you don't have to until you've had your day in court or until you've received a marshall's notice, which we'll talk about in a minute and if you are having, if you are experiencing seeing issues where you've been locked out of your home, and you can't get back in without a marshall's notice without a court process, you should call housing, court answers or 311 for assistance numbers on the screen and numbers to call for assistance and for attorneys will be put on the screen several times throughout this presentation. Okay, so this is what a marshall's notice looks like. This is the document that the marshal would have to serve you with meaning put on your door and mail to you in order to evict you, and so the important things to look at is the date the marshal's notice was issued and the date of the earliest eviction. So the date of the notice is on the bottom left-hand corner and the date of the earliest eviction is on the top right corner, and this tells you when, basically, how much time you have before you before a marshal will come to your door and remove you from the premises. But the important thing here is that number one you should not be receiving any of these until October, 1st and number two. If you do get one of these, you should contact one of the numbers that we will be presenting throughout, to ask for an attorney and for legal assistance prior to the date on the right hand, side of the paper, so the second type of emergency that you'll be able to move forward in court at the moment is an emergency order to show cause for repairs. What are considered emergency repairs? No heat now that we're coming into the colder months. This might be an issue for some folks, no hot water, large leaks, no gas and threatening harassment. This is not an exhaustive list. There are other repairs that could be qualified as emergencies and that a judge might move forward in a new case, but this is basically the one that we know a judge will accept as a new case and move forward right away because they are standard emergencies. If in doubt you should you should call housing, court answers or 311, and someone can walk you through whether or not your case is an emergency and how to file an hp action, which is the action you need to file in court, to ask your to ask the judge to order your landlord to make repairs okay. So a few common Covid-19 19 related questions that we've seen are on the screen, I'm going to address them one by one and try to give some general advice on how to deal with them. Please understand that. There's actually no one right answer to any of these questions and it's heavily dependent on your current situation. So the first question that we've been asked a lot is: can I break my lease so, as I said, the answer to this question is: it depends right, and that being said, I think that many people have decided to move because they can no longer afford the apartment due to job loss or they have moved to care for sick relatives or they themselves need to be need to move out of new york city for safety reasons or just for other health reasons. And so the first thing you should know is that there are ways in which you can protect yourself if you do break your lease from further from further legal action. So the first is that you should be in communication with your landlord and explain what's going on and why you need to break your lease. Tenants have a duty to mitigate and so do landlords. So a duty to mitigate means that you are actively trying to mitigate any damages that could be caused by breaking your lease. So when you break your lease, the damages are usually the amount of money owed for the rest of the lease and so to mitigate that damage. You could advertise the apartment and ask for the ability to sublease your apartment for the rest of the lease so that your landlord doesn't lose out on money, and so, if you can show that you've done that and that you tried your best to get the apartment rented for the remainder of your lease. It's likely that a court that, if the landlord brings you to court later for the money owed on the lease that you will be responsible for less of the lease, if not you won't be responsible for any of it. So it just depends. It also depends on the reason why you're breaking the lease so a balancing of those two things. What we look like will be looked at by a judge in court to decide whether or not it was okay to break your lease and how much you might owe your landlord. Similarly, if you are brought to court for damages on breaking a lease, you should know that a landlord also has a duty to mitigate this means. They can't sit on their hands and not try to rent the apartment for the rest of your lease and say you owe them the rest of the money. They also have to make sure that they're putting the apartment up for rent and advertising and doing due diligence to get the apartment rented to mitigate their own damages. The next question is, I left the city. Can I be evicted for non-primary residents, so this question particularly applies to rent control and rent stabilized apartments, so, as some of you may or may not know, in order to maintain tenancy and a rent, control or rent stabilized apartment, you have to use the apartment as your primary residence, which roughly means that you reside in the apartment half of the year plus a day roughly, it's not a hard and fast rule. Many people, as I've talked about, have moved out of new york city some permanently, but others temporarily and they'd like to move back to the city. When things are out when things calm down or the crisis, is over, but they're worried about being brought to court and the laird alleging that they do not primarily reside in their apartment, so again, there's no right answer to this. I can't promise you that, if you've moved away for health reasons or to care for sick relative or for any other of the valid reasons that someone might move away from new york city at the moment that the landlord won't be able to prevail in a non-primary residence holdover case, which is the eviction case. However, I do think that the more compelling your reasons are for needing to not resign your apartment for a long period of time, the better off your chances of defending your case. So what are these reasons? Generally speaking, reasons of not living your apartment to care for an elderly relative for sick relative are excuses for not having residing in your apartment for the required period of time. In addition, if you yourself needed to leave new york for health reasons, that also could be considered an exempt period of time. So again it depends. And again it's a balancing act but be sure that anything you are going to do moving forward. You keep good records of. So if someone was sick, keep hospital records. Keep doctor records, make sure you're keeping any documents that can explain why you had to move away from your permanent residence for that time. Okay and then the last question which we'll address further in the non-payment part, is what, if I can't pay my rent. So if you can't pay your rent, it's likely that once your landlord decides that it's appropriate to start a non-payment, proceeding against you that they will logan is going to talk a little bit more about all this and she's going to talk about the protections that tenants have been afforded by new york state through the safe harbor act, so pay close attention in those parts of the slides and now I'm going to pass it along to logan hi. So I my name is logan moore, I'm also a staff attorney with hcc, and I'm going to talk to you about non-payment cases, because generally, these are probably the ones that are going to come up most frequently during this Covid-19 pandemic. So what is a non-payment case? It's pretty self-explanatory. It's a case that a landlord is going to bring against a tenant for non-payment of rent and what this means is. The landlord is bringing you to court to ask the court to order you to pay the money that they are saying is owed, and if they, if you don't pay and the court determines that you should have paid, then the landlord may be able to evict you, but because you're in court you can dispute the claim that you owe money or there are other defenses that are available to you and you'll have the opportunity to present evidence. So how does a building owner or landlord start a non-payment case? First, the landlord has to demand the rent from the tenant, and normally this looks like a paper form that you'll get and they'll say that you owe this much money, but it is important to know that they can make a verbal demand for the rent as well after they do that and after that time period that they give you expires, which is usually about 14 days. Then your landlord can file the case in court and to do that. They'll file, the notice of petition and the petition to start the case and those papers once they file them with the court have to be served on you, because you have to know that the court case is going on, and so what those papers will look like. They'll, look like very official court papers, they'll, say notice of petition and petition, and now that we are in this Covid-19 19 world, it's likely that they will have been e-filed. So you'll get a notice. That says they were e-filed and you should also get a notice that says that you are able to contact an attorney if you would like an attorney, and it should provide this number, which is on the slide so that you can contact an attorney if you do receive these papers once the court has processed the notice of petition and petition, you should get a postcard, letting you know also that the court was filed and that the case was filed. I'm not entirely sure if they're still doing this during the Covid-19 times, though, but you might also get a postcard so typically, once you get the notice of petition and petition, you have 10 days to answer in housing court and what that means. Is you have 10 days to file your answer, however, because of Covid-19, this timeline is extended and you can ask for more time due to covit. So what this means, though, is that you need to essentially respond to the petition with the court and used to have to go down to the courthouse to do this, but in order to not overcrowd the courts, you can do this over the phone now, and so you will call the number that's listed on this slide and you will. The clerk will speak, walk you through an answer, and this is when you will provide all of the defenses and counter claims that you think apply to your case. It's really important to pay close attention. While you do this and you can ask as many questions as you want, you can explain your situation and try to see which defenses you think best apply to your case. So a defense is a reason why you either do not owe the money or you did not pay some or all of the rent. I also should note that if you get, if you contact an attorney, an attorney can also help you with the answer, and so, if you do that, you can consult with an attorney to see what defenses are available to you. So some typical defenses that are available first is bad service. The notice of petition and petition need to be served on you properly according to very strict rules, and so what you should do is you need to take note of how you received the notice of petition and the petition when you received them. Did you get them in the mail? Did someone personally hand them to you or you know, did you find them stuck in a bush somewhere or something like that? You need to take notes of how you did receive the papers. A second offense is error in the papers. If you get it and you think you should be named, but you're not named or if the landlord listed is not your landlord, those kinds of things, if that seems weird to you, that can also be a defense. A third defense, that's available is that the owner refuses to take your money. This is when you have tried to pay, but for whatever reason they are not accepting your money or they have returned your money after they accepted it. That is that's a defense you can assert. Another defense is that you need repairs done. This is called warranty of habitability, and this is, if you have repairs and you've requested repairs, and despite this, they still the landlord is not completing the repairs. You can assert this as a defense. Another one is the owner. Owes you money, it's possible that you've paid and they haven't properly credited payments to your account, so make sure that you do keep track of how you pay, if you pay by money, order or online, keep copies of the money orders or keep screenshots of how you pay online and there's another defense that you are dependent on someone in the military. If you are, then that's a defense that you should assert so this new, this defense was created by the new york state legislature. It is the new york, I'm sorry, it's the tenant, safe harbor act, and this was created to attempt to help tenants who were financially impacted by Covid-19. What this does is under this defense. The landlord cannot evict you for money owed during the pandemic and the pandemic is defined as a date. That's in the beginning of March and it's still ongoing and what you have to in order for this to apply to you have to have had a change in financial circumstances and not be able to pay rent because of those circumstances. Technically, this money is still owed to the landlord. It's just. You can't be evicted for that amount of money. So if you get brought to housing court and there's they say that you owe you know, you owe money because of the pandemic. The judge can say that you still owe that money and it'll be what's called a money judgment, but they can't actually evict you for it, and so a counter claim is a claim that the tenant gets to bring against the landlord. When a landlord brings you to court, they open themselves also up to claims, and so this is one that you can assert against them. So common counter claims one is that your landlord has refused to do to do the repairs. This can be both a defense and a counter claim. Another to counter claim is that the landlord is harassing you. Harassment is a very big umbrella. That includes a lot of things, but if you feel like your landlord is harassing, you can assert this as a counter claim, and then this one is kind of broad, because it also can include a lot of things, but if your landlord is doing something, that's in violation of the rent, stabilization or rent control laws, that can also be a counter cloud proceeding. The court is currently working through its pre-covet calendar. So if you had a court proceeding that was started before the pandemic, then it's probably- and you have an attorney- it's probably being dealt with right now, so new cases can be brought, but they aren't going to be heard for a pretty long time. We don't know when, but the court right now is trying to clear the backlog of their pre-pandemic cases. So another thing that is important to consider with non-payments when you look at the rent demand or the ledger that you're given is whether or not the landlord can charge late fees under the executive order. 202.28, the landlord is not entitled to late fees for the period of March 20th to august 20th and as far as I know it, the that period has not been extended and it's a very definite period. So if you were charged late fees during any of that time, the landlord's not entitled to that. But a caveat that I would like to make is that you can't ever be evicted for late fees. You can owe it, but they can only evict you for missed rent. So this is good they're not entitled to those the fees, but generally you can't be evicted for them. Anyways and another issue for people who are facing financial hardships because of Covid-19 is: can you use your security deposit to pay rent that you owe under the same executive order? If you have a written agreement between the landlord and tenant, the security deposit can be used to pay rent owed if the tenant is facing financial hardship as a result of Covid-19 19.. So if you want to do this, you need to let the landlord know in writing that you intend to do this. However, it should be noted that it has to be the security deposit that you use to cover the rent needs to be replenished within 90 days. So if you're going to do this, you need to make sure that you're going to have the ability to replenish it within those three months and I'm sorry logan. Do you mind if I just cut in yeah one second, just about the security deposit? You have to begin replenishing it within three months and then you have to replenish it at 1 12. of the amount of the security deposit per month. So you have to replenish it within the 90 days, but you can take a year to move it. I believe perfect. Thank you, okay, so then the CDC eviction moratorium is something that was issued a little while ago and it is based on the language that's not currently applicable in new york, because right now we have a stronger eviction moratorium, which is just a full-on eviction moratorium that goes through October 1st. But if aft as of October 1st new york state no longer has an eviction moratorium, then the CDC moratorium can come in place, and that is a moratorium through december 31st 2020. However, it is not a blanket moratorium, like the one that is currently in place, it's very specific about the kinds of cases that it covers, and it comes with a lot of other little caveats and everything. So what it is it's for. People who are facing financial hardship because of the pandemic, and that is something that you're going to have to show and it doesn't cancel your arrears that are owed. It does something kind of similar to the safe harbor act, where it just means that you can't be evicted for that between the time of up until december 31st after december 31st you can, and during that time, even though you can't be evicted for those arrears fees and late charges will accrue still and then the biggest thing is that in order to assert it, you have to sign a declaration that the CDC provides on their website, and you have to agree to all of the paragraphs that they lay out and the paragraphs lay out very specific facts, and it is our advice that no one signs that declaration or asserts this defense without consulting an attorney before, because it has a lot of information in there. That could have very significant impacts in your eviction. Proceeding later on, that may be very detrimental, so you should consult with an attorney before you sign that declaration and attempt to assert that defense, and so we covered this a little bit before. But if you do get a proceeding or your, how you anticipate to get a non-payment proceeding, how do you get legal assistance? So you can call 311- or this other number, which is the number for the office of tenant protection at the mayor's office, and they will direct you to a provider in your area or a provider that can help you with your case. If you're in the hcc intake catchment zone, you can contact our office and we have slides that have our contact information or if you call the clerk's office, to file an answer or other in any other way interact with the court. You can request a referral for a foreign attorney from the court and the court can directly refer you to a legal service provider and so here's our information. We have community intake for our catchment zone, which is between 34th and 100th anything west of fifth avenue. We have an older adult program that is the same area but are at least 62 years old, and they we have an expanded program for them, with public benefits, medicaid medicare and some other directives, and you should call our number for an appointment. We also have two legal clinics. We have monday night legal clinics which is open to all new york city residents, regardless of borough or income and an immigration clinic which is also open to all new york city residents. With some income eligibility requirements. Oh and housing court answers you can also contact. Housing court answers their great service. That has a lot of answers about housing court and they can either help you with what you need or direct you to a service provider that can help you with representation. Thank you so much maria and logan. I am going to turn it over to elise to hear about organizing hey, y'all, I'm elise and I'm a tenant organizer with hcc. As has been said, I'm just going to take one second to pull up this powerpoint and we did it cool. So I'm just gonna talk a little bit about tenant organizing during Covid-19 how to do it. Why to do it, as was kind of mentioned earlier. You know this question of what to do. If you can't pay your rent well, there's that the legal option and then there's also building power together to get our rent cancelled. So I'm going to talk about how we can get to that so for some context, which I'm sure we all know so the Covid-19 19 pandemic is still impacting tenants throughout the state. We have up to 1.6 million tenants in new york who currently can't pay rent, and this is disproportionately impacting black and latinx tenants, who are already more likely to be rent burdened, and it's also, you know a moment in which people are looking to join together. You know the amount of the amount of organizing that's come out of this. Is you know the one thing that we can take from this crisis really positively? Is that like we can join together and make things change for the better for attendance in new york, so the basics tenant? Organizing, is the act of bringing people together to build power with their neighbors to win rights and protections and to protect their neighborhoods and a little bit about like what we won and what tenant organizing can do. So in 1904, immigrant jewish women in the lower east side, launched the first rent strike in new york history. The whole neighborhood went on strike. Rent reductions were won for the majority of tenants and some even won leases, which was a new thing at the time, and this and many strikes to follow gave us the rights we have today as tenants, including the legal right to organize and then more recently, we won the historical legislation, the housing, stabilization and tenant protection act which strengthened legal protections for tenants and overturned loopholes in the rent laws that tenants had been fighting against for decades. So those are kind of the big picture things that tenant organizing has done, and then there's also the things that you know. Building organizing can do you know, maybe it's not changing all the laws but banding together, you can get your heat turned back on, or you know, get repairs done that haven't been done throughout the building for years, and so that kind of pressure is really important and it's important now, because people are struggling- and this is an opportunity for us to mobilize and to get involved in the tenant movement so currently on a city and statewide level, we're fighting for the cancellation of rent mortgage and utility payments, rent, freeze and rights to renew a lease and to reclaim our homes and invest in homes, for also you know, housing, the homeless and folks who are housing insecure. So what are the steps for doing this like? Let's you know, take it small scale and talk about building a tenant association, so the first step is going to be doing your research. So before you begin organizing, it's helpful to figure out what's actually happening in your building. So, for example, a lot of people's apartments have been illegally destabilized or something's up with their rent history. So we have here a tool for how to check if your rent history, how to check for your rent history and then see, if you're being overcharged. So you can do that through the hcr website or by calling hcr at seven one, eight, seven, three, nine six, four zero and then there's also researching. You know if your building has violations and if any of you know if any of your neighbors are calling 3-1-1 a lot. That might be a sign that those are folks you might want to organize with. So you can go on the displacement alert portal, which is through an organization called a nhd, and you can look at the violations in your building and kind of get a sense of the history that you're working with and then the next step is to build power through base building. So we build power by building communities and we build communities by base building so fun graphic there. That kind of shows you the levels of basis, you've got leadership and then the broader constituency and so base building is defined as the work of engaging people in a campaign or organization and developing their ability to address issues they care about. So your power comes from your ability to act, mobilize and develop a large number of people who are in relationship with your organization, so pretend and organizing. That means you know getting, maybe not everyone in your building, but a good amount of the people in your building to come to attend an association meeting and to you know, come up with common demands. So there's a cycle to base building step. One is outreach step. Two is follow-up step. Three, these events, four is plug-ins and then five is repeat and you just keep doing that to build power. So the first thing is outreach beginning base building. So how do you reach out to your neighbors when you're socially distanced? That's a real challenge, so the one idea would be hanging a sign in the lobby and ask people to put out down their contact info. You can also slide flyers under people's doors and ask them to reach out to you and we have sample fliers for that. So, if you're interested in organizing a building you don't know what to put on a flyer, send us an email, we can help. You work that out and then using a phone tree. So like let's say that you you have one neighbor's number, you don't know anyone else in your building, call that neighbor and see who they can call- and you know eventually you just end up with actually knowing your building. So those are just a few ideas. It's still not as easy as it was, but we weren't socially distanced, but you can do it. People are organizing now more than ever, really so it's doable and then from there once you're. Actually, you know connected how do you find common ground? How do you build those relationships so starting out by like asking what people need and if and being really honest about the problems that we're? Having and saying? Are you having trouble paying rent? How long have you lived here? What issues are you experiencing, and you know really getting to this core structural problem that we're working with of dealing with ren and dealing with our rights as tenants during this moment? So don't be shy and just go and ask those questions and then from there build community and build power, so holding an attendance association meeting, and you know, starting out with how long you've lived there. What you're, experiencing and figuring out you know is that leak, that's happening in your in your apartment happening in someone else's apartment, because the answer is probably yes and if you need support for that, you know reach out to your local housing group for help. So, if you're in our catchment area reach out to us and then creating a shared list of issues in the building and then from there taking action, so look at that list of demands and figure out. What is your next, your next step to get that met, so one thing could be sending a letter to your landlord. Another could be starting a social media campaign joining with a neighborhood association. If what you're dealing with is a neighborhood-wide issue, yeah just figure working together to figure out that solution and then from there like building neighborhood power, extend your outreach to other buildings owned by your landlord. So if you go on this website who owns what.justfix.nyc and see what other buildings your landlord owns and also maybe see what other violations they have and if it seems like there's some similar situations, you can repeat that outreach that you did from step one and send flyers over there and see if you know, there's a way to build power together to take on common issues experienced by all the tenants with that with that landlord, and then here's just a few resources that you can use. The first is a tool to call your reps to cancel rent, because that's an important thing we got to do and then there's frequently asked questions on the eviction moratorium and the link to the placement displacement alert portal. The hcr run history portal, a rent strike toolkit and the who owns what portal as well. So no, these aren't clickable. So I might just drop them in the chat for y'all, or we can send out the presentation thanks so much elise, I'm just going to turn it over to corliss evans from the city department of finance, and then we will have time for q a either in the q, a box or through the raised hand, function. Thank you good evening. Hi. My name is corliss evans and, like you said, I'm from the new york city department of finance- and I am the outreach liaison for Manhattan. I would like everyone to know that the outreach team is up, running and ready to facilitate rent freeze events virtually prior to Covid-19, which was on foot in the communities holding outreach events. So Covid-19 has stopped us, but we're ready to hold these events virtually. So if anyone's interested, we are ready to come out. So just as a reminder, the eligibility factors you have to be 65 years or older. The total combined household income cannot exceed 50 000. The tenant must live in a rent, stabilized or rent, controlled or preferential rent apartment, and they must be paying more than one third of their monthly income for rent, and I would also like to introduce a new, a new system that the department of finance have it's called the tenant access portal, also known as tap it's a program. Once you register you can follow the process. The progress of your application via online. You can check out the benefit. You can see the activity you can see what your rent is frozen at. You can see what the landlord's being paid. You can see the activity, you all the questions that you call the department of finance about the questions that you call 3-1-1 about. You can personally go online and see this all for yourself, so I just want to give a quick just shout out for us that we're here to help you and if you have any other questions or interested in us having an event with you or speaking with you virtually you can reach me once again. My name is corliss evans and my email address is evans c at finance. Dot NYC DOT gov once again, evans c at finance, DOT, NYC, DOT gov and my first name is spelled c-o-r-l-I-s. Thank you for a couple of minutes have a great evening. Thank you so much so we will open it up to questions. There's one person who has a raised hand how jesse? How do I unmute them to call on them sure? I just want to make sure that you see your three in the q a right. Yes, I'm providing some phone numbers. So if those are all, if you're all responding to those, I can move to the to the raised hands. I can do just in the order that they've come in. Is the phone number ending with 442 hi? Are you there hi the phone number with ending with 442? You are muted yourself. I can ask you to on you, but you have to press star 6 to unmute yourself. If you have a question hi, my name is doreen demiuces. I live at 300, west 46th street. I have a question. Our landlord has closed off access to our lobby bathrooms and our tv room and our community room since March. I am a senior citizen, I am mobility impaired. We have been repeatedly asking the landlord to open the facilities, because, just today I just had gallbladder surgery- and I was sitting out in front of the building and I needed to use the bathroom but front desk front desk has no keys. The landlord took away the keys to our public bathroom and also access to the tv room, because in that tv room is wi-fi and if the manager was here yesterday and my phone went out of order upstairs, so I had to go down and use the tv room and if I was caught by the manager in that tv room with their with their cove advance still in effect, they could have done something to me, and this is I'm going to stop you just because you're sharing a lot of personal information, but this is when harwood's supervising attorney at hcc, but I am going to. I have enough information from you to answer your question. If you don't mind, I might I'm going I'll, explain what I'm listening first off I'll just begin by explaining that for very specific questions related to your apartment or your building or your landlord, you should come. You should contact hcc, our main number and based on where you live and your income and what the issue is. We can schedule an appointment for you for either brief consultation or an intake, and our main number is 212-540 one. Five, nine. Six again, that's two one, two five, four one, five, nine six, but I will say that so in general, a couple of things one is: if you live in a rent, stabilized apartment and a landlord has cut off some of your access to services, especially a bathroom or a common area that you used to have access to. It could be the issue. It could be considered. A decrease in services that you may be entitled to a rent reduction, and one thing you can do is submit an application to the division of housing and community renewal to see if they will order a rent reduction. That's one option to kind of put pressure on the landlord to get it back. Another thing is: if they cut off, you know essential services. You can file an hp proceeding in housing court, which you can do now and I recommend contacting trying to contact an attorney to help you do that. Are there a couple ways to do that? One is by calling 311 and asking to speak with a tenant attorney and you'll be connected to a legal services provider who, at a minimum, give you some advice. You can also call the mayor's office to protect tenants and that phone number is 718 718-557-1379 again 557-1379. You can also call housing court answers who can help you file an hp petition without an attorney or, and there are some other options, but a lamp you know. So there are ways to put pressure on your landlord if they're not responding to your request to provide you with certain services that you're required to have. I'm really I'm really appreciative and that, thank you so much okay. There was one other thing, so the if the if there was elevator problems that would also go under the reduced services it could, it might well, there's no could or might about it, because we've had this problem for months and we've made everything, but you could file an application. I think we should move on to there's some other questions. Thank you for your time. So someone in the q a box asked about miss evans presentation and what application she was talking about. Miss evans. Do you want to stuff? We already know right I'll. Just we've got to do that. We're just services all right. So what corliss evans from the new york city department of finance was speaking about where applications you'll hear people say scree or dream. Basically, if you're over 62 years old or if you have a disability, there are pro. The city has a program where, if you live in a either rent, stabilized or rent controlled or some type of rent regulated apartment, then the city will freeze your rent so prevent it from increasing. If you meet the criteria that you are either a senior or you have a disability, you live in a rent, regulated apartment, your income is less than 50 000 and you, your rent, is more than one-third of your income. So there are applications you can file so that your rent doesn't increase anymore. Would corliss? Would you be able to put your email that you had listed prior into the chat for people, so they can just copy and paste it if they would like to follow up, not a problem. Thank you. So much. Okay, there was an earlier question. I know that logan you touched on it, but just in case anyone missed it. We'll just ask it I'll, just ask it again, but the question is about late fees. Can a landlord charge late fees if you're late on paying your rent during the pandemic right? So if you are, the landlord is not entitled to late fees between March, 20th and august 20th 2020.. As far as I can tell, there's no executive orders extending that is limited to only those few months after that they can charge late fees, but it's important to remember that you can never be evicted for late fews. Thank you. Let's go with someone is raising their hand brendan marie hudson. Are you able to type a question in the q a box, okay or we could call on you hi brendan? You just need to unmute yourself to be able to speak. I guess they are not there up there. There's brendan friend. Are you with us? Please skip to the next person all right. We have I'm not seeing other questions. I think that one other phone number, unless that's the same person, I'm sorry from before the fourth two days- is the same person. Oh carla, reddick, redux, reddit I'll hold on one second carla. You just have to mute yourself and you can speak. Can you hear me now? We can hear you okay, hi good evening what I would like to say in regards to almost something similar to the other ladies comments, I stand as senior citizens residents as well and they had the senior center here in my building, where we were getting serviced with meals, what not from the department of aging and whatnot. Now it's like kind of like an oxymoron, it's kind of contradicting, because we were shut down because of the culvert for those who live here. We weren't even allowed to use the space to even go now. They have it well, you know sometimes in the city, when it's hot and people need a cooling center location to go to they're able to go into certain sites where our sit, our site was designated for the cooling site. So it's like. How would you have it where we who live here are not allowed to go into the location for that? But then you have. This is a cooling site for people that can come in off the street. I guess from the city to come in to cool in the area, because this is this doesn't mean it is a certain area. So that's the kind of thing because a lot of these seniors they can't go to the park. They can't they're elderly so having to not be locked up inside their room all day long, it's kind of very hard for them. You know, so they need to have a place. They can go downstairs at least and sit and be you know without having this stuff, you know mess with their head all the time. So that's what I'm concerned about lynn. Can I take that yeah, of course sure so, carla? I don't know specifically what location you're speaking of stock location, I'm sorry woodstock. Okay, so can I suggest I'll put my email in the chat and we can follow up on that. I think that's more complicated than and a little more city policy oriented than tenants rights unless linden you have something to add, but okay, no, I don't have anything to add just that it could be considered a decrease in services, but it also could be reasonable if the reason is to prevent the scope, the spread of Covid-19. So it's a complicated analysis that has to be done for each building individually and if and eventually, by courts, but so far there isn't. You know any precedent about those type of issues during a pandemic. Okay, so you're gonna put your information in the chat for me and I'll follow up with. You can definitely follow up with me, carl and we'll we can dig a little deeper and get an answer to your questions. Thank you brendan. Do you want to continue on? Do you want to ask a question- or I guess not? Well, I think we're done unless we have someone else that would like to ask a question: what is your name? This gentleman be mcb4 staff. Sure, sir, my name is sorry. My name is jesse beaudine, I'm the district manager for community board for- and I just put my name, my email in the chat. Okay. Thank you. The email is the letter j and then my last name, bodine j-b-o-d-I-n-e at cb like communityboard.nyc.gov, okay, thank you, you're welcome. Oh people are asking for phone numbers, so so I'm not sure which phone numbers but I'll give all of the numbers that I know so. Hcc's office number is 212-541-5996, I'm saying it over in the phone and typing in the chat just so people on the phone. No, you can also call 311 that will connect you to an attorney who will either give you who will give you brief advice at a minimum or potentially be able to represent you in a housing court. Proceeding the other number you can call to seek an attorney on a housing related case is five 718-557 one three, seven, nine and I'm not sure what other phone numbers were requested. I'm happy to give the community board's office number in case, if that's one of those phone numbers, but I don't know if it was 212-736-4536 and I'll put in the chat as well. I guess also, if to request your run history from dhcr. If you live in a rent, stabilized apartment or you think you might live in a run, stabilized apartment, you can call 718-739-6400, and that is to dhcr, which is a state agency who, and they are in charge of overseeing rent regulation, and so they will have what's called a rent history, which is basically all the rents of prior tenants in your apartment since 1984 and an attorney could analyze it to see. If perhaps your apartment may be subject to rent stabilization, someone's asking with a 646 number okay. I think that is the court's number, so Manhattan housing court. If you receive eviction papers, especially if you receive a non-payment petition, you should call the housing court clerk's office and in Manhattan that number is 646-386-5505, and let me put that in the chat and another question just came in 386. I have the phone number ending with five: seven: five, okay and there's also one in the q, a box after that, okay, the phone number calling in with fives ending with five seven five. You can unmute yourself and ask your question: okay. Why don't we move on to your the q, a question and we'll come back? Okay? The question is: can I ask my landlord to lower my rent, even though I live in a rent-stabilized apartment? Is it an option? Maria or logan? Do you want to take it? I can take it, so it is an option. Landlords can charge what's called a pr preferential rent in rent stabilized apartments. This is usually done in these types of situations where the legal regulated rent it does not reflect where the market's at so. If tenants can't afford that or for whatever reason you know if they want to charge the person a lower price, so it is allowed under the rent, stabilization law and again we can't promise what your landlord will say or what they'll agree to, but it definitely never hurts to try. If you think what you're requesting is reasonable, you should definitely call them or email or write a letter and explain your reasons and see if they could work with you on that. Okay doesn't look like we have any. Oh I'm sorry, yep doesn't look like. We have any more questions so, basically in some there's an eviction moratorium in new york in new york state through October 1st for sure and we're not sure what's happening after that and housing court is, has been operating mostly virtually. If you get a new court case that will probably be very, the process will be very slow. The court is working on, like maria said, is the court's working on trying to get through cases that were started before March and but above all, if you receive court papers or you have questions about tenants rights, you should call 311 or the mayor's office to protect tenants or housing court answers or us hcc, especially if you live on the west side. So thank you all and thank you so much to my co-workers, maria logan elise, and thank you to jesse and Manhattan community board for well thanks. Everybody so again, this will be up on our website. It's live right now and it'll be up there going forward and by tomorrow, we'll have it in closed captions. On our website. One question: I think there were some folks that did ask earlier on whether the powerpoints were something that could be posted either on your guys's website or our website. I wasn't sure we can discuss that later if we need to, but that was a request from some of the folks yeah. We can share them so jesse I can. We can coordinate that right. I think that'd be helpful. All righty well, thank you very much everybody and thank you to our asl interpreters. I appreciate your time today. Yes, thank you. So much. That's great! All righty, I'm gonna end the meeting. Okay, take care. Everybody's gonna disappear from each other.",
        "summary": "I will enjoy and elise levy, who is a tenant or you're marie logan bit about tenants doing the pandemic and a little bit about non-payment cases, I'm, an attorney at hcc, lakeland set and tonight logan, and I will be presenting on Covid-19 updates to housing court and also about non-payment proceedings, which we anticipate will be coming up for more folks in the future.\nThere have been a few versions of the moratorium so far in the pandemic, and currently the one that applies to new york state is one issued by judge marks, which extends the eviction moratorium until October 1st 2020.\nSo some updates in terms of our housing court calendar is that new cases can now be filed, but they're, currently not being heard.\nThe court has chosen to dispense with the cases that are already on the calendar first, so new cases that are being filed are putting being put off for the moment, logan's going to talk more about what might happen if you receive a notice for non-payment and what an eviction proceeding for non-payment will look like the exception to new cases.\nYou should contact one of the numbers that we will be presenting throughout, to ask for an attorney and for legal assistance prior to the date on the right, hand, side of the paper.\nIs: it depends right, and that being said, I think that many people have decided to move because they can no longer afford the apartment due to job loss or they have moved to care for sick relatives They themselves need to be need to move out of new york city for safety reasons or just for other health reasons.\nMany people, as I've talked about, have moved out of new york city, some permanently, but When things are out when things calm down or the crisis, is over, but they're worried about being brought to court and the laird alleging that they do not primarily reside in their apartment.\nI can't promise you that, if you've moved away for health reasons or to care for sick relative or for any other of the valid reasons that someone might move away from new york city at the moment that the landlord won't be able to prevail in a non-primary residence.\nAnd she's, going to talk about the protections that tenants have been afforded by new york state through the safe harbor act, so pay close attention in those parts of the slides, I'm.\nAlso, a staff attorney with hcc, And I'm going to talk to you about non-payment, cases, because generally, these are probably the ones that are going to come up most frequently during this Covid-19 pandemic.\nAnd they'll say that you owe this much money, but it is important to know that they can make a verbal demand for the rent as well after they do that and after that time period, that they give you expires, which is usually about 14 days.\nAnother thing that is important to consider with non-payments when you look at the rent demand or the ledger that you're given is whether or not the landlord can charge late fees under the executive, order.\nAnyways and another issue for people who are facing financial hardships because of Covid-19 is: Can you use your security deposit to pay rent that you owe under the same executive, order?\nThe security deposit can be used to pay rent owed if the tenant is facing financial hardship as a result of Covid-19 19.\nIt does something kind of similar to the safe harbor act, where it just means that you can't be evicted for that between the time of up until december 31st after december 31st, you can, and during that time, even though you can't be evicted for those arrears fees and late charges will accrue still And, then the biggest thing is that, in order to assert it, you have to sign a declaration that the CDC provides on their website, and you have to agree to all of the paragraphs that they lay out and the paragraphs lay out very specific facts, and it is our advice that no one signs that declaration or asserts this defense without consulting an attorney before, because it has a lot of information in there.\nOrganizing, is the act of bringing people together to build power with their neighbors to win rights and protections and to protect their neighborhoods and a little bit about like what we won and what tenant organizing can do.\nSo like let's say that you you have one neighbor's number , you don't know anyone else in your building, call that neighbor and see who they can call- Do you build those relationships so starting out by like asking what people need and What issues?\nDon't be shy and just go and ask those questions and then from there build community and build power, so holding an attendance association meeting, and you know, starting out with how long you've lived there.\nIf it seems like there's some similar situations, you can repeat that outreach that you did from step one and send flyers over there and see if you know, there's a way to build power together to take on common issues experienced by all the tenants with that with that landlord, and then here's just a few resources that you can use.\nThat's two one, two five, four one, five, nine six, but I will say that so in general, a couple of things: one is, if you live in a rent, stabilized apartment and a landlord has cut off some of your access to services, especially a bathroom or a common area that you used to have access.\nOne is by calling 311 and asking to speak with a tenant attorney and you'll be connected to a legal services provider who, at a minimum, give you some advice.\nIf you receive court papers or you have questions about tenants, rights, you should call 311 or the mayor's office to protect tenants or housing court answers or us hcc, especially if you live on the west, side."
    }
}