{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB6",
            "channelId": "https://www.youtube.com/channel/UC3wplvgutfIOHKy3y0QRUQw",
            "title": "Housing",
            "publishDate": "2020-09-21",
            "shortDescription": "CB6 convened a panel of experts to discuss long-term systemic solutions to the homelessness crisis."
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB6",
            "normalizedName": "Manhattan Community Board 6",
            "twitterName": "Manhattan Community Board Six",
            "youtubeChannelName": "Manhattan Community Board Six",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "twitterHandle": "@cbsix",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        },
        "properties": {
            "fillerWordCount": {
                "uh": 358,
                "um": 508
            },
            "wordCountFullTranscript": {
                "housing": 109,
                "people": 96,
                "services": 56,
                "city": 54,
                "community": 53,
                "street": 43,
                "shelter": 33,
                "things": 29,
                "folks": 29,
                "site": 28
            },
            "wordCountSummary": {
                "housing": 23,
                "people": 20,
                "city": 17,
                "services": 12,
                "site": 9,
                "community": 9,
                "folks": 8,
                "shelter": 7,
                "families": 6,
                "street": 6
            },
            "fullTranscript": "So the meeting is recording I'll keep fiddling with the youtube live stream, which continues to okay but you're good. To start great. Okay, welcome to the September 21st 2020, meeting of the cb6 housing homeless and human rights committee. My name is corinne vanderdunk. I am the chair of the cb6 hhhr committee. This meeting is called to order at 6, 31 pm and tonight we are joined by assistant district manager, cody osterman, members of the publix public. You can raise questions through the q, a feature of zoom. We need a volunteer of our committee to take minutes tonight. Committee members, if you can take minutes, please raise your hand through zoom you're gonna need a volunteer for the minutes, can't start the meeting. Unless I get a volunteer for the minutes, the former secretary of a community board, I would but I know this is going to be a hard one to do minutes for very powerful position. Y'all, yes, raj should do excellent minutes yeah. I did the last one for that joint meeting. That was a bear. Okay, corrine you've got some hands. I think rich has a hand and abby has a hand. Okay, let's do abby, because rich has to do some other things. Thank you, abby. Thank you. Abby, okay, well, we'll now take attendance by roll call. He sues cody will conduct a roll call. Okay committee members- I will call your name and just say present if you're here, kyla side here john behrenbaum, here, claire brennan, I'm here andrew gross here, abigail cruz mark here- richmond here, karen moore here, raj nyer, here, matt roberts, president madeline sims madeline andrew suresh, andrew corinne van der donk, here jeff zelen. Here all right, you have a quorum great. The agenda for tonight's meeting was distributed ahead of time by the board office and appears on the screen before you. If there is no objection, we will adopt the agenda, as stated members of either committee. If you object to adopting the agenda, you may raise your hand through zoom. Seeing no objections. The agenda for tonight's meeting is adopted. The minutes from the joint eighth meeting with the budget committee was were distributed ahead of time by the board office, were posted publicly on the cv6 website and appear before you on the screen. If there is no objection, we will adopt these minutes. Seeing no objections. The minutes from the June 8th meeting are adopted. They will soon be available on the cb6 website as some ground rules for an efficient meeting. No one may speak until granted the floor committee members. If you have a question about committee business or wish to make a motion, please raise your hand through zoom. If you click the participants icon, the participants panel should appear and you should find a raise hand function there. The chat function should not be used for committee business or questions about agenda topics. All such remarks should be made on the record by raising your hands through zoom chat should only be used to alert us to any technical difficulties you are having or to state in writing in information like an email address that was already stated aloud on the record during the meeting when the committee member is given the floor to speak, I will identify you and you can unmute yourself so that you can speak. We are required by executive order to create a verbatim transcript of the meeting. So please keep your questions and comments. Succinct and germane to the discussion. So tonight's agenda is one, is a update on temporary housing and services for homeless, new yorkers due to Covid-19 19., including let's go back in the bathroom. Oh then pick her up. Okay, somebody thinks they're on mutes and they're, not that's. Okay. We have some humor in this during these boring procedural things update on temporary housing and services for homeless, new yorkers due to Covid-19 19, including in the use of temporary hotel sites in cd6. After this short slide presentation, council, member keith powers and council member colina rivera will speak after that, we will have a panel discussion on the short term and systemic solutions to the homelessness crisis. Now after during for members of the public, please use the q a feature to ask any questions. We will choose questions after council, member riviera, rivera and powers have spoken, and we will choose a few additional questions after the panel discussion for the panelists. All other questions will be preserved and answered at a later time by the office staff of cb6. Please know that this is solely in the interest of time. Please do not hesitate to contact to see the board 6 office for undivided attention at a later time and, let's start with one slide number one so before 12 at 19. Where did we stand? We can go to the next slide. So, as you can tell from these numbers, we have at last count in July 2020. There were almost 60 000 homeless people in shelters and the majority of those people are families and children. Single adults, single adult men, is about fifteen thousand. I do wanna also mention that a lot of families double up and the estimate of actual homeless students in the public schools in new york go over a hundred thousand go to next slide. Cd6 is home to four permanent shelters, the 30th street shelter. It's also an intake center, the new providence women's shelter on east 45th, the samaritan village on east 53rd and the hands up brc safe haven on east 17th street go on the next slide. Fair share so is as cb6 overburdens. Not according to the statistics, we are at one five one point: five percent of shelter population that we host. This is in contrast, for example, brownsville, where it's 6.3 percent, or even our neighbors to the west at three percent go in the next slide. The temporary shelters due to Covid-19 in cv in cd6, are drumroll and the pod at east 39th street 280 beds. This was a density reduction hotel, meaning that they came from existing shelters to create social distancing conditions. The marcel on east 24th also a density reduction, slowly filling up the y at east 47th and last I heard there's now 116 bets occupied of the 222 planned. The clients are street homeless individuals who were living in the subway, a particularly vulnerable group of homeless individuals and then the fourth one is Lexington and 30th street the hotel, 109 clients. Also a density reduction, go to the next slide. Has our district seen an increase in crime short answer is no, in fact, it's gone down. There's a there is an uptick in burglaries, amputee, larceny and outside of our the our district, but it you know further into the other boroughs. There's definitely an increase in shootings. By far the numbers are still a lot lower than in the 1980s and 90s next slide. Please sanitation concerns. We have observed that there are sanitation concerns in the district, especially in light of the city's cuts to the sanitation department budget which reduced the frequency of street bin pickups and other neighborhood services. The mayor just restored some funding to sanitation about a week ago, which should help the situation. Our local council members have partnered with sanitation service providers to offset sanitation cuts as well. We are also working with our partner agencies to see how we can respectfully engage with unsheltered individuals who have set up encampments. This effort was previously spearheaded by the NYPD they no longer, but they no longer do so, and an alternative has not quite been formulated yet next slide. So lines of communication, cb6 and local stakeholders are in constant discussion with DHS temporary shelters, site operations, our partners in city and state government and our neighbors to identify and address both the quality of life concerns that our house residents have and the concerns that are unhoused and street homeless residents have. If you see unneighborly behavior from a temporary shelter, resident or homeless individual living on the street, please call 3-1-1. We understand that 3-1-1 can seem like a dead end, but it's crucial for the city to have the data and for the outreach services to have the data of which areas to target. If it's a matter of an emergency, please call 9-1-1 and please do not hesitate to email or call our office. I personally have been on many phone calls. Maybe quite a few of you are attending this meeting today and I thank you. I thank you for making us aware of of what is going on in our district next slide. Please, what can you do to help? We would love to help organize donations for the various shelters in particularly the the y has asked for books and puzzles, and the children acs has asked for children, books and books for youth. Please contact us if you are able to donate such items. I have to thank anne zelliger, who is one of our committee members, our board members, who will spearhead gathering the donations and making sure they end up at the shelters. We encourage you to start a neighborhood group to help you and your neighbors to be more organized and last, but definitely not least, we have heard so many times now that there's some real issues with the lack of available public restrooms and it has a lot of unpleasant results for everyone. Long-Term solution is that we, as a community board, will ask for the city to start funding public restrooms. In the meantime, we would love to see communities gather together and find houses of worship or other locations that are willing to open up their restrooms. If you have any ideas, please again email, cd6 and see if we can help with this. This has never been done before. So we would be trailblazing. We would love to hear from you next slide. Please I'm going to have the next slide. Oh, I see it. Sorry I wasn't so what has cb6 been advocating for? We have been advocating for more low-income, affordable housing units and more supportive house housing units for years through our yearly district needs statement and budget request. However, there's currently only one supportive housing facility in the district kenmore hall on 23rd street, with 326 beds at 2018 city council report, called supportive housing, the most successful existing model for ending chronic homelessness among vulnerable populations, and now I will hand over the soapbox to council who wants to go council member. Whoever is first on my screen, wins council, member carlina rivera all right. Thank you so much thank you for putting that together. I realize you know when you look at information like that, it can get it can make. You feel a little bit helpless and I'll get to that in a second. I just want to thank all the members of community board sick, the sakes, the public, the everyone who organized the panel, the speakers. I know our city is in the midst of an extended housing crisis that has been exacerbated by the copa pandemic and even before Covid-19. We all know there are 60 000 people in our shelter system, over twenty thousand of them children and now a hundred thousand new york city, public school students who live in temporary housing. So the city's homeless population is really struggling right now, really more than ever, because city shelters are overcrowded unsafe. You can see at the height of the pandemic some of the stories that we saw in the media that were incredibly heartbreaking and now many new yorkers are currently without access to services. They normally rely on because of Covid-19 and all of the you know the non-profits and the service centers that were closed and many of those services are something that the council funds, so maybe they weren't able to access certain services during the day therapy substance abuse programs, all of that was temporarily shut down, but our budget does really address not just some of those programs and services, but some of the ideas that you mentioned in terms of renovating local bathrooms. Could you imagine what it's like being someone who doesn't really know where to go when they have to use the bathroom and so looking at our park spaces to make sure, for example, in tompkins square park, we're renovating a bathroom that is very highly utilized and making sure it's accessible, but also partnering, to create those accessible showers? That you also mentioned it's something that other council members have worked on. I would love to work on something like that and as for legislation, I think the fair share piece is certainly something I was very vocal about. When I was first running, I remember I wrote an op-ed about fair share legislation. It hasn't really moved in the council in the way that I think we all need it to, but I also understand that it takes a really comprehensive and intersectional look to make sure that we're doing it the right way and, as a result, we're just seeing more homeless, new yorkers on our streets and more people in increasingly desperate situations. I know many of us can feel a bit helpless in being able to aid these individuals in our community, but we're certainly trying I'm sure councilmember powers will mention the harmonia and kind of that groundswell of support. That was a testament to. I think what new yorkers want to see, which is actual supportive housing. That is in response- and I remember I was reading about a program called new york new york, which is a program from many years ago in which the mayor and the governor would team up together. Imagine that to actually build supportive housing and that's something that I'm trying to bring into my district. I do have a couple of supportive housing facilities, but not nearly enough, because those wraparound services are so critical to making sure that the chronic homelessness that happens, that recidivism doesn't continue because there's someone there to kind of talk to and make sure that you have what you need. But my office is working with the department of homeland services street outreach teams, local precincts and service providers to ensure that homeless, new yorkers are connected to life-saving resources. We've seen some improvements this way, but we're still dealing with a housing crisis. As you all know, and we know an eviction crisis is coming up once that moratorium is lifted. So we have to continue to approach this crisis from a holistic perspective, because right now we're just kind of managing the symptoms and it's not really going to be the cure until we get actual roofs over people's heads and those services in place. So I'm advocating for the creation of supporting housing of supportive housing with on-site resources, improved mental health and substance abuse, treatment, survi services. We did that with one of our local facilities, making sure that substance abuse treatment program was actually available on site because some people were, you, know, drinking and smoking in front, and we did receive a couple of concerns from some of our neighbors and certainly an end to discriminatory criminal justice practices that leave people homeless. That's been happening for a very long time and I'm going to continue calling on the mayor to provide concrete details on the future of housing for new yorkers experiencing homelessness. I've directly funded, affordable housing units. In my district, in fact, we just celebrated like the roof when, when you put the roof on a place, it's kind of like a big deal when it comes to development- and this is on east 2nd street. It's in partnership with asian americans for equality. I think what's the best part about this particular building is not only are there truly affordable units at amis at like 60, but there will be units set aside for formerly homeless families so trying to put that into practice and multiple sites in my district and really get those numbers up, and so I realize again can be kind of frustrating in terms of some of the answers that we get from our city agencies. I certainly get frustrated as an elected official, so no you're, not alone, and in my in my old days as a housing organizer and as a service provider, someone who did a lot of counseling around these issues. The work never stops. So thank you for taking this so seriously for actually putting data behind it and for really coming together to try to figure out how we can all work collaboratively to try to improve a very difficult situation. Thank you, council, member keith powers. Thank you and, first of all, thank you, everybody for doing this hearing and thank you to councilmember rivera. We sort of in this area basically share sides of the street as there's an issue in my district. It may also evict her constituents and vice versa, so we're glad that you were able to have us both here, and so thank you for doing this, and also thanks to all the groups. The groups that are on here are fantastic and are doing the front line work here in the city to help build a city that provides housing opportunities and helps and is compassionate towards those and who need it, the most I'll. Just briefly, I just want to talk about the harmony just for a minute, if only because it's nearby and it does sort of discuss some of the issues we face here in the city. So as many folks know as they were, you know planning to close down with not lots of explanation the shelter lucerne on the or the hotel. I should say on the upper side: they decided to displace individuals living on the harmonia, which is a in my district. I think it's in community board five as well and had been home to a number of adult families for the last few years. It actually was prepared to be open. While I was becoming a city council members right after I won my election and since then has been a very good neighbor in the community. By my in my experience, it had been welcomed by the neighbors. It had been really kind of a stabilizing force for a lot of the families there and for some of the folks I talked to they were getting ready and getting prepared to get out of, get to leave there, but still viewed it as really kind of essential to their lives, and it was where many had their doctors nearby or some were had other critical services around there, and it was, I just wanna say it was shameful that they decided to displace these individuals to try to play. What I would say is sort of a political game here in the city and I'm glad right now. It does seem that we're going to be able to keep them there we're going to be able to continue to provide that as their as their home as long as they need it. But it was really kind of to me emblematic of the problems that we here have here in the city right now, and particularly the lack of leadership in many ways when it comes to helping our fellow new yorkers. So it does seem no, but based on a lot of the efforts here and thank you to many of the groups that joined to call for an end to this ridiculousness that the folks are going to be able to stay there, we're hoping for a permanent answer, but it does seem. That's the way it's headed and I just want to say thank you for everybody who kind of lent their voice to being more compassionate to our fellow new yorkers. I would also add that, as you guys are doing anything around organizing donations or organizing things for some of the some of the some of the places we talked about are in my district, some are in council rivera. I should I'm sure both of us, but I know I'm sure, happy to help and pitch in any efforts to try to help organize donations or be part of helping out those new yorkers, and I'd also mention, like think about the public schools in the area or other places where there are families that who are experiencing homelessness and also need whether it's school supplies or could use any other assistance it. You know, so I but we're happy to happy to pitch in on any effort that cb6 is doing. I just will talk about a couple things you know. Ultimately, at the end of the day there you know there's as we're talking about these fights. You know end of the day as councilman rivera said it. This is so much have tied into our strategy around housing here in the city and both the ability in areas like ours, which are become more difficult to identify places to build the type of affordable housing that we need in the city to be affordable for folks actually to live in, but also we need to break down some of the exhibitions from the existing barriers to finding housing for those who can and we had a hearing last week on a few bills. I have a bill: that's about source of income discrimination, which typically represents itself as if you have a voucher, a landlord can discriminate against you and not give you an apartment, even though you might be eligible for it, based on the source of income for that you're, using we're trying to basically expand that law here in new york city to give people who have an opportunity to get housing to me to not show up and find out that they can't get housing, whereas they desperately need it. We have a bill, that's related to and one that I really talk about is councilman 11 as a bill. Levine 11 rather has a bill to expand the vouchers here in the city, which is a the you know, ability for you to go, get housing but they're critically, underfunded right now, meaning that folks are spending years trying to find housing. We have a bill of it actually make that be closer to market value, so that people who have a voucher want to go find housing actually have the ability to find an apartment in either in our neighborhood or in any neighborhood, because, right now they basically you can't afford anywhere to be able to go out and find and afford housing with the city's help. But so a lot of this we are kind of deal with legislatively in the council to make sure that you don't have just if you have the ability to find housing that you are actually able to attain it. But the thing I would say here is like I know you guys are going to talk about this tonight, but when we talk about the hotels right now, I think that it's critical to remember that we are still in a pandemic. We are probably facing a second wave, and that is going to be part of the strategy here to make sure that we don't have congregate, settings that will lead to widespread transmission and will put people's lives in danger and the hotel strategy was meant and it is meant to be able to give people a place to stay where they will be safer from a virus that could friend their own life, and it is part of a strategy for us to be safe from a virus. It's a good! It's a good human rights strategy at this particular moment. I think, and it is a strategy I think we will need to continue to employ for some time. I think we all recognize that, but I just want to remind us that, because that's really a challenge, that's popped up in the last few months, I have a number of them in midtown and cb5, but it is part of the strategy here and we are going to have to figure out with this administration what it means and how long we're going to stay in them and what the long term plan is for the medium term plan is, but I do want us to recognize. That is part of that really is about saving people's lives, and it is critical to the strategy here and ultimately, I want to say you know one thing which is just that these shelter fights the fights over shelters always become these really contentious fights. But I am grateful that cb6 has always shown leadership here to be able to show that you know it is important that we are compassionate. It is important that we find places for people to stay as we get them services as we get them housing and to try to aspire to be the best versions of ourselves, as we do that. I know that these can sometimes become difficult issues in our in any community, but it is, you know, incumbent on us to all try our best here to help our fellow new yorkers and try to find ways to make this a long-term strategy for our city and avoid these sort of big contentious fights. We are going to be doing. I just end on this note. We are going to be doing a hearing on housing and re-entry services next month, I'll get you cb6 the the information on it, but it's gonna be a number of my committee criminal justice committee. I think general welfare, a number of other ones talking about this sort of house this pro this issue, we're talking about tonight and also re-entry services, because I think, there's a lot more. We can do around that to make sure people can land safely on their feet as we as we look for them to to come back to our community. So you know anybody who's interested in that should come join us here. I'm going to stick around for a little bit longer to talk here. Some of the folks talk about. I can't say the whole time, so I apologize, but thank you cb6 for having this, and certainly would ask for your support on any of those bills. We're talking about the council that will actually help people get back on their feet and help us lower the population in our shelter system. Right now. Thank you, council member. This is rich mintz, I'm vice chair of the committee and I'm going to pass along a few of the questions that have been submitted by the public, and hopefully our chair can respond to them, or maybe we'll set a couple aside for the panel. One of the questions that I think is important to raise is that a member of the public notes that the 30th street men's shelter is, and these questions are, for whoever on our panelists is the right one to address the 30th street men's shelter is the primary intake for homeless men in new york city and this member of the public notes that there are safety concerns associated with this and wonders why we can't spread out intake whole, not through other parts of the city, and I you know that it creates a concentration of concern in the high 20s and low 30s, that's different than in other parts of the district corinne. Do you have anything you'd like to say to that I mean I no, I think maybe leilani would like to answer that. Can you all hear me? Yes, hi everybody thanks for having me for those who don't know me, my name is leilani irvin, I'm the Manhattan board director for the department of social services and under the umbrella of dss lives, hra and DHS. So I can answer that department of homeless service question, so 30th street is the largest one of the largest shelters. I think I want to say in the country it's in new york city for sure. However, it's not just an intake for single adult men. It also is. We have a separate point: entry intake for adult families, and so this is we have it's not the only intake center, but it is for single adult men. So that's the only place where single adult men would have to go to come in for intake. We have single adult two single adult women intakes in the city of new york. One is in the borough of the Bronx another is in Brooklyn. We have a families with children, intake, shelter, center called path and there's only one and that is located in the Bronx. So adult families and single adult men intake point of entry is 30th street. I think, for a number of reasons, it's effective for there to be one point: entry for these intake locations for single adults: that's currently how the system's been operating. I don't believe they make. I don't believe, there's any plans to change that, but it relates to safety. I know in general, especially this community board. I've received lots of inquiries around sex offender questions regarding 30th street in the past that was, there was some concerns with sex offenders, and I know that this mayor took a position and made a commitment, and this commissioner, our commissioner, made a commitment for there to no longer be an opportunity for anyone coming into the intake system in 30th street if it's captured in their assessment intake, if it's captured that they have a background sex offender background, they will not receive a bed or a placement like this at this location at 30th street. That commitment still stands and still remains so folks come into 30th street intake they're assessed, and then, from that moment that point in time we actually have a new clinic on site. So now folks are now able to get a medical screening, which was not something we had before, which is a big deal. That's a game changer at 30th street. So now people can get physically assessed to see if they're, medically appropriate for shelter in the past. There were, I think, that's a big deal for a number of reasons, so we get a lot of folks coming out of hospitals. There's a lot of maybe not appropriate, discharges made and they come to shelter and excuse me. Can I ask you to wrap up because I do want to move the agenda? Sorry sure. So, in short, yes, single adults are only at 30th street. For now I don't believe that the agency will change that, but it's also an intake for adult families, and I close with that sorry, I'm thank you. I have two other quick questions. One is and again corrine. These are for you, one is: are there any other services you can? We can call other than 9-1-1 if there's a mental health emergency and the other well I'll? Let you take that one and then I'll give you the other one and then we'll move on. I mean a mental health emergency I would assume would still be 911 if it's just a less urgent issue. 3-1-1 is where you would report it and again you can call our office or your council member's office as well, and we either the community board office or the council member's office would then definitely follow up with any kind of service provider in the area and make sure that something someone is coming out, and this we'll bring this one back later. When we're talking about street outreach teams. And the other question is you know, there's this, and this is from a member of our committee, there's just that the mayor mayor's office hasn't really adequately communicated the situation with the temporary shelters, which is that aren't necessarily tied to the the residents themselves and leaves us in a situation of uncertainty and we're wondering if we have a path to get more accurate, complete and current information about the plans for the especially for the temporary hotel shelters. You know I can jump in if it's, if it's helpful on this one, to give you give you a hand here I mean we have some information and I think all our offices are happy to stand by and help out with any information that folks think they need. I mean. Essentially, they were six month contracts that I think some were probably set to expire, but could be renewed based on where the pandemic is. But if there's specific questions you have about stuff, you can reach out to our offices we're happy to try to work with leilani and her team to get the more accurate information about. What's going on. I think one thing we've all asked for is to get a clearer sense of what the plan is here, but, but you know we're all I think happy to help out as information is needed. I will just editorially add something because I happen to live across the street from one of these facilities, and I know that the operators of the facilities are as frustrated as the community and not knowing what the long-term plans are. They are taking it day by day and waiting to learn how long the contracts are gonna last and when they're gonna be able to move their people back into their home yeah and look, I think that for a lot for the city, the aspiration is to eventually get back into the shelters which are really places intended to be centralized service. It's not affordable for the city to do this long term and that's where the residents typically want to be too back in their home neighborhood yeah. That's right! That's right! So all right! And but if there's a specific questions, I'm happy to I'll get answers. Thank you corrine. Can I bounce this back to you to move on to the panel discussion? Yes, thank you rich. Thank you, council, member keith powers and thank you council, member colina rivera. So I just wanted to make talk about our statement of needs that we're working on currently usually in September. We would be our meeting would be about this, so I think it's appropriate to read it read it in 2020 as a result of both long-term under investments under investment and the exigencies of the Covid-19 emergency. The impact of the housing emergency on the people of new york city, especially unhoused, on housing, insecure new yorkers and their neighbors is more severe than ever, and because of the concentration of facilities serving these new yorkers in our public health district. We are feeling spillover effects across community district. The city continues to invest in costly, temporary solutions, while under investing in long-term systemic solutions, the structural shortage of affordable housing, the under supply of supportive housing and social support services and the urgent relocations for health and safety reasons forced by the covent emergency taken together. These things have made it clearer than ever that we as a community are not adequately adequately serving on house new yorkers and that we are not delivering on our social commitment to enable all our citizens to live in safety, security and dignity. Our ask as a as this committee is that we call for funds to aggressively shift from new york's approach to the problems facing on house and housing security, housing, insecure new yorkers, from temporary responses to systemic solutions. These new yorkers problems persist because the approaches we take are not sufficient. Solving them calls for new and ball, and bold and over the long term cost efficient ideas, and that brings us to our panel, where we would like to have a discussion about these new ideas. We have heather frey assistant vice president of breaking grounds. Breaking ground, operates nearly 4 000 units of housing and does street outreach in our districts. We have felix guzman, who is a poet and activist from vocal new york and housing. Justice for all felix was a identifies as a formerly incarcerated and formerly homeless. Individual felix is here today to raise awareness about the intersection between incarceration and housing. We have sheila fakaria from the deputy director of the drug policy alliance. She will speak about harm reduction, wet shelters and pro and any other tools to promote the sovereignty of individuals of individuals. Sorry chiara labrada policy analyst at the supportive housing network of new york. The network represents over 200 non-profits that develop and operate supportive housing and, finally, last but not least, lauren huratolo project director at midtown community courts. Midtown community court is one of the country's first problem-solving courts. It provides alternatives to fines and jail as a response to low crime, and I would like for the panelists. Where is my I decided who was going to start nope? Why don't we start with heather from breaking grounds? Heather, you have the floor hi good evening, everybody, so I'm actually covering for nick urban. Our program director, who was supposed to be here this evening, but unfortunately has been come down with something so we're hoping for a speedy recovery for him. So I'm sort of pinch hitting tonight karen. What would you like me to kind of jump in with just kind of my overall thoughts on things or anything specific? If you can briefly speak exactly what the outreach team does why you know when it goes out, how many outreach teams are there? You know at any given moment anything else that you think kind of. Like a you know, outreach team for dummies, point powerpoint, sure, that's no problem, and actually, I think what I'll do probably is take a step back from that, first, just to kind of talk a little bit about the portfolio that I ever see and in terms of the different programs I street to home Manhattan, which is the outreach provider for midtown Manhattan, is one of the programs that I ever see. I also oversee a scattered site housing program located primarily in the Bronx, but also we have units in other boroughs as well. I also oversee two senior supportive housing residents in Brooklyn for homeless and low-income seniors, and then I also have a portfolio of programs that involves fee-for-service contracted programs, primarily outreach at this point, so we're working with macy's and grand central partnership in that capacity. One of the newer programs that we have taken on in the last less than a year is called it's light touch services. So it's one of the connected to one of the things that one of the council members spoke about earlier. In terms of the new housing developments that, when they're bringing on a homeless set-aside, they will contract with a provider to provide, we are calling it light touch services, I'm not sure, if that's the official title, but where we will work with individuals and families for generally the duration of about a year, just to ensure that they have the support and resources that they need really to be able to sustain their housing at such time that we would step back out of the picture. So that's sort of the overview of the things that are in my portfolio, which I really love, because it's a nice, diverse range of resources and programs, souped nuts from individuals on the street, to you know being housed in a variety of different settings. So so that's sort of for anybody. That will want to ask questions about any of those things I'll do my best to sort of chime in in terms of outreach. We are the contracted outreach provider breaking ground as a contracted outreach provider under the Manhattan outreach consortium. The consortium provides the outreach services street homeless, outreach services for the entire borough of Manhattan and breaking ground covers the midtown portion of Manhattan. We have teams 24 7 365.. They are primarily focused on the more most of vulnerable individuals on the street and they're. We also have our a street medicine team and they we work closely with them to engage and assess folks on the street. In that capacity, our goal is always to bring people inside ideally to permanent housing first, but certainly in any kind of a temporary or transitional capacity is great as well, and we just want to bring people in off of the street. That's our number one goal. I think one of the, maybe the more helpful things to kind of speak to briefly is just in terms of like debunking any myths. I think one of the things that comes up a lot is, you know when there are homeless individuals or people who appear homeless on the street. You know the question is: why can't we just sort of make them come inside or why can't we? You know why can't they be forced into a hospital or what you know like, or I see your team go and then talk to them and then leave and they did so. They must not have done anything, and I think that it's so it's really helpful to kind of understand the full scope that outreach is very much a marathon, not a sprint. It really is something that it we we're in it for the long game and we are working with individuals that are typically very reluctant and have had challenges with other service systems in the past, and so, unlike a typical sort of shelter system, where somebody would go to the door of the shelter and to engage around services. These are individuals that have, for whatever reason, already said nah. I don't really need anything to do with what you guys may offer me. So we really have it's incumbent upon us to build that trust, build that relationship and we're working through a lot of history for each and every individual. That's preventing them from wanting to work with us, and so you know, and then that's the process of working with them around supportive housing applications and then housing interviews and then, ideally again getting them into housing. So that's like a super brief snapshot, but again it's very broad, the work and it's very nuanced and we're dealing with individuals who really struggled in traditional systems, probably historically before the before we've ever connected with them, so so yeah so I'll stop there, because I have no idea where the timer is. I can't see it and maybe thank you, heather, just a really quick question and I know I have written down somewhere, but I don't remember like how many teams are there on the ground in your area at any given moment like and how many people are within one team sure. So typically, a team is two outreach workers that will we really only ever have our outreach workers engage with another individual so that for safety purposes and a host of other reasons, we have them engaging in teams of two every now and then there may be a team of three. If there's some other staffing issue, that you know requires us to have a team of three, but again the staffing will vary either during the day versus evening versus overnight versus weekend and then again versus like in when we have what's called code, blue or code red, which are extreme weather incidents that we really want to make sure that we're engaging our most vulnerable individuals. So we may have more teams on then, or you know, however, teams focusing on our most vulnerable individuals. Then that's again the long-winded answer, I would say on an average, you know in the evening we may have anywhere from two to three teams on the overnight. We may have one to one to two teams- typically, maybe three, but most usually about one to two and then the day time. That will also vary. It could be anywhere from three to four teams, and then we also have case management teams that are working in a different capacity and so but they're also often out on the street working with folks as well, typically bringing them into transitional placements or assisting them with benefits and applications. Things like that. So the number varies based on a handful of different factors. Okay, great thank you heather, which I think is the perfect. What heather was saying about how it's a marathon to get individuals services, because they don't want to go into the shelter system, and I think that that's the perfect moment to for felix guzman to jump in and tell us a little bit about himself and his thoughts on all of this. Thank you. So my name is felix guzman, I'm formerly incarcerated, formerly homeless. Those experiences shape a lot of my my personal journey and the narrative around my life. I wanted to actually talk about. First, the intersectionality of you know all those systems and systems that kind of work together to create this crises. I just wanted to actually go ahead and spotlight that I was actually I became homeless as a result of my building being turned into a cluster site. That is actually a program that the city had where they provide emergency housing for families and adults in different apartment buildings throughout the city. But they are they cluster, a bunch of these units in different buildings, and it turns out that a lot of the communities that these cluster sites were placed in were in the poorer communities and things were difficult. Things were difficult. The city did not provide wrap-around services, nor did they provide on-site on security, and for that reason my quality of life was being challenged, and you know there was. There was a degree of difficulty in navigating matters. I actually was a housing specialist, so I had, I understood the difficulty in placing people while my building was a shelter, so you know it was kind of like a kafka s sort of like you know like inception kind of situation, and that just goes to show that it takes a community. It takes community involvement and engagement to actually facilitate safety, security and also just community on all sides. It turns out that you know what's happening right now across this across the upper west side, with the actions around the shelters of lucerne and the belclair, and I'm sorry I forgot the other one, but you actually have you actually have two sides of the upper west side. Convening one side that are doesn't is NIMBY one side that is ymbi, and we see that those that are actually showing up and showing out for the men in shelter they are providing not just moral support but they're, actually providing services too they're. Actually, providing you know. Therapeutic therapeutic events as well as continuing to provide clothing, doing drives for metro cards are doing resume. Workshops they're, actually working in conjunction with certain collaboration with the shelters, so like that's something that the city should try to implement a bit. More is actually try to facilitate some sort of community liaisonship or partnership with the community boards to sort of raise awareness that this is this. The homeless crisis is something that merits a a combined effort, not just a a overlooking or a passive passerby kind of stance. You know having been formally incarcerated. My situation was to find healthy placement. I had to maintain employment, keep my credit scoring up and all that, but as a formerly incarcerated person. What am I gonna move to if I can't afford it, and that just goes to show that to transition out of a precarious situation, you need finances and then, while homeless, that situation was basically the vouchers that were provided, didn't go up to market rate. I was provided, you know very little opportunity to move out, and I knew that I was basically stuck in a rabbit hole of bureaucracy. It takes a community to get involved to challenge these. Are these not the bills, but these policies that are in place that actually monetize incentivize the creation of shelters that provide no permanent solutions. I believe that the city should take it upon themselves to actually buy out buildings to save the general taxpayers money across the across time, so that you know these. These huge contracts actually provide permanent solutions and resolutions to homelessness. There is no reason why we are throwing away hundreds of dollars per day on a bed in a shelter without actually providing a permanent solution. You know we're actually paying about a hotel rate for a you know, a four-star hotel for someone to have a bed a bed, a bed. You know the same setup that you have in prison, a locker, a metal, a metal bed. You know and the toiletries that you get, but it's the where the wraparound service is on site. Not every shelter is built, the same, not only providers built the same and when we're looking at when we're looking at street homelessness, we have to realize that people are homeless on the street, because they're choosing not to come into shelter because of the atmosphere. That's in there. It's right for exploitation, abuse. You know it challenges, recovery, challenges, safety and that's something that we have to realize that people would rather be in the elements where they would be exposed to danger at all times, even while asleep than to to have a roof over the head, and that's something that we have to humanize, because we've normalized looking over people and not actually treating people with compassion and with dignity and restoring the dignity that has been lost because of the experience of being homeless. I am able to be here talking because I was able to find community. The organizing community is comprised of persons that are trauma-impacted system impacted and then the allies around that. So I'm fortunate to be here, but I also in holding space right now. I just want to draw attention to the reality of homelessness, which is that is a very soul-crushing experience. It is heartbreaking to endure and the men and the men the families are the men and families that are obtaining assistance right now, with these community engaged actions around us, the shelters. This is something that it should be commonplace. We should normalize that we should normalize community engagement at all levels. We should normalize just being prepared to have those conversations publicly honestly openly and again challenge the narrative so that we can actually have a inclusive city as opposed to a city, a tale two cities that hasn't much changed. Thank you. Thank you so much felix, which I think leads nicely into lauren from the midtown community court lauren. Can you tell a little a little bit about the programs that exists and programs you might want to see? That would help that felix is describing sure and I just wanna. I want to acknowledge felix. Thank you for sharing your story. It is the story of so many people who have come into contact with the criminal justice system, and I come to this work as of prior as a former public defender with the legal aid society for many years, so I became the director of midtown community court in December. I was the director for only a few months before we had to shut down midtown community court. We were we started over 25 years ago now, as a problem-solving court. Trying to address how are violations of misdemeanors being processed in the criminal court system? Is there a better way? How can we make it more? Procedurally, just for people connect folks to services that they may need. So we have now an overdose avoidance and recovery core part. We run the human trafficking intervention court, part for all of Manhattan. We run all of community service for Manhattan. Excuse me and we offer on-site clinical services. There are. We have many social workers on site. We operate a fatherhood and workforce program called up next, which is fantastic and was actually just recently featured on the today show. So I would I will send that link around afterwards and we handle all the viola and we also sorry operationalize, project reset, which is a diversion program through the district attorney's office of new york. So we handle all violations and misdemeanors committed in midtown within six different precincts, I will say: March 16th. We had to close down our in-person operations because of Covid-19, and our courthouse was used to process folks who were thought to have Covid-19 19, so we were using. They were using our courthouse to process those arraignments. We still. While they've ceased operations there, we still have not been able to gain access to the building. At this point, so everyone started working remotely pretty within 24 hours. Our social workers were in contact with all of their clients, making sure that people had cell phones so that they could stay connected to their social workers and have ongoing services available to them. We were able to because of funding from city council. Do some emergency outreach work, so we held about five different outreach days and handed out PPE clothing. I mean it really told those outreach events. I will say, told a story of what is happening out in our community right now, mostly black and brown communities that are disproportionately affected by clovid 19 that have always been disproportionately affected by the criminal justice system, and so we saw people coming out. I mean we had hundreds of bags of food and within an hour everything was gone, and so, if that's not telling you what kind of situation people are in right now, then I don't know what can we need to be holistic in our responses? And I think that's what midtown community court does I'm really grateful for the social workers that we have and what they've been able to do remotely for so long in an impossible situation and maintaining contact with folks to try and prevent people from overdosing? This has been an inc we've seen an increase in anxiety, depression, people who were formerly clients of midtown community court who had finished their mandates were reaching out to our clinical folks to re-engage with services voluntarily because they felt like they were isolated and needed to have support. So that's what we've been doing is providing ongoing support and trying to operationalize more of midtown services. Downtown we've also been building out a pilot program with midtown north precinct, and we've been also talking with the behavioral health unit at the NYPD. We just had a meeting with legal counsel for the NYPD and we're trying to operationalize a precinct based intervention. So, as you know, there was bail reform, January 1st and that left many people without well. It prevents the online arrests of many people, so people are getting desk appearance, tickets and being released from precincts in new york, and so what we have thought through is having a social worker and a peer navigator on call for the precincts who can be responsive to people who are going to be released with a desk appearance ticket. So we can start rapidly engaging them in services on a voluntary basis and we've partnered with breaking ground cucs the fountainhouse, which is a direct partner for this. I don't know if you know fountainhouse but they're, an incredible organization on 47th street they're, a clubhouse for people with mental illness, and they do incredible work. So they'll provide technology for people, so they can remain connected to the social workers who are working with these folks and we're really trying to push things a little more upstream and trying to get people attached to services as quickly as possible. So that we create a net, so people don't have to continue to get rearrested for petty crimes, and you know we're also trying to figure out a way to connect with supportive housing for folks who would be able to participate in this program, we're calling it tentatively the midtown rapid engagement program, and so if we can provide the peer navigator, the social worker, housing phones to folks we create a dynamic in which they can become successful and we have to create a web of services to make that happen in our community, and so that's something that we're really focused on building out and getting funding for so yeah. Thank you. Thank you. Lauren sheila. I think it's especially since we were talking about kind of like petty crimes and people trying not to re-lap in drug use. Can you tell us a little bit about what what your, what you work on sure thank you, hi everybody and thanks again so much to the committee and to cb6 for having this really important conversation today. So I'm going to talk a little bit about safer consumption spaces and the need for people who use drugs to be kept safe and alive in the midst of this pandemic, but also just to acknowledge that we remain in an overdose crisis that never really went away that in many parts of the country we know has already begun to intensify in light of Covid-19 due to isolation due to a disrupted drug supply due to disruptions in service access, and so talking about safer consumption and overdose. Prevention is, should be a key part of any conversation and should still remain on our radar. Even as we talk about the variety of syndemics that we are currently experiencing, so I'm going to call them safer consumption spaces, but some of you may have heard of these referred to something else. Perhaps overdose prevention, centers harm reduction, centers, comprehensive user engagement sites, supervised injection facilities, drug consumption rooms. What have you, what I'm talking about, are safe spaces in which medical staff and peers, including people who use drugs, are available at a location where people who use drugs, whether they inject them or smoke them, can bring pre-obtained substances to a space where they have access to sterile equipment and are monitored for their health and well-being. While they choose to inject or use a substance and what we have are actually decades of evidence from across the world that show and suggest that for many people who use drugs, those who are heavily dependent upon substances for whom treatment may or may not have otherwise worked in the past and for those experiencing multiple systemic and structural crises. These spaces and having access to these places can be a key touch point for life-saving services and for health and humanity and dignity. So what is some of the evidence that we have to suggest that these places are helpful? What we know is clearly that having access to a space such as the safer consumption space can reduce overdose deaths. What we know is that on-site, when someone is consuming a substance, that it prevents overdose deaths on those sites, for those who use opioids staff can be available to administer naloxone immediately and to respond immediately or in cases of a more severe emergency services can be called. In contrast. Currently, people who are injecting drugs are often doing so in their homes, other people other people's homes in public spaces and often in contexts in which it people may feel deterred by calling 9-1-1, because they are afraid of being charged with potentially drug possession, drug paraphernalia possession or some other crime, and so oftentimes. What happens? Is people are deterred from calling from may not have 911 the overdose reversal? Drug or may not have the skills to revive someone who may be in a health crisis so having access to a space like this, where there are folks on hand and on staff who can monitor, you can help provide the safer context that people need and what we know is that not only do they reduce overdose deaths on site where the consumption occurs, they also have a ripple effect of reducing overdose deaths. In those neighborhoods and communities, when someone has a place to inject there, they go there and that's what the evidence continues to show that the alleys, the parks, the restaurants, the public bathrooms and other kind of public spaces are less utilized. When someone has a well-lit safe place to go in which they aren't being hassled or afraid of getting caught or arrested, and can actually make safer choices and make sure to be used in the safest context possible and again, these places target the highest risk. Individuals for people of middle or upper classes and who are housed already. Their homes are by you know, de facto, safer consumption spaces because they have access to clean water, good lighting. There may be someone on hand who can call for help in those kinds of situations, so really it's for the highest risk, individuals who may be in unstable and unsafe environments to really be able to have a place to go. What we also know is that, beyond reducing overdose deaths, which is the most severe potential outcome, that can happen from a drug using event, they also help reduce other risky practices. They help reduce the likelihood that someone will share injecting equipment or smoking equipment with someone else. We know that this increases the risk of hiv and hep c when you share equipment such as a smoking like a crack pipe or a meth pipe or if you share a syringe, a tourniquet or a cooker with someone else. So also, not only do these sites reduce overdose risk, they reduce the likelihood of sharing or reusing equipment with someone else to transmit these. These infections and diseases, which can end up being very detrimental to someone's long-term health and well-being, but can also be very costly to treat. We also know that it reduces individuals from using the equipment themselves. We know that using the same, syringe again and again can actually dull the edge of the syringe and can increase the likelihood that you incur a skin or soft tissue infection at the injection site, so again using sterile equipment on site and using in a way where you are in a well-lit environment and able to see what you're doing again also just reduces the likelihood of getting abscesses and other kinds of more intensive bacterial infection. We also just know that it helps people engage in more hygienic and safer practices taking their time. Finding a vein, maybe not using the vein, that they see the clearest which is oftentimes some of the riskier ones, for instance in the neck, and what have you but finding the best possible vein in another location and often consulting with the health practitioner? Who is there on site and also just engaging in better hygiene, washing their hands using clean water and, lastly, know that having access to these sites means that workers and case managers on site make referrals as needed, whether it's to addiction, treatment, detoxification treatment, other forms of counseling and other social. You know having access to a nurse a doctor, a social worker, a case manager on site means that there's someone there to do. An intake assessment. Ask if you want to get connected to other services, help make some phone calls to the nearest housing project or shelter to get you connected and to be that linkage to care that so many people need- and it's through this non-coercive approach of being there and available when the person needs them the most. That really helps create this linkage to services and just as was mentioned early earlier oftentimes getting linked to health care services, social services, addiction, treatment services is seen as more of a marathon rather than a sprint. In that people. Oftentimes need repeated reminders or you don't need to be. You know you need. They need someone to stick with them through the ups and the downs until they just themselves decide that they're ready here, and what we also know is that having access to a safer consumption space does not increase overall drug use rates, studies of safer consumption spaces across the world have shown that new people do not come to these sites to start injecting drugs. They tend to attract entrenched users, long-term users, people who actually have been engaging in this practice, and so it doesn't bring new people into the practice of injecting or using drugs, and it also doesn't necessarily increase their frequency. Most people use their drugs in a systematic and kind of ongoing way, whether it's to avoid withdrawal or for a variety of other reasons, and we find that having access to a safer consumption space, there's no research to suggest that people are using more or more frequently and it doesn't increase relapse rates to know that there's an overdose prevention center or safer consumption space in a neighborhood. We also see evidence out of many communities that have safer consumption spaces, that they have not increased rates of loitering. Any sort of drug-related offenses trafficking, assault or robbery rates in these communities, because again, when people have a safe space to go, they go inside, they take care of business and then they leave, and so what we find is that, having that place to be can often give them a linkage to care and to support, and what we find is that it improves public order through reductions in public injection, the reduction in publicly discarded syringes. You know why do people discard syringes on the street around a corner? First of all, it's because they've got to inject quickly, but second of all, it's because they don't want to get caught with that syringe when you're, using at a site, you're acquiring the syringe on site, you're using it on site and then you're, discarding it on site and many safer consumption. Spaces engage in outreach activities to do community cleanups in the neighborhoods that they're in because they're the best equipped to to pick up the syringes. They have the proper equipment to do it, and then they also have the facilities to discard them appropriately. What we also do, oh sorry, am I out of time you're out of time. I wanted to wait till that last very to one of those very important points about how it it it'll about public order. Yes, thank you thank you so much sheila and then last but not least, we're going to tiara of the supportive housing network talking about the most important elements in all of this, which is housing and housing and some more housing. Thank you karen. Thank you so much for inviting me here thanks to all of the panelists and everyone that spoke really tough act to follow with the drug policy alliance, but I'll do my best so yeah my name is tiara labrada, I'm the senior policy analyst with the supportive housing network of new york. We are a membership-based policy and advocacy organization. We represent the developers and operators of supportive housing across new york state collectively our members operate about 55 000 units of supportive housing with about 35 000 of those units in new york city alone. You all seem like a very supportive housing friendly community, but I'll just give you a brief background on what supportive housing is. It is permanent, affordable, housing with embedded social services for people exiting the homeless service system or street homelessness. You know there are I want to. I want to go back all the way back to something that council member rivera mentioned with new york, new york, so there's actually three new york, new york models, new york, new york, one two and three, and that was a combination of the city and state working together to develop supportive housing. The network was successful a few years ago and not getting a new york new york four, but getting NYC 1515 and the empire state, supportive housing initiative and collectively that was the governor and the mayor's commitment to developing 35 000 units of supportive housing over the next 15 years. So NYC 1515 is 15 000 units of supportive housing over 15 years empire. State supportive housing initiative is 20 000 units. Over the same time, there are two models of supportive housing and one is a congregate model of supportive housing. So one building different apartments, social services on site case managers on site security, on site maintenance on site, and then there is another model of supportive housing which is called scattered site and to bring it back a little bit to what council member powers discussed with the source of income discrimination. There is some difficulty like passing that legislation is going to be extremely important, statewide and city-wide to ensure that people have vouchers that cover market rent apartments, because that is really another reason that makes it difficult for people to exit out of the homeless shelter system, particularly families with children, because it's hard to find affordable units that will accept the voucher without discrimination yeah. So there's the solution, I think to all of these ills is the development of supportive housing and one of the things that you all as a community can do that. Our council members can help us do that. All of our legislature at the city, state and federal level can help us do, but you particularly, is to help us identify sites within your communities that will allow us to develop supportive housing. The numbers karen that you talked about at the beginning are stark and depressing. You know: 35 000 families in shelter, 55, 000 people in new york city. You know 90 000 people in the state. It's dark! It's heartbreaking and there are you know five eligible people trying to exit the homeless shelter system for each one vacancy in supportive housing. So we just we just don't have enough. We don't have enough development and we aren't really getting the funding that we need to support scattered site development as well. I'm I want to be respectful of everyone's time, and I know that we are a little bit over, but I'm happy to answer any questions, I'm happy to answer any questions that we have but yeah. I think that you know just to wrap it up with a neat little bow as we talk about harm reduction and housing. First, people living with dignity and people feeling empowered. I think the thing that we need to do is really recognize that permanent, supportive housing is the most effective solution. A 95 retention rate housing is healthcare. I'm throwing all of my talking points at you really quickly. Just so, I'm like what another little blurb, here's a blurb housing is healthcare. Here's a blurb, 95 retention rate, here's a blurb, we need more development, but I think that is the most effective solution. I mean that's what we're here to do and I'm happy to answer questions from the community and to help you all. I do want to make one more plug. This is not supportive housing related, but someone did mention what are some resources outside of 9-1-1? That folks can call when there's a mental health emergency so NYC well, 3-1-1. They do have a couple of resources for mental health response. There's the co-response team, there's the he team, the mobile crisis unit, so keep some of those things in mind. If you see things, try to refrain from calling 9-1-1 use new york city well, instead, I think that will help to not traumatize our people that are unsheltered and living on the street and provide you with an additional resource. Great, thank you. Thank you tiara and jara. I know we're kind of running a little late now, because it's such an interesting subject I wanted to just kind of, and anybody can start of the of the panelists of the five panelists. You know if a genie popped out of a bottle and you had one wish what you know or a wish of something to go away. What is it that you? That would just something realistic, though, that you could really need, and we can start with felix. So if I had, if I had the availability of having a genie and only had one wish, I would probably wish for just 100 community engagement. I think with that you can pretty much end homelessness, create accountability and also address any sort of the resources that are lacking. That aren't there right now. I think that all the resources that persons communities are themselves like teachers, you know yoga instructors, therapists, art, therapists or you know, people that can work on resumes life, coaches and whatnot. I think we had 100 community engagement or even like just community engagement like I realized that 100 is idealistic, but if we just had community engagement and actually created accountability attached to the crisis at hand, I think that if everyone was aware of the burden on the taxpayers, we would actually see that it's more cost effective to engage compassionately to arrive at permanent solutions and resolutions. Thank you. Felix lauren, wishlist genie, the genie pops out I'd wish for a genie yeah. I think that, for our clients, that we're seeing and for the population of people that I've served my whole legal career, it's housing, it's sustainable, long-term housing, stability that guarantees also access to services that are holistic and free, and I think that's what we're trying to do at midtown. At least we have the services part down and the community engagement part, but we're missing the technology and housing part of that equation. Thank you, lauren tierra. What is like the biggest I mean. Is it just? Is it funding you know? Can I just actually I'm going to ask you a slightly different question, but obviously funding is a is an issue here, but one of the things that I heard recently was well, it's actually easier to create supportive housing units in wealthier areas, because those units, the cost of those units, could be offset by the higher market rate that the other units you know, other housing could catch. Do you have anything more to say I mean? Is that correct? Whatever that I have heard? Well, the supportive housing model is typically 60, supportive and 40. You know affordable, there's, not really a large company too many developments that have market rate units. We try to maintain that affordability for the community and I don't think that it's the offset it's about finding the sites so when we are trying to develop supportive housing in wealthier communities. You know someone mentioned earlier on the call today about sort of the NIMBY-ism there, so we run up against oftentimes community resistance, so that I think, is one of our main barriers and regardless to what neighborhood you're in developing in new york city is import. Is you know expensive overall, so to answer your genie question? It is funding, but it's also just in making that funding non-competitive. We need. We need a funding stream, and you know our government that's willing to ensure that housing is a human right and an entitlement and not something that we always have to compete with other human resource sectors. For great. Thank you, heather sanitation, stabilization beds. Is I've heard that from breaking ground many times I mean always stabilization beds? I think because it's something that it allows the teams to be able to connect. You know folks, directly to a bed with without having I'd say without having to deal with a lot of the the hoops, because there are so many less hoops when it comes to bringing people into lower threshold types of settings such as safe havens, but yeah I mean the ability to sort of have that immediacy to remove somebody and bring them inside to somewhere safe and where they can get a meal out of bed. And it's you know it's like for now. Let's just focus on that priority and then everything else can kind of come and that's truly the sort of fundamental you know idea behind housing. First, you know it's that same approach, so yeah I mean that that's always one I'll be honest, though I mean, if I had the genie and I was gonna, make one wish I'd wish for a bunch more wishes and a couple of those would be. You know this one probably hasn't been mentioned too much tonight, but the ability, I think, once folks, are in housing and supportive housing in particular to move around from levels of supportive housing in a way that is more flexible than it is now which is like not really not unfortunate, very flexible at all, and I just say that is the kind of looking ahead a little bit. I mean it's something we need now, but it is something that I think as more housing stock comes online, it will continue to be an issue and I think, allowing for some agility around that would not only free up spaces throughout the continuum, but it will allow people to be getting their needs met in the settings where they you know, would be getting the adequate kind of match to support as their needs change and they often age in the community. So that's one thing: what was the other thing honestly? I thought I mean if I'm gonna, if I'm gonna stick with one, then that's sort of it and I think just mostly because it's a little bit different than some of the other things we've talked about today I mean the usual, like. Obviously we always need more supportive housing and more resources. One of the things I would love to sort of see more of in the near future is: are these light touch services and how that looks for folks that maybe are not in as high of a need category as some of the other supportive housing stock? That's out there for folks that are eligible for that. I'd be really curious to kind of see what models that we're looking at doing with those sorts of things. One of the things that we're playing around with now is something called critical time: intervention and exploring that model with our light touch services that we're doing so, just you know, eager and interested to see what the future might hold and where we might be able to do some creative things. Okay and last but not least, sheila too often we try to incentivize change through the carrot, not through the carrot, but through the stick, and I think that one thing that we need to always think about when we support policies or solutions, is to focus on health and wellness and to foster motivation, but to to believe that people want what's best for themselves and their families and that sometimes people need time for those choices and to avoid those stick kind of policies that are punitive, that you know that philosophy that people need to be punished or coerced or forced into doing. What's right before the problem is that oftentimes, the carrots that we have are rotten, and so we try to incentivize people to engage in the existing services that we have and they're flawed they're not grounded in science. It's not what people want they're, not what people need and they're, often at a higher threshold, or ask a lot from people who need to start somewhere, and so I think that kind of continuing to focus on health and wellness and believing that people want what's best for themselves, but they need time and support to get there and that they need options. I'd say that that's just kind of what I'd say and so like de-prioritizing the low-level punitive, you know charges and approaches to drug you know drug charges and other things that are really like small scale. You know you know quality of life, issues that you know criminalizing costs more, but it harms them more. Let's focus on health and wellness and supporting services they're cheaper, they're, more effective. They treat people like humans, they bring dignity into people's lives. Thank you, sheila, and, and now we are going to rich, is going to I'm going to bubble up the questions that have that have come in and I'll start with a couple of practical questions. How much? How much does the city spend to house homeless, new yorkers in these temporary shelter situations, and what else could we be getting for that money if we, if we invested in a better long-term strategy for combating the underlying problems yeah, so I hope I'll be happy to try my best. I don't have dollar figures again, I'm leilani Manhattan boat director for the department of privacy. I don't have dollar figures to share, but I will say that we live in a right to shelter city. A lot of folks don't realize that new york city is a right to shelter city and, with that being the case, there's always funds and money allocated and set aside to accommodate and provide services. Given the fact that the city has a mandate to shelter and house new yorkers in need, so that so that money is already set aside every I would say fiscal year, but I'm sorry, I don't have a dollar amount to share. Can I can I just kind of jump in there for a second, you know when it comes to the temporary shelters. I believe it is 75 percent of the of the regular hotel rate and that money is actually not coming from the city. It's coming from the federal government right now talking about the density reduction hotel sites in particular. Yes, yeah. Is that correct? Am I saying that am I am I at least in a ballpark? Yes, you are okay. Thank you leilani! So that's one another one that I want to ask about is does do. We know anything about the opportunity to use public charitably owned facilities like catholic archdiocese facilities, closed archdiocese facilities for either shelter or temporary housing. There's been, you know. The cardinal has made offers to help according to this questionnaire, but nothing seems to lead to anything. What would the process be to take advantage of that? Well, I mean you're talking about partnerships with houses of worship. Is that your question? Yes, and in particular you know if part of the problem is a lack of physical beds. If we have buildings that are available and being offered, is there? Is there a mechanism for bringing those into the shelter system? That's you excellent question. So we do actually have beds, rested beds and some houses of warships. You do have some churches that do have beds set aside for the homeless population, the street homeless population. The one of the challenges that they face is that there's a lot of restrictions as to who can receive a bed at those particular locations. So, for example, when we think about who's in shelter right when I want to kind of set aside, the two populations have single adults and families with children and adult family homeless population. Primarily we they come off the street and there's a model called safe haven bed models which is more attractive for that population. Just because there's less restrictions and they can come and go as they please and partnerships with several different houses of warships that we have across the city. They have limitations and restrictions, they might say someone can't come in, they cannot come in under the influence or maybe they need to show proof that they have the td shot or they need documentation or id. These are things typically that our street homeless population just does not have they don't walk around with you know card proving that they have tb shots, they may not have a proper identification and heather. Please correct me if I'm wrong, but I believe that there's a lot more there's some challenges than making placements there and so that they can be always low. Another thing is that at church beds they're not monday through friday, 24 hours like sheltering so those beds are made available. A lot of houses of worship do have that made available. It's just challenging for our population. I would say to stay in those beds consistently, just because of many different rules and guidelines that you have to abide by. That doesn't really make it. The most attractive, but they also offer an other surgical side of contemporary shed her emergency center. They, you know the food cookies, that we have partnerships with the city and has employees, but if you know it only, you know okay, that sounds good. Thank you. I have a couple of questions about out street outreach, probably for breaking ground from one of our our community board members. One of them is, can you tell us something about the metrics of the street outreach? How many people? How many cases have you opened, how many people are moved into the shelter? How many refuse? What's the success rate in getting people the services they need and related to that? What are the main reasons why people declined to go into shelters? It's a whole bunch of questions I'll do my best to kind of hit the ones I have the answers to you know for tonight. I think to start with the last question. Typically, what we hear as far as the reason why most individuals on the street do not want to come into shelters, probably not going to be surprised to miss the people on the call they will often report feeling unsafe, and you know I think it's a difficult upper battle in that regard, because I think there have been some strides made in in the shelters and you know, but again, if somebody's experience was five six seven eight ten years ago, they may have had a different experience and that's really left an imprint. So so that is still, I would say, probably most commonly the reason why we hear about folks, you know being reluctant to go into shelter again, though, just to kind of take a step back within the street homeless population. We would, we are largely engaging individuals to bring them inside to other lower threshold settings such as stabilization beds, church beds, potentially safe havens. What leilani spoke about earlier, I'm pretty sure she was referring to this to respite beds, which are connected to drop-in centers, which is sort of a different thing entirely again. All these are resources that fall under the heading of resources, primarily for straight homeless, individuals, so yeah, so we're kind of working on a different approach, separate from the shelter system for the most part, given the population that we're working with in terms of what it can speak to in terms of the one of the stats. But I do know pretty much off top of my head is- is our success when we do bring people into permanent housing, permanent, supportive housing. We're really right in, like the mid to high 90s for the most part in terms of retention of individuals in supportive housing. So I think that's one of the biggest indicators to sort of speak to the success of supportive housing and particularly when the housing providers really function from the framework of housing. First understanding the population that they're working with and really meeting them, where they're at which breaking ground overwhelmingly does and throughout our housing. It's like very critical theme and we've had tremendous success. Thankfully, in our work so yeah somewhere, I would say I want to say, like 95- give or take a couple percentage points either direction in terms of long-term retention in terms of the other stats, that's sort of a broader question- and I don't I didn't come tonight with any of that- spec specifics, but you know we can certainly kind of see if we can flesh out if there's some specific things that folks are curious about. Okay, thank you corinne. I don't know how much time we have, but I have another one. If it's okay with you sure I guess yeah I mean this is all fascinating, so go ahead. One of our community members asked whether it might be possible to put an effort together to deploy some mobile toilet and shower vehicles in new york to provide basic comfort and hygiene services to the large street population. That is, gonna grow, as we have more evictions, no matter what no matter, how much we invest in street support street outreach services. We are going to have a large three population. We're going into winter. Is it? Is it? Would it be possible for a program like that to be brought into the city I'll comment on that? But I know corey johnson's office is working with shower power and they've been having going to different locations in the city. I actually went to midtown because we were thinking about using midtown community courts, backyard courtyard space to set up the showers for a day for actually like a month, but a few times a week and also have a porta potty on site for folks in the neighborhood right now, midtown had a flood about a month ago, and so all of our water is turned off. So we can't operate the shower, but we are trying to figure out that issue, but also figure out alternative spaces where we could operationalize the showers, which would be really wonderful and yeah. I know that there are other organizations that do this right to shower is one of them. I know I tried reaching out to them at some point, but couldn't get through to anyone there, but I'm not sure if anyone else has information and a coalition for the homeless as well has a shower availability. Oh, that's great, that's good to know! Thank you so lauren. So, if I understand correctly, there are units available. It's just that, there's no location for them. You know I might understand that correctly. They are currently operating the shower. I think it's in harlem right now. I don't want to misspeak about it. I can certainly get the information and send it to you karen. If you want to share it and they're trying to find another space for it too, so that they could, you know, put get services into midtown. Perhaps there was one in harlem and we ended up pulling out of it. The showers. I think there isn't I'm sorry the restrooms, the restrooms. There is a need. However, I would say whomever is going to run them just to ensure that this they're really managing and having complete oversight of the bathrooms. The challenge that we ran into in harlem, where we did have porta potties put up. People were using them, not necessarily for restrooms. They were used for other. That was somewhat delicious right for other reasons, yeah. That would be the challenge, but would make sure that whoever that person is will be operating. It is also managing it. Okay, I have two more questions here. One practical question and a one legislative question, the practical question I'll ask first, and that is someone asks about PPE and protective gear for homeless individuals on the street, not to protect other people from them, but to protect them in the vulnerable situations that they find themselves in. What's being done right now, and this might be a breaking ground question- what's being done right now to help make sure that people who are on the streets who want to protect themselves, have the means to do that sure yeah happy to speak. To that we are, and we started very early on in the pandemic, dispensing hand. Sanitizers masks. I think gloves I think, at the at the very beginning. We might be doing gloves less now, but you know the other two items are still doing running strong doing that, where, with anybody that we were engaging and again in the beginning, it was a little bit harder because we, like everybody else, couldn't get our hands on masks so that we've, you know, thankfully been able to do that a little more easily. Now, in the last couple of months so and we're assessing every single person that we're engaging. Oh did I freeze you look frozen, I don't know if I'm frozen and you're not frozen, but okay, rich, which is unfortunate now too so yeah. So can I jump in with oh go ahead? I'm just gonna close that up so yeah we're doing all of it and we're assessing everybody that we engage every time we see them around covered symptoms. Thank you. Thank you and now the beefier question, and this is probably for others on the panel too. What can we do? You know we are we're a community board. We are political activists by charter whose job is to encourage the city and state to take what we think of as responsible policy decisions. What can we do as an as a community and as a neighborhood to encourage both the state and the city to invest more money and more priority in building more supportive housing hi? This is this is tierra at the network. So remember that eshai program I was mentioning before right now we don't have a re-commitment to the next 5 000 units, so at the state level, what we need is the governor and the state to recommit to esha next 5 000 units and at the federal level there's a the 100 billion dollars in rental assistance, that's being proposed with our with our national partners. So you know, I think that, and you know at the city level, there are several things we're all entering this massive economic crisis right now. The revenue shortfalls at the city and state and things that we have to sort of make up for, but one thing that is currently happening at the city, is their they're, taking a little bit of money from the non-profit sector, specifically the human service sector and their admin costs. And so this isn't, like you know, development, but it's ensuring that we have enough funds to support the social services in support of housing and so that that's a huge thing, so the 100 billion dollar in rental assistance at the federal level, the eshai five-year commitment, 5000 unit commitment, moving forward and at the city level, making sure that our human service sector remains whole during the budget shortfall. Thank you, oh rich, you're, muted. Sorry, any other responses to the legislative question from any of the other panelists I would. I was just going to say literally what she said like ditto, I mean it was spot-on. I couldn't have said it better, perfect, well, corrine, we're running toward the end of the time, and I and I want to you know. I have more questions that I can throw at the panel, but I want to know if there's a wrap up question you'd like to propose so that we can get a round of all of the panelists opinions. On top a wrap-up question, I thought your legislative question was such a good one. Already I mean your genie question was good yeah. So what happens? Anybody else have a have. I actually. I have one though okay great I'm gonna, throw in at the current in the current sort of moment of extreme emergency on multiple fronts. What sub-populations of homeless new yorkers do, you think, are most vulnerable and what can we do to make sure that they are? They are provided for at a time when resources are slim. That's a loaded question because our population I mean our street homeless populations, vulnerable single adults, could be a vulnerable population. Our families with children could be in a vulnerable situation. We have domestic violence cases in the system, it's very case by case, and it would be hard, I would say, there's a need across the board on across the board period. It's there's a need. Okay, you know every I appreciate the question, but you know I was in a meeting earlier today on the upper west side and, and that was to converse with the single adult population. I don't know where he went. He was on the call just a few moments ago, the homeless hero he calls himself, but I guess he locked up but yeah. He was here yeah. That was a really empowering meeting to meet with our residents on the upper west side. Because doing this work, it's important to hear from them and hear how they feel and to hear what their needs are. We, as social service providers, can provide what we you know. We will provide services, clinicians caseworkers, all the support we can give an individual. We will, but one of the takeaways from me, which is it seems small, but it's so huge to our clients is just love and compassion from the community goes a long way. So if members in community and community boys has always been so gracious to our shelter sites, I've always, I think, that's him coming back on. I'm not sure. No, it's not, but you know, donations. Just someone came to our sites with loads of you know, scarves hat gloves and our clients just started crying just because many of them, you know don't oftentimes experience, love and compassion so to receive that from community helps. Our clients feel integrated in not just where they are temporarily in shelter, but in society period, and so those types of small acts are huge and goes a long way. So, on top of what can already be provided across, the system will continue to provide supports and services, but that level of care and compassion from community also just feeds not just our clients but even staff, and even me doing this work. It really does go a long way. So that's just some light. I want to pour out there to everyone as another need you're on mute, rich yeah, that the human response is just as important as the legislative response and the financial response. Thank you all right, corrine, I'm gonna bounce it back to you great. Well, I think we're going to wrap it up. Thank you so much. Thank you, lauren! Thank you. Heather tiara sheila leilani felix. Thank you so much all the committee members rich for being my amazing vice chair and asking great question and looking at all the questions, the staff has been amazing. I see cody osterman has been doing rapid answering of questions in the q. A thank you so much. The committee members can stay on so that I can do all the new business. So here we go. If any member of the committee has any older new business, please raise your hand that wasn't me raising my hand. I was just saying thanks and bye. Take care guys have a good evening. Thank you I'll, say bye. Now, yes, we're done. Thank you. Thank you. So much felix! That's fine! Thank you for your share felix. So I need all the new business from. I don't think I can see raised hands from there. I don't see any raised hands. Okay, so jeff has a hand karen who does physical hand jeff, oh hi, jeff physical hand. I just more of a question. I remember that I we were working on this statement of needs. I think later in the year last year, and is there anything more that we need to be working on in the in the in the fall? What's the timing on how karen forgot to turn off her her microphone again, I actually thank you for asking that I I've just kind of been tweaking the existing language together with rich and with rick from budget, but yeah, so we will be voting on that, I believe in October and some of the language she just saw in that statement that I made thank you. Do I see any other hands raised? Let me just check, because I don't okay great now, so then I'm asking for a motion karen. Yes, it's karen. I don't know how to raise my hand on zoom only teams hi karen hi. I thought this was really very informative. It was really great. I was really happy to hear how thoughtful all the panelists were and I'm just a very quick question on. What's our follow-up in terms of today's panel discussion, good question, I mean, I think, the legislative pieces, especially for the city, we can make definitely create a resolution in support of what they were asking for. We were already working on a resolution in support of harm reduction sites. Okay, I wasn't asking you to yeah no yeah you're, but you're yeah. I mean this was this was really kind of you know something as an as just inform everyone and get everybody on the same page with the same stats and the same information. A lot of this. You know I I've been swimming in this for the last. You know two years and I forget that others don't know and in a way having constituents sitting on phone calls with constituents made me realize how much people don't know, and I think that's what this was. So this is really great and I'm unfortunately, I didn't take notes. I was mostly listening, so I guess after the meeting I'll, send an email out and just say, find out how I can follow up with the other speakers or what they're doing or what's our connection with brc and what's our connection with frontpolicy.org and all that kind of just instead of doing it now. So. Thank you. Thank you. Karen abby has her hand raised hi abby hi. I don't know a lot about this, so I'm happy to follow up with you offline, but I think the proposal to identify spikes for supportive housing is really important, and I don't know what this committee has done in the past or what the thought process has been around that, but I think our sort of intimate knowledge of the district. It's really vital, in particular the fact that we're a welcoming district to this type of supporting housing. So I would like to see that process kind of move forward. Yes, I mean one of the things that I keep on thinking about. Is you know these properties that are coming back to the city because a failure to pay taxes and then the city turns around and auctions those off and one of the things that I would hope is that the city would just take those you know, take those properties and turn them. You know not all of them, but at least some of them consider some of them to be turned into supportive housing yeah. I would be interested to see like how other community boards or other stakeholders from her alliance that go about actually identifying those properties, because I think if they can come on our radar, we can do some early intervention there, but yeah. I think it's really important yeah. I agree beatrice, or is that? Oh that's participants? I can't I cannot let b speak if you like hold on one second b. You should be able to unmute yourself now. Maybe it was old. Maybe okay, going once going twice no more raised hands, I'm asking for a motion to adjourn okay, seeing no further business. This meeting is adjourned. Thank.",
            "summary": "So tonight's agenda is one, is a update on temporary housing and services for homeless, new yorkers due to Covid-19 19.\nHave some humor in this during these boring procedural things update on temporary housing and services for homeless, new yorkers due to Covid-19 19, including in the use of temporary hotel sites in cd6.\nAlso mention that a lot of families double up and the estimate of actual homeless students in the public schools in new york go Cd6 is home to four permanent shelters.\nThis effort was previously spearheaded by the NYPD So lines of communication, cb6 and local stakeholders are in constant discussion with DHS temporary shelters, site operations, our partners in city and state government and our neighbors to identify and address both the quality of life concerns that our house residents have and the concerns that are unhoused and street homeless residents.\nWe have heard so many times now that there's some real issues with the lack of available public restrooms Long-Term solution is that we, as a community board, will ask for the city to start funding.\nThere are 60 000 people in our shelter system, over twenty thousand of them children and now a hundred thousand new york city, public school students who live in temporary housing.\nMany of us can feel a bit helpless in being able to aid these individuals in our community, but we're certainly trying I'm sure councilmember powers will mention the harmonia and kind of that groundswell of support.\nI think what new yorkers want to see, which is actual supportive, housing.\nI do have a couple of supportive housing facilities, but not nearly enough, because those wraparound services are so critical to making sure that the chronic homelessness that happens, that recidivism doesn't continue.\nMy office is working with the department of homeland services street outreach, teams, local precincts and service providers to ensure that homeless, new yorkers are connected to life-saving resources.\nWe did that with one of our local facilities, making sure that substance abuse treatment program was actually available on site because some people were, you, know, drinking and smoking in front, and we did receive a couple of concerns from some of our neighbors and certainly an end to discriminatory criminal justice practices that leave people.\nI. Think, what's the best part about this particular building is not only are there truly affordable units at amis at like 60, but there will be units set aside for formerly homeless families so trying to put that into practice and multiple sites in my district and really get those numbers, up, and so I realize again can be kind of frustrating in terms of some of the answers that we get from our city, agencies.\nOf, get to leave there, but still viewed it as really kind of essential to their lives, and it was where many had their doctors, nearby or Some Were had other critical services around there, and it was, What I, would say, is sort of a political game here in the city We're going to be able to continue to provide that as their as their home as long as they need it.\nAlso mention, like think about the public schools in the area or other places where there are families that who are experiencing homelessness and also need whether it's school supplies or could use any other assistance.\nThis is so much have tied into our strategy around housing here in the city and both the ability in areas like ours, which are become more difficult to identify places to build the type of affordable housing that we need in the city to be affordable for folks actually to live in, but also we need to break down some of the exhibitions from the existing barriers to finding housing for those who can- I have a bill: that's about source of income discrimination, which typically represents itself, as if you have a voucher.\nUsing we're trying to basically expand that law here in new york city to give people who have an opportunity to get housing to me to not show up and find out that they can't get housing, whereas they desperately need it.\nI know that these can sometimes become difficult issues in our in any community, but it is, you know, incumbent on us to all try our best here to help our fellow new yorkers and try to find ways to make this a long-term strategy for our city and avoid these sort of big contentious.\n3-1-1 is where you would report it and again you can call our office or your council member's office as well, and we either the community board office or the council member's office would then definitely follow up with any kind of service provider in the area and make sure that something someone is coming out, and this When we're talking about street outreach teams.\nLast and when they're gonna be able to move their people back into their home, And look, I think that for a lot for the city, the aspiration is to eventually get back into the shelters which are really places intended to be centralized.\nThe city continues to invest in costly, temporary solutions, while under investing in long-term systemic solutions, the structural shortage of affordable housing, the under supply of supportive housing and social support services and the urgent relocations for health and safety reasons forced by the covent emergency taken together.\nFirst, just to kind of talk a little bit about the portfolio that I ever see and in terms of the different programs I street to home Manhattan, which is the outreach provider for midtown.\nI, also oversee two senior supportive housing residents in Brooklyn for homeless and low-income seniors, and then I also have a portfolio of programs that involves fee-for-service contracted programs, primarily outreach at this point, so we're working with macy's and grand central partnership in that capacity.\nWe are calling it light touch services, I'm, not sure, if that's the official title, but where we will work with individuals and families for generally the duration of about a year, just to ensure that they have the support and resources that they need really to be able to sustain their housing at such time that we would step back out of the picture.\nThat's sort of the overview of the things that are in my portfolio, which I really love, because it's a nice, diverse range of resources and programs, souped nuts, from individuals on the street, to you know being housed in a variety of different settings.\nThe city did not provide wrap-around services, nor did they provide on-site on security, and for that reason my quality of life was being challenged, and I actually was a housing specialist, so I had, I understood the difficulty in placing people, while my building was a shelter, Sort of like you know like inception kind of situation, and that just goes to show that it takes a community.\nI mean we had hundreds of bags of food and within an hour everything was gone, and If that's not telling you what kind of situation people are in right now, And I think that's what midtown community court does I'm really grateful for the social workers that we have and what they've been able to do remotely for so long in an impossible situation and maintaining contact with folks to try and prevent people from overdosing?.\nThis has been an inc we've seen an increase in anxiety, depression, people who were formerly clients of midtown community court who had finished their mandates were reaching out to our clinical folks to re-engage with services voluntarily because they felt like they were isolated and needed to have support.\nSo people don't have to continue to get rearrested for petty crimes, and you know we're also trying to figure out a way to connect with supportive housing for folks who would be able to participate in this program.\nWe're calling it tentatively the midtown rapid engagement program, and so if we can provide the peer navigator, the social worker, housing phones to folks, we create a dynamic in which they can become successful and we have to create a web of services to make that happen in our community.\nSo I'm, going to talk a little bit about safer consumption spaces and the need for people who use drugs to be kept safe and alive in the midst of this pandemic, but also just to acknowledge that we remain in an overdose crisis that never really went away.\nSo having access to a space like this, where there are folks on hand and on staff who can monitor, you can help provide the safer context that people need and what we know is that not only do they reduce overdose deaths on site where the consumption occurs, they also have a ripple effect of reducing overdose, deaths.\nRates, studies of safer consumption spaces across the world have shown that new people do not come to these sites to start injecting drugs.\nAny, sort of drug-related offenses, trafficking, assault or robbery rates in these communities, because again, when people have a safe space to go, they go inside, they take care of business So what we find is that, having that place to be can often give them a linkage to care and to support, and what we find is that it improves public order through reductions in public injection.\nCollectively our members operate about 55 000 units of supportive housing with about 35 000 of those units in new york, city alone.\nSo there's actually three new york, new york, models, new york, new york, one two and three, and that was a combination of the city and state working together to develop supportive housing.\nSo one building, different apartments, social services on site case managers on site, security, on site maintenance on site, and then there is another model of supportive housing which is called scattered site and to bring it back a little bit to what council member powers discussed with the source of income.\nThere is some difficulty like passing that legislation is going to be extremely important, statewide and city-wide to ensure that people have vouchers that cover market rent apartments, because that is really another reason that makes it difficult for people to exit out of the homeless, shelter system, particularly families with children, because it's hard to find affordable units that will accept the voucher without discrimination.\nAll of our legislature at the city, state and federal level can help us do, but you particularly, is to help us identify sites within your communities that will allow us to develop supportive, housing.\nYou, know, 35 000 families in shelter, 55, 000 people in new york, city.\nIt's heartbreaking, and there are you- know five eligible people trying to exit the homeless shelter system for each one vacancy in supportive, housing.\nYou see things, try to refrain from calling 9-1-1 use new york city, Well, instead, I, think that will help to not traumatize our people that are unsheltered and living on the street and provide you with an additional resource.\nAs more housing stock comes online, it will continue to be an issue And I think, allowing for some agility around that would not only free up spaces throughout the continuum, but it will allow people to be getting their needs met in the settings where they you know, would be getting the adequate kind of match to support as their needs change and they often age in the community.\nDoes the city spend to house homeless, new yorkers in these temporary shelter situations?\nA lot of folks don't realize that new york city is a right to shelter, city and, with that being the case, there's, always funds and money allocated and set aside to accommodate and provide services.\nThe fact that the city has a mandate to shelter and house new yorkers in need, so that so that money is already set aside.\nI would say, probably most commonly the reason why we hear about folks, you know being reluctant to go into shelter, again, though, just to kind of take a step back within the street homeless, population.\nThankfully, in our work, so One of our community members asked whether it might be possible to put an effort together to deploy some mobile toilet and shower vehicles in new york to provide basic comfort and hygiene services to the large street population."
        }
    }
}