{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB10",
            "channelId": "https://www.youtube.com/channel/UC6zGgrJcTcwy3GKc439DzAg",
            "title": "Top chat replay",
            "publishDate": "2020-10-20",
            "shortDescription": "",
            "lengthSeconds": "1:09:35"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB10",
            "normalizedName": "Brooklyn Community Board 10",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "iEj7eFUMKns",
            "fillerWordCount": {
                "uh": 130,
                "um": 158
            },
            "readTimeFullTranscript": "42 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "report": 16,
                "corner": 16,
                "street": 14,
                "budget": 13,
                "library": 13,
                "libraries": 12,
                "evening": 11,
                "lots": 11,
                "month": 11,
                "capital": 11
            },
            "wordCountSummary": {
                "voting": 5,
                "information": 5,
                "schools": 4,
                "place": 3,
                "street": 3,
                "businesses": 3,
                "report": 3,
                "budget": 3,
                "food": 3,
                "19th": 2
            },
            "fullTranscript": "Oh, I see that we are now streaming live on youtube. Are we ready Joe? We ready Dorothy we're ready, okay, terrific! Thank you very much, okay, so we're going to start. Thank you. Everyone community board, 10 Brooklyn, general meeting, October 19th 2020 via zoom and we are live via youtube streaming. I'd like to start the meeting as we do every meeting with the pledge of allegiance. I do not know if we have a graphic. Do we have a graphic? I have a flag behind me, so I'm going to step out of the way. Oh there you go. Okay, so Josephine's got the flag there behind her. So we'll start we're going here, I'm holding the flag. Can you see it? I pledge allegiance Liberty. Thank you. Thank you and now I would like to call for an adoption of the agenda. Joe. Okay, we got Joe Sakowski. Who else do I somebody throw a second all right, Julie thumb for a second and now adoption of the minutes of the September 21st 2020? Oh good. I call for an adoption of the minutes. Oh come on! That's Judith here! Thank you Judy and a second hello. Second, thank you Anthony Gloria, you are, did you pay everyone? Whoever is not speaking kindly put yourself on you so that we do not hear your background noise and now I'd like to open up the public session. This is limited to a maximum of 10 minutes. We're shooting for so. Please bear that in mind speakers, the first person I would like to acknowledge. Do we have here with Us councilman Justin Brennan Hey, guys, hey Justin, how's everybody doing thanks for having me a couple of things going on so first early voting starts this Saturday October 24th. I just posted some information on social media channels for most of us in Bay Ridge, the early voting site is going to be Fort, Hamilton, High School, but there's all sorts of links and stuff that I can send out to folks and maybe Josephine can send to just so. You can confirm your polling place. If you have not already voted by mail, then you have the opportunity of voting early and that starts on Saturday, but the polling place is likely going to be different from where your normal polling place is obviously wanted to mention the incident that happened on Thursday, where we had an unfortunate and horrific attempted sexual assault of a senior on 94th street near Marine Avenue, the the NYPD made a very swift arrest and the suspect is now being held on two hundred thousand dollars. Bail do not think he's getting out anytime soon and I'm working very closely with a local 6a precinct as well as I had a meeting last two weeks ago with police commissioner Shea and I requested additional patrols in the area. You know. Bay, Ridge and dyker heights are still by far two of the safest neighborhoods in the entire city of New York. But I understand that recent events certainly have folks concerned and me included, and I also understand that, regardless of what the statistics say, more of a police presence will certainly make people feel safer. So we are all. My partners in government are working on that. I will say that our local precincts have not lost a single cop to budget cuts. In fact, we actually have more officers now in the 6- 8 precinct than we did just two years ago when I got into office. So I think we started in 2018. We had about 97 cops, total uniformed cops now we're up to 150 uniformed cops and the 6a precinct, so there's been no cuts made to heedcount there, our local cops and our detectives are still out there doing a great job and making swift arrests, and you know we continue to work closely with the district attorney's office and with our partners in law enforcement here to make sure that everybody's safe, I mean public safety is always going to be my number one priority. Everything else comes second to that, so so I just wanted to pop by and say hello make sure that you knew that we're on top of this and working closely with our local cops to keep us safe, and I will send out the information about the early voting just so, if folks can have some time to plan when they want to get out there and vote if they had any trouble with their absentee ballots and whatnot. My office is always happy to help too, so I do not want to take up too much more time. Thank you so much for having me chair and I look forward to a good meeting tonight. Thank you. Thank you. Thank you very much councilman and we have Assemblywoman Matilde Frontis with us, hello, everyone, hello, so happy to see all of you hi welcome friendly. It's been a while it's been a while sorry that I got to the tail end of what justin was saying, but I just want to welcome everyone and say hello. I wonder if jake goldfinger from my office is here he is great. So if I forget anything, he will certainly add to whatever I said: if that's okay but first of all, I want to make sure that everyone knows. I heard the councilman mentioned the words early voting. That was on my list of things to mention tonight. Everyone here should know that you do not have to stand on a long line on November 3rd. Our early voting starts on Saturday October 24th, until November 1st, if you're in Bay, Ridge, there's only one location for you and that's the Fort Hamilton High School, so be sure that you have that hung up on your refrigerator and spread the word I wanted to thank everyone for working really hard with defenses this year. My office was on the ground. We were working with the official census 2020. we did not do too bad. Our numbers were a little bit better than last time around. I know some people might be disappointed and that they were probably hoping that we did close to 100, but that just was not possible. It says here that New York City had a rate of 61.8. It's a little bit better than the national average. You know it's better than what we did in 2010, so I wanted to congratulate everyone for working really hard and we were on the ground making sure that people filled out their forms just to say a little bit about what's going on with Covid-19, I'm sure that you all know that we have to continue to take this seriously. Now here in southern Brooklyn, we have a number of southern Brooklyn communities where the rate is actually rising and at an alarming rate, and we want to pay attention to that. Gravesend is one of the neighborhoods I represent. We have sheepshead Bay, which is nearby not in my district they're, also not doing very well in Bay Ridge we're okay, we're kind of in the yellow zone, but I do want to say guys every time I come out to Bay Ridge, I see people walking around without mask on. I do not know why that's the case, but we all have to be our brothers and sisters keepers. So we need to remind everyone to please be safe and keep their mouths. We've been getting a lot of reports about people, speeding, drag racing, which I see with my own eyes. Every time I'm out there. We want to remind people to drive slave safely to slow down and to stop drag racing in the community. It's something that we talk about all the time. I want to stop here and not continue in case. If anyone has any questions for me, but everybody here tonight should know that we moved about two months ago, so you have not been to my office right now on 93rd street right off, Third Avenue, literally acrosss the street from the Prince hotel, and we have a mask and hand sanitizer distribution this week we're going to release the flyer tomorrow, but it's this Thursday at three o'clock in front of my Bay Ridge office, I'm just going to pull up the information for everybody. Let's see here, oh I lied it's this Thursday from four to five in front of our Bay Ridge Office and we'll share the flyer on social media. We have thousands and I mean it, thousands of masks to give away and hundreds of hand sanitizers for everyone. So I hope that you'll take advantage of that any questions. Okay, thank you very much and now we have state Senator, Andrew, Gonardis, hey everyone! Sorry, I'm a few minutes late to hop on hope. Everyone is doing. Well. Can everyone hear me this funny one there we go yeah, okay, great! You know, even after seven months in sometimes you can't figure this out. Right. Surprisingly, so really, I know matilde covered a lot of ground when I hopped on. We all know that we're going through a bit of a spike right now in southern Brooklyn, about half of my district is in a red or orange zone, which is obviously concerning we've seen some good downward trajectory of those numbers, but still not enough. You know this has caused a lot of confusion and a lot of anxiety and consternation about businesses and especially schools, because there are a number of schools which are in the yellow zone which remain closed, even though they are otherwise permissible to be open, really trying to push the governor's office to release a reopening strategy for these schools and for the businesses. Frankly, that are no longer in the hot zone, because I know that any further delay on this is going to be very problematic for families for business owners for kids, especially just for everyone. So I know we all want to get back to normal as quickly as we can. We want to follow the science and the guidelines, but it really has to be done in a way that makes sense and it's transparent, and that does not seem to be inconsistent, which right now, I'm of the view. You know some of the restrictions do appear to be a bit inconsistent, so we're going to keep pushing for answers on that. The other kind of quick update I'll mention. I think it's relevant to some of the things that we saw happen this weekend in the neighborhood. You know about three or four weeks ago I put out a bill to try to crack down on these illegal off- market mufflers. We call it the sleep bill, because I know we all lose sleep every time these jerks go on with their mufflers and they're. Just trying to you know, disrupt the neighborhood and just be really obnoxious about it. You know the ones that sound like jet engines, the ones that sound like shotguns, the one that sounds the ones that sound like ar-15s, that are all illegal they're all illegal and they have no business being on a car whatsoever. The fines for those are 150, which is nothing. There are parking pickets that are more expensive than that, and I would argue that these are a lot worse than being parked in the wrong space. So we I put together a bill to raise that fine to a thousand dollars and to also try to make the enforcement against those illegal mufflers a bit more objective than they've historically been, and something that I hope that we can do once we get back to Albany, hopefully in November. If not, you know, God willing, I get to push the bill again. Next January, if I'm re- elected. So I know it's been a big quality of life concern for many people. I hear myself, we all hear it. It's not just the highways. It's the neighborhoods, it's the streets. It's all! Acrosss, the city, a number of people have called or emailed my office about this since the build came out has been through the charts. So I know this is a significant quality of life concern that people are frustrated by and there's just no reason for it whatsoever. So hopefully we'll have some good news for your report on that and I'll stop there, because I know you have a full agenda. I got the email from Dorothy this morning saying it's a full agenda and so I'll stop there. If it answers any questions, I'll turn it back to you Lord. Thank you very much and now I would like to welcome Colonel Craig Martin from the Fort Hamilton Army Base. Okay, can everybody hear me? Yes, okay, good evening to everyone, and I just want to thank Community, Board, 10 and all its members for this invitation to quickly introduce myself, I'm the new commander for Fort Hamilton, along with command Star major Mccabe. We assume Command of Fort Hamilton this summer in back in July, obviously with Covid-19. Many people did not get to come to that ceremony and I apologize for that. But I've been lucky enough to get out and meet a number of our leaders, and I appreciate your gracious time to spend with myself and our team here at the post. Nothing's changed for us. We continue to do what we do every day, which is take care of our soldiers and their families, as well as a number of our other service members from other parts of the military. As we have everyone here on Fort Hamilton, our mission has not changed and I would just say with regard to that. I just have one quick announcement, which is at the end of this week from the 22nd to the 24th, we're going to hold a retiree appreciation week now. Normally the post does a specific day where we invite a number of our retirees from acrosss New York to come on post, but due to Covid-19, that's going to be a little bit more difficult. So the great staff here in the leadership has worked hard to record a number of videos and create a number of information points that will be located on the Us Army Garrison, our Usag Fort Hamilton Facebook page, as well as our youtube channel, and we've posted a number of videos with information from acrosss the directorates on the post that speak to what what we can do to help support our retirees and so that will be up and going beginning on the 22nd. We will have some live. Facebook live events as well and then on the 24th px, and the commentary will also from 10 in the morning until two in the afternoon. We'll have some particular events and host our retirees with some tables with lots of information for them. So we invite them out from 10 to 2 on Saturday the 24th. We will have some of the set outsider in our lobby so that we can ensure that we enforce proper cobit 19 mitigating standards. So we want to make sure everyone continues to wear masks and social distances. But we want to make sure we do not forget how important our retirees are and that they are service members for life and so we'll host that this weekend again, it's my pleasure to serve our army and to serve our nation and I'm learning how to be a proud new yorker and we get out as much as we can. I know there's Covid-19 going on, but this is a great city and we're my family is really enjoying our time here. So thank you for inviting me to have a few words this evening with everyone, and I wish you all the best have a good night. Thank you. Thank you very much and we thank you for your service. Yes, I want to draw a question: did not we ever finish the updated version for the military, coupon booklet? Yes, we did and we handed it over to the army garrison about a month or so ago, and it looks great. Thank you. Thank you. Okay and now I would like to acknowledge Kathy San Pietro from Assembly woman, Nicole Malliotakis's office Kathy. Would you like to say a few words you're very still pleased. Can you hear me, unfortunately, you hear me: did I mute myself? No, I hear you, okay hi. How is everybody the assembly woman sends her regards and her regrets and not be able to be part of the meeting tonight, I'd just like everybody to know that we did. Finally, after six months of having it open our new office at 7716, Third Avenue, I'm there Monday, wednesdays and fridays from nineteen, it's very low yeah, I'm sorry Kathy! If you can speak up a little more, some of the members are saying that they can't really hear you very well. Is this better slightly? Okay I'll try to speak a little louder, that's good! Thank you. We were able to open our office at 77:16, Third Avenue, I'm there Monday, Wednesday and Fridays from nine to five. The number I can put in the chats. I do not so people do not have to write it down now, please come by. We have mass. We have sanitary items to help you with, and I just want to tell everybody be safe, and I look forward to hearing the rest of the meeting and thank you thank you very much, and now we have with us nancy lulu from the Brooklyn district attorney's office good evening. Everyone hope everyone's doing well. My name is nancy lulu from the Brooklyn beads office. I bring with me this evening. Greetings on behalf of District Attorney Eric Gonzalez to each and every one of you just a couple of announcements. We've had numerous and we continue to have food and PPE distributions. Last week we October 15th. We had a distribution in crown heights at Saint, Mark's day school, where we provided groceries and other resources to individuals in need. Also, this upcoming this on Wednesday October 27th D.A Eric Gonzalez, will be hosting a food distribution event with Coney Island Gospel Assembly at surfside Garden Community center at 2947, West Street. The distribution will start at four at a first, come first serve first serve while supply lasts, face coverings and social distancing will be required on Friday October, 9th D.A Gonzal, the district attorney's office celebrated hispanic heritage month. This year's theme was community champion where we virtually showcased the contributions of members of the hispanic community by honoring them for their community service. We had three Honorees Dr Francis Lucerna Co-, founder and executive director of Puente Sister Anna Martinez, the Lucca founder and executive director of sure we can and officer Edgar santano from psa1. If you have not me in the virtual event, you could view it on our social media platforms. Also, since October is national domestic violence awareness month and there has been an uptick in domestic violence cases during those difficult times. If you know anybody who might be vulnerable during those crisis, I encourage you to check in with them and let them know that help remains available. At the Brooklyn Da's office. We offer a wide array of supportive services for those experiencing violence in their homes. I wanted to give out the domestic violence bureau's phone number at the Da's office. It is zero 718-, 250- 3300. Finally, if an individual would like to address a matter or to fill out a complaint, please feel free to reach out to the Brooklyn Da's action center at 718- 2500 and I could be reached at Lulun Brooklynda.Org. Thank you so much to Community board 10 for having me this evening. I also want to thank everyone for their leadership and partnership and be well and be safe. Thank you. Thank you. Thank you very much and I believe we have a member of the public who signed up to speak. Judith crates. Yes, hello. How are you hi? I work as a bartender server for pc bar and grill in B, Ridge on for 73rd and 5th for five years. What about main concerns working in the bar restaurant industry has always been to ensure the safety of our patrons and, of course, now, with everything going on it's core that we do that, you know the circumstance stances are not exactly ideal, but you know we work with what we have. This brings me to two key points that we need addressed: the first being driving motorized scooters and riding bicycles on the sidewalk. There were many times we were almost hit by both while walking out of our bar and trying to walk to our customers to serve them. We have to look both ways as if we're crossing a street, not for the pedestrians because of this we're not safe. The second point that I wanted to bring up real, quick. Our customers have raised a concern and we agree with them about the speeding cars that was mentioned earlier on the avenue. Not only are they racing, but they have made their mufflers to make a loud, popping, sound and, along with that, they're blaring their music. When they race past our porch, they will also sit directly acrosss the street from our bar and do this as well as sit next to the porch and read their engines to blow exhaust fumes onto our patrons the racing cars and the noises scare, our customers and honestly, they want to risk it. They do not want to come to our establishment because of it would help if the community could grasp that we are all in this together and we should work together to make a safer environment for all of us. I asked for the support of the community and support local businesses and to ensure the safety of our neighbors through this I'm sure we could get through this difficult time together and perhaps even thrive. So thank you very much for your time. Thank you very much and thank you for raising these issues. You know we are aware of the racing cars and it continues to be a problem. Although the mufflers are starting to become a bigger problem and we've had problems with the motorized bicycles you know before, but hopefully we can reach out and I believe we have the 68th precinct representatives here this evening officer panapinto. I think and frankie everyone's both done. Okay, so they they're here they've heard you, and hopefully you know they can look into this and possibly take some enforcement steps and hopefully, Senator Gonardis will be able to get us some relief with some legislation and Joe do we have anyone else signed up for the public session? No, I do not have dorothy anyone else that you I have my hand up. I do not know if you saw it. Oh, I did not see it. I'm sorry go ahead, yeah. So, regarding the speeding, the mufflers, all the things that have been brought up regarding motor vehicles, this situation has gotten exponentially worse over the last year to two years. It's now from two or three areas in the community: it's throughout the community. It happens almost 24 7.. So not only do we still have. It is much worse than it's been. I do not know what kind of enforcement has been whatever it is. We're expecting you to give your report if you're not going to be able to do it. Thank you, dean. I'm sorry! I could not I'm sorry. I had to meet Dorothy. She took a call. I'm sorry. I apologize for that. I did not. I did not hear it okay, so I believe that ends the public session and we're ready to move on to the public hearing. We have our capital and expense budget priorities and the executive committee met and we went over it so in the matter of prioritizing the capital and expense budget priorities for fiscal year, 2022 in October community boards have the opportunity to submit capital and expense priorities for their respective community districts. Every year we review and submit a list of budget priorities to the mayor's Office of Management and budget and OMB, looks it over and sends requests to the respective agencies. The executive committee reviewed the board's budget priorities carefully. These were, they were sent out to everyone via email. We will begin with a motion to dispense with the reading of the priority list, we're talking about our capital list, which has the titles highlighted in Blue. So I call for a motion to dispense the reading I'll make that motion Dean. Thank you dean in a second I'll second, that thank you Dan. So then, all in favor we can do a hands up. Okay looks unanimous to me: okay, is there anybody now we need to do you? Have everybody or there is there anybody on a phone, a landline or anything, that's Joe, that's Joe! Sokolowski! Are you in favor or against, or something else in favor? Thank you, okay. Is that everybody josephine no item, I'm in favor. Thank you. Let me see you just want. Wanna double check make sure we did not miss anyone. I think that is it okay. So I'd like to open the discussion, there may be amendments to our priorities but, as I said, those were those were sent out. Does anyone have any comment on the list? Any? I do not see anybody. No, I see shaking heads, I see a hands up from doris and from Jane Marie. Oh no. My mind was up before mine, okay and Jane. Last time we had voted that way by indicating the raised hands. So that's what I okay great automatically. Thank you now everyone's came down, but yours was still up for some reason. All right. Thank you. Okay, so I do not see anyone any discussion, so I'm going to call for a motion to adopt the fiscal year 2022 capital budget priorities, as recommended by the executive committee. I do Joe I mean I do. Thank you and I'll. Thank you. I do I thank you. Thank you Steve. I think Steve Harrison. Thank you for a second. So all in favor aye. All right. Do you want to you, could do your hands up? Okay, I see everyone's hand raised Ida and Joe. How do you vote yes? Great? Do you have Barbara Germac there? I do not see her. Do you have a raised hand feature? Maybe all right josephine? Are we good we're good, Larry stilter just joined us, so he's the only person I do not have. Okay, we're good, okay, so, and so the motion carries thank you and now I'd like to turn to the expense budget priorities for first year 2022.. These are the ones that were in yellow, and I know that the executive committee reviewed the list and call I call for a motion to accept the recommendation of the committee. I do Joe. Thank you. Joe and I'll second, oh thank you sandy, so I have a second I'm opening this up to discussions. Does anyone have any comments? Questions? Let me see Steve, are you raising your hand or are you just fixing your camera? I think he's just fixing his camera. I see a hands up from Barbara. Is that to vote? Yes, Barbara Gurmak, Barbara, Refusal, okay, we're not voting yet okay, so I'm going to call the question all in favor, aye hand up or yep, okay, how you doing Josephine I like the thumbs up, got everyone except for habib. I see you now too, very good, except for Larry Stelter Larry, Ricky, Larry, recused, okay, Ida. Yes, I so suck yes, okay, great! Thank you all! Okay, and I thank you very much, and so the motion carries so that concludes our pub our public hearing. Thank you very much. That was relatively painless. Everyone and now for the chairs report. Sorry, I'm going to try to keep it short this evening so good evening. Everyone and thank you for joining us tonight. We have transitioned into our virtual meetings with some minor bumps along the way, but it has not gotten in the way of the board's business. I'm happy to say I thank our very capable district office staff for this. We have, we have been and will be in the coming months very busy. I have to take a moment to thank Doris Cruz, our zoning and land Use committee chair. She has done a great deal of work and we'll have a packed agenda in the upcoming month, so I just want to take this opportunity to recognize her efforts and express my gratitude for her work and her willingness. I'd also like to say thank you to our executive committee for its work on the capital and budget priorities that we voted on, and I would like to thank you all who generously volunteer your time every month. I know a lot of people do not really realize when they come to these meetings. We are volunteers, we are not paid, maybe some would say gluttons for punishment. I do not know this month. Board chairs and the district managers were briefed on the Covid-19 hot spots. In the city we have heard of the possibility of a covered 19 second wave, as we move more toward inclement weather and have heard about infection rates increasing in our neighboring districts. This was from the this briefing was by the mayor's office and wearing masks, and avoiding large gatherings remains the recommended course of action. I urge everyone to continue to be cautious. Your masks, it's a very small inconvenience, regardless of your individual views on the matter. It's the law and it's the neighborly thing to do. We see cities in Europe returning to curfews and other restrictive measures, and we should heed those cautionary tales. I know it's hard to get used to nearly every time I walk out of my house. I forget my mask, I curse mildly under my breath and go back in the house and get my mask, and I understand that this is a nuisance. But please wear your mask, remind your friends and loved ones to wear their masks, no matter how you feel about it can't hurt to do it so, please, let's all just do it. The election will be occurring between now and next month's meeting. So, if you're unsure how or where to vote, you can go to vote NYC website or you can reach out to the Community Board District Office and they can direct you and that's it. I wish you all a happy and safe Halloween and I urge you to celebrate responsibly and that's it for respectfully submitted lori Willis. The next item on the agenda is the district manager's report from Josephine Beckman Great. Thank you lori. So the district office has been very busy this month preparing for the fiscal year 2022 budget. Over the past month, I attended several budget consultation meetings with agencies of the city of New York to discuss overall budgetary needs, which were reflected in our priority list that were voted upon tonight. We are being asked to spread the word from the department of sanitation. As we approach leaf season, I'm going to encourage all residents to pitch in and help by sweeping and raking leaves and bagging them. We have lots of trees in Bay Ridge, so this is an important job resurfacing. As you know, milling and resurfacing is taking place right now in community district 10.. This week on, the schedule is third avenue, which is happening at night time from 90th street to shore Road 10Th Avenue from 77th street to 86Th Street 86 from four to Fort, Hamilton 77Th from 12th to 14th and 11th Avenue from Irvington to Bay, Ridge Parkway. So that's the Good News, but I know it's an inconvenience at times the also wants to share with you that last week I was invited to attend a call with the department of Transportation regarding the expansion of CitiBike phase 3, which will take place through 2024. there's only a handful of blocks, unfortunately, at the northern part of community district 10. That is included in this phase. But nonetheless, D.O.T did reach out to us to share the news and asked me to send out a link that is going to be available to anyone who would like to offer a suggestion about where a CitiBike station could be placed so I'll, be sending that out to all of you tomorrow, where you'll be able to see the map. That only includes a handful of blocks, I think only four or five within board 10 in the northern section, starting today, October 19th. I wanted to share with board members that New York state's plastic ban and paper bag fee will begin. We've gotten some questions and department of sanitation is going to be sending us some more bags to distribute for those in need. I also wanted to share that the tribal Bridge and tunnel authority. As many of you also know, the Verrazano Narrative Bridge has two improvement projects, some of which that's taking place on the overnight. So the homeowners that live in the area near the Verrazano Bridge have been impacted and that night work will continue for the next few weeks, but hopefully because they were able to accomplish so much. You know during the time where Covid-19 allowed them to work more hours in the day and evening they're a little bit ahead of schedule, but they will be doing night work for the next two weeks and, finally, I just want to share with board members, as has been our tradition and since we're not meeting in person, the board will be collecting food and loving memory of our late community board. 10 member Helen Sokolowski, whose Son Joe is a current member of CB10 Helen, was a staunch advocate, dedicated volunteer and very passionate about the need to collect food for local families in need. So this year non- perishable food donations can be delivered directly to St Patrick's rectory at 9511 4Th Avenue Monday, through Friday from 9:00, am to 5 pm. Monetary donations are also accepted by the food pantry if you are able to- and we just want to thank St Vincent to Paul on their resource to this district office and to the community board for their work at the food pantry and for St Patrick's church for continued distribution of thanksgiving food baskets. Our next General Board meeting will take place on Monday November 16th via zoom, and I'm also going to be sharing the early voting information via our newsletter, as well as an email to board members this week. So please look out for that. Email respectfully submitted. Thank you. Thank you, Josephine and now it's time for our treasurer's report. But I do not. Where is Shirley Shirley's? Not here, I'm sorry, okay, so who's reading our report, I guess I will all right Dorothy go for it. Okay, Community board, 10 treasures, treasurer's report, as of September 30th, 2020, total personal services, 52, two hundred twenty three dollars and twenty seven cents total other than personal services, two thousand seventy seven dollars and two cents leaving an unencumbered budget balance of one hundred. Ninety nine thousand four hundred ninety four dollars and 71 cents respectfully submit it Shirley Chin. Thank you. Dorothy you're welcome. Okay, and now we are on to the committee reports and so Doris Cruz oh morning and last good evening, everyone, the zoning and land Use Committee met in Quorum via zoom on Thursday October 15th. We met to review a rezoning application for 9115 fifth Avenue and adjacent lots. You'll proceed, you look the their eulip reference number, one: nine, zero, four, seven zmk and one nine zero four eight z mk. If this address seems familiar, it is because the committee heard an informal report on the proposed rezoning and it was reported at the February 26 2020 general meeting due to the Covid-19 pandemic. Europe universal land use review procedure was suspended, Europe has now resumed and we have a certified application before us. In normal times the committee would meet and vote, then a public hearing would be held at the general meeting. Meetings are still a little new, so it was decided to have an informational meeting for the committee, which was also live streamed and is available on Youtube District Office did a mailing of over 2500 residents and businesses in the immediate area. Local residents were made aware of the informal meeting and the youtube link the informational meeting that in falls a follow- up meeting, including participation by the general public, will be held on October 29 2020.. This site is zoned ca2. There is a triangle bounded approximately by 5Th Avenue and 4Th Avenue from 87th street to 94th street. The predominant uses in this commercial area are car dealerships, service, centers, Office, building and a growing number of professional offices. This area has had a c8 or similar rezoning, similar zoning designation since the 1978 rezoning and the creation of the Bay Ridge special district, one of the permitted uses in the ca2 zoning district is transient housing, a hotel. The developer filed plans in 2019 for a hotel. It was strongly positioned for a hotel, especially acrosss, the street, from a school and because too many hotels in Brooklyn have been converted to homeless Shelters Council member Brandon met with the developer and as a result of those discussion, the developer agreed to a residential development with the commercial overlay. Here he is requesting that the location be rezoned from ca2 to R7A. An R7 designation allows for a seven- story. Building in 2016, the mandatory inclusionary housing program was enacted. This program requires that any resulting rezoning include affordable housing. This is a zoning bonus. The bonus results in between 25 and 30, affordable housing and to accommodate the affordable housing additional stories additional height is allowed. Therefore, this rezoning will result in a nine story: building with approximately 50 units, a mix of studios, one bedroom and two bedroom units. As a February meeting, the committee felt that they were between a rock and a hard place. The committee did not feel that a hotel was appropriate or needed, but they did not did not like the extra height in reviewing the plans. This month, it was noted that there are setbacks and affordable housing is important. The developer is asking for several lots to be resolved. The reason for this is that resulting for one lot is considered spot zoning and does not allow the developer advised owners of nearby lots of the rezoning, but has not been in personal contact with her. So that's the background. Council member addressed the committee and gave them some background much of what I've already said, but he also noted that about use about a sale to the school construction authority. However, the school construction Authority said the site was too small: the Richard Labelle. The attorney for the developer noted that this area is geared toward intense, intensive large conversion commercial development and could result in a robust commercial building. He noted that other building lots included in the rezoning app location are non- conforming residential or mixed commercial residential uses. They were built and are used as they were before any rezoning was done in 1978 and later. He also advised that he told us that the building will have 54 units, 41 will be market rate and 13 will be affording affordable. There will be a setback as a seventh story. He noted that other buildings in the area, especially on fourth avenue side, are 60 feet or more at six stories. The first floor will be commercial, possibly local, retail stores. It will also be a one- story. Addition for commercial use at the rear of the building extending to 92nd street. I'm sorry, it's a very weird shaped lie. The committee asked how many parking spaces were included in the proposal. Mr Lavell said no 14 spaces would be required. However, if a development calls for fewer than 15 parking spaces, the parking requirement may be waived and they have waived the requirement. The development will be retailed, not condos or co- op set down. A member asked about the other nine lots. Michael Labelle said other lots were included at the request of the City Department of City planning, and the Eis includes all lots. It should be noted that, although there are nine other lots, it can be the committee or the Community Board and the council can ask that some lots be removed. Questions were asked about the design and retail use. The commercial overlay of C4 is consistent, considered retail Mr global advised questions were asked for design and hope that the building would be contextual with nearby buildings, and he said the design would be part of future discussions. There will be two elevators two elevators. The committee asked about notification to other owners. We were advised that the applicant is required to give notice to properties within 200 feet of the property district. Mana Beckman advised that the district office has heard from some owners as a result of the district's mailing, and some owners will be offering comments at the October 29th meeting. It was asked if there will be any recreational space either inside or outside, and the applicant said they would review the plans. The borough president will be holding a hearing on November 10th community board. 10 will not vote on this issue until the November general meeting November 16 2020.. The meeting was adjourned and I would just like to add this is informational because we will be having a meeting with the public on October 29th, and I ask all of you: if you have any questions, please submit them to the district office and we will review them. Okay, thank you, Doris. I know that the board has had some familiarity with this and so that we because of the zoom platform, we broke it up committee meeting and then we will have the public. Thank you very much, and now we are moving on to youth services, education and libraries. Thank you. Thank you. Thank you with Anthony Marino. Thank you. So this also was an informational meeting. The Youth Services education and Library committee met on October 6th that 2020 2020 at 7 pm. The meeting took place via zoom and was broedcast live on youtube. We met in Quorum. This was an informational meeting and no votes were held. It was our first meeting of the year and it was nice to greet new community committee members among them Marissa, Perez and Robert Oliva, so welcome guys. The goal of the meeting was to go over recommendations to the Office of Management and budget to expense, priorities for capital and other improvements needed in our district. For this meeting, a representative for the Brooklyn public library was brought in to give updates to the libraries due to the Covid-19 situations going on in the schools right now, a representative from the DOE was not available. We were extremely lucky to have Nalia Rosario from community affairs and government department of the Brooklyn public library to give us the updates that we need. She is our local liaison for the libraries. There are four libraries in our district. We have one at Bay, Ridge, the Bay Ridge Library on Ridge Boulevard, the dyker library on 13Th Avenue, the Fort Hamilton Library on 4Th Avenue and the mckinley library on Fort Hamilton Parkway. We were told the following that one, that our district is in a very good position and we do not have any outstanding capital needs, which is great. There are two projects that are funded these capital, brick and mortar projects were requested last year and are now ongoing. They may be slowed, however, due to Covid-19 restrictions, Capital Priority, 11, the Bay, Ridge, Library heating and cooling system is being upgraded and the capital priority 12 diker heights, Library, there's interior renovations, going on and Exterior window is being replaced. The Mckinley Park branch is getting a new roof and the windows are being replaced and improvements to the Interior. We also talked expense needs and budget impacts and reopening plan. So currently, only two libraries are open: the Bay Ridge Library and the Fort Hamilton Library. Only lobby service, which is phase one, is currently available. Opening is planned to be done in different phases. Phase one which is current, is the lobby phase right now, and the lobby will hold your books that you can order online and you can pick up and return from the lobby working closely with the mayor's office and the CDC guideline with CDC guidelines. The library has no specific timeline for when the other two branches will be opening. That was a question that was brought up. The next phase two would include limited interior access with self- serve kiosks being opened and the restrooms. So we just do not know they did not have any specific information when that would go into phase two or when the other two libraries would open. There was a concern like what are the libraries doing now. While they are closed, we were told that virtual story times have been very successful and in our district alone, they've had some successful ones in a multitude of languages, and this happens weekly there are virtual cooking programs that are starting and a robust newsletter is going out and can be personalized based on your interests. That is the best way right now to find out what is going on in the library is in our community. It was requested that more programs be added to help supplement educational needs of the students that are stuck at home during this time. Some questions that came up. How can you donate books to the library? We were told that library, books, library, libraries, I'm sorry, only take books during specific book drive times and that the next one would be provided to Josefina to let us know when the next book drive is and another question was: what ways can people volunteer to help the library or virtual support and Nalia said that she's going to look into how we can actually volunteer and outreach and to help create programming virtual programming for the libraries, so that was kind of positive news for our libraries to see that they were staying active in this time after the presentation josephine, let us know some additional updates regarding schools. This is this is what we'll all be talking about. The school construction Authority is working on the school being built at the Nathan's site. The board requested that the SCA come back to us in the design phase, and that is happening. It should be in late November, and that will be a joint committee review with the zoning and land use. So Doris get ready. It's being you high. Five can't wait for that. At the time of our meeting, the mayor had just announced that there were going to be school closings based on the zip codes, and so we have two schools that are currently closed in the one two one: nine zip code, Christa Mcauliffe and Ps 176, the Ovington school. So those two schools will be closed for in- person learning and have switched to all remote. A reopening date is not set and will be reviewed for a possible opening for October 21st, but that situation is that's currently ongoing. The committee ended with a conversation about school closures and how everyone is dealing with it. We made note of the hard work and appreci appreciation we have for the workers in the schools, the teachers, administrators and, of course, students and parents. We hope for a quick and safe end to all of the closures with that emotion was made to end the meeting with the second and so concluded our meeting. This committee report is respectfully submitted by community board 10 youth, Services Chair, anthony on Monday October 19th 2020.. Thank you. Thank you very much anthony good job, and now we have a report from the Environmental Committee Question Foreign Dean had a question: dean. Wassina! Yes, Anthony! Are you aware, were there any furloughs at the libraries laid off? No, I did not get the sense that there were any furloughs. In fact, the people creating the content, the virtual content, those were all librarians. Those are those are staff, members of the library, so there were no mentions unless I missed that show's phoenix. She did not say anything about me furloughs and it seemed like everyone who works at the library is staying, active and again shifting, like everyone else to virtual a virtual setting. Excellent. Thank you. Okay. Also, Marty Lentz has a hand raised. Oh okay, no, okay, tracy your hands is raised too. Is that exciting? No okay, just see that Larry would like to speak. Larry have some mute yourself that better? Yes, no, the the two libraries that were closed. The reason why they were closed. It was just a matter of usage or yeah. There was no reason given unless I missed that. I do not think I did. It might be a location thing or well, they were limiting. I think she said overall, due to Covid-19. That makes sense. Okay, so the ones that might get more use maybe are open right now than the other two but they're trying to work on getting them all open as soon as soon as they can. Even if they're closed. I know I visited Queens library last month and apparently it was only you know. You only walked into the lobby and that's that was it yeah, that's so the lobby yeah lobby uses that that's phase one. So you can you can order a book and reserve it online in advance and go pick it up or return it shelves and take it off the shelf. Yes, yeah, well, branch that I went to was. It was a big outbreak or you know it's crazy. It's like you, never know. You know you take precautions and it's still again. This is in a religious community. So that's, I suppose you know that's a lot of reasons why better safe than sorry yeah. Okay, do we have any other questions or comments? Joe anybody nope! I see no one okay, so now we will move on to the Environmental committee report. Where is my environmental committee chair? So Janna is not here. Okay and we do have her report dorothy. Do we you do not have a report you're on youtube. I forget I do have a report. I do not know if you want me to deliver it or if someone else wants to do it go right ahead. Dorothea since you've got it in front of you. Okay, the invite we're ready the environmental Dan. Will you ready Dean is ready, is Dan Ready, oh Dan? Oh, I do not have the actual report in front of me. Okay, I tried to email Dan, real, quick, thank you. Okay, so the environmental Committee of Community Board 10 met in Quorum via zoom on September 30th 2020 at 7 pm. The meeting was also live streamed on youtube for those who could not access it via zoom Department of Environmental Protection Representatives, Andrew, Ing and Robert Oliveira gave a thorough and comprehensive presentation about the capital improvements happening at the owls head wastewater treatment facility. The presentation was given in a powerpoint format and was shared with the community board the following day. All future construction projects are provided in the powerpoint community concerns regarding noise were addressed by the representatives. The representatives also noted that, although there will be an increase in traffic, there will be a presence of flag people to help keep the area safe and the community will get a notice within 24 hours of the start date. Construction will not happen on major holidays and there will be noticeably less work on minor holidays. The second item on the agenda was a discussion and planning of a community catch basin. Cleanup CB10 has many areas that are prone to flooding during the fall season, because the corner basins are not cleaned properly from the leaves that fall, especially during this time of the year. The proposed solutions range from focusing on an online campaign, utilizing all CB10 social media platforms to also providing corner houses, a flyer reminding them that is a requirement to clean corner catch basins. In addition to this, the main proposed solution was to have volunteers girl scouts to be more specific following social distancing requirements come to help clean the corner basins in the community. In regards to new business plans, a committee member recommended that the committee create an environmental pledge that can be distributed to all of CB10 in an effort to be more environmentally friendly community to be a more environmentally friendly community board. Later, discussions are necessary in order to further discuss the matter. The meeting ends at about 8:30 P.M, respectfully, submit it Janet's help. Thank you very much, dorothy. Okay. So that concludes our committee reports for this evening. I'm sorry did we have any questions or comments. I know that Janet is not here before I close this out. I see Dave Happy to answer anything as well. I just got that email by the way that if I owned a corner house that I should be cleaning that part of the street, yes wow, yeah crazy right, I do not own a corner house, I'm going to tell you- and I do not know you know. I know this is going to wind up being me, I know, but I'm sitting out on my stoop the other night. This happens all the time, I'm about four houses from the corner of a stop sign and I watch this man throw out hamburger, fries chips and the soda right in front of me. Now I have to clean up after these people, I'm going to tell you. I had a corner house. I'd be really upset. I was upset, especially with Covid-19, but forget Covid-19. I had to go out there and clean up the mess that people just drive and throw things out. I've seen it done on Third, Avenue fourth day of a new fourth avenue and nothing happens, and just to tie in because I have to say something at every meeting the people you know tradition. I know I know you know this little mope. I want to call the moped scooters, they are riding on the sidewalks, they have children on the back and they have no helmets, and I do not know what to do about it. I wanted to go and chase some lady up the driveway and go Yell at her, but I do not see tickets going out. I do not. I know that you know we had a you know: a reduction in police and budgets. These are two things that really get me: people on the scooters on sidewalks, no helmets with kids and people throwing garbage out the windows, and if I had a corner house, I would not be cleaning out the catch basin. I have a question: did the catch basins for on the commercial strips also have to be cleaned out by like the corner bar or that's it? Yes, the corner. The corner property is responsible that the property owner ultimately is responsible. Oftentimes commercial leases will require the person who's renting it who's, leasing the space to do the sidewalk and to do the cleaning every home owner and you know, is required under city rules to clean within 18 inches, and that includes the catch basin. Rite aid on my corner is supposed to clean out the catch basin. I never have seen that happen. Well, that's a big problem. Most people do not realize it, so that's why we talked about the education campaign. It yeah, you know when you have a heavy rain, it does. You know it does, have an impact, because if the catch basins are not clear, the flooding will happen. So excuse me, it's wall, green. It's not! Writing! Let's go yes, Steve! Just for clarification, we're not talking about cleaning the interior of the cashback, no just a supervision portion, it's only the top part as if they were sweeping it type of leaping. Yes, correct right! You know your heads, I am pain's body is not it true that any homeowner has to clear the curb you know into the street. It's part of our responsibility as homeowners to make sure that part of the street is clean anyway, forget about the trucks that come by and just kind of swirl it around anywhere. But I it's my understanding that that's our responsibility anyway. So if you're lucky enough to have a corner property, I guess you just get an added responsibility. No you're right diane, it's already a responsibility, but we try to highlight it, especially during leaf season, because it's very problematic here in Borton we have a lot of trees and it's amazing. You can sweep one day and next day they're right back, especially during the months of you know, late October into November, and some we have some calorie pear trees that do not shed until December. So it's you know has an impact on the corner: catch basins, especially those with the larger trees and watch out for the flying acorns and the flying acorns this time of year. Yes, Judy. We get that question all the time this time of year, especially on the larger blocks here, 81st and 82nd Street Acorn season, yes, okay, so I'm I think it's great sandy we're not there! Yet. Are you asking a question? Are you waving goodbye? I know you're thinking about it. Okay, wait a minute, but I have to ask all right: do you have any older, unfinished business? Well, I want to say something and for a little girl had her go ahead and I've had my hand up. I think it's questionable to have the girl scouts clean the catch basins, so what we we've done in the past. We have a board member who's, not here tonight, Shirley Chin, who has a lovely she's, a girl scout leader of some troops and she's done some composting in the past on trees and they're very interested in doing environmental projects, and this was one that was recommended in a way that could be independent with one. You know as a badge requirement. We spoke about where you can have one child, lower the corner and sweep we've done composting and things like this in the past we she has not met yet with her girl scout troop. It was an idea that they had actually and presented to us at a prior board meeting before Covid-19. So that's why it was. It was discussed- and I do not think it may not be in time for this year, but right yeah, it's something that we have actually that the girls wanted. You know the troop wanted to do in the past. Okay Sandy. I draw a comment and what Josephine said where beverage or our Community board district already has too many trees, and this is a problem parks department, we know, is a big problem because they are underfunded and they do not have the funding to take care of all the trees. But I've got an answer for the city of New York plant more trees, that's what they should be doing plant more trees. That's the answer! There's no such thing as too many trees. Okay, they take care of them all right and now, okay, so I'm sorry! So did we get to old and unfinished business? I'm not sure where this whole thing, where we older unfinished business. Anyone! Okay, do we have any new business? Larry I got Larry. Did you have a hand up? Last time I asked about the drag racing on the fourth Avenue on Bay Ridge Parkway. Yes, you did larry even during the day, it's not even just at night. You know. Okay, I do want to share with members of the board that we did hear back from Captain Tolston, who says they are doing enforcement but Larry. I will give him that location again: okay and Dean. I saw your handout too. This should probably go to the committee, but I'd like to request that at the next board meeting that the captain of the 68 precinct report statistics as to moving violations riding on sidewalks no helmets, because this problem has blown up. As I said before, from three or four bad areas, it's the whole entire Bay Ridge. So I'd like to get some numbers and see what they're doing right, we will definitely request that. I think that Josephine- and I were discussing this- I think that we've got a number of complaints. I think we'll take a look at the 3- 1- 1 that I think things are going up. You know, as Covid-19 keeps many people indoors. Sometimes the streets are a little more open and these people just want to zoom around on them. It is a dangerous situation. Barbara do you is that, is that a hand up there yeah? I just walk ahead. No, I just want to reiterate what was said earlier about the girl scouts. You know doing the cleanup you know, besides of the type of debris that the children may find at the corners. You know that some of our cars go very quickly, so I want to make sure that any kinds of activities that we encourage children to participate in that you know the activity itself is safe and it is done in a safe way, and I'm also going to say this- and I know that there is a member of our community, who you know for two decades has been endorsing that we do the denise wharf cleanup. When I was assistant principal at Fort, Hamilton, High School. I did not allow that to be a school- wide activity, because that is not a beach. I do not care what I said. It is not a beach. It is a concrete slab hanging out over the Bell Parkway and there is glass there is needles, so there are all kinds of things like that. So before you allow your children to go to this or before you even think about it, let's make sure that all of those these activities are in a safe place and that the people who are participating are age. Appropriate. Okay, thank you. Thank you. Anybody else do we have any more new business. Okay, I do not see anyone. Do we have a motion to adjourn yes motion to Adjourn I heard Sandy. I've got Diane Gonardis. I have Julie Thumb, so thank you, I'm all in favor, aye, all right and the motion carries. Thank you. Everyone have a good night.",
            "summary": "Everyone community board, 10 Brooklyn, general meeting, October, 19th, Thank, you and now I would like to call for an adoption of the agenda.\nHey, guys, hey Justin, how's everybody doing thanks for having me a couple of things going on so first early voting , Starts this Saturday October 24th.\nI, just posted some information on social media channels for most of us in Bay Ridge, the early voting site is going to be Fort, Hamilton, High School, but there's all sorts of links and stuff that I can send out to folks.\nThen you have the opportunity of voting early and that starts on Saturday, but the polling place is likely going to be different from where your normal polling place is obviously wanted to mention the incident that happened on Thursday, where we had an unfortunate and horrific attempted sexual assault of a senior on 94th street near Marine Avenue, the the NYPD made a very swift arrest and the suspect is now being held on two hundred thousand dollars.\nAnd I'm working very closely with a local 6a precinct as well as I had a meeting last two weeks ago with police commissioner Shea and I requested additional patrols in the area.\nBay, Ridge and dyker heights are still by far two of the safest neighborhoods in the entire city of New. But I understand that recent events certainly have folks concerned and me included, and I also understand that, regardless of what the statistics say, more of a police presence will certainly make people feel safer.\nAnd you know we continue to work closely with the district attorney's office and with our partners in law enforcement here to make sure that everybody's, safe, I mean public safety is always going to be.\nEverything else comes second to that, so so I just wanted to pop by and say hello, make sure that you knew that we're on top of this and working closely with our local cops to keep us safe, and I will send out the information about the early voting just so.\nOur early voting starts on Saturday October 24th, until November 1st , if you're in Bay, Ridge, there's only one location for you and that's the Fort Hamilton High School, So be sure that you have that hung up on your refrigerator and spread.\nWe want to remind people to drive slave safely to slow down and to stop drag racing in the community.\nAnyone has any questions for me, but everybody here tonight should know that we moved about two months ago, so you have not been to my office right now on 93rd street right, off, Third, Avenue, literally acrosss the street from the Prince hotel, and we have a mask and hand sanitizer distribution this week we're going to release the flyer tomorrow, but it's this Thursday at three o'clock in front of my Bay Ridge office , It's this Thursday from four to five in front of our Bay Ridge Office And, we'll share the flyer on social media.\nThank you very much and now we have state Senator, Andrew, Gonardis, , We all know that we're going through a bit of a spike right now in southern Brooklyn, about half of my district is in a red or orange zone, which is obviously concerning we've seen some good downward trajectory of those numbers, but still not enough.\nYou know this has caused a lot of confusion and a lot of anxiety and consternation about businesses and especially schools, because there are a number of schools which are in the yellow zone which remain closed, even though they are otherwise permissible to be open, really trying to push the governor's office to release a reopening strategy for these schools and for the businesses.\nSo I know, this is a significant quality of life concern that people are frustrated by Hopefully, we'll have some good news for your report on that.\nAnd I just want to thank Community, Board, 10 and all its members for this invitation to quickly introduce myself, I'm the new commander for Fort Hamilton, along with command Star major Mccabe.\nThe great staff here in the leadership has worked hard to record a number of videos and create a number of information points that will be located on the Us Army Garrison, our Usag Fort Hamilton, Facebook page, as well as our youtube channel, and we've posted a number of videos with information from acrosss the directorates on the post that speak to what what we can do to help support our retirees and so that will be up and going beginning on.\nWe want to make sure we do not forget how important our retirees are and that they are service members for life Covid-19 going on, but this is a great city and we're My family is really enjoying our time.\nWe have sanitary items to help you with, and I just want to tell everybody, be safe, and I look forward to hearing the rest of the meeting and thank You. Thank you very much, and now we have with us nancy lulu from the Brooklyn district attorney's office.\nI'd also like to say thank you to our executive committee for its work on the capital and budget priorities that we voted.\nOver, the past month, I attended several budget consultation meetings with agencies of the city of New York to discuss overall budgetary needs, which were reflected in our priority list that were voted upon.\nAnd, finally, I just want to share with board members, as has been our tradition and since we're not meeting in person, the board will be collecting food and loving memory of our late community board.\nAnd, we just want to thank St Vincent to Paul on their resource to this district office and to the community board for their work at the food pantry and for St Patrick's church for continued distribution of thanksgiving food, baskets.\nOur next General Board meeting will take place on Monday November 16th via zoom, and I'm, also going to be sharing the early voting information via our newsletter, as well as an email to board members.\nMeetings are still a little new, so it was decided to have an informational meeting for the committee, which was also live streamed and is available on Youtube District Office did a mailing of over 2500 residents and businesses in the immediate area.\nI know that the board has had some familiarity with this and so that we, because of the zoom platform, we broke it up committee meeting Then we will have the public.\nIt was our first meeting of the year and it was nice to greet new community committee members among them.\nThe goal of the meeting was to go over recommendations to the Office of Management and budget to expense, priorities for capital and other improvements needed in our district.\nThis meeting, a representative for the Brooklyn public library, was brought in to give updates to the libraries due to the Covid-19 situations going on in the schools right now, a representative from the DOE was not available.\nLet us know when the next book drive is and another question was: What ways can people volunteer to help the library or virtual support?\nThis committee report is respectfully submitted by community board 10 youth, Services Chair, anthony on Monday October, 19th, 2020.\nThank, you very much anthony good job, and now we have a report from the Environmental Committee Question Foreign Dean In fact, the people creating the content, the virtual content.\nIn addition to this, the main proposed solution was to have volunteers girl scouts to be more specific following social distancing requirements come to help clean the corner basins in the community.\nDo not think it may not be in time for this year, but I draw a comment and what Josephine said where beverage or our Community board district already has too many trees, and this is a problem parks."
        }
    }
}