{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "title": "General Board Meeting",
            "publishDate": "2020-12-11",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nGeneral Meeting\\nWednesday, December 09, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Welcome\\n00:00:25 - Approval of Agenda\\n00:00:36 - Approval of November 2020 Minutes\\n00:02:57 - Chairperson's Report\\n00:05:15 - District Manager's Report\\n\\nCOMMITTEES FOR ACTION:\\n00:06:39 - Nominating Committee\\n00:10:00 - Land Use Committee\\n\\nCOMMITTEES TO REPORT:\\n00:59:26 - Economic Development \\u0026 Employment Committee\\n01:03:34 - Finance \\u0026 Personnel Committee\\n01:09:29 - Health, Environment \\u0026 Social Services Committee\\n01:11:44 - Parks \\u0026 Recreation Committee\\n01:15:51 - Transportation \\u0026 Public Safety Committee\\n01:19:14 - Youth, Education \\u0026 Cultural Affairs Committee\\n\\nELECTED REPRESENTATIVES:\\n01:22:13 - Edward Cerna (Mayor's Office of Community Affairs)\\n01:25:22 - Nan Blackshear (Brooklyn Borough President Eric Adams)\\n01:29:28 - Taeka Haraguchi (Comptroller Scott Stringer)\\n01:34:30 - John Watkins (District Attorney Eric Gonzalez)\\n01:37:20 - Kat Savage \\u0026 Tracey Mantrone (Brooklyn Public Library)\\n01:41:31 - Greer Mayhew (Senator Brian Kavanagh)\\n\\n01:53:50 - Other Business\\n02:04:43 - Motion to Adjourn",
            "lengthSeconds": "2:04:56"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "imlXChMx870",
            "fillerWordCount": {
                "uh": 320,
                "um": 270
            },
            "readTimeFullTranscript": "65 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "building": 25,
                "report": 18,
                "program": 16,
                "zoning": 15,
                "evening": 15,
                "development": 14,
                "space": 13,
                "yard": 13,
                "chat": 12,
                "businesses": 12
            },
            "wordCountSummary": {
                "development": 6,
                "food": 6,
                "yard": 5,
                "efforts": 5,
                "report": 4,
                "stations": 4,
                "bridge": 4,
                "zoning": 4,
                "flood": 4,
                "term": 4
            },
            "fullTranscript": "All right so welcome everyone to the General Board meeting for Community, Board, 2. and so tonight just bear with me I'm trying to find my agenda, which I have it just opened it up and so for tonight's meeting. We are going to have the first item, which is the approval of the agenda. Are there any modifications to the agenda? Good hearing, none will just approve the agenda. Next item on the agenda is the acceptance of the minutes. Has everyone had a chance to review the minutes of November 10th? Are there any edits if they are we'll just wait for Barbara to give us some edits and then for everyone else? If you want to just send them in to the office you can, but on Barbara you have some edits. Yes, thank you exception. It says: master legend selection, second, bullet, okay, hello, okay, you said under to the Kavanaugh's comments. Second bullet and I didn't quite hear what the correction was. I think it should be. This year's election results rather than last year's okay. Otherwise they were great. Okay, I have any other edits. Yes, there is one I had made a comment about the community board's involvement in the closing of Fort Greene Park I. Don't see that indicated anywhere in the minutes. Okay delete noted. Are there any other edits all right, hearing, none or consider the minutes edit it and we'll make the noted corrections and if you know once we move on, if anybody has any additional comments by what means, please send them to the board office and we'll one of those additional corrections as well. So the next item on the agenda is the chairpersons report just wanted to I really don't have much of a report tonight, as generally has been my custom, because we really haven't had much to do. I haven't really been engaging with any events or things that would normally happen in a non-pandemic world. So that's the reason for most of the material being short. I would also add that I've had the opportunity to communicate with for a hall on several occasions, and the governor has extended the order for the public meeting law so that we can continue to work in a virtual environment. So I wanted to just remind people that we'll continue to do that, a bit more. As a reminder, you all know that the last time we met in person, authorization was given to the executive committee to act on behalf of the general body, and you know with technology being what it was. It took us a while to get to some level of frequency around general, meaning now that we look like we've accomplished that a bit I would expect everyone to be prepared that in 2021 we will definitely have more general body meetings than we did in 2020, not sure. If we're going back to the point where we would meet monthly, but there's no reason why that couldn't be a possibility. It's just something we're still evaluating still working with the board office on that as well and still receiving. You know counseling advice from the president's office as well, so you should expect to hear more on that we I was going to have a portion of the meeting tonight to discuss the results of the survey that each of you participated in, but there's still some information that we had to refine for that. So we will definitely send that out and have a presentation at a later date of the results. I've seen preliminary information around that- and it is it's very enlightening to me- I found it very insightful to know the makeup of the community boards members, their interests and some of their backgrounds. So hopefully you will see that soon, I'm in the new year, but you will also find it as enlightening as I did as well. The other thing I wanted to mention is that you know moving along to the next item. The district manager's report I have been very focused, working with the board office and the district manager and everyone to make sure that we change up the way the information is coming out with the district manager's report, as I mentioned at other occasions, and I don't want to be repetitive but I felt like it could have a refresher and a more meaningful way of information, as opposed to just a series of bullet points and paragraphs of the activity. That's happened in the office, and so there is no district manager's report today, because I've asked Rob to make some additional changes. So once we get comfortable with that, there will be a district manager's report and I'm confident that Rob and I have a path going forward where, in the new year, 2021 we'll have that information in a more refined way. That, from my perspective, is more meaningful and I hope you all feel the same in that regard as well. But you know what, before we move to the next item, let me pause to see if there are any board members who have any questions or things they want to ask of myself or Mr Parrot Mr Perez in lieu of you know having formal reports from the chair and the district manager. So any board members have any questions for Bob and myself at this time. Okay, great. The next item on the agenda are committees for action and at this time, I'd like to turn it over to Mr John Quinn, who is our parliamentarian to discuss and address the first item for the nomination? Thank you Lenny. You all have the report of the nominating committee and there's been no injunction that stopped this election and therefore there's no appeal to any Supreme Court and our election is going to be pretty straightforward and we have an elector, an electoral college of one, because the only person who has to vote according to our bylaws is our secretary, because we had only one nominee for each of the offices and for those of you, who've been here for all the decades or only for the first time. I will announce the nominee which is in the report and then, since there is no need to poll the board, I'm going to call on our esteemed secretary to cast the vote on behalf of the entire board, and that includes when we get down to it, voting for herself, which is perfectly permissible because she's doing this in her ministerial position. So the only nominee for chairperson was our present chair. The New H Singletary Iii. There being no other nominees. I call on the secretary to cast the board's vote in accordance with the bylaws I cast. The vote of the entire board for the election of Linu Singletary, as chair and I should have said. Save your applause for the end. There's only one candidate for first vice chair and that's Leonard, T Jordan Jr, and therefore I call on the secretary to cast the vote on the board in accordance with the bylaws I, cast the vote of the entire board for the election of Leonard Jordan, as vice chair. First vice chair, sorry, Lynn, and there being only one candidate for second Vice Chair Barbara Zayler Gringer I call on the secretary to cast the board's vote in accordance with the bylaws I, cast the vote of the entire board for the election of Barbara Zayler Gringa, as second vice chair and there being only one nominee for Secretary Jessica Thurston I call on the secretary to cast the vote of the board. I met a moment in accordance with the laws. I cast the vote of the entire board for the election of Jessica Thurston as secretary, and that completes the work of the nominating committee for this year. I. Thank you back to you Lenny. Thank you. So listen. Thank you for the applause. I. Don't want to speak for all of the board members but I. Thank you all that either approve of the work that I'm doing are smarter than me and not taking the job either way. I appreciate you all for the support, and so we will continue to try to do the best we can, but I will say on behalf of my colleagues who make up the executive committee. Thank you and we will continue to try to do what we can to not only meet the standards of the past, but elevate community board two in a way that continues to keep us as the best community boy in the five boroughs. So thank you. The next item on the agenda would be that of land use. We have two land use items and so at this time, I'd like to turn it over to Mr Carlton Gordon, who is the chair of the land use committee to present the two items: Mr Gordon? Okay, can everybody hear me? Yes, Carlton, we can hear you you're back on. You come off me. We can hear you again Carlton you're on YouTube. We can hear you they can hear me. Thank you. Okay, the first one is over at 69 Adams Street of Euler, that's them or the designated is c200356ppk. The application was submitted by the department of city-wide administrative services pursuant to section 197c of the New York City Charter, for the disposition of city-owned property located on the west side of Pearl Street between New York and front street block 52 lots, 15 and 17 pursuant to the zone. Zoning borough of Brooklyn community board two. Basically, what this one was about is the city-owned land city wishes to sell to a private developer and the project was to build a absolutely 28-story building. Underneath the Manhattan bridge in our Dumbo neighborhood, there would be approximately 225 apartments and also some commercials as well commercial spaces as well. The we did get some support from the local 32, BJ sciu, and also we got there was support from the downtown Brooklyn partnership. Their position was that these that the building that were building this building would provide jobs for people in the air in Brooklyn and in the community. However, there were a lot of opposition. There were seven letters that were sent to the board office indicating opposition, and there was a number of people who testified. Let's say we will say virtually who also stated their opposition. Basically, the problem that they've it was felt that, especially with is that the Dumbo has been really heavily built. It's a huge building, going up right now, right by the Walk street station, and the feeling was that at the York Street F train station is heavily used right now and that this building would exacerbate the situation in the community and especially at that station. There's only one for those who don't know, there's only one entrance and it's a very tricky entrance going up a long ramp. We see like I, said we received a lot of testimony against it and the our committee also agreed with it. With the testimony. We felt that this would be a problem for Dumbo and in the community. Therefore, we voted to reject the proposal Bio unanimously by a vote of thirteen zero. So we are asking the board or the full board to be- let's say agree with our position and to reject the proposal from city-wide administrative services for the sale of this property. At this time, motion to approve the committee's recommendation so move second but I know, but I just need to make a clarification. Mr Gordon they have the right to build a building at that location. Irrespective of this committee's vote, there is a right. Yes, there is a right to. You can call it a to build at that location, but we still think we should have our position heard to increase the size of the build they have a right to build. We are voting on their request to increase the size of the building by over a third. They can build whatever it is that they are permitted to build on that site. There will be if they continue to go forward. There will be a building on the site; it will not be larger than what they are currently allowed to build. So is it as of right is to build larger than as of right. I got you I just wanted to get clarity, because it didn't really I. Think I didn't get that from the minutes or the report without being at the meeting. So I just wanted to get clarity there, because I didn't want us to just push this through without me, picking at it to make sure I understood, so that fact that I'm clear that it's as a right and then the only thing that's before us is to allow them to you know, go beyond the space I get it. I might just add that what they're asking for is additional space to put in commercial space and as of right, it would just all be residential. It would have been a smaller. The as of right would be a smaller. If you can call it building still would be a large building, but it would be smaller. The commercial would be added by this application. It would make it even larger, of course, would be you know more revenue generated with commercial, as well as at least proposing more revenue generated with a commercial as well as residential, but the residential was what would have been decreased, not the commercial, yes, I'll say yes, yeah hello. Can you hear me? It's Irene, Janna, hi, Ray, hi, yeah, I, think the point was they have the right to build a building. They want to build bigger and they're, trying to add commercial to the residential that they're allowed and parking and I. Think the committee, and much of the testimony we got is that the neighborhood is so congested to take on this much plus, there's a lot of empty commercial spaces and still more being built already that it's hard to justify the need when they can't rent the spaces that are already available this issue. Thank you. Irene I appreciate that additional information but Jeff Finkel Terry. This issue speaks to a larger issue. That was the result of a negotiation for the original up zoning of downtown Brooklyn, which included as community benefits, making all of the Non-Ada station entrances ADA Compliant. There is special attention to the York Street station because it was designed as a construction type station. Anyone who has ever visited that station understands it's not commuter friendly at all. It is not even accessible with a wheelchair at all. There are only three turnstiles that are servicing. What was you? What was a desolate neighborhood when the station was built? It's now a bustling neighborhood. That is the only public underground transportation. It is totally inadequate. We don't have a plan to address that station at all. This has been on the drawing board since the upzoning over 10 years ago, and it hasn't touched. It hasn't been addressed at all yeah. But you know what I would say is like many of the train stations that are adjacent to new development, those stations weren't, designed with the density that is now existing in downtown Brooklyn in close proximity to those stations. We have raised this in different forms, either in large or independent, or some conversations at the respective chairs. I've put an s on that plural and district manager have had with D.O.T, MTA and other bodies, but, as you know, there's something that has not been resolved yet so I think there's a plan, there's a clearly an expression of wanting to have a more adequate, appropriately designed platform for the train stations that support that. But you know the same description that you gave to York street. You know pick a station. It can be applicable to many stations where the development is happening. So your point well taken, you know we'll continue to bring this up to the respective agencies and continue to make sure that you know they hear our voices. This is Esther Blunt. Also there. In this proposal there was no affordable housing. None. Thank you for that aspect. Call to do you yeah and listen. I'm not, and let me be clear because I know this happens from time to time. I'm asking you, I'm not asking you to speculate, I'm not asking you to give an opinion. If you do know the answer as to why there was no affordable housing, I'm happy to hear it. If not I know it's an acceptable answer. Yeah I do not know why there was no affordable house. Okay, perfect, thank you yeah, but there is a rob by any chance. Do you know if this is why there wasn't any affordable housing associated with this? Yes by every chance, because they are not seeking a rezoning here, so it does not trigger mandatory inclusionary housing. The application here is to sell city-owned development rights from underneath the Manhattan bridge to the adjacent property owner, who would then use them to build a larger building? Okay, thank you all right. I'm sorry, there's a question. Sorry Lenny I was trying, so the expansion is only adding commercial space or it's adding additional residential units as well. I think it would be adding the commercial space. So the congestion issue is outside of the scope, maybe of dealer, for they think the addition of the commercial space will continue to add to the congestion as well right now, I think we, the general feeling, was that this, the whole project was going to be a problem for the community and especially with congestion. That's why it was generally opposed by so many people who testified, and it was unanimously opposed by the committee. It's the congestion. That is the biggest issue for this particular property. I saw a piece written about this and I guess the bid is concerned about remaining competitive with Manhattan and that unless they continue to increase the amount of commercial space in the area, they feel like, based on what's happening in commercial space prices in Manhattan they're, going to have a hard time remaining competitive unless they expand that market. There I was wondering if that was part of the conversation. No, that did not come up, although there is I mean there's a lot, that's being built in Dumbo right now, residential and some commercial as well. So there is I have to say that probably I don't know. If that's going to be a major problem, it could come up, but right now, no may I say something about that thanks. Another big concern about the project was the fact that EDC met with the developer and encourage them to do this project and to sell the air rights. But it's not the air rights. It's the space under the bridge that they're selling and the D.O.T has stayed under there for the last. You know we're on record trying to have them remove their occupation. So not only were they going to sell the air rights for some money and not say how the money was it going to come back to Dumbo? Was it coming to the under spaces? Would it be in Brooklyn, you know, and so, as you know, so that's the concern. Dot needs to find in a more appropriate place to occupy the city. Planning has rezoned and sanitized the neighborhood of its industry, so we have tech jobs, but we don't have the mixed use, quality that we had used to have and except for D.O.T occupying the under underbelly. So there- and you know the bids- concern is just it's like a false issue, because there are so much space available right now and unfortunately, there's not a day that goes by that we're not losing another business and there's a moving truck. So if that's a concern, I don't know, there's ample space for the commercial development for sure, and this rezoning is from the 201 rezoning for a one block, rezoning 100 J street and at the time the Jehovah's witnesses put like a very low scale building and the focus was one on the 100 J street building, and that was the you know the beginning of all the subsequent rezoning, including 85 j and then subsequently the 2009 of zoning. So you know this, you know the over development of Dumbo. You know is kind of shocking and the city has had 20 years to figure out the subway. So there was like a lot of contributing factors in the community, not feeling we were getting anything for allowing a con additional commercial resounding for this application. Mr chairman actually hold on I. Had a question hold on I thought you had a comment or a question you wanted to make am I correct, I was going to ask a question. It's been covered, I think it's important for us to be super clear about, what's being presented in the user, the ULURP and the rezoning application. It was. It's been covered at this point, but I just wanted to be clear that it was an EDC initiative to give all the development rights from the D.O.T lot under the bridge to this building that results that would result in the addition of about six floors or just under 100,000 additional square feet strictly of commercial space at a building that, as Carlton pointed out, is already going to be built strictly as residential okay. Thank you, Mr Scala, you have to come off. You come with me. Come off move Mu come off mu, the hazards of Webex. Anyway, it's a procedural question to Gordon. My question is: if we, the committee, agreed to the rejection, what is the next step for the developers in their pursuit of this building? I want to just familiarize myself again with what can happen. Basically, can they come back to this committee for another presentation they could, if it's I, know right now, I think it's also supposed to go to the president's level, if I'm not mistaken, and then up further the chain of command or chain of process better way. To put it, it's always a possibility of returns. We've had sometimes we do get return, people coming back with different applications, but it goes. You know it goes up. Let's say I know to the bar president level and then further I guess onto the city council. Basically, they can actually go back and rebuild it. They can do this or reapply I mean it's right. Now, it's a application to dispose of this property. Mr Singletary, Mary, answer Mr Scala's question sure you can answer, then I'm going to ask Dortry to provide some other commentary as well. But yes, okay, thank you, know. I think that the board should keep in mind to what degree or what, how it influences them, is up to them individually. But you know this was very much a negotiated sale despite the fact that an RFP was issued, the city is looking to monetize development rights that they can not use underneath the bridge and they are getting an eight-figure sum of money for those development rights. So the community board can vote. However, the community board sees fit, but the application is not going to be withdrawn. The application is going to proceed and potentially either the borough president or the council member will ask for certain conditions for their support, but the chance of the application being withdrawn and the city just foregoing that income are highly unlikely. Do I choose this? Whatever you wanted to ask hold on. Thank you, Robert just quickly. A couple of things. One is that the borough president had a hearing on this on November 30th I do not know the outcome or what the testimony entailed at that meeting in the second point, I wanted to make it Rob is right. They did talk about leveraging the site an unusual site to get money to the city, and there were a lot of questions from me and a lot of people about how that money might be used, whether we could target community districts too with that and they could make guarantees for that or the long term. They spoke a lot about M/ WBE hiring goals, but they couldn't say that long term that they would be able to hold their tenants in the commercial space to those goals and a number of other items, all right, so listen, I, don't want to rehash a meeting. So I'm going to limit the comments going forward because I want to get through this, but I do I thought I heard John Dew had something he wanted to add. John. Was that correct? Is this something you wanted to ask I wanted to add that we at this point have to take a stand on what the city has promised us in terms of the community benefits and the upgrading of a train station. That is dangerous. It's not being addressed at all. It's irresponsible for us to continue these improvements without getting the city to recognize what has to happen for the safety of the community, and this is a community board. We look at these issues one-on-one. We have to look at the larger community as we go forward, because the city has not been responsive to the community board in terms of our community firms, which are the city's concerns. That's it! Thank you. Okay! Thank you! So listen as we move this along. Let me just backtrack a little bit because I know we have a lot of discussion on this motion, but maybe it's me who second, the motion. Okay, great! So since no one knows whose second emotion can I have a second set of motion that was made by Mr Second. Okay, thank you. I seconded the questions, Mr Singletary, you were there. Thank you for that clarity, I appreciate that it just happened so quick that I didn't get the second name. So, thank you so having motion a second and having discussion, I'm going to take a vote so all in favor and I need you to keep your hands up so that we can I, don't think it's a roll call. Rob am I incorrect in that statement per the bylaw. Is all land use, items or roll call, so I'll leave it just because you don't have the role in front of you right. No robin I thought he's going to call out names. Thank you, rob, okay, perfect, thank you and I will skip the people who have asked to be excused, but I will call people that I may not have noticed are present at least the first time. Sorry Rob quickly. Can you just reiterate exactly what's being voted on sure, so the committee recommendation was for the board to vote to recommend disapproval and Mr Do made a motion to ratify the committee recommendation and that has been seconded. So a yes vote is a vote against the application to sell the development rights. The no vote is go ahead and do it and speaking of doing it Ali. How do you vote? Yes? Mr Andrews: are you present Mr Augustus? Are you present Ms Blount Mute? Yes, thank you. The list is alphabetical, so you can in the list Miss car Starfin Mr. Do. How do you vote? How about a yes? How about yes, design horn? Is that a yes Mr Ferreira? Yes, Ms Gallow? Yes, Ms guilt joins Gills, Mr Gordon, yes, Ms Gilman, yes, Mr Harrison. Were you able to join us? If someone has their mic on, they might want to turn it off. Perhaps Mr Scallow Miss Janner. How do you vote? Yes? Thank you. Miss Johnson! Yes, Mr Jordan! Yes, is crazy. Yes, Mr Lastoweki! Yes, Mr Luckett, yes, Ms Mcknight! Nicole! Are you still with us Ms Medley? Yes, Mr Gordon. Can you Mike mute yourself? Please all right! Thank you. Was Sydney Meyer able to join us? How about Ms Morales Ms Moso? How do you vote? Yes? Thank you. Miss Felicio. Were you able to join us Miss Phillips Almeida? How do you vote yes, Mr Quinn? Yes, Ms Richardson. Were you able to join us Mr Scala? How do you vote Mr Singletary? How do you vote yes, Mr Brandon Smith? Yes, Mr Dwight Smith, yes, Mr Sproul were you able to join us Ms Staton? How do you vote Miss, Thompson Manning? How do you vote yes, Miss Thurston? Yes, Mr Washington, yes, Ms, Yearwood, Young, yes, Ms, Zoller, Gringer, yes, Mr Singletary! The vote was unanimously in favor and Mr Single Mr Scala just voted via the chat panel. He votes as the rest of the board did. Okay. Thank you all right, Carlton. Okay, we have another one, not as controversial. This was from the department of City planning. It is the zoning for coastal flood resiliency, that's n, two one triple zero: nine five z or Y I'll read off some of the what's been submitted by the Department of City planning, because it really covers it very nicely. It's a zoning as I said for coastal flood resiliency. They seek to enable and help promote resilient buffering throughout the city's current and future floodplains and I'll just also pause here, especially for our community board, which affects heavily in gumbo, which was flooded in the last hurricane and also parts of the Brooklyn Navy yard. The set of zoning recommendations would provide for homeowners, businesses, business owners and practitioners living or working in the city's floodplain, the opt to design or otherwise retrofit buildings to a reduce damage from future flood events be resilient in the long term and c, potentially save long-term flood insurance costs. These recommendations build upon the New, York City Department of city planning work with communities throughout the floodplain since Hurricane Sandy in 2012, which identified zoning and land use strategies to help reduce flood risk and support the city's vitality and terminals and improve upon existing zoning rules that were adopted on a temporary emergency basis following Sandy, which is set to expire in the next couple of years. Basically, what they consider when it comes down to is we want to try to adopt rules, and these are optional rules. It's not so much a change of zoning, but these are optional rules so that, as buildings are being worked on or being built, especially in Dumbo and probably at the Navy yard as well to allow for resiliency in case of you know, when the waters do come up a little too high in our community. One of the things that would be that affects us, particularly again in Dumbo, is to allow for mechanicals and other things, which normally would be in the basement or ground floor to be brought several floors upwards, so that, even if there is water coming through, it would not knock out a the mechani. You know the work of mechanics that are in a particular building, also yeah and also putting out the buildings. This is what they want to do: the building design you know, and street trade regulations through floor area exemptions. The zoning for coastal flood resiliency would encourage new and existing buildings to flood proof. The ground floor, as I said, provide ADA, accessible building, access to grade and design storefronts that are located at grade that are and are visually accessible at the sidewalk level. If building those up to elevate the ground floor instead of utilizing, these incentives proposal would require buildings to provide streetscape strategies so that the buildings will provide. You know, strategies that will soften the impact of elevated uses on the public's realm. Basically, for our purposes we're trying you know we looking or actually what city planning is looking at are ways to bring up and to move back so that when the waters come, the building and our communities will be protected. After discussion with the Department of City Planning representatives, we voted in favor, ten zero with two abstentions, and we asked for the board to support these efforts. Again, it's not mandatory efforts, but these efforts by the Department of City planning to protect our for our coastal community in our board. All right can I have a motion to accept the committee's recommendation. So I have Mr Harrison who's. The second is that Mr. Do yes, okay, any discussion on the motion. Yes, the person not me, there's no noise. In the background here, you are you're a mute Lenny. Is there any discussion on the motion? I did say that I was one of those to abstain. The value of this was poorly explained, because if it is a safety measure, why would we be asked to vote on a safety measure if this is being done to guard against future flooding? How can a community decide to not take the appropriate safety measures? I didn't get a purpose of this presentation. They enact all kinds of laws for safety purposes. Why not this one? It's a good law. It just doesn't make any sense that we should have to approve something that they think is done for safety purposes. Mr do zoning for coastal flood resiliency is a change to the zoning resolution and zoning text amendments always go before the affected community boards. Mr Chairman, yes, Mr Scala I only have a ques a comment about the fact that two words that glared out at me was optional and encouraging. So basically, these are just guidelines. There's no real teeth to this am I. Correct, I'll, yeah I can answer part of that and say that it's not a requirement and they made that very plain. This is not a zoning requirement. It will be a optional if you're going to build and again in our I would say for any future building or any future. Let's say renovations, especially again in Dumbo to try to get mechanicals and other build parts of other. Let's say any other structure to be protected from any future possible flooding, and if you know so, this is what it really was. It's an optional way. You could leave it as you have. If you have a building there, you can leave it as you have, but you take the chance that, let's say something will come up in the future. Now many of the buildings that they really focus on city-wide are really smaller residences. Let's say: Staten Island Queens further down in Brooklyn, even parts of the coastal areas of the Bronx. That's really what the it's a city-wide project and that's what zoning for really coastal flood resiliency is really focused on, but we also have I think it's a unique situation here in on our board. It's been again in downtown Brooklyn in Dumbo at the Brooklyn navy yard. We want to try to protect these areas and these areas I think that this is a good program to try to assist in protecting these properties. So as a follow-up I just want to ask so in the future, developer was going to do some development and they came to us as a community board. These are questions that we can project present to them and ask them. Are they following these guidelines in lieu of our vote? Am I correct? We could ask I mean again it's not going to be the requirement, but we can ask and say you know, for the next structure: I, don't know how much land is left around Dumbo, but let's say: if there is somebody who wants the bill right up by Wallabout Bay and on the East River. If there's going to be a structure and they have to come to us, for you know for any change in zoning, we can say well. Have you considered putting your mechanicals a few floors up? Have you considered raising it your structure a little bit more to protect it? These are things we can have, and it's and they'll be, I'm sure they'll be aware of it, because this is going to be coming from the department of City planning, so anybody who's planning it was who's going to put up a structure is going to be aware of it as well. I have a question: has the presenter what DOT excuse me? I'm sorry, this is Samantha Johnson Miss Johnson we're having trouble hearing your audio I suggest you turn off your video there, any mention of incentives given to individuals who would be given opportunities to build on this property if they were to add this to their project, it's not really an incentive. It's more! It's an alternative! Again! It's not they're! Not this apartment city plan is not changing the requirements for these areas, but they are strongly suggestioning. I'll put it that way, they're strongly suggesting that if you're going to do this, if you're going to build in these areas- and this is for the whole citywide coastal they're strongly suggesting that you take these efforts to try to protect property that you're going to be working on in the future. So it's not so much of an incentive, it's more of I. We think you should follow. This is a guidance to try to protect you in case we get another big hurricane comes shooting up from the harbor into the East River Carl, but am I correct, and if I remember this correctly, if you don't do this and you're in the these zoned areas, you don't you're not eligible for the FEMA National Flood Insurance program. I'm not aware of that. I can't answer that yeah. I'm not aware that. I'm not aware that either I don't know that to be factual, I, don't know it's not that you're ineligible, but your premiums will be much larger and in a way that is the incentive to following these more liberal standards in the flood zones and, as a matter of fact again that's what the Department of City planning says. That's one point they point out is that your insurance would come down. If you follow their recommendations, it's not again going to happen or you're going to be penalized, but this is a way to help to provide help. Can I just provide an example of the hotel that was built in Brooklyn bridge park where the mechanicals were initially at basement or lower level and at some point the hotel was told or decided to move the mechanicals to the roof and it affected the view plane for the promenade for certain folk, but that's an example of the mechanicals being moved from the lower level to the roof out of the way of the water and, if I could add living in the flood zone in Dumbo at one main street. After a hurricane Sandy, the work was done in my building to move the mechanicals as well. Any other discussion on the motion- yes, Mr Chair- is that, yes, you have something to say: yes, I do Mr chair. There were things that came to mind about this. It doesn't negate anything that Carlton has said or any of the other points raised by our colleagues. I do recall in one of Nan's presentations her pointing out that the city was recommending that people boilers and other service equipment in their basement because of the issue of fraud flooding after Sandy. Consider raising that to at least ground level and then filling in their basement with cement and I. Think that I can only speak from my own point of view as a homeowner I did not do that. I, don't know many people that did and then fast forward a couple years there was a in news clips, that's a encapsulation or regurgitation that appear in a whole lot of media that came out in the last year and the army corps of engineers that has a peace with this on a federal level in its it has some impact on flood insurance, but it also has to do with reliable recovery and relief efforts changed the way it's a kind of a sudden inequality, their requirements for things, and they have approached various cities, they're rolling it out on a city-by-city basis and a state-by-state basis, where they're effectively telling the municipality that in time frame have a certain amount of the property, whether it's publicly owned or privately owned. That's don't address this issue and they are basically putting localities on alert that they're not going to do certain things. If attempts aren't made to reduce the volume of property that is below the, so it would seem that with that in mind, this is the city's attempt to at least try to coax people to do something which is logical. Any other discussion on the motion. Hearing, none I, guess: Rob I'll turn it over to you to do the roll call Ms Ali. How do you vote? Yes, Ms Blount? Yes, thank you. Miss car Starfin, yes, Mr, Cohen, yes, Mr Dew abstain, Ms, Einhorn, Miss, five Bush, yes, Mr Ferreira, yes, Ms, Gallo, Doreen I can see you. Yes, sorry! Thank you! Mr Gordon! Yes, Ms Gilman, Mr Harrison, yes, Mr Howald! Yes, thank you! Miss Janner! Yes, Miss Johnson, yes, Mr Jordan! Yes, miss Crazy, Mr, Lester Whitey, yes, Mr, Luckett, yes, Miss Mcknight! Are you able to unmute if anyone has trouble unmuting themselves and wants to vote via the chat panel, that is I, guess acceptable: Ms Medley? Yes, Ms Moso, yes, Miss Phillips, Almeida, yes, Mr Quinn, yes, Ms Quinn, yes, Mr, Scala, Mr Singletary, yes, Mr, Brandon, Smith, yes, Mr, Dwight, Smith, yes, Miss, Thompson, Manning, yes, Miss Thurston, yes, Mr! Washington Ms Yearwood young. Yes, rob sorry about that! Thank you Kate. Yes, thank you and Miss Zayler Gringer. Yes, Mr Scala voted yes through the chat panel, all the votes are in favor, except for Mr Dude's attention all right. Thank you very much. Everyone. Thank you. Carlton. Thank you. Next item on the agenda committees to report the economic development and disappointment bubble with a connection yeah. We got it. Thank you. So next item was committee to report for the economic development and employment Committee. Both the chair and co-chair are not able to make it graciously. K Yearwood Young agreed to give us an update, so Kate. Thank you, chair, Singletary I did want to provide the update in Ms, Peterson and Mr Pinoy's absence, because we had a great presentation last week from the Brooklyn navy yard and they provided a lot of helpful information about how they've been responding to Covid-19, how their businesses have been responding and what they've been doing for the community and overall, it's been a challenging time, but there's some good news, so at the Navy yard. So far, they've been a lot of businesses have transitioned to providing producing PPE, so they've produced 10 million units of PPE so far and 26,000 gallons of hand sanitizer in terms of ppp funding from the government. Back this spring, the yard was able to secure over 10 million four-yard-based businesses that were earmarked for those businesses and the average award amount was over a hundred thousand per business, so that really helped out a lot of people who are struggling. They've had only a handful of businesses, leave the yard thus far, and primarily those run by people who are planning to retire in the relatively near term. Right now what they're focused on they are. They currently have a virtual holiday market, which is where you can buy products all produced in the yard. It's at the website is madeintheyard.com and that's running through January 3rd. They are also conducting an RFP for a new. What they're calling an equity incubator, which is for an operator to lease, build out and operate an incubator that will support and accelerate M/ WBE businesses. They've had strong interest thus far and they've extended the RFP deadline to January 15th. If you know anyone who would be a good candidate, much of the administrative operations of the yard have gone remote, as you would expect, including the workforce development aspect. There have been actually since the beginning covered 471 hires that includes many Wegmans hires, and over 85 or Brooklyn residents, 30 or NYCHA residents. 23 were long-term unemployed and 18 have been previously involved in the justice system. So you know they're very focused on you know the mission that they have to employ those who have traditional barriers. Since July there have been 89 hires. Those have come at an average wage of almost 17 an hour and actually 60 were from the hyper local catchment area around the yard. So we were really pleased with all these statistics and finally they're doing some remote workforce development, training programs, including one focused on actually upskilling and advancing people who work at the yard already to move into more managerial roles and allow, for others to be hired into the more entry-level role and then they're also running an internship to a long-term employment program with about 40 recent CUNY graduates, who will have the opportunity to start working for yard-based businesses and potential on an internship basis and potentially be employed long term? So I don't know if there are any questions, but otherwise that was pretty much it for the last meeting and happy holidays to everyone. Thank you Kate, since we appreciate you stepping in for the book to Chan the coaching. Thank you next committee to report is on financing personnel I'll turn it over to Mr Leonard T Jordan Junior. Thank you, Mr Singletary, Good evening, everyone, the committee met on November 30th, and one of the things that we had on our agenda was on a budget. We haven't really spent a whole lot of money because of the Covid-19 environment. Staff is pretty much working at home, except for Mr Paris, and our executive committee is meeting online, so the money that we used to spend for meals or for let's say, sandwiches we have not spent so we spent a little over about a thousand dollars. So far out of our budget, we had reviewed a few items and we decided that we would get a monthly reconciliation from staff that will be sent out to all the committee members. So this is not only that we can get a grasp as to what our expenses are going forward, but also in preparation for the 2022 budget, which next meeting, which will be February 25th, we'll get a chance to discuss and perhaps have a draft ready to submit to the board one of the other things that we talked about well. Actually, in September, in our September meeting, we had voted to have staff purchased a zoom account and what happened was we had a few glitches but, however, I believe that we're cooking with gas? Now, as they say, and either by the end of this month or the beginning of next month, we should have a zoom account. Now how this is going to be used will be determined afterwards. Certainly, you know right now. I think we I don't well I just want to get into the discussion about whether we're going to be using that for meetings here at all. Right now we have we're using Webex and that's what Mr Singletary has mandated us to do for the time being, because that was the city's protocol. After that I guess it was a pretty short meeting and next meeting is on February 25th and I entertain any questions. If anybody has it yes, Mr Jordan, prior to your joining the meeting today, I had a conversation over this application, Mr Paris about the Webex platform. It is an extremely difficult platform for not just the community board, but folks that are choosing to join the community board, who are not community board. Members have to go through a whole rigamarole. In order to register you can't register from a phone. You can't register from a tablet. You have to call the board office has limited hours, it has all kinds of restrictions, it does not have the bells and whistles that the Zoom platform has the city I. Think you muted yourself, Mr, Duke, I, don't know what happened to John, but he can't blame webex because he got on so that's true I, don't say about that. But what I will say is his point is: do we know that? That's precisely why Mr Jordan and the committee have worked through what it takes for us to get on zoom. So you know hope John can make it back on soon. Hopefully he can, you know, participate again, but we got it yeah. Yes, a tesla I just want to yes. Hi I just want to reiterate what I've heard before I've had a lot of problems with Webex and it would be very helpful if we could switch to zoom. John is off because it's a glitch on Webex it he did get on yeah, but once again, yeah I agree. Well, there's no one on the community board is pushing back about the use of zoom. So let me just repeat this one more time the zoom was the default package recommended to us through. Do it many as Mr Paris have shared with the finance and personnel committee. There are many community boards that have chosen to move away from Doit's recommendation and proceed with zoom. The problem with Zoom is that the default license. That's free limits you to about an hour and it limits you to no more than 80 participants, and so, while I think many people would wouldn't mind having a community board meeting that only lasts an hour. Obviously we can see what limitation is with that. So we need to purchase an additional user package or additional license that allows for not being limited and to have a capacity beyond 80, which is what Mr Jordan was referring to when he said that there's been approval to kind of move to move forward with that. So hopefully, in the very near future we will get away from Webex and Zoom will be the platform for us to have our meetings. So there's no chance I think we agree with everything that John and Ezra are suggesting and I think others have suggested at different points in time. Just I just ask for the patience of the board, so we can move forward and get that resolved. Okay. Thank you. Any other non-zoom questions from Mr Jordan. All right great! Thank you! Lenny. Okay, thank you. Next item to be presented is health environment and Social Services Mr, Brandon Smith Good evening everybody. Thank you Mr Singletary and thank you. Everybody happy holidays. We had a really great meeting last week where we had a presentation by Dr Reed Caldwell from Nyu Langone that was focused on asthma, childhood asthma. The reason we been having this presentation is those of you pay attention to the last district health profile from the city. Department of Health would note that back in 2018, it was noted as one of the leading health issues for our area, the childhood asthma, and we want to make sure that we stay informed and aware about the issues that are going on there. So we received a lot of tips from Dr, Caldwell and some practical advice, and for folks and some things that we might take up in some future meetings. Initiatives around things like promoting mattress covers and cleaning events and reducing smoking, and you mentioned a lot of different things that could come up in this regard and we discussed a bit how there's some commonality and with Covid-19- and we talked about how patients with renal disease and diabetes, are particularly susceptible a very good, robust discussion and something I think we can take up in the in a future conversation. We also had three liquor licenses, which we approved with no community objections and we're very excited for our next meeting, which is going to focus on homelessness and particularly the services that are provided to the homeless. It will be a joint meeting with the transportation and public Safety committee, we're really excited to partner with this committee, and that will be our January meeting. January 6th, so stay tuned. For that and thank you. Everyone have a great evening. Thank you, Brendan. Any questions for Mr Smith hearing none next committee to report Parks Recreation Barbara, Zoller Grinder. Thank you, Mr Chair good evening. Everyone, first of all, thank you for the vote tonight. I appreciate that I want to wish everyone. A happy holiday and I have actually two meetings to tell you about. One happened on November 16th. We were fortunate to have the capital budget director, Candace Julian off of the borough president's office, talking about capital funding and how the parks and how it affects parks. There's a certain amount of money that the borough president does allocate to parks and a lot of what's determined, goes through the Parks Department. So Ms Julian suggested that we continue to work with the parks department on issues and projects that we are particularly concerned about. People had the opportunity to ask a variety of questions. There were concerns about whether a smaller projects have better chances of getting approved or larger ones, and Ms Julian indicated that it depends on the specific project and we were. It was mentioned that this is Mr Adams last year as for president, so that he probably would be more interested in seeing that projects are finished rather than something new might be started, and we discussed the fact that it is very long. It's usually a very long process for getting capital projects, finished, completed, develop completed in for the parks and there's really nothing that the borough president's office can do to alleviate that. Then we had a meeting a joint meeting Monday evening with the Yucca Committee, and we had a presentation from Victoria Vasquez on behalf of takedown Columbus New York City. This, as you may know, about this group, they're very much interested in taking down the statue of Columbus that is located in Columbus park in front of the municipal building and the Supreme Courthouse they just to just let you you're not voting on this tonight. It's my understanding that this will be voted on at the executive committee meeting at the end of the month. There was a vote taken to support. The majority of people present were in support of taking down the statute. The presentation talked quite a bit about the shortcomings of Mr Columbus and included his shortcomings that he talked about in his own journal, which were translated into English back in the early 1800s, so those activities were well have been well known for a long period of time. The group was also concerned about police coverage. There. However, they did not have their numbers about how much it might cost to guard the statute turned out to be not specific to the statute. It they involved a number of statutes, so I think that's really most of the Peop. There was a quite an interesting discussion. We had a lot of people who were not on either committee talk about their concerns and we really did not have anyone from outside the community board talk about not taking down the statute. So if anybody has any questions, I'll be glad to answer them. Any questions for Missala Gringer hearing, none, we'll move on to the transportation and public safety Committee. Do we have a representative either co-chair Lenny, it's John Quint, I'm the secretary, so I'll give the quick report. If it's all right with you. Thank you. John in our November meeting, we, basically the major part of the meeting- was a presentation by a representative of an organization called cases which is the center for alternative sentencing. Employment they've been around for 60 years, but they work out of the Manhattan criminal courts and since no one is working out of the Manhattan criminal courts, they're really not functioning at the moment, but what they did. What they do is they are an intervention group which takes recommendations from defense attorneys who have defendants who are being arraigned or being processed to the criminal court, to give them the alternatives to avoid a criminal record or prosecution. They came to us because they have an office on Lawrence Street, which services their clients who may be living in Brooklyn, but who have been arrested in Manhattan and I. Think there's a lot of discussion among members of the committee and other people who are on the meeting about what they do and how they do it, and it was a very lively discussion and I guess if they ever expand. If the courts, when the courts reopen and they expand to Brooklyn there'll, be a more relevant discussion about what they can do within this community board, that's what we talked about mainly at our meeting. Our next meeting is a week from tomorrow and everybody's invited to join and I know on behalf of the chair and the vice chair, happy holidays and myself happy holidays to everyone. Thank you. John I appreciate you filling in for both the chair and the coach here. Are there any questions for the transportation Public, Safety, Committee, Barbara, yeah I, just wanted to mention the chief judge of the state would be very upset to hear that the comment that the courts are closed. She's been very adamant that from day one the courts have not been closed. We may have you know, contracted operations, but they've never been closed, so I retract that I apologize as a member of the bar. Yes, that's true Barbara, but the organization I was talking about, has stopped putting representatives in the courtrooms because there are the what arrangements there are mainly virtual they've been unable to do what they did, which is really be physically present and grab hold of a defendant who's about to be arraigned or is having an appearance who might be a candidate for their intervention services because they're, just not there I didn't mean to say the courts. Weren't functioning, it's more. This organization isn't functioning because of the setup that the courts have. Thank you. That was a great Laura Lee, loyally response. I want you to get in trouble, fantastic job, any other questions or comments. Okay, great moving on yep. Next we have youth education and Cultural Affairs, Ms Farbush. Thank you and congratulations to everyone on winning this year's election good job. As Barbara said, our committee met in conjunction with the Parks Committee, to hear about the statue, so Barbara did an excellent job. Reporting on that there'll be more follow-up in the future. It's a very important issue, as the whole community looks at the history now that more of us are learning about. So this is a continued issue that we'll be exploring and bringing two votes great, any other any questions for Miss Vibers. Can you hear me now? Can you hear me? Yes, okay, I wasn't able to I wasn't able to speak because for some odd reason my signal keeps dropping off all right before you speak, John hold on. Let me say this before you speak, I'm glad you're back on we've already addressed the concerns that you share, which are valid about zoom I asked the same thing. I've asked the rest of the committee of the Community board to be patient. Zoom is on the way and we'll hope to have that be the preferred platform for 2021. excellent, but that wasn't my comment was about the it was about the jail piece and I wasn't able to get through that whole jail initiative is part. An extension of the whole black lives matter movement which is designed to identify in this society. All of the mechanisms that have put in have been put in place since the initiation of slavery that now have to be unwound. It's a very intense process. It involves practically every part of society that tends to take the black man out and place him in a position where he can not succeed. It just permeates our society at every level, so that particular program is a way of yanking those folk that would otherwise get into a system that would ruin their lives and to hopefully straighten them out and give them a new opportunity. Thank you next item on the agenda's open session before we do that, as is custom, is where we would normally have a signing sheet of our dignitaries and our elected and their representatives, and so in lieu of that. What I'm going to ask is Mr, Paris I know you've been diligently, keeping track of who is who's joined us this evening that fall in that category, can I call ask upon you to identify and provide the names of those individuals that will be speaking as dignitaries or elected representatives. Rob. Are you having webex problems? Please don't tell me you have a word as well. Oh you know, the mute button is not a webex problem. There's a mute button on Zoom, too Edward Serena from the mayor's community assistance unit was with us earlier. Edward. Are you still with us there he is? Did we have a good time at noon today? Edward was that just lovely, it sure was the one day I decided to not. You know, leave my house with a hat. It decides to blizzard, but it was really nice, hello, everyone, Edward Cerna from the mayor's office of Community Affairs. What Robert is referencing is the mayor was down by what is now going to be Emily, Robling Plaza, to do the breaking ground, and you know it was a great event. A lot of folks turned out despite the weather, and you know, hopefully in a short while there's no delays, there will be a new extension to the Brooklyn bridge park. I'll be brief: the city is facing an additional challenge. Besides Covid-19 the economy, and what have you and that's blood supply? Covid-19 has impacted normal blood drives. That would take place on college campuses or in large scale areas, and so we have a few days of supply left and we definitely are calling on New Yorkers to step up. We need two thousand twenty thousand actually more New Yorkers to come forward to donate Balad by the end of the month. There are some incentive prices that are part of the give blood campaign, so your donation could really go towards saving someone's life, so you could go to Nybc.Org Givebloodnyc. So if you can donate that blood to say someone's life and for the holidays, so again, everyone take care happy to see everyone and practice social distancing. Through this we have cases rising. So we just need to stay strong and absorb those measures, and then hopefully the vaccine will be given out shortly thereafter and I. Doubt we're gonna go back to normal, but you know we could be a little bit safer. So thank you. Everyone again, my email, as always, is E Cerna, Eserna Cityhall.Nyc.Gov feel free to shoot me something if you have any issues. Thank you, Edward appreciate it. Mr Singletary Nan Blackshearer was on the call hi man, hi Lenny or Mr Chair and hello Community Board too. So somebody remember thank you very much. You know well, it's kind of easy to remember. Considering I was born not in the year but on the day of Pearl Harbor, so it's Pearl, Harbor Day is my birthday. So thank you for remembering just a couple of things. First I believe there was talk during the land use, Community, Board action report about the borough hall having its hearing on November 30th, and somebody said they weren't able to see it just to let you know it is up for anybody to view it is on YouTube on our one Brooklyn channel, as is most of our events and hearings. So please feel free to go to YouTube to view it and I believe it's about four hours. So if you got time that's you know, you can spend four hours looking at the hearing so and then another thing was discussed, I think on Barbara's report. She talked about how my colleague Candace did a great presentation on the capital budget. In case there were some more questions that might have come up after that committee meeting and that presentation I just wanted to let everyone know that Candace is doing a workshop for non-profits and for schools on the capital budget process, and what I'd like to do is as soon as I can do it there's a flyer about these events they're taking place on. Why is that not working copy and paste? Oh there we go well, that's the school one. The school capital event will be taking place on December 15th from 4 to 6 p.m, and then the non-profit capital workshop information session will be taking place on December 15th from 2 to 4 p.m. Both are on the our website. I've also posted links to those flyers. Please. These are zoom workshops, so please use the links to go and register so that you can get the proper link to go to these hearings and learn the capital budget process. I just wanted to just basically say at this point: there's a lot that our office is doing. Please feel free to go to our website at Www.Brooklyn-Usa.Org. Our message of the month has just been recently posted this week. So if you want to learn about all the things that our president is doing, you can find it there and if anybody needs to reach me, I will put my information in the chat and I just want to wish everybody a wonderful holiday season and I'm not sure but I look forward to seeing you in 2021. Thank you. Nan appreciate the update. Mr Singletary I overlooked Taika Haraguchi from Comptroller Stringer's office, hi Taika hi. Can everyone hear me yeah I, hear you clear great? Well, hey everyone. My name is ty Karaguchi and I am a Brooklyn bro liaison for Comptroller Stringer's office. It's going to be back here this evening with community Board 2, so just a few quick updates to share. Firstly, a quick announcement, comptroller stringer and a better balance launched a new work and family survey to inform and improve critical workplace protection policies, accommodations and flexibility for working New Yorkers, as schools face extended closures and many businesses have either shuttered or shifted to remote work. The survey will analyze how New Yorkers relationships to work and family have changed amid the pandemic, so that we can identify future policy recommendations that the comptroller's office and a better balance will share during this crisis and beyond. So if there's any interest from folks to participate in our survey, I will be sharing the links in the chat. The survey is available in both spanish and English, and you know we're definitely looking to capture a diverse range of New Yorkers, so you know, please feel free to share it with your friends and family. Additionally, our office just released our annual making the grade report. So this report is an annual report that issues letter grades to city agencies based on their level of success, spending with minority and women-owned business enterprises. That is what M/ WBE stands for, so the grades are based on the framework of local law 1 of 2013, which set nwbe participation goals for mayoral agencies. So, each year the this report assigns letter degrees to 32 mayoral agencies plus the comptroller's office, unlike other M/ WBE reporting produced by the city of New York, making the great measures the actual spending of each agency in a fiscal year. You know the goal of this report is to shine a light on the city spending with minority and women-owned firms and to encourage all city agencies to increase mwb utilization. In order to further increase transparency, our office has created a set of dynamic, interactive maps that illustrate the city spending with certified M/ WBEs by race, ethnicity and gender by community district and borough from fiscal year 2011 to fiscal year 2016. So these maps highlight where M/ WBE spending is and is not happening and can be used as a tool to better understand the M/ WBE landscape in New York city. You know the comptroller has made this a priority for office and we know that the city and that all agencies can commit to further improving their mwb letter grades, because we've seen quite a few improvements just internally as a result of our advocacy in this area in comparison to when we began seven years ago. So just a couple of examples. For instance, seven years ago you get off the phone. Oh sorry, our office instituted a chief diversity officer and a director of diversity in the Bureau of Asset Management, and what happened is that we increased our controller cabinet to 70 women and 38 people of color. The mayor also followed our lead and issued an executive order to appoint chief diversity officers and the charter commission codified the M/ WBE program, and you know just for sake of brevity. We also issued a report with a series of recommendations for how to deal with homelessness and Covid-19 in the upcoming winter months and I will drop. That link in the chat below. Thank you for the update. I really appreciate that Mr Singletary career Mayhew is with us trying to register the Senator Cavanaugh, but I we've been unsuccessful. To do that, so perhaps Mr Mayhew. You would like to speak yourself, hello. Everyone hold on two seconds, Sir Graham Sorry. Are you speaking now or would you like us to come back to you? So why don't we come back to Greer and who's next Rob next up is the ever dapper John Watkins, representing District, attorney Gonzalez good evening. Everyone can you all hear me, we hear you fine, oh good, I, gotta I got it I, don't need a whole lot of echoes. I got it. So thank you, John. We can hear you Mr Watkins. All right, great, first of all, D.A Gonzalez sends his well wishes to everyone and I want you to know that the D.A and his team, including my unit the organs, the office of public engagement, really for the past six weeks, have been out in the community at many food distribution efforts that the D.A has led and partnered with throughout Brooklyn- and these are you know, from crown heights to Coney Island to bed-stuy all over the borough, and so D.A wants to really be out in front with leading the effort to make sure that our residents are being accommodated properly with nutrition. During these very trying times. Aside from that, the work of the office continues with prosecutions that you can find on the website. Brooklynda.Com most recently that was put in the media, was a unfortunately, an attorney, an officer of the court who was involved in significant real estate fraud, who is being prosecuted by the office for his misdeeds, and so many other prosecutions are occurring legitimately through the office and I would, as always, direct the community to visit the website. Brooklynva.Org there's so much information going on or being presented there that the community really needs to know about, and that you know sometimes rarely gets communicated. Christmas is coming up and just the last thing is, the Da's office is having a toy drive. I just saw on the news this evening that there's actual toy shortage going on right now and that will definitely impact distressed communities throughout Brooklyn, and so the dates are mondays, the next day, mondays from 12 o'clock to 2 o'clock p.m or drop-offs at 3:50 J street, which is our headquarters, and the dates are the 14th which is December, 14th and also December. The 21st aside from that just well wishes to everyone, have a safe and happy new years and best wishes. You know for a much happier 2021. thank you John all right, Rob who's, next Kat, Savage and Tracy Mantrone are both here on behalf of the Brooklyn public library, our friends from the library the floor is yours. Thank you, so I suppose I'll go first. My name is Kat Savage, I'm the supervising librarian at the Adams Street Library in annex with a few updates for Brooklyn public library in general, and also the library in gumbo as well so really quickly. The library has been partnering with the test and trace partnership and library staff has distributed more than 54,000 masks and reached more than 19,000 Brooklyn nights with information about essential resources such as free testing sites and emergency food relief. Our partnership is going to continue until 2021 and hopefully pivot towards culturally responsive outreach regarding a safe vaccine. In the meantime, in terms of grab-and-go library service, we have 27 select branch lobbies available for quick transactions in community board 2. That would be my location at the annex. Tracy Mantron's library, in Clinton, hill and I have a little bit of news about Brooklyn heights. I'll say that for the end, so you keep listening to me holds pickups and returns. Bins will also be available at these locations. Masks are required for patients and staff to enter and use this service materials are not accruing late. Fines at this time and fines will not crew on items checked out before the closure either. Lastly, our business and career center is really pleased to partner with the community service society of New York, to offer individualized assistance that can address personal financial concerns. So if you or you know anybody who has questions about credit or debt or would like to manage their money better and make progress towards a financial goal, you can call 718-230-2100 to make an appointment with a coach from the financial coaching corps. This is all free. All coaching will be virtual by phone or Google Meet and then just a couple hyper local updates. So the annex at one John Street, that's my location at John and Adams Street along the Brooklyn bridge park, we're there Mondays, Wednesdays and Fridays from 10 until three for our grab-and-go service. We also provide crafts for children that they can take and go and work on, and we try to change those out. Every week we are making a new library cards. So if you don't have a library card, yet you can come and visit me and I'll set you up. My staff and I in fair weather, because I am situated on the park, I'm able to offer a little bit of limited seating and browsing of a small amount of our collection, so you can come have a great view of the water and read a book and then I did want to report on that. The center for Brooklyn history, formerly the Brooklyn historical society at 128 Pierpont, will also be added as a grab-and-go location starting next week, and that is going to serve the Brooklyn heights neighborhood, which we're all very excited about. So if anyone has any questions about that and I wanted to ask Tracy if I missed anything or if you needed to add anything Tracy reports via the chat panel that she's unable to mute, but she did include some links about programs at the Clinton hill branch and, just speaking personally, very excited that grab-and-go moves closer and closer to my office with each iteration Mr Singletary, Greer Mayhew is ready to speak at this time. Hello, everyone, oh good! How are you I'm so sorry about the confusion earlier we're trying to figure out tonight? Hello, everyone? My name is grim Mayhew, I'm the community liaison for Senator Brian Kavanagh. So we do have some updates. Last week, governor Cuomo announced that he plans to issue an executive order to adjust the Covid-19 rent relief program to allow more New Yorkers to receive the voucher, based on statistics that the state had that have. They stated that out of the 100 million dollars that was originally appropriated for the program, only 40 million was used for and was given to eligible families. So hopefully, this new expansion will provide more relief and it will use the rest of the 60 million that is left over. As of now, the governor has not announced any more information, and the senator in our office is very optimistic that more details will be released very soon and also just one other note in regards to governors island I know this is really within Manhattan Cb1's jurisdiction, but we believe that the new proposal that they have to redevelop the island will strongly impact many of the residents along the Brooklyn, waterfront and I know. The community board has received some information about the proposal and actually circulated information on how interested community members can submit testimony and participate in Manhattan Cb1's land use comedian for board meeting. So our office is very much urging the community on the Brooklyn side to get as involved as possible about this, and the senator has been very active in trying to get Brooklyn to have as much say as possible in the process. So I mean if you have any questions, please let us know, and that is all thank you great. Thank you appreciate the update give our best to the Senator Mr Single Terry. Yes, if you're prepared to begin open session, we have three individuals who indicated they wish to speak beginning with Monique Chandler Waterman from New, York, City, Health and hospitals corporation. Let me just remind everyone in the open session we ask that you keep your comments to no more than two minutes. Brevity is greatly appreciated at CB2 for the open session, and so with that we'll have our first hello. Can everybody hear me yes, good evening great good evening? My name is. Thank you so much for this time to the board to the members of the staff. My name is Monique Chandler Waterman I am the Brooklyn outreach director for health and hospitals test and trace, which is a very new position. My job is to collaborate with community stakeholders like yourself to make sure we get the word out about how to keep New, Yorkers health and healthy and safe by making sure people wear a mask over their now nose and over their mouth or face covering making sure you stay home. If you are not feeling well, this is not the time for perfect attendance, say six feet apart and to make sure you wash your hands and, of course we have other things such as making sure you get tested at least once a month and twice a month. If you're out there a lot I put in the chat, you could go to Nyc.Gov Forward Slash Covid-19 test to find the nearest testing site. They'll. Tell you if it's a self-tested site. That means that you can swab your nose yourself. Also, it will tell you if there is a rapid testing is from 15 minutes and onward, and also PCR, which is the regular 48 hours or more on test results you get back, so we look forward to hopefully partnering with community board too in the future. We have done a couple of events with Icl on Myrtle, Avenue, Plaza I, believe that's in your district and I believe you're, also on Waverly place with celestial church of Christ and we're going to be partnering with Bishop Lachlan, which I believe is also in your community board, with a PTA, this Saturday from 11 to 1. We make sure we distribute mass and we also have clover 19 prevention, education com cards to give out. So if you would like any way to partner or have ideas on how we could best outreach to your community, because you know best how to reach your community members, we would greatly appreciate it. You can I'm trying to hurry up and do this so I hope everybody have a happy holiday and some safe tips for the holidays. Please do not gather small gathers in your house when you're at home, you get comfortable, you don't wear a mask and cover 19 numbers, as we know is going up so we're asking if the person does not live in your house. Please do not have the move for the holidays. We do not want the spread to continue going onward. We have five over five percent positivity rate in New York City, and we want to bring that down. Also, we want to make sure that you don't travel, but if you travel when you before you come to New York state, you have to have a negative test within 72 hours of arriving and four days after arrival, you have to get another negative test, if not you'll be in quarantine. 14 days when you get back to United States, so I just want to wish everybody happy holiday, and thank you so much for this platform. Stay safe, stay, healthy, we're in this together, and we are here for you. Thank you. I appreciate that welcome to community board 2. Hopefully this won't be the last time we see all right, Rob who's. Next, up on behalf of the American Red Cross is Richard Morrow good evening. Of course my name is Richard Morrow. I'm the community relations ambassador for the greater New York chapter of the Red Cross 2020 has been have seen over a hundred of our New York residents and neighbors all right cross volunteers deployed to Tennessee for the tornadoes, the tropical storm, Ethiop, California fires, Louisiana, Hurricane, Aragon, fires, Texas, Hurricane, and guess what we're still going right now there are over 30 ongoing disasters all over the United States last meeting I mentioned citizens, preparedness, Corps, training, presentation. Tonight. Much has been mentioned about Dumbo and the other vulnerable areas in our community. Now is a good time to review emergency procedures. Ms Singletary suggested it for review the last time by the health and Safety committee. I know I spoke to Mr Perez and he was going to get the information to them. It's a 45-minute virtual class I hope that it can be considered and will be approved for viewing tonight, though, I wanted to mention the children's safety preparedness course. It's a virtual program for 8 to 11 year olds, called pillowcase project students learn the best ways to stay safe in multiple situations. Perhaps the youth, education and Cultural Affairs Committee would be interested in reviewing it. I'll send a link to Mr Perez I wanted to remind any of you who are interested in learning the many and varied life-saving techniques offered by us. Please visit redcross.org the things they offer for free or are just extraordinary and helpful. We hope that you take a moment to remember our fellow New Yorkers, your neighbors, who, as red court volunteers, are today and every day giving psychological and physical help to our neighbors in need here and throughout the U.S we at the Red Cross want to wish you and your family a healthy, safe and joyous holiday season. Thank you appreciate the update and continue to work with the District office, Mr Paris and the team and we'll be sure to try to get on that. Try we'll be sure to get the information out to the board members that they're at their leisure. They can take full advantage of the programs that you're offering. So. Thank you all right, Rob who's. Next, the next and last speaker is Olga. Kucharina, I'm coming to school of community School of public health. I want to be a 34 household experience, school security and enterprise. As a result of the program you're coming across a little choppy. Is it possible you might want to turn off your video and that may enhance the quality, should I start over from the beginning or just continue? Okay. Thank you. Sorry, thank you and good evening. Everyone. My name is Olga Kutrina and I am coming to you from the community school of Public health I wanted to speak on the issue of food insecurity and this district alone 24 to 34 of households, experience food insecurity, and these rates continue to rise as a result of the Covid-19 pandemic, with which we had spoken a lot about this. In this meeting, many of those experiencing food insecurity rely on the supplemental nutrition assistance program, otherwise known as snap to purchase their groceries. A substantial percentage of snap users are elderly, which puts them at increase of contact contracting. The virus I would like to bring your attention to resolution. 1320-2020, which was brought forth by City Council member Andrew Cohen, and it's actually supported by two of your City Council members, Stephen Levin and Laurie combo. This resolution calls for the expansion of the number of retailers allowed into the snap online purchasing program to address the challenges facing vulnerable communities in New, York City when accessing food. This program was originally introduced in 2019, with only three approved retailers in New York state, those being Walmart Amazon and traffic. All very large corporations, however, due to the current online food shopping demand, snap users are having a very hard time ordering their groceries and small businesses are not included in the program. Currently, the passage of this resolution would help ensure that snap users would be able to order groceries from the comfort of their own homes and from a larger variety of online retailers. This resolution will also help prevent additional cases of coping 19, since snap users would not have to leave their homes to purchase their groceries and allowing additional retailers to participate, and the purchasing program would help promote local businesses and grocers that have suffered financial losses due to the pandemic. So I invite you all to join me in expressing support for this resolution, as it will benefit this community at large and that increased public support for this resolution will help speed up its passage and provide access to food to so many New Yorkers who are currently suffering. Thank you. I appreciate the presentation. I would also say please, if you will work with the board office as well. I think the information that you provided could be useful to our community and the area that we serve for CB2 and the office will direct you to the appropriate committee for additional information and possibly a presentation. Thank you. You're welcome, I believe those are all of the speakers. Let me just check us chat. Open session has completed all right great. Is there any other business to come before a community board to this evening? There's no other business, but I do have a request for the board to continue off a minute John hold on so are there any possible elected officials or representatives that we may have missed, because you didn't have the opportunity or you may not have been aware to provide your information in the chat? If so, please unmute yourself and announce who you are and where you're representing. If you are an elected official or someone that we missed under our list of dignitaries so hi, this is Olavia. Bello I am representing assembly member Simon's office. She couldn't be here tonight, but I wanted to introduce myself, I'm actually new to the role. So this is my first CB2 meeting and thank you so much for having me here. I look forward to attending many more meetings. I just briefly want to say that the Java with Joanne is scheduled for next week, which I already put on the chat. So if you would like to attend and speak with Joanne just email, our office- and we can get you on that list. Thank you. Welcome to community Board 2 glad that you were able to join and I'm glad you were able to introduce yourself. Thank you. Is there anyone else before we proceed with the next item? Okay, great Mr, dude, you were about to say something: yes, I wanted to put out a request that we consider the formation of a pandemic type committee. This virus has taken over everything that we do and we are approaching it on a very much piecemeal basis, and it's about to take off again all hints are that it's going to get far worse than it is today. They can't see the light at the end of this tunnel and things are going to just change markedly for everything. How do we get a handle on what's going to be happening and communicating it with the respective community? So that was the other issue. How can we get our messages out to the entire community in a better way like a twitter or some other kind of account that allows us to share all of this good information about homelessness and food and the like, and what to do in the event of a homeless person on the street, of which there are way many offices? Now we need a way to communicate better with our community all of this stuff that's available for them. It was just an idea. I wanted to put out for the board to consider. Thank you guys for that idea. As a reminder, maybe to some or as an announcement to others, the board office and particularly Taya, did an excellent presentation on communication platforms. The way we can you know we can use different technologies to provide information out to the community. It was agreed upon at the finance and personnel committee meeting and through the support of all the members who participated in the meeting. I think it might have been one of the first general body meetings we had during the pandemic that the platforms that we have were the right way to go. As Mr Perez has mentioned at different occasions, we are still getting comfortable. The board office, that is, with the remote work schedule that we have, and so there are suggestions, ideas and plans underway to be able to use different platforms as I've instructed the board to do continue to use the platforms that we use today to communicate, but we're going to take each one of the different platforms, one step at a time and Rob correct me. If I'm wrong but I believe we agreed that the first platform we would use to communicate in a different platform would be Twitter and then I think after Twitter we would look to you know, broaden it out to Instagram and I think other platforms. The one thing I want to remind everyone is that it's nice to have the platforms and we definitely need to use them. There's no argument there, but keep in mind it's not the platform, it's the maintenance, somebody being dedicated. It's the resources and what it takes to be able to make sure that we're not putting our stale information and that what we put on one platform we put across all platforms so that there aren't any inconsistencies. So it's not like it's fall short falling short on the district office or even myself. We just want to be smart and be methodical on how we do it so that there's no degradation in the quality of information that's being presented any of anybody else with something to mention for open business for other businesses. Thank you, Mr, chair, I, want to ask you Lenny is: are our colleagues from the Brooklyn public library still on the call or on the meeting? Yeah cat is still here. Okay, I, don't know! This is really your thing, but I just wanted to note that there is the upcoming radio play of the Christmas Carol. This Saturday, which I have gone to the live performance for the last two years. It was wonderful, it's only an hour and it's an upbeat thing in this holiday season. Did you want to say something about that? Thank you, John. That's very kind of you to bring up. So that's probably a Bpl presents or a Brooklyn heights program. Yes, it is thank you yeah I, don't know, I can pull up that link and share it in the chat, be more than happy and to do that, and thank you again sure it's this Saturday and because of Covid-19, it's continued with theater 2020 online and there's a registration that I think one has to do if not 48 hours in advance at least 24 hours in advance. It's a wonderful production and I look forward to attending again virtually this Saturday at 2. Thank you Lenny sure, I'll just add for those who may have had the benefit of seeing Tracy Manchum's face when John mentioned that she lit up like you, should like just open up a Christmas gift, it was nice, Tracy I, think we can hear you now so I know we bypassed you earlier and because you've been a long time friend of CB2 I wanted to give you the opportunity if there's something you wanted to share. Oh, thank you I'm laughing because I remember last year, John was talking about how wonderful the production is. I just put the link in the chat, and you should definitely take his advice and sign up and attend. It really is a popular program. Thank you and have a good holiday me too. All right great! Thank you, speak hello. I'm sorry who was that Sam hi? This is Sam Johnson, so I just wanted to see. Oh here we go hey a recommendation to the board to possibly reach out to some local mutual aid groups that are doing work in our district and community. Board too, if we haven't already spoken to a few I think it would be very enlightening to know what is currently going on the ground and also what we're hearing from community members in regards to food insecurity. Yeah so I know that they've been different. We've had at different times discussions about food insecurity. I definitely want to thank Betty Fybush for being the voice on the board about that. Betty has connected us with other organizations. Betty has really had a personal passion for having community board to address that, and if I'm not mistaken, they have been different invitations. That Betty has extended to members to come to the youth education and Culture Affairs, Committee and she's also been very active in providing that information to the board office so that we can have those presentations which have already which some have taken place before the health environment and Social Service Committee. So without going into a lengthier response, it is something that is top of mind and I appreciate you for reminding us and keeping that at the top of our thoughts. I would strongly recommend that if there are specific questions that you have that you reach out to the board office, let's see how we can perhaps get you connected with Betty and Brendan Smith, because those are the two individuals on the board that have you know: risen head and above shoulders versus others. While we all have the same concern for that cause. Lenny, yes, for people who are using parent transit as well as Ehil for our accessory customers that will be free until further notice and there they're also doing a lot of improvements with trying to put in elevators at certain stations. That's also trying to go through MTA as well, so that those projects are still going on as we speak right now. Victor. Thank you for that information. Have you communicated or shared that information with the board office I? Can't I've been so busy running around? If you would you please send that to the office so that we can get it out to the broader community and share that with the members of the community board? And let me also say I'm glad you were able to join and I want to thank you for being a voice that always gives us the information and make sure that you know we're inclusive of all the people that we represent in community board too. So, thank you. Anybody else. So listen! Thank you. Everyone I appreciate you participating this evening. Thank you for the vote of confidence by reelecting, the executive officers of community Board 2. Happy holidays be safe, wear mass social distance and, at this point, I'll entertain a motion to adjust so move Mr Chair. Second, thank you be safe. Everyone take care, safe, everyone and a happy holiday to all.",
            "summary": "Yes, There is one I had made a comment about the community board's involvement in the closing of Fort Greene Park I.\nAnd we'll make the noted corrections and if you know once we move on, If anybody has any additional comments by what means, please send them to the board office.\nI would also add that I've had the opportunity to communicate with for a hall on several occasions, and the governor has extended the order for the public meeting law so that we can continue to work in a virtual environment.\nYou, know counseling advice from the president's office as well, So you should expect to hear more on that we I was going to have a portion of the meeting tonight to discuss the results of the survey that each of you participated, in, but there's still some information that we had to refine for that.\nI found it very insightful to know the makeup of the community boards members, their interests and some of their backgrounds.\nOther thing I wanted to mention is that you know moving along to the next item.\nI have been very focused, working with the board office and the district manager and everyone to make sure that we change up the way the information is coming out with the district manager's report, as I mentioned at other occasions, and I, don't want to be repetitive.\nBut I felt like it could have a refresher and a more meaningful way of information, As opposed to just a series of bullet points and paragraphs of the activity, That's happened in the office, and so there is no district manager's report today, because I've asked Rob to make some additional changes.\nNext item on the agenda are committees for action and at this time, I'd like to turn it over to Mr John Quinn, who is our parliamentarian to discuss and address the first item for the nomination.\nI, cast the vote of the entire board for the election of Barbara Zayler Gringa, as second vice chair and there being only one nominee for Secretary Jessica Thurston.\nI, cast the vote of the entire board for the election of Jessica Thurston as secretary, and that completes the work of the nominating committee for this year.\nYou know what I would say is like many of the train stations that are adjacent to new development, those stations weren't, designed with the density that is now existing in downtown Brooklyn in close proximity to those stations.\nSo, I think there's a plan, there's a clearly an expression of wanting to have a more adequate, appropriately designed platform for the train stations that support that.\nApplication here is to sell city-owned development rights from underneath the Manhattan bridge to the adjacent property owner, Who would then use them to build a larger building, I'm sorry, there's a question.\nThe congestion issue is outside of the scope, maybe of dealer, for they think the addition of the commercial space will continue to add to the congestion as well right, now, I, think we, The general feeling, was that this, the whole project was going to be a problem for the community and especially with congestion.\nIt's been covered at this point, but I just wanted to be clear that it was an EDC initiative to give all the development rights from the D.O.T lot under the bridge to this building that results that would result in the addition of about six floors or just under 100,000 additional square feet strictly of commercial space at a building that, as Carlton pointed out, is already going to be built strictly as residential.\nYou know this was very much a negotiated sale despite the fact that an RFP was issued, The city is looking to monetize development rights that they can not use underneath the bridge and they are getting an eight-figure sum of money for those development.\nThe application is going to proceed and potentially either the borough president or the council member will ask for certain conditions for their support, but the chance of the application being withdrawn and the city just foregoing that income are highly unlikely.\nI do not know the outcome or what the testimony entailed at that meeting in the second point, I wanted to make it Rob is right.\nIs this something you wanted to ask I wanted to add that we at this point have to take a stand on what the city has promised us in terms of the community benefits and the upgrading of a train, station.\nLet me just backtrack a little bit because I know we have a lot of discussion on this motion, but maybe it's me who second, the motion.\nJust also pause here, especially for our community board, which affects heavily in gumbo, which was flooded in the last hurricane and also parts of the Brooklyn Navy yard.\nThe set of zoning recommendations would provide for homeowners, businesses, business owners and practitioners living or working in the city's floodplain, the opt to design or otherwise retrofit buildings to a reduce damage from future flood events be resilient in the long term and c, potentially save long-term flood insurance.\nThese recommendations build upon the New, York City Department of city planning work with communities throughout the floodplain since Hurricane Sandy in 2012, which identified zoning and land use strategies to help reduce flood risk and support the city's vitality and terminals and improve upon existing zoning rules that were adopted on a temporary emergency basis following Sandy, which is set to expire in the next couple of years.\nIt's, not so much a change of zoning, but these are optional rules, so that, as buildings are being worked on or being built, especially in Dumbo, and probably at the Navy yard, as well to allow for resiliency in case of you know, When the waters do come up a little too high in our community.\nBasically, For our purposes we're trying you know we looking or actually what city planning is looking at.\nAfter discussion with the Department of City Planning representatives, We voted in favor, ten zero with two abstentions, and we asked for the board to support these efforts.\nAgain, It's not mandatory efforts, but these efforts by the Department of City planning to protect our for our coastal community in our board.\nAs a follow-up I just want to ask so in the future, developer was going to do some development and they came to us as a community board.\nClips, that's a encapsulation or regurgitation that appear in a whole lot of media that came out in the last year and the army corps of engineers that has a peace with this on a federal level in its it has some impact on flood insurance, but it also has to do with reliable recovery and relief efforts changed the way it's a kind of a sudden inequality, their requirements for things, and they have approached various cities, they're rolling it out on a city-by-city basis and a state-by-state basis, where they're effectively telling the municipality that in time frame have a certain amount of the property, whether it's publicly owned or privately.\nThank you, chair, Singletary I did want to provide the update in Ms, Peterson and Mr Pinoy's absence, because we had a great presentation last week from the Brooklyn navy yard and they provided a lot of helpful information about how they've been responding.\nCovid-19, how their businesses have been responding and what they've been doing for the community and overall, It's been a challenging time, but there's some good news, so at the Navy yard.\nThen they're also running an internship to a long-term employment program with about 40 recent CUNY graduates, Who will have the opportunity to start working for yard-based businesses and potential on an internship basis and potentially be employed long term, So I, don't know if there are any questions, but otherwise that was pretty much it for the last meeting and happy holidays to everyone.\nThank, you, Mr, Singletary, Good, evening, everyone, The committee met on November 30th, and one of the things that we had on our agenda was on a budget.\nStaff is pretty much working at home, except for Mr Paris, and our executive committee is meeting online, so the money that we used to spend for meals or for let's say, sandwiches.\nSo, while I think many people would wouldn't mind having a community board meeting that only lasts an hour.\nDepartment of Health would note that back in 2018, it was noted as one of the leading health issues for our area, the childhood asthma, and we want to make sure that we stay informed and aware about the issues that are going on.\nJanuary 6th, so stay tuned, Any questions for Mr Smith hearing, none next committee to report Parks Recreation, Barbara, Zoller, Grinder, Everyone, first of all, Thank you for the vote.\nWe had a lot of people who were not on either committee talk about their concerns and we really did not have anyone from outside the community board talk about not taking down the statute.\nThere's a lot of discussion among members of the committee and other people who are on the meeting about what they do.\nI've asked the rest of the committee of the Community board to be patient.\nA lot of folks turned out despite the weather, and you know, Hopefully, in a short while there's no delays, there will be a new extension to the Brooklyn bridge.\nCommunity, Board action report about the borough hall having its hearing on November 30th, and somebody said they weren't able to see it just to let you know it is up for anybody to view.\nIf you got time, that's you know, You can spend four hours looking at the hearing so and then another thing was discussed, I.\nThere were some more questions that might have come up after that committee meeting and that presentation I just wanted to let everyone know that Candace is doing a workshop for non-profits and for schools on the capital budget process, and what I'd like to do is as soon as I can do.\nBrooklyn-Usa. If you want to learn about all the things that our president is doing, you can find it there and if anybody needs to reach me, I will put my information in the chat.\nThe this report assigns letter degrees to 32 mayoral agencies, plus the comptroller's office, unlike other M/ WBE reporting produced by the city of New York, making the great measures the actual spending of each agency in a fiscal year.\nAnd I want you to know that the D.A and his team, including my unit, the organs, the office of public engagement, really for the past.\nSix weeks, have been out in the community at many food distribution efforts that the D.A has led and partnered with throughout Brooklyn, and these are you know, from crown heights to Coney Island to bed-stuy all over the borough, and so D.A wants to really be out in front with leading the effort to make sure that our residents are being accommodated properly with nutrition.\nAnd I wanted to ask Tracy if I missed anything or if you needed to add anything Tracy reports via the chat panel that she's unable to mute, but she did include some links about programs at the Clinton hill branch and, Just speaking, personally, very excited that grab-and-go moves closer and closer to my office with each iteration.\nSo I mean if you have any questions, please let us know, and that is all thank you.\nYou appreciate the update and continue to work with the District office, Mr Paris and the team and we'll be sure to try to get on that.\nI am coming to you from the community school of Public health I wanted to speak on the issue of food insecurity and this district alone 24 to 34 of households, experience, food insecurity, and these rates continue to rise as a result of the Covid-19 pandemic, with which we had spoken a lot about this.\nThis resolution calls for the expansion of the number of retailers allowed into the snap online purchasing program to address the challenges facing vulnerable communities in New, York City, when accessing food.\nThe information that you provided could be useful to our community and the area that we serve for CB2 and the office will direct you to the appropriate committee for additional information and possibly a presentation.\nCan we get our messages out to the entire community in a better way like a twitter or some other kind of account that allows us to share all of this good information about homelessness and food and the like, and what to do in the event of a homeless person on the street, of which there are way many offices.\nAs a reminder, maybe to some or as an announcement to others, the board office and particularly Taya, did an excellent presentation on communication.\nThere are suggestions, ideas and plans underway to be able to use different platforms as I've instructed the board to do continue to use the platforms that we use today to communicate, But we're going to take each one of the different platforms, one step at a time and Rob correct, me.\nThank you, Mr, chair, I, want to ask you Lenny is: Are our colleagues from the Brooklyn public library still on the call or on the meeting.\nI think it would be very enlightening to know what is currently going on the ground and also what we're hearing from community members in regards to food.\nAnd she's also been very active in providing that information to the board office so that we can have those presentations which have already which some have taken place before the health environment and Social Service Committee.\nHave you communicated or shared that information with the board office.\nAnd I want to thank you for being a voice that always gives us the information and make sure that you know we're inclusive of all the people that we represent in community board.\nThank you for the vote of confidence by reelecting, The executive officers of community Board, 2."
        }
    }
}