{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "Manhattan - SLA & DCA Licensing Committee",
            "publishDate": "2020-12-08",
            "shortDescription": "Agenda\\n\\n1.    Approval of previous month's minutes\\nHotel Applications\\n2.    Orchard Street Hotel (Nadico Hotel LLC \\u0026 Bridgeton Hotel Management), 163 Orchard St (class change/wb)\\nNew Liquor License Applications\\n3.    Mama's Bar (AH Business Management LLC), 34 Ave B (op)\\n4.    Peppa's Jerk Chicken (San Peppas Jerk Chicken Express Inc IV), 90-96 Stanton St (op)\\n5.    Tacombi Rapido de la Union LLC, 127 4th Ave (op)\\n6.    Brooklyn Dumpling Shop LLC, 131 1st Ave (op)\\n7.    Trapizzino Les LLC, 144 Orchard St (upgrade to op)\\n8.    Vin Sur Vingt Wine Bar (GVI East Village LLC), 170 2nd Ave (wb)\\n9.    Plado (Germat of NY Inc), 192 E 2nd St (upgrade to op)\\n10.    Crif Dogs and Please Don't Tell, 113 St Marks Pl (op)\\nItems not heard at Committee\\n11.    Forgetmenot (Plan A Group LLC), 138 Division St (corp change/op)\\n12.    The Ten Bells (Flora \\u0026 Jasper LLC), 247 Broome St (corp change/wb)\\n13.    Yoppari (Oec International Inc), 69A Clinton St (wb)\\n14.    Vote to adjourn",
            "lengthSeconds": "3:24:44"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "ISkaqQBM5f4",
            "fillerWordCount": {
                "uh": 317,
                "um": 446
            },
            "readTimeFullTranscript": "107 min read",
            "readTimeSummary": "17 min read",
            "wordCountFullTranscript": {
                "music": 101,
                "hours": 77,
                "applicant": 74,
                "bar": 74,
                "floor": 64,
                "food": 54,
                "business": 51,
                "operation": 48,
                "service": 47,
                "security": 47
            },
            "wordCountSummary": {
                "music": 36,
                "hours": 34,
                "floor": 22,
                "hotel": 18,
                "food": 17,
                "service": 17,
                "bar": 17,
                "background": 14,
                "applicant": 13,
                "space": 13
            },
            "fullTranscript": "Okay, so tonight's meeting is being recorded if you're, not a committee member, please sign in with your name and affiliation in the chat box or any item you would like to speak to in the chat box. Please keep yourself muted. Unless you are speaking, please raise your hand if you wish to speak on the desktop computer, you can go to participants list. There's raise your hand button at the bottom. If you're on a cell phone dialing it it's star, nine, you can use the chat box if you are having technical difficulties or there's something you need to point out, but please do not use this for side conversations. It becomes distracting and unproductive. It would be just like, as if we were having side conversations during a normal meeting. If that becomes the case, I will turn off the chat. The order, the meeting for each application. The chair will give a brief summary of the application. As it's been submitted. The applicant will then have a chance to speak after that. We'll call in any members of the public that wish to speak or ask any questions. The applicants will have a chance to respond, and then the committee members will discuss and come to a resolution and with that being said, Alex I think everyone is here, except for Herman. Yeah I send him a text message. I'm waiting for people to sign in so that I could take a good accounting of attendance. I'm sorry to chime in so early, but the only one available is Clint. I just want to make sure that's, okay, maybe it might be why Alex is not seeing the signs. Oh yeah, you know what the last meeting got a little out of control and I turned the chat off sorry about that. Actually this may have been from a previous meeting, but I will yes, I will adjust that. Thank you. Okay, that is corrected. I, think you should be able to see I can't I, don't think I can see what was previously typed. Oh wait, no, never mind it's coming. Okay, have you seen whether or not Herman's signed on he has not nope he's not shown up yet. Okay and I haven't heard that I'm just double checking the chat. I haven't had a response from my text to him, but we can start I see there are more people other than the ones who just signed in yeah Alex. There were a couple people that I did think did sign in the beginning when it was just only to me that maybe wouldn't come back over so okay I'll send you through the list. At the end, it's okay I try to keep my own list because sometimes different from what the chat has at the end of the day. Okay, all right we're going to begin good evening, everyone- hopefully this won't be a long meeting. There are five items. Sorry, I'm just waiting we're going to begin first with the approval of our previous month's minutes and then we're going to move on to the actual agenda item Clint. Can you do that yep? Thank you. Okay. Everyone had a chance to review the meeting minutes from last month. Does anyone have any changes or corrections? Okay, all in favor of approving Michelle, Cooper Smith, yes, Ellen Lowe, yes, Herman Hewitt is not here yet and Alexander Militano. Okay. So, moving on to item number two: it's a change in class application for a hotel, the Orchard Street hotel at 163, Orchard Street, I'm going and just for the benefit of the people are here. I'm going to summarize the information that I have about each application then give the applicant and or the representative of the applicant an opportunity to speak to see. If there are any speakers in the audience who want to speak or have questions about the particular item and then the committee members will ask any questions they have and then we'll move to the making of a resolution. Excuse me with respect to this application. This is a change in class from a tavern wine to a hotel line. The applicant submitted a statement that it is applying for hotel wine license with second, with its second floor, closing at one A.M Sunday through Wednesday: two a.m through Thursday through Saturday, a ground floor lobby closing at 12 A.M Sunday through Wednesday, two A.M Thursday through Saturday Ground floor outdoor seating on Orchard Street, closing at 10 pm Sunday through Wednesday and 11 pm Thursday through Saturday Ground floor outdoor seating on Allen Street, closing at 11 pm Sunday through Wednesday and 12 A.M Thursday through Saturday and 12th, for if they put 12 floor. But it's the rooftop closing at 2 A.M Sunday through Wednesday and 1 A.M Thursday through Saturday, while the tavern wine is limited to its second floor. Only with a closing time of nine pm. So we originally heard this hotel for a hotel op license in 2014. We heard it twice and we denied it for a number of reasons, but probably principally because without a restaurant it could not have a hotel op. Then we denied an op license for the grand floor and basement in December of 2014 and then heard the tavern wine license for the second floor. In November of 2016 and approved with stipulations to operate a tavern lounge with prep area serving food, all hours having service and sale of alcohol, limited to the second floor, having hours of 9 am to 8 pm all days, having no music having no kitchen having no speakers tvs or monitors installing soundproofing along the walls and installing soundproof barriers and planters along the parapet. Walls on this floor having happy hours to 8 pm, not hosting pub calls or party buses, not having unlimited drink specials having its entrance through either the Orchard Street or Allen Street entrance, maintaining low-level lighting not having weight lines and having to step outside and not seeking an upgrade. This is 11 an 11-4 hotel with nine floors for lodging. The main entrance is on Orchard Street, but there's an entrance on Allen deliveries and access to the second floor bar would be on Allen Lighting. It says consistent would remain the same consisting of two to three sponsors. There are 32 tables, 98 seats in the public spaces, an eighth foot bar with some stools. On the second floor, a preference serving food, it says to within 30 minutes of closing a limp with a limited menu with an unspecified intent to expand a closed. It's just closed facade that the second floor is actually an open arcade which we'll I guess we'll get into when we have a discussion about the elements of the application. No tvs recorded background music without music on the ground floor patios. Those would be the ground floor, outdoor bases on Orchard and Allen no promoted event scheduled performances or events with covers, but then, in the stipulations as part of the questionnaire, there's no agreement to no djs like music, promoted events or scheduled performances. It says one private party per night, no pub, crawls or party buses happy hours to 8 pm, no wait lines and plans to use the lobby as a waiting area for the second floor. Just licensed security, if necessary. There's no agreement about that. Having people responsible for overseeing crowds and noise outside the particular specs for the public spaces would be the hotel's 460 square feet with a capacity of 15. and I'm going to ask that the applicant is making your presentation that you include actual opening hours for the spaces, because all I have are closing hours so closing at 12 A.M Sunday through Wednesday 2 A.M Thursday through Saturday no bar food service from the prep area. It says all hours of the second floor bar cafe is 1400 square feet. Capacity is 50, 20 tables, 46 feet and 8 foot bar with the stools. Closing at 1 am Sunday through Wednesday 2, A.M Thursdays through Saturday. It says, surf food service from the prep area recorded background music. The rooftop 445 square feet is overlooking orchard, as opposed to Allen capacity is 28. It says for hotel guests only four tables and 20 seats. Closing at 12 A.M Sunday through Wednesday 1 am Thursday through Saturday, no barn or food service recorded background Music Orchard, Street, Ground, Floor patio, it's 360 square feet capacity, 16 core table 16 feet. Closing at 10 am Sunday through Wednesday 11, Pm Thursday through Saturday no bar, and it says what you may have to explain: food from prep area purchased in hotel, no music, I assume that meant people are buying the food inside and bringing it outside and sitting down. But please explain that during your presentation. Allen Street is the same with respect to tables and chairs. It's 400 square feet and the proposed closing hours are 11 P.M Sunday through Thursday 12, A.M Thursday, through Saturday and in response to proximity to residential windows, which is a component of our hotel application. The applicant just wrote now the license the timer and one license was issued, August 22nd of 2017. okay. So please make your presentation or any clarification or statement that way you want to make and then we'll go into audience questions and there are questions yeah, so am I unmuted, I'm Elky Hoffman, I'm working with Orchard Street hotel on this change of class application and the hotel manager. One of the principals is also on the call, so they may be able to add clarity where I can't, but essentially can you introduce them for us, so we know who they are. I wrote down their names from the chat, but yeah you have Philip Chamb who's, one of the managers and Isaac O'harb Shalom, who is one of the principals? Okay so and my video light just dropped off. Okay yeah. This is an application to change the class of the hotel, I. Think initially, you know this is a new applicant, a new client for us, but they had originally applied for hotel liquor and were not I. Think aware of this option to do hotel wine, and so you know right now. The only licensed area is the second floor. Tavern and you know, I did a site visit as well. So it's I think it's considered a terrace, but it is fully enclosed. It's not an outdoor space, it is so there's no change to the layout, though the eight seats at the bar, the layout and the seating arrangement you have on the second floor is the same: there's no physical alterations. Being made, the idea would be to expand it to a hotel, wise hotel wine license to allow room service in the interior lounge and on the roof and the outdoor spaces outside the pro part of the problem. It's been a little bit of a chicken and the egg thing for food service. They've, had negotiations with food operators to increase and have a little bit more of a restaurant menu and they've spoken to a sushi chef and a tapa chef, but with hours of 9 p.m. It's not worth it for a restaurant operator to come in. So in order you know, being able to expand. The food service is in fact tied to being able to serve later. On that second floor, currently, there's not room service allowed in the rooms. The rooftop use would be purely an amenity to the guests as well. No, it would not be outside patrons that were, would be allowed. There's no bar service up there. It would be hotel guests who would be allowed to then take their wine and sit up on the roof. The clarification about the buying food in the lobby. The idea would be to have a little bit more grab-and-go selection to have food service in the lobby area. So that's exactly correct. People could grab their sandwich or their snack their coffee and take it to the own street lobby and take it outside. There's not set table service and the same with the rooftop too. You know people there's not necessarily a waiter taking orders up on that roof you, but you. If you were a guest, you would be allowed to use that area for service or for to lounge, and it's a pretty small space. It is surrounded. I did a walk through. You've got about seven foot high plexiglas walls around the outside of it, and it's you know it's not a particularly large space, and so the proposed occupancy here is 20 people. I've tried to break down, you know the, even though it's a hotel wine license and so I didn't include opening hours. The principles could probably give you a better idea of exact opening hours, because of course you know there is your breath when the hotel is open, which is not now there is breakfast served. So there are areas that are there's a breakfast cafe area, but it's not service of alcohol for morning, coffee and breakfast, so this is Phil Phillip, I'm at the property manager, I came on board in 2017. I wasn't here when they applied for the liquor license, but I was here as soon as we just received the liquor license to be able to do this, so I've been operating the space for since it's been open and since we've started being able to serve on the second floor, make a couple of points. We've had never had any issues since we've started serving beer and wine we're very responsible. It's really, if you know the Orchard Street hotel, it's a small 50 room hotel that is almost like a select service with a little bit food and beverage. We use it as a really as a amenity to the gas to be able to drive sales and be able to make sure that the guests have a good experience than just here's a hotel room, and then you know and that that's it I think right now. It's you know, it's extremely important that and cover 19 and post 19 environment that we have these amenities in order like you, need the right type of amenities to just even survive here right now, just to drive as many people to stay with you as possible and right now how it is at 9 pm just to give some specifics is that you know right now: we've had lots of complaints and that it's not really mean what we have is not meaning what the guest expectation and the need is right now, because you know people, if you think about you, can't we it's just beer and wine and we can't even serve them after nine. You know dinner right once you have dinner, you jump. Even if you have an early dinner, you come in. You take a seat, you wanna, you grab one drink and you wanna sit down. You can't even drink past nine o'clock, it's it they're, all small lounge bases. It's not a party zone. The bar, where we serve, is also duels as the breakfast area, where we serve complimentary breakfast in the morning for the guests, so you can kind of see where that is and the other guest complaint one is like they can't even have a drink when they want to, and the second thing is they can't drink in any of the locations besides location here, so if they want to bring it to their room, serve them in the room. You know even go to any seating space in the lounge have a it's too loud in there. They want to go into the lobby and have a drink. They can't so really it's the biggest complaints for us and for us to be able to just try to survive in this culved area covered environment and just to give ideas. The prediction right now is that New York City industry will not return to 2019 levels until 2024, so right now, every little amenity for us is to really just help us survive right now and I'd like to we're open at four, we were opening at 4 p.m. For the bar, that's the opening time we were having before we were open for breakfast, with no alcohol and at four o'clock, four to nine. You were serving here in Y, so what I'm I think? Maybe this just requires a little focusing of this conversation. I think expectation here is a hotel wine license and it's a change in class I, don't know that anybody is going to deny it, but it's a hotel. So there are specific pieces of information that we need in order to construct a resolution which is not like a resolution. That's constructed for any other kind of business, it's much more expansive, because the hotel, the last resolution was very limited because it only pertained to one floor. So I'll try to focus the conversation a little bit more because I'm not getting the information that at least I think I need, or my committee members need to be able to construct any kind of resolution. So, let's go through the different spaces. The proposed opening spaces were the two outdoor patios. What would they be? That would be on Orchard Street and Allen Street Correct, Orchard and Allen Street. So the opening time Phil, what's what is your opening time for those areas that would be like noon or would it be later in the day I think it'd be a little bit later in the day, if we had lunch, there's different things. If you're you know, but I'm thinking if it was just currently how it's set up, it'd probably be like we were opening at four before, but I would say maybe a little earlier in the weekends, maybe like, maybe at 12 o'clock, because the thing is just whatever need I need you to give a specific time, because I'm going to construct a resolution of stipulations from those times or I'm going to change or we're going to change them during our discussion, but we need a starting. Would it point something like and Philip correct me, yeah or Isaac feel free to jump in if you're talking about you know a little earlier like opening at noon on saturdays and Sundays and like 2 p.m, on weekdays? Yes, can you guys hear me I apologize? Yes, I'm in agreements with Ellie with Elky there, okay! So then, the proposed opening time for the second floor area would still be consistent with the 4 pm. But again it is a cafe that is also used for breakfast for the yeah like this is just for future reference. If we were to ever try to have more of a lunch time, would it be just good to say 12 o'clock just to say if there's lunch to say, 12 o'clock every day in case they're someone you were able to serve some lunch? Yes, I think you should you. Have it now open for breakfast? What time does it open for breakfast? There's breakfast for the guests: yeah breakfast for guests, but it's continental, so there's no alcohol service on there. When does it? Okay, so it opens for the public at what time four o'clock right now: okay, the rooftop! When were you expecting to open that? Also at four o'clock in tandem with the second floor? Okay, I'm sorry Alex just did we just say just for my notes. Did we say 4 p.m! For the second floor, open and 12 p.m. Sorry, yeah! Okay! Yes, that's what they're saying 4 p.m, on dates, but I think for the year second floor. It makes more sense to put down if you're drafting stipulations noon, because I think the idea would be to happen. We haven't even gotten to them. Okay, we haven't even gone to the negotiation part okay, so you don't know what they ask. You're talking about noon all day, noon on weekends, all day, okay and then the lounge area I mean the excuse me, the lobby area I. Think our hotel is very small, so you know personally I think that it should be 12 p.m in most spaces, because, if someone's having lunch and they just it's really just walking down the side, it's not a large place with lots of different areas, but I'm not negotiating with you now I want you just to tell us what your proposal is. Yeah, let's make noon the proposal for all the spaces. Yes, don't you have 24-hour accessibility for your lobby? You do or do you open your lobby at 12? Obviously the hotel is open and guests. Are there 24 7, but you're? Not you ask about service and areas, obviously the hotel, if you want to put it that way, you know floors three through 11 are 24 hours, because it's a hotel. No I'm asking about the check-in. The lobbying check-in are manned 24 hours a day and we can lock the doors at a certain time frame, so we can lock the doors at a certain time for safety of the front desk and everything, especially with the variety okay. Let's separate out the second floor, are there any facades that open anywhere else, so the lobby facade? Is it fixed, they're, fixed I went and yes they'll on both the Allen Street Side and Orchard Street side, that's correct, okay, and what is the facade? Is it just a door or is there something more on the rooftop just the door? Okay, now you mentioned food service from the lobby. I thought that the only point of food service was the prep area. On the second floor, do you actually have another area where food is served? Just so we know. No, the food will all come out from the second floor. Okay, so even food for purchase that somebody might take and sit on the patio whiff that would come from the second floor, also yeah, sorry Phil. Yes, it would come from the second floor. Okay, all right, I'm only clarifying that, because Elsie said it would come from the lobby, so I just wanted to make sure that it clarified that no I think okay. When we heard this in 2016, we had some concerns with respect to the second floor and I just want to ask you if you can speak to this now, rather than us having to go into more of a discussion about it later, you might be able to answer these questions up front, which would clarify everything for the committee and anybody who's listening, and it was an open air arcade with four foot parapet walls and then this funny not really like glass or plexiglass barrier that went from the fourth foot to the ceiling on both sides because of that and in the process. At that point, the person who showed up said that they had been in the process of getting approval from DOB to amend how that area was constructed to make it more enclosed. Now, he'd also told us that at 2014, so that had yet to happen in 2016. I have two questions, so has anything been done to change the structure of it? When I look at photographs, it looks the same as it did in 2016. and the other thing is when we approved it in 2016, it was understanding that there would be certain types of sound proofing implemented on the south and north walls and also sound proofing. Their proof barriers erected in front of these open areas that are on or just straighten out has any of that been done. So I'm asking: has there been any DOB plans to con to change the structure so that it's foreign closed and has have any soundproofing efforts been made with respect to the second floor, which was part of our stipulations in 2016. Phil? Do you want me to take this or yeah, I'm not aware of myself, but it's just yeah. So, in regards to DOB no, we have not gone for them to change the structure and then in terms of sound proofing. Yes, we've installed thick I, don't know exactly the material, it's a very thick plastic material, that's lined, and that provides the sound proofing for the north and south walls, so the north and south walls when I look at the views in pictures, the north and south walls are the concrete walls that are abutting the buildings on either side right. The plastic walls that I see are the things that were represented to us in 2014 and 16 as being nanowalls. I could go to my minutes to see what that description was, but that's what I, unders I think you're. Referring to when you talk about the plastic walls, which are what the barrier is from the fourth foot of the top of the pair yeah sorry, my orientation was off I apologize. Okay, so is there any sandproofing on the north and south walls, which are the interior walls that abut the buildings on either side of you? Yes, we have sheetrock laminated walls, so that provides the insulation from sound North and south okay, and the final question I have is with respect to this rooftop, which in which you're proposing to have recorded background music. What is your plan for how you're going to pipe that music out onto the rooftop most likely it's going to be something like a sono speaker and yeah, just a portable light sounding speaker: it's not our intention to make it a loud rooftop at all, so you you're, saying one speaker would be about one to two speakers: small speakers yeah, probably about two speakers in that space, because, if they're small, this one is small ones and where would they be positioned, they would be positioned on the core side of the space, so not in the out most part of the outdoor area, but probably closer to the elevators to keep the sound more insulated and where would they be mounted? They would either be floor sitting or mounted to the core, which would be like the elevator, where the shaft is, but these probably wouldn't be mounted speakers. Okay, Clint are there any people signed up to speak to this. No one signed up in the beginning. Is anyone interested in speaking to this item? Nope I see no one, okay committee members: do you have any questions or comments? I, don't nope I! Think I'm good! Well, the two things I was concerned. Is you asked the questions and it was clarified without about that? Those walls that you know that I think is situated next to the adjoining building. I'm sorry say that Carmen I couldn't hear you say that again, I could remember back. Then there was some wall that did not go all the way up to the ceiling, what they were supposed to install walls that would act as a sound barrier. So yes, that's what they said they did, but the wall sounds like they're what existed in 2016, when we heard the application for the Tamar and wine license. Okay, which are like these movable they're like they look like Plexiglass, almost they're, not glass, because they can't be fixed and they refer to them as nanowalls. They maybe could give a better description of them, but they were in the space in 2016 when they applied for the tavern wine. The change was that we had been told for two years that they were going to try to create a more fixed structure to enclose that area, but they needed that area. It's a variance. They needed that open space in order to be a 12 story. Hotel. So is that near where the food would be? Now that? Yes, that's where the prep area is for the food okay, so we can go through what a resolution would look like if you want to do that, we can move on to resolution committee members and go through the different areas and what the stipulation should be for the different areas, starting with the easiest ones and working our way to the more difficult ones. But a resolution I think should include what they're applying for that is the changing class that they're amending their public uses. What each of those public uses that their proposed, what each of their is proposed to be what the history has been and when the license was issued, which was August 22nd of 2017, and then we can decide how necessary it is. We can say that they have been operating without any. They say they have been operating without any issues. I don't have any record of complaints or seeing any SLA violations. What I'm open to what the next group of whereas clauses would be I have some proposed language. I think that I've been the other graph, but I'm open to amending them and I think they would primarily deal with the second floor and maybe the rooftop. So if you want to go on to what the actual stipulations are, we could go to those and then go back in a hotel resolution. We should have general stipulations the stipulations that the entrance is the entrance on Orchard Street, the primary entrance, or do you use both Orchard and Allen? Primary is on Orchard Street, okay, so, with the primary entrance on Orchard Street that the loading and unloading of guests would be on Orchard Street deliveries is it do you have garbage pickup, also on Allen Street I have to I'd, have to verify that I think it's actually on portrait street. But let me tell I think it's on orchard actually, where we right now currently we'll be throwing refresh so deliveries on Allen, Street, Happy hours to 8 pm in any publicly accessed area, no pub crawls or party buses, no unlimited drink specials, I'm going to go back to soundproofing, because it was something that we discussed in the last resolution in 2016 and I haven't figured it figured out yet whether it's an open issue or non-open issue. So just in terms of how we address it, so no wait lines outside maintaining low-level lights that are directed down and away from residential apartments, no alteration without first coming before us and having staff responsible. That doesn't mean they're outside all the time. We're responsible for overseeing crowds and noise outside and directing vehicles, so with respect to the lobby, I would say, operates as a check-in out area, seating area for guests waiting area for people going to the second floor, bar cafe with food service during all hours of operation. From the second floor, prep area recorded background music hours of 12 p.m. Does anybody, let me ask the committee members, so the proposed hours are 12 A.M Sunday through Wednesday, two A.M Thursdays through saturdays with respect to the lobby. Does anybody want to propose different hours? Everybody fine with those hours, I'm good, okay with those hours? So then it's 12 p.m, to 12, A.M Sunday through Wednesday, 12 pm to 2 A.M Thursday through Saturday and having a close fix facade with no open doors or windows. Then, with the respect to the seating on orchards, let's put it on Allen So for Orchard. So for and I will say this with respect to hours of operation, the applicant is asking to close at 10 Sunday through Wednesday 11th Thursday through Saturdays our standard in terms of what we approve for outdoor spaces, 10 p.m. On orchards, our standard on Allen Street, although there are fewer, has been the closest nearest approval has been for 10 pm. Also so that's 140 Allen, which is the block below this building, so I, would propose just changes in the hours of operation for closing at 10 pm all day, great I would agree with both sides. Okay, so that would be located within the building line as an amenity for hotel gifts and patrons it's going to be 12 p.m, to 10 p.m. All day, 14 table 16 seats, that's for both sides, no music and food, so no food service. So it's no food or alcohol service, but food and alcohol available for purchase from the second floor bar cafe is that correct? Is that what your plan is with respect to the outdoor spaces that correct Isaac yeah? We don't plan on having service out there. Okay, all right! So you want to committee: do you have any amendments or changes or additions? This is just right. Now we were just on the two ground floor, yeah, that's what I thought: okay yeah the areas in the with the building line on either side all days. I! Think that's fine, I agree. Okay, so do you want to go to the rooftop or the maybe the rooftops, as opposed to the second floor, so the rooftop, the method of operation would be as a land seating area for hotel guests only with no bar, it says no bar or food service, but the ability to bring it's to bring food or alcohol upstairs is that right or to the roof? That's correct. Okay and access to the roof is through the hotel lobby. Yes, I, guess: okay! So then, with respect to hours, they're proposing 12 a.m, to 12, A.M, Sunday or Wednesday, 12 A.M to 1 A.M Thursday through Saturday and they're, proposing recorded background music and the plan for installation of music is floor sitting or mounted speakers. If they're mounted, they would be mounted on the building facade facing out or they if floor. They would be on the floor facing out, so does anybody want to speak to it to the hours and I'll also say that, with respect to rooftops generally, we are not they're closing we're approving closing the rooftops for 12 a.m when we are approving them, we're approving them, with an actual like found plan to address music on the roof in any kind of capacity. But we don't have that here. So I just wanted to be able to speak to this or flush it out and decide what we want to do with it. So that's for the hours and with the music and with what we're going to say in terms of positioning of speakers which we also deal with, but usually we're doing that based on having reviewed a sound study, you know and a plan for where speakers are going to be positioned. Alex. If we use the word facade, it could be anywhere out there you're talking near to the interior of the building, which is what they call the core, which is near the elevator, which is a facade, but it's so far away from the front. If we say facade that encompasses every wall, that goes all the way out, so they could finagle this stuff and say: well, you say facade, and then they could put it further out into towards the front. When you mean the front, you mean like around the parapet of the rooftop. Is that right? You could you know it's either on the floor or inside they use the word core, which is this stuff, which is where the elevator comes up and provide the most stability for the building so and the sound doesn't transmit too far, because forward lot of it will be absorbed by that structure. So I think we should use the word that they gave was core because it more describe where it should be. So you want to say it that any speaker's position would be positioned against the core or near the core or the elevator bank, of the building. Yes, rather than around the perimeter of the rooftop. Exactly is that facade starts from the front of the building or anything surrounding that those walls are surrounding the front of the building and that's where that's the facade of the building, which means it's in the front of the building. Well also I. Think Elky. Did you say that there is a? Is there a glass? Is there glass around this area? Yeah there is plexiglass and the whole one yeah I guess when you talk about the facade I mean the depends on which side it is in the it's on the Orchard Street side, there's not yeah I guess, none of it really looks like what I would call a facade. There is a core and there's only a deck facing what would be the Orchard Street side and otherwise it's building mechanicals and services. So it's not like a whole large. You know area. There is only you can't access the Allen Street side. So if you say that speakers are on the floor, it has to be in that middle area, but there is there's a partial wall and then there's plexiglass okay, because the picture that we got didn't have that plexiglas. That's why I'm clarifying we got like the picture that I think I got in 2016, which just shows a bare space with a low like a low parapet around it, unless I totally missed the plexiglass, so I think is there Plexiglass? Are you putting in plexiglass yeah? Sorry? So I'm actually looking at the picture right now and the plexiglas obviously is clear. But if you look at that photo more clearly, you see these metal things sticking up about every three or four feet: those are the hangers holding in the plexiglas. There is plexiglass there, yeah you're right. I'm sorry I see that now too I missed that earlier. Josie I walked into a glass door last week, so I, I'm the one at fault. Okay, thank you. I was gonna suggest in terms of the speakers, I mean normally when we do get sound studies, it's their request. They specify that the speakers are below the parapet, so I mean I. Think if we're mounting them on the core I, don't think they should be mounted up on the roof of the core. So the projecting out, if they're going to be on the core, they should be. You know a parapet level or lower just to help contain the sound a little bit and they should be limited to one to two speakers, one to two small speakers right: the positions below the parapet- walls, yes, okay, all right and then with respect to hours of operation, I would just propose 12 p.m, to 12 a.m. All day, yeah I think that's fine. My only question- and this is just for the applicant or so there's not gonna- be service up there, but they are gonna, be able to buy their drinks and take them up there. But there's gonna be no one. There's gonna be not be staff or anyone up there to monitor it. Will there be anyone Phil? Do you want to answer this or I can take it? I mean? Oh sorry, I was unmute, yes, we'll have, because you will have monitored service just like for cleanup and things like that in general. But you know the plan is not to have we're not going to have like a portable bar up there, where people can yeah there's no one stationed up there just to make sure people aren't throwing drinks off the side and stuff yeah. Exactly we're. Gonna have just people just make sure that space is used. It's for only guess use. So then we should move to the second floor, so it says having the same method of operation, but I did the SLA approve music for you on this floor. This is for the applicant I. Actually, I have to I'd, have to go back and take a look. I assume there was I assumed there was background music. I'd have to no. You said no music, because it was an open. We said no music because it was an open space. That's why I'm asking, but we also said Apm closing. Oh it's nothing. Did you talk about the second floor right now, yeah, but that was different than what the SLA ended up approving right. The slave I think yeah because it was approved background music, I have to double check, but I think my understanding was that they went to the liquor authority in this, so it was 9 p.m. With background music. Only but I have to go back and look. Let me see if I can pull it up while we're on the call okay. So, with respect to the second floor, so the method of operation would be the bar cafe with prep areas serving food all hours of operation, then we have to I guess, address music at proposed hours and our original stipulations were for soundproofing along the north and south walls, consistent with the recommendations of the sound engineer and sound baffling materials and vegetation in front of the nano walls at Orchard, Street now and street. So it was found soundproof barriers and planters along terrapin walls. I can read, you I have the SLA second floor: open Air, Terrace, Open, operated from 9, am to 9 pm, notify and request approval for class change and ambient background recorded music, no promoted events. Okay, all right so, and this one has an entrance through Allen- is that right? Yes, okay, all right so and then there's also which we'll have to go back to as well as security, which is not really explained so committee. Do you want right now it's got recorded background music. Do you want to have that remain the same, so it would still be recorded background music. That's! Okay! With me! Yeah! That's! Fine! I'm! Okay! With that! Okay, that's no promoted event scheduled performances, Djs live music events with cover fees. So then, with respect to the hours to the proposed hours of 12. 12 to 1 A.M Sunday through Wednesday 12 to 2 A.M Thursday through Saturday. Does anybody want to speak to this or discuss it so that go ahead? I'm just I'm looking at the second floor? Okay! So it's a fifth! So it's a 50 person capacity, the 50 person capacity. It says they're, not next to residential windows, but they but buildings on either side of them on both Orchard and Allen Street and the soundproofing. That's been done so far. I, don't know other than the knit the nano walls and the parapet walls themselves. The soundproofing is only on the north and south malls and consists of sheetrock. That's that what you have installed on that second floor of sheetrock along those north and south walls. I'm only asking because I looked at your on your website, which advertises this room as that this floor is a particular room right and in the pictures it looks like and in the one picture you gave us, it looks like it's concrete I think it it's. She she'd rock. That way. Yeah I think it shoots off with the I'll, have Isaac double check, but I believe that she brought with veneer not a veneer. But, like a partial, you know the that fake brick, but no, not 100 sure myself. I've been here since 2017. I, don't know that I'm inclined to extend the hours to 1 am and 2 am given that. As far as this area goes, it's still an open and I. Don't know that it could be legally changed because I don't know that that's ever actually been thought. I know it was proposed, but from the applicant it hasn't happened, but in order to build the hotel to the height it wanted it had to leave that second floor open, so I, don't know that it's adequately soundproof and that we don't have soundproof implants. I, don't know that is adequately soundproof to contain noise right now we have a space that has been playing recorded, background music, but hasn't been open. Past 9 p.m. One thing we haven't had any guess: I was very worried about sound, even when we were open even before nine, for because of guests for guest rooms that are right above and we haven't had any problems there. Just I don't have a sound study but I. You know I just turned on the music and went to the rooms right upstairs, because you know that was really our main business to make sure the guests don't have complaints. That's why most hotels usually bring us a study committee members. We can wrap this up if we resolve these two stipulations with respect to this area. So does anybody want to speak to either one of them? Well, not music. So it would really be the hours of operation and what we do about the understanding of what we, our understanding of what the existing sound proofing is. If that's, if that place is open, can we say no music? The SLA has already approved, we did say no music and apparently they permitted music when they approved the tavern one license in 2016. When I did my walkthrough, it's open legally and it's not a fixed wall, but they are thick plexiglas there's and it's not a movable facade. They can never open it up to be true, open air, it's not it's. It is a fixed facade, it's fixed plexiglass or nano I guess this was the first I learned. A new term. I was not familiar with the term nano walls but I when he was trying to explain it to me. I wasn't sure. So when I did a walkthrough, I look and it makes all more sense. I mean it is a close as it can be, but it's a pretty thick plexiglass and it does not sway open. You can not in fact open it well and you're still only proposing background music anyways right, that's correct, I mean I, don't have an issue with the music I guess my only thought and we were on the hours yeah. That was my only concern so I mean certainly I can see extending it to some degree. Past nine, but I, don't know how much and if we do that, then what do we have to impose something in terms of we're just relying on the fact that the nanowalls remain fixed and closed right. So we can write that in as a stipulation that, although the walls are not a permanent structures from the parapet to the ceiling and are in fact or the windows, they're not a permanent structure and are like a plexiglas or plexiglas like Nanowall, that the wall that they remain fixed and closed at all times on both the Orchard Street side and the Allen Street side. So that would address the walls, but that doesn't really address the proximity to residential apartment buildings, which was totally ignored because the applicant just wrote no in answer to that question, which is something we also addressed, and it's a requirement for the hotel applications because of the impact it has from surrounding residences. That being said, this is a hotel that has been open already, so it's been an operating hotel without complaints. As far as I know, I mean I agree. I'm definitely willing. I definitely think at least midnight I would go, maybe midnight during the week and 1 am on the weekends. Okay, anybody else, I'm okay. On the circumstances, that's fine by me. Okay, so there's 12 p.m. To 12, A.M Sunday through Wednesday 12, P.M, 20, A.M Thursdays through Saturday yeah. You just make sure that I haven't missed anything for this area and then we can okay. So what I would say with respect to that I think that's. It are there any other stipulations for any of the other specific areas that you think we should add anybody, no yeah, no seeing no nobody thinks in their hands or anything. So, with respect to security, what was your proposal about that? Because it says one security if necessary, the security guard is necessary and I think. The idea is that this is not the kind of place that would need security, but if there ever were people congregating that they would engage security I mean I, don't think they anticipate the regular need, for you know, security personnel at this type of hotel, okay, and what is the one private party per day? Well, I, think the idea when I spoke to Isaac was that they would never. You know you would never have like somebody that would rent out a bunch of different places and turn it into a big party, but that, like, if somebody I'm sorry and part of it, was cut off when you were talking or lower. When you were talking. Can you just repeat what you said? Sorry I think the idea was that you would never have multiple people booking various spaces, but that, if somebody had like, if there was a birthday party or an event in one in the cafe, there would be no other events was how it was intended to be like that. You would never like have people renting out the lobby and people renting out. The cafe- and you know like- is the intention to rent out the lobby or rent out the like rooftop, that you would just the most that you'd have would be like the cafe could be a private dining. A private party like anybody like any restaurant, would be able to do a private, it's already advertised as an event space, so you're saying that any event would be confined to the second floor: okay, so I! So then, with respect to the second floor that I'm sorry say that again all right sorry, this is Isaac I just want to clarify I. Think the term party is a very large term if you see the second. So if you see the second floor and its capacity constraint, our goal here is maybe someone would want to do a private dinner with friends or something of that nature. So when Elky meant you know it's not something where you could piecemeal together, we don't have the facility to capacity. You know we don't have the capacity to have multiple things at once. So maybe somebody wanted to have you know a couple friends on our second floor: okay, yeah, no I understand I, also understand from your website that it may apply to a business event for people who are staying at the hotel if they want to use the space. Isn't that correct? Yes, so then I would just put under second floor that no promoted events scheduled performances or events with cover fees but may have private parties or events confined to the second floor, provided that there are no more than one per day. Thank you, Alex is that okay, everybody yeah, I'm fine with that. Okay, so the other warehouse clauses I, would put that this is this hotel has been operating since 2014 with the tavern license since 2017, but is in an area surrounded by licensed businesses, including hotels and I, would reference that the conditions in the end is adjacent to residential apartment buildings on both sides of the building on both Orchard and Allen Street that consequently, we would approve this application with stipulations governing the use of the hotel and the public spaces and specifically addressing the extent of the use and bound attenuation or mitigation for the spaces. Does anybody want to put in anything else or change anything else? No, okay, all right! So is there a second segment, a second all right, all in favor, Aye Ellen? Oh sorry, yes, okay, good and Elky I have to draft this. These stipulations separate from a form because they're, hotel stipulations and I'll send them to you, because I have to get the other stipulations out to the office by tomorrow. It will probably be after tomorrow, okay, but the full board meet the executive committee meeting is not for us and our full board name is after two weeks and our executive committee meetings until next week. Does the do the stipulations go to you only or do they go to anybody else? You can send to me and I'll coordinate, okay, all right, so I I'll send them to the office and then the office will forward them to you. Okay, thank you very much. Thank you very much. Thank you. Have a good night moving on to number three, which is an op application for 34 avenue, a which is a mama's bar. Can the people over here can speak to it just announce yourselves. So we know who you are sure this is Glenn Wright, I'm the lawyer. The applicants are also here. Harisha, Buddhij and Ajith. Abhikun are on the line. They are the two principles. Sorry is this the first person, I'm sorry who is the first person you said well, I'm Glenn Wright, I'm the lawyer, Haresha Buddha, okay and then achieve Abiku. I'm sorry did the first person sign in because I don't have that written. Oh I, don't have a written down a reset. Can you type in you're into the chat room again? He was he's on there. He was just on at the beginning when it was just before it was everyone. I would type his name. Yeah I'll just copy it very helpful land right. Okay, this is an application for a cavern with it says, recorded music, no outdoor space on the first floor in basement, that's the SLA notice or the notice to the Fla. The previous license was approved and Opi. The previous applicant was approved in Opi, license in September of 2003, with stipulations not to have djs and to have a bar no longer than 10 feet, and it was heard for renewal in March of 2010. Thank you. I got part of your name, but not all of it, because it ran out of space in the picture there we go. That was heard from renewal with complaints in March of 2010. There were complaints of noise from the open facade and we approved additional stipulations to replace the speakers with smaller speakers that would be repositioned off the Avenue B wall and below the ceiling level and to install a limiter. Then we heard it in July of 2010 with an alteration to expand into the basement. Add djs increase the bar size and change the hours from 4 pm to 4 am all days, and we have proved with stipulations that the facade would be close to 10. Any Dj would be in the basement. Only that licensee would maintain small speakers positioned away from the windows and maintain the limiter, and the basement would be operated primarily of the dining room and serving food to within one hour closing, then we heard a renewal with complaints in 2014, same thing: complaints of noise from the open facade and we change the music component with play recorded background. Music have djs in the basement, not have live, music promoted and scheduled performances or events with covers, not host pub calls or party buzzes not apply for alteration without first coming before the community board and then approving security, Friday and Saturday for 10 pm. To closing. So those were the different, amended stipulations. We approved a sidewalk cafe for seven tables and 14 seats, the same month with five tables and 10 seats on East third street and two tables, and four seats on Avenue B, with hours of operation of 12 pm to 9 pm all day and then awning over the sidewalk cafe. This proposed application is for 12 tables and 32 feet and I'm sorry because I got an amended diagram, so I may sized bar with 13 stools in that questionnaire. The diagram shows what looks like a 19 foot by 8 foot bar with 13 stools, three tables with 18 seats, compress seats, comprised of a chairs and a sofa, and one of the diagrams submitted with the original and amended application had the sidewalk cafe, consisting of two tables and four season avenue, B and eight tables in 16 feet by east 3rd Street. So the prep area open all hours serving a limited menu of american Food french doors. Closing at 10 pm. Four televisions recorded live music djs and it says in a jukebox at background and entertainment levels. There's no there's nothing about the person. Frequency of any djs speakers would be matching the four corners of the bar promoted events such as private and corporate events, one security guard, Fridays and Saturdays. No sound proofing, there's no agreement about no pub calls or party buses happy hours to 7 pm; no wait live staff outside the African County 12 repeats within 500 feet and has operated a business called blue room on 9th Avenue since 2008, which has a beer. One lesson that was issued in 2009 I wrote the date down. I'm sorry I'm just looking for it. I'll just have to look at the piece of paper. I wrote it on sorry about that. The previous op license was issued April 28th of 2004. There was one email submitted in opposition to this application, saying that the corner of this particular corner of the nightmare and characterizing it as a free-for-all and specifically pointing to Poco and Harry Levin as being contributors to the conditions, the current conditions outside and, in fact, consistent with this complaint. The villager also published an article about the outdoor areas, outdoor setup on Avenue B, just recently, I think it was in the past week and how it's overtaking the spaces outside the public spaces outside okay. Is there any presentation you want to make or any application? Are there any clarification of what I said or any statements, because this is your opportunity to do that? Yes, sorry, this is for the attorney and for the applicant, this is the attorney, and there is no basement at the premises, so they're not going to be applying for a basement there. They are not taking over the sidewalk. Cafe, they've decided to wait until the spring before they move forward with that. So that's reason: that's not part of our diagram. Now at the sidewalk cafe the other description of the premises about the length and size of the bar, the number of seats is accurate. They have a cfo, they were, you know they are currently licensed as a bar, so they have an occupancy of 74 people. They are looking for the hours of Monday through Sunday, really every day, 11 a.m to 4 a.m. They were unaware of any noise complaints at the premises. There's not been any kind of SLA activity regarding the premises since 2013 seven years they do plan on having a security person on Friday and Saturday nights. They, you know work with a security company that they're aware of, and they would be supervising the premises. They have no problem. With closing you know the doors at 10 p.m and no problem with that whatsoever. These two applicants are very familiar with these premises. Harisha Buddhijej is a cpa and he handles all the compliance for the bar. You know payroll and taxes, and you know renewing licenses, etc. The other gentleman that works at blue ruins- he is, you, know more experienced at the bar management, end of it and I think you know together, they you know would be able to. You know successfully deal with compliance as well as day-to-day operations. You know, Harisha Buddha Judge has worked with the owner for several years and is very familiar. You know with what's involved, I mean they have a you know they have everything in place. They know what security company they're going to use. They know how they're going to file their paperwork. You know renew their licenses, etc. So you know, as you said, Blue ruins had no problems with their operation. So I believe you know, Mr Avakoon, you know, would be a good operator here too, I'm not aware of any noise violations. Now you stated that there's a newspaper article about this area, but none of them mentioned mama bar, is that correct, I think Cliff could probably speak to this being familiar with the area. But you know the area is very bad. Overall I could tell you the article didn't mention Mama's bar we'll say that okay yeah, but that doesn't mean there is not a lot of noise. It's no combined with the problem we had across the street combined and there are times you passed there and that whole front of my mother's bar is open and the music is blaring. Well. I know that for a fact, that's yeah, because that's where I walk every day, and that's where my is closed by so far so I know that and I would the other side I'll go further than that. I would have a problem with a four o'clock hour on that street at that time. With this, but how long ago, did you see this mama bar has been close since February? Okay, we can't count. What's happened during the pandemic because it's not normal operations. I've been in that neighborhood for 50 years. I know when that was the upkeep. I'm going to give you an opportunity to speak in a moment. Are you finished with your application, I'm confused about why you asked me what was in an article about that was written this past week? If Mama's bar has been closed since February? But could you finish? Can you just finish your presentation and certainly, if you're you know either one of your clients wants to say anything. That's fine, too, and then we'll go on to whether or not they're questions from the public and then our own questions and comments. Sure I mean I would say that you know this is a an asset transfer. Mama bar was the people that are selling the bar to my clients. You know was an elderly couple and he passed away around February. She had to transfer the license into these trusts and now they're selling the bar, because you know she doesn't want to operate. It was another manager that they had employed, so it wasn't even the seller in this transaction. It was the seller's manager if there were any complaints. That would be. You know an issue with them now. Mr Abba Kuhn had worked at bar from for one year and he says that there were no incidents, so that would be from September 2018 until September 2019. So you know I would have to question whether or not there were any problems during that period of time, because that would be a little bit more. You know illustrative of how they're going to operate. You know I mean I. As far as you mentioned, the noise complaints was it one noise complaint against Mama bar. No, it was years in the last year there have been up until February and up until there's been 18 with I, think six of them were non-crime corrected, which means the police showed up and actually took action in the prior two years there were an additional 34 I think if I remember, I only reported tonight on our records up until the past year, but in the past years and two years before that there were an additional I want to say: 34 complaints, Mama's bar okay, wait! I'm gonna. Are you done with your presentation, because I have a few things to ask you and well that's something. I. Would want to you know that would be part of my presentation. I was saying that there were no noise complaints, you're saying that they were 34 were they against Mama bar or whether they were yes, they were all against Mama's bar specifically to that actress through the 311 calls, and in the last year six of them were non-crime corrected, which means the police showed up to Mama's bar. They did not cite them, they did not arrest or find them, but they took action, meaning there was an issue that they showed up at the bar. The complaint that was made about noise was shown to be valid and they noted it as non-crime corrected that is just in the past year, okay, but they didn't give summonses or anything. No, they didn't give a summons, but that doesn't mean there wasn't a problem. I understand, I, think maybe my clients can better discuss their method of the proposed method of operation to address this concern. Yep. That's why I ask if you were done with your presentation, because I have quite a few things to say: okay can Harisha? Are you there yep? I'm here want to answer some of those questions. Sure and I've been part of the bar since 2010 when late Richard was, you know, managing it to my knowledge, I handle their payroll accounts in accounting. You know sales tax, you know administration side of it. You know. Usually you know. If there were complaints, manager managers, you know or the bartenders were not doing a good job I would, you know, get to know because you know Richard or Ellen, you know. Would you know? Let me know you know what happened, but it's surprising to me that there was 34 complaints. You know that many that was not you know, reported to us, but in terms of you know how we're going to manage I my partner, Aj, he's gonna, be there in the city and then you know he's every day going to the bar and then surprise it and then in terms of the music. We keep it to lower level because it's a small space and then we kind of blast the music you know so loud, and then we also roll down the windows and the rolling those you know around 10 o'clock. So Harish, are you aware of any noise problems with the other establishments around it? No, not that to my knowledge and then with the from the tenants. You know there are tenants living above the bar. They have, you know gotten a rent discount specifically, and then they agree that you know they acknowledge that they live. You know correct me if I'm wrong, but aren't the tenants that at least were living above the bar were the owners of root and bone correct. They were for a while, but not they had an issue because there was a very large lawsuit. They had an issue with the owners. That's a different story. Yes, okay, if all those complaints came from owners of fruit and bone, you know they did not go on. Please continue with your presentation, so the tenants living there right now they acknowledge that they live. You know on top of bar and then they have got the rent discounts. You know they've been okay, so they're, you know almost close to two and a half years there, and then they directly communicate with me. In terms of you know any issues you know with the building and you know stuff we haven't got you know any complaints directly, okay, recently speak and then I think we should move on to anybody else, and then committee members well I just wanted to clarify with my clients that whether or not they'd be willing to proceed without the sidewalk cafe, because I would answer. I would imagine. The cafe is a large part of the noise. That is actually not the large part of the noids complaint with mamas. So we had no prob, no major problem approving the sidewalk cafe when they came a couple years ago. That's not the issues we've had with mamas okay. So that's not an issue you'd like to hear from. Let me just say it does influence whether or not like how we, as we make a resolution in support. What information we have to include what information we have to direct to you, so if they're saying they're going to independently apply for a sidewalk, cafe we're just going to include that language, and I'm going to tell you now that you have to go through DCA and we'll hear that Sidebar Cafe application separately. If it's approved, then we automatically approve an extension of the license to the sidewalk cafe. Okay, my point is that if the sidewalk cafe was a cause of many of the noise complaints, do you want to speak to them? Yes, actually, Miranda been me and Harish around the place for a year seen from 2018 to 2019, we used to close the place. All the time like in the big shut, the doors at 10 o'clock, exactly like every single day, so you know I. Was there almost every single day? So you know that's what we are planning to do moving forward. Did you know of any noise complaints? We never actually to be honest with you, I mean I was there, but many I was there like until closing from Thursday to like yeah almost Thursday to Saturday. So while I was there I, we never got complaints. Actually, when I was there, I think for a short period of time, I believe it's somewhere around 2015 or 16, Jeff and Jenny, and you know they lived on a bow and then they had a little baby. They never complained to us about the noise. It was not them that was complaining about the noise to me. Yeah I think we need to move on and we can ask you our questions and give you our own perspective about it rather than just statement. If I can who's speaking, I'm Jay I live down, the block. Can you Jake? Can you just tell us your full name? I'd rather not just because I live right here, I, don't want to be too okay, personal about it, I just a quick statement that corner is extremely noisy and when Mama's bar open facade was open. You could hear it halfway down the block. I live in the middle of the block and the base booms and with Poco that follows no rules. They're, just partying. On the sidewalk day, in and day out, you hear the music in the middle of the block, so those open facades are basically outdoors. So that's all I want to say is like Mama's bar when it was a more calm, just died bar before it wasn't like that. But now it's like a frat party every weekend. That's all I want to say you know, I really object to an anonymous. You know statement here, I mean if he can't put his name on the record. I would really ask her to be disregarded for all we know he's with a competing bar. That's not this neighborhood people doesn't have to I'm just uncomfortable because I walk by there every day and I don't want to have an issue with them, but everyone in the neighborhood knows them and Poco were a disaster. Yeah. Okay, so are you finished with your presentation? Did the applicants have anything more to say, yeah, I'd like to hear from my clients they're more familiar with it than I they're, not, you know just buyers that are not familiar with the premises. Can they explain this? What is there to explain? That's what I'm asking well, I'm asking them why they weren't aware of it. You know when we started this meeting, why they didn't tell me about this. If they were aware of it and how can they not be aware of it? I, I'm surprised to hear I know the noise complaints around maybe 2015 and 16 when Jeff and Jenny, and they had their baby upstairs they directly called me to you, know, get in touch with the owners and that those are you know, situations that I'm aware of the other situations, I'm not aware of, and then also since by this bar has been there for so many years. It's part of the culture, it's an iconic place and then I get messages from our social media. Facebook page Instagram, page people asking you know. When are you guys opening you know and then, when we open, you know where we get the license and the app pool and the way we open this we're not even going to change the name, we're going to keep it as it is, and then we're going to operate. However, you know with the same setup. You know it's being there, but I think you know when Ajit is you know there? You know we're gonna be in charge and then you know better surprise and then, if there's any complaints comes to us directly, we will definitely handle it. You know much better. I will not be a problem for the community and then also we, you know, hire people from the local in the community and they it certainly provides. You know jobs to the people in the community. So I would say this bar definitely increase the value and then provide a service to the community. It's not a detriment. That's an asset! Okay! Well, we've presented, you know our method of operation we've described, you know the premises. You know we'd be interested to hear your concerns about noise, and you know also I'm wondering if the configuration of bars in the area because of the pandemic maybe has changed. You know, has some of the other problem bars or foot traffic decreased. Due to that, you would be more familiar with that. I'm talking to the community board member all right, I'm going to call on the committee members in the moment. Clint has anybody else signed up to speak to this I. Don't know no I, don't see anyone else, I, don't see anyone else in the chat. Right now, that's request. That's asking us. Okay, of course, as things have changed since the pandemic. This is my answer to you, but Avenue B has always been problematic. I have a bit of a concern in that. Your applicant has said that he's unaware that Avenue B is a problem, and yet it's been a persistent problem for the community for years and the community board and the precinct they have engaged in different kinds of effort to decrease the problem on Avenue B, especially lower Avenue B over the course of years. So, while the problems may have changed or the characters have made changed and that is coming from outdoor spaces, rather than just from the insides and the sidewalk cafes since March of 2020, it really hasn't decreased. We still have the same problems that we had before. So that's concerning, because I would hope that somebody who worked in the space in the neighborhood for a year has observed what's going on outside, even if they don't believe that they're contributing to it. Then the problem with Mama's bar has always been this open facade, so it generated many complaints like the resident down the street said because you could hear the noise from the open facade, half a block away, walking you know walking by it was very loud, so it wasn't a problem of the sidewalk cafe which closed relatively early. It wasn't a problem of noise when it's contained inside. So if we're going to approve this license, we have to understand that these applicants are equipped to address that, because, on an ongoing basis, the last people were not, and we did multiple things to try to limit that and I see that there are the same variables in place. They want to run the same place. They want to have four tvs. Closing the facade doesn't mean closing it at 10. It means closing you when you had any amplified sound and any televised sports or other televised events. You know to minimize or decrease the sound. That's traveling outside where your speakers are has been an ongoing problem, and we have repeatedly told the proprietors, the prior providers to move the speakers, because we knew that it was part of the problem. As you can hear from one person, the base could be felt down the street right, so I mean it just amplifies, what's being felt outside if you're putting your speakers up against your open facade or at the corners of where the facade opens, so that that's I'm trying to summarize for you. The history we've had with the prior applicant I'll go to the other committee members. If they have questions or comments and then we can go to making a resolution, I have some questions go ahead. So I would like to ask you. First: did you do any outreach to the local community? Yes, I sent an email to the only applicable block Association, which Block Association was that the fourth lower Avenue B Block Association, because they knew nothing about it. They did I asked them. He checked his junk mail as well. He did not get any emails from you. I can check the email right now, but I'd have to step across the that's fine. It doesn't matter at this point. No. Actually, if you can give me a moment, I'll be right. Back. Okay, that's fine, but so I mean I, guess to the applicant to the two applicants. So I used to live across the street for nine years and I now live down the street when I lived across the street I was on the back of the building on nights when Poco was quiet, which was sometimes a rarity I could hear. Mama's bar echoing on the back of the building across the street I would walk over and I would ask the bouncer and I would occasionally speak to a manager. I know there was a woman manager and I, don't recall her name at the moment. The bouncers would listen. What El was that like around what time? Oh it was from start. It was I moved from down the street in 2017. It was from probably 2007 into 2017. and then, since I moved down the street, I'm a little further away. So I don't hear it as much, but even walking by I might sometimes mention to them that hey I can hear you almost a block away and the bouncers would usually say things that weren't quite so nice that I'm not going to repeat on a meeting and when I would go inside to speak to the manager. She'd say: there's nothing she could do about it. At least she said she was a manager. Maybe she was just the bartender, but I asked to speak to a manager and that's who they would point me to I kind of gave up after a while, just because it was frustrating, but the other thing that concerns me about your application. First of all, let me start off by saying: Mama's bar has been there for years. It is what it is not totally opposed to it and I'm not necessarily opposed to your application. I'm pointing out some of the problems we had yeah, which was the noise and I'm concerned about your entertainment level of music, because that space is not soundproof with the doors and windows closed. It's not soundproof adequately enough for entertainment, level, music, for example, on nights that you would have trivia night I could be in my living room across the hall or across the street, or now that I'm down the street I can hear it from a block away, clearly hear what the whatever the person running the night on the microphone I on the other end of a block on Avenue, C and third street I can hear what that person is saying. So it's not soundproofed adequately enough for entertainment level, I'm fine with background level music, I'm fine with your tvs. I, just don't feel at this point back entertainment level. Music is appropriate for that space unless you're willing to say that you're, adding additional sound proofing or you're going to do something to address that noise, even with your doors and windows closed and with your doors and windows open it, it's unbearable, yeah I mean just wait. One moment just for a clarification before and for the applicant and the attorney hold on look I, withdraw that I just want to ask the clarification of Clinton. That is when you say that they were doing a trivia night with somebody on a microphone I guess it was they've had that for years, was it with the windows open or closed? Sometimes it would sometimes be both. It would sometimes they would be closed oftentimes, especially in nice weather. They would not close them and I would have to remind them of that and but oftentimes with the windows closed. The bouncer would still have the door propped open. While he was standing there and again, the bouncers weren't, overly friendly, okay, go ahead. Sorry go ahead, you may speak now, yeah I mean certainly thanks for pointing out. You know. We certainly I mean what I believe. You know I work with a lot of small businesses and then I myself, you know, run a business and then I'm part of you know the Chamber of Commerce in the town that I live in. One thing, I always believe, is you know, be part of the community. You know where, wherever you are so we are certainly not going to operate the business in isolation of the community and then we certainly need the support of the community and then and the community board, and all of that I heard all the issues and then we are certainly going to you know. Consider everything possible in our power to you know contain the sound you know, complaints, reduce the sound and then improve that situation. So one thing like Miss Militano suggested we could always change the speakers you know inwards are not pointing towards outwards. That's certainly that that's something that we could easily do and then you know also making sure that the windows are closed and then it's like rolling doors are drop down at a certain time. That's certainly something that we could. We will be able to. You, know, do and then, on top of that, when I mean when Mr late, Mr Richard, you know was you know running the bar. What happened was you know? It was always a manager not necessarily like the owners were there per se, so the managers had a lot of you know say in it you know and then most of the time the managers were younger. You know relatively young people and they had a lot of their friends come. You know, hang out now, we're gonna be owning it and then running it. And then you know we'll be more. On top of you know things and then you know what's going on there and then you know what's happening and then also taking into consideration all the issues that the neighbors you know would have you know, and then you know Clinton I mean you know I, I'm not sure. If you ever got a chance to talk to Ajit, you know Aj, he was there like in almost a year and then you would see him every Friday and Saturday. You know sitting behind the bus and then making sure that everything stands smoothly and then he made a lot of friends. You know in the neighborhood you know any other committee member yeah go ahead. Herman well, I was saying to the lawyer with the same I'm just backing up what Clint is saying, but that I'm generally passing to that place almost six days a week going back and forth from my office or the buildings or whatever, and you know, I try to cost them at times if they could just Lord music, because the doors are open. Avenue B is a small street, so the residential buildings are closed together. You know they said that we'll take care of it, then nothing ever happens, so I'm not really against them transferring the stuff, but I'm looking for better than that was there before there needs to be control that it's the thing about going to draw people in. So you have to turn up the music, so people, progress, I, know there's competition in your type of business, and you have to do this to get people to go in and out and also the lateness of the opening, at least during the week disturbs me. So what are you proposing? Are you suggesting an earlier closing time during the week I would say from Sunday to Thursday something like closing at maybe one or two o'clock and the weekends could go to four Thursday Friday and Saturday so Sunday to Wednesday, then closing time 2 a.m and then Thursday Friday, Saturday, 4 A.M? That's what I would suggest I mean everybody else. Yeah well I would ask my clients if they would consider that I mean our experience is I, know the numbers very well in terms of sales and stuff. It's pretty much. Nothing is happening from Monday to you, know Wednesday Thursday. After around 11:12, you know it's, you know we actually just you know, keep it open just to make sure we get people from other restaurants when they close and then they come and they know they they're like regulars. So we keep it open for few regulars for late on those days, but there's not nothing much happening on those days, no parties and then especially during these Covid-19 times, you know with the capacity limits we would like to keep the opening hours. You know, if possible, to as we requested, because that way, even if you have a event or you know or corporate event- or you know something like that, so then you know it will help. You know those hours will help. Okay, I just wanted someone. I'm sorry go ahead because we need to move on to the making of a resolution and we're moving very slowly a discussion where we could get information and go to the next step. Please go ahead yeah. He asked me about community outreach and I sent an email to Ao, Harrington and I. Don't know that yeah she's on East 4th street between C Avenue, C and d, there's a block association called the East 4th to lower Avenue B. That goes from east 4th down to Houston Street on Avenue B. But that's not that's past the point at this point, so, okay, yeah I, thought that block associations ended like shorter than that set more south than this location. Yeah anyways, that's enough! Any other community members have any questions or comments nope! Okay, do you want me to do a straw poll to see how we would resolve and then we can move on to the making of resolutions? Sure, okay, all those in favor of denying in life or otherwise approving with stipulation okay? So that's a majority, so I can't see Ellen, but I had one more question about their method of operation too. Alexis do I have a good question, so you listed Djs on your in your method of operation. What do you mean by Dj? What I mean it's a small space and there's not really a Dj booth? Do you mean actual djs, or do you just mean someone setting up music on an ipod? It's we used to have one gentleman come and you know play on Thursdays or Fridays yeah. So it's not like a pool said Dj. He plays music on his computer. That's the you know he was just playing music yeah, the other most days. Friday and Saturday people play music. You know from the jukebox, you know, okay and with respect to corporate and private events. Are you talking about buyouts of the business or a party using part of the business for a corporate or private event, you're using part of the business? You know? Sometimes you know especially during holiday season. You know. Sometimes you know small companies you know will reach out to us. So you know people will reach out to us that they want to have a birthday party. So what we will do is you know like it's usually 15 to 20 people. You know so we'll you know section off, you know like the seating area and then they will have their gathering. You know and what's the frequency that you're proposing to have those we my experience, we had it, probably it all based on request, but we will have your sake during the holiday season. You know November December. You know during that time, probably very few, like around four three four months, we'll have like four five max. You know if you're lucky five per month, is that what you no like I would say from October November December. If I take three months, you know period, we will have five events. You know if you're lucky yeah so you're saying like 12 a year, yeah, probably like 12 a year, yeah, okay and then with respect to security. Where do you place the security and it's Friday and saturdays from what time until when we usually have security from Friday and Saturday from around, like eight o'clock to until four o'clock? The last call is like around you know 3:45, so tablecloth- and this is the security guard- that's stationed at the door. Yes, all right, okay, so why don't we go to the making of a resolution? Now we'll go through what the stipulation should be? I mean this should be easy. I'm sorry, I know you said that the proposed language, but it was for two or two avenues. Wait did I, send the wrong one I think so it's okay, so I mean you can add in relevant, whereas clauses, if you missed something so the first one would state what the application is. Probably just the wrong one for my email, I can resend it to you later. What the elements of the application are, what the history was of the prior business when the license was issued for it. The number of ops within 500 feet the applicant history, including operating the business on Ninth Avenue and a one-year history working in this business between 2018 and 19, and that the applicant intends to maintain the name and method of operation of the business Clint. Do you want to I would say if you're going to, if you want to include whereas clauses about the complaints I would include that consistent with the output, the previous applicant's history of complaints, there were 18 true on one calls within the past year, six of which were non-crime corrected, or rather in a resolution. I would say required police response in action, and there were 34 within the proceeding. Choosers don't I mean I, think I could go back and count. I know there was definitely 18 in the last year. I, don't remember, the okay is so I also put it a resident and two of his community board members who live and work in the immediate area stated that the music from the open facade travels down the street music can be as well as voices from a microphone used on trivia nights. We also received one letter submitted in opposition from the resident. If the corner is awful incredibly loud, you can characterize the free-for-all and asking that this application be opposed. All right is there any so I would have those complaints. I mean observations. Is there anything else? You want to say with respect to the observations. Clinton no I mean that's pretty much it. It's just the noise and that previously they haven't been responsive. So I would hope that they will do a better job with that Mrs melter I have a one question for you he's like. Would you be able to tell me that 2018 to 2019 were there any complaints regarding noise? Yes, 2000 from 2019 from 2000 September 2008 September 2017, there were 21 complaints from 2019 from the end of 2019 to the beginning of 2018. There were 21 complaints and out of them one two, three four five six looks like six of them. Out of those 21 were non-crime correct, which means the police showed up and found there to be a problem again, it wasn't a citation or an arrest or but they found. So if someone complained about noise, that means the police showed up and it was too loud and they spoke to someone and told them to turn it down. Yeah, because I think it's like mostly to complain when Thursday Friday says I assure you every single day. I was there last year. Why by me and Haresha, was running the place for one year I. Was there every single day like from eight o'clock to four o'clock in the morning? So because I have a my other place in ninth Avenue blue ruined I have two managers there, so I was there I think we understand that you don't yeah. You didn't hear that I get that. We heard that a number of times I think we understood that okay I just wanted to look up. So just you just need to be more on top of it. Yes, sir. Absolutely so then understanding that the applicant, given the prior experience of the applicant understanding the applicant, is proposing to maintain the name and method of operation. We were to prove this, but we were to prove it with stipulations. Addressing its method of operation, including addressing potential noise traveling outside I'd, also say that the applicant has represented that that's not using the basement for patrons that's correct and not yet will not yet have a sidewalk cafe, but we'll apply for that separately. That's correct advice advise that and they would have to apply to DCA and then that application will be heard by the community board. Yes, okay, so then the stipulations would be I'll go through the easy ones. First, so would be tavern with a prep area less than a full service kitchen serving food during all hours of operation. Yes, that the facade would close at 10 pm if or when, there's any amplifies found and the amplified sound can include any amplified sound, which would include people or performances that includes an amplified mic. So if you have somebody speaking on a microphone, your facade has to be closed. It doesn't matter if it's two in the afternoon. That's the alternative to 10 pm. If you want to have a trivia day, you have to have a closed facade and also during any televised sports. The music is recording background. Music, no promoted events with cover feeds or several performances. No live music, I would say what you're telling us didn't constitute a dj. So I put no Dj's wait: Alex, you said no live music. They had live music checked off on the application. Yeah we do. Okay, then we have to address live music, so we'll go back to whether or not they're going to have live music, because that's a variation from the existing method of operation that we would have to consider separately so and then, with respect to private parties. No more than 12 per year, one security guard Friday through Saturday, a Friday and Saturday from 8 pm to closing situated at the entrance no pub crawls or party buses. I know you didn't check that off. That is not something that's negotiable in this community. Okay, so no pub crawls or party buses, no unlimited drink specials with food, no alteration without first coming before the community board, no wait lines and a staff person, whether it's a security guard or a employee. When you don't have a security guard responsible for overseeing crowds and noise outside that doesn't mean that that's the person who has to stay outside, but a person who has to be mindful of what's going on outside the droplets all right. So then we're left with whether or not we want to put anything about the speakers placement of the speakers, whether or not there should be a limiter, both of which we had at the prior business to address sound problems and hours of operation and live music. You have to speak to what this proposed live. Music is because it's not part of the existing method of operation, at least not part of what was approved. Okay Haresha, who wants to address that yeah? So what I was they they're? Proposing back? No live music first I did I mean except Dj, I mean we did. We hardly had any live music there right. You don't yeah! I mean it's an option, but you know I personally I like to keep the options open, but you know, if you, the community board, wants to take it off. That's fine with us! Well, you know. Normally some live music would be something we would consider during the afternoon. You would have a violin and a jazz, but you know Mama's bar isn't really a jazz, easy listening type of bar, so I don't see a I, don't see a rock band going as well in that space. So, actually that's why I was home. We used to have Thursdays like jazz night, but we didn't like. We didn't make any money, so we just when we were there, so we tried first month. So we didn't do enough crowd. So we just cancelled that one we after that, but we never had live music. Okay, so no live music. So then we have to go to the speakers and the limiter, which was part again of the stipulations for the existing business. So we can discuss whether or not we want to just write it into these stipulations and then the hours of operation. So the resolution for the prior business had been that the speakers would be positioned away from the walls on Avenue B right to be positioned away from the windows and would be positioned below the ceiling, because in fact there were complaints that came from the residents of this random business buildings, which is why we were moving the speakers down as well and that there would be a limiter stall to limit music to a background level. I think the pride is on saturdays I, don't know, I did you know. Aj can talk to about this, we'll be able to limit the music to background level right I mean you know, but the other day is. We could always keep it background level, regular weekdays Monday through Thursday, and then you know during the daytime, but I'm sorry you're moving from one thing to another thing and you're interrupting the resolution. You're proposing you're saying that you want to have entertainment level music on the weekends. Is that right? Yes, I got that. Okay, thank you. So, with respect to the speakers, I propose, we just have that their position away from the open, facade and below ceiling level yeah. We could do that. So you know what that means. Horatio. You know we have to position the speakers you know okay facing inside, you know not facing towards the road. You know. Oh I figured that but okay, all right, are you adding any soundproofing or have you added any soundproofing? No, not that? No, so I'm really so. That makes me uncomfortable with background or with entertainment level, because even with your doors and windows closed that front is not soundproof at all. That glass is definitely not soundproof glass and at entertainment level, even with everything closed is going to be heard down the block. Probably that's my only concern. Well, they looked into soundproofing and it cost 20,000, so just isn't feasible. Okay, so I would say that we should put an awareness clause that the applicant is not proposing to add soundproofing and that the as representative the space does not have soundproofing so that to be in any stipulations, but also address the absence of soundproofing, and we would just leave music at recorded background level. So I didn't catch that so you're saying that the whereas clause would say that they should add sound proofing or not. No, I'm just saying we recognize there isn't any, and we already have these existing voice complaints, in which case we would just leave the music. What we would approve would be recorded background. Maybe given these conditions, okay, all right and then the other things do you want to add that there should be a limiter to ensure the background level of the music and the bass and the hours of operation they have to address? Who are you sheds? So this is you know this is for the committee members. So for committee members? Okay, do you want to add any articulation about having a limiter I mean? That's what we had that on the last we had that with the last application. So I'm fine with putting that in okay I, don't think they ever had one, but what I said I, don't think they had one or used it, but maybe they just didn't use it and then the hours of operation, so the proposed hours of operation are 11, am to 4 am all days. I'm actually so I will say. Also from my experience, mama's bar hasn't been a problem late night. Their noise problems are more between the hours of 8 a.m. To midnight, I'm sorry, 8 p.m. To midnight they get quiet, they've always been quiet after late like after midnight toward a late night they're, not the rowdy kind of Poco would have their late night, but mamas did calm down. I would actually I'm not opposed to the 4 a.m. All night, as it is, okay I, do know that many times during the week, even if I mean I, know, they've always had 4 a.m, but many times during the week, they're not open, not that I'm out till 4 a.m. Ever but I know many times during the week they close a little earlier than 4 a.m too. I think if there's no one in there, okay does anybody else agree with Clint about the maintaining the hours that proposed that? What if it's only going to be the background music, it's okay, yeah I, couldn't hear you maybe and you're okay with it, so it would be eleven to four a.m. Yeah, if we'll give them a concession, if it's background music, they can have till thanks. Okay, so is lightning for clarification am I, adding a audio limiter or not. Yes did they would have to install a limiter to limit the founding base? So is that there this is an existing resolution. Is there a second for it I'll second or Jason Jesse's, all in favor, aye, okay, opposed Substane, I, didn't see, everybody do I, see everybody I think it was a yeah Ellen said I as well, so, okay, all right Mr right I, have to construct the simulations am I sending them to you yeah. Please do you want me to send them to anybody else or just you yeah. Also, the client I believe I've cc'd him. You should have his email, harisha and I can send you their emails right now. If you don't have them just in case, why don't you just check the email you sent to me today just to make sure it's there? It is that's fine and if it's not just email me with their email addresses on that email, great I'll do that. Thank you very much. Thank you very much. Thank you so much so you should get that I have to send it to the office tomorrow, so you should either get it tomorrow or by Wednesday. Appreciate it bye-bye with instructions about how to return it sure the office. Thank you all right, everybody good night. So now we're moving on to number four. This is a 90-96 Stanton Street, it's an application for Peppa's jerk Chicken is the applicant here. Yes, how are you doing? Yes, Aaron Pierce Council, yes, okay, so I see a person named Jason. Is there anybody else? Just so. I know that we have everybody accounted for Jason's, the soul owner and I'm counsel to the to Jason and his establishment. Okay, all right, but there's nobody else appearing on behalf of the applicant. Just the two of you. That's correct! Okay, thank you. So this is a restaurant with it says: full menu, Dj's jukebox Karaoke recorded in live music, consisting of light, unamplified background music security and a sidewalk cafe. On the first floor in basement of a previously unlicensed location, it was last Salafix which I think is the Hawal Falafel Takeout business. The Cfo is 33 with one table and four seats and a rail with six. The proposed hours are 12 pm to 4 a.m, all day with alcohol service to 2 a.m and take out service after 12 a.m. All day, although the questionnaire said that the business is primarily a takeout business, kitchen open all hours serving caribbean food, there's no answer about the facade one television Dj's live music juice box Karaoke. It says that background levels, no promoted events, schedule performances or covers one security guard, no sound proofing, no control, but party buses, happy hours to 8 pm, no weight loss staff outside the applicant counted 26 ops within 500 feet, I counted 30 as well as four pending ops using the lamp map. The applicant has no license experience but including the questionnaire that they have operate, give operated similar businesses in Brooklyn and Queens. I looked for the business name and I found businesses in Brooklyn, not Queens, I found them at four locations in Brooklyn. None with licenses I think that it as far as the information that I have this is your opportunity now to make a presentation or clarify anything or change anything if something has changed or make any hi. Yes, I I'll start my name's Aaron Pearson counsel to this establishment and Jason Huffy. There's a few places open around the city because it's a family operation. His uncle also owns a store. Jason has two others, the owner of this foundation, plus he has two others. None of them have alcohol licenses. This is a drive up pickup at the counter food operation and exit. There's no bathroom. The plan is a few tables, but what you have from a 30,000 foot view is a 600 square foot first floor. The basement is not going to be used for customers at all. It's just storage and the ground floor is 600 square feet. It's about 30 by 20 and above that space about 30 of that space is for customers. The rest is used up bike corner space and cook space and stove top and kitchenware, and so there's you have basically about 150 square feet that will be used for people to wait for the order their food wait for their food and have a drink while they wait for their food. The reason that we left open the entertainment options is just not because this will ever be a space where people are fixated to remain again, there's no battery, but just as a cool idea of maybe there's someone that stands in the corner and is a quote-unquote, Dj or and a wall hanging back. So someone gets to decide if they're, what kind of song they want to listen to while they wait for their food kind of idea, but again we're dealing with a very literally about 150 square feet. Max capacity is 33 people, and this is very much a come in order at the kind of your food and your drink and leave. If you want a full liquor drink, you can have one on premise and if you want to order beer to go, then that would be your option. But obviously you know hard. Alcohol is not available for takeout. Are you intending to install a bathroom? No, the intention is just to come and go. Is it a bathroom, a requirement for a full op license? Well, I've read and inquired at length at the SLA and not really been given a straight answer by the state if beer and wine is necessary, if that's the findings of the community board, if beer and wine is necessary because a bathroom is required again, I've included not gotten a straight answer either way. Elky is in the bathroom. I'm sorry Elky. Are you there? One way in my experience, you re you need, and I've been doing this since 1998, you need and I. Don't know that this particular rule has changed in a bathroom required for a full Lp license is a bathroom required. Yes, that's so yeah, that's what I thought, so you can't have an opi I mean there are other reasons why I don't know that I necessarily would approve this application as it's proposed, but you can't have an op license in your bathroom and we've actually had applicants have a wine beer and then later you know, expand or build in a bathroom because their space actually couldn't have a bathroom. It's just not big enough. No, but it just could be an existing thing. Sorry, it's a corner right help as well. Is it just a beer and wine allowed for no bathroom to take to go for that? As far as I know lesser licenses, you can have no bathroom okay, so obviously, if that's a standing rule, then we would just agree to that. Stipulation of course, outright I mean not trying to punch the angle up here you mean that you would only apply for a beer wine correct. Okay, all right, we might go through the other and I could just summarize them, which is you're talking about 150. Does the applicant want to speak to this I mean he's because he's sitting here so he might want to speak. To this sure, I mean what was your question Jason you're there I imagine yeah, I'm here! No does he just want to speak about his application, because I can assist the committee by saying what I think are outstanding issues for the application as it was sent to us, and then we can just move on for that from there. The whole concept of the restaurant is the whole concept of the restaurant is with this area. I wanted people to come in, maybe six seven eight people to sit down, and while they wait on their food they can get something they might have eaten their food. They can eat the food there get something to drink like beers that infuse with different caribbean cultures and I wanted more of a quick serve, but I would I wasn't going to sell hard liquor or beers like after a certain kind of time after a certain kind of time it would have been strictly take out. So this would be something to 12 P.M 12 A.M, anything after that would be strictly take out. Okay, actually, your application says something different. It says strictly take out after 12 and no alcohol sale after two I, don't I, I'm I apologize, but I don't see that under the hours did I misread what your application, yeah I, think no I think he is I, think it was a mistake Alex, it does say: I'll lick her serve only between 12 and 2:12 a.m and 12, 8:12 p.m and 12 a.m. Okay, thanks for clarifying yeah all right. So then, if you, the understanding that you can't proceed with an op license, because of because the size and of the location and the lack of construction, the lack of ability to construct a bathroom you're agreeing to proceed with a wine beer license only is that right? Yes, okay! So then I guess we can move on to committee questions about the other elements of the application. Is there anybody who signed up to speak to this nobody's signed up and I, don't see this. If anyone would like to speak to this, please raise your hand or, let us know, nope I, don't see anyone. Committee members, any questions or comments. Well, I was concerned about the phonical phonicalizing at that point, because how can you prevent somebody from ordering and you can't force them to sit down there- just walk out the street, which you're not allowed to I would patronize some places if they have a bathtub. Some people standing there would want to be able to, and the problem that we have is that a lot of people come out of bars or restaurants, forgetting to go to the bathroom in the air and use the neighborhood as a as an error for relieving themselves, which we have a lot of that I've seen it so many times so I would wish you could have a bathroom or even a stall. It doesn't have to be a full bathroom, but so be the case. Okay, Herman Michelle has her hand up as well after this thanks, yeah I walked by the location. Yesterday, it's very clearly like a takeout restaurant, from what I can tell from the facade like I. Don't think anyone would confuse it with a bar that they would go into which I know has been a concern in that area. I guess my question about the bathroom thing for a full liquor license like I. Don't want to be we're, not the SLA, and it just seems a little weird for us to get an opinion from a different attorney for a different applicant about whether a bathroom is required or not. When this applicant has his own attorney so I just I, don't know why we would take I understand that she's an experienced attorney but she's, not this applicant's representation, she's, not the committee's representation. So I don't know. Maybe I'm missing something, because I'm a new member but I just don't want to write off that option. If that's what the applicant would want. Well, I said it and to be helpful. I called it an attorney because I'm not an fla attorney, although I'm otherwise an attorney, but I said it. Based on my experience and I just wanted to confirm with somebody else that my experience hasn't been just an illusion, but it is what it is. So that's fine. What I would I to say that what I would say about this location is it's clearly a take out places shallow and narrow and can't accommodate more than the one table and the six stools at the rail which, by the way, the rail is up against the window as proposed by the applicant and yet they're hoping to incorporate really late night hours. Indeed, the possibility of a Dj live music that, as of yet has been unspecified I, don't know how karaoke would be worked into this method of operation. Although it's checked off, they'd have security and they're saying that the way that they would minimize all of those impacts is by having the alcohol, whether it's beer, one or anything else, not served at 12 a.m. But it's clearly a takeout place with very limited occupancy in an area that's overrun with businesses. I know we talked about the ops. The licenses themselves are well over 6 in the 60s range, and the conditions in the area are very bad, regardless of the fact that, if we're in the midst of this pandemic- and we have modified or shuttered businesses, we saw businesses on the street and the conditions are the same if not worse than they were pre-pandemic. That being said, this was an unlicensed location that was just a takeout place, so we're incorporating alcohol and the possibility of Djs live music karaoke into the shallow space. So we and adding security, I guess to control. What's going on outside I know that the existing businesses I, don't know what they were like pre-pandemic. They had weight lines now, and so we have to figure out. The applicant is saying that they're not going to have weight loss, so I'm hoping that that's the case, but I don't know if that's realistic, given that the businesses in Brooklyn at least have weight loss without those elements. My feeling is that if it's a takeout place, it should have been wine. It should have recorded background music. It should not have security, whether or not it has the alcohol service, whether it's alcohol service or beer wine, it shouldn't be past 12, and then they have to decide whether or not the business is going to be open until four I think. Sometimes we have to be here to educate the attorneys and the applicants if they want to take time to step back and confirm whether or not that's accurate, that's up to them. Anybody else. I, no I, think that pretty much summarizes it yeah I think maybe for us to be explicit. You'd have to the applicant, or the attorney for the applicant would have to explain how you propose incorporating live lives, light unamplified back. Let me stick into this 150 square feet, so the reason is being in 150 square feet now and I think I would strangle somebody who was playing light, unamplified background moves near me and like that was six other people or ten other people right go ahead. I think that the question is, how would live music be even possible. I think that you know the kind of space that it is in order to just generate interest and excitement. Certainly not dealing with you know, bands there's no room for that, but it's if not a non-amplified violinist or a non-amplified kettle drum or a non-amplified flutist. This thing you know a singular person wanted to stand in there. I think that you know on a fun summer day. That would be a interesting addition to the business model. Obviously it's not a band. It's you know. Max I would probably say two people, if you had you know some like jazz percussion and a saxophone player, or so you know just non-amplified very light music standing in the corner. I think that would be interesting and I think that was something that the client thought of none of this is really all that essential. So it's not something that you know anyone needs to draw a line in the sand over. Certainly, you know, the client is just interested in. Nothing is possible. I would advise not to complicate the application with that kind of suggestion. Jason feel free to I mean if the these were just things that we saw with the live music. It wouldn't be nothing out of hand, somebody a little small drum. You know, I'm saying something: small to attract people from my culture, just a guitar, nothing to people that can hear down the block or in the middle of the street. Everything would be enclosed, but just me and my patrons, so it wouldn't mean nothing to get out of control. It's certainly not amplified we're, not attaching it to amplification of speakers of any kind. Okay and this idea of karaoke. How would that be part of it? Is that that's extraneous at best we're happy to make that go away. That is not really part of the business model. If it offends the senses of the community board, we're happy to let that slide. That you know could happen with a small karaoke machine I. Imagine, but it's not really. It doesn't really fit the model so happy to set that aside. If it makes everyone more comfortable, okay, all right, any other committee members have any other questions or comments. What did you say? I didn't hear what you said: I'm from a jerk country, which means it will be totally authentic right. I'm the most pronounced J Chicken seller in New, York City on the east coast of America, I'm in the New York Times, I'm in every local map, any magazine that have to do with food, I'm the best thing outside of Jamaica. To be honest, you know if I don't want to toot my own heart. Well, it's not so bad. To put your arm, you have to be you better, be, of course this is. Can we conversation I'd like to just get to a resolution of what the resolution should contain and what it's actually going to be for so I get that the applicant is saying that they would apply for beer wine. Only I think that we should still. If there are reservations about an op. We should still include what those reservations are, even if they're confined to one, whereas clause, and we outline them. That's just so. We know that we're not proceeding only because we think that the construction of the business, which, by the way I think the construction of the business as I said before it is not doesn't really fit in what the with the method of operation that's proposed. But given that it has a does not have a bathroom that they can't proceed with Nlp. We should certainly include that, but I think that shouldn't be the only reason for having a concern about an application for a full op for a place. That's not previously licensed for somebody with no license experience in this particular area with all these licensed licenses and all these issues, so I would include that as a whereas clause. I would say that the applicant has decided to proceed with a beer wine and then they should go on to and I can make other aware clauses if you like that, we should go into what the stipulations would be for this business and whether or not they would mirror what the application is or not. So this is not a full service restaurant. This is the takeout restaurant, so it wouldn't be operating as a full-service restaurant. It would be operating as a caribbean, restaurant, Caribbean, Takeout restaurant, with a kitchen open and serving food all hours. So here there's also a proposal for a sidewalk cafe. This location has never had a sidewalk cafe, I, don't know if you mean that you're intending to put to apply to Pca for a sidewalk cafe or you're, including, what's otherwise, permitted by the city or in the state during their executive orders and emergency executive orders. So you have to clarify that for me, so I know how to address that all of the above they certainly want to take advantage of whatever is available in that fashion. There's no immediate plan to apply for an outdoor cafe on a permanent basis outside of being allowed to. You know avail themselves of the outdoor allowances that exist through the Covid-19, but I think that they want to have the option, which is why we included it depending on what the state decides to do with its Covid-19 related outdoor applications to apply for a permanent outdoor seating. So what is permitted pursuant to an executive order, a city, emergency executive order, isn't something that we included in stipulations that become conditions of the license, something you're entitled to apply for separately. With respect to that sidewalk cafe, I would say that you have to apply to Gca. We wouldn't consider it as part of this application. You have to apply for it with Gca, and then we consider it as part of the Gpa application and that's because this location doesn't have an existing sidewall cafe, there's an existing one. There can be a transfer, but there's no existing one. So then is the facade fixed or will it be open? It's fixed closed I believe do any of the glass front facade open at all of it is closed. So then it will have a closed, fixed performance, no open doors or windows and the entrance door will be closed no later than 10 or when there's any amplified noise inside yes, so I skipped hours of operation, I skipped music and security. I'll go on to no alteration without first coming before community board, three, no pub calls or party buses no wait lines. Happy hours to 8 pm and staff outside no unlimited drink specials also, so those are all standardized stipulations. We should go back now to the hours the idea of security and music type right. Does anybody want to speak to any of those? No I own? Multiple restaurants? I was talking to the committee members. Oh I'm sorry into the committee member. Sorry and I can give you the where clauses before that. So if it's, whereas what the application the applicant is applying for, what the elements of the application are that this is a previously unlicensed location that there are the number of licenses for the applicant and press. What the applicant's experience has been that the applicant's not that the it's for the applicant that would have to separately apply for a final cafe since there isn't one here that we heard this, that the applicant originally applied for an op, and then we heard the elements of the application, including that this is primarily a takeout restaurant without a bathroom, and that the applicant stated that it would then proceed with a wine beer license. Okay, so yes, let's go to hours of operation. So is there anybody in favor of the 12 pm to 4 a.m, hours all day, I know that there's the service of alcohol till 12 a.m and the take-out service only after 12 a.m. That was a part of the proposed application, but I'm just talking about the hours of operation, so it would be 12 a.m to 4 a.m. All day, which is what the applicant is proposing. I'm anybody, fine with that they're yeah they're, stopping liquor service at 12, I! Guess I'm fine with that anybody else. I agree with one: okay, anybody else, Herman Michelle! I'm sorry! Does that mean there? You have no opposition to it. Okay, all right Ellen is it 12 pm to 4 am hours of operation would be 12 p.m, to 4 a.m, all day with Feeded service and alcohol service, ending at 12 a.m every day and take out service only between 12 am and 4 am so with respect to the music type. The applicant is saying background level. Music. So then is asking for a Dj's live music and they said karaoke, but they don't need to have karaoke, it's not essential. So those are the things that would be different from recorded background music and also there's still the proposal for a security guard. How would a security guard be used and when would a security guard be used for this proposed business? The security guard we use just to make sure everything is going flowing because I know this is the area that includes a lot of bars. You know saying people stumbling in I just want to make sure everybody is safe and everybody there's not like a crowd. Build up outside of my store. I just want to make sure I incorporate that so everybody's safe everybody's happy, there's no loud crowds outside. So all the neighbors are cool. Everybody's happy I will incorporate them on weekends, like Friday Saturday days. That area is more lively, just to make sure everybody's happy and there's no issues Friday and saturdays from when to win Friday Saturday from maybe 7 to 12 8 to 12. During that peak hours, people are outside walking, especially after Covid-19. You know so, if you're talking about in that area- and you want to talk about peak hours- it's not going to end at 12- oh yeah, oh, but also alcohol service is ending at our place at 12, so for people that are potentially you know, barnstorming and stumbling around or looking for the next drink or continuing their night they're going to come stumbling in, though after 12 and you're going to have someone there to tell them you're, not serving alcohol. Yes, it's true, and especially when it's take out food I mean I'll. Leave it up to you. I'm just saying your peak hours on Friday and Saturday of people walking by and stumbling by are definitely not going to end at 12 on Stan Street, I'll watch it, but I will incorporate a security guard to four. If it ever becomes an issue which I certainly don't think it will. But if ever becomes an issue, I will have security guard there later. The places that are take out, restaurants with fear wine licenses, don't have security guards right I get that you want to control. What's going on, but you're I think we I have to decide whether or not this should be a part of the method of operation of the business when it's not supposed to be part of the method of operation of the business right. A takeout place is not supposed to require a security guard for the SLA. The addition of the security guard highlights for it that it's not only just to take out place because I mean that's how they view the institutional security guards. If this is something other than just a place that serves food and serves diners, we're happy to remove that idea. I just don't want the archaic rules of what is supposed to be to get in the way of what is practically useful for the community. But whatever is whatever the community means best. The applicant is certainly available to either. If it's. If a takeout space is not supposed to have security guards, then it will not have them. But if it's useful, that's what the Jason's saying is that he's happy to supply them? I get this. But this is my concern with this application and that, and also from what I've heard right and all of the elements of this application look like a place that wants to capitalize on what the area is like. What you've actually said, both of you have said has led me to believe that you want to capitalize on what this particular area is like the fact that the particular area is like this is the reason why we don't need another business that wants to capitalize on why it's like it that you want. You know that the reference to whining something lively and entertaining like with respect to the possible dj and the possible live music to draw people in and to develop interest in the business that I get, but I mean that I guess that you think that it can go here. I, don't see it in the other business that you have somewhere else. What did you actually say? You said well I. Think the council said that having the Dj would be a cool idea for this area. The applicant said I just feel like you're trying to be too many things with a space. That's too tiny, right and you're trying to counter that by having a security guard right and the way that I think it's sufficiently countered is by not serving alcohol after 12 o'clock. This is just something extras: it wouldn't be something that I need. I, don't feel I need a security guard, but being that Covid-19 is going on where all these things happen in that area, I just wanted to make sure everybody's safe, there's, no buildup of crowd outside just somebody that that's he's in the crowd in and out calling numbers. Well that I mean that sounds more like a staff person, that's managing your space as opposed to an actual yeah security guard. You don't necessarily have to be a security guard. It could be one of my staff members, you know, I'm saying, doesn't necessarily have no security and that's fine. That's what we all often ask for is that you do have a staff member, that's just watching things, but it doesn't necessarily have to be a door, a bouncer or security guard. Of course, no, that's better! That's more of what we usually ask for something like this. Just someone to manage your space and the people coming going, but it doesn't. Security does usually infer like clubs or no okay, other things and I know that's not what you're that doesn't sound like what you're really intending okay. So then we need to just go to the music type, which is as proposed as a Dj one, to two unamplified instruments consisting of a violinist or a kettle drum a flatist, a saxophonist, possibly two percussion instruments. At the same time, my proposal will be that we limit them to that recorded background music. Only oh, the prior business didn't even have recorded background music. I, don't see how the 150 square feet can even accommodate this. With these two editions or either edition, in which case it would be recorded background music, no promoted events scheduled performances or events that covered I mean something that live music would be. You know in basically a 150,250 space. Any kind of live music would probably just seems like it would be a lot even just come in an order. I, don't know, maybe I agree and to follow up with the conversation about security guards and crowds. I think that would definitely ensure attracting a crowd or impromptu okay. So then it would be no security recorded background, music, no live users, Dj promoted events scheduled performances or events with cover fees. So then I would just put in the where I clause that in a way, I applaud that, given that this previously operated as a takeout restaurant, with none of the proposed elements for this business and given its small size and inability to seat more than 10 people at a time that we would have prove this. But we would approve this with stipulations modifying the method of operation to be consistent with what the proposed method of operation is, which is primarily a takeout restaurant right and then the hours were what you said, which is 12 p.m, to 4 a.m. With the 12 A.M Ellen, did you get that alcohol service and sit down dining ending at 12 a.m and take out service which only between or after 12 a.m? Do you want some prepare? Oh sorry, Helen. Do you want something that specifies when take a service ends, or is it just the hours of operation no I just said after 12? It's fine, if you say after 12 a.m. Okay, is there a second or any amendment or other aware clauses, I? Think I'm? Okay with that? Okay, all those in favor Ellen Herman. Did you say yes or not? Yes, you're muted Herman just raise your hand or put your thumb down. Yes, okay, good, okay! Thank you! Okay, all right so would I send the stipulation forms I have to prepare them, so would I send them to you Mr Pierce, or do you want them to send them to you and Mr Hussey together, both please okay. Can you give me your email address? Mine is my name: Aaron a-a-r-o-n DOT Pierce Peters and Peter I, E r c e, w o k.Com one word: Pierce quack, okay and Mr Hussey J H U, S, E, Y, 7 1 at icloud.com, you said g. Is it yeah, h-U-s-s-E-Y 7-1 at Icloud.com? I'm sorry say it again, because I spoke over here. Just talk to me, icloud.com, so J-H-U-s-s-E-Y, 7-1. Okay, thank you at icloud.com, I got it yes, okay! Thank you all right. Thank you. Okay, we're moving on to number eight! This is an application for a tavern wine bar with a full menu recorded music on a ground level of 172nd Avenue yep good evening. Who is here for them? Okay, are you the applicant or the representative? I'm the applicant? Okay, thank you. Is there anybody else besides you here, okay, thanks all right, I'm gonna summarize this and then I'm gonna give you an opportunity to speak. So this location is unlicensed. It was previously Liquiteria. The proposed application is for a sievo of 74 with 11 tables and 36 seats proposed hours of 3 p.m, to 12 A.M Sunday Monday at 3 p.m, to 2 A.M Tuesday through Saturday inside and then, although there is no plan for outside it, has outside hours, 3 pm to 10 pm, Sunday and Monday 30 pm to 11 P.M Tuesday through Saturday. This is a six foot by 12 foot by 11 foot bar with nine stools, prep areas, certain food, all hours, the food being french, inspired food, french doors and windows. Without an agreement to close them at 10 o'clock, so the applicant didn't check that off under our simulations on the end of the questionnaire, no tvs recorded background music, they'll, promote events scheduled performances or events with covers. You know sound proofing, existing sound proofing, no intent to upgrade pub calls or party buses happy hours to 6 pm, no wait lives and staff outside the board of 172nd Avenue wrote a letter in support of this applicant of the applicant included as part of this application, based on the experience of the applicant operating with other businesses, and the applicant has seven I. Think businesses with the tavern wine or wine beer licenses in New, York, City. Okay. This is your opportunity to make a presentation or a statement about your application or clarify anything or change it. If it's changed since what you submitted to go ahead. Sure thing thanks for having me on this evening. My name is Rakesh Chandi Romani, I'm the owner of Seo Mount wine bar we've operated in New York City. For almost 10 years we have five operating locations, two of which we lost due to Covid-19. We operate in the West Village, the nomad district, the Plaza Hotel two in the Upper West side and so 172nd Avenue. Our proposed method of operation would be as a wine bar over the almost 10 years of operations. We've maintained that we've never applied for an upgrade to that license, as it goes outside of our concept, is primarily focused on french wine, so we only serve french wines. As paired with french food, we provide full table service outside the bar area. We have nine seats that are going to be in terms of how our bar is designed. We play background music, so we only have four speakers that are going to be inside the space: the french windows and doors, there's a french window just on the right side of the front entrance and just along the corner of the facade along between second and first Avenue, and for the proposed outdoor seating. We were intending to operate under what the guidelines would allow during Covid-19 for outdoor seating, but then would go through DCA for a permanent outdoor seating application, so we'll go through the due processes for that, so the proposed hours are the ones you're proposing for a future sidewalk cafe. No, the proposals yeah the proposed hours for indoor would be from 3 p.m, to 12, A.M, Sunday and Monday, and then 3 p.m, to 2 A.M Tuesday through Saturday and for outdoors yeah for outdoor it would be from 3 p.m, up until 10 p.m, on Sundays and Mondays and 3 p.m, up until 11 P.M Tuesdays through Saturday, but that's for a proposed sidewalk cafe that you haven't applied for yet that's correct, yes, but just indicating that we would intend to you know by probably next year. Okay, so I'm not saying whether or not those hours would be approved. As with the other applicants, who said that they had the intention to apply for a sidewalk cafe in a location where there hasn't been a sidewalk cafe, like you said, you have to apply to DCA separately and they would consider that application when we receive it from DCA. Okay, all right, okay, anything else, that's it! Okay! Thank you! Committee members. Has anybody signed up to speak, quit I, don't think! There's I can see everybody who's here. No one signed up see anyone interested okay. So why don't I make a? Does anybody have any questions? Nope I would just add. I do one thing to add: it's not even as much of a question, but you know, in terms of when I pulled all the 311s for all of his other businesses. I actually stopped going through all of them, because there was nothing for any of them and they've all been operation, they're all beer and wine. So there was absolutely no problems on any of this that I found for 311. Okay, so I'll go to the making of a resolution, so the first awareness clause will be what the applicant is applying for, but then it would be what the elements of the application are. This is an unlicensed location previously operated as a juice bar that we, the applicant, has expressed a future intent to apply for a sidewalk cafe and we've notified the applicant that we're not going to consider a sidewalk cafe as part of this application, but the applicant will have to apply to DCA and we'll consider that application when we receive it from Dcm, whereas the applicant has operated or up, has operated five of the same businesses in New, York City in the past 10 years, with either tavern wine or beer wine licenses, and that, given that giving these circumstances, we were approved with stipulations governing the method of operation of the business. So then we would, it would be tavern would operate as a tavern wine bar with a prep area or less than a full service kitchen serving food during the lives of operations at the hours would be 3 p.m, to 12, A.M, Sunday and Monday 3 P.M. To 2 A.M Tuesday through Thursday, the facade would close at 10 p.m, which is the standard requirement for this of the industry at this point, but also for this area. If the applicant would only play recorded background music, no, there would be no Dj's live music, promoted events with cover fees or scheduled performances that it would not apply for an alteration without first coming before the community, for the Nazi upgrade without first applying to the community board would not have hub calls or party buses, but none of them. Limited specialists with food could have happy hours to 6 pm, would not have weight lines and would have a staff person responsible for overseeing crafting noise outside. Is there any amendment or addition to the revolution or anything that anybody thinks should be addressed differently sounds good? Okay, all right all in paper, hi Herman! Is that you too okay yeah, two who seconded I can? Second? If not? Okay, that's fine! Yes! Okay! Thank you Herman! So do you want the stipulations that have to be the typed out document that I have to send to you or the office? The Community Board office sends to you for me once I finish them. Do you want them to go to your email address, or should they go to someone else? Well, you can send them directly to me. That's fine! Okay, what is your email, Rakesh R-a k-e-s-h at v-s-v, these and Victor S and Sam V, as in Victor wine bars with an s at the end.com yeah w-I-n-e-b-a-r-s? Sorry, okay, thanks! Okay, thank you. Have a good night all right, moving on to item number 10, which is a new application for Chris, Dogs and Pdt from the existing manager, so he's here, Elky and Hull, and I've got Jeff Bell yeah apologies. My five-year-old daughter was using my computer for her zoom classes, so I'm not you're, not Delilah, Homeschool, Dad, okay, all right so crisp dogs was an application that we denied in 2003 both for the one beer and its upgrade. In 2004, we approved the alteration to send the op license to the existing Pdt in May of 2008, which I think was, after a violation for an unlawful extension of premise before the SLA and they administratively approved a 100 corporate change. In June of 2019- and this all, although it looks like a new application, is a manager employee who is taking over these and maintaining its name and method of operation for names and method of operation, so the Cfo is 74 or 12 tables to do infused six tablespoons for the reality stools and group drugs tables eighteen seats at Pvt, a ten foot bar with eight stools at crisp dogs. Sixteen football with thirteen stools of Pvt at Prep area serving food consisting of gourmet, hotdogs and hamburgers all ours. There's no answer about the facade, I, don't I think it's fixed for both there's, no tvs recorded back reviews and they're, promoting that scheduled performances or, although not checked off. There are video games, I! Think in quick dogs, no security, existing crown proofing, no pub calls or party messes, no happy hours, says no agreement about no weight loss, but then there was a statement that they were that they had a reservation policy in place now and staff personally responsible for crabs and noise outside the applicant found. The 250's within 500 feet has no license experience, but that, as I said, has worked in the business for 10 years and then the general manager for six that previously licensed was issued. August 9th of 2004. Is there anything you want to add or say or a presentation you want to make I think you summarize that's exactly right, I think in 2019 the corporate change that came before you didn't end up happening, and so it was approved here, but it wasn't, it was withdrawn or from the SLA as for the transaction and go through so the transaction you have before you now is Jeff essentially taking over from the prior operators. Jeff has, as you said, he's been there and there will be no change. No structural, no alterations, no change in the meth of operation from what it's been just a side. Note about the 2019 transfer that you had approved. It took a while for the state to process that and it ended up being approved by the state, but that was in March once everything was starting to fall apart, so we withdrew the application because we weren't sure what was going to happen. So the whole deal then fell apart. So now, that's why we're going through the whole process over again? Okay, but just with a different corporate name, that's correct! Okay! So can you tell me the thought? Is it fixed because your front three steps down it's below street level and it doesn't have windows that open or french doors? No okay, thanks all right, we do have someone that would have their hand up. They would like to speak. Go ahead. I had no other question, just clarifying that. Thank you so much hi Jack Mary Round, hi Mary. How are you Jeff? Are you the owner? I am, if you guys give us a thumbs up and yeah, then yes, but yeah, it's Brian still involved. He is this. Giving us a thumbs up, gets him out. Okay, I'm going to say something which I can not believe. I'm going to be! Very quick about it, I live behind them and I was had a very contentious relationship with the owner. For years it was suggested that I go into mediation. My lawyer told me exactly what was going to happen as a result of the mediation with the city. Zero things only got worse. I do want to say that when you started managing the building, things got much better and not only that when it's noisy and I call up I call I literally call so much that they knew who I was I would call, and the noise would stop so I want to say that I would like to be a good, neighbor and I hope that you will continue to be a good, neighbor and I hope that you won't open the backyard to a you know a backyard cafe even during Covid-19 can I ask you. Do you plan on doing that? No I mean, if that's something that's very important to you. Then absolutely not. You know it's not just that, but we have. You know, there's a serious rat problem back there also, which would have to be abated before anything like that. Could happen but I know it's very late and I don't want to take up any more time. I just want to say that you have been a good neighbor and I hope that we can continue our good relationship. Thank you, yeah absolutely Mary, we'll catch up offline I'll, give you my information. So if there is any, you know, are you going to be? Are you going to be here in New, York, yeah I live in skytown and I'll, be I'm managing the bar on site, so I have two kids one's in the local school district, so we're not going anywhere. Thank you. So much thanks everybody. So let me just say this, which is that I mean if you're not going to use the backyard under emergency executive order. I, don't know that executive order necessarily applies. It has to be the emergency executive order that takes it into account. Aside from that, the zoning prohibits outdoor use for where you're zoned, so you can't actually under the zoning without those executive orders, you can't actually extend your business into the backyard or extend it into the front of the business. There are some violators on your street and they may not have that. It may not have been addressed with them because their businesses are existing businesses, but every new business that comes along or every business that changed. We make sure to tell them so that you know that you have to abide by the zoning yeah. Okay, that's great yeah! We, the our business model, doesn't really it's a small cocktail bar you know, seated only the backyard doesn't really fit. What we're doing and the other side the takeout hot dog stand. So it's definitely not part of our model to use that something we looked into just to be. You know about with Covid-19, seeing if there's ways to work around that, but it's not an essential part of what we're doing and it takes away from the speakeasy aspect of people are sitting outside yeah. It's a little yeah agreed I just want to thank quickly thank Mary, because it's also not all that often that we have amicable neighbors come to kind of support, an application. So thank you for taking the time. Mary I have to say this. If you would have told me five years ago, I would have done this I would have told you are[ _, _] crazy. It would never happen. I feel like I'm growing, and changing and I want to be a good neighbor so and Jeff has been a great neighbor. So thank you. It's a great meeting. Thank you. Okay! So then I will I, guess I'll go to the making of a resolution, my cat's hungry. So whereas she's bugging me sorry, whereas what the applicant is applying for with the elements of the application are that this is a sale of assets. I'll go on to of the existing business, with an intention to maintain the name and method of operation, the history of the application applicant and when the license was issued. That's the previous applicant and the history of this applicant, which is that this applicant is I've been employed by and the General Bible business for 10 years and the general manager of the business for six years and I can put in that a resident appeared who had complaints with the previous owner but stated that they had improved when this applicant became the manager and if this applicant was responsive to any of her concerns, and that, given that the applicant is the existing manager and intends to maintain the business name and method of operation, they approve at the following stipulations. So this would be tavern restaurant with less than a full service kitchen serving food, all hours of 12 pm to 4 a.m. All day, no outdoor space, closed, facade recorded background music, only no dj5, music, promoted and scheduled performances or events with covers no alteration. Without first coming before the community board, no pub closer party buses, no unlimited specials for food, no happy hours, then we just have to decide what happens with no wait lines and an agreement to have step outside to monitor the noise. So, for us, I mean the no weight loss thing is something that we always try to incorporate in an existing business. I, don't know what your existing business model is like or what it was before. March, certainly a little different now Saint Mark's place is horrific in terms of the people out on the street, and this is pre-march. You know the people like standing in front of businesses on the street and milling from place to place so I just want to understand. For that one like what it is that you do now, it seems like you already instituted something to not have weight lines, which is a reservation policy. Yeah correct, there's a lot of low-hanging fruit on St marks in some parts of downtown, where you know, people open bars and put all the drag nets to get everybody in, and we focus really hard on our cocktail program to make it you know, is unique and delicious and premium as possible in order to execute that we do a seat. We have a policy on no standing room, so we all everybody- that's inside the bar has a not an assigned seat, but they have a table that they're sitting at or they have bar seats. So there's not like it's not roaming around and I. Think some of the policies we implement are discouraging to some of the crowd that populates, the wild knights of the East village and lower east side. You know trying to get a little too crazy, so we have a more sophisticated vibe than your average corner bar. It works out great. We have a great ratio of staff to guests. That's you know five guests for every one staff member. So it's a pretty. You know not the most efficient business model, but it's great for service. It's really. We pay really close attention to the guests needs and how, to you know, take good care of them as they're gonna be coming in off the street and going back out into the you know the crazy city that New York is, but we do reservations only we do by phone and we just in March. We implemented an online situation with a company called Resi to do some to alleviate and stagger the seating, so there's even less of a chance of a line forming, but we communicate that with all we have a host, that's dedicated to community a point person for each party. If they're on a waitlist, they were they're, instructed to go somewhere else and wait whether it be to Buwa or Momofuku to have dinner. We call them and let them know they're ready. So we try pretty hard to coordinate that. So it's not a just a big waiting line of people outside ever. Could we include no wait lines or do you actually have wait lines outside? We? Don't really? We don't have them when we open it, we open at 6 p.m. So sometimes on a Saturday afternoon there might be. You know some tourists that line up waiting to get in, but that wouldn't be something that's ongoing throughout the night. That's just that as we opened people trying to get there like doorbusters, but it's not something that happens, that we don't have a line out the door at 11 pm or 12. It's not really an issue so understanding that as you're describing it you don't really have them like I would just include that in the method of operation that they're in their weight line. Okay, all right! Okay! So is there a second for this or an amendment or any I'll section? Okay, all right opposed, I'm saying none, okay! So Elky! Do we send this one to you also yeah, that's fine! Okay, all right this one you'll probably get tomorrow or by Wednesday morning. Okay! Perfect! Thank you guys. So much! That's great! Okay! Thank you very much for your time. Take care. Thank you and motion to adjourn. Yes, because we forgot last time. Yes, we didn't. We forgot last time, so it's okay, yeah, that's fine! I! Don't think we have to vote on it did we have anything because it's constructed it's just a line item with no voting. Yes, no other new business or anything. So no there's still a person here, though I don't know what he was here for next month. So you know probably have two meetings on the 11th and the 13th, because we right now we have a little bit more than like nine items, so we broke them up. Okay and we should be they're still getting items in the office up until Monday or not Monday, the 11th whatever day, that is that Thursday Friday yeah, that's it so anything else before you know we can depart motion to a journey with that said: okay, good night, everyone bye.",
            "summary": "Applicants will have a chance to respond, and then the committee members will discuss and come to a resolution and with that being said, Alex.\nThe applicant submitted a statement that it is applying for hotel wine license with second, with its second floor, closing at one A.M Sunday through Wednesday: two a.m: through Thursday through Saturday, a ground floor lobby closing at 12 A.M Sunday through Wednesday, two A.M Thursday through Saturday Ground floor outdoor seating on Orchard Street, closing at 10 pm Sunday through Wednesday and 11 pm Thursday through Saturday Ground floor outdoor seating on Allen Street, closing at 11 pm Sunday through Wednesday and 12 A.M Thursday through Saturday and 12th, for if they put 12 floor.\nIt's the rooftop closing at 2 A.M Sunday through Wednesday and 1 A.M. Thursday through Saturday, while the tavern wine is limited to its second floor.\nIn November of 2016 and approved with stipulations to operate a tavern lounge with prep area serving food, all hours having service and sale of alcohol, limited to the second floor, Having hours of 9 am to 8 pm all days, having no music, having no kitchen having no speakers tvs or monitors installing soundproofing along the walls and installing soundproof barriers and planters along the parapet.\nWalls on this floor, having happy hours to 8 pm, not hosting pub calls or party buses, not having unlimited drink specials having its entrance through either the Orchard Street or Allen Street entrance, maintaining low-level lighting not having weight lines and having to step outside and not seeking an upgrade.\nIt's just closed facade that the second floor is actually an open arcade which we'll I guess we'll get into.\nIt, says one private party per night, no pub, crawls or party buses happy hours to 8 pm, no wait lines and plans to use the lobby as a waiting area for the second floor.\nHaving people responsible for overseeing crowds and noise outside the particular specs for the public spaces would be the hotel's 460 square feet with a capacity of 15.\nAnd I'm, going to ask that the applicant is making your presentation that you include actual opening hours for the spaces, because all I have are closing hours so closing at 12, A.M Sunday through Wednesday 2 A.M Thursday through Saturday no bar food service from the prep area.\nIt, says all hours of the second floor bar cafe is 1400 square feet.\nIt says, surf food service from the prep area recorded background music.\nClosing at 12 A.M Sunday through Wednesday 1, am Thursday through Saturday, no barn or food service recorded background Music Orchard, Street, Ground, Floor patio, it's 360 square feet, capacity, 16 core table 16 feet.\nClosing at 10 am Sunday through Wednesday 11, Pm Thursday through Saturday no bar, and it says what you may have to explain: food from prep area purchased in hotel, no music, I, assume that meant people are buying the food inside and bringing it outside and sitting down.\nThe proposed closing hours are 11 P.M Sunday through Thursday 12, A.M Thursday, through Saturday and in response to proximity to residential windows, which is a component of our hotel, application.\nYou know this is a new applicant, a new client for us, but they had originally applied for hotel liquor and were not I.\nNo physical, alterations, Being made, The idea would be to expand it to a hotel, wise hotel wine license to allow room service in the interior lounge and on the roof and the outdoor spaces outside the pro part of the problem.\nThe principles could probably give you a better idea of exact opening hours, because of course you know there is your breath when the hotel is open, which is not now there is breakfast served.\nI wasn't here when they applied for the liquor license, but I was here as soon as we just received the liquor license to be able to do this, so I've been operating the space for since it's been open and since we've started being able to serve on the second floor, make a couple of points.\nYou know the Orchard Street hotel, it's a small 50 room hotel that is almost like a select service with a little bit food and beverage.\nWe use it as a really as a amenity to the gas to be able to drive sales and be able to make sure that the guests have a good experience than just here's, a hotel, room, and then you know, and that that's it.\nSo I'll try to focus the conversation a little bit more because I'm not getting the information that at least I think I, need, or my committee members need to be able to construct any kind of resolution.\nIf it was just currently how it's set up, it'd probably be like we were opening at four before, but I would say maybe a little earlier in the weekends, maybe like, maybe at 12 o'clock, because the thing is just whatever need I need you to give a specific time, because I'm going to construct a resolution of stipulations from those times or I'm, going to change.\nSo then, The proposed opening time for the second floor area would still be consistent with the 4 pm.\nOur hotel is very small, So. You know personally I think that it should be 12 p.m. In most spaces, because, if someone's having lunch and they just it's really just walking down the side, It's not a large place with lots of different areas, but I'm not negotiating with you.\nIf, you want to put it that way, you know floors three through 11 are 24 hours, because it's a hotel, No. I'm asking about the check-in.\nOn, the second floor, Do you actually have another area where food is served.\nOkay, all right, I'm only clarifying that, because Elsie said it would come from the lobby, so I just wanted to make sure that it clarified that no I think okay.\nIf you can speak to this now, rather than us having to go into more of a discussion about it later, you might be able to answer these questions up front, which would clarify everything for the committee and anybody who's listening, and it was an open air arcade with four foot parapet walls and then this funny not really like glass or plexiglass barrier that went from the fourth foot to the ceiling on both sides.\nSo I'm asking: has there been any DOB plans to con to change the structure so that it's foreign closed and has have any soundproofing efforts been made with respect to the second floor, which was part of our stipulations in 2016.\nOkay, and the final question I have is with respect to this rooftop, which in which you're proposing to have recorded background music.\nLet me tell I think it's on orchard actually, where we right now currently we'll be throwing refresh so deliveries on Allen, Street, Happy hours to 8 pm in any publicly accessed area.\nWe're responsible for overseeing crowds and noise outside and directing vehicles, So with respect to the lobby, I would say, operates as a check-in out area, seating area for guests waiting area for people going to the second floor, bar cafe with food service during all hours of operation.\nThe second floor, prep area recorded background music hours of 12 p.m. Does anybody, Let me ask the committee members, so the proposed hours are 12 A.M Sunday through Wednesday, two A.M Thursdays.\nSo, then it's 12 p.m, to 12, A.M Sunday through Wednesday, 12 pm to 2 A.M Thursday through Saturday, and having a close fix facade with no open doors or windows.\nAnd I will say this with respect to hours of operation, The applicant is asking to close at 10 Sunday through Wednesday 11th Thursday through Saturdays our standard in terms of what we approve for outdoor spaces, 10 p.m. On orchards, Our standard on Allen Street, although there are fewer, has been the closest nearest approval has been for 10 pm.\nAlso, so that's 140 Allen, which is the block below this building, so I, would propose just changes in the hours of operation for closing at 10 pm.\nIt's no food or alcohol service, but food and alcohol available for purchase from the second floor bar cafe is that correct.\nWe're approving them, with an actual like found plan to address music on the roof in any kind of capacity.\nThe positions below the parapet- walls, yes, okay, all right and then with respect to hours of operation, I would just propose 12 p.m, to 12 a.m. Be service up there, but they are gonna, be able to buy their drinks and take them up.\nYou know the plan is not to have we're not going to have like a portable bar up there, where people can.\nIt was approved background music, I have to double check, but I think my understanding was that they went to the liquor authority in this.\nSo, with respect to the second floor, So the method of operation would be the bar cafe with prep areas serving food all hours of operation, then we have to I guess, address music at proposed hours and our original stipulations were for soundproofing along the north and south walls, consistent with the recommendations of the sound engineer and sound baffling materials and vegetation in front of the nano walls at Orchard, Street now and street.\nOpen Air, Terrace, Open, operated from 9, am to 9 pm, notify and request approval for class change and ambient background recorded music, no promoted, events.\nI know it was proposed, but from the applicant it hasn't happened, but in order to build the hotel to the height it wanted it had to leave that second floor open.\nNow we have a space that has been playing recorded, background music, but hasn't been open.\nYou know I just turned on the music and went to the rooms right upstairs, because you know that was really our main business to make sure the guests don't have complaints.\nKnow, security personnel at this type of hotel, okay.\nSorry I think the idea was that you would never have multiple people booking various spaces, but that, If somebody had like, if there was a birthday party or an event in one in the cafe, there would be no other events.\nThe cafe could be a private dining, A private party, like anybody like any restaurant, would be able to do a private, it's already advertised as an event, space, so you're saying that any event would be confined to the second floor.\nI, also understand from your website that it may apply to a business event for people who are staying at the hotel if they want to use the space.\nOkay, So the other warehouse clauses I, would put that this is this hotel has been operating since 2014 with the tavern license since 2017, but is in an area surrounded by licensed businesses, including hotels and I, would reference that the conditions in the end is adjacent to residential apartment buildings on both sides of the building on both Orchard and Allen Street that consequently, We would approve this application with stipulations governing the use of the hotel and the public spaces and specifically addressing the extent of the use and bound attenuation or mitigation for the spaces.\nSays, recorded music, no outdoor space on the first floor in basement.\nThat's, the SLA notice or the notice to the Fla. The previous applicant was approved in Opi, license in September of 2003, with stipulations not to have djs and to have a bar no longer than 10 feet, and it was heard for renewal in March of 2010.\nThere were complaints of noise from the open facade, and we approved additional stipulations to replace the speakers with smaller speakers that would be repositioned off the Avenue B wall and below the ceiling level and to install a limiter.\nAdd djs increase the bar size and change the hours from 4 pm to 4 am all days, and we have proved with stipulations that the facade would be close to 10.\nMusic, have djs in the basement, not have live, music, promoted and scheduled performances or events with covers, not host pub calls or party buzzes not apply for alteration without first coming before the community board and then approving security, Friday and Saturday for 10 pm.\nThe diagram shows what looks like a 19 foot by 8 foot bar with 13 stools, three tables with 18 seats, compress seats, comprised of a chairs and a sofa, and one of the diagrams submitted with the original and amended application had the sidewalk cafe, consisting of two tables and four season: avenue, B and eight tables in 16 feet by east 3rd Street.\nNo wait: live staff outside the African County 12 repeats within 500 feet and has operated a business called blue room on 9th Avenue since 2008, which has a beer.\nShe had to transfer the license into these trusts and now they're selling the bar, because you know she doesn't want to operate.\nThen you know he's every day going to the bar and then surprise it and then in terms of the music.\nOkay, My point is that if the sidewalk cafe was a cause of many of the noise complaints, do you want to speak to them.\nActually, when I was there, I think for a short period of time, I, believe it's somewhere around 2015 or 16, Jeff and Jenny, and you know they lived on a bow.\nI. Don't want to be too okay, personal about it, I, just a quick statement that corner is extremely noisy and when Mama's bar open facade was open, You could hear it halfway down the block.\nOn the sidewalk day, in and day out, You hear the music in the middle of the block, so those open facades are basically outdoors.\nYou know we'd, be interested to hear your concerns about noise, and you know also I'm wondering if the configuration of bars in the area because of the pandemic maybe has changed.\nThe problem with Mama's bar has always been this open facade, So it generated many complaints like the resident down the street said because you could hear the noise from the open, facade, half a block, away.\nIf we're going to approve this license, we have to understand that these applicants are equipped to address that, because, on an ongoing basis, The last people were not, and we did multiple things to try to limit.\nMusic is appropriate for that space unless you're willing to say that you're, adding additional sound proofing or you're going to do something to address that noise, Even with your doors and windows closed and with your doors and windows, open it, it's unbearable.\nYou know where, Wherever you are so we are certainly not going to operate the business in isolation of the community.\nWell, I was saying to the lawyer with the same I'm just backing up what Clint is saying, but that I'm generally passing to that place almost six days a week going back and forth from my office or the buildings or whatever, and you know, I, try to cost them at times if they could just Lord music, because the doors are open.\nI, know, there's competition in your type of business, and you have to do this to get people to go in and out and also the lateness of the opening, At least during the week disturbs me.\nThen, especially during these Covid-19 times, You know with the capacity limits we would like to keep the opening hours.\nI would say if you're going to, If you want to include whereas clauses about the complaints I, would include that consistent with the output, the previous applicant's history of complaints, there were 18 true on one calls within the past, year, six of which were non-crime corrected, or rather in a resolution.\nSo I, also put it a resident and two of his community board members who live and work in the immediate area stated that the music from the open facade travels down the street music can be as well as voices from a microphone used on trivia.\nWe heard that a number of times I think we understood that okay I just wanted to look up.\nAddressing its method of operation, including addressing potential noise traveling outside I'd, also say that the applicant has represented that that's not using the basement for patrons that's correct and not yet will not yet have a sidewalk cafe, but we'll apply for that separately.\nFirst, so would be tavern with a prep area, less than a full service kitchen serving food during all hours of operation.\nOkay, then we have to address live music, so we'll go back to whether or not they're going to have live music, because that's a variation from the existing method of operation that we would have to consider separately so and then, With respect to private parties.\nOkay, so no pub, crawls or party buses, no unlimited drink specials with food, no alteration without first coming before the community, board, no wait lines and a staff person, whether it's a security guard or a employee.\nYou don't have a security guard responsible for overseeing crowds and noise outside that doesn't mean that that's the person who has to stay outside, but a person who has to be mindful of what's going on outside the droplets all right.\nPlacement of the speakers, whether or not there should be a limiter, both of which we had at the prior business to address sound problems and hours of operation and live music.\nYou're, proposing you're, saying that you want to have entertainment level music on the weekends.\nSo, with respect to the speakers, I propose, We just have that their position away from the open, facade and below ceiling level, Facing inside, you know not facing towards the road.\nOkay, so I would say that we should put an awareness clause that the applicant is not proposing to add soundproofing and that the as representative the space does not have soundproofing so that to be in any stipulations, but also address the absence of soundproofing, and we would just leave music at recorded background level.\nAnd, then the other things do you want to add that there should be a limiter to ensure the background level of the music and the bass and the hours of operation they have to address.\nLate, night, Their noise problems are more between the hours of 8 a.m. To, midnight, I'm, sorry, 8 p.m. I would actually I'm not opposed to the 4 a.m. I, Do know that many times during the week, even if I mean I, know, they've, always had 4 a.m, but many times during the week, they're, not open, not, That I'm out till 4 a.m. But I know many times during the week they close a little earlier than 4 a.m. If it's only going to be the background music, it's okay.\nThe proposed hours are 12 pm to 4 a.m, all day with alcohol service to 2 a.m and take out service after 12 a.m. All day, Although the questionnaire said that the business is primarily a takeout business, kitchen open all hours serving caribbean food, there's no answer about the facade one television Dj's live music juice box, Karaoke.\nIt says that background levels, no promoted events, schedule performances or covers one security, guard, no sound proofing, no control, but party buses, happy hours to 8, pm, no weight loss staff outside the applicant counted 26 ops within 500, feet, I, counted 30 as well as four pending ops using the lamp map.\nThere are other reasons why I don't know that I necessarily would approve this application as it's proposed, but you can't have an op license in your bathroom.\nDoes he just want to speak about his application, because I can assist the committee by saying what I think are outstanding issues for the application as it was sent to us.\nDon't, think anyone would confuse it with a bar that they would go into which I know has been a concern in that area.\nThey'd have security and they're saying that the way that they would minimize all of those impacts is by having the alcohol, whether it's beer, one or anything, else, not served at 12 a.m. It's clearly a takeout place with very limited occupancy in an area.\nThat being said, This was an unlicensed location that was just a takeout place, so we're incorporating alcohol and the possibility of Djs live music karaoke into the shallow space.\nThe applicant is saying that they're not going to have weight loss, so I'm, hoping that that's the case, but I, don't know if that's realistic, given that the businesses in Brooklyn at least have weight loss without those elements.\nIt should not have security, whether or not it has the alcohol service, whether it's alcohol service or beer wine, it shouldn't be past 12, and then they have to decide whether or not the business is going to be open until four I think.\nI. Think that the question is, how would live music be even possible.\nI think that you know the kind of space that it is in order to just generate interest and excitement.\nYou, know avail themselves of the outdoor allowances that exist through the Covid-19, but I think that they want to have the option, which is why we included it depending on what the state decides to do with its Covid-19 related outdoor applications to apply for a permanent outdoor seating.\nWe should go back now to the hours the idea of security and music type right.\nOnly after 12 a.m. That was a part of the proposed application, but I'm just talking about the hours of operation, so it would be 12 a.m to 4 a.m. I'm, anybody, fine, with that.\nThose are the things that would be different from recorded background music and also there's still the proposal for a security guard.\nWe use just to make sure everything is going flowing because I know this is the area that includes a lot of bars.\nOh, but also alcohol service is ending at our place at 12, so for people that are potentially you know, barnstorming and stumbling around or looking for the next drink or continuing their night they're going to come stumbling in, though after 12.\nJust saying your peak hours on Friday and Saturday of people walking by and stumbling by are definitely not going to end at 12 on Stan Street, I'll watch it, but I will incorporate a security guard to four.\nWhen it's not supposed to be part of the method of operation of the business right, A takeout place is not supposed to require a security guard for the SLA.\nThis is my concern with this application and that, and also from what I've heard right and all of the elements of this application look like a place that wants to capitalize on what the area is.\nYou, know that the reference to whining something lively and entertaining like with respect to the possible dj and the possible live music to draw people in and to develop interest in the business that I get, but.\nThe applicant said I just feel like you're trying to be too many things with a space.\nI, don't feel I need a security guard, but being that Covid-19 is going on where all these things happen in that area, I just wanted to make sure everybody's safe, there's.\nYou know in basically a 150,250 space, Any kind of live music would probably just seems like it would be a lot even just come in an order.\nThis is an application for a tavern wine bar with a full menu recorded music on a ground level of 172nd Avenue.\nWe play background music, so we only have four speakers that are going to be inside the space, the french windows and doors, There's a french window just on the right side of the front entrance and just along the corner of the facade along between second and first Avenue, and for the proposed outdoor seating.\nTavern would operate as a tavern wine bar with a prep area or less than a full service kitchen serving food during the lives of operations at the hours would be 3 p.m, to 12, A.M, Sunday and Monday 3.\nThink in quick, dogs, no security, existing crown, proofing, no pub calls or party messes, no happy hours, says no agreement about no weight loss, but then there was a statement that they were that they had a reservation policy in place now and staff personally responsible for crabs and noise outside the applicant found.\nThis would be tavern restaurant with less than a full service kitchen serving food, all hours of 12 pm to 4 a.m. All, day, no outdoor, space, closed, facade recorded background music, only no dj5, music, promoted and scheduled performances or events with covers no alteration.\nYou know the people like standing in front of businesses on the street and milling from place to place."
        }
    }
}