{
    "YoutubeMetadata": {
        "author": "BCB10",
        "channelId": "https://www.youtube.com/channel/UCIpK0Bh0wFnC-QqgJs6hx5w",
        "title": "Brooklyn Community Board 10 Land Use Meeting",
        "publishDate": "2020-06-09",
        "shortDescription": "Land Use Committee\\nBrooklyn Community Board 10\\nMonday, June 8, 2020\\n7:00 PM"
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "BCB10",
        "normalizedName": "Brooklyn Community Board 10",
        "twitterName": NaN,
        "youtubeChannelName": "Brooklyn CB10",
        "youtubeChannelURL": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
        "twitterHandle": NaN,
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "Okay, thank you all for joining us tonight, zoning committee reading forum to discuss BSA application for 437 88th Street to allow a physical culture establishment gym at the site, which is not permitted under the zoning, and we will have a presentation through quick presentation of the issues that you send us in the application sure and if there's any questions about any of those materials, we can stop and I can answer it so anyway, good evening Tadeo for the applicant again, this is a special permit. Application, pursuant to section 73 thickness any building is proposed, is on the north side of 88th Street. It's an irregular site as a hundred feet. Frontage on the north side of 8th Street by a maximum of 167 see the total lot area is ten thousand two hundred square feet. This site is actually split between two zoning districts. The majority of the site is in a CD, 2 zoning district, a that's a hundred feet is there the CA 2 and then the western portion of the law, ten feet and change. 10.17 C is in a C for to a district both of those zoning districts. Allow the site has an existing building, it is cellar basement and first floor building, it's been useful commercial uses. Historically, there is an application. That's filed at the Department of Buildings for a proposed enlargement of the building to make it become a cellar and four-story building. They are essentially going to add two stories to the building and convert what is a basement floor into an actual first floor, so seller and Floor Store we'll be right now in his cellar and two above-ground stories, the one level is a basement because of a portion of it is slightly will upgrade. The proposed PCE would be located on portions of the cellar first and second floor of this enlarged building. The first floor would just be a lobby 258 square feet. The cellar, 8000 93 square feet will include locker rooms, an activity, curious PC activity areas, office, space and then the second floor be the largest floor, 10,000 85 square feet for the entirety of the second floor and that's for the primary defining specific findings. 470 336 requirement. You are named one of the eligible districts. This is an eligible district both to sea floor. To amsc8 to district and then there's two findings: the first is that it will not compare the essential character or future development of the neighborhood and oscillate. This will not because this is a typical commercial use that would be suitable for this district, and the next is that the proposed facility needs to offer one of a few specified uses. In this case, the facility would offer classes for physical improvement and also facilities for the blank is actually part of the equinox family. There's a number of places throughout Brooklyn, the two closest to this particular location, one is it 6502, 18th Avenue is the intersection of 65th and then there's one over on 50, 109 and fourth Avenue intersection of 51st. So not that close, the dark to those two closest blanks to the Douro number of blank facilities throughout all five burns. I'm happy any questions about this. Just last thing, I'll say mr. nobley, just here where this was filed. Recently the calendar number I, don't know if you have it for your records because they didn't assign until actually forwarded it to your calendar. Number is 2020 -, 33 - easy because of the digital filing it's taken a little longer anyway. This was filed. We've not received a notice of comments yet from the BSA I wouldn't expect one for a few weeks and we're likely not to have a hearing before the BSA I would say no sooner than September, don't forget to raise your hand, I, muted everybody, I, see and put a question in the chat. Okay, I'm, sorry, I missed it and the light and the use is a special permit is to be attended. Link is going to be attendance, they do not own the building. The enlargement was improved. Yes, the enlargement, if allowed the bolt is allowed. It was approved by the exact date, was January of this year, where it was approved. Actually, if you look on DOB right now on their website, the latest amendment to the job says disapprove, but just you know that, so we could obtain the denial for this. The way it works is you need to have the OBC. No, you can't have the use, but that's the only I think that's the reason says denied right now, but it isn't answer bright hues and then the special permit right, but this is one of the districts where you can obtain a special term for PCE. It's generally all the manufacturing districts, all the commercial districts except for c1 commercial districts do not allow this. She then leaves what are the repercussions well, when this is approved, should this be approved by the BSA, they approved specific plans and, as a matter of practicing their resolution, they also approve a specific operator when we file these applications there's actually a station is not sent to the city any time to a particular operator. So if Blaine were to leave, then the building owner would have a couple of options. They could convert this name joining passive rain commercial space, which would be in this case and the seller level like retail storage or office, or something as loud or they wanted to have another PCE operator, move in, let's say, like I, don't know, take your choice, your sports buggy, or something like that. They would need them to go back to the BSA and file for an amendment in order to reflect a change in the operator and the BSA and/or, the commissioners review that new operator and with respect any potential changes that they want. Okay, it's the same thing as if they wanted to have 500 square feet. This you would need to go back to the BSA in this case, if you want to change I, the owner is listed as ninety three twenty two third Avenue and I checked that out and the owner is listed as living or his address is that the UPS door? Oh it's possible if it's a corporation, is blossom Tate mailing at a UPS for both office box. To be honest, our primary. If we represent blink as the tenant, we don't represent the building owner, they do authorize application about the ownership. So we just say this is a franchisee blink. No blanket corporate owned blink is part of the family. Equinox I, don't know. If you know Equinox blink is part of that soul cycle is part of this is Susan and Susan. You can raise your hand and speak for some time, just one. Second, let me take a look and see what the last certificate of occupancy we can decipher. What used to be I, think I know there. You go to be honest. The last certificate of occupancy actually says offices show rooms for household equipment and accessory parking. So it looks as if it was an appliance store before it was the nightclub and whoever ran the nightclub did not update this. You know during the intro one of the conditions should this special permit be granted by the BSA as they do set forth or requirement. You do update the certificate of occupancy, show they use. Typically, they give you a year, I, don't know if they're gonna go 18 months because of the current circumstance, I mean slow down, but it will be a requirement of a grant that certificate for this particular use. Yes, it's not like a variance. We need to make the typical findings, in this case they're very specific findings and those three findings. Are you in a district where it's a lot is the proposed use going to disturb? Where is it fit with the neighborhood character? Will it disturb any potential future development, and then they want you, one of the uses that are listed. We provide the other options. You know yes, in order to I move that we approve this, for. Thank you just like to say that used to be a club and many times in my 20s I. Was there hanging out. So let's me to see it turn into a gym agreed [Laughter]! That's great! Thank you. Thank you, Marcus. Always thank you. Okay, good night mark good. You.",
        "summary": "Okay, thank you all for joining us tonight, zoning committee reading forum to discuss BSA application for 437 88th Street to allow a physical culture establishment gym at the site, which is not permitted under the zoning, and we will have a presentation through quick presentation of the issues that you send us in the application sure This is a special permit, It's an irregular site as a hundred feet.\nThe cellar, 8000, 93 square feet will include locker rooms, an activity, curious PC activity areas, office, space and then the second floor be the largest floor, 10,000 85 square feet for the entirety of the second floor and that's for the primary defining specific findings The first is that it will not compare the essential character or future development of the neighborhood and oscillate This will not because this is a typical commercial use that would be suitable for this district, and the next is that the proposed facility needs to offer one of a few specified uses."
    }
}