{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "title": "September 1st",
            "publishDate": "2020-09-01",
            "shortDescription": "",
            "lengthSeconds": "2:09:44"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "IxII5kds3bE",
            "fillerWordCount": {
                "uh": 512,
                "um": 362
            },
            "readTimeFullTranscript": "69 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "building": 97,
                "roof": 82,
                "doors": 50,
                "bulkhead": 38,
                "street": 35,
                "sign": 29,
                "generator": 27,
                "copper": 25,
                "bit": 24,
                "view": 23
            },
            "wordCountSummary": {
                "building": 26,
                "roof": 11,
                "street": 9,
                "storefront": 7,
                "sign": 7,
                "equipment": 7,
                "structure": 6,
                "entry": 6,
                "piece": 6,
                "view": 5
            },
            "fullTranscript": "All right good evening, everyone, my name- is Leila lo Gesico, I'm the chair of the Landmarks Committee for Community Board. Five. Thank you for joining us tonight. We have three items on the agenda. We are going to start with an application by 130, West 42Nd street, followed by 135Th Avenue, and then we will conclude the meeting with 201 park, Avenue south a few words about how the meeting is going to proceed. The applicants will have an opportunity to give a full, uninterrupted, yet concise presentation, and we really ask applicants to be as concise as possible, because although we only have three items, they are pretty robust, so we want to make sure that you know we have ample time to discuss the matter and also we want to be mindful of the time of the committee members and other applicants. Once this presentation by the applicant concludes. Members of the committee will have an opportunity to ask questions once this question theory concludes. I will open up the floor to members of the public for questions and comments to the application. The applicant will have an opportunity to respond once this period concludes. We will move to business session during business session. Only members of the committee are allowed to discuss the matter. We will make comments and then we will come to a resolution. We will make a motion. We will take a vote on this motion. This motion will be forwarded to the full board of Community Board, five to be ratified and the vote of the full board. It becomes the official position of community board 5.. The full board meeting is on Thursday September, the 12th luke correct me. If I'm wrong, you can find the zoom link on our website cb5.org. So, with all of that said, we will start the meeting with a presentation by the applicants for 130 West 42Nd Street, also known as the Bush towers. Thank you. Everybody. Thank you for the opportunity to present our work tonight. My name is Michael Granville, I'm an architect with darius Tarby Architects with me tonight is Farida smilov from my office, valerie campbell, our Landmarks consultant and Mr Vivek Desai on ownership, representing ownership. We're here tonight to discuss replacing the uppermost tower roof at the Bush tower. The Bush tower is a 1916- 1918 construction, vintage, high- rise building on 42Nd, Street, south side of the block between Broadway and sixth avenue. These historic images of the building show you how it looked. You know more or less in the at the time when it was constructed in the years that have passed, the cityscape has changed a bit, and it are you able to hear me. Sorry. Is this all so far so good yeah we get, we can hear you fairly well Luke. Do you have any concerns yeah if, if you're not speaking, be sure to mute, but we should be good, Michael. Okay! Thank you. Sorry, I've heard some murmuring in the background. I was just going to make sure my tech was working right. These are photos of the building, as it is visible currently from a few vantage points over the past several years, beginning in 2012, a great deal of historic restoration and preservation works been done on the building, including restoration of the 42Nd Street storefront, replacing a more modern replacement that had been there for many years at the higher floors of the building. There's been a great deal of masonry and structural, steel repair and restoration of various decorative elements all around the building, including replacement of a pair of rather ornate, copper urns at the 42Nd street side of the building. The work that we're talking about tonight is one of the last things proposed to be done, and it is the replacement of the roof at the very top of the building. Is my cursor visible to people? This is a view of the building looking west on 42Nd Street, and it is the point of view from the public sidewalk where the roof is most visible and, as you can see, the roof is really not very visible at all. Even from this vantage point, here's another view of the building looking west from Times Square along 42Nd Street, and you can see the building is now part of a fabric of high rises, and you know more obscured, obviously than it used to be by their presence. Tower Roof at 130, West 42Nd street is a hip roof structure that is was originally roofed in Baton, Seam, copper and the reason that we're meeting tonight and presenting to you tonight is we're proposing to replace this roof and, as you can see now, it is no longer visibly batten, seam, copper, but underneath this is that copper and what you're seeing is a later installed modified, bitumen roof and layers of roofing mastic that were all applied over the copper as a way of repairing leaks over the years. This coated roof. This modified bitumen recovery roof is itself falling apart from old age and sun exposure. The roof is really badly in need of replacement and also, if you'll, take a look at the slide at the lower right hand, corner you'll see this cruciform steel object, stepping up sticking up from the ridge end of the roof. This is a steel armature that used to support a decorative Florida lee that was installed one at the north end and one at the south end of the roof. The middle slide in the top row is the south side, and you see the armature is not there. Nor is the Florida league. The Florida leaves were lost decades ago, but the steel armatures have remained, and they have been open, subject to weathering and rusting and are themselves not in good shape. On this on the right side, where my cursor is a piece of the Fleur- De- Lis armature from the south side that had become so rusted that it loosened and fell. So those are, as part of this work, we are proposing to remove those remnants of the structure that once supported the Fleur de Lis. These are some detailed photos of the roof assembly. We have made probes to show the various layers of the concrete roof structure that is underneath the copper roofing, the copper roofing itself, the various slip sheets and the later modified bitumen layers. The slide on the right shows the deterioration of the bitumen layers, especially we're covering the battens where things are just splitting and opening up. We are proposing to remove all of the existing roofing down to the layer. The level of the str of the concrete structural roof deck, which is a lightweight deck, supported by steel substructure, and we are proposing to replace the roofing membrane, not with copper, but rather with a membrane roof using a polymethyl methacrylate resin, the trade name, for it is siplast parapro that comes in a patina, green color. These various slides show the layerings that build up this roof and some mock- ups. We did showing reproduction of the Batten profile that we would be creating using this roofing material. Our decision making with respect to what type of roofing to put back was governed by a few things. One is at 400 feet above the sidewalk and being minimally visible. We felt we had more latitude to choose different roofing systems. One of the concerns that guided our choice was wind uplift and the extreme weather conditions that we're seeing more and more of in New York City and our concerns about reinstalling, a copper roof that is attached to a 100 year old, lightweight, concrete substructure. At only discrete points. A reinforced liquid membrane. Application like we're proposing, is fully adhered over. The entire surface of the concrete substructure of the roof and is tested by the manufacturer, and we can have great assurances that it is highly resistant to wind, uplift and negative forces, which we feel is very important here. Additionally, during the construction phase, handling the liquid membrane and its reinforcement layers, which are lightweight fleeces and like, is much safer to do in the confined and steep areas above 42nd street, as well versus handling large sheets of formed, copper, a benefit of using the liquid membrane product also is it does come in a very good, patina, green version. That is, you know, quite nicely matches aged copper, and we would have that green look right away as opposed to waiting for it for decades to develop from new copper. This system of roofing has been installed on other historic buildings in New York City, including the lower roof of the New York Stock Exchange, and, while not a landmark, a significant building at 250 West 52nd street. This slide is a view of the roof, as it is today, with the black modified bitumen and with the patina green surface that we would end up with with our proposed re- roofing. Of course, this view was taken from the window of an adjacent building. I think it must have been one bryant park or the Conde Nast building. It's not a view that one would ever see in reality because again the building is and this roof rather, the roof of this building is really minimally visible from any public vantage point. This is one of our drawings, it's showing the existing conditions at the roof, and you can see the hip Roof configuration and the disposition of the battens as they wrap around the ends of the building. All of these copper details and depths and shapes would all be reproduced by by us with the new roofing system, we're proposing. That was an existing condition slide. This is a proposed condition slide, essentially showing that it would be just exactly the same in terms of the batten patterns and so on. These drawings are elevations of the roof and I would just dwell on them for a moment. You can see at the ridge ends of the of the of the roof. The plinths on which the Fleur- De- Lis once sat and where the armatures came up through the top of those plinths would remain in our re- roofing design, and we would simply run the liquid membrane roofing up and over them covering them now. One other advantage of the liquid membrane roofing is, should the armatures for the Puerto Li and the Florida lee themselves ever be reinstalled. This type of roofing membrane is very readily altered, so the top surface of these plinths could be exposed which would expose the old mounting surface for the steel armatures that are damaged and being removed. Now the new steel armatures could be attached to the structural, steel ridge, Beam of the roof, and then the liquid membrane roofing patched in and run onto the steel armature to make a good watertight seal at the roof. This type of roofing membrane is very adept at conforming to and adhering to shapes, like structural steel shapes, so it would work quite well in the future should that work need to be done. These are some details of the roof that we would be putting back. In the left- hand, image on this slide. You can see the built- in gutter that runs around the entire perimeter of this roof, and you can see how the Batten seam profile would end a bit up up slope from that built- in gutter, in the traditional fashion, although all of this, of course, is not within anyone's eyesight, the built- in gutter itself would also be lined with this material terminated on top of the terracotta copings that surround it. None of this, of course visible. So that is really the end of our slides and the description of the work we're proposing to do would welcome any questions that anyone would have that. I can hope to answer for you great. Thank you very much, so we will do just that. We will open up to questions by members of the committee. I will ask you to use the raise hand button which please, let me know if you'd like to see any slides again. Of course, let's see if we have any questions, Tony has a question: Tony go ahead, thanks, laila, just a quick question about the floor delay. You know you're doing such a great job. Doing all these different components of the restoration. Did you give any thought of actually reinstating these? I know that they can be done in the future, but at this time you guys did not think it was worth it to do it now. No, no. We felt that at this point in time, ownership was not seeking to put those back and we were. We were just looking for a way to complete the roofing work in such a way that should they, you know, want to revisit that in the future they'd be able to okay thanks. Thank you. Buzz has a question buzz go ahead. Is he muted, maybe Buzz? Okay, sorry in the wrong question: what is the estimated lifetime of this material and how does it compare with previous roofs and with the old copper roof right? Well, these Polymethyl methacrylate roofs have warranties that are 25 to 30 years long. Their lifetime, though, is potentially longer than that and in comparison to copper. Obviously we, you know we have a an aging copper roof on this building, but it is still there and the building's a hundred years old. So I'm not exactly sure when the copper roof began to fail, but I think we all know, as people who are involved in the preservation field, that a copper roof is a very long- lived roof and would last at least as long or longer than any membrane. Would, though there are, you know instances of these of these liquid membrane, roofs being 40 or 50 or 60 years old. At this point in time the chemistry's been around for a while. In this case, though, durability does not always is not only limited to how does the material itself hold up? You know to the rigors of exposure to weather and so on. We also want to assure ourselves that we have something that is going to have the best and surest chances of just staying on the building, because, as you know, we have extreme weather seems to get more extreme. Every year, a couple years ago, I had a tornado, go down Prospect Park, West and Park slope where I live, and we do have a 100 year old, substrate that we're attaching to and the traditional methods of attaching a copper roof using nails into the substrate. Are you know, ordinarily, a sound and sturdy way of connecting a copper roof to a building, but at this height and subject to the weather that we're seeing, we feel it's prudent to have something that is even more secure securely attached to the building such that should any portion of it begin to loosen all of the square inches of material adjacent to it remain tight. So this was this was part of our criteria for the recommendations we've made to ownership all right. Thank you. Karen Pedrozzi has a question. Karen go ahead, yeah hi! This is a follow- up to Tony's question about the Fleur- De- Lis. Did the owner not elect to go ahead with that due to cost? And my second question is: did this come about because of a local law requirement? Well, local, I would say yes, cost is a was a factor and the loosened south Florida which had actually fallen. Of course, that's a facade safety and inspection program concern and the other armature also well not loose as this as the south one is at this moment is also exposed for many years to the weather. So there is some concern about how it's holding up in in the years to come. If I could also add Valerie Campbell, we do not have good documentation as to what that Fleur-, De- Lis, even look like or the size, and there is extraordinarily limited visibility of it. In any event. So thank you just to clarify. I'm not sure that I got the answer to Karen's question. Is this part of any local law requirement? No, the roofing work itself that that's a bit disgusting, the I and I would say yes, the roofing work needs to be done for this building to be considered safe from a local law. 11 or as it's now called Facade inspection and safety program, point of view, okay, so currently your you're, unsafe or safe with repairs. I think we're, I think, we're smart right now: okay, okay, thank you! Any other questions. Members of the committee, yeah Mike, go ahead, Mike be sure to unmute. Okay, sorry is the is the green substance. Is that painted on? Is it a plastic? Is it a liquid and what is being done to protect the the people downstairs? What kind of a substance is that green, the it's a it is a type of waterproofing membrane that is called a catalyzed resin proofing. So it is a two- part chemical that, when mixed together in a short period of time, hardens to a rubbery consistency and the entire assembly of the of the roofing product is a base sheet of modified bitumen membrane. That's about an eighth of an inch thick that gets adhered to. The concrete substrate of the roof over which this liquid membrane gets applied and the liquid membrane itself is kind of a three- stage application when it's mixed up. It's about the consistency of a thin milkshake and it is rolled into place with a paint roller kind of a long nap paint roller to a certain thickness and then into it is pressed a kind of t- shirt, thickness white fleece, which you can see in the left- hand, photo here where my cursor is moving, and then that Fleece is in turn rolled again with the green milkshake thickness liquid and what the fleece does is two things it reinforces the liquid and it also serves as a way of controlling the thickness of the application. So once the second coat is applied and the fleece is no longer visible, the installer has the. I can know that the material has been applied to the proper thickness in terms of protecting the public. The entire roof area will be scaffolded, there will be sidewalk, bridging and as in terms of the occupancy of the building, that this area is well above any occupied part of the building. The material does have a smell it dissipates very quickly and will not be noticeable by the by the occupants, because it's so up out of the way. Okay, thank you chuck, Miller Chuck, you have a question. Go ahead, a very quick question: when we look at the at the copper now has most of the copper been covered by the chemical, that's already there by the by the membrane. That's already there every inch of it. Okay and do you know when that happened no long before our time and from the looks of it, it's got to be decades. Okay, thank you. Thank you. Any other questions, members of the committee, okay, so seeing none. I will move to open up the floor to members of the public members of the public. If you have questions or comments to this application, please use the raise hands, raise hand, function and then Luke will permit you to speak. We have any raised hands from members of the public and, if you're calling in from a phone, you can press star nine to raise your hand any questions from members of the public, okay, so seeing none. We will move back to business session during business session. Only members of the committee are allowed to discuss the matter, and I await your comments. Use the raise hand function so that we can have a orderly comment period who wants to start chuck? It was your application. Why do not you start? I will I I'm interested in in the opinion of those who have been on the committee longer than I from my observation. It seems to me that, given that it is minimally visible, given that the membrane has already lost whatever copper feature it has, I did not see any objection in terms of the Fleur- De- Lis. I can see that would be helpful, but it's not there now, and so I was inclined to view the proposal favorably. Thank you chuck yeah. For a little bit of context, I would say that you know. Typically, the committee gives Sony more leeway to applicants for elements that are not visible and I think it's pretty clear for this particular building that the roof is not visible. I would also add for members of the committee who have not been on this committee for so long that this particular building has been in front of the committee numerous times and over the years the the ownership of the building has done a good job of restoring the the building. You know it's a very special building. It is actually the very first skyscraper of New York City, very beautiful. It's a little swallowed by it's surrounding taller neighbors now, but you know it's really a special building and the ownership has been taking. You know good care of the building and has you know always worked in a in a collaborative fashion with with our board. So you know just for a little bit of context. I see that Karen has her hand up Karen go ahead, yeah. I just I concur with Charles's comments and I think it was a very thoughtful techno technology, a technical solution, I'm familiar with the roofing product, they've used, it's tried and true and has a long life, so I'm in favor of the application. Thank you any other comments. Okay, seeing none! Let me phrase it this way. Does anyone has an objection with this application? Are there any objections to this application? Okay, seeing none! I think everybody concurs with Chuck and Karen's comments. Chuck, do you want to make a motion? I still move two one, okay, just to make sure thank you. So this will be the first vote of the evening. Buzz yes, Renee Cafaro, yes, James! Yes, Sarah! Yes, laura! Yes, John, yes, Nick! I do not know that if Nick is with us Suzanne. Yes, thanks for the history too Leila. Thank you Richard! Yes, Mike! Yes, Renee Kinsella! Yes, Sam! Yes, chuck! Yes, Janet! Yes, Karen, yes, and me, I am a yes and the motion passes it's a unanimous vote. Thank you very much. We are now lately forgot. Tony says: yes, I'm so sorry and Tony. Thank you sorry about that, tony okay. So we are moving on to the next, the next application, which is 135Th Avenue, and this is an application for Storefront operations. I believe that we have the applicant with us and please feel free to load up your presentation and share your screen and, let's see what happened, I'm sorry. I lost everybody. Okay, here we are sorry about that. I had a little glitch on my end. Okay, so we have the applicant with us and please go ahead and you can give us your presentation hi good evening, I'm Erin Ruley from Higgins quays bath and partners, and we really appreciate you taking the time tonight to review our application. I'm joined by Richard Woodward of Gkb architects and they are design architects for the project. I'll walk you through some of the existing conditions and the history and Richard will walk you through the design. We also have David Berman from Cvs and Mark Lundy from the retail space ownership, for any questions that you might have. The project is located at 135Th Avenue in the ladies mile historic district, that's at the Northwest corner of 18Th Street and Fifth Avenue, and this is for the retail space at the ground floor. It's going to be a new CBS location and it was formerly or most recently, occupied by the express proposals for new storefronts signage and to create a new entry in the easternmost bay on 18th street. So yeah thanks Richard and the new storefronts will replace existing 1990s storefronts and we'll take a look at the details more closely but they're. A combination of historic and non- historic elements and the new Storefront infill will more closely recall the historic configuration. The new entry will include automatic doors to allow for unobstructed access, and that's in that easternmost bay on 18th street and, as we all know, today, pharmacies are providing more critical health care services in addition to the pharmacy needs and access for disabled and other escorted customers who need assistance through the doors is critical. Richard will walk you through some of the practical constraints, but today more than ever, contact free access is very much needed, and so this proposal is really a well- designed entry that relates to the new storefront system. It's rooted in the consistent commercial change in this historic district, which has a long history of commercial reuse from the earliest altered buildings that were used. They were residential buildings, altered for commercial use and then the commercial and retail changes as the industry and tenancies changed within the building. 130 fifth avenue is an 11 story, store and loft building constructed in 1902 and 1903, designed by Robert Maneke, who was prolific in the historic district. As you likely know, and so on the left we can see the overall view. The 18th street elevation is on the left and fifth avenue on the right and then the two photos on the right show the base details of the base condition. So the top photo is fifth Avenue. The entry on the right is the main building entry. The entry on the left is the existing Fifth Avenue building entry and then they sort of sandwich a storefront on one single storefront on Fifth Avenue on 18th street there's a consistent storefront configuration in four bays and the bay all the way to the right that says. Express is the subject bay where the new entry would be created and then we'll just take a walk around the building. This at the top left we're at the westernmost Bay. It's a freight entry. There's going to be some work there, that's all going to be approved at staff level, it meets the staff level rules and then we see the first bay in the of the storefront on the bottom is all of 18th street. The bay with labeled Express is the bay with the new entry, and so here you can start to see on some of the existing conditions. The Storefront Bulkhead and the cornice for each of the Storefront bays is historic dates to a 1920s alteration and then the display window framing and infill is all contemporary. And what you see there are three equal panes in the storefront, so it's an equal division and that does not match what was there historically, it would have had a wide central display window, flanked by two narrower windows and we'll see those in the historic photograph and there's also a metal transom, and that's where the signage is affixed now and that's opaque and so that all dates to the 90s and then sort of that is sandwiched between the historic fabric at the storefront, corners and Bulkhead. And then just a few more details of this is a typical window bay on the top left. We see the historic bulkhead with the contemporary infill and the cornice historic cornice above there's a bay with louvers, which they'll also be louvers in the new proposal, but those also meet the staff level rules and then just a couple of details at the bottom of the storefront coordinates in bulkheads and then just a quick look at some of the historic conditions on the left. This photos dated 1915, it's actually around 1905. I think. But this is the original condition, and so what you see there are projecting storefronts which were original to the building, and there is a an entry included, a little farther down a couple of entries actually on 18th street and those existed from the time of construction until the early 1920s. Also of note is the signage which, when you're, in full view, rises up the full height of the of that corner, pier and the signage along the base of the building. Oh, no, not people stay here, go back to 1927 yeah, exactly so in 1924, the tendency of the the retail space changes to a bank, and so we see a couple of shifts, one is that the store fronts are replaced with new flush storefronts- and this is this happens along fifth Avenue. As you know, in the teens and twenties they they reduced all of the encroachments on Fifth avenue. So all of those really spectacular projecting bays many of those go away. Ours goes away in the early 20s with the introduction of the bank at the at the retail space, and so here you can see that configuration that I was describing the large central bay, flanked by two narrower bays in the in the Fifth Avenue Storefront and then and then shifts in signage, on the corner, pier and at the at the sign band at the second floor, cornice and a spectacular array of light bulbs at that point, but then maybe go to the text. Photo Richard, oh great, thank you and then 1940s tax photo shows consistent, storefront configuration new signage, and all of this is you know very typical in the historic district, the storefronts, the infill and signage all change and evolve as the commercial use and the buildings are reused by various tendencies. So now I think I'll pass the presentation over to Richard who can walk you through the design details good evening. So this as Aaron said we're on the North Northwest corner of 5Th, Avenue and 18Th street. This is the the two planned elevations that we're looking at we're going to start with 18th street with the elevations and then move on to the fifth avenue. So these the existing elevations in the top of 18th street and the proposed at the bottom, the obviously we're retaining the historical detail at the bulkhead and the cornice above and below the new storefront. The storefront is, is being updated to a double glazed system for compliance with New York City, Energy Code, and the biggest change is that the current storefront is equally divided in typically in three bays in the largest modules and the new proposed storefront is reflecting these historical modules that Aaron alluded to in the photographs which do not provide equal lights. They have a larger light in the center and smaller ones. On the outside, starting at the left- hand, side, the freight doors are being removed and replaced. Currently they have a post in the center, so that will be removed and we're applying new insulated hollow metal doors with embossed panels. In this bay, the remaining store front is being removed and replaced with the new double glazed units, and this is the bay on the end where the new sliding door Assembly is being inserted. Maybe some more detail on that on future slides I'll just overview the signage a little bit. There is a display wall, two feet back from the glass which is represented by this pale peach color. There is also illuminated signage: the cv, the red Cvs pharmacy and this clinic light box, and also the heart here or illuminated they're all 18 inches behind the glass on the interior of the building. The Exterior signs on this facade are applied signs here. Cvs, pharmacies, so I'll zoom in a little bit on the outside, which is a non- eliminated, sign, receiving entrance sign here on the freight doors, and then these decals at the new entrants, which provide the operating hours and another static sign. Above this new entry going to Fifth Avenue again, the equally spaced module is being redivided to reflect the existing details in the bulkhead. So there's a much larger bay in the center signage- wise again, these red signs, the Cvs pharmacy, the minute clinic and this red heart are all illuminated but they're all 18 inches back from the glass again we have open hours which is applied vinyl on the on the new door and a static sign on the exterior of the building. Above this large storefront window. As we've been saying, the existing module was equally spaced along the each bay. The widest bay is about 23 feet wide in reference to the bulkhead below we've extended the size of the interior, section of the bay to a much larger piece of glass and moving with the double glazed units. There are some limitations in terms of availability, which is forcing butt joints in the glazing to subdivide this center section. In section again, the historical detail had the bulkhead and the corners are being retained. Express previously had show windows with mannequins inside to display clothing, so that wall is going to be removed and there'll be a small display when display Wall, which reflects the area shown in peach on the elevations, which will have some signage. That will be two feet back from the glazing and likewise on Fifth Avenue, a very similar scenario. This is the existing doorway. The geometry is staying the same. The doors and windows have been replaced. Upgraded we've been through this signage, so I won't come back to that. But it's the other thing to mention is that we have clear glazing at the the bulkhead where previously there was the metal panels in signage band, so around the perimeter we are showing, so I'm going to go back a couple of sheets, so here we have clear glazing with an opaque gray film applied in the interior to screen the roll down security, grille and the ceiling space, whereas this previously was a solid metal panel. This is the freight door where the center division and the existing geometry is being removed and new free opening is being provided with the embossed doors and adjacent again. The historical bulkhead is remaining some sections at the freight. This is the bay where the sliding doors are being inserted to provide a better access into the store. The center bay is affected. By having to have this additional transom, there's a three- part door with the left, one being fixed and the two on the right retracting in will be ADA entrance, which would supplement access from the fifth from Fifth Avenue. There's these decals on the side which meet the requirements in terms of area. This is a detail of the static signs which are on the exterior of the building they're non- illuminated, there's one smaller one in the bay above the sliding doors and two slightly larger ones. On the other two sections of facade- and this is the illuminated sign which is 18 inches inside the glazing one on each facade- and this is a proposed elevation, showing the combination of all these elements again in terms of signage. Just these white signs here are on the facade as well as the decals at the doorways. You can get a representation of how the sliding doors may appear on the side, and then these light pink zones are set back from the glass on those short display walls. I think I'm going to pause there all right. Thank you very much. I have a couple of clarifying questions. I'm not sure I understand the pink treatment at the bottom of this, so maybe we can say on stay on this slide. Can you actually just blow it bigger, so maybe sure yeah, I'm not sure how much that will help, but this is a low wall which is within the it's 24 inches behind the glazing, so there's a shelf in between the two, the display window. Okay, so this is not a an application on the glazing. This is not. This is a 3d element that is behind correct, okay, correct, okay and it's actually it's red, but because it's on the interior, we sort of lightened it so that it indicated that it was on the interior. But it's the tip. It's a fairly typical cvs. Red Patterned display wall set back within the Storefront installation, but it just so that I understand correctly it sits flush against the glazing and it no. Let me go back yeah it's sitting on this face here, so two feet back from the storefront, and can you explain what is this horizontal line that goes from this wall to the glazing? This line, no, the one underneath this one yeah. This is just a framing for a display window, and but what does it mean? Because this will be visible from the street? It's like it's the window, sill essentially on the interior, and what does it mean hi? This is Dave from Cvs. I just wanted to clarify. I have my signage person on also, but I do not believe anything would be put in that area. It's just for the window, graphics themselves. So it's going to be what applied painted plywood. It is a material. That's like vinyl, that's attached to the drywall or wood okay. Thank you. I will open up the floor to questions from members of the committee. Members of the committee. Do you have questions? Please use your raise hand button any questions. Mike K back, go ahead, hey the original three- part bay. Was that Convex out was it flat like the new? The original was convex it projected, but in the 1920s that was removed and replaced with a flush storefront, which maybe you could go back to the 1927, Photo Richard and and that's the fragments that exist. The bulkhead and the existing coordinates date to that 1920s storefront, so that's flush. What we're looking at now! Okay! Thank you. Other questions, members of the committee Tony go ahead. Tony testa, thanks laila for the Fifth Avenue Entry door, I'm just I was trying to zoom in to see all the fine print. I see that you're mentioning that the new door will be double glazed. Is it going to be an aluminum frame door? Yes, okay and aluminum? Also for the the sliding door on the side. Yes, thank you and the storefronts as well. The new Storefront Leila. I can't find the that's renee. I can't find the raised hand thing for some reason on my phone. It's gone. I do not know where it went and I apologized and not on my laptop. So maybe that's my problem, but I have a question is if they would consider another kind of door that might be more contextual than a sliding door just having regular doors or I do not know. I think there might be in the ladies mile even like a revolving door or two, but you know an electric sort of sliding door. I understand is customary for a cvs and all that good stuff, but I'm a little concerned about the modernity of that in that neighborhood, because I can't at the top of my head, think of another place in ladies now, where we've allowed that hi. This is Dave Berman from Cvs. We're also concerned about our customers, safety and ease of entering and exit exiting the store, especially during those you know, hours when things at least typically used to get busier. We did receive approval from landmarks on a couple of projects that we did, namely the brill it broadway in 49, 1619 broadway. We matched the facade and we have the sliding doors there, also to the left on 6Th, Avenue and Washington Street, where we did receive landmarks approval. Also in that location, but I mean the main concern: is our customers ease of flowing in and out of the store things got a little crowded with the previous tenant? Just having that one door there where people are entering and exiting it, can become an unsafe situation. Thank you. I would. I would say that the the CBS that used to be on broadway between 18 and 19th street in the ladies Historic district did not have automatic doors. They had manual doors that were contextual to to the building. Oh, it looks like the ray's hand. Function has come back and Karen has her hand up Karen go ahead, yeah, I'm! I echo Renee's concern about the sliding doors they. I understand the ease of use and the accessibility I appreciate, but they appear very flat and flush and what I guess, I'm really missing of over the years what's gone by, is losing that depth and that the sliding doors appeared just very flat to me, and I just wondered we're still in questions so sorry. My question is: how do they operate? Is there a button or is there a camera, how do the automatic sliding doors open and because they are so prominent and flush to the street? Might a passerby activate them? You know. Are they more automated, like you see in a grocery store or a hospital, or just wondering how the ADA accessibility works on those and then should I ask all my questions? Okay. My second question is about the security grill. I see it in the detail and I'm just wondering if that's just like you inherited that and you're just leaving it there or do you plan on deploying that security grill? Will we see it behind the storefront and, if so, like what times a day. My third question also about timing. Is this a 24 hour seven days a week operating a drugstore and if so like, will the fluorescent lights be on all night, because sometimes I've seen landmark buildings be energy exempt and I think, with the new energy code, you're no longer allowed to have a landmark exempt, and I'm just wondering what you're going to see as you drive up and down the avenue into the window at night. Will it be like flooded with fluorescent light, which is just even though we do not? You know, weigh in on the interior. It impacts the brightness of the whole overall architectural landmark. Yes from Cvs, so to answer your questions. First question: 24 hours, all our stores are 24 hours in Manhattan and they have been so and what was the other question? I'm sorry well like how the doors operate, the sensitivity. Yes, the sensitivity to the doors are the same throughout the city and obviously they only open people are entering the store, I believe, there's a camera, but they do not open and close when people are walking up and down the street. Otherwise we'd have serious energy problems and costs in the store. So we're well aware of that, and that has not been so. Is there any accessibility button you push if you're a person in a wheelchair they open up automatically. These doors will be a motion sensor, but I think motion sensor will be trained. Thank you to only pick up movement close to the doors, and I think I just if I could add something. I've had a sort of a crash course on these automatic doors because they're, you know they're somewhat new to me, but my understanding and richard perhaps you can amplify this- is that the idea is that when people are escorted clients, customers that come in, if someone needs assistance, you can't physically hit an actuator, have out swinging doors and then be able to like smoothly enter the space with someone who's accompanied or if a person is in a wheelchair. You have a sort of busy corner and you have double out swinging doors that require a contact on the actuator. Then it's it there are. You know one given Covid-19 and how we're dealing with contact in general, but also just the security and ease of access for people in that need assistance, and I think, the in terms of the overall design. The idea here was to maintain the historic bulkheads established the sidelights. All of that would be trimmed and detailed, consistent with the historic, the restored storefronts and then within that center Bay have the opportunity for the for the the sliding doors. So it would be all within something that is very consistent with the other restored. Storefront Karen also had a question on the the rolling grill the security gurl is existing, but I do not know if you're going to use it David yeah. We typically do not use them, because it's open 24 hours, correct, right, okay and then I think in the storefront, the where the they're they currently exist. The security grills exist behind the metal panels that replaced the where with the transoms would have been, and so with the new storefront system, there's an entirely new glazed transom and instead of having an opaque panel there, we just will use back paint or film to obscure the area behind, so that whoever uses the storefront next has the ability to open that back up again if they want as a storefront transom. Okay. Thank you. Other questions by members of the committee. Karen has a follow- up question. I believe Karen yeah, just going back to the sliding doors. Is there a second set of doors that create a vestibule in the plan? We're only seeing one, but is there a second line of doors? There is yes, as part of the interior. For that, okay, yeah, that's always the case in our cvs. Do you want to pull up the plan? It's like a diag. They run on the diagonal right from peer- to- peer on the interior. I actually do not have a plan in this set right. Are you able to to pull the plan or you do not have it? I can. I can source it, but we should continue and come back to it. Okay, Karen. Do you have any other follow- up questions? That's it! Thank you. Okay! Thank you. Any other questions by members of the committee. Okay, I have a couple: can you actually explain the rationale for alterations to the freight entrance? There is not really any geometrical changes there. The main is the main reason is to open up the double doors. Instead of having two single doors, there will be one clear opening without a post in the center. Can you put the existing condition photo up? Can you can you bring the the elevation for the for the freight entrance? Yes, we do not have elevation, I think for me this one. So yeah awesome. Thank you. So it looks like you are removing quite a bit of historic fabric around this. This mean of egress and replacing it with a more more modern materials. Is this no longer going to be a freight entrance? It is both a freight entrance and an egress passive path of vigorous, there's, no historic fabric being removed. The existing doors are flush, the only the doors are being removed and the post. That's you can't. You can't see the post it's behind the doors currently and they are those are flush, metal doors, not historic and they're being replaced at staff level, but with new metal doors that have landmarks requires that you do a panelized treatment so that it more closely recalls the historic condition and that's, what's being they're being replaced with. Oh okay, thank you. Thank you for the clarification, and can you also explain to us the rationale like the functionality rationale for creating a new opening on 18th street, because you still have the opening on fifth avenue correct. This is Dave again from CBS. I just that was a cvs question. We are a convenience business and again we tend to get busy. You know certain hours. Obviously, people are coming and going to work and lunch time and when things are getting busy, we like to create the most convenient access to the store as possible. So most all life stories have double doors. Every prototype does, and obviously this is a landmark building, but we did want to maintain those safer conditions for ingress and egress here as well, and most all of our stores in the city do have this type of entrance the entrance on both streets. Thank you any other questions by members of the committee. Okay, seeing none. I will open up the floor to members of the public members of the public. If you have any questions, please use the raise hand, function and Luke will allow you to speak Luke. If you want to let those who are calling in how to do the raised hand with their phone, that would be great r9. I do not see anybody. Okay, any questions from members of the public on this application. Okay, so seeing none, we will move back to a business session for comments by members of the committee. I will start with making two comments. The first one is that automatic doors on fifth avenue in a the history district, especially the ladies now in a building that is so prominent, is a very problematic. I do not believe that there are any automatic doors of that type on fifth avenue and, as we know, precedence do matter, and we certainly do not want to. You know, take this slippery slope because it would become extremely slippery. The second comment I would make is that, although the eliminated signage is 18 inches behind the the glazing and therefore with compliance with the general rules of the Landmarks Preservation commission, we all know, because we have experienced it- that the Cvs brightness is actually of a pretty you know pretty strong and that you know the amount of signage is pretty generous and it will be a bright red little spot. That will certainly have an impact on the general district. So those are my two comments, but I would like to hear more from members of the committee and I see a hand raised. I will start with renee kefaru go ahead, hi, I'm now on my laptop, so I have the raised sand function, yeah! No! I just really wanted to just quickly just underscore what you just said: layla, I'm really having trouble. I understand the ease of that and you know the touch free and all the rest of it about sliding doors. But you know we do have to sort of gauge and temper modern needs with the landmark the same way that we do with. You know ADA ramps and things of that nature, and so it's a delicate balance and I'm slightly nervous that folks, that might not have any real reason, for it would start doing different kinds of doors that are non- contextual if we let this precedent be set. So then I'm just very uncomfortable with that and I'm interested to hear what everyone else has to say on this. Before I can vote. Thank you, Renee Suzanne, Johnson Suzanne go ahead. I was going to. I will now concur both with you, layla and renee, with what our goal is. I think here- and I think this is a you know- brilliantly done, but I think that, given the contextual responsibilities we have to this beautiful building and the presidents that has been set in the area, that the rationale for this being a convenience build business. As we know it is not enough to, in my opinion, make way for these type of doors, and also this generous and or excessive amount of light, and how it will impact contextually this part of town as well as this building. Specifically, that's all I wanted to say thank you. Thank you, Suzanne Sarah, Dawson yeah. I go to cvs all the time. I'm acrosss the street from it. The doors slide open for me I'll just put in a boat for let them have the sliding doors, because if we do not let them have it, then maybe they can't be there at all, but you guys know more so, but that's like we actually typically do not let youth come into interference with where the decisions were really the landmarks committee. So we look at it so then I'll withdraw the comment. No, that's fine, but I just want to bring a little context for everyone. Thank you, Sarah Richard, yeah and initially I was thinking that the sliding doors were great because it would really permit access. But as I've been hearing this conversation and looking at a couple of things, one is that they're actually doubling the amount of the number of entrances, which I think is a good thing. You know but they're actually changing what has been a window to a door entrance, and I see that they have that vestibule, which gives quite a bit of ability for people to manage the transition from being in the store proper to exiting or entering. I- and I also was thinking initially about the accessibility issue for someone, but my understanding is the existing door is ADA accessible and you know so. I sort of I you know the I'm now convinced that the the historic context is sufficient to warrant not supporting the double doors, given that I do not see a strong need for it in terms of accessibility in general or ADA accessibility. Thank you, Tony go ahead with your comments. Thank you layla with what you said earlier too. The first thing that jumped out at me was the amount of signage that cvs red is definitely bright, red and the fact that the lower walls behind the windows, the display wall will be very low, that very bright, concentrated fluorescent light will also be quite visible from the street, which again is interior, but CBS in general just gives off a very different feel to the to the neighborhood, but a lot of signage, a lot of it bright red. Some of it is redundant, it's the bright red light up stuff just inside 18 inches, and then it's on the sign that the sign bans up above I was I was looking around. There is another cvs in our historic district here on 6th and 19th street on the northeast corner. That one does not have sliding doors, it does have doors on each corner and then their diagonal entry in the middle. It does not have the sliding doors there, so it is possible and it is possible with the cvs model unless it's changed since I've walked by there in the last few months you know originally. My other concern was also just the addition of the door removal of that bay and though it's not original, it is certainly historic, but I think I think that's something I've kind of gotten over. I have not heard a lot of concern about that. So that's not one of my major concerns, but just something that did pop up yeah. I would echo this comment actually Tony. I think that we certainly are. You know, considering an application that is, you know, turning a window into a door and therefore removing a large amount of historic fabric. This is something that I you know. I think that the adaptive reuse of a space is something that we have to keep in mind and we want these spaces to remain functional, and we know you know from the historic photographs that you know some of those bay windows were actually doors. Historically, so the sort of you know game of bunto. I can contemplate, I think, that you know it's. It has to be for the right circumstances, but only the opening mechanism doubled with removal of historic fabric. I think, would be really detracting from the context of this particular building and the district. I certainly agree with that. I see that Richard has further comments. Richard go ahead, yeah regarding Tony what Tony said you know. I did not mention this first time, I'm also very troubled by the amount of bright lighting, but I thought a couple of things that Tony said. I do not know if I misunderstood, but the exterior signage is is white and not lit. So I thought you were saying that was yet another red element and then the low you know the what is shown here as pink or whatever. That minus thing is: that's not lit right. It's only the hanging signs that are lit did I did. I misunderstand that none of this is to say that I like what they're doing, but I just sort of wanted to actually make sure we were talking about the same conditions. I will allow the applicant to clarify. Is there any lighting at the at the base of the window, the windows, the show windows? There's none anticipated, I think David right yeah, I'm just waiting for my signage person to join, but the signs themselves obviously are interior, lit red block letters, so they're not overly bright, and the question was: is there going to be any lighting at the the bottom of the at the framing of the the Bay Window yeah, with the course there is some some soft lighting projecting towards the window, graphics so into the store? Okay. Thank you. Thank you so to make sure that everybody is on board, so there will be basically lighting sort of like framing those those windows. Karen has a further comment. Karen go ahead, oh yeah. I concur with the committee's comments so far. One of the items I wanted to add to that was that you know a prominent store. A well- known prominent store, like cvs of course, has brand appeal and signage and store standards, so they all look somewhat unified, but I think in the case of a landmark, these institutions should be able to modify, or you know, should defer to the landmark. And while I appreciate the brand elements, I think that they should. You know if this is a roll out, just like every other CD cvs in a non- historic landmark building. I think some give back should be taken, for you know for selecting the site in this location, and I do not think that's a lot to ask for them to respect the landmark by maybe modifying somewhat of their standards, whether it's lighting or graphics or sliding doors. Well, you know, we've been through a lot of them. David, I'm sorry we're in a business session at this family members of the of the committee. I would like to discuss the matter. Thank you for your understanding. Thank you, Karen for your comments. Do we have any further comments from members of the committee and if I hear the comments so far, we have problems with this particular application and we seem to be more inclined to deny renee Kinsella. Has her hanok renee go ahead, hi Leland, nothing new to add, but I just wanted to say that I agree with all the comments that were made and have problems as well with the application. Thank you okay. So it looks like we have a number of issues with this application: the sliding door being won the amount of signage and the amount of illumination. Although we understand this illumination is inside the the store and 18 inches behind the glass, it will certainly bleed into the exterior to some extent, and certainly at night time. Are there any other elements that we want to note as being elements of concern? Are there any elements that we want to note as being okay with which we do not have any issue? Okay, I see no raised hands and I will consider that you're fine, with what I have listed. So I would like to make a motion to deny the application for the reasons that I just stated and invite the applicant to revise their their proposal if they so choose. I think that we, I would like to add language as Karen stated, that when a large corporation chooses to put their store in a historic district, they should really defer to to the landmark and to the quality of the historic district, and for that reason we're making this this recommendation. So this is this is the motion to deny. We have a second all right so for the second vote of the evening, buzz yes, Renee, Clefairo, yes James! I can't hear James I'll come back to you, Sarah, yes, Laura! Yes, John, yes, Suzanne! Yes, thank you! Richard! Yes, Mike! Yes, renee! Yes, Sam! Yes, chuck! Yes, Janet! Yes, Karen! Yes, Tony, yes, Leila, yes and James is James still with Us. Buzz is here, but I think he must have his volume down because he's not responding. Okay, all right, so the motion passes and it's a unanimous vote. Thank you very much. We are moving on to our final application and this is a 201 park avenue south. This is the the W hotel and I think we have the applicants with us, so applicants. If you want to load up your your presentation and share your screen, we can then get started. Thank you very much. Hi. Everyone hope everyone can hear me. Thank you. For your time. My name is Maxwell Powell, I'm a partner at fire, Department, architects and we're here in reference to proposed rooftop alterations to the W hotel, building on 17th and Park Avenue. So the proposed alteration that you'll see today is part of actually a planned, broader interior renovation of the hotel, its first renovation, since it opened back in 2000 really so it's sort of been over 20 years that it's sort of you know. Since its last renovation, there are a number of infrastructure upgrades that are necessary as part of this renovation, which includes mechanical and life safety changes, as well as a programmatic change to be able to occupy and use the roof, the rooftop of the building. So this proposal seeks to accommodate both of those objectives which is in a rational and an appropriate manner, while furthering sort of the relevance of this really iconic building. I did want to note that this proposal does not seek any changes to any of the historic facade elements of the building. It's really restricted to everything, that's on the roof itself, so without further Ado I'll kind of run through our presentation here. As you know, the building is on 17th and Park Avenue South. It was designated an in individual landmark back in 1988, and it's what we like to do when we start these projects is to sort of do a little bit of research and see what we can dig up to kind of figure out. What sort of the timeline was for the building in terms of the changes over time and there's a couple of moments in sort of history, of the building where there were a few changes to the group and I'll kind of go over some of that with you. So the brother was built in 1910 1911, designed by dench and yost. You know it was sort of a really classic example of a tripartite columnar skyscraper design, with a very distinctive rustic base in the shaft and capped with an amazing four- story, Manster roof that you can see here under construction and as it was completed and contrasting that with a very sort of modern industrial signage piece that sort of runs the entire length along 17th street and at the time represent the name of the company that the building was built for which was Germania light. You know that the sign actually did change names back in 1918, and that was due largely to World War, one and sort of the association with the name, but I think so these this image here, you know, does represent. You know sort of a very functional use of the roof. Even you know, from the day that the building was built, you know with sort of flues and chimneys and bulkheads and so forth. In 1940, one of the sort of the most significant changes to the facade was that the balcony on the 16th floor actually got removed and we could not figure out. Why or what the reasoning was, but that was sort of the this one piece that on the facade that actually changed, and so the rest of the building has largely kind of stayed intact in terms of what it looks like from the time it was built in the 1950s. There was a storefront replacement program on the ground floor, which leads us to sort of the first major change on the roof which occurred in 1960 when there was a renovation of the infrastructure portion of the building, where two cooling towers were installed on the roof sort of directly behind the guardian light sign, and this was going to be consistent as we move forward in time by 1988. Of course, the building was designated as an individual landmark in the city by Landmarks Commission, which takes us to 1999 2000, which was which was the conversion of this office, building into the W hotel that we know today right. So that was a significant change at the time you know. Obviously, the signage changed to W Union square, but keeping in terms of the historical signs typography. There was a significant amount of rooftop changes. Related to new equipment that had to go up on the roof, there were storefront changes as well as a new marquee at the entry. So that's sort of you know a pretty significant series of changes when the building was last renovated 20 years ago, which of course takes us to today and sort of these. These views back to the building from Union square, looking acrosss towards the building or from the south or from the east, looking back west to the western facade of the building, and you can kind of see that today there are some equipment that are quite visible up on the roof right, so you've got if I zoom in here a cooling tower located here, a large rtu as well as the generator for the building. With that in mind, if we just focus in on the rooftop itself, we're actually able to dig up the original drawing for the roof plan, which is kind of interesting. This is sort of back in 1910 and you could see sort of the configuration of the roof included these nine skylights at the time, and this was what was actually built. So it's a little different right, but that's not particularly unusual in buildings that were built in this time that you know changes were sort of made on the fly as the building was constructed, but you could see how the sort of the skylights were turned. There were more skylights. The ball kit was a little bit bigger than you know, sort of what was originally drawn just in terms of reference, the Park Avenue South, is on this frontage here and 17th street. Is it is running up down up and down? The middle image is the condition of the roof in 1960, when the two cooling towers were installed right behind the sign, which is right here. It's sort of almost touching the armature for the sign back there and in the image on the far right, that's sort of where it is today when it was renovated. Back in 1999, a significant amount of mechanical equipment was put up there. The cooling tower was replaced with a large HVAC unit, essentially with a lot of ductwork and fans and the generator a generator was added on along the Park Avenue South frontage. So those sort of the big pieces, as well as some internal equipment that was added within the existing bulkheads and then this is sort of a pictorial view of those three stages as well as it was built as it looked from the 1960s with the two cooling towers and where what it looks like largely today, right with the with the equipment up on the roof. So what it tells us is, you know from this sort of brief history is that you know the roof has changed over time and it has changed because of the functions of the building, which you know does not really sort of surprise us. You know given the sort of long legacy and use of this, of this great building, so with that and as an aside historically the classic hotels that were built around the time that this building was built in the turn of the century in the 1910s you know actually did have, did utilize a lot of their rooftops, so whether it's the astor hotel, the biltmore or the Ritz Carlton, there's really good examples of usable rooftops, either in enclosed spaces or open spaces or partially enclosed spaces which really form part of the use and sort of the milieu of these buildings and these uses. So in a way, we also want to sort of replicate that in sort of today's language, for this building in on this very important location, overlooking Union square all right. So how do we do that right? So our challenge, of course, is to turn this on the screen into something, that's more usable, so that people can actually go up there. So this these are photos of the existing roof. This is a little key plan on the side, but you can see the the generator that's sort of sitting up there facing park, Avenue South the cooling tower and then sort of this maze of ductwork and this large piece of mechanical equipment sort of right behind the W Union square sign. So that sort of gives us a little bit of context of where we are today. This is a diagram that shows that same context, sort of a little bit cleaned up to show what we're proposing to do here, but the elements, if you can see this sort of lightly dashed red outline. These are the elements that we're proposing to modify to be able to sort of tackle the the two- pronged approach of trying to deal with the infrastructure upgrades that we need to do on the building and also to provide rooftop access for people and for the public. So one of the first modifications that we wanted to make was to actually raise well, first of all, was to sort of clear it as much as we could along the southwest corner of the roof. It has sort of the most visibility back to union square. It's also to a certain degree sort of the messiest part when you look up at the building and and so the idea that this portion would be that occupiable zone, whether it's outdoors or indoor space. In order to do that, we wanted to raise the walking surface of this portion of the roof by about 30 inches, and the reason for that is. The parapet is quite high. It's about seven feet almost seven feet above the existing roof. So by raising the walking surface about 30 inches we're able to sort of have a relationship with the parapet, that's more at a guard rail height, where people can actually oversee and look over look over the existing parapet. When we did that, of course, the stair bulkhead needs to also rise up as well, because we need to be able to get people out onto the roof and we also wanted to provide and need to provide elevator access for ADA access up to the group, which, of course, for the 110 years of this history of the building that that's not currently exist. In order to do that, there are a couple of big moves. Infrastructurally that we need to do one is. We need to figure out what to do with this large piece of mechanical equipment, and we figured sort of a smart way to split that up and relocate that to the eastern side of the roof, and the other piece was to rethink what we did with the generator. So in order for us to meet today's codes in today's life safety loads for the generator, if we were to leave the generator in place, it would have had to have grown in height considerably, as well as an additional room would have been needed to have all the switchgear functions that go along with the generator, meaning that this generator would have had to shift towards the street as well as rise up by about six additional feet. So luckily, we went back in and took a look at all of the equipment. That was how was housed in the existing bulkhead, and we found that there was a good portion with it within the northeast corner of this bulkhead that was actually not utilized. So our strategy was to actually take an outdoor exposed, generator and move it indoors, and the way to do that is we had to call to expand the existing bulkhead, both in height by by about 30 inches as well as grow the length of the bulkhead, and we thought that was a good trade- off, because we were able to take something: that's outdoors and just exposed and making noise whenever they run the system and put it indoors and hide it behind. You know: sort of enlarged, a bulkhead that already exists in place and I'll show you what how that comes into play. So from an infrastructural point of view, this is what results from what I sort of described right. So the the raised walking surface over here, the the taller stair bulkhead, the new elevator bulkhead for access for ADA and the slightly expanded new generator enclosure, where the former bulkhead sort of landed right in this zone. Here so adding to that, then we're we wanted to also look at how we would create an enclosable space, a functional space up on the roof so that it could be used. Year- round guests and the public could come up the roof and really sort of be able to enjoy the vantage point that we have here overlooking the union square as well, as you know, to certainly also enjoy to this very iconic sign. You know, that's been essentially close to the public. The design of the in the structure itself was really carefully chosen and have some slides of what the system is, but it's essentially sort of an l- shaped lean to series of panels that are leaning up against the the bulkhead itself and they're about six to seven feet wide and they actually can open up, and the strategy with this with sort of this idea of this lean to structure is that we could keep the Eve line as low as possible to minimize the sight line effect when viewing it from the street and the second piece of it was we intentionally chamfered this corner the southwest corner again with an eye to this idea of sort of minimizing the sight line from the street. Obviously we took this out to the corner. We not only sort of have a more visible sight line from the street, but we're also sort of encroaching upon sort of the w portion of the terrace. So this is what we are proposing in terms of this glass structure. The other element is, you know, it's our strong belief as well, that you know any sort of new addition that we place on a historic building ought to be of today's time. It should be contemporary. It should be distinctly different than the style of the historic portion of the building, and we believe that sort of a glass and metal enclosure like this could certainly accomplish that and be sleek and as well as be minimally visible, so yeah and it's one of the wonderful things about the system is that it could open up which allows you know w hotel that actually uses in different ways in ways that we may not even know how we're going to use it today, given sort of the situation we are in our country, but this allows us to have the outdoor space and indoor space and be able to use it in a very flexible manner. All right, so the next series of slides are just a series of before and afters of sort of technical drawings plans and elevations. So this is just the existing plan of the roof diagramming the generator park. Avenues on the left, septing street is is running along the bottom of the page and again so the idea of relocating the generator into this bulkhead here taking this unit splitting them up cooling tower stays it's going to be replaced in kind, but it'll stay because there's really no other place. To put it unfortunately, and then the the glass structure located on the corner. So this is the the proposed plan. So you'll see how we've you know intentionally taken the proposed structure and sort of tied it back to the bulkhead and sort of you know, leaned up against it, creating a setback along its full perimeter, which currently does not exist as well again, providing a little bit more relief from the sign and also the ability for people to be able to actually go up the edge of the building. There's a little sort of funky little platform idea here that we have here, which is basically sort of a series of steps that would have a glass guard rail. Of course, we do not want any dangerous situations there, but sort of this idea of being able to have people. You know actually be a little bit closer to the sign itself and also be able to have a slightly different vantage point, looking back down to union square. So as we take a look at the comparison and elevation, this is the existing elevation along 17th street. Since the south elevation of the building again you'll see the W sign cooling tower the big mechanical unit that currently exists, and the proposed glass structure that is sort of right behind the sign there set back in replace of that piece of equipment, as well as the expanded bulkhead that you can see sort of further beyond on the North East corner of the building. On the Park Avenue side, you can see sort of the same comparison from what is today, the generator the bulkhead. The piece of equipment which you can actually see in this comparison is shows how close it is to the sign versus what we are proposing here again, a very sort of simple formal structure up on the roof here that kind of just cleans up the roof line that may be visible minimally visible from the street and then the third facade is the East, the East facing facade, or, I guess the West Facade facing facing the east, which shows the enlarged bulkhead, where the generator would be housed and there's a couple points here that I just I just wanted to call out one is: the increase in height will match the existing party wall, the existing parapet wall that exists on the north side of the building, so we're not going any higher than that. We're able to get the generator to get squeezed down to fit within that height and that the materiality and the the cladding on the new bulkhead portion will match in both the materiality and sort of the finish. That's there today, which is essentially a copper standing seam wall panel, that just given over the years is a pre sort of a pre- patinaed copper. So it's sort of this grayish bluish color. So we will replace that in kind it'll, essentially, look the same. The plane of this wall is the same plane as the wall. That's there today as well, so we're not pulling it out any further towards the east. So these are just some images of this same system on some other projects and what's really sort of interesting and modern about it, is they come in single pieces that are basically this l- shape and they're? Each of them are about six or seven feet wide and they have the ability to telescope and open, but it's just a very simple glass and metal frame system. That's very transparent both indoors and outdoors. In terms of materiality, the roofing portion of it will be a translucent polycarbonate panel. The Wall portion, the vertical portion, would just be a one- inch, glass, igu and then any metal framing portions would be a powder- coated, aluminum frame that we are calling out for sort of a medium bronze color to match and go with the rest of the look of the building and the roof. So, lastly, we've got some sight line studies. So last week we were able to actually get the mock- up put in place. I'm not sure how many of you were able to take a look, but the diagram on the bottom left is basically what was installed in on site, given all the equipment that's there. But if you sort of play connect the dots, you can kind of get a sense of how this is all being connected. So this portion here would be the glass enclosed structure. This portion here is the stair, bulkhead and portion of the elevator bulkhead, and the portion back in the northeast corner is the expanded, bulkhead housing, the generator. So what we've done on these views is to sort of put them all side by side, so the left most image is going to be the existing condition of just a plain photo of where the shot is taken from the proposed is in the middle, so that might show a removal of equipment or the structure. We can see it and then the image on the right is the pretty close approximation of where we took the first photos a few months ago, but with the mock- up. So if you see any orange netting you'll see that those are the pieces that are visible. So from this vantage point, which is basically from the farmers market middle of the square, roughly 16th street, looking back at the building, there's actually really no difference between existing proposed or the mock- up. You do not really see any difference there. If we sort of slide ourselves down Park, Avenue, South towards 15th street and look back towards the building, you do see a few changes, so I'm just going to zoom in a little bit, so you can see it here. So this is the existing condition. You can see, obviously the cooling tower and the large mechanical equipment in the proposed scenario. You sorry fire alarm here. You do not see the the mechanical because, obviously that's been removed, and in this view you do not actually see the the glass enclosure and then that's proven out by the mock- up here, which does not show any orange knitting as well. So we'll just kind of quickly go through. You can always still hear me. The third view is a view. That's actually further south. So we went past 14th street, we're actually mid block between 14th and 13th on broadway, looking back at the building right. So this is sort of one viewpoint where you see the most of the roof and again as we zoom in you can see in the existing condition. The Rtu the cooling tower- and this piece right in here is actually the existing bulkhead. That's about 20 feet back right, so you're actually seeing the bulkhead that's back there, sort of greenish color over there in the proposed condition with the Rtu removed. You do see a portion of the glass enclosure, but that's all falling in sort of in front of the existing bulkhead, which you can actually see that's sort of back in here right. So again, I think part of the strategy for us was to streamline what you see on the corner, the most important corner of the building, essentially and sort of clean it up a little bit, and I think that's what we've achieved here, the if we look at the Mata that Orange netting here is actually basically this panel right here, so that sort of proves out that that's what we're going to likely see in reality as well. The forward view is the view on 17th street, looking West back at the the enlarged bulkhead. So, similarly again, we would do this in our proposal match the the texture and the finish of this bulkhead. It's going to rise up to the height of the existing wall and it will expand towards the south for us to be able to house the generator and the mock- up shows the you know, sort of the equivalent size. That's shown there view. 5 is a view from acrosss the park on 15Th Street and Union Square West, looking back at the building, and here likewise you can see actually from this vantage point of the generator, the Rtu and the cooling tower and as proposed. Obviously there's no generator, there's no rtu, but you can sort of minimally seize the top of the glass enclosure poking up above the parapet and again, that's proven out by the a little bit of the orange netting, that's showing up in the back up over here and then I think the last handful of slides there's actually no difference between the before, after or mock- up, just simply because of the viewpoints. But we wanted to go around all sides of the building to sort of be able to show you what you'd be able to see. So this is on 7th street. Looking East, there's really no change in any of that in any of these images: Park Avenue south looking south from 18th street. Similarly, you do not see anything different here and then sort of the straight up views looking up back at the building, there's also no difference. So you know with that. I think that sort of concludes our my our presentation. You know, I think you know for us, it was sort of it was important for us to address both issues of infrastructure and being able to occupy the building. I think, as architects and urban is we're always looking for ways to occupy the fifth facade, which is the roof. We think that's really important, just urbanistically, but even more so important in sort of in today's today's context as well. So I appreciate your time and thank you very much. Thank you. So much do you have to exit your building and take notice of this alarm where you're, fine, you're safe, you can stay with us a little longer yeah. I can. I think it's just a normal testing, but I will mute myself. Thank you. We do not want any unnecessary risk being taken for these hearings. Thank you so much for a very thorough presentation. Members of the committee do we have questions, and I see that Suzanne has her hand up suzanne go ahead, so, regarding all of the view that you've provided, which is very helpful, to see the fifth facade- and this is exciting for this hotel- so who does not love a rooftop, but I'm just curious what this looks like at night? What are their exit signs? How is this illuminated? I've only seen what this looks like during the day at every angle, but I would think that this would be illuminated. Can you speak to that? Yes, sure, of course you know, I think that we obviously would not want to use be able to use the space day and night. I think the nice thing about the system that we've chosen is that the roof itself is a translucent group right. So it's not just emanating light coming out if it was a clear roof, so I think that will filter some of the light, but I think, as you can see from the view the view studies what you can actually see of the the rooftop, the glass enclosure is very minimal. So I do not think we're going to be. You know, lighting up union square in any way. I think it will be a nice glow up on the roof and it'll be it'll, be sort of in context with sort of the top of the building. Thank you Suzanne. Do you have a follow- up question? Oh you're, muted Suzanne, you're muted! Am I can you hear me now? Yes, we can. Okay, I guess I just just a little pushback is not contextually the fact that the sign you can see W, Union square so well or just the sign. I just was curious. How that background light would impact just contextually sort of sign and how it sort of stands on its own without any backlighting just kidding it's a very good question. The sign is much taller than the glass structure. I'm sorry, the sign is much taller. The sign is also as if you I'm sure you know it's red, but it's got a solid back backing to it right. So the I can point to this. The actual lighting tube is in the front of the w. So it does have a background to it, so we do not think it will affect the the visibility of the sign in any way I mean that's, certainly not something that the hotel would want us to do either to sort of interfere with the visibility of the sign, but I do believe that the fact that the structure is so minimally visible the lighting of the structure itself. I really do not believe it will cause an impact in terms of its relationship to the sign. Okay. Thank you. I see that Richard has a question. Richard go ahead, yeah Max! Well, the I found that the mock- up's very helpful, but I think it was the next to last one of them that you showed. I thought you rushed through and you did not get to the third piece, which was the mocked up. I do not know if it was 35:36, no, the one before that, so I guess it's 35.. Could you step us through that again, including showing the the mock- up? Yes, absolutely, okay, so in the proposal in the proposed view, you can see a little bit of the Eve line of the glass structure sort of broken up. From this vantage point and in the mock- up you can see that as well, there's a little bit of orange netting here and it sort of continues on and sort of tapers away. So that's what you would see from this particular vantage point, and you know I suspect as well. You know I'm taking it from this view. If we're further back you'll see a tiny little bit more of it right. But could you that's for the West Facade? Can you do the same showing for the south facade? Yes, it's the same page, the that same page yeah. That's what I'm saying yeah! That's the piece that I really missed yeah, so the self- decide you do not actually see the the enclosure, because we you know the enclosure is set back from the sign, so there's a little bit more distance back there. So you do not see it and that's why in the mock- up, you do not see any orange netting up here, but what I'm saying what I think I'm seeing in the mock- up, looks somehow bigger. You know more robust than what I'm seeing in the Middle one yeah and the reason for that is. Are you referring to this yeah? I guess it's that piece. Yes, so that's the that's the existing condition with the market. So that's the equipment, the mechanical equipment, that's there that will be removed in this proposal. So that's why, in the proposal you do not see it, okay and but in the marked up you do see it. I know the mock- up was the mocked up of the of the proposed. No, the mock- up is a physical mock- up on the roof. That is today right. So we have to you know: oh, I see, there's no red there. It just exists currently yeah, I see so just so that everybody is clear. I know it's a little confusing the mock- up. Photographs are actual photographs, they're, not rendering they're, not altered images, they're, actually, real photographs of the existing condition of the building with the Orange netting and the Orange netting is meant to represent the addition. So what you see is actually elements that will disappear because they are being relocated at other areas of the roof and that become non- visible from thoroughfares, thanks to both of you that clarified it. Thank you great. Thank you. Karen has a question. Yes, if you can go to the slide, that has the highest element of the proposed mock- up, it's about the elevator bulkhead and if you could just talk about the top of the sorry, what is the elevation of the highest proposed new edition and I think it's at the top of the elevator bulkhead and does that exceed any element? That's currently the highest, because I think you had a datum line that showed everything was below it and I just that's my question: can you confirm if the elevator bulkhead is visible or higher than any other existing element? Let me just get to that page. I think the page that you had was the correct page right. So this is the elevator bulkhead. 18:7 is measured to existing roof elevation and no nothing is higher than the tallest existing element, which happens to be the northern wall of the building, which is this piece here. It's at 23 feet and I'm just not quite understanding. Can you point to the top of the elevator bulkhead again, because if the elevator is landing on the roof, unless it's a unique type of elevator, typically one story above that landing? Is you know the elevator machine room and the mechanics yeah? So it's it'll be a hydraulic elevator to minimize the overrun, so it'll be a side Piston Holeless, Hydraulic elevator. So the overrun here is roughly the last floor, plus the overrun. I can do my math on the fly it's about 16 feet, which is which is just adequate to get an elevator in there a two- stop elevator that serves from this floor up to the roof. I see so 16 feet above the top of the roof or 16 feet above the proposed new penthouse edition 60 feet above the new raised. Terrace level so the finished floor of the roof. Essentially the finished floor of the thank you just follow a question on that: what about the the generator enclosure that is taller correct? Yes, that is taller here. It is right, so the generator root is 23 feet, 2 inches from the existing group, which is what we're calling the stadium over here and again that matches the height of the northern existing Wall. Try to you know make sure that we're not any taller than that. You kind of use that as your datum to hold not to breach and work down and equipment to you know stay contained under that datum. I see it's still a struggle to get it all in there, but I'm sure you did a good job. You did a great job. I'm sorry, just to continue on that line of questioning. It looks like there is a faint line that looks like a. I do not know some shape of some element that is above the yes, this element above the enclosed generator. Can we speak to that? Yes, absolutely so that is a it's some sort of a venting unit. So in order for us to keep the enclosure as low as possible, there's a piece of the unit that we had to locate onto the roof. Otherwise we would have to increase that put louvers up above and all of that stuff. So I'll show you what that looks like in Axon. It's actually a little bit clearer to see okay. So it's this, so it's a it's a radiator for the generator it's how they expel the hot air. I guess coming out of the generator when they fire it, but we strategically located that, obviously as interior as possible. So you know it does not show up in any of the views, because it's so far from any of the building edges as well as it's partially blocked by you know this bulkhead itself. So it's this! It's this piece of equipment. That's sitting on this roof! Okay, all right got it! Thank you so much! Thank you! Well, it's the tallest! It's not visible in the mock- ups, that's correct, that's correct, and then you know I did not mention this. There's a there's, a pressurization fan for life safety that we need to add to the building as well, also not visible, because it's pushed so far back. Okay, thank you, Karen. Does that address your questions? Yes, thank you. Thank you any other questions on this application from members of the committee Suzanne. I see you have your hand up we're still in questions yes, so quickly, and maybe it's here and I'm just not seeing it because I can't read it: there's a stairway up, stairwell up to the roof as well accessed by El Stair other than elevator yeah. So there are actually two stairs. There are two stairs that come up to the roof. This is one of them. This is the new elevator. That's coming up and there's another stair. That's just in this in this volume that we're not touching it it'll still serve the two means out. Okay, thank you. Thank you. Other questions from members of the committee any more questions. Okay, seeing none! I will open up the floor to members of the public. Do we have any members of the public who wish to speak to this matter? Ask questions to the applicant: you can use the raise hand, function or press what is it again: luke 7:9, star, 9, Okay, star 9 for the colon users or raise hand function for those who are online with us. I see none and let's move to a business session members of the committee. What are your comments to this application? Any comments? Okay, then I will call upon some. Oh okay, Laura go ahead, please! Okay! Thank you leila the proposed changes. I looks very neat and clean and safe as opposed to the clutter that and that we see in the existing condition and clutter and busy. Looking, if I might add an environment and by relocating the generator and relocating the bulky corridor and the mechanical equipment, it actually looks organized and leaves the space for the roofing axes and walking area which brought which made the the rooftop. You know really neat and the seasonal structure looks cool to me. So I'm I agree with a proposal or approval. Okay. Thank you. Laura other comments from members of the committee. We need comments. This is the last application. Come on guys do not be shy. I see a hand up, yeah, suzanne, you're, muted, Suzanne got it. I got it it's on it. I agree with Laura. I mean. I think, that this is a well organized, resourceful way to activate a space that will hopefully be helpful to maintain this beautiful building, and I hope the lighting is not obnoxious, but that it is done in a tasteful way and that will activate again this business and have people enjoy it and I'll go I'll, go and have a cocktail of this too on the roof. I wish them well yeah. Thank you. Mike came back yeah, so I'm going along with the majority. I certainly approve of how they made effort to make all the new structures hidden from as best as possible, only a tiny little peek- through I vote that this we accept this application. Thank you James. I too am supportive as well. I think they did a very good job of the presentation and they've been good stewards of this building. So I think it's worthy of approval yeah. Thank you buzz. I too approve, but I can't resist saying as a member of the psql when this comes to psql for a liquor license, you will receive a somewhat different reception, I'll leave it at that. Certainly, our board is gravely concerned about rooftop activity and we want to regulate it so as not to create any or negative impacts to yes on a purely landmark standpoint. No, it's very it's very wrong. Let's hope that they will manage their little license. They are the same way in a harmonious and tasteful fashion. Other comments are Richard. Go ahead as someone who's been sconced for three and a half months now in oakland California, desperately missing New York City. I can't wait to come back. I'm never going to cook another meal myself ever again and I can't wait to come and really have a vibrant New York. So I'm very excited about this. Thank you karen. Yes, I echo what everybody said on the committee. I want to compliment bbb on a really clever, incredible architectural feat of doing something, fabulous and concealing it. Unfortunately, but well done yeah. I wholeheartedly concur, really very tasteful. I agree that you know that the structure is not meant in any way to be. You know a pastiche of the building, but it works. It's an elegant way of you know addressing this need. I think that in time of cohered we need as much outdoor space as we can. This will be, you know flexible and it's intelligent, it's elegant and and it's entirely concealed from any thoroughfares, especially from you know the main facades. You know we do acknowledge that on the you know, a northeast facade there's a little bit of visibility from this generator enclosure. I do not think that it's detracting in any way from the the historic fabric or from the context of the neighborhood, although it's an individual landmark, but I think it's very clever and it looks like we have a motion to approve and we need a second all right, final vote of the evening. Buzz yes, Renee Cafaro, yes, James, yes, Sarah, yes, laura, yes, John! Yes, is that yes, Richard yes, Mike, yes, Renee tinsella! I will come back to Renee Sam. Yes, Chuck left Janet, yes, Karen! Yes, I am a yes and I'm coming back to Renee. Kinsella is renee still with us, but she is muted, Tony, oh and Tony. I'm sorry, thank you for getting me yeah. I changed sheets and I forgot you already. I am so bad. My apologies and Tony is a yes renee cantella. Do you want to record your vote? I do not think she can hear us. Okay, so nonetheless, motion passes unanimous vote. Thank you very much to all of you for your time and patience, and on that note the meeting is adjourned. Thank you. Thank you. All have a good night. Thank you good night, thanks good night.",
            "summary": "I will open up the floor to members of the public for questions and comments to the application.\nOver the past several years, beginning in 2012, a great deal of historic restoration and preservation works been done on the building, including restoration of the 42Nd Street storefront, replacing a more modern replacement that had been there for many years at the higher floors of the building.\nThis is a view of the building looking west on 42Nd Street, and it is the point of view from the public sidewalk, where the roof is most visible.\nEven from this vantage point, here's another view of the building looking west from Times Square along 42Nd Street, and you can see the building is now part of a fabric of high rises, and you know more obscured, obviously than it used to be by their presence.\nWest 42Nd street is a hip roof structure that is was originally roofed in Baton, Seam, copper and the reason that we're meeting tonight and presenting to you tonight This is a steel armature that used to support a decorative Florida lee that was installed one at the north end and one at the south end of the roof.\nAdditionally, during the construction, phase, handling, the liquid membrane and its reinforcement, layers, which are lightweight fleeces and like, is much safer to do in the confined and steep areas above 42nd street, as well versus handling large sheets of formed, copper, A benefit of using the liquid membrane product also is it does come in a very good, patina, green version.\nAre you know, ordinarily, a sound and sturdy way of connecting a copper roof to a building, but at this height and subject to the weather that we're seeing, we feel it's prudent to have something that is even more secure securely attached to the building such that should any portion of it begin to loosen all of the square inches of material adjacent to it remain tight.\nIt's, going to be a new CBS location It was formerly or most recently, occupied by the express proposals for new storefronts signage and to create a new entry in the easternmost bay on 18th, street.\nNew entry will include automatic doors to allow for unobstructed access, and that's in that easternmost bay on 18th street and.\nThe entry on the left is the existing Fifth Avenue building entry and then they sort of sandwich a storefront on one single storefront on Fifth Avenue on 18th street It's, a freight entry.\nThis is the original condition, and so what you see there are projecting storefronts, which were original to the building, and there is a an entry included, a little farther down a couple of entries actually on 18th street and Those existed from the time of construction until the early 1920s.\nOurs goes away in the early 20s with the introduction of the bank at the at the retail space, and so here you can see that configuration that I was describing the large central bay, flanked by two narrower bays in the in the Fifth Avenue Storefront and then and then shifts in signage, on the corner, pier and at the at the sign band at the second floor, cornice and a spectacular array of light bulbs at that point, Photo Richard, Oh great, thank you and then 1940s tax photo shows consistent, storefront configuration new signage, and all of this is you know very typical in the historic district , the storefronts, the infill and signage all change and evolve as the commercial use And So now I think I'll pass the presentation over to Richard who can walk you through the design details, good evening.\nThese the existing elevations in the top of 18th street and the proposed at the bottom, the obviously we're retaining the historical detail at the bulkhead and the cornice above and below the new storefront.\nThe storefront is, is being updated to a double glazed system for compliance with New York City, Energy Code, and the biggest change is that the current storefront is equally divided in typically in three bays in the largest modules and the new proposed storefront is reflecting these historical modules that Aaron alluded to in the photographs which do not provide equal lights.\nThis bay, the remaining store front, is being removed and replaced with the new double glazed units, and this is the bay on the end where the new sliding door Assembly is being inserted.\nWe have open hours, which is applied vinyl on the on the new door and a static sign on the exterior of the building.\nIs that the idea is that when people are escorted, clients, customers that come in, if someone needs assistance, you can't physically hit an actuator, have out swinging doors and then be able to like smoothly enter the space with someone who's accompanied or if a person is in a wheelchair.\nObviously, people are coming and going to work and lunch time and when things are getting busy, we like to create the most convenient access to the store as possible.\nI. Do not believe that there are any automatic doors of that type on fifth avenue and, as we know, precedence do matter, and we certainly do not want to.\nYou know if this is a roll out, just like every other CD cvs in a non- historic landmark, building.\nIt looks like we have a number of issues with this application: The sliding door being won the amount of signage and the amount of illumination.\nI did want to note that this proposal does not seek any changes to any of the historic facade elements of the building.\nThat sort of runs the entire length along 17th street and at the time, represent the name of the company that the building was built for which In 1940, one of the sort of the most significant changes to the facade was that the balcony on the 16th floor actually got removed and we could not figure out.\nWhen there was a renovation of the infrastructure portion of the building, where two cooling towers were installed on the roof sort of directly behind the guardian light sign.\nThese views back to the building from Union square, looking acrosss towards the building or from the south, or from the east, looking back west to the western facade of the building, and you can kind of see that today there are some equipment that are quite visible up on the roof With, that in mind, if we just focus in on the rooftop itself, we're actually able to dig up the original drawing for the roof plan, which is kind of interesting.\nSo, those sort of the big pieces, as well as some internal equipment that was added within the existing bulkheads Then this is sort of a pictorial view of those three stages as well as it was built as it looked from the 1960s with the two cooling towers and where what it looks like largely today, right with the with the equipment up on the roof.\nThis is a little key plan on the side, but you can see the the generator that's sort of sitting up there facing park, Avenue South the cooling tower and then sort of this maze of ductwork and this large piece of mechanical equipment sort of right behind the W Union square.\nThese are the elements that we're proposing to modify to be able to sort of tackle the the two- pronged approach of trying to deal with the infrastructure upgrades that we need to do on the building and also to provide rooftop access for people and for the public.\nThe stair bulkhead needs to also rise up as well, because we need to be able to get people out onto the roof We also wanted to provide and need to provide elevator access for ADA access up to the group, which, of course, for the 110 years of this history, of the building that that's not currently, exist.\nWe need to figure out what to do with this large piece of mechanical equipment, and we figured sort of a smart way to split that up and relocate that to the eastern side of the roof, and the other piece was to rethink what we did with the generator.\nThe design of the in the structure itself was really carefully chosen and have some slides of what the system is, but it's essentially sort of an l- They actually can open up, and the strategy with this with sort of this idea of this lean to structure is that we could keep the Eve line as low as possible to minimize the sight line effect when viewing it from the street and The second piece of it.\n, it's our strong belief as well, that you know any sort of new addition that we place on a historic building ought to be of today's time.\nIt should be distinctly different than the style of the historic portion of the building, and we believe that sort of a glass and metal enclosure like this could certainly accomplish that and be sleek and as well as be minimally visible, Is that it could open up which allows you know w hotel that actually uses in different ways in ways that we may not even know how we're going to use it.\nSo you'll see how we've you know intentionally taken the proposed structure and sort of tied it back to the bulkhead and sort of you, know, leaned up against it, creating a setback along its full perimeter, which currently does not exist as well again, providing a little bit more relief from the sign and also the ability for people to be able to actually go up the edge of the building.\nThe south elevation of the building again you'll, see the W sign cooling tower the big mechanical unit that currently exists, and the proposed glass structure that is sort of right behind the sign there set back in replace of that piece of equipment, as well as the expanded bulkhead that you can see sort of further beyond on the North East corner of the building.\nThe piece of equipment which you can actually see in this comparison is shows how close it is to the sign versus what we are proposing here: again, a very sort of simple formal structure up on the roof.\nWe sort of slide ourselves down Park, Avenue, South towards 15th street and look back towards the building.\nSo, we went past 14th street, we're actually mid block between 14th and 13th on broadway, looking back at the building, right.\nIt's, going to rise up to the height of the existing wall, And, it will expand towards the south for us to be able to house the generator and 5 is a view from acrosss the park on 15Th Street and Union Square West, looking back at the building, and here likewise you can see actually, from this vantage point of the generator, the Rtu and the cooling tower and as proposed."
        }
    }
}