{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCxsk7hqE_CwZWGEJEkGanbA",
            "title": "2020.09.21 - CB2 Parks \\u0026 Recreation Committee Meeting",
            "publishDate": "2020-09-22",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nParks \\u0026 Recreation (P\\u0026R) Committee\\nMonday, September 21, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Welcome \\u0026 Process\\n00:01:25 - Roll Call \\u0026 Introductions\\n00:04:16 - Approval: Agenda\\n00:05:03 - Discussion: June 2020 Committee Minutes\\n\\n00:06:50 - Presentation \\u0026 Discussion: Photoville NYC 2020 \\nElizabeth Masella, NYC Parks Senior Public Art Coordinator\\nLaura Roumanos, Photoville co-founder\\n\\n00:33:44 - Presentation \\u0026 Discussion: Golconda Skate Park\\nIan Clarke, NYC Skateboard Coalition founder\\n\\n00:58:24 - Chairperson's Report\\n01:02:45 - Other Business\\n01:09:25 - Community Forum\\n01:19:25 - Motion to Adjourn"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "dateCheckLast": "9/18/2020",
            "status": "live"
        },
        "properties": {
            "fillerWordCount": {
                "uh": 141,
                "um": 272
            },
            "wordCountFullTranscript": {
                "park": 57,
                "lot": 43,
                "people": 39,
                "parks": 36,
                "year": 31,
                "community": 29,
                "committee": 28,
                "bridge": 24,
                "things": 20,
                "members": 18
            },
            "wordCountSummary": {
                "park": 15,
                "people": 10,
                "lot": 9,
                "community": 7,
                "bridge": 7,
                "parks": 6,
                "year": 4,
                "work": 4,
                "art": 3,
                "photos": 3
            },
            "fullTranscript": "Record these meetings and just a few housekeeping details. This is parks and recreation. As you know, committee of Brooklyn community board two we're calling the meeting to order it's being recorded. So please keep that in mind and we invite attendees to keep their cameras on and we really ask committee members to please keep your cameras on the same time. It's always helpful if everyone mutes themselves unless they're speaking so if you do start to speak, try to remember to unmute yourself, I think that's people tend to forget that if you, if you are not on the committee, the committee usually asks questions first and you have some questions and if we don't get to them, please put them in the chat and we will try to get to them or have someone get back to you with the answers we are committed to providing access for all of our neighbors, regardless of physical ability or limitation? If you or someone you know requires accommodation or assistance for full participation in this proceeding, please in the future, contact the district office at least 72 hours before the public meeting. I I'm now going to just I'm going to start. I don't know if I mentioned I'm barbara zahler-gringer, I'm one of the co-chairs of the committee. My co-chair is going to identify himself next unmute yourself, okay and our secretary for this evening. Hi I'm candice harrison. Thank you again. Candace carolyn! Do you want to say hello? You need to unmute hello. This is carol hubbard coming on weary board, member and committee member okay, thank you. Jennifer all right, we'll come back to you! Dwight I see you've joined us. You want to say hello. Okay, I saw him a minute ago: dwight, you're, muted, oh there. He is good to see you. Okay, suzanne hi, everyone, I'm suzanne quinn, board, member and committee member. Okay, we'll try jennifer again! Oh there, you are, if you unmute, you have to unmute jennifer, oh well, towards the bottom of your screen. It should pop up the mute button and stop video there you go. We should be able to hear you now as well. Oh dear, so you are unmuted, but we can't hear you, but we see you okay. So that's another one of our members. Jennifer milby- and I think lenny is supposed to be on this call, but I don't see him so at this point we're going to move along with the agenda. I thank the committee members for being here and just I will let you know that our committee member quinn carruthers, is moving outside the district, so he will no longer be on the committee, but he came back. He went off the committee before so maybe he'll come back again and then can I just have an approve a motion to approve the agenda. Do I have a second all right, suzanne? Thank you. I just whoop. I think we will move. What I'd like to do is move number four, the approval of the minutes. Well, let's go to the all right. Should we take a vote, then? Is there anyone who objects to the agenda? Here we go all right. Assuming there are no objections, then would everyone raise their hand to approve it either virtually or okay all right? Well, thank you. We'll move ahead with the agenda. We have the minutes. You receive them from our June 15th meeting. Does anybody have any changes to the minutes? Candace most of my edits were just for clarification purposes. Okay, like one page, one number is bullet point number three davey ives, his name is spelled out his first name and last name, but then on page two in item number, nine and ten he's referred to as mr davey in number nine and then mr ives and number ten. Oh thank you yeah, so just for, I guess legion and clarification should just be maybe one or the other yeah. No, it's obviously it'd be mr ives yeah. It should be thank you for that sure and then in bullet point number, eight in the next to last sentence. It says mr eyes answered that the parks, department and staff are being flexible in how they address. I don't know if that was an incomplete sentence or just a full thought all right, we'll follow up on that. Maybe it should be something like in how they address these issues. Yeah, that's what I had all right. Well, thank you, and I want to thank suzanne for taking these minutes taya for putting them in great form. So I'm assuming we have consensus then on the minutes, so I want to move ahead then to our first presentation, which you have got to see this exhibit. Let me just say that this is fotoville, I'm sure most people on our committee are familiar with fotoville. It's a new york-based nonprofit that works to promote a wider understanding and increased access to the art of photography for all and right now they have an exhibit that is just tailor-made for the times we're living in it's outdoors, you can walk around, avoid any people you might see, and it just it's really breathtaking. So with that we're going to turn it over to laura romanos who's, the co-founder and executive director of fotoville and elizabeth masela, who is the senior public art coordinator for new york, city parks? And thank you for being here. Thank you for having us, so I'm elizabeth masala, I'm the senior public art coordinator at parks. I am here to share we'll introduce laura, really because she'll give you all the good details and photos of the exhibition, but as you're probably all familiar with photoville, which has traditionally taken place in Brooklyn bridge park every year over a couple weeks this year, we're kind of taking it to all five boroughs. I think we have nine park sites throughout the city in Brooklyn, there's anchorage plaza, which is kind of surrounding the Brooklyn. Is it the Brooklyn bridge anchorage or is it Manhattan bridge? It's the Brooklyn and it's the bqe Brooklyn bridge, okay, on fulton street and on washington street we've done. A number of banner exhibitions on washington street in the past was the first time we've done it on fulton street as well, and you'll also find the exhibition in Brooklyn bridge park. It is gonna. Well, we installed most of them, except for a couple park sites in Manhattan last week, it'll be on view until the end of November. We've been kind of working really hard this summer to put this together and we're just happy to share some more information and background on it. So I'll turn it over to laura to speak more in depth and share some images with you all yeah. Thank you. Elizabeth and NYC parks has been so amazing to us this year and thank you all for having me we are. I'm gonna share my screen so one moment I should have done that while you're talking so, can you all see that beautiful? Yes, so I can't see any of you now. So we are photoville, I'm the founder. I've actually been in the dumbo area. I actually moved to the us 15 years ago and started working at cnn's warehouse, so I've actually been in dumbo for 15 years, and I also am now on the board of the dumbo business improvement district. So I really care about the area a lot and we at photovel we amplify visual storytellers and connect them to audiences, and we do a lot public, art, community education and I'm sorry, if you can hear my four-year-old in the background I apologize up until february of this year. We actually had a gallery in dumbo, but right before the pandemic, who knew we decided that we were really doing so much public art that the gallery was kind of falling on the wayside and as a very tiny mom-and-pop like small non-profit. It just didn't make sense anymore, but we've done like elizabeth said: we've done a lot of work, you can see the middle photo. We've done a lot of things on washington, street and dumbo, but we've done a lot of public art. So we are the photovolt festival which is gathering folks under the Brooklyn bridge. We also have the fence so you've, probably seen every summer in Brooklyn bridge park, we've had 40 visual stories in the park and we now in 11 cities across north America in a few weeks, we'll be installing in atlanta, in durham and denver and again we're very tiny. Just have to remind you about this. We also have a really robust education program and it's actually led by jasmine chang, who is our deputy director she's, a fort green resident and also the creator of community heroes which I'll talk about in just a second. We do a lot of different public art and jasmine with a few other colleagues created this amazing celebration of community heroes, especially in commodore barry park and fort greene park, and it's really special and you know she's one person and asked us if it could come under our umbrella that we can help give her support and resources. So we're really happy to be able to continue community heroes, so it doesn't stop right there and actually she wanted me to throw this out there, because we'll be announcing soon in connection with the fort green fling with fort greene park and the fort greene park. Conservancy they're going to be celebrating community heroes, so we'll be sending out, and I will put in the chat shortly- some information and some links, but we want you all to nominate heroes of the fort green community. So I just wanted to do a quick shout out there. So let's talk about photovel and the festival and again I apologize with. I don't know if you can hear, but it's a lot. So if you have been down to Brooklyn in the last eight years, you've seen the shipping containers we because we are so tiny. It wasn't the fancy containers that were in like decal market years ago, they're really crappy shipping containers, but it really was about democracizing, the you know how we see art, how we share stories and the way that we started with photovel was part of the dumbo arts festival in 2011 and then regina meyer said. Look I'm developing this park. We want you here and so what started off with a few containers then ended up being so many and for us it's about celebrating visual storytellers and we kind of strategize and we invited folks from the new york times time magazine, instagram, so national geographic. So we had the big guns, but we have their photo departments, not their marketing departments. So we had their photo directors really being thoughtful about the kind of work they chose, and then we invited a lot of the colleges high schoolers, independent curators artists, and so it really was, this kind of way of people may show up because they heard national geographic but they're walking away talking about that local Brooklyn, photographer they've never heard of before so earlier this year with the pandemic, we started talking to Brooklyn bridge park and was like there's no way we can do the containers, and so we thought about dispersing throughout Brooklyn bridge park. But then we thought about well. We should really be taking this out in throughout the whole city- it's our 10-year anniversary next year, and that was always a plan. But we thought- let's not wait, let's do it this year, so we reached out to elizabeth at NYC parks and she was so amazing, and so we identified several parks throughout the five boroughs, and so we now have 63 outdoor exhibitions. We only have one exhibition left to install, which is in harlem in later this week and basically the idea is instead of two weeks. It's over two and a half months, so people can come down whenever they want they can you know quite a few people came down last weekend this weekend that just passed and then they're going to the Bronx next weekend and then they're going to staten island the weekend after. So it's really about making sure people can do it on their time and then we really have a robust daytime programming. So I wanted to share with you. This is flex, so you can see kennedy carter, a rising emerging photographer from north carolina and you're all getting the sneak preview she's. Actually, the winner of our fence, the jury's choice, she's winning five thousand dollar grant, and this is the most beautiful series and I highly recommend you check out her work. This is all about creating these beautiful portraits of black people and she really wanted to showcase her community in a really great way and we'll be working with kennedy in the next year of showing this work all over the country, and so it's in on old fulton street. We also have we invited a editor at the new york times, jim estrin, to nominate four emerging photographers from all over the world that we should be looking at and they're really amazing. I want to stay on. We also have three exhibitions on washington street. I have not taken photos. Our actual photographer took photos today and tomorrow. So I don't have those photos yet. But the wonderful thing about partnering with nat geo is that they're, instead of showing the usual stuff that people think about national geographic, it's usually very challenging work so wayne lawrence who's, a Brooklyn photographer. We have his work, which is a world premiere of covert covert, survivors and family lost loved ones, and it's really powerful and very emotional. We also have a young photographer from the philippines, looking at redefining beauty from all over the world and then another photographer who took photographs of a flamingo in the bahamas, called bob, so very universal stories and that's by our friends at nat geo and then I just wanted to show you photos of what we've done in the park, and I really would love for all of you to. If you haven't yet to come down at your own time, of course, wearing your masks, we keep stressing that you can see that we've really we're like on pier 2.. This is work by a really great photographer, nina robinson on faith healers. This is under the bridge and actually necessary fiction. Debbie cornwell lives in Brooklyn heights, so she's a local photographer amazing photographer. You can see just north of st anne's water street. I took this yesterday. There was a lot of people around on doc, straight single moms by choice, a young really young photographer from long island and an indigenous photographer on fulton furry landing, really beautiful, and actually we had some indigenous folks come by a few days ago and do a blessing which was really lovely, just kind of going and we're also in times square, so elias williams, a Bronx photographer biked all around new york city during the pandemic, photographing graduates so from four-year-olds to high schoolers to college we're in Queens astoria park. We're in the lorry side he's some another one from in Brooklyn bridge park, we're in jackson heights. So we worked with the queen's museum and this is a collective of migrant women, and these are the ladies who are in these photos who crochet and it's really beautiful. This has been very popular in Queens and you know just down in Brooklyn bridge park again some of the photographers or Brooklyn we've had a lot of love. It's been up for four days already and you can go on our website photobuild.nyc, and this is the the map here and then we also have a lot of online sessions. I spent the whole weekend in the office on my computer. We had already had 11 sessions all free. I highly recommend you check us out, and then we have our educator programs, and so we have a lot of Brooklyn schools and a lot of schools from this district from cb2. So in the month of October, free virtual field trips, where teenagers so we're encouraging educators, but also parents, because we know there's a lot of young people being homeschooled right now. So you can log on register and they'll, be meeting a lot of our artists and curators over the month of October, and we've also invited youth photo organizations here in new york. So we do this every year in person, but this year will be virtual and then we also have our educator lab. So it's a free professional development series that we've been doing for years with educators and this year it will be online. So please check us out on photovolt.com next year. It will be our 10 year anniversary, so we really hope that we'll be expanding throughout Brooklyn, even more even beyond Brooklyn bridge park, and to be honest, we just ran out of money. We would have been in more places, but we ran out of time and money and you probably heard I have a four-year-old. So it's been one of those things, so I this was a really very fast. Believe me. I could have gone and said a lot more, but I just wanted to give you a taste of who we are and I'm happy to answer any questions laura. That was fabulous and you you're right. It is a taste, it's a fabulous, fabulou fabulous, exhibit and watching your presentation. I see there are at least a couple of places I didn't see, so I have more to go back so first, do you have any questions for laura from members of the committee suzanne go ahead. Let's have a question and more of a comment: hi laura I'm suzanne quinn. I live at one main street. I know your husband yeah exactly I wanted to make the connection and for like for our committee, my husband joe had the honor of being part of photoville, maybe like well time flies three or four years ago. He has a photography project on on gun violence. So just to say you know, as a comment I feel like dumbo is a neighborhood that has like so much activity and people and things going on, and I think photoville is something that everyone here in the dumbo neighborhood feels really good about that. It really grew out of the neighborhood and it's something people really embrace and can feel a part of so wanted to add the resident perspective on that and just really impressed with what you have done this year. It's really it's really. It shows an incredible amount of leadership to take the opportunity to you know of everything, that's going on and expand in the way that can be useful and inspiring right now. So congratulations to all of you on that. Thank you appreciate it. I just want to introduce lenny. Do you want to say hello because yourself and say hi, because we didn't get a chance to hear from you earlier you have to unmute yourself. Okay, I had a very hard time. I didn't get a link to the meeting and I finally did get a link and okay. So now I'm here I am one of the members of the boston recreation committee. You could just give us your name leonard lovington, okay, great okay, all right thanks for being here, do you have any questions for laura? I don't caught the tail end of it. I wish I had heard it. So I'm sure you'll get out there to see the exhibit any other committee members have questions yeah. Well, I had a question I just as I mentioned to you earlier. I was just so impressed at how quickly what a large exhibit it is and how quickly you must have put it together. I just was wondering what your secret is and to have great quality as well. No, it's working look it. We are so tiny. Look we're! I think, we're struggling financially like everyone else, but we thought that if we didn't do anything this year, we would be first of all dead in the water to be honest, being very transparent. With all of you, it's going to be a tough year coming up for a lot of non-profits a lot of cultural nonprofits. We also so many of our partners, a lot of who are non-profits themselves do rely on photoville as well to help them get their stories out there and to do these kind of things, and then we also thought look. I'm I have a kid. I have a dog we're out in public spaces every day. There's we're in new york city and so much of things that we love doing. We can't do and but we are all outside, so we thought why not show these stories and there's some really extraordinary things out there, and you know there is a lot of stuff connected to covert, but we also thought you know with looking we're working with eight middle and high school doa teachers, schools and showing the importance of you know: art, education and you know thinking about the environment. We've got some things about the environment and looking at black lives matter and there's a lot of things there and there is. You know health. I mean I can go on and on I'm preaching to the converted here. So we wanted to do that, but also we have an amazing team and you know we always have had this army of volunteers at footabel and we thought we have to be really responsible this year. So we had to say no to a lot of people and like go. Where should our money go to so even like things like we? Actually, you know we had to make everything safe. We made our own, we actually made our own weights, we actually bought a whole bunch of buckets and we got a. We got like an actual concrete truck under the bridge last week and, like our team, just did that, like we, you know we're doing everything we can to make this work, but it is so special, and I was I was telling about we were like yesterday. I was I in between panels. I biked out to the park and stalking people looking at the photos and going yeah. This is worth it like all the sleepless nights and the drama and like the next two months of sleepless nights, it's worth seeing how people are connecting, and even some of the conversations that parents are having with their young people about certain things that are going on. We live in a 24-hour news cycle, so things are we're just seeing things and then we're on to the next. So there's nothing like seeing something in person and really drinking it in. So that was sorry that was really long-winded, but I you know, I feel really. You know I care very deeply about what we do. I am so grateful for NYC parks that were really now figured out how to do this beyond Brooklyn bridge park. I've put in my email address and so feel free to call me anyone if you have ideas for not just this year, but next year, we'd love to work with you. We you know, we've been in dumbo, I'm like I said: I've been working in dunbar for 15 years, I'm very and I used to live in fort greene, but you know we decided we wanted a family and we couldn't afford a two-bedroom in fort greene, so you know we had to move out, but, like that's, I love. I love the area. Well, thank you, for I also wanted to mention. Jasmine has been to our committee more than once she's reached out to us about the local heroes and again I hope you'll come back. Thank you in the future and let us know what we can do to help support you other, obviously than getting the word out about it. Any other community members have questions. If not, we would have a question, but maybe a suggestion to laura sure, what's happening now and there's a whole new lifestyle that we didn't expect six months ago or whatever spike lee did a little bit of a clip of. What's it's like closed up and I think there's a another story to tell that spike. Lee doesn't tell in his story- and there are this whole new life that has developed- that is sort of contrary to what spike lee presented. Everything being closed up captioning, not if you're just available down decal back, and you see how many of the restaurants have really opened up, and it's like festival town during the days or late afternoon, and I think that's something that should be required for posterity thought that we're living in a closed world. But it's really not. There is a festival life to it about eating outside in these temporary restaurants or eating areas outside. So I think it tells a story because when I originally saw the spanking thing, I was very much about it and a lot of people were that I sent it to, but it was kind of a it's kind of a sad picture because it's new york closed and this is the contrary. New york has been close, but we're celebrating. So I just said it. I don't know where I'm going with it, but it's a good. It's a good suggestion and we've been thinking a lot about how this time is being documented and there's a lot of people doing that. But thank you, I'm going to think about that a little a lot more. Actually, thanks andrew is there any do we have any board members who want to ask a question. John. You have to unmute yourself. If we can't hear you okay, can you hear me now hi, I'm john. Do I'm a member of the community board, I'm also on the Brooklyn bridge park, conservancy board for 10 or 11 years now, and I am also chair of the myrtle avenue business improvement district, which is comprised of the I want to say the south side of the fort green public housing project and fort greene park. We're always looking for opportunities for the fort greene public housing residents to get more involved in things outside of the fort green public housing projects. Yeah I've reached out to Brooklyn bridge park to come up with some programs that we could potentially introduce to the residents of fort greene, and I'm looking at this as another opportunity to reach out to some residents and get some of the kids involved in this. I have seen your displays throughout from time to time in the park, and they are actually quite wonderful. So I would like to get all of your information and further explore those opportunities and that whole piece about photography in the community. Again, I'm looking at this as a potential another opportunity to get the community to become more proud of themselves. We have a lot of issues in the community that can be solved if we come up with creative ways of interacting with the community, and this sounds like a wonderful opportunity and you mentioned spike lee all those kinds of folk. So if there's any thought that you can put to this, we should chat at some point and further explore this and barbara just so. You know I'm on this to talk about full green park at the very end of the meeting. Oh okay, thank you, john I'll put my email here again, so you can email me directly. Would love to talk to you excellent yeah? Absolutely, okay, all right! Is there anyone else on the at the meeting. Who would like to ask laura a question if you could unmute your unmute yourself and then okay, all right, I don't see any more questions and I thank those who did ask questions and again laura it's just a wonderful exhibit and thank you so much for doing it and for coming today to tell us about it and please you must go see it, especially if it's a nice stay weather-wise out there. It's great: it's in the park Brooklyn bridge park a little bit, it's a lot in dumbo right near st anne's and around the timeout building, and it there's a lot a lot to think about. When you see it and it's really terrific well, thank you for having me and I'm sorry. I have to run because I can hear my kid, but I I'm going to try the next meeting and please anyone. Thank you so much. Okay, thanks and thanks elizabeth thanks all right. We're going to have our next presentation. I see ian is casey with you or are you so low tonight? You have to mute. You have to unmute, sorry, I think, okay, so before we turn it over to you. I, as you know, suzanne and I visited golconda skate park, which is not far from commodore barry and is right near the the navy yard, boys and girls club. This is a wonderful place. The skateboard people really enjoy it. It's used all year round. As my commit members may recall, when we were talking in June about the district needs statement, we put we added there- the goal to winterize the bathrooms in the park because it is used all year round, and so we had asked ian, who is from the new york city, skateboard coalition, to come and talk to us about the park. If you have any interest in skateboarding, this is the place you want to be, and so ian I'm going to turn the floor over to you. Maybe you can tell us how the group came together, what you we cover across multiple skate parks in across the five farmers of new york, new york city, and you know, we're very grateful to be involved with golconda skate park, and I just like to say you know. We really appreciate the community boards of new york and the volunteer work. You all do the good work of the community boards and you know it's a really great thing. You guys do so. I just want to want to say that I apologize it's just me tonight. Unfortunately, I don't have a presentation, quite as nice as the previous one or anything, but I can I'll give you a little outline on some of the work we do. You know we've found that the problem in skate parks is keeping them clean. You know the skate surfaces get a little dirty, sometimes or not that isn't difficult to to skate and we can't rely on parks department to always come around. So I think we've found this. It works pretty well because the kids just take up a broom and they have to so. We've been working with there's a connection problem. That's okay! Maybe we could just proceed. Can you hear yeah, sometimes you're? Okay, so maybe just keep trying I'll try. Thank you for your patience. You know having our own cleaning equipment at the skate park is very helpful because the kids just take up a broom and clean the park as needed, and we're very grateful for new york city parks department. Working with you know, partnership parks and we've since established a a job box or a large mess up where we keep clear equipment, and it's worked out pretty good and we're trying to get this at more skate park at the moment. So we've kind of gone off that a little bit at the moment we're focusing on other registration at them at the skate parks. At the moment in the in these coming weeks, that's really been our focus to get the young people to get the skaters who are of age to register to vote. That's really our focus at the moment, so we've kind of stepped away from the skatepark cleanups. But you know skateboarding, is you know great activity? You'll see, I'm no kid, you know, but I enjoy skateboarding and if you go to the skate parks in new york, there are people from ages 6 to 60.. It's quite a oh! That's great! You got some pictures here of golconda. Thank you. That's really great! Thank you very much, yeah yeah. So we are, you know, so we're focusing on the vote. Voter registration at the moment the couple of things that needs, as you mentioned earlier, you know that there are two particular issues at gold: condor skate park, current issues. You know we're actually quite fortunate having the bathrooms there, but unfortunately they're only six months of the year. So if they were, you know winterized or if they could be open throughout the winter. So there wasn't a freeze problem that would be. That would be really great, and I see the mouse is highlighting the bathrooms here so and it's a terrific facility there, it's really it's really great, but you know having the bathrooms. There would be really good. It's actually strange enough. It's particularly important because you know skateboarding is a physical activity and you need to you need to hydrate. Of course you need to drink water, and you know having a bathroom, there's good, make sure you just keep drinking, you don't mind if you have to run to the bathroom, so it's kind of it's kind of important to have a you know: bathroom facilities at a skate park at a place where you're doing physical activity. We have another issue there that we gave it some attention. We didn't really get as much of a result on this. It's the bridge that runs overhead. There is the highway that runs above the skatepark and that particular highway. It has. You can see the decks from these pictures. The yellow steel beams above the skate park, and there is actually a drainage there that the water from the road above is carried away by drainage pipes, that there are large drainage pipes, probably about a foot in diameter, if not larger, large steel, drainage, pipes, overhead that carry the rainwater off of the bridge and those pipe pipes leak so badly. So we get a heavy rain that the rain falls onto the skate park, and not only does it the water come down, it also brings the sludge down from the road above it brings like rubber and oil. I'm not sure what it is. It's kind of gross it's dark and sticky, and it kind of messes up the park a bit. So you know if we could have you know that sealed up? That would be really good. I think it's quite a big job, though I see we and it's a DOT issue from what I understand. It's not a parks issue. It's the bridge, that's the problem, not the park at all, so yeah, so that that's kind of what we, what we do there at golconda we do stuff at other skate parks. This picture here is pretty good. Actually you can see the we lost it there. Sorry there you can see the drain pipe very clearly. You can see how big that drain pipe is amount of water, the amount of volume of the water that's designed for and the water comes down that drain pipe and it should exit at the bottom there. You can see the opening where the drain pipe meets the ground. Virtually no water comes out of that bottom because it all leaks out before it gets to the bottom. There's a hell of a volume of water that leaks from the joints above and it's literally quite a waterfall that comes out and again the water's, not so much of a problem because it runs off it dries. But it's all the sludge that it brings down with it and it just you know we have to scrape it off with a shovel and it's so it's just a problem. You know, so that would be great if those pipes were what were connected- and I guess the gaskets that go in there are something that should be correctly installed and it would, it would work fine, but it's really nice facility. You know we're very grateful to have this. We're also fully aware that you know in this time of you know financial difficulties with the city. You know the funds are very tight at the moment, so you know we're just very grateful to have the skate park at all this picture. Here you can see on our left with the group. This is one of our clean up days, so we did a. We did a cleanup at the skate park that particular day a lot of people came out and we actually, this is Brooklyn skate garden. We did some work with the Brooklyn skate garden and, and that was there we go and there's commissioner mayhah. You can see commissioner mayha there with his sunglasses on that's him and I'm there just to the commissioner maha's right, like four people to the right, with my booney on the black beanie on yeah, so that was a good day and then the just a little thing about the skateboard community. It's a really great community and you one of the things I've discovered. It's really interesting. We've been doing this voda registration at different skate parks in new york, mostly in Brooklyn and including gold cumber, and it's really great, to find most of the skateboarders are already registered to vote. You know, which is a nice surprise, so it's kind of it's an interesting community. So I think that that's everything I thought of covering I'm not sure if you have any questions at all or and again, thank you very much for your interest in our in the in the skate park itself. Ian. Thank you, and you started talking a little bit about something that I was going to ask you about the skateboard community there, because I know you get a lot of people who come there on a regular basis. I know when we were there. You know there were kids there with their parents, and so it really appeals to people of all ages. Do you do any training there any lessons or anything? Well, casey? Who, unfortunately, is not with us tonight? He does. He teaches lessons there, there's a few skaters that teach lessons, and these are you know some of the kids like to be given some leads and shown how to do things. Some of the kids just learn it for themselves. They just watch what everyone else is doing and they figure it out for themselves. Okay, all right, so I'm gonna turn it over to members of the committee. If you have some questions for ian or any interest in doing some skateboarding, it's never very light. I'd just like to make a comment: if I can what's candice header and episode, we can go first, lenny, okay! Well, I think I'm on you again! No, you were you know now you're on mute. You were okay before okay, there you go. Okay, we don't live too far from there, my wife and I and I think thursday night. We took a walk down, we just happened to pass it and he said well, look at this is really nice place. I mean it. We didn't know where I didn't really know. It was a skateboard park here until I walked down gold street a little bit before. I would have made a turn off the highway to get back to where we live, but it looked very nice. There were a lot of kids a lot of older people there. I did see a guy in his 30s, maybe 40s that was instructing a six or seven year old kid, and I was very impressed with it and this drainage problem that you were talking about in struck me interesting, because my wife is an architect and she tells me about a lot of her projects and I don't know if they used. They do any DOT projects to her office, but I do know they do a lot of sanitation department of sanitation projects, and it strikes me as these are projects that earthworm does other firms architectural forms they go through with engineering and all that, so whatever has to be done, architecturally and engineering-wise. It's not an undoable thing from what I can tell my limited perspective of seeing what my wife's company was. I don't, I guess I'm just saying that it's as a pep talker of us about it, because that is to me, looked like a huge problem, but it looked like a fixable problem, so I don't know if that helps by saying the dlt needs to look into it and go through the channels of an architect and an engineering firm. But that's all I have to add to you. Okay, candace, do you have a question? Yes, so my question is: how many, I guess current members, do you have of the skateboard correlate coalition and like how does one become a member of the coalition good question? Well, you can email us we're. We've got a very small membership, we're not about so much having a large membership, we're more about having a few people that are very active and that's kind of how we get things done, as you probably testified. A lot of guys are. You know your doers in the community you you're out there doing stuff, which is which is incredible and, as I'm sure you can all testify, it's usually one or two people that get do all the heavy lifting right and that's kind of how we you know- and we gather people together for events which are really good, but on the back end, it's just a few of us that are doing most of it, but you're very welcome. You know my email is up here. I think, and our website as well and please feel free to reach out we'd love to have any help at all. And now our main activities are really. You know. We advocate for skate parks in new york, golconda being one of them and also we put on events we put on skateboarding events, and we also you know to try to maintain good relations, relationships with parks department and we're very grateful to commissioner mahar as well. I should mention that he's, commissioner maher is the best he's been so good to us, a terrific guy, really great guy. So we're very grateful to commissioner maya and the community boards as well. Of course, all right candace did you have something else? I'm saying. Oh, no, I'm just saying thank you. Oh okay, great barbara, any yeah, andrew just a comment or two on galconda park, used to be nothing else, but like a small place, parking facility and sort of a dog where the department of transportation used to keep their vehicles and other equipment. It is just a mark that suggested to them as soon as they were ready to clean it up that they did as much as possible and that part was created because you couldn't have another park there, but you know skateboarding isn't affected by the roadway upstairs. However, it's more that could possibly talk to dlt, hey guys, come in and finish up the dirty that we came from now, because he you know he worked with them to get his heart fixed up. So you know he probably has a good relationship with the people that work with him before to move out of their create escape. Skateboarding part. The one other thing that I wanted to mention is, I don't know if you guys have any influence at all, but fort greene park around the monument itself was having a lot of skateboarders just using the skateboarding all around that sort of that memorial area of the 14th part, there's always a question for something somebody could get a hold and talk to the skateboarders there that are doing it improperly to get them to leave there, or do it more correctly. So they're not they're, not creating a hazard for the people that are enjoying the park, because they're skateboarding they're all over the place using a facility. That's supposed to be a memorial right, yeah. We're very interesting points there. Your first point about the the bridge and the DOT. Certainly you know we think skateboard parks are really a perfect fit underneath the bridge. It's perfect because often times, there's nothing else there than just a car park and it provides this natural shelter as well, which is which is perfect as well from sunlight from you know the weather and everything so the bridge and skate parks are actually a really great mix. That are some a lot of cities in America have found this. You know in new york. We tend not to do that else. The goal condor is the exception, but we would, we do think, there's a lot of unused space under bridges that could be utilized in new york, especially in Brooklyn. That would be perfect to your second point about the the monuments in fort greene. This is an issue you know, because the monuments in new york are often made out of some beautiful exotic stone work, and you know they do get used by the skaters, because, unfortunately, when these things were built, they were actually unwittingly built to be the perfect skateboard, ledge and they're built out of these fancy stones. It's homework so they're kind of like you know they really are, as we say in the skateboard that they're a perfect spot, they're really great. So you know, but better skate parks, kind of draw the skaters away from these places, but they're there. You know that is due right across the city, and I do speak up on that to the to the skaters that you know we should try. Not to use these monuments as much thank you possibly use the skateboarders from art, invite them to work with the kids at calcanda and maybe teach them just can't, go in there and tell them that you're not supposed to be skateboarding at the at the monument in fort greene park. You know you're just not going to win that battle, but inviting them to go work with the kids out fell condo. You know that might just be a draw to some of the kids that are there and say you know what maybe I'll, give the kids their chance and teach you something. That's like I wish you would someday again. This night might not be the issue anymore, but all around ask your place. You know the state was in this city in Manhattan. It was like a disaster, they were very unsafe and they were very dangerous to the pedestrians. I don't know what's going on now with the pandemic, because they were listening, but I think the way to do that is to reach out positively. I think that's a good idea to be positive. You know we also have a lot of skateboarders columbus, where columbus park meets borough hall, and that area is very inviting for the reasons you were we're talking about it, but I liked your idea about trying to put a positive spin on it. That's the only way to get them right. So is there anyone from the community board? Who has a question for ian? I don't have a question. I do have a suggestion, which is that dlt, as we all know, is always loaded with projects. The issue becomes. How do you get them to prioritize? A suggestion is that if you can take pictures of the condition on the roadway when the affluence has leaked on include that as part of your outreach to dlt, as well as if you have identified spots in that pipe that actually leak before it gets to the drain, that would be a motivating factor would also make it easier to explain to the elected officials, for example, because they sometimes are asked to contribute to some of these projects. So just a way of getting people's attention is to be able to present the condition when you're talking about it. You know I was just that made me think of something else when of the participatory budgeting. You know when that comes around ian. Maybe you should put in suggestions there related to the park and that might be a way to get some things funded. So is there anyone who's not on the community board? Who has a question for ian? Excuse me all right hearing no questions, then or comments. I think ian we're gonna. Thank you. You're welcome to stay for the rest of the meeting and I hope people attending tonight. If you haven't been over to the skatepark park, you should go check it out. Even if you're, not a skater, you might be become interested, but it's fun to watch others do it, and it is it's great that there is this group and there are a group of dedicated skateboarders who use it and use it year-round. So barbara, can I roller skate there too, just kidding you have to ask ian. I don't know that's like well at any rate, so that gives brings us to the chairperson's report. I did want it. I had some notes about the city parks, but I can't find my notes, but, as you know, if you looked at our minutes from June 15th, it was all about what was not open and now gratefully the parks are open. Of course everyone is asked to wear a mask and I think we we've talked about the problem with garbage from time to time in the park. So if you can, you know, I think it it's good. If you can take your garbage with you or make sure it goes into a garbage basket in the park. I think the parks are more important than ever right now and I think we're fast approaching the time of year when it may not, everyone may want to be in the park because of the weather, but you know, if you bundle up, you can still get to the get to the parks and it's great to have them open, rather than having that list of what was closed. I think indoor pools are not open. I think some outdoor pools are open. I don't know if they still are, but they were and, as we know, events are kind of limited at the moment. Then I just for informational purposes. Yesterday eric adams coordinated a memorial to justice, ruth bader ginsburg there right outside of borough hall, it was very moving. There were a number of speakers, a very diverse group of speakers. The president of the women's bar association, chuck schumer, spoke briefly joanne simon spoke, brett kavanaugh spoke and the the public advocate and a number of other people and some music was played. It was really quite something and a point was made by one of the speakers in a very well. I guess eric adams also talked about it that I don't know what happened. It was about a little. Over a year ago there was a big movement on to name the municipal building in honor of justice ginsburg, and I don't know what happened to that, but clearly eric adams said it should happen this week and the mayor should move forward on it, and I think that would be a great idea. Brooklyn someone, the dean of Brooklyn law school, mentioned that they are going to name a a professorship in her honor and I don't know about anybody else, but I spent a lot of time this weekend crying and there's this jewish expression. When someone dies that say, may their memory be a blessing? Well, I saw somebody's email today. That said, may her memory be a revolution, so I just wanted to share that with you, and certainly you know one of her. One reason everybody here loves ruth bader ginsburg is that she grew up in Brooklyn, so we certainly claim her as our own. I also wanted to mention if you haven't filled out the census, please do or if you know, anyone who hasn't it's so important and with that I will turn it over. Does anybody have any other business to discuss at tonight's meeting? I one other thing I forgot as usual. Please contact andrew myself and taya. If you have suggestions for future meetings, if there's a park, we haven't focused on or a playground. You think it's time for us to talk about or any other issues or issues that you see going on, and so then other business any other business here and then we'll get to community forum. John lennie, yeah suzanne was late to the meeting. I don't know. If you mentioned, I sent you a an email barber about the right problem, right which we referred to the district office and they're following up on it. Okay right, I think that was in commodore, barry, right, yeah, okay, so and suzanne yeah one announcement and just two administrative questions. I was just. I was made aware of a I've, been hearing a city council hearing this week on sort of an adjacent area, the committee on sanitation and solid waste holding their hearing on street and sidewalk cleanliness. So that's happening on the 24th, which I guess is thursday at one o'clock. If folks are interested in participating remotely, so I wanted to mention that and then from administrative perspective ty. I don't know if you'll have the answer for this tonight, but do we are we in motion to get the committee minutes up on the website or barbara from an executive committee perspective? If that's been discussed suzanne? Are you asking about the archive yeah? Well, yes, and even even the more recent minutes you know from last night, so we're transitioning to the public google drive and the goal is to have. I think we have to go back seven years. Wow has data for probably 10 years. It's actually a project that I'm working on right. Now, if you go that's a big job. Well, it's not big! So much as a little bit tedious. If you go to our this is the easy link for the new public drive. So if you go there, you'll see that 2020 is up so far and we're just gonna work backwards chronologically, so we've got 2020 done. We just started on 2019, but hopefully, by the end of the year everything yeah the office will be up and will the link to the public google drive be accessible via the website? Yes, okay, that's actually a great question. So this is also in tandem with there's. That's the small project. The middle project is updating the website for the first time in many years, actually suzanne. Your name came up because mr singletary would like to convene a few folks and actually barbara. I think you as well that have had comments about the website updates. In the past. We both professionally oversee websites right so yeah. Actually I work with the person who does larger digital strategy was addressed at the large at the last generation. The budget and the staffing is going to be discussed at the finance and personnel meeting later this week and the overall website plan, I think, will be brought up at the next executive committee meeting, which is next week. I believe so you're we're all on the same page awesome. Well, I'm happy to help, and I have good availability right now. So just just give me a shout on that and then barbara, just in terms of members for this committee, because you mentioned the quinn will be rolling off right or has rolled off. Where are we at and can we can? We should we seek new? He was a public member right, I'm always encouraging people to become public members. It's a little easier. I think when you see people in person, you introduce yourself and say well, come back again, you know. If you attend three meetings, it's a good chance. You could become a public member, but if you, if anyone not just you on the committee, knows someone I think dwight dragged jennifer. I think that's how she got here and you know if you know anyone who might be interested. Please have them come to the meetings and we certainly do could use some more members. And you know if you know, if anyone knows anyone invite them yeah even from the communications perspective, so yeah, because I knew- and I that has always been my sense from you barbara. It was just interesting for me to learn that not all not all the committees, just for you there's more there's more board members on other committees, so they don't have the vacancies as much but on our committee just the confirmation that we do have the vacancies and the opportunity for people to get involved and become public members. So I think it would be definitely great for us to do some outreach and get some right. Some fresh park users. Well that was at the general meeting right where taya you did that presentation on yeah, so we're going to be hitting at some point social media, and so I think, that's a perfect place to promote something like that yeah. It would be it's not a website and on the website. Certainly, so I also have been trying to remind all of the committees that there's the public membership is a ad hoc. There is actually an official complete seat. One of the appointments from lori kumbo's office is currently vacant. So, in addition to always having room for more public members, there is an official vacancy in the kumbho lane as well right for the board for the board right. So, okay, anybody else have any other business from committee members, so we're gonna open it up to community forum. I know john you're eager to speak, does. Is there anyone else who wants to speak during community forum? We give you a few minutes. Anyone who's attending the meeting. Who wants to speak all right? All right, john? You have the floor, I'm not eager! I'm gonna speak anyway. As I said earlier, the myrtle avenue side of fort greene park is in the myrtle avenue business improvement district. The bid provides the maintenance for a great portion that poor part of the park, in addition to whatever the park provides. The sanitation pickup, though, has been a problem. It might be in the process of being corrected, but sanitation had decreased. The number of pickups of the garbage bins from I think like six weeks down to three so that created an immediate problem on the avenue, in addition to a rat problem, which became quite obvious. So we are monitoring that there's not much that we can do directly to excite sanitation to return to the normal pickup route, but we do understand that some of these services are being restored, so that would be helpful, but that has been very contributory to the rap problem. John, with the hearing on thursday direct, it seems like the hearing on thursday may directly. You know maybe an opportunity to voice that publicly to the larger sanitation crew. Okay, you have a issue. Irene is the renovation of the 14 park. You have an update on that and I and do you, have any information on the apparent lawsuit that I hear is being discussed about the bathroom not be included in the upgrade of the park. John, I'm sorry, I didn't hear the first part of what you said. Do you have an update on the lawsuit that has prevented the myrtle avenue side of the park from being upgraded? You know I was looking into that recently and I don't have a definitive answer right now, but I will get one and we'll get the word out on that because you're not the first person. I forget how this came up a few weeks ago. I asked about that. Oh you, andrew, but the whole thing is that the parks department can't talk about it, because it's immediate, no we're not going to ask the parks department about it, we'll find out about it. Some other way see where it is. My guess is you know the courts have been open throughout the pandemic, but not completely functional, so that may have contribute. It may kind of be on hold, but I don't know, but I will look into it and try to you know get word to the committee and you john, because I know your email address, I'm very familiar with it. You should be, you could say it in your sleepover. You keep me posted and the other question was the restroom that is in the lower level of the park as to whether or not that's going to be subject to a lawsuit to compel them to include that. I'm not suggesting that it's going to be I'm hearing rumblings, because you hear those kinds of things in the community. You can't necessarily run with it, but, as I understood it was not included in the current renovation project. Is that your understanding? Yes yeah? I don't remember any discussion about that. Okay, you know, bathrooms are usually the last thing they focus on right, but if it's not included in the renovation, it's not even in the pipeline, we have, we do kevin. Are you still there? Kevin has been maybe kevin. Should we turn this over to you for a minute. You want to give us a quick update, based on what you know sure I'm my name is kevin duggan, I'm a reporter. With the Brooklyn paper, I wrote about the fort greene park renovation. What's the date, it was like last week, essentially, parks with parks withdrew an appeal against a judge's order which was stalling the developments that happened. I think late July. They withdrew an appeal, so they basically parks has to prove to this state judge how their renovation is basically just regular maintenance which they're trying to say it's just regular maintenance, so they can get around going through an environmental review and they have not told me how they're going to adapt to just so they haven't told me how they're going to prove that is just regular, routine maintenance. So that's where we're at right now. I should try to find out more, but they wouldn't find out, but I know that a bunch of local, a bunch of locals, including 14 association, I think, are friends of four queen park trying to get all the documents they can from the city on this, like freedom of information and other public access to documents. So it's not a lot of updates, but you know I am writing about it, and I know these people are trying to find out more as well, true, otherwise, well kevin. I really appreciate your sharing that information. Andrew you had a question. I had a question, but you know the parts department cannot talk about it now, the forcing conservancy, I don't think they're a part of that lost answers from them at our next meeting. Maybe they could give us just a reading unofficial reading and yes, john, the bathrooms were not recruited that there will be a lawsuit, but clearly it's an issue. That's floating around out there that you should be aware of any other requests to speak at the community forum. This evening, nice question sure to my colleagues. So in the parks is the sanitation in general, overseen by sanitation or parks, has their sanitation. They collect the garbage in the parks, okay locations where they deposit the sanitation outside the park. I don't know myrtle avenue, but it's very visible on the detailed avenue side they actually sort of built like a bin around that it looks like the part of the wall. I cannot speak about this that will be diverted to the north side of the park and then and then park. Sanitation comes in and picks up from that kid. Okay, so maybe so it's a little yeah, because it's the article that you've shared taya- it's like sanitation, is sort of anchoring to garbage in the parks with their cuts. So it confused me so they it sounds like they do pick up from the parks after that, no they don't even pick up from parks. So it's confusing the parks department has their own sanitation group right. They have their own station trucks. Okay right. I think marty has talked about that at our committee over time. Yeah it- and I think the big thing now will be leaves. You know, in addition to garbage so yeah all right anything else before we move towards adjournment. I just wanted to reiterate: if you have any suggestions for meetings topics, please let us know we're always looking for those and you know enjoy the parks while it's still the weather is still conducive. As you learn tonight, you can go skateboarding 12 months a year. So if you want to be out and about you might consider that as something I think kevin's smiling, maybe he's going to do it all right. Do I have a motion to adjourn all right all in favor anyone opposed okay, all right, we will see you next month. Thank you. Thank you thanks. So much. Thank you for everything. Everybody have a good night.",
            "summary": "As you know, committee of Brooklyn community board two we're calling the meeting to order it's being recorded.\nSo with that we're going to turn it over to laura romanos who's, the co-founder and executive director of fotoville and elizabeth masela, who is the senior public art coordinator for new york, city, parks?\nI am here to share we'll introduce laura, really because she'll give you all the good details and photos of the exhibition, but as you're, probably all familiar with photoville, which has traditionally taken place in Brooklyn bridge park every year over a couple weeks, this year, we're kind of taking it to all five boroughs.\nA number of banner exhibitions on washington street in the past was the first time we've done it on fulton street, as well, and you'll also find the exhibition in Brooklyn bridge park.\nPublic, art, community education and We actually had a gallery in dumbo, but right before the pandemic, who knew we decided that we were really doing so much public art that the gallery was kind of falling on the wayside and as a very tiny mom-and-pop like small non-profit.\nWe also have the fence, so you've, probably seen every summer in Brooklyn bridge park, we've had 40 visual stories in the park and we now in 11 cities across north America in a few weeks, we'll be installing in atlanta, in durham and denver and again we're very tiny.\nWith a few other colleagues created this amazing celebration of community heroes, especially in commodore barry park and fort greene park, and it's really special You know she's one person and asked us if it could come under our umbrella that we can help give her support and resources.\nWe had their photo directors really being thoughtful about the kind of work they chose, and then we invited a lot of the colleges high schoolers, independent, curators artists, and so it really was, This kind of way of people may show up because they heard national geographic, But they're walking away talking about that local Brooklyn, photographer they've never heard of before so earlier.\nWe had some indigenous folks come by a few days ago and do a blessing which was really lovely, just kind of going and we're also in times square, so elias williams, a Bronx photographer biked all around new york city during the pandemic, photographing graduates, so from four-year-olds to high schoolers to college We're in Queens astoria park.\nWe worked with the queen's museum and this is a collective of migrant women, and these are the ladies who are in these photos who crochet This has been very popular in Queens You know just down in Brooklyn bridge park again some of the photographers or Brooklyn Then we also have a lot of online sessions.\nSo in the month of October, free virtual field trips, where teenagers so we're encouraging educators, but also parents, because we know there's a lot of young people being homeschooled right, now.\nYou know we're doing everything we can to make this work, but it is so special, and I was I was telling about I biked out to the park and stalking people looking at the photos and going Like the next two months of sleepless nights , it's worth seeing how people are connecting, and even some of the conversations that parents are having with their young people about certain things that are going.\nDo I'm, a member of the community board, I'm, also on the Brooklyn bridge, park, conservancy board for 10 or 11 years.\nYeah I've reached out to Brooklyn bridge park to come up with some programs that we could potentially introduce to the residents of fort greene, and I'm.\nIt's a lot in Dumbo right near st anne's and around the timeout building, I have to run because I can hear my kid, but I I, as you know, suzanne and I visited golconda skate park, which is not far from commodore.\nWe put we added there- the goal to winterize the bathrooms in the park because it is used all year round, and so we had asked ian, who is from the new york city, skateboard coalition, to come and talk to us about the park.\nYou can tell us how the group came together, what you we cover across multiple skate parks in across the five farmers of new york, new york city, and you know, we're very grateful to be involved with golconda skate, park, and I We, really appreciate the community boards of new york and the volunteer work.\nYou know having our own cleaning equipment at the skate park is very helpful because the kids just take up a broom and clean the park as needed, and we're very grateful for new york city parks, department.\nAnd if you go to the skate parks in new york, there are people from ages 6 to 60.\nWe did a cleanup at the skate park that particular day a lot of people came out and we actually.\nWe did some work with the Brooklyn skate garden and, and that was there Just to the commissioner maha's right, like four people to the right, with my booney on the black beanie on yeah, And, then the just a little thing about the skateboard community.\nWe've been doing this voda registration at different skate parks in new york, mostly in Brooklyn and including gold cumber, and it's really great, to find most of the skateboarders are already registered to vote.\nThank you, and you started talking a little bit about something that I was going to ask you about the skateboard community there, because I know you get a lot of people who come there on a regular basis.\nOld, kid, and I was very impressed with it and this drainage problem that you were talking about in struck me interesting, because my wife is an architect They do any DOT projects to her office, but I do know they do a lot of sanitation department of sanitation.\nOne other thing that I wanted to mention: is, I, don't know if you guys have any influence at all, but fort greene park around the monument itself was having a lot of skateboarders just using the skateboarding all around that sort of that memorial area of the 14th part So they're, not they're, not creating a hazard for the people that are enjoying the park, because they're skateboarding they're all over the place.\nCertainly, you know we think skateboard parks are really a perfect fit underneath the bridge.\nYou know we also have a lot of skateboarders columbus, where columbus park meets borough hall, and that area is very inviting for the reasons you were we're talking about it, but I liked your idea about trying to put a positive spin on it.\nYou could become a public member, but if you, if anyone not just you on the committee, knows someone I think dwight dragged jennifer."
        }
    }
}