{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB2",
            "channelId": "https://www.youtube.com/channel/UCbkNpO906o11EDhP252p_1Q",
            "title": "October 2020 Quality of Life Meeting (10 /5/20)",
            "publishDate": "2020-10-06",
            "shortDescription": "1. *Street Activities:\\n\\n\\n10/14/20 - 10/19/20 - MOCA Workshop and Window Exhibits (Museum of Chinese in America): Howard St. between Centre St. and Lafayette St. [sidewalk and curb lane closure - both sides]\\n\\n\\n11/15/20 - Pride on Astor Fair (Pride Democrats): Astor Place between Broadway and Lafayette St.  [full street closure] (event has been denied by SAPO)\\n\\n\\n *FYI Renewals:\\n\\n\\n11/23/20 - 12/24/20 - South Village Farmers Market (David Gruber): 6th Avenue between Carmine St. and West 3rd St.\\n\\n\\n2.  *Discussion of Expense Budget Priorities for Fiscal Year 2022.",
            "lengthSeconds": "0:47:20"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB2",
            "normalizedName": "Manhattan Community Board 2",
            "twitterName": "Community Board 2M",
            "youtubeChannelName": "Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC3kEY0n-RPRYE6rOlfstFDQ",
            "twitterHandle": "@CB2_Manhattan",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "J_GZnFIjrF8",
            "fillerWordCount": {
                "uh": 60,
                "um": 126
            },
            "readTimeFullTranscript": "29 min read",
            "readTimeSummary": "4 min read",
            "wordCountFullTranscript": {
                "street": 28,
                "space": 21,
                "sidewalk": 13,
                "museum": 13,
                "language": 10,
                "event": 9,
                "lafayette": 9,
                "request": 8,
                "fire": 8,
                "exhibits": 8
            },
            "wordCountSummary": {
                "space": 10,
                "street": 7,
                "window": 3,
                "museum": 3,
                "fire": 3,
                "left": 3,
                "lafayette": 3,
                "workshop": 2,
                "closure": 2,
                "pedestrians": 2
            },
            "fullTranscript": "So welcome everyone. My name is Joe Gallagher, the chair. Oh well, let's wait for Nancy to cut back in there's our one applicant, so she can hear this info joe. While we're waiting. Can I ask you a question about the application, the other application for the pride event that was crossed off the agenda? Have they withdrawn or did SAPO what happened? I yeah I'm not sure of the particulars, but I bet SAPO. They had a discussion with SAPO and then maybe it was not consistent with the Covid-19 guidelines that that's just my guess. It was the Covid-19 guidelines. It was not necessarily about the event. It was just the event taking place now. I really do not know that was just my presuming, so I'm wondering if we can ever while we're just waiting another minute, get a clear statement of policy from staple as to what they are allowing and what they're not allowing given the fact that there might be a second wave coming. What can we as a community would expect Joe if that's possible? Perhaps we can do that at all yeah Bob and I have been trying to get someone from SAPO to come and speak, but I think they are also kind of not quite you know. I think it's touch and go for everyone at this point, but yeah. Thank you. I'll follow up with SAPO to try to have someone come and speak great. Thank you all right and I see our applicant is back so thanks. Everyone welcome to the quality of Life committee meeting of Community Board 2. My name is Joe Gallagher, I'm the chair, our other members are here on zoom, so you can see Edma Michael, Levine, Susan, Kent, Brian, Pate, Linda, Azer, a public member and rocio sons. So we hear applications for sidewalk activities and sorry sidewalk, cafes and street activities and other quality of life issues. We are asked to comment on certain applications by city agencies. We recommend approval or denial and then send that on to the full board, which we'll be meeting next Thursday. I'm pretty sure is that right carter next Thursday via zoom, and then we send on our comment our recommendation to the city agency and they will use our recommendation as part of their process for determining whether certain applications are approved or denied. So to we have a small agenda tonight, I'm going to share my screen so that we can all be on the same page we're starting with this first application. So they were on our agenda for last month for the MOCA workshop and window Exhibits Museum of Chinese in America on Howard Street, between Center Street and Lafayette Street, and it's for a sidewalk and curb lane closure for both sides. Unfortunately, the notification for the meeting to MOCA went to their spam folder, so they were not aware of the request for an appearance and, as is the case always when an applicant does not appear, we recommend denial, but Mocha then reached out and asked if they could come and speak to us this month to hear the particulars of their application. Unfortunately, the full board is meeting just after their event is starting. So we're here tonight to hear the details of it and we can pass a resolution, but it won't be timely. The full board will get the resolution, but it'll be during the event. The events already happening, and I think we have Nancy Yao Mazbach from Mocha who's here to talk about the application I'll open that in a another window, are you there nancy? Can you hear me I can hear you. Oh great. Welcome, I'm sorry about that. Snafu. With last month's meeting, I had the opportunity that our re reopening working group met two weeks ago and nancy. You were a part of that panel that spoke about museums in our community that are about their. You know, difficulties or they're dealing with, or the reopening plans appreciate that you were at that meeting and thank you again for coming back tonight to talk to us about this application, but I'll give you the floor if you want to just describe what what the event is and how it's operating and how you're dealing with Covid-19 restrictions etc. You know wonderful, thank you so much joe and I recognize a lot of you from that conversation. We had a couple weeks ago. So thank you for giving me the opportunity to come back and I'm so sorry. I do not know yeah. I definitely show up so I was like oh, I felt so doubly sort of upset about. You know not getting the notifications and spam that to give the impression that the museum is not, you know a committed member to CB2, which we certainly are no not at all. I think it's an I mean it's a weird. You know it's a new email address for people to receive, so it's I'm sure it's yeah right but like in some. I just think we've the museum of Chinese America has suffered sort of a number of looming and active crises and I'll just name three of them in particular one we did have this fire on January 23, at our collection space, where 85,000 items were in jeopardy. They have been moved to four different places over the period of time since then, but the Good News is. I wanted to share, especially with cp2, is just today: we've taken additional space at 3 Howard street, where yeah we've opened up 4,000 square feet of temp space, and we have it really nicely done with a young architect who has helped us to outfit that space and as I was you know, preparing for this meeting. The items started coming back from those four places and convening basically into that space yeah, so that space will be used for repair and conservation of the 85,000 items. We're naming the space the workshop and it's meant to be a window into conservation, also to help really yeah build the character of the work that we do, but also for people who pass passerbys pedestrians to be able to look in, and it's a welcome public space. Obviously now with Covid-19 we're doing it in a time slot. So people might need to wait a bit, but we're definitely inviting people into that space and the MOCA Workshop is also the library and research center. So there'll be active public computers that people can use as well as housing and conserving the space so we'll be on both levels. The main floor and the second floor is the space that we've taken to help just repair that and the repair to just let the CBT know is a six year process. So it's not something that happens overnight and we already have a three year lease with an option to renew for another six years, so we're expecting a pretty near to midterm stay in that space in large part, because we want to stay committed to CB2. Our main building at 215 Center street also opens up to lafayette, is in CB2, and we anticipate that we will be renovating that space in about three years time. So that's something the one that was on the fire affected, one. No, the fire is actually in CB3, that was on Mulberry Street. Oh sorry, our main museum that has 50,000 visitors a year is at 215 center, which is right around the block. So what our request here today is actually slightly abbreviated from the space, but it depends on how much time one would allow for a setup, but the active time, slotted, socially distanced, hope for Friday Saturday Sunday, which would be October, 16th, 17th and 18th, is to have socially distance units. Come every 15 to 20 minutes to basically see an insulation of window exhibits. Many people have talked about their reopening plans for museums given phase four, but I think those are the larger museums, and I think CB2 in particular has been very sensitive because it has so many small culturals that do not have the width and the space to really allow for efficient use of a reopening. So we've been trying to act creatively to help. You know also engage the community in this very difficult time for everyone, especially as mental you know, pressures are mounting to give somewhere a destination for people to go. So this is a free non charged event, but the windows are getting installed right now, both on center street, which is a main opening to the museum. We have about 60 feet of frontage and we're installing exhibits and then on lafayette, which you may know that we also have about 60 feet of frontage. We're installing window exhibits. This exhibit is called windows for Chinatown and it's meant to be sort of active on dialogue with the broader community about some of the racism. That's happened toward Chinatown in particular, given references around Kung, Flu and chinese virus and the impact that's had on China towns all over the country, but more particular in the one, that's neighboring CB2, and trying to give some of the positive components of what has happened since March 15th. So we've been collecting a number of stories of efforts, acrosss vast networks to provide Pp, safe, just devices and equipment that people have needed, PPE to hospitals and using this vast transnational networks of Americans and Chinese to be able to source some of those very necessary supplies, and we have these amazing stories of these people working together and also young people really trying to activate and create a voice around their own identity in this space, where they're dealing with racism for the first time. So these exhibits will basically be telling some of those stories and highlighting them for anyone who passes by. But we did want to have sort of like a formal launch of it on Friday Saturday Sunday, with stanchions keeping close to the frontage, so that I know is possible and permissible by DOT and then also having them start at 215 center go down the plot to Grand Street, make a left onto grand Street then make a left onto lafayette and see the exhibits on lafayette and then make a left onto Howard Street. So the request to close Howard street is part of a broader initiative for us to bring people back to the community to take a look at these exhibits and then also with the MOCA Workshop opening at three howard for them to reconnect with the fire, because I think a lot of people in our broader community had a lot of emotion around the fire. That's not just chinese Americans as anyone who understands their ancestry and the value of collections and the stories that those artifacts hold. And so we have received a outpouring of support around that and we wanted them to know that we were able to collect those things. So those will also be socially distanced in 15 to 20 segments of no more than four people and one unit visiting the space to see that we were able to bring back the items and then they would hopefully then also to try to help develop the patronage of Tiger restaurant that just opened at one Howard street. We have connected with them and in partnering with them that they would give special discounts for anyone who said Mocha or Mocha collections or something along those lines, they're deciding what that might be and to they have 85 seats of outdoor seating and obviously some capacity indoors with the relaxing of the restrictions, and that they would also help them bring some more patronage to their restaurant. Since they've been suffering so much with the opening just a few weeks ago, and also bringing them back to CB2 so helping to establish a destination in CB2 that might help further us to create that concept of CBT. I kind of like played with this like CB2 Bc, like c for culture like maybe you could do a progressive arts and cultural thing once all this craziness ends, and I really think with so many amazing museums and CB2 it'd be so awesome to like. Just do that. So I think we're trying to do less than the application had originally thing. We'd really just want Howard Street requesting that to be closed from between center and lafayette and that's you know to just make sure for safety purposes. People feel comfortable, but at no time are we expecting more than 20 people at any place, because we know that we can't manage it, but we'll be giving out face masks if they do not have one and we will be. We have a sanitizer also when people slide in, but we will be reserving slots online prior to those days and it's so it's a street closure, then for howard, you said between center and lafayette and then is there still the sidewalk and and curb lane for Lafayette Street 147 lafayette. We were going to keep within the prescribed three feet of the frontage. Okay, you know we're sensitive to the other restaurants on lafayette. Also, there's a starbucks now there, as you know, and my favorite, you know Lecture K is there and I know that they have seating there, so we want to be sensitive to other people's needs there. So we wanted to stay to the frontage and not crowd that Pedestrian walkway and the frontage is moving the people through to look in at the window, exhibits and keeping exactly just keep moving and not overcrowding it so if they do not arrive at their slot, so we would encourage them to ride 15 minutes ahead of time. If they do not arrive within that period of time, we would give their slot away. So there's no exception to that. They can always see it on another date, but we're not going to make any exceptions to that safety. We only have a 13 person staff and we'll all be working it for the three days, so we're trying to protect our team as much as we're trying to protect other people right- and you said, and so will it be in 15 minute increments- that people are reserved exactly if we're looking at between 15 and 20, so we're doing a test run of it in the next couple of days. We did one already and 15 minutes seemed okay, but it also depends on weather and so we're kind of trying to figure out once we get the 10-day forecast. If it calls for anything, that's tricky weather, we might end up doing 20 minutes, because people will probably be slightly. You know over. You know delayed and they'll be staff, I guess throughout just kind of moving keeping the queue moving or keeping people moving absolutely, and we have a really good team of people who are very versed in that and when there'll be markers and way, finders on the street there'll be people at the corners directing them and making sure there's no bottleneck to we're just really sensitive to the businesses that are trying to get back to life. You know great anyone from the committee any questions you could do your raised hand in the chat. Yes, hello, yes, Mr, Huang, yes, hi Nasi! This is Edma. I know hi Ed hi, I'm so grateful. You are coming to report the program, us your leadership, your effort. You enrich your museum program as well as a community participation committee role. I have to say your museum has played a very active and enriching money community program more than any social service. So we are very grateful for you to play a role, multicultural. You are racial and, in addition to your museum, you know professional work and it's really wonderful work. You know, I always feel exactly. You are you, were you keep the your cultural function and the community service and the continuity? Despite your, you know, your fire in you know the firework and you seems to be without much interruption. I really appreciate your spirit, your courage, your leadership. Thank you very much for your performance. Very briefly, courageously. You know to come to us and so to expose the Community Ball Committee Board CB2, to have you know and you'll benefit from your cultural and museum work. Thank you very much for watching nancy. May I ask you, could you I do not know whether you give your schedule proceedings give to jill? If not, I would suggest you give to him so that he can distribute all your schedule and details for more people's participation from CB2. Thank you so much Ed, I'm like in tears. I really appreciate your encouragement. It has been very tricky and I do not know if I had a chance to mention this at the meeting, but Ford Foundation Big News, announcing it officially tomorrow they picked Mocha as one of 20 America's cultural treasures, so they're announcing formally yes, yeah, congrats, that's so exciting. So you have a cultural treasure in your community. It's wonderful and we're. In a small group I mean there are only five others in New York City. Oh yes, there's only 20 in the whole country that they've identified and the other five like we're like which one of these does not belong with the other. We just are so fortunate to be it's the Apollo Theater Alvin, Ailey, Museo, De, Barrio, Studio, Museum Harlem and the jazz center and Mocha, and so I for us it's like I've. It's been very emotional for us and we're the only chinese-, American history, museum in the mix of 20 and other asian american ones are three of them are in California and in the Pacific northwest, so CB2 you've got a cultural treasure. Congratulations! Thank you. Thank you yeah. So I will certainly give that to you. Give that to you, joe the schedule and oh yeah that'd be great yeah. We do yeah we'll make sure we put you on the distribution list, I'll, send it out to or have carter, send it to the Community, Board and Michael. Levine has a question. Yes Karen! Thank you. Nancy. Thank you so much for attending tonight. Just as a side remark, I was down on Mulberry street with my husband, the night of the fire. We were having dinner in one of the restaurants and as we emerged from the restaurant, we smelled the acrid smoke and no one knew where it was coming from when we got home and saw it on the news, we were heartbreaking to hear that it was the mocha. So it's really quite emotional for us and wonderful to see you here today and so glad to see that the museum is coming back. I have one question which I do not think I quite understand the nature of the street closure. Can you explain to us why you need to have the entire street closed? I know it's a small street in Arrow Street, but the path that people will be taking is viewing the windows on lafayette and then coming around to the temporary space on the narrow street. So why do you need the whole street closed as opposed to just the sidewalk in the curb Lane, I'm a little bit confused about the nature of that request. Can you explain it to us? That's such a fair question. Michael, I'm sorry! I apologize for not being clear about that. We, the one safety precaution was slightly worried about, is the end part just because we've seen a number of other situations where the congregation at the end of something it ends up being a bit trickier. So, although we can manage the 20 minutes, 20 minute slots, but as they end up on Howard street people may be loitering and we're afraid that if we loiter on the frontage pedestrian sidewalk on the howard, three howard side of the street, which would be the south side that it would end up becoming too much of a convening space and to be honest, we want to avoid any possibility of. You know that type of exposure- that's not safe and just given we know what we can handle. I think in some ways and we are nervous about handling that type of crowd, and so it's really a safety precaution. So if we had the whole street and Tiger restaurant because it's been quite popular in its first early weeks, it has gotten a lot of traffic, but there's a little bit of a waiting period, sometimes out front as well, and their frontage actually opens on at one howard versus nickel and diner that open more on center street. So their front door is on Howard Street. So that's also something that we're. Mindful of so. We feel that the safer component is because we still want this to be an active situation where units can be interacting, but they need to have more space. So it is out it's almost in the spirit of the open streets program, open restaurants program. It's to take the curb cur the right, the parking or the take it away from the vehicle movement and just allowing people more space to interact with social distance and guidelines, and the tiger has reserved a number of tables for us to be used for Mocha patrons I'll pick, people who will be visiting there so we're hoping that we're planting the seed for those people come see us to go to Tiger and then to come back to the to the community CB2 to then you know plant the seed for them to continue it so we're connected to every bit and peace of the community like people come here because they like to go to other places nearby and vice versa. So we're just trying to be smart about those partnerships and trying to help out as much as we can, because we do get over 50,000 people. So that's a huge destination and people have been anxious to come back to the museum, and this is a weekend it's an autumn. Hopefully, the weather is nice, so we're hoping to take advantage of that interest to help also some of the restaurants in the area. Thank you for the thank you for the explanation. I appreciate that. I think your request does make sense. Thank you so much Michael and Nancy. So that quote for Howard Street, it's the 15th 16th 17th is that right, 16:17 18., Friday Saturday Sunday, if possible 16:70 days. We understand that if community refuels, like any of that, if that's too much we'll take any day, I mean we would love the three days, but we understand that life is crazy now, so what whatever you feel like is possible we're comfortable with. We would love to be able to do it. You know fully on the three days, but we're deferring to safety and your judgment on these things. I mean Howard Street and not that section of Howard Street but Howard Street before the pandemic had started had been already. The the Broadway bid had been doing a play street for Howard Street on certain fridays and saturdays, for I think they only got to try it a couple of times, but I think because Howard Street is not. You know a well traveled vehicle street that it does not create some of the issues that other streets and the Community board have. But so SAPO was aware that you're applying for the closed street then for those days. Yes, I did inform them for with deidra. So I was a little confused by that process, but I can resend her an email after this meeting. If I should clarify that no I mean at this point because we're not you know it's. Probably it's going to be safe in sapo's hands who's, making the decision. We can forward them our committee resolution, but the full board won't be meeting in time for it. So just I think it's more important that you're communicating with SAPO okay at this point in the process than you are with us. You know, but we're happy to have you here to hear those details. Yeah. Is there anyone else from the committee that has questions? Okay, great you're, welcome to stay nancy, we'll go into our business session and a few more minutes after we discuss a couple more items, but if you email me the those details, I can let you know what happened with the committee meeting today and then you can use that for your conversations with staple going forward. I appreciate it. Thank you so much and stay safe everyone, and hopefully maybe on the 16th, 17th and 18th. You know whether it's closed or not, we'll be we'll be doing the stanchions and the window exhibits. That sounds great stay safe and you know let's get through this thing. Thank you. So much take care bye. Thank you. Thank you, Nancy. Thank you all right and now we'll move on to. I do not think anyone is here from the south village farmers market, it's David Gruber's little neighborhood bid. That runs. You know they usually have like the pickle man out in this at the at the intersection of carmine and Sixth Avenue and Bleeker, where they all meet, but they're planning. On doing, I took David called me to say that they're planning on just between Thanksgiving and Christmas having, I think we just won farmers Vendor on the weekends for that time, but that's just a renewal, so no one's here to speak for that application or again, so we won't do a hearing for it and then the last thing is what we're doing all the committees are doing at this point of the year is to prioritize our expense. We only have quality life only has expense budget priorities they're. Basically like ongoing funding things that we've requested each year and I listed in the email. I sent everyone what our requests have been over the past few years and the order that they that we've been requesting them in. So it's basically just us deciding if we want to reorganize any of our requests. If there's any new requests- and the one that I pointed out here at the bottom is because the composting has been because of budget cuts suspended at this time, so we could put in a budget request to reinstitute Re Institute the program for residential composting, and then our other ones are here. So this was our top request. Last year was to have more sidewalk cafe. Inspectors seems like that would be a high priority. One now, based on you know the proliferation of sidewalk cafes everywhere. Our second was for SAPO to do a study on full street closures in CB2 and their effect on businesses and residents that one was not fulfilled. Yet I think their response was that it's something that they would hope to do. Then we have asking for SAPO enforcement funding so that they can actually be going to the street activity. Events that they approve to make sure that everything is in compliance, which is something that is not typically done right now, then we have similarly to have the film permitting office, conduct enforcement and compliance to make sure that the permits that they're issuing are being complied with, and then our last one is to study the quantity and condition of trash containers. Sidewalk trash containers pick up schedules which seems more important now during the pandemic. Because of the I mean, that's a budget cut too there have been, I think, they've been better about it in the last few weeks, but that you know people might have noticed that garbage cans are just overflowing because there's many more pedestrians outside and less department of sanitation workers emptying them. Does anyone have anything that they want to move around? Should we continue these for next year? So what the committee we will prioritize these as we see fit and then we'll pass those on. Basically, the executive committee will then take all of the requests from all of the committees and prioritize them. You know Joe. Can we go back to the first one? I'm sorry, if you completed the list, can you read that again because there could be some confusion between the standard sidewalk cafes, which are regulated by department of consumer affairs and the sidewalk dining now, which is department of transportation yeah? Can we back the wording on that? First, one again, yeah right now, it says: allocate funds to hire additional department of consumer affairs, inspectors to work, nights and weekends, to conduct enforcement and compliance of sidewalk cafe regulations, a major weakness yeah. This has nothing to do with the department of transportation. No, the DOT requests typically come from traffic and transportation, but we could say we could add, you know, allocate funds to hire additional DCA and Department of transportation inspectors. Oh, I think that would be wonderful, because there are violations that a lot of us do see from time to time, yeah now in the sidewalk dining. So if we could make that clear, that would be really good, yeah and I'll put in language saying we mean both the traditional I'm sorry until July, 1st 2021, and so we have no idea if we'll go back to standard, sidewalk, cafes or dining in this on the streets. So it's good to cover both yeah. That makes sense, yeah I'll, add in that language and keep that number one. Does everyone think I think so and then no, I was going to the trash pickups and the corner bins, that's something that we should ask them to reinstate in areas is necessary to more pickups, and when you try to move that one up, there's trash blowing all over the place. I mean it's really bad and for our community you know that's really important. Why do not we move that one up to number two, because basically SAPO is there's hardly any street activities right now, so for the next fiscal year we could add it there to the second our second priority and then keep the others as they are in that order and then add residential composting. I guess at the end, I just wanted to point out that the mayor's office of Media and entertainment there's supposed to be a police officer out at every filming location. So I do not know what they're doing there if they're providing enforcement, if they're just hanging out right on every shoot, Linda there's supposed to be a NYPD okay. Maybe I can put some language in that. In addition to any support, we think that there should be additional mom enforcement specific to each shoot. Okay, I'll, put I'll, add that language and also at some point, could we consider the department of buildings inspectors. You know it's not going to stay quiet forever. Certain things have already redeemed construction. That's something! We've always had problems with here with department of building or violations yeah. I think that would be in the land use, I'm not sure if they already have one but I'll check but yeah. That would not come from our committee, but land use which they might have. I have to go back and check. Thank you all right. Oh rocio, hi everybody. It's so nice to see everybody again. I just have one comment in my buildings: we decided to do the composting and I'll tell you. We signed up a few of our buildings and unfortunately, none of the tenants really wanted to participate or participated. It was such a waste of money to get all those bins and then people were not using them. So I would say that just if your last item is fine but okay, I do not know if even should be included. My experience was negative because they came, they taught us, they brought the equipment. They brought all the flyers that we posted up in our buildings and still people did not. So they actually said sorry we're not going to be picking up your little bits of compost that you're putting out right, so they decided to cancel most of all my buildings, I mean. Maybe we can put the language that not just to allocate funds, but it is it's such a troubling thing, because I even in my building, I knew that we have enough units- and I just did not want to go through the rigmarole of trying to coordinate it with our landlord and get it set up. I set up my own composting thing in our in our courtyard, but it is I mean it's such because it can have such an impact on lessening the amount of waste that we're producing, because it's heavy stuff you know so it's just so frustrating. I do think it takes a lot of outreach and a lot, but you even had education and it did not sway anyone to do it so yeah. It would definitely be lower on our priorities if, towards the end and and maybe and I'll put in language saying you know to bolster outreach or education programs about the importance of composting. But it's interesting. Let me tell you: Joe people do not even know how to or want to even recycle properly yeah. So you can't even get them to put the plastic in one container in a glass in the container and separate they won't even do that yeah. So can you imagine trying to get them to do composting? It's just nearly impossible. It's so sad! I mean I I'm very conscientious about it. Oh, I know oh yeah, but unfortunately I think the department of sanitation has been sad. I think they expected this to take off and it just kind of was yeah. Absolutely thanks, museum sure. So any more comments on these. Aside from what we've already discussed and then all right so now we'll go into business session. One thing is: are there any other sort of quality of life things that have come up since Covid-19 has been yeah? I was looking through our resolutions. Oh you. I mean nothing that we've discussed and not Covid-19 related, but I mean the trash I mean like there. Any other budget cuts that people anticipate. That might be coming that we want to make sure you know that they're important to us. I mean I'm just throwing out, because it's no, I know something we do not normally think about, but right now going into this time period. You know it's just shocking to see the Bin Pickup get cut first at the expense of so many other things and yeah I mean I I'll finesse, the language for the bins. I mean right now we're asking for allocate funds first to study the quantity and condition, but I'd say. Maybe we take out the study and to say to you know: re- uh put that money back in and then I mean now yeah, it's become pretty desperate yeah and I know they stopped the pickups on Sunday, which is sort of absurd, because our community so much weekend right so heavily on the weekends and make more sense to cut it on Wednesday or something or Tuesday Joe. Could we use a language, something like to reallocate resources to improve pickups on weekends, which is the heaviest traffic yeah? To make it clear that we're talking about reallocating limited resources yeah that access point is a good one of all the things for them to eliminate they've eliminated something really important yeah. That has a detrimental impact for sure on quality of life yeah. And what are we saying all right, yeah, so that'll be number two, but other than that, I'm trying to think and joke going back to the containers for the garbage. I discussed it in the past. I said these containers must should be very improved because yeah rat population in New York is horrible, more rats and people. I think so. If we could have something that yeah about Vermin proof. Yes, containers are very proven: they have them in many. Do we have any vermin proof other than in Chinatown, where I've seen the big values? Do we have any vermin proof in CB2? We have a few, and I know I'm on right on my block on Sullivan and West. Third, they have those ones that you have to open them. There's the blue belly right trash can, but they do not seem to be super efficient. Another thing to Rocio's point: is you know any any of the rat programs or extermination programs? You know if that's it's not something you've typically put in, but if they're cutting budgets, that's you know. Baiting programs are an easy thing to cut, but they're really important in some of the sites. I do not know how they address that, but just I am not a graduate of the Rat academy. We might need to ask you, there's. Probably I graduated from the radicand I did. I did the class a few times. I do not know yeah. I do not know who does that, but that's I've always wanted to, but that never seems to be wonderful is not that the Department of Health. I recall, having seen the presentation builder, guys, specific budget requests from the parks, but I'll add language to that. Our Trashcan one about rap all right, so the rat population is really a health concern. It's just not unsightly, it's just for our own health and unfortunately, every time. If anybody calls regarding rats, the Department of Health goes around to the buildings and they will issue violations to any building. That has anything a little hole or they think they, and so who ends up getting the in trouble, always the land owner right. So sometimes you do not even want to call them in because who's going to get the fine. It's three hundred dollars from the Department of Health, who says they send treatment of a group of people to treat the area and I've seen the bait stations that have never been dealt with, and you can see them the same way. They're dirty and nobody has done anything. But yet they charge the owners of the buildings, a lot of money for not doing a job which is horrible. But that's what it is all right. So we'll add some rat language to the sanitation request, all right. So now we'll go back so Mocha has already had you know. Well, so the application they had for us was sidewalk and curb enclosure, and it sounds like they're now trying to work with SAPO to do the street closure and not the sidewalk concurrently enclosures, because she said they're just using their three feet in front of the windows, which does not require a SAPO permit. So we can recommend approval or denial for the street closure on howard, and I guess I do not know carter. Can we communicate that to SAPO or is it just kind of a we've spoke to the community and they're supportive type thing that Moko will do with if we're supportive? I guess we just pass a resolution and then the full board will vote and we can let SAPO know that you know our meeting is until their event is already happening. Is that true, though so they're our meeting our next? Our meeting is? Oh, no. Our meeting is on the 22nd carter yeah, it's two thursdays, oh so there I mean. Oh yes, so our meeting will already will be after their event has already happened. You know what you, what Bob Gormley could communicate to them. If it were in fact the case that we do not have any objections or no objections were raised, we're not giving an opinion, but they had an opportunity for a hearing. We did not hear anything from the community against this. You know the committee members did not raise objections. I mean that's. Those are all accurate statements and give some feedback. Does anyone have any objections to that? So it's basically for a street closure from Howard Street for Friday Saturday Sunday, the 16th through the 18th. I think it sounds probably better that they do it this way, so that there is not a congregation of people on that block, and can we say something in the statement, although it might not be a resolution that we are plea that we welcome them back into the community yeah. Absolutely yes, absolutely yeah, because Chinatown has to suffer tremendously because of fire and they burn almost 80,000 books. You know the I think they rescue most of them, so the even the mayor gives some a lot of money to recuperate for the museum, and so the city hall involved a lot of work. You know for their recovery, so really quite an agenda, so if they you know they come to have this excellent exhibit, I think, expecting a lot of people will come to celebrate their recovery. I can put that in the resolution, and I think you should highlight the what they said. They were using the three Howard Street location, for because that's kind of interesting makes this very unique that yeah they're using yeah to you, know recapture all their damaged documents. Yes, you did. Yes, that makes it very unique. You know I do not know if this is something as forward. We allow street closures for everything, but this is a very unique and I think, that's important for surely all right, so everyone recommends approval on that application. Yes, thanks and then we do not have to does anyone so there any objections to recommending approval for the farmers market, the south village, okay, so that'll be recommended approval unanimously, and then we did the budget requests great under an hour. It's so nice to see everyone being here, thanks Joe! Thank you all. Thank you. Thank you. Thank you for so quick. Thank you. Ed, yes, thank you, everybody. We will stay well so healthy. Thank you, bye, good night, goodbye, everyone. Thank you safe and healthy, and.",
            "summary": "Everyone welcome to the quality of Life committee meeting of Community Board 2.\nThey were on our agenda for last month for the MOCA workshop and window Exhibits Museum of Chinese in America on Howard Street, between Center Street and Lafayette Street, and it's for a sidewalk and curb lane closure for both sides.\nThe events already happening, and I think we have Nancy Yao Mazbach from Mocha who's here to talk about the application, I'll open that in a another window, are you there nancy?\nYou know it's a new email address for people to receive, so We've the museum of Chinese America has suffered sort of a number of looming and active crises, and We did have this fire on January 23, at our collection space, where 85,000 items were in jeopardy.\nI wanted to share, especially with cp2, is just today: We've taken additional space at 3, Howard street, where yeah we've opened up 4,000 square feet of temp space, and we have it really nicely done with a young architect who has helped us to outfit that space and as I was you know, preparing for this meeting.\nWe're naming the space the workshop It's meant to be a window into conservation, also to help really Yeah build the character of the work that we do, but also for people who pass passerbys pedestrians to be able to look in, and it's a welcome public space.\nSo there'll be active public computers that people can use, as well as housing and conserving the space The main floor, and the second floor is the space that we've taken to help just repair that and the repair to just let the CBT know is a six year.\nThis is a free non charged event, but the windows are getting installed right, now, both on center street, which is a main opening to the museum.\nBut, we did want to have sort of like a formal launch of it on Friday Saturday Sunday, with stanchions keeping close to the frontage, so that I know is possible and permissible by DOT and then also having them start at 215 center go down the plot to Grand Street, make a left onto grand Street then make a left onto lafayette and see the exhibits on lafayette and then make a left onto Howard Street.\nThe request to close Howard street is part of a broader initiative for us to bring people back to the community to take a look at these exhibits and then also with the MOCA Workshop opening at three howard for them to reconnect with the fire, because I think a lot of people in our broader community had a lot of emotion around the fire.\nThose will also be socially distanced in 15 to 20 segments of no more than four people and one unit visiting the space to see that we were able to bring back the items and then they would hopefully then also to try to help develop the patronage of Tiger restaurant that just opened at one Howard.\nPeople feel comfortable, but at no time are we expecting more than 20 people at any place, because we know that we can't manage it, but we'll be giving out face masks if they do not have one We have a sanitizer also when people slide in, but we will be reserving slots online prior to those days So it's a street closure, then for howard.\nYou know, delayed and they'll be staff, I guess throughout just kind of moving keeping the queue moving or keeping people moving absolutely, and we have a really good team of people who are very versed in that And when there'll be markers and way, finders on the street, there'll be people at the corners directing them and making sure there's no bottleneck to We're just really sensitive to the businesses that are trying to get back to life.\nYou know to come to us and so to expose the Community Ball Committee Board CB2, to have you know: And you'll benefit from your cultural and museum.\nI know it's a small street in Arrow Street, but the path that people will be taking is viewing the windows on lafayette and then coming around to the temporary space on the narrow, street.\nBasically, like ongoing funding things that we've requested each year, If there's any new requests- and the one that I pointed out here at the bottom is because the composting has been because of budget cuts suspended at this time.\nI mean, that's a budget cut I think, they've been better about it in the last few weeks, but that you know people might have noticed that garbage cans are just overflowing because there's many more pedestrians outside and less department of sanitation workers, emptying them.\nJoe people do not even know how to or want to even recycle properly So. But, unfortunately, I think the department of sanitation has been sad.\nThat might be coming that we want to make sure you know that they're important to us.\nI guess we just pass a resolution and then the full board will vote and we can let SAPO know that you know our meeting is until their event is already happening.\nSo if they you know they come to have this excellent exhibit, I think, expecting a lot of people will come to celebrate their recovery."
        }
    }
}