{
    "YoutubeMetadata": {
        "author": "MCB10",
        "channelId": "https://www.youtube.com/channel/UCcZhBlipmIFlfZjt-Ji4Udg",
        "title": "Manhattan Community Board 10's May Economic Development Committee Meeting",
        "publishDate": "2020-05-14",
        "shortDescription": "Manhattan Community Board 10's May Economic Development Committee Meeting"
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB10",
        "normalizedName": "Manhattan Community Board 10",
        "twitterName": "Manhattan CB 10",
        "youtubeChannelName": "Manhattan CB10",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
        "twitterHandle": "@mancb10",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": "changed live 9/13/2020"
    },
    "properties": {
        "fullTranscript": "Okay, hello, good evening: everyone welcome to the economic development technology and communications committee meeting. My name is chanel washington. I will be chairing tonight's meeting. I am the vice chair currently of the meeting, so I want to get started with the agenda. Give me one second, so we have a few presentations tonight. I want to go ahead and first allow the members who are a part of this committee to introduce themselves hello. Is anyone hello from the committee? Hello. Give me one second good evening chanel this is gary johnson, hey gary? How are you oh? Can you? Are you able to hear donna? Okay, shatik? Do you have the members as panelists yeah donna's on but she's she's, not saying anything, okay cool? So I guess we can skip we'll skip that part since people are on view. So first I want to go with presentations, but mr powell is not on the line as of yet- and I don't see charles on the line, but mr gary johnson is on the line. So he is the naacp new york state economic development chair, and he has some information that he can provide us with on PPE and in terms of economic development. So I'm going to give the floor to him good evening. Can you hear me? Yes, we hear you fantastic. Thank you for inviting me chanel. I appreciate the opportunity this is like coming back to my roots, I'm very familiar with community boards. I used to be economic development, chair for community board 11 some time ago, and I love the work that you guys consistently do. The naacp is a national organization. New york state has over 50 branches from state to state from boston. Excuse me from buffalo to utica new york city through eastern long island. We are very heavily concentrated in the new york city area, where we have 15 branches. In your neck of the woods we give the new york branch or otherwise known as the harlem branch and I've been a member of the naacp for about 20 years now, the last 10 years I've been economic development chair, so I leveraged the expertise in real estate, development and architecture. To first sit on community board 11 and then utilize that economic development outreach to influence the new york state naacp. So what we focus on, for the most part, is small business development, particularly of businesses owned by minorities and women mwbes, as it's commonly known. As you know, both the state and the city have pledged to facilitate increasing amount of contracts for businesses that are owned by people of color. At one point, it was a 20 threshold. It's moved up to about a 30 percent. There there's talk of raising it even further and those numbers sound good. But what we find is much more important is the data behind that, because much of those contracts are not going to minorities, they're going to white women and that's great that women are getting more and more opportunities, but we have to find a way to study the metrics and provide resources to businesses so that they can benefit, and so what I've done in my capacity as state chair for economic development has brought resources to communities and that's through interfacing with government. I was on a call earlier today with new york state government. We did a webinar on that and I've participated similarly on the city level, and so, particularly during this pandemic period, or what I'm going to call the post-pandemic period. Businesses are not going to be the same right. We have to look at a different way of doing business. The status quo is broken and we have to ensure that we are having conversations on the community board level in terms of resources to businesses and those resources primarily concern access to capital. Access to capital is always the linchpin of our businesses, and we don't have the proper access to capital and, in my opinion, my personal opinion. We need to utilize this challenge that we're going through now and the sudden recognition by our elected officials that it is their systemic practices that have brought these negative outcomes in terms of health and economic development. We need to turn that economic. We need to turn the economic engine around and utilize their recognition to provide more resources for harlem in general, central, harlem west, harlem east. Harlem doesn't really make a difference, but harlem has to get back on the map and the only way we do that is by advocating for specific means of access to capital from the entities that have it. So I provide resources. I provide links to state resources, links to city resources, mwbe certification, assistance through other providers. We don't do that ourselves, but we facilitate providers and we continuously push our elected officials to recognize the inefficiencies and address them specifically and again, because I've been in your shoes literally in your shoes, on the community board level, we push very specifically about addressing these issues and making them as transparent as possible. So I welcome the opportunity to participate on this conference this evening and don't really have much more to add chanel, but I do appreciate the invite and if there's anything that I can do, naacp is always active. We're quietly active. Some of us want to be more active than others, but we have the resources and we have the outreach and we're happy to help anytime. We can gary before you go if you can just speak briefly in terms of the Covid-19 situation, just to resources that are currently available, and you know just where they can find, maybe some websites or if you can possibly shoot an email to shatek with the resources that has come down from national. So I will do that. I will shoot you an email. What I can do is I'll send you a couple resources. National has an agenda and it refers to the economic disparities that people of color have faced, but I will also send a slide presentation from the webinar I participated in today. That provides sba assistance, state assistance, talks about economic injury, disaster loans, economic injury, disaster, loan advances the paycheck protection program, and it has links that you can utilize for your community to access these resources. As you know, the paycheck protection program has issued about 310 billion dollars worth of funds, I'm not quite sure how much has come to our community directly and that's an ongoing question. I was on a call with congressman swazi the other day and we're going to be having a call with some others. We spoke with senator schumer and it's interesting because the congress has targeted in the last two cares: acts they actually use metrics and allocated funds for the states that were most impacted by the coronavirus and because they used this metric new york received its fair share of the funding, which did not happen in the first bill. So what we've advocated is that they follow that same principle and they utilize these metrics for the next round of funding, which should be able to go to small businesses so chanel, I will provide those resources to you. I can email them to you this evening for distribution during this meeting. If that's okay- and you can provide that to your colleague thanks okay, thank you very much gary. Does anyone have any questions for gary? Yes, hi? My name is mari moss. I have a question or two first of all, there's a new commissioner for the department of small business services. Are you in communication with the new commissioner, I've reached out to john l already? I have not spoken with him directly greg bishop was the prior commissioner and greg's been given a new role. Greg was a really good guy and he really did a lot for that agency, so I I've beaten up on janelle previously, so I intend to I've already. Let him know that he's got some pretty big shoes to fill. So we want to see if he's as engaged as greg was yeah. I like placing the pressure on them, so we're going to ask him to really step it up and what we'd really like to see is he'd like to see him come out to the communities or virtually that's fine as well, and let us know what change isbs is going to implement if any or what other initiatives they're going to put forth to recognize and address the post pandemic. Realities that we're going through now, indeed- and I think greg bishop- is on the recovery committee for Covid-19 through the mayor's office. So my concern is for harlem. If we can take an inventory of where businesses are in our community as far as which businesses are going to be able to reopen which businesses have had to are not going to be coming back and what kind of economic impact that's going to have on our local community as far as jobs are concerned, and going back to what you said earlier in your address about the ppp, you know how much money has: how can we pinpoint how much money has come back to the community or has gone to african-american businesses as in regards to harlem businesses? And how can we translate that economic impact to you know what's going to be flourishing after Covid-19 19 and the recovery of Covid-19 19.? So you have a lot there in that question. They're two correct me: if I'm wrong the two key parts there one is: how do we track what businesses or where those funds have gone? These are the our community right, vis-a-vis, harlem, yes and then the other part of that is, I forgot, the other part of it, but that was that was. That was the key part of it. Well, because greg bishop is now going to be a part of the mayor's initiative for recovery after 19., I'm wondering how they're going to track that, for you know what that means to urban communities like ours like harlem central and I'm not sure that sbs or the city is going to attract that money at all. To be honest with you, I think that's a department of treasury issue, so I think that's a federal conversation that we can have with schumer and the elected representatives in congress. So that's one part. The other part of your question, just came back to me, was understanding the impact on businesses in harlem, and I think it's an interesting question from the perspective of understanding who owns the businesses right, because, if you're asking about how businesses in general are going to recover or who is going to recover, be impacted, that's a question. If you're asking about businesses owned by people of color and how they're going to recover that's a different question. So there are two sides of that and I think they're both important. But you know, for example, on the governor's committee for the advancement and reopening of new york there's someone from sylvia's restaurant on that committee right. So this is publicly information publicly available information. The metrics, the devil, is always in the details. You know we asked for details pertaining to the coronavirus and who it was impacting. It became clear that it was impacting people of color. It was clear they was act impacting latinos and african americans. It was clear that we had a higher rate of acquiring the disease and dying from the disease and once they understood that they were willing to open. That tells me a lot, so you know there's a lot of work to be done and data can be used and manipulated, so we have to be very careful how we analyze it and how we articulate it for the purposes at hand. Thank you, you're welcome. Anyone else have a question. Thank you. Mari okay, so is deacon charles powell on the line as of yet okay is charles darnell on the line. As of yet is the chair harris on the line? Yes, good evening, hi chanel, how committee hey harlem guest, I believe michelle did you have to speak really quickly or did you already have a question? No, I can speak now. If I can give a summary, can you hear me hold on? Excuse me, wait a second hold on. Does everybody have an agenda? No, when was the agenda? The agenda should have been sent out. No, I don't think I received it. Chanel may ask a question again: I'm not I'm not sharing this meeting, but I believe michelle contacted me and said that she needed to speak earlier. If that pleases you at this time, she would like to speak because she has to go okay, cool. I just okay, cool michelle. Yes, I'm here! Thank you so very much chair and thank you chanel for your time. I was invited today to give a short summary on the upcoming heroes act, but before we move forward with that, I just kind of want to cover, what's left and what's happening with ppps and what's happening with the small business administration. So, unfortunately, the small business administration is not doing much reporting in the second round they did before, but what we do know is in the second round, more small businesses, even in the new york 13th district, have been able to get their applications submitted and have had more success in receiving funding. As of now there's about 90 to 100 billion dollars left in the ppp of funding, and that's because more people are applying but they're applying and they're, not asking for as much funding as the first round, so this round has been more successful for small businesses overall. The other thing I would like to clarify is the economic injury disaster mode, which was the ten thousand dollar grant. Initially people thought they were going to get that money just ten thousand dollars, but what the federal government decided to do was you received one thousand dollars per employee? So if you had five employees, you got five thousand. If you had ten employees, you had ten thousand. If you have more than ten employees, you were just cast at ten thousand dollars, but more people were on the side of getting the grant money and that has been allocated, but the loan interest was a bit too high and small businesses didn't want the debt. We believe the loan was at 3.75 percent. The other positive thing is that the columbia harlem sbdc, which is a small business development center, has been helping businesses fill out applications and with technical assistance and they've been available to help people with questions regarding your applications. If businesses have not heard back, they should reach out to their banks to see the where their applications are in the process. Also, carver savings bank of popular ponce in spring and even paypal online have been better avenues for ppp applications than the larger banks, and most businesses have had more success with them as well. So please share that information so now moving on to the heroes act, just a short summary overall there's a request for three trillion dollars in aid. The first amount is for state and local aid for loss revenue and, of course, new york has lost a lot of revenue during the pandemic, so it was 540 billion dollars for states and territories, 375 billion for cities and counties, and approximately 17.1 billion for new york city alone, and that's including 1.1 billion, specifically for Manhattan, and about 900 million, specifically for the Bronx, and this restores the state and local tax deduction for year, 2020 and 2021.. So this was put forth, especially. This was a huge push through the new york delegation to make sure that new york city got its fair share of funding, as we have had to deal with the height in the crisis of the pandemic. As for transit, they've asked for 17.75 billion dollars overall, and that is to make sure that the mta will get its fair share of what it needs to keep running and being efficient housing, which is also very important. 2 billion for the operating fund for expenses related to Covid-19. There are 500 million dollars for public housing agencies to administrative expenses relating to processing, section 8., also 2.5 billion for section 8 and 1 billion for the mckenney v to homeless assistance grant. So this particular act is really trying to pay attention to what's happening on the ground with housing, particularly in public housing, as well as addressing the needs of those who may be homeless and also 100 billion for emergency rental assistance. Moving on there has been additional funding for there's another round. There's an argument to put forth another round of the stimulus check payment for 1200 dollars per individual, but increases also the dependent amount to twelve. One hundred excuse me: one thousand two hundred dollars per child, but the child. That also applies to children up to 17 years old, and there was a big push to also make sure that there is procedures for video conferencing for oak taking for immigration and also to extend filing deadlines and renewal dates for visas and, finally, for small businesses. There's another 10 billion for the economic injury disaster loan and grants there's 5 billion for the community development, financial institutions, the cdfis there's 10 million for a minority business development agency, an additional 659 billion for ppps and they've also did a big push so that the 75 25 formula is does not apply in this round. That was hindering a lot of small businesses because you know, especially in new york. Commercial rents are really high, so they wanted to make sure that there was flexibility in that ratio. Thank you and I can put forth this information and provide it to shatek in the near future and with my email and phone number. If anyone has any further questions, thank you, michelle. Does anyone have any questions for michelle any board members nadine pinkett here I did have a question for michelle. I wanted to know if she had any information in regards to rent freeze it the rent freeze or if there was going to be a rent fees for retail businesses. You know I understand that you know that during this round for ppp and the other monies that the sba has made available. Small businesses have been more successful. However, some of the problems that some of the small business have also were facing were some of the banks. Weren't processing their loans, if they weren't a customer. So I just want to understand for those small businesses that aren't able to get any funding what's being done in regards to event. Freeze, okay, to my knowledge- and I will follow up with this- for you, rent freezes apply for residential and commercial. The governor extended another 60 days until august 20th. As for your second question about the challenges with getting loans from the bigger banks, the congressional delegation is specifically, and the leadership in harlem and in upper Manhattan has really been pushing small businesses to utilize these smaller banks. The small businesses, are having more success with institutions like carver, with institutions like ponce, a bank of popular and also paypal online. So there's been much more success in these areas for small businesses, so that was happening with the large business and the first go-around. It was a horrible inequity, the first round, but the second round we're seeing more success. Thank you, michelle does. Anyone else have any questions. Okay, so I see thank you chanel and thank you sicily for your time. Thank you. Everyone! Thank you michelle for that information and if you could send it over to shitty, when you get a chance, that'll be great, so we can put it in some sort of writing for the community. Yes, I yes, I will, and the vote is taking place on this tomorrow, so there will be very busy down in washington dc taking place tomorrow michelle. What time will that vote be taking place? It's gonna be ongoing. All day I can. Most of the voting will be happening from the afternoon like from noon on. Okay, I can thank you. Thank you, you're welcome. Thank you. Michelle you're welcome. Thank you. So next on the agenda, we have greater harlem of chamber of commerce deacon powell, so I'm on the call. Can you all hear me? Yes, so good evening one. I just wanted to thank chanel and the economic development committee, for you know really. You know what you all have been doing and we had a great call with our chair, cecily harris chanel, and I today I want to share you know just a meaning that I've been asked to join a commission for the second harlem renaissance and janelle, and everything that the economic development committee is talking about is so in sync with what that particular commission is talking about, and that is connecting the dots. So thank you, michelle booker. You know for everything that you've been doing, you know in the congressman's office and for those who are on the call you know from you know the various you know: elected officials, community. You know development corporations and organizations, but I just want to just compliment chanel and you know just say that one welcoming you as the chair of this committee and your vision, your passion and everything is just going to be exactly what we need. So what we're talking about is the new abnormal. You know people have been talking about the new normal, but it's the new abnormal and I'm so thankful that chanel is really prepared to move forward and connect. The dots with you know, economic development technology we've been really talking about. You know, especially how important technology is today, even as we are on this current zoom call, you know and the ability for me I'm grateful that I'm seeing you know that I'm actually reading what I'm saying as I'm speaking. So you know that's a tremendous benefit, but the ability for us to reopen our businesses and the only comment that I want to make and then I'm gonna stop. You know is that there's these metrics and those metrics have to do with a number of things that regard health, our ability to be able to demonstrate you know and focus on. You know whether we can meet these metrics. What are those metrics they're testing metrics? They are hospitalization metrics. There are metrics associated with you know with whether or not we're tracking you know, and, of course you know the ability to have icu rooms. So what I appreciate about chanel is that she's connecting the dots and she understands that when we're talking about our small businesses or our economic communities, our entrepreneurs and others, we still have to pay attention to those metrics. So really economic development is crossing the line and dealing with dr smith and dealing you know with you know: hazel deuce and the health committee dealing with public safety. You know, and charles johnson and all the rest dealing with my housing committee and you know and such so the chamber has formed this second harlem renaissance, arts and culture health. You know public safety, you know, and economic development is central, so I'm available to continue to answer any questions, but again just want to compliment. You know chanel for her leadership. Of course, our chair, cicely harris and I have been speaking every day. We are on calls every day, as I'm sure every one of you on the call mari want to thank you for continuing to just you know, just really pushing the envelope. We may not always be able to really say and answer everything that you raise in the form of questions, but your questions are essential to our continued. You know you know relevance as community board to this Covid-19 19 and this new normal. So unless there are any questions, chanel I'm going to stop at that point. Okay, are there any questions for mr powell? Okay, so we're going to move on to chairs cicely harris announcement. Now I'm going to have to jump off this call, but thank you for inviting me and have a great evening. You too! Thank you. Thank you, mr johnson. Thank you for chanel. Thank you chanel for letting me say a few words. First of all, I would like to thank jennifer prince, who was the chair of this committee. Chanel has been serving as the vice chair, for I was the past two years, two and a half years that you've been vice chair and thank jennifer for her leadership. I know that you know through Covid-19 19 and before that you know a lot of people have things on their plate. They step up when asked, and you appreciate them for the time that they give, but when things happen, and they need to step back, you appreciate them for letting you know that as well. So at this time, jennifer prince has asked to become the vice chair of the committee to be a support to chanel and when asked to step up, chanelle said that she would do that, be able to finish out the rest of the year and lay out things for the summer, as this is a very vital committee. Charles powell marquis harrison, and I did talk to chanel about her vision for the committee. We want to make sure that it's aligned with where we were going and she was able to share so much that I'm excited about the things that she's got planned. This is, as I said, a very pivotal committee. So in the summer we usually take a break. This is one of those committees that I feel should not take a break during the summer, and these are things that we'll talk about in the ec meeting coming up at the end of the month. But we want to make sure that we continue to be here for the committee, because Covid-19 isn't going anywhere and this committee should not be going anywhere. This committee should still be putting out great ideas being here for the community and a facilitator to a lot of things that are going on, so chanel has agreed to step up in that role. I pray that the committee continue to support her. I know jennifer, as vice chair will charles me marquis the executive team. So please welcome her in this role. She has a lot of things planned and she's got a lot of things for the members of this committee. To do everybody should have a role and I'm excited about that chanel. Do you have anything to say? Yes, so I want to say thank you, chair harris for appointing me, and I just wanted to go into some of the ideas that I was thinking for, moving forward for how we can move with this committee at this time. So first, I want to say that I've already sent a list of agencies. I don't I don't know it's probably about 50 agencies that are city and state agencies that relate to some form of economics or technology, and I have requested that we get the links and we get the con a contact. We have the excel sheet that says what that agency does and then next to that, a column will be as a column. That explains what that agency is doing in our community and why it matters in our district and we're also going to try to see if we can go through that list and I'm going to ask the mayor's office to assist us and getting these agencies to have representation. On these calls. I would like to see at least three presentations from agencies and not just like the same ones over and over again, but if we can start going through that list to start getting information out to the constituents in the district, I've sent, and I sent letters to the office and chair harris in regards to asking elected officials to make sure that we have representation at these meetings and not just the community representative, but someone with actual knowledge and community development and in technology and communication, so that we can have a quality conversation and get something accomplished when they do come and that the community, when they access these questions, that's really questions for elected officials have the opportunity to get some of those questions answered. We also I've also sent the letter to chairman harris to review. In regards to scott stringer, we received the Manhattan neighborhood economic profiles report in 2017 and in 2018 by the way, the 2017 and 18 information is literally the same information. So I don't know what the circumstances, but I know our communities are changing rapidly, so I'm sure from year to year that it has changed. But here we are in 2020 and there is no there's no addition for 2020 and we really need that information. As mario stated earlier in the call. You know it's hard to attack an issue without data, and that brings me into the conversation about mari's project that she has been trying to implement in this community in this committee for about four years. So I personally think that it's necessary information and that we do need to take some initiative to figure out a way to gather that data. I reviewed her project and questions. I'm sure that community committee members can, you know, make themselves available to help, assist and either add in some questions or re configuring. Some of the questions so that we can possibly put that on the website for the community board district that she creates. I've asked chair harris if she can possibly work with a staff member to get that survey up and running so that we can begin to gather that data and that she will be able to see some sort of report every month from whoever has filled out the survey and she can report every month. You know what that's looking like, so we can begin to get a picture, but on the other side of that initiative that she wants to do to collect data for small businesses, I think we should not do that initiative without it being accompanied by an initiative for the constituents and residents in the district right. So right we want to know how can we support our small businesses, but on the other end, we want to know how is the residents and the constituents in the district right? How are they receiving these small businesses? Are they even utilizing them? Are they being out priced and can't even go to that restaurant that we're trying to get services to? We want to know that part also. So if it is possible, I am asking if she can possibly explore that side of it also, so that we can possibly release two or have two surveys available on the website, one for the small businesses and one for the constituents. So that's pretty much a wrap up of a plan that I would like to see implemented and I'm asking the committee members to help me implement this process of getting more information and being transparent with our constituents. Yes, we we always say that we are you know, or we don't have the power to do anything, but we do have the power to be that transparent, a vehicle where constituents can get information and we can help them connect to agencies as mari has been trying to save for the last four years. So I think, as we collect that data we will also be able to somehow I spoke to chair harris about being able to respond right. So if a small business does fills out the at the survey right, maybe we can have the office. You know just shoot out some sort of automatic. Where, if you choose this answer, then we know that these are the services that you're gonna need, so that it can somehow we can shoot out an automatic response that says hey. These are the based on your survey responses. These are the agencies that you know. Cb10 is recommending that you take a look at and possibly contact to help you with your issues, so that is what I have for that. I am looking to try to keep meetings within the time frame. That's decent, because I do respect you guys time. So I am asking that we please stay on track with the agenda. I did not mean to be disrespectful, but I just wanted to stay on track, but that is the chair, so she was able to interrupt. So I don't want isaiah to feel slighted that michelle went and spoke and he's waiting as a representative of an elected official on the line, but we are trying to stay within the agenda also. I have a no at the bottom of the agenda so when it's sent out to the public that if they would like to voice their concerns, so we're not on two hour phone calls. We can get some of those concerns. That's on their mind before we even get to the table so that we can somehow I can say hey. Would you be able to speak on this? I can you know, try to contact members before the meeting to see if I can get them to help me answer some of these constituent questions, and with that said, I would that's really what I have and I would like to revisit mari's economic plan and see if she is still interested in that and how does she feel about that chanel? If I may, this is sicily. Mari text me that she had to go to another meeting, but she would like to speak offline so we'll take that up offline with her okay next is elected official representatives that is isaiah is our other elected official on the line representation from the main office. If you can, please just give us an update on what exactly is the maya what's available for our small businesses for our constituents right, because small businesses experience an economic downturn, it is also the constituents right. People have been laid off. It was briefly spoken about earlier about. You know getting some sort of relief for wages. So if you can just speak briefly about what the mayor is currently addressing in this moment in time and in relation to the district that we're in and to economics and technology, sure thank you chanel and thank you. Everyone else at cb10. First off, as always, I hope everyone and their families are doing well during this time, but I'll jump right into it. So I tried to get sbs to join the call themselves, since they are the experts on this they weren't able to join, but they did send me a pretty robust update that if you guys don't mind, I'm just going to read alpha and if you have any questions I most likely will not be able to answer them. But I'm more than happy to take notes- and I already told sbs about the meeting and then I would be circling back with them for any concerns. So their statement starts and reads as during the onset of the pandemic and based on concerns. We heard in January and february sbs worked quickly to launch the new york city, employee retention, grant and the new york city business can continue. Continuity loan fund to support businesses while they waited on federal support. Those programs are now closed and sbs has pivoted their efforts to supporting small businesses with technical and financing assistance for sure that they are successfully connecting with sba. The federal programs and sbs is continuing to help small business. Small business owners prepare applications for future opportunities as follows. For business services, sbs is holding regular daily webinars on federal and other financial assistance and resources available to small business owners and non-profits impacted by Covid-19 just a little break from the from the script on those daily webinars I've been getting some positive reviews from those daily webinars. I was able to connect the united, the bodega association of America to those webinars, and they found it very helpful back to the script. The full schedule of events can be found at NYC, smallbizcourses.eventbrite.com webinars are available in multiple languages. Also, as a side note, I will send this update to shatek so that he can make these links available to everybody financing assistance. Businesses can now access free, virtual assistants to apply for federal loan products via our local centers. We can help with understanding which loan is best for the needs of the business review and help put together loan documents. Calculate repayment terms, connect with multiple lenders and much more additional information and direct link to assistance can be found at www.nyc.gov, slash, NYC business, slash article financing, dash assistance again I'll. I will share that through shatik, and you mentioned opportunities for workforce, so workforce related updates through our workforce. One center system we're currently working with over 200 employers to fill over 3 000 positions across the five boroughs. There's a link for that pagenyc.gov Covid-19 wf1. That link will lead you to a borough-based page and assistance is available in multiple languages and the form has been simplified for much easier access. Additionally, sps is also offering online trainings at no cost. The status of the online trainings are updated weekly at oh, no, this one. This link is way too long. So again, I will share that update with shatek, but that is the update from sbs and workforce. One is there any way that we can get some assistance from the mayor's office and contacting we have like over, like 50 agencies, that we need to take a look at when people think of harlem, they think of just a narrow situation. But we have so many different people we have chefs. We have so many different businesses that people need a lot of services, and so I took the time to go through all the agencies to see what exactly they do and I have given shatika list, and I would really appreciate it if you guys can help assist us get that representation to this district, because we are lacking that and we are suffering here in terms of the co-vet because of lack of data and lack of agency transparency right. So you just gave us a report on two agencies and we have how many agencies a lot exactly. So I think that somewhere in this there's other agencies that we should be tapping into as the economic, development and technologies and communications committee, because right now, as I mentioned to the chair and the first vice chair- is that now is not the time for us to leave the technologies and communications part of the title of this committee out. We really need to start talking about technology. How is that going to affect our economic circumstances? Is the mayor's office looking into that? Are there agencies right now that can provide some data, I mean. Is there some way that we can get your help to help us get to the agencies? That will help us gather the data, and we can possibly see what our real issues are here in the district sure. So that's definitely a super important concern. We do want to be able to look at data and aggregate that to see what are the most commonly raised, concerns and most pressing concerns that we should be addressing urgently what I can offer. I know that, sbs at the beginning of the pandemic, they were circulating widely. A business survey for small businesses to fill out so that sbs could begin aggregating that data to better understand what are the needs of businesses now and what do they foresee those needs looking like, so we can be able to meet those. I will communicate that to sbs to see if we can get some of that data to understand and see if we can localize to see for harlem or cv10 specifically for the businesses that did complete that survey. What were their issues and then I think that can be a good step in trying to design a plan to meet specifically the needs of harlem businesses, and are you guys, working with open data, to possibly provide some way that constituents can access data so that we would be able to see who's here? Who's, not here, who's being affected by what you know, who's reporting police calls who's going to the hospital. We really need that data. So, yes, I will be trying to contact you offline to see if you guys can help us we're going to try to do three presentations committee meeting and we hope to have a different agencies. Every meeting presenting sure I can I'm happy to help with that. One thing I do want to make aware is that you mentioned open data. All that data is still very much open. You can look through a few on one calls. All of that. All of that is available. It's just I'll, be honest. Personally, I'm not a data scientist. So when I look at that stuff, it's I might as well be looking at chinese arithmetic, but you know I can definitely work to make that stuff more available and possibly pull in some folks from from open data to kind of break down the numbers and the information that we're looking at, but I'm happy to work with you offline. Let me know what you need and I will I'll be on it. Thank you. Does anyone have any questions for isaiah yeah? I have a question. This is joshua. Oh my everybody asked me rationale. I had a question for sbs. They had all I had received emails. I know a lot of people received emails about potential grants that the city would be doing for small businesses during Covid-19. Do you have any update on that? I don't know about. I haven't heard of anyone actually receiving anything from the city after this program actually got started. Sure I'm not super familiar with all of the grants that sbs has been offering. I know from their update that they did launch an employee retention grant and a business continuity loan fund, but those programs were closed and I do understand that sbs at this point they're offering those webinars, because the money's not coming from the city anymore. It's coming from small business administration through ppp and other federal programs, and we are offering daily webinars to help folks understand how to access the federal money and we're also helping businesses through our local, our local centers access those grants. So I have the link for financing assistance I'll be sharing that through satique, but we are. That is what we're doing right now, so, okay, so well hold on. I just wanted to confirm so the city's not doing their own there's, no local grants. That's over again I'll share the link to the financing assistant that they're offering, but specifically the employee retention grant and the business continuity loan fund have been closed. Okay, so I have a question. This is charles hi, charles. So I think you know I put into the chat the question about. You know where new york city stands in terms of the governor's. You know, I believe it's a seven point matrix. I read today that we are at four. You know. Can you just talk about? You know our fulfillment of those that matrix with respect to reopening I'm sorry you're gonna, have to help me understand this a little bit. Seven! Well, there's a seven point matrix that governor Cuomo has suggested, and I'm not sure if it's mandated, but the articles that I'm reading says that the reopening of various communities, and especially relating to small businesses, which is what chanel is talking about, we need to be able to offer guidance to our businesses are as to where we are. With respect to the governor's. You know seven point matrix, which is about testing, which is about you know the ability to have icu rooms. You know, I think, that's what I'm referring to, that matrix, that everybody's been talking about across the state. Where does new york city stand with respect to that, and, of course, where new york city stands is reflective of where harlem stands? Okay, thanks for that question, I am not entirely familiar with a lot of those processes that come out of the governor's office. What I can say about reopening. However, I think we all know that new york state on pause that has next bricks day of the 15th, which is tomorrow and after that we are going to go into the next phase of reopening. We are going to see some activities come back. The mayor, the governor, did release the four stages of reopening and we are going to go into stage two, as I understand it after tomorrow. I don't have all of the details and exactly what that looks like off the top of my head. I know that tennis courts are going to be reopening, but as far as the seven point matrix, I'm not super familiar with each point, so I don't really want to get into that for fear out of spreading bad information. Okay, thanks! Thank you isaiah before the does. Anyone else have a question for us. Oh, I see oh, no, just charleston, okay, so before I let you go, is it possible and listen because you know at this point you have a relationship by engaging cb10. So I want you to know. We do love you and your presentations. However, in terms of economic development and technologies and communication, is it possible that the mayor office can send people who are ex who have expertise in these areas to this meeting once a month, so that we can have a real conversation? And it's not always I'm? I have to take it back and get an answer, because the follow-up to that usually gets lost in the source. So if we can possibly cut some of that down by actually having someone with the expertise in the actual area in which that committee is in right. So if you have the health committee, you want to send someone that's dealing in your office. That's an expert in health. You don't want to send the person to every meeting and they have you know somewhat of a general knowledge and that's okay, but if you can for the economic development committee, we desperately need a representation from the mayor's office, with expertise in development and in technology and communications. So is that possible short answer is yes. I will definitely work to make sure that those folks are on the next call. My apologies for this call. I really should have acted sooner, to get somebody with more expertise because chanel I'm on the same page as you I like to cut out the middleman, and I take no offense to y'all wanting to cut me out. No love lost, I love y'all, but for the next meeting I will work to have sbs on the call and for technology. I think we should talk a little more offline about what you want to see specifically in regards to technology. Just so, I can identify the right person to work to get them on the call as well, but I totally agree now is the time that we should be hearing from the experts. My updates, are, you know, they're nice, but they don't. They don't do everything everyone's looking for. So yes, yes, and we still need you there for the purpose of community relations, because we have the relationship with you, not people with the expertise yet so if you can possibly attend also so that we can begin to build that relationship with whomever is the expertise and the expert in you guys office. So thank you very much chanel. Yes, I believe in the chat some of the board members have questions that if isaiah can't answer them now, maybe he could take them back and come back with these answers. I believe on board. Member terry wisdom has some questions in the chat. Thank you. I can't see that full chat, okay, board member terry wisdom had a question for isaiah about kind of going into the media organizations. Are there specific grants that the mayor office is providing for media organizations here in harlem, and how can we be a part of that and at the table and on the committee? Is there a race task force that has been established, so we are part of those decision making and that solution? Okay, I will check for specific grants for media, and I will see what's available and as far as task forces for race, the mayor did convene a racial equity task force, so that does in fact exist. Okay. I think that committee called again I'm sorry the mayor's racial equity task force. Okay. How long has that task force? Is that specific to Covid-19 or that's just okay, racially the racial equity task force? It's not it's not older than I believe two weeks right and who? What how who's on that task was. How has he decided what that task force is made up of they reached out to a lot of the leaders around the city from various different racial backgrounds? Is there any members from community board 10 on that in different demographics? And that's in terms of you know, age represented on that task force and okay, I'm looking at the I'm looking for a list. Now it was announced in a press conference, I'm trying to look through the transcripts in my email to find a list quickly, but I will can you ask if it's possible if cb10 can have a representation, some sort of member it doesn't have to be a chair, but there's somebody that can be able to sit in on those meetings and be on that task force because we are carrying a historically black district yeah. I don't know if I'm out of turn. This is board member, terry wisdom, but that's why I asked the question. I saw that the task force was formed and the first lady charlene mcrae is the head of the task force and I think, if there's a task force, it's very important that we be at the table. We help make some of this decisions, because it's really about us, so we should definitely be part of whatever's being talked about. Whatever is being put in place is very critical and I think it's very important what you're saying chanel, that there are all these things going on and we need to be informed. I mean this is an official body. So if there's a task force, someone should come to us and you know, make us be part of what is going to happen. I mean that that's just extremely critical and there's a lot of information that flies back and forth. Someone told me about a media grant today and that's something I'm interested in with you know home network news and many other things. So I think information is key, that, as monies are dispersed and things happen, that we'd be a part of the decision making. You know it's unacceptable for us. Not thank you, terry all right, so would you be able to communicate that to your office that cb10 and that's not just for economic development? I'm sure it's others on this call. We have the chair of housing on this call right. So if there's emergency task force being created and he's not being called to the table, then or being able to decide to, you know to send a committee member to the table so that we have some information as to what's going on, then we're losing out and there shouldn't be a reason why we wouldn't be a part of any racial or equality or any of those type of conversations that are happening now. And we are the members of the community board 10 central, harlem district. So if possible, not just the economic, but if you can possibly let us know the new or the newest task force that have been created. So we can see if we need to have representation somewhere at those meetings and have the opportunity to be at the table. Definitely I'm gonna say I'm. I find it hard to believe that cb10 folks would not be on the task force or greater harlem folks, but I will work to see who is on that task force and to see how we can get cb10 more of a say in what goes on recognizing that harlem is a historically black neighborhood and harlem has beared the grunt of many of the unequally racially unequal results from the Covid-19 pandemic, so I definitely identify with the concerns as a black horlemite and I will check in okay. Thank you isaiah, so does anyone I'm gonna take anyone else. Have a question before we move on to community comments and concerns? No okay. So we're going to move on to community comments and concerns. So is there any concerns or comments that community members or board members have at this moment that we haven't discussed on this, call that we may should keep in mind or put on our radar or begin to think about addressing that they would like to share with the committee at this moment. Chanel. I think charles is on the line. He texts me charles from hexagon. Okay. So if charles is on the line then, instead of going into that, then we can also go. I can't see you guys. I can't see who's on the line. So forgive me because the way my screen is set up, so if you can unmute him and chris charles, so this is darnell charles he's, the only the owner of hexagon lounge, we, yes, we asked him to come on and present in terms of telling us what he's experiencing firsthand as a small business owner in harlem and what is his concerns, and you know what he's experiencing. He is still, I believe, in business and serving so. I just wanted to allow him to let the constituents know. You know what he's experiencing. You know as a small business owner charles he's unmuted. Maybe he doesn't hear us. Let me call him hold up if you can, as they raise their hand and stuff, because I can't really see with my setup here. So if you have any questions, if you could raise your hand and shetty would be taking you off from you, charles powell, do you have a question? I see your hand is up. No. My question was answered. Thank you. Okay, it doesn't look like anyone else. Has any questions actually joshua has his hand raised. I didn't really have a question, but just something that you know I would want to talk about is with the city being shut down, and you know the governor has this thing of when we're gonna reopen that you know just keeps delaying when we're gonna reopening we're gonna, eventually we're gonna reach a point where we lose a lot of seasonal business in new york city, which would devastate a lot of small businesses and will lead to more unemployment. So I'm trying to think of what you know. The city needs to come up with some sort of specialized support just for seasonal businesses, because there's a lot of people who bank on these summer months on the summer months to make an earning and right now it's like everything's, shut down and definitely for the summer. That's not going to be a possibility. We have. He did the mayor's talking about the beaches being closed and he's not going to reopen them. You think about all the vendors who set up that you know we don't have any beaches in harlem, but we have people who go to those beaches. You know for work, we set up. You know vendors and stuff at brighton, beach and rockaway and stuff and sell their goods there. So just thinking about how this is going to affect us as a community going forward. Well, I was on the call earlier today with the greater harlem gym of commerce and they were speaking about the percentage of small businesses who are not I'm going to be returning, and that number was about 35 to 40 percent and that's just for small businesses, which is a which is a huge number, especially for our district. I mean that's crazy and it's like do we is there a point where we reach where we say we can't afford to not open up. I think that's a conversation that we need to have in terms of you know the economic impact this is having on everybody. It's like I understand, like you know, we want to save as many lives as possible, but do we reach a point where we're no longer saving lives but we're like dooming people, doing entire generations of people, especially in communities of color, who are losing the little bit of wealth that you know they may have been able to build up over the course of several generations? Well, I'm you already know that I share the same concerns and clearly I haven't gotten answers. I've been in this position all of less than 24 hours. I am going to try to do the best. I can you already know that I will be calling you to try to see if we can get some answers, because, right now, it's like trying to maneuver with no directions. Nobody really has everybody's talking about ppp and what bill was passed and this and that, but when does it actually, you know when does the notice of the bill and the press conference and the announcement on the news actually meet? You know the constituents, the business owners, the small property owners. You know when it's like we keep hearing this right, but I'm not hearing any small property owners. Tell me hey. I got this big check. You know of relief, I'm not hearing it come out on the other end. So I'm definitely with you on that, and you already know that I will be calling you to work with, and hopefully we can try to get to the bottom of some of this stuff. Part of it is right technology right. You have to understand and look ourselves in the mirror and understand that we have a more seasoned season- leadership that wasn't looking at technology in a way that we now have to look at technology and being forced to look at technology, and so that's forcing changes. That's going to force changes to happen all by itself just to maneuver through this new world that we in so I'm definitely interested in having a conversation. I spoke to the chair earlier about it's interesting to watch when people with you know, someone of melanin says on a call about 5g. It's automatically assumed about conspiracy theory, but 5g is a real thing right. It's fifth generation, artificial intelligence, that you know: phone companies are utilizing and there's no stopping it and us not speaking about it and putting a taboo on. It is really doing us a disservice because, as you know, you know we in the trade in the market, we can see the biotech companies, we can see their ipos coming out. We can see what the what their portfolios are saying. We can see what they're describing that they are doing and what they're spending their research and development on, and so I think it's a matter of seeing how Covid-19 affects our current norm right. We're not gonna, be in the normal. It's gonna, be some people probably having to step up in spaces right people like you, and I right that's more technically savvy to try to figure out. You know how do we get a hold and advocate in this new world because the old way of advocating is not really going to cross over and the frustration of us feeling like we don't even know how to plan right because people in a certain age bracket right, we are in planning mode right. It's like playing in the family planning or whatever, and it's hard for us to be in that mode in a circumstance where we don't know what we're going into. We don't know this uncertainty. That is an uneasy feeling for us right. Even if you have a pot, a little pocket change right now what to do with it is you know it is a hard decision, because you know you don't know. What's going to happen next, you may be on remote access now, but doesn't mean you'll be on remote access two weeks from now, so with everybody remaining on that type of energy, I'm definitely willing to work, but we can talk offline about how we can possibly get a hold of those things and what happens next, because we know that many jobs are not coming back right. So now can I make a suggestion. I made a statement and I thought it was ironic that, and I appreciate isaiah you know it is very clear that the reopening of new york relates to- and I haven't heard anything back from anyone regarding to these seven matrix, and I just want to you know and I'll share with you and with the committee and with the board you know, but it is essential for us to understand exactly what those matrices are. You know, because if we're not understanding, you know that the governor has made it abundantly clear that new york city will not open up until these you know matrices are achieved. You know we are at four of seven, you know, so we need to be able to as a community board, to be able to say first of all, what are those seven matrices and what are the four that we've achieved and what are the three that we need to? You know continue to achieve. I agree with you, and I heard you say very clearly we're going to have some offline conversations and do whatever, but this is information that is out there that every jurisdiction in new york state is now considering. How do we arrive at that? You know. So if we as a community board, don't even know what the seven matrix are. You know as a city of new york. If our representative is not really, you know saying that the article that I'm looking at right now Cuomo lays out seven matrices for reopening new york city, currently meets four who on our community board and who, on this board, and the committee understands what those four are and the three that's remaining. We have to be able to say that to our small businesses, you're not going to reopen until we meet these remaining matrices. You know so when I said that to isaiah, and I love isaiah, you know and he didn't even recognize what the matrix were and I'm not trying to be critical. You know, but at the same time you know come on man. You know we need to be able to be very succinct in understanding what this is representing and it has to do with hospitalization hospital beds. You know intensive care units, you know testing and you know and tracking, and if we're not doing that as a community board, then how do we expect? You know our small businesses when they call shitty to be able to say shitty when are we going to reopen tonight? Can I just be clear: we're not reopening until those matrices are achieved. Well, I think that the governor just announced that today, so that's, maybe why isaiah may not be on top of maybe he didn't know, but his public information is posted on the governor's website and I just put the link in the chat and I think josh dropped a link as well. So at any point that you want to, you know, check the matrix or you want to. You know, check the graphs and the numbers and the statistics it is available, it's on but fatigue. All I'm going to say is that I've been reading about this for more than yeah. It's been around you. We know to be the ones in the know. People come to us with a expectation we manage expectations. They expect that we're listening to those things, but we're on those calls- and I know- and if you know cicely harris is on this- we've been talking about these matrices for days now. You know, and all I'm saying is, that is exactly where we need to as an economic development committee as a board of community board 10- and I know barbara ashkins was on this call. I guarantee that barbara knows about these matrices right, I didn't know. Well, I did I just like to I'll wait, so you introduce yourself, that's what I'm saying I didn't know you was on the. Can you just yeah, I know because I haven't been able to go to the hairdresser, so nobody recognized me so so here yeah, barbara askins, 125th street business improvement district. I just want to share some things and I do my best. Every week I read through these documents and I try to pull out the you know pieces that we can understand because a lot of this stuff, like this last meal, that come out it's 1800 pages. So you know going through this stuff- is really crazy. Fortunate for us, the business improvement district. We have an association that has a lobbyist and they do this for us and, as I get it for my businesses, I share it with the community. So I try to get as much out as possible, but one of the things I think what we, I think, we're running into a trap when we're saying health versus you know the economics- and I think, that's coming from washington health is someone who just had both of my only sisters and brothers go through it. You know when you're dealing with a health situation, then it's not one or the other. You need both. We need to be working from both ends and the fact of the matter is even though, when new york city opens. When I looked at those matrix charles, we in harlem he's saying that people who were affected the most are not going to open until they're ready, so everybody else can be ready and then we still might not be ready. Uptown, and so I just want to share with you guys some of the things that I recognized for 125th street so immediately. I did an assessment of the district and out of my 200 210 businesses. 140 of them were online robustly online and doing business. So even though 125th street is shut down completely they're still making money they're not making as much as they were, but it's compared to the small businesses they're doing okay. Secondly, the landlords- you know the larger landlords are working with their tenants they're in a better position to reduce the rent. You know they're in a better position to defer payments and let them use their security for money. It's the smaller landlords and the smaller businesses that are having the worst time, because larger landlords can go three four five months without receiving rent the smaller ones now are starting to feel it. So when we start talking about this, we have to look at the whole ecosystem. I'm concerned now about. You know the whole thing with mortgages which, if they don't start doing stuff with that you're gonna see, you could say, don't pay rent. But when people run out of money they can't pay the water bill. You can't pay the light bill. Forget the mortgage and all this so there's a whole bunch of things that are about to kick in that people are really concerned about that's going to affect our health. But, more importantly, you know we are not doing what we need to do to stay healthy, but every week I'm having people walking down 125th street and passing out they're still they're, passing out on the sidewalk. We had two last week, one the week before another one, and so then we're trying to get the ems there when people are wearing their gloves and their masks they're, throwing them down on the ground. I'm concerned about my workers. You know I'm just buying up stuff all the time trying to keep them clean, so they can keep stuff clean. So I don't see us changing to get healthy. You know in the masses like we need to and that is going to impact small business. You can open up if nobody come, then what good is that doing? So you know it's just the whole thing we're twirling around in it and I don't have a plan and I don't have an action right now, but one thing that must happen: the small businesses as hard as it is. They have to become tech, not technologically savvy. They have to do google, my business, so they can be recognized. You know the doing. The ppp application was difficult, but there was a site that had been created for people who didn't know how to do it. All you have to do literally and put all the answers in you just had to go in there and say next agree next agreed next degree. I did it, I did it in 10 minutes. I got a ppp from carver using it. So you know it's, that's the start. Nobody's gonna help you anymore. If you don't have the technology- and I know I've identified some at least about 50 small businesses across 125th street- they don't have websites, they don't have websites they're, not using it, and we are going to lose them, no matter how much we talk or what we're doing nobody's going backwards. Carver bank card banks still have money for ppp. If you know of anybody that needs money, send them there. I've been sending people who could was turned down and they're getting the ppp and because it is our community bank, they are dealing with you. When you don't know they're hand-holding, you know they're calling people and talking to them until 10 and 11 o'clock at night. So that's the only place we have to go, because what we need to realize is the federal government set aside that 60 billion dollars, but it had to go to someone who was a cdfi plus the sba approved and that's the catch because we only have across 125th street umass is a cdfi but they're not going to do loans. Industrial bank is a cdi. They are doing them. Harlem commonwealth council is but they were not sba approved. So you know you only have one all of that money sitting there, but we only have one two people in harlem that cannot, you know, have access to it. So it's like. We got problems in every area. You have to start from just outline the whole ecosystem and identify all the problems, because that's where we fall in short in every area. That's all I want to say and also to what I'm saying to people- and this is where I'm operating is stop trying to go back to what you were. It's gone start thinking about what you can do, that's new, that no one else have thought of, and it's like, you have to repurpose your building because we lost a lot of people and losing people meant you lost people that was a part of the system, who's going to be replacing that who's going to bring back the jazz from paris blues. You know all of these things we're going to start having a snowball effect for all the people. We lost it's heartbreaking on so many levels and you don't know where to start, but what I can say is everybody is trying and if you start looking forward, stop going backwards and learning the technology, like you said chanel, I think you have a shot. That's it. You just have a shot that don't mean you're gonna make it that's what I have to say. Thank you for that barbara. We appreciate that, but that's the that's real, I'm sorry yeah! So thank you. Does anyone else? Oh, I see josh your hannah grace. I was just gonna agree with some of the stuff barbara said, because the reality is people are not socially distancing. I mean you go outside. They still having dice games on the side of the building everybody's in the parks like cabin picnics 810. So what are we really doing? We're wasting time nobody's socially different unless they bring the national guard in here and really like get these people off the streets make sure everybody's staying at home right now we're just wasting time we're wasting time. That's what I think about the situation. Can I jump in there yeah, okay, which one who's this mr powers hold on? It's two people who's the two people, that's trying to speak. One was me tony from tbo, harlem okay. Can you just give me one second, while at the board member this question and then I'll get right to you, so I want to thank barbara askins, for you know that major contribution I agree with you know with joshua. I wanted to just remind people of the fact that you've made that very strong connection with your chair person position now with economic development and technology that you're going to be very intentional about the importance and value of technology, not just with respect to businesses, entrepreneurs, but residents, and I just wanted to make sure that everyone heard that I know. Sometimes we get very you know emotional and expressive, especially during these times, but I just want to remind everyone. I think that community board 10 has been doing the extraordinary job you know and you chanel will always be the voice of the people. You know so I know that we'll get better. I don't think barbara we're. Looking back. I think we're looking at this new abnormal and, I think, we're you know we're making creative and you know prophetic decisions on how we're dealing with things, but I know that as chair harrison first vice chair of marquis harrison and myself- we've been talking about this stuff and you know we're going to be prepared to be of service. You know to this community and barbara. Thank you again for all of what you're doing, but we remember as it relates to harlem. I get those big businesses that have come to 125th street that are doing well, but I also hear every day the stories about those who might in fact disappear and never be ever thought of again, and we have to remember that that's what our task is to deal with the people and deal with those small businesses that really make up the essence and the historical you know, culture of what we know to be called so, charles you're right. But you know I again, I think we're not gonna make it if it's one against the other olive garden, clothes they're, not small! This thing is no one is exempt. It doesn't matter that they're big and you know, and you're gonna hear next week we're going to be doing something to help small businesses, but the what I'm trying to do is to show give examples of how the big businesses were more prepared and so not taking a bigger hit, and so there's also something you can learn from what others are doing to survive. But, right now everybody is taking a hit. It's just some people in a better position, our smaller businesses, the biggest problem- and I need to say this- is that it's not that they're not willing to learn the technology. It's overwhelming and the whole thing of trying to learn the technology and acquire cash. They need immediate cash, that's what they need. They need immediate cash, they're struggling to hold on to their workers, and, let's just understand this, the workers are making more money staying at home. So even when they open up, they don't want to come to work. You know I'm listening to this small. That is true of being told that workers are saying I'll come if you pay me off the book because they make more money at home. So that's I'm just saying this thing is more it's more complicated than we than just like it's a small business. You can they're afraid to take the pvp because they don't know if they're gonna make the money to pay it back when you have to start paying it back. You know it's just so much attached to it. So I would say a chanel is that maybe you could set aside a segment in each one of your meetings and have a specific topic that we dissect this and start trying to make a difference. Otherwise we're just going to be running from place to place because the problems are just too big. That's what I see- and I agree we also I will try to see if I can put some time to the side and see if that is possible, because I agree there was someone else that was trying to speak. Oh yeah, that was me. This is tony rasson from tbo harlem. So what I kind of wanted to address were a couple of things that mrs barber had mentioned in turn in terms of like the preparedness of some of the 125th street businesses. The difference between you know the those businesses like you know. You have like some of the larger businesses on 125th street that are either national chains or just have a lot more money. You know to deal with some of these things. Like you look like jimmy jazz and stuff, they have a very robust website and what in sales business online out, you know long before Covid-19 hit and one of the problems that I noticed working with small businesses in harlem, is you know even before Covid-19 there were technology gaps and problems with businesses really being prepared to go online or even take advantage of social media. So there is a gap between the technology that that's available and the merchant's ability the person's ability or willingness or to take time to use it because a lot of times you know sometimes it's just like it's, not even the fact that you have to have a spend money and invest in a website you could, you could also kind of you know, invest some time into a social media, page instagram, account and stuff like that, and a lot of businesses just say: look I just don't have the time right and you know it kind of works to their detriment. I come from a technology background. I've been a black tech entrepreneur for like the last 15 20 years, and so, when I form tbo, I specifically focus on small businesses and how we can empower and help small businesses in communities across the country. But the things that I've noticed, especially as it pertains to our communities, are that they, you know we're not as prepared we're not as diligent and we're not as invested as even other small businesses in other communities of the same size. You know, and I'm not really sure exactly why that is you know all businesses and small businesses have like a lot of the same type of challenges, but you know from my experience it's still disproportionately in our communities that we're not ready as say some of some of the others. Do you have the data? Do you have the data behind this? What you're saying do you I don't have? I don't actually have like you know we haven't done. You know hard studies on it, but, like I'm just telling you just from personal experience that I know and dealing with multiple communities that it it's pretty apparent, and you know at some point we'll we will start running. You know data, but we're not there yet, but the other part is it possible before you continue? Is it possible that your information can be sent to shatek so that I can possibly contact you online after this meeting? But please continue yeah absolutely so. The other thing that I kind of thought about was, I think it was joshua had mentioned in terms of social, distancing and stuff, like that, like I think I don't know, if we've all seen these videos, you know that just seemed outrageous in this time where you know you have kids throwing barbecues and you know just hanging out and parties and stuff like that, and you know I. You would think that there's enough information about Covid-19 out there, that these kids would understand what the what the risk and the data are. But I think, like I, had a conversation with somebody, a friend of mine from atlanta and she was saying like look, there's a lot of misinformation out there too, and so these kids, like when you when you see these young kids, you know they're kind of misinformed by half truths, and things like that. You know. If you remember the early messaging of Covid-19 was oh, it doesn't really affect young people. If you're young, you don't really have to worry as much. You know, and now it turns out that that's not true, and then you know even today, you know they have these children's just you know syndrome that are part of it. So every day you know there are also agents at hand that will kind of use some of this information as misinformation and disinformation towards our communities and stuff. So like what I'm saying what I'm thinking and I you know, I don't have the answer to this either, but I just feel, like you know, in terms of information, like I love what you guys do on your page, I follow you guys and, like I said, I think, there's a lot of useful information out there and you know, but I just think that part of the problem could just be. You know, you know, information that people aren't getting or the disinformation that they are getting charles is back on the line from hexagon lounge. Okay, if I'm so, as I said earlier, I had invited we have invited charles to speak about his personal experience as a business owner and who's a ppp and what he has experienced. What he sees is working or not working as a small business in our district hello. Can you hear me yeah? We hear you first of all, I'd like to thank you guys for having this meeting. I think it's definitely. You know very important for the community and I thank you for allowing me to have a conversation. I was really it back. It wasn't. I did get a lot of support from like local organizations, for example, harlem arts alliance, woman chambers of commerce with ben and a few others they constantly you know reached out. You know, shatik had reached out to me one time, so people have definitely reached out asked how they're doing been sending sba and all type of other information for us. So we went through the process of applying for numerous amount of things got denied for majority of. Finally, on this go around, we did monthly, I mean I we opened up about three and a half weeks ago, so we've been doing takeout and delivery after being closed for about six weeks. Currently we have about 35 40 percent of our staff. Back again, the ppp been great in terms of helping us kick start, so I no complaint there. There is I've also heard from other restaurant owners. A major concern is a lot of with the ppp in order for it to be forgiven. One of the hiccups is, you need to bring back all your employees, but what I've noticed is majority of employees. Don't want to come back. Some of it is because of fear, for you know corona, but the biggest aspect is with takeout and delivery. They're, not really getting tips so for them. I think it's more financially advantageous to stay home, get state unemployment and the federal unemployment they'll make more money than coming back and making you know 15 an hour or whatever. So that is one concern. I have been looking into that and how to combat that, because part of being forgiven, you need to bring back all your employees, but again obviously majority of our employees. Don't want to come back. So that's one big thing that I know other restaurants as well as we've encountered with the ppp and, regarding the other fundings out there again there's a lot of. For example, we apply one sba program and they gave us feedback that we didn't get approved because of this, and when you try to reach out, it's almost impossible to you know, get in contact with anyone. I understand the amount of volume of businesses that's probably reaching out to them, but it seems like for any little tidbit any little thing. They'll reject the loan or the grant, and unfortunately, the bus, more business owners are risking. These grants like, for example, the shake shacks the roof they have, what is it called? They got expediters and so forth for doing these things for them, so they're, getting the grants like the day of whereas we're sending for ourselves and which makes a lot difficult and any little nuisance that we wouldn't be aware of, is kicking back our loans and grants. So that's another concern, but beside that I do want to thank again all the organizations such as again naacp, harlem arts alliance, women chambers of commerce, not necessarily if they put something on hand, but they've definitely been. You know, spreading the awareness that we are still open, they've definitely been checking in on us. We've definitely been providing us with not just federal grants, but some private grants as well to apply for okay. Thank you, charles. Does anyone have any questions for charles in terms of what he has been experiencing? I actually do charles. Have you guys made a pivot from like just I guess your regular take. I know you building back up into your takeout and pickup, but have you guys also pivoted, towards more catering aspects? Yes, we are working with a few. So, for example, right now, a lot of businesses are having furlong their employees are having employees working from home. So what we're trying to strategize is, we know, doctor offices and so forth are still open. Now we I'm also from my study, also aware that a lot of these doctor officers, for example their reps, like, for example, their pharmaceutical reps- they pay for the employees, I mean for the doctors and employees food. So what I've been doing now on my own is trying to reach out to the office managers at these doctor offices getting connections with them, because what happens if you get connections with them, when the pharmaceutical, reps and so forth, comes in they the one who recommend which restaurant they want to cater from, so we've been pivoting pushing toward marketing toward again these doctor offices that are open. Currently right now number one. We gave them things out for free because you know they're essential workers and they're doing great things, but it's a. We also want to establish a long, lasting relationship so by having a relationship with the office managers and getting these things out. We in turn are hoping that we could provide catering and every time these pharmaceutical, reps and so forth, medical reps are, you know, providing meals for them, gotcha, something a little so we're just thinking a little bit outside the box. In that aspect, in terms of catering, that's what we've been looking at the most and pivoting we weren't doing delivery. To be honest beforehand. We a small local lounge restaurant, but the biggest aspect of our business is the social aspect. I mean people like to call it like the black cheers. So now, although this has been horrendous, one positive is when we do open back up. We are going to continue the process of the delivery aspect because it is definitely help pivot, whereas we could, you know, get our regular business as well as to take out a delivery gotcha. One thing that I've noticed across the country is like a lot of small businesses like your own, what they're doing and like, I think you see a lot of it in harlem, also where the businesses are focusing on delivering and paying for and having meals delivered to the hospitals and stuff, like that directly, so like in an instance where a business has lost a lot of their walk-in traffic and stuff and their their take out and pick up are only about 30 percent of what their with their normal receipts would be. They're kind of making it up by focusing on delivering 50 to 100, to 150 meals, to some of the larger medical like your front line workers at the hospitals and stuff like that correct, I'm, now a little bit smaller. Now we donated, for example, like lincoln hospital, because hospital, I know, ponzi a fresh one right there. So we partner up with omega sapphire. That's attorney and we've been working with the linking, but again because we we're a smaller restaurant and that's great with right, a lot of restaurants. What we focus on is our smaller doctor offices. So if most people don't realize every hospital there's a lot of the doctors have their own little practices. You know, for example, it could be a urologist whatsoever. These doctors officers probably have about anywhere from five to ten employees. I think that would be our bread and butter as a real small business. If we focus on these doctor offices, whereas the other restaurants can focus on the hospitals, then everybody will get served and long term will be advantageous for us gotcha. I have a quick question. This is nadine. Pinkett speaking, I just had a question in regards to have you been able to renegotiate your rent based on the current crisis, or is this something that you've attempted or interested in attempting I did finally get? I did. I did finally get to do that so when I first spoke to my landlord, of course he wouldn't he didn't want to be abrasive. He told of us his plight, but we explained to him. Hey we've been closed since march 15th, it's april 15th. Now it's been 30 days, we're not doing anything. Now what we told them is. Can we do something reduced and he recommended? Can we do 70 or this or that we came up with a number that made sense? I came up for a number that made sense for me reluctantly, but he did agree and what we did is we paid for march april and may at that reduced rent, and you know he's happy that he is getting something because he's also aware that a lot of places are not getting anything. So we were able to negotiate it and get the rent reduced okay, but there are a lot of businesses out there that I know I do a lot of restaurants. There's a lot of business out there that the landlords are not are not answering like a lot of labs are not even answering coils. I know other restauranteurs who are saying landlords are not picking up their phone, not answering emails, and because they know what it's about you know they don't want to reduce anything. Luckily I did. I did build a report with my landlord over the last two years that we've been open and he was you know he was willing to work with us and I had just one more question for you: what do you think your prospects will look like in terms of business? I'd say looking forward to the next three months. Do you think that you know I know obviously there's probably going to be a lot of hesitation on the side of the public, but you had decided to pivot and look for new business so based on this, could you kind of give us an idea of where do you think you'll be financially in the next three months? Do you think you'll be able to write out the current pandemic? Come back, maybe stronger from it or what are your? What are your you know? What sort of insights can you give us in terms of what you think your situation will be in the next three to six months? That's a little bit tough, because I'm kind of that's a little bit tough because I'm a little bit bullish. So I never think that I'm going, I could I'm going to fail, but honestly, in terms of regular business, how we were doing before right now, just on a number, I'm thinking that we, if lucky, might get to like 65 to 70 percent of business, that we did before again we're not a club, we're not a place that you know holds a hundred some more people we're small locally. So our regulars will still continue to come, but I'm thinking a reduced bit about 30 35, but the pivot is again we're doing more delivery now that we were doing before so that will help and us reaching out to, for example, the doctor officer and there's some other stuff that we're working on. I think it'll help us at least tread water long term. We definitely think that we will do we'll, be I think, in the next nine months. I could see our business. You know really growing you know, but within in the short term, within the next three four months. I know we'll just be treading water before the avenues that we're doing we'll be able to do that. Okay, and is there anything as a community board that we can do that in order to assist you in other businesses, basically survive and basically write out this pandemic can repeat that question one more time. I'm sorry. I said what else as a community board can we do to assist your businesses, like yourself, write out this pandemic so that you are around once well? I don't really believe that anything will go back to normal, but so that you are able to survive and thrive within this community. Well, I mean, for the most part, you guys been doing a great job in terms of providing information. I think information is key. For example, one of the information- I believe you guys put on instagram and so forth was you could do your surf? Save for free, that's something! That's very important in the restaurant industry, so most of my bartenders are so far for furlong. I've had all of them. You know go ahead and do it I mean you're home right now go. Do the study apply, it was free, so continuously providing information for us continuously posting, for example. I know I was at tbo: harlem always is putting up the restaurants in harlem, that's that are still open and doing takeout. You know, for example, our sister restaurant, that we, you know, we love the edge they're, always out there as well. So I think just putting the information out there, you know support small business support supports black businesses, keep the information, keep us informed and I think you know that's we'll continue to you know to move forward. Thank you, charles yeah. Thank you hi chanel. This is this is marcus. I had a question for charles, yes, hi, chuck sure I know you said you guys pivoted more towards delivery. Are you delivering from in-house or is it like grub pub or seamlessly? I know they. You know the city council, speaking of cutting the fees that restaurants have for you guys, and I heard some rumblings that uber may purchase grubhub and all this craziness. So I wonder how that impacted you all my deliveries through uber grubhub and all these. Then these third party- that's another great thing- that you guys did by putting that information about the fees when we reached out to them. We were able to negotiate and get, for example, a month or for two months or three months. You know off on some of these platforms. So that's why I said some of these information that you guys put out there. We read it and it's beneficial, so I was informed. I was able to negotiate it, but it makes more sense for us to use these platforms number one. We don't have to worry about. You know the customer service aspect because they deal with that with you know, customers, we don't have to worry about payrolls drivers. We don't have to worry about hiring these drivers. They deal for that aspect, so it makes sense for us to give us the 15 to 20 or whatever it is. But again you guys putting the information out there that they are increasing the fees help us. You know, look at some of these fine prints a little bit deeper. It helps us, you know, go back and tell grubhub or seamless and uber. Hey these fees, don't make sense whatsoever and they have been open to negotiate. Because again, I did mines about four weeks ago and I got, for example, the first month for free from seamless you know. Uber eat eats reduce theirs for the first two months, and if I want to get paid every day, they would do that for me as well. So you know they are willing to negotiate and I think that's a lot of pressure from the community that they're getting and the information that you guys are putting out there. They just passed a bill where they had to lower those fees. Didn't they okay? Well, they passed the bill, but the mayor still has to sign the bill so for it to go into effect, but that's definitely something I saw. They had restaurants on twitter that were posting their receipts from seamless grubhub and showing how they might have did like. You know two thousand dollars in sales for a month, but because of all the fees some are as high as 30 40 percent. They only made about 500 for the whole month wow. So these companies, these third-party delivery services, have really been taking advantage of the situation, knowing that restaurants right now are dependent on them. A lot of restaurants are dependent on these third-party services to be able to generate sales. So it's good that the city council took action on that, but we should make sure we should continue to advocate to make sure that the mayor actually signs the bill. Can I just make a point that we should probably broaden that also because it's not just delivery services, but those who you know those of us who are independent contractors on the side and stuff like that who use third parties right to get work distributed to us, whether it's financial institutions or you know you know, we have some people that we know are notaries right. Some of them use third party yeah. How is that affecting that third-party expense affecting them at this time? So, yes, I agree. Does anyone else have any questions or comments? Well with that being said, is there any old business? Hello? Oh okay, hello yeah! This is dr samuels. The gentleman who just spoke regarding the medical offices? Okay, hello yeah. He should talk to the medical society, the black medical society and let them know that he is in harlem and what he is prepared to do or would like to do or interact with the medical offices. He could send a letter of introduction and try to maybe do a presentation, a short presentation of their next meeting. I would love that if someone might look forward that email or information to me, I would I would definitely jump on that I'll. Do that I'll? Do that just you know, leave it with youtique and I'll get it to you directly. Thank you. I really appreciate it sure take care dear. Thank you, dr samuels. Anyone else have any questions or comments. Yeah, I'd like to just say one last thing, so we're we work with a lot of nonprofits, especially like we're doing a lot of work with union settlement and uptown grand central to showcase a lot of the east side, businesses that are still open for takeout and delivery. We created a heart, a greater harlem takeout and delivery guide that can be found on the uptowngrandcentral.org website, but one thing that I've noticed in terms of coordinating and even just kind of managing the resources like on the east side, they've kind of taken their budgets that were kind of set for live events and stuff and kind of you know pivoted and moved those over to online initiatives and stuff, and some of those initiatives that we're working with them on. I don't really know if there's a a counterpart on the west side that we should be talking to work. You know to also work for work towards doing the same thing with central hunt and west harlem businesses. One of the programs that we're doing with union settlement gives us basically puts all these small businesses in the basically 70 to 125, 000, harlemites, feeds and stuff really like the businesses. Don't have to do anything except provide us video that we can use in the initiative, and you know the funny thing was as easy as that sounds as an ask out of the 30 businesses that were like that wanted to be part of the program. Only four were able to do it, so we had to kind of make a pivot and just kind of figure out a way to work around them. But I'm just saying this to say that you know in terms in terms of like what we do with the small businesses throughout harlem and what we're doing on the east side. We'd love to be able to be doing on the west. I don't know how the community board can help us with that, but I'm putting it out there. However speaking I wouldn't recommend are reaching out to harlem park to park because they have an extensive network of businesses yeah, I know also also melbuzz or melba wilson she's on the mayor's task force for tourism, so she's a another person I would as well. Okay, thank you. So does anyone else have any questions or comments for the committee? So with and we are adjourned, thank you guys for attending this meeting. There will be follow-ups and I hope, to see more people participate in this committee. Thank you very much have a good evening. Everyone good night guys have a good evening, and thank you guys thank you.",
        "summary": "Excuse me from buffalo to utica new york city through eastern long island We are very heavily concentrated in the new york city area, where we have 15 branches In your neck of the woods we give the new york branch or otherwise known as the harlem branch I leveraged the expertise in real estate, development and architecture, To first sit on community board 11 and then utilize that economic development outreach to influence the new york state naacp What we focus on for the most part is small business development, particularly of businesses owned by minorities and women You know both the state and the city have pledged to facilitate increasing amount of contracts for businesses that are owned by people of color What we find is much more important is the data behind that, because much of those contracts are not going to minorities, they're going to white women and that's great that women are getting more and more opportunities, but we have to find a way to study the metrics and provide resources to businesses so that they can benefit, and so what I've done in my capacity as state chair for economic development has brought resources to communities and that's through interfacing with government State government and I've participated similarly on the city level, and so, particularly during this pandemic period, or what I'm going to call the post-pandemic period.\nI have a question or two first of all, there's a new commissioner for the department of small business services, they're going to put forth to recognize and address the post pandemic Bishop- is on the recovery committee for Covid-19 through the mayor's office My concern is for harlem We can take an inventory of where businesses are in our community as far as which businesses are going to be able to reopen which businesses have had to are not going to be coming back and what kind of economic impact that's going to have on our local community as far as jobs are concerned, and going back to what you said earlier in your address about the ppp , you know how much money has:?\nThink it's an interesting question from the perspective of understanding who owns the businesses right, because, if you're asking about how businesses in general are going to recover or who is going to recover, be impacted, that's a question: If you're asking about businesses owned by people of color and how they're going to recover that's a different question and I think they're both important You know, for example, on the governor's committee for the advancement and reopening of new york.\nBut what we do know is in the second round, more small businesses, even in the new york 13th district, have been able to get their applications submitted and have had more success in receiving funding As of now, there's about 90 to 100 billion dollars left in the ppp of funding, and that's because more people are applying they're, not asking for as much funding as the first round Is the economic injury disaster mode, which was the ten thousand dollar grant?\nYou were just cast at ten thousand dollars, but more people were on the side of getting the grant money and that has been allocated, but the loan interest was Other positive thing is that the columbia harlem sbdc, which is a small business development center, has been helping.\nWeren't processing their loans, if they weren't a customer, So I just want to understand for those small businesses that aren't able to get any funding what's being done in regards to event and I will follow up with this- for you, rent freezes apply for residential and commercial The governor extended another 60 days until august 20th For your second question about the challenges with getting loans from the bigger banks, the congressional delegation is specifically, and the leadership in harlem and in upper Manhattan has really been pushing small businesses to utilize.\nPeople have been talking about the new normal, but it's the new abnormal You know, especially how important technology is today So, you know, that's a tremendous benefit, but the ability for us to reopen our businesses and the only comment that I want to make You know is that there's these metrics and those metrics have to do with a number of things that regard health.\nI would like to see at least three presentations from agencies and not just like the same ones over and over again, but if we can start going through that list to start getting information out to the constituents in the district, I've sent and I sent letters to the office and chair harris in regards to asking elected officials to make sure that we have representation at these meetings and not just the community representative, but someone with actual knowledge and community development and in technology and communication, so that we can have a quality conversation and get something accomplished when they do come and that the community, when they access these questions, that's really We. Also I've also sent the letter to chairman harris to review In regards to scott stringer.\nSo I personally think that it's necessary information and that we do need to take some initiative to figure out a way to gather that data I reviewed her project and questions I'm sure that community committee members can, you know, make themselves available to help, assist and either add in some questions or re configuring Some of the questions so that we can possibly put that on the website for the community board district that she creates.\nCan you know try to contact members before the meeting to see if I can get them to help me answer some of these constituent questions and with that said, I would If I may Official representatives that is isaiah is our other elected official on the line representation from the main office If you can just speak briefly about what the mayor is currently addressing in this moment in time and in relation to the district that we're in and to economics and technology, sure thank you, chanel and thank you.\nWe have so many different businesses that people need a lot of services, and so I took the time to go through all the agencies to see what exactly they do and we are suffering here in terms of the co-vet because of lack of data and lack of agency transparency You just gave us a report on two agencies and we have how many agencies a lot exactly So I think that somewhere in this there's other agencies that we should be tapping into as the economic, development and technologies and communications committee, because right now, as I mentioned to the chair and the first vice chair-- is that now is not the time for us to leave the technologies and communications part of the title of this committee out Is the mayor's office looking into that?\nthen I think that can be a good step in trying to design a plan to meet specifically the needs of harlem businesses, and are you guys, working with open data, to possibly provide some way that constituents can access data so that we would be able to see who's here?\nPersonally I'm, not a data scientist So when I look at that stuff, it's I might as well be looking at chinese arithmetic, but you know, I can definitely work to make that stuff more available and possibly pull in some folks from from open data to kind of break down the numbers and the information that we're looking at, but I'm happy to work with you a lot of people received emails about potential grants that the city would be doing for small businesses during Covid-19 I know from their update that they did launch an employee retention grant and a business continuity loan fund.\nI am not entirely familiar with a lot of those processes that come out of the governor's office , However I think we all know that new york state on pause that has next bricks day of the 15th, which is tomorrow and after that we are going to go into the next phase of reopening The mayor.\nThe governor did release the four stages of reopening and we are going to go into stage two as I understand it after tomorrow, oh no just charleston, Is it possible that the mayor office can send people who are ex who have expertise in these areas to this meeting once a month, so that we can have a real conversation?\nWhat you're saying chanel that there are all these things going on and we need to be informed, I mean that that's just extremely critical Someone told me about a media grant today and that's something I'm interested in with you know home network news and many other things Thank you, terry all right, so would you be able to communicate that to your office that cb10 We have the chair of housing on this call right and he's not being called to the table then or being able to decide to you know to send a committee member to the table so that we have some information as to what's going on , then we're losing out, and there shouldn't be a reason why we wouldn't be a part of any racial or equality or any of those type of conversations that are happening now.\nSo we're going to move on to community comments and concerns So. Is there any concerns or comments that community members or board members have at this moment that we haven't discussed on this, call that we may should keep in mind or put on our radar or begin to think about addressing that they would like to share with the committee at this moment , yes, we asked him to come on and present in terms of telling us what he's experiencing firsthand as a small business owner in harlem and what is his concerns, and you know what he's experiencing He is still I believe in business and serving so You know as a small business owner.\nThink that's a conversation that we need to have in terms of you know the economic impact, but we're like dooming people doing entire generations of people, especially in communities of color, who are losing the little bit of wealth that you know they may have been able to build up over the course of several generations?\nSeven matrices for reopening new york city currently meets four who on our community board and who, on this board, and the committee understands what those four are and the three that's remaining We have to be able to say that to our small businesses, you're not going to reopen until we meet these remaining matrices and I'm, not trying to be critical, You know intensive care units, you know testing and if we're not doing that as a community board, then how do we expect?\nWhen we're saying health versus you know, the economics- You know when you're dealing with a health situation, then it's not one or the other We need to be working from both ends, and the fact of the matter is even though, when new york city opens When I looked at those matrix charles, we in harlem he's saying that people who were affected the most are not going to open until they're ready.\nIt's two people who's, the two people, that's trying to speak One was me tony from tbo, harlem, You just give me one second, while at the board member this question, I wanted to just remind people of the fact that you've made that very strong connection with your chair person position now with economic development and technology.\nThink that's a lot of pressure from the community that they're getting and the information that you guys are putting out there Well they passed the bill, but the mayor still has to sign the bill so for it to go into effect, but that's definitely something I saw So these companies, these third-party delivery services have really been taking advantage of the situation, knowing that restaurants right now are dependent on them."
    }
}