{
    "data": {
        "YoutubeMetadata": {
            "author": "QCB1",
            "channelId": "https://www.youtube.com/channel/UCS2T76025GF3l5_IVObw_nQ",
            "title": "CB1, Queens Full Board Meeting, November",
            "publishDate": "2020-11-18",
            "shortDescription": "",
            "lengthSeconds": "2:01:30"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "QCB1",
            "normalizedName": "Queens Community Board 1",
            "twitterName": "CB1, Queens",
            "youtubeChannelName": "Community Board One Queens",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCU7eHMXuvqtsAzGxvP6FXRQ",
            "twitterHandle": "@Cb1Queens",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "JIRoMz8tXzE",
            "fillerWordCount": {
                "uh": 243,
                "um": 228
            },
            "readTimeFullTranscript": "67 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "windows": 46,
                "street": 35,
                "building": 30,
                "residents": 19,
                "day": 16,
                "window": 16,
                "park": 16,
                "gang": 15,
                "problem": 15,
                "story": 13
            },
            "wordCountSummary": {
                "street": 7,
                "development": 5,
                "building": 5,
                "increase": 4,
                "housing": 4,
                "residents": 4,
                "houses": 4,
                "park": 4,
                "thanksgiving": 4,
                "leash": 4
            },
            "fullTranscript": "Eh Madam chair your meeting is now live. Thank you for having us welcome everyone to the November 17th meeting of Community board, one Queens before we start I'd like to take a moment to remember: Lucille Hartman, our former district manager, who passed away last month. Lucille was a dedicated public servant who gave up herself for this community for many decades. She will be remembered by all of us who knew her as a kind and generous person, always a class act dealing with all of us and the public, and we will miss her. Thank you. Okay. Now it's my pleasure. If Captain Jenkins is here, the commanding officer of the 114 policing to have him come on up and introduce himself, oh hello, how are you it's Captain, Jenkins good evening, Captain Jenkins, and welcome to community board one Queens and please feel free to introduce yourself and tell us a little bit about what's going on in the 114 hi there I'm getting I'm in and out with I'm in and out. We can hear you okay, my pleasure to be here. Thank you for having me okay. Would you like to start and introduce yourself and where you've been before and how you find the 114, even though we know it's the best precinct in the land maybe would like you would like to expand on that? Definitely the one, the 114 it's been approximately almost six weeks. I've been here in the 114. you know, like I, said as an introduction happy to be here. It's a very di I think he's having a lot of groups. I'm allowed to meet a lot of our prominent members of the community before I got here. I was in gang, the gang division for Queens north, so predominantly my time was spent in the housing developments story of what side Queens bridge and Ravenswood got to do some interesting work there, a lot of work with the you know, the federal prosecutors as well as our local state out of Queen's district attorney's office. You know, like I, said since I've been here, you know, we've been seeing some increases in several of our categories with the crime and overall we are at an overall crime increase for that 520 day period. Can you still hear me? Yes, you keep freezing up, you're freezing am I. Still here you are. Can you hear us? Okay, sorry about that? We get a little technical, difficult. Yes, I can hear you. So you know with that said. You know working with my partnership, my partners, community affairs NCOS. You know Carlos and Mishriki here, promises to you all. You know just sitting here to formulate plans and ideas. Listen to community concerns, quality of life overall conditions, and you know formulate a plan to address these issues that I've seen and you know, and also anticipate to formulate plans on any issues that I see coming. What would you say is the biggest crime rise in the area? As you see it lately, can you hear me you're breaking up, you have to repeat please. What do you see and hear you now? Okay, the biggest crime rise in the area since you've been here as soon as you get to the which what if I see partly I'm losing I'm sorry? What's the biggest rising crime you've seen since you're here, I think you're having trouble technical difficulties, I'm hearing Paul coming in and out so can you repeat the last question I think I'm getting a little better now, okay, what is the biggest rising crime you've seen since you've been here? Well, you know a lot of the biggest crime increase that I've seen since I've been here. Is you know, due to a convenience, we do have a big service area for Revel, so Revel provides the scooters which you can. You know, register online sign up and you pick the scooter up and you ride off. So with these scooters being in Astoria I think we have over 300 at any given time scooters I see that people are taking opportunity to steal the lithium batteries inside the scooter, which is driving the percentages of a lot of our property crimes. I'm also seeing an increase in the glas due to people leaving their cars running dude they're, leaving their cars running or keys in the Indian in the car. You know do the technology. Now we have these key fobs. The key fobs often get a left cup holder or get left in the car somewhere, and people tend to. You know, leave to leave the vehicle unoccupied and then people are taking this as an opportunity to take those cars. It's it's a it's also. You know an issue with the commercial businesses. You know the body shops and the and the repair shops being that they have limited space when they want to work on vehicles and whatever have you they'll move a car while another mechanic's moving another car. Someone will use that as an opportunity to jump in the car and drive off I attribute a lot of that also to the outsold outdoor dining, because people are trying to go into the restaurant or these 24 hour shops or a food truck, and you have the outdoor, dining tents or huts, which is giving them limited sight on their vehicle. They leave the car running and then someone jumps in and takes the car. So a lot of awareness. I've been utilizing. Our extensive auxiliary program get those officers out there. Handing out awareness flyers, we're using social media. To do awareness been going to the businesses making them aware of these vehicles that that's left running, so those are the two main categories: that's driving our our crime increases. Yes, can you ask, there's several people not muted and we're getting a lot of interference? Yes, Gloria. Can you mute your phone Gloria, an Eli Barbecue guy, several others. Can everybody please mute their phones or their with their mics. Please just want to doubt Florence Captain Jenkins. Can you still hear me? Yes, I can still hear you okay, and are you on the line and Bruno? Can you hear me in yes do you have any questions for Captain Jenkins? No. Does anybody else have a question for Captain Jenkins I do hi good evening? I have two questions actually or one comment and a question. The comment is I know that many residents in Queensbridge have been upset by the constant lights at night. When you know people are out just trying to you know, they've been having some gatherings, and you know, arts kind of activities and with children and the lights have been very disturbing and traumatizing to the young people. The police cars have been flashing them just for no apparent reason, so I just wanted to kind of bring that to your attention. I think they've tried to reach out, but since you're here, I didn't know you were here, I would have told them to come and be coming as well. That is just something that they brought up and it's just been really upsetting to some of the young children who have been there that they're, the you know the lights are kind of shine directly on them for no apparent reason. So just wanted to keep your attention to speak to I could speak from the agency standpoint. Nypd standpoint is Queensbridge is governed by you know not only the 114 but also PSA 9, which is the housing Bureau Captain, Jim, Brown and I. We have a great working relationship where we have constant communication. I believe I took a call from Jimmy Van Bramer councilman Van Bramer about less than seven days ago in regards to gatherings and the lights, and that issue was directed towards the housing development commander and whatever can whatever plan he has with where he places his vehicles or how what he does with the light positioning. So to speak from the agency point. I would assume it's some kind of deterrent for crime. It's some kind of deterrent from you know illicit activities, but from an exact standpoint of why that particular development is doing that. I can't speak for the housing commander, but I can tell you from the agency's standpoint on my assumption. Why that's happening and I myself have spoken to councilman Van Bramer, okay, thank you I it. You know. Maybe it's a deterrent I think you know in terms of the agency's approach, but it's really traumatizing the children who are like nine and 10 years old. So it's not having the effect that you think it's having at least for some segment of the population. My other question was through the department of transportation and also directly myself. We've been asking for some new barricades for the 31st to have open street and just haven't gotten me, so I'm just wondering what street is that again: the 31st Avenue Open street okay I left a message for you the other day, but I know that department of transportation has reached out to the 114th many times and said we would get some new barricades because they've been damaged they're falling apart. We don't have enough, so I'm just wondering when we might be able to okay. That's it. That's something. I'd have to look at I'll speak to community affairs. Once we get off the line and I'll find out the previous plan of action and what we could do moving forward. I have a question: yeah. You said that you came from the gang detail or area. Are there any major gang activity issues in this community board at this time? Speaking is what you want you wanna overall overall, that number overall, okay, well, overall majority of our gang membership is on development. Unfortunately, to give you a rough estimate, I would say: ease development has at least three to four gang or crews that various people associate with some of them. You know being in the gang division. As long as I've been there's some that's just mimicking actions they see and then there's some that's really involved in these in the in these gangs and actively contributing to the you know the fruition of the gang, so just roughly I would say out of the four developments. If we would, we would have break that down by say three to five any given day into 114. You can have up to upwards of 20 different gang accrues. Is their activity isolated to those areas or is it throughout the community board? I mean you know, you know a lot of them a lot of these. A lot of these developments have geographical investigations going on. So these things can stem from on development and go anywhere throughout the city, but they primarily start on development. So it's not like a gang member. You know we do have a lot of night life and a lot of business so at any. Given moment someone can go to just speak, say Steinway or go to Astoria, Park or Queens park, or any given moment so, but the concentration of the gang membership is usually primarily in this command on development. Okay, so if I'm walking in the street on any old street I, don't have to worry as much as if I were walking around in one of those developments. Is that correct, I wouldn't say that I wouldn't say you don't have to worry as much, because even you have to look at the population for Queen Bridge, for example, as a well over 100,000 residents and I can say maybe 10 or 15 are problematic, so that's a small percentage as far as the residency, so the average person going to and fro conducting their business onto the train system going to you know grocery shopping they're not really subject to crimes like like I mentioned in the beginning of this call. Majority of our increase in crime is property batteries and people unattended vehicles, no one's really at a great increase. Actually, robberies are down for the year, so we can speak to that assaults are even so. These crimes aren't really something that somebody has to walk down the streets of a story and look over their shoulder, not saying well, with all the people being locked down or staying in their homes. So much is there much more domestic violence going on Daniel. We have other people waiting to ask questions. Okay, yeah I have a question: I have a question. My question is just a minute: please: okay, Vanessa go ahead and then okay I want to first make a statement to the last caller here in the story of houses. We did see an increase of like shootings or what have you and just Sunday detectives came to each of our homes in front of in my building, I'm asking about a shooting. Unfortunately, I was asleep. I didn't hear anything, but to talk about the safety of the communities. You must also understand Dan that the residents of Astoria, Ravenswood and Queensland, as well as Woodside, wish to win this. This small percentage that gets 95 attention in our community. So it's kind of unfair to keep that stigma on us about gang related or what have you? Because we have dealt with that like these issues, this captain Jenkins is talking about of the robberies of these vehicles or whatever could be part of a gang as well, so to just lie that on us. It's unfair and I'm very disappointed that was taken in context, because I do not want anyone to fear entering in our neighborhoods, because what happens to us far too many times these type of things that occur in our communities. It's appeared that they get so much attention that it's not that big of a percentage as it may appear, but we also as residents, want a safe neighborhood and want to rid our community of crimes as well as us being targeted out when we go out and about the communities outside of our developments. But what my question was: captain Jenkins is due to the fact that I see a lot of young people because of the fact that we're not locked down and it's unfortunate that they caused everybody. You know they're kind of stagnated in what they do is not where they're able to freely be able to get back into the community centers get back into different activities to keep them occupied, and we I remember before I'm sure you have heard this before Brian when he was in that unit about how we trying to rid a lot of young people from joining these games or any other variations of games, because sometimes they go outside communities and other games are influenced by each other, no matter what community they come from. But my the concern is now that I remember you always trying to do a thing with the youth like a youth summit or something and I know, because it's so difficult now. How are you guys kind of still monitoring that? How are you guys still trying to keep a hold on that we won't get out of control? Can you hear me yeah can I see you there? Yes, I'm here. Okay, I want to piggyback on what you said just so we could get it on an open forum, 100 right that the small minority does get a lot more attention and the overall good that does happen in the developments. I want to point out, especially when you're from Astoria they did within the last few weeks. They have like opera over there off 1st street. They have an opera on Broadway, so people are coming into the community. You have the hue work building over there. So there's a lot of good going on in us in and around these places and, like you said, a lot of the minority get the majority of the press and, unfortunately, there's Astoria. So if we do get a shooting or we do get a high incident, it is going to get much more notoriety than other areas in the city, especially in Astoria. That's a piggyback which is of what you said and with the gang aspect I've been speaking to he's primarily out of Queensbane. He has a lot of programs. He has a lot of things that he wants to. You know bring forward and also you know, start to spread that outside of Queensbridge into the other development, basically into the entire community. Let's not get this mistaken as it's only a housing issue like I said a lot of our crime is being driven off development with property crimes. You know it seems like crimes of opportunity, nothing that I can contribute to a gang, but you know I, think you know when this in this climate, everything is socially unoffice is socially awkward and we have youth that are growing up and not being able to experience the things that a lot of us on this core experience, proms graduations celebrations birthdays. You know all of these things. You know it does take a toll socially on a lot of these on a lot of these youth in regards specifically to Astoria I know on actually, tomorrow, I have scheduled a turkey drive. Yes, so on an opposite of 125 Astoria. Behind that building in the circle there there's going to be a turkey driving we'll be giving away approximately a hundred turkeys and an additional plates pre-made plates that we're getting brought in. So you know that that's just my take on that element and my view on how to minority a lot of play, but it's not really what it's perceived to be. Thank you very much, I appreciate it. Okay, hello! Yes, my question is I called the DOT regarding 31st Avenue being closed and I I live in the neighborhood and I noticed it's never really being used. Is it does it make sense to keep that open? It's causing a lot of traffic neighborhood? Is this regards to the barricades? Yes, I'm sorry, I'm going to cut in here mossy! This is right. This is not an item for the policeman Morsi. Yes, this is not an item to take up with the police department. Okay, the open streets program is run by D.O.T yeah, okay. So if you're concerned about its youth, that's the agency to contact okay. Oh thank you for the question. Yes, Tom Captain yeah we're under Covid-19, but is there any way we can bring back some form of the community Council and the NCO meetings, because I think they're important? They are very important, but you know I myself and Ann. We spoke, and you know, I, don't think the I don't think there's the NCO meetings are still on. They still have the NCO meetings. However, the community council meetings we're looking at this increases in the Covid-19 spikes, and you know just to you know where, on armor caution and safety, we all have each other's number. At least that's what I'm understanding. We all have open lines of communication. So until maybe we get a decrease in the in these outbreaks. We could probably take these meetings. You know virtually or just a simple phone call to myself, community affairs or whatever, and maybe we could rectify any issues rather than put certain members at harm because we are promoting. You know social distancing. We are promoting no gatherings, we are promoting the 15th of December and I got a community board under the governor's order. If you could do something on zoom at least once a quarter or something it'd be nice. Okay, thank you. Captain Jenkins for being here, I know you have another commitment at seven o'clock. So thank you. One question one more question: Murray, yes and you're. The last one Dominic just one more question: hey commanding officer, I, live in the dutch hills, neighborhood and I chatted. My question: can you speak about the impact of the significant influx of homeless people to our dutch hills neighborhood and how that's affected your metrics of crime? Yes, so in our sector Charlie and bordering our sector, David, primarily around Queensbridge houses and the Plaza streets over there, we do have a. We do have a increase of about 14 relocation sites which are hotels. Currently, hotels has been used as a relocation center for the homeless population, so they can social distance into individualized rooms that has brought up our population up. Another 1500 about 1500 or more members in the community that normally aren't residents. Due to this distancing I was told that four of which will remain in place until at least 2023 and with no anticipated end date on the other 10. So as of right now we're up to 14 sites and an increase of about 1500 in population of which some are diagnosed with mental illness. Oh that's! Where you're seeing a lot of somewhat of a spike in those two sectors- hey there, I'm here, I was muted thanks for your answer, so you've, given the facts on the increase in homeless, but I didn't really hear any increase in your like changing your procedures and also I'd be curious to know which of those four hotels are the permanent ones, and thank you well, as you know, we, the NYPD, had a department of Homeless Outreach unit, which was actually disbanded. As per the chief of Department's office. These hotels are manned by DHS Department of Homeless services. I spoke out. I spoke to the director Amanda Nasmir, so this is something that I'm trying to work with DHS. What the what I have done is. She gave me the opportunity to present any problematic residents to her and she can see if she can relocate them elsewhere. Okay, Dominic, okay, thank you. Captain Jenkins, we I just have a final question that came in the chat, sure about advertising or letting the public know about the build the block meetings. Okay, we usually we can get that information would definitely be disseminated on our twitter page for all of you, it's 114 precinct and we also have a Facebook page 114 precinct. So a lot of our communication is disseminated on that page and how far in advance, do you advertise these meetings? You know due to we try to give you know everyone ample time. I would definitely say anywhere between a 72 hour window prior to the meeting it would be out, it would be broedcasting, okay, thank you and thank you so much for being here. It's seven o'clock and I know you have another commitment, so we thank you and we hope to invite you again. Thank you so much. Thank you all right. Moving on public hearing item the New York Landmarks Preservation Commission approval to facilitate replacement of 11 windows on the West facade of the queen's father clock tower I. Think. Is there Michael Granville here doing to do the presentation? Yes, hi, I'm here, okay, hello, sorry to interrupt it's Florence! Oh everyone! If you're ready, I can share my screen and go I'm sorry, Mr Granville. Do you mind if I put you on hold for one little minute? Sure, okay I understand our council member Constantine is here and he would like to say a few words coaster. You there I am I. Just I don't want to hold you up. I know you have a schedule. I just wanted to quickly comment and say hello. Well, we're happy! It is good to see everyone. It is good to be seen. You know. Thank you all for all of your service, despite everything, that's going on, Covid-19 is back I, never left, but we are seeing a second wave here in the city, so I. Thank you for all the work that you're doing I just want to give everyone a really quick update on a couple of things. I know that today we voted on the garage keep speaking. Oh speaking, it's Costa Com Stanton is how are you thank you. Okay, go ahead coaster, so we voted. The City Council today voted at a landmark sightings, the garage, so the sanitation garage it has to have to go in front of the whole council at the end of this month, but it will be moving to the site that the community board voted on back a few months ago, we'll be going around 19th, Avenue and 33rd it. You know the so here's some of the particulars number one. The trucks will not be allowed to come out onto 20th Avenue, because 20Th Avenue is already a tight street. So if they'll be coming and going through 19th Avenue only so there will be no. You know 20Th avenue on that particular street. You know no garbage trucks on that street unless they're picking up garbage on the 20th, Avenue or they're plowing 20th. The second part of it is that it's going to be fully. You know sustainable they're, going to have a solar power. That's going to power a large part of the building. It's going to be opportunity when Covid-19 is over, that you know whenever that is which hopefully is soon that young our students from the local schools will be able to take field trips. Of course, it's not going to smell it's going to be off the street. It's going to be far back and then the other two pieces is that there'll be a traffic study of 21St street, because the bqx is not happening right. We're all aware that the bqx that big pro that the so there'll be a traffic study done of 21st street that.committed to and the other thing they committed to today- is that you know housing preservation, development, HPD committed to going through a community process, because, right now, the western Queens community, land trust and the Ravenswood tenants have been holding meetings along with Community board, one on the future of that site, the future of the 21st street site. We got them to commit to doing a full process and that it can not be sold to a private developer. This is not going to be. Businesses use dual where we're going to balance the city budget by selling this property. We put it in the in into the commitment letter from HPD that it can only be a hundred percent, affordable housing or public use. So this it'll be public use or 100, affordable housing on public land, and they have to work with the community to come up with a vision for what it is. So this building this site is not going to be sold. It's been an environmental justice issue, I know queensview and north queensview I know that in my district I know it counts about Bremer's district. The Ravenswood tenants have been dealing with this for generations. This will finally be resolved once we get the money to build the garage and hopefully that'll be soon so the they've sub-committee voted today about November 30th will be the full vote of the council and that'll finally get done. You know we're. We had the city budget as part of this year's city budget I know you've. Probably all seen this already. We got three million dollars from Mount Sinai Queens for new equipment. There you know around mris and other things, so you know we made sure that we got more money to our hospitals that desperately need it, and the last thing I'll say is I know that Kate was on here earlier, a volunteer from the community. I know we gave Florence, we dropped off a thousand masks with Florence who's, mailing them to everybody. 105. The numbers for Covid-19 right now in our district are not good. They are not one 105 last week was at 4.81. Every zip code in our district is close to almost 3 percent. Those are really scary numbers. We need to grab a whole this situation very quickly, so that means wearing a mask. That means social distancing. That means washing your hands all the time. That means avoiding large social gatherings indoors. So I know this is tough I, I'm a Greek who's married to an italian. We have these big family gatherings for Thanksgiving this year. If you're, having Thanksgiving with someone, you don't live with it's very risky, so I would say that please everyone we have a chance here to kind of fight back on a second wave. That's bearing down really hard I, don't want to see our small businesses get hit. I don't want to see our schools close. I, don't want to see our hospitals go through what they went through in April, because I was in the emergency room in April and May, and it's nobody wants to see that too many people lost their lives too many people got very sick, so I'm imploring everyone. Please take this seriously and thank you to Kate Peterson and Hurt volunteers who are going to be out there. You know been out there already volunteering, please make sure that you're social distancing and taking this seriously wearing a mask, because this thing doesn't discriminate and it's deadly. So thank you for having me on tonight and I can take like a quick question or two but I know you have another presentation and I also have to go like stay on my schedule as well. So I'm happy to take I, know: I, wasn't planning on being here, but I wanted to say hello, wish you all happy Thanksgiving as well before we take questions. Costa I think I speak with for everybody when I say it's wonderful to see you and thank you for bringing us all. This wonderful news, I think there's some concern also about 11105 and the lack of testing sites in the area, because the city Mg lines are blocks long. So if we could get some other testings or mobile testing sites here, it would be great. So the northern Boulevard site at sports authority, which is not 105, I, know that I grew up in 1105. I, know the zip codes. Well, the cited sports authority just expanded the rapid testing so they're doing the pcr they're doing the molecular testing and they're doing the rapid testing. We are looking for a location 105 that has a bathroom for staff. That's indoors, I'm struggling with fine, that's not a school! So I'm looking for that location. If anyone has any ideas, let me know we know that there is going to be more contact, trace, testing and tracing in 1.05 they're working on that and we're going to have a day of action. We're going to be educating this week as well. So I'm really concerned as well. I've brought all these issues to the mayor's office. I'm not going to rest until we find a location for rapid testing, but you know we need the way we can get a hit grab the tiger by the tail here. I mean this. Isn't like a big secret right. We did it in April. We don't gather indoors, we social distance, we wash our hands, we wear a mask, sounds really simple: I've been walking around the neighborhood, it's not the case. People are not social distancing, the way they used to there's fatigue and we got to grab ahold of that fatigue because you know this disease doesn't fatigue. It's getting worse. Does anybody else? Have a question for the council member yeah I'd like to make a comment: it's Richard Kazami, hey Rachel, hi, how you doing I just want to thank you for all the help you gave along with Andrew or excuse me with Andres and Lisa Stone from the Ps 171 Claudia Kover for working on getting the four-way stop at 12Th, Street and Astoria Boulevard I appreciate your work towards that. It's been an important addition. So that the kids from Astoria houses have a safe, walk up to a Ps171 and back so I just wanted to acknowledge your help on that Richard. Thank you and thank you for all of your work at old, Destroyer, Neighborhood Association. To make that happen, and it was a great thing. The best part about this stop sign is that we did not have a tragic incident that led to it right. The community got together and said this should happen, and you know we were proactive rather than reactive, which is a beautiful thing. Yep too often in government. We do things the wrong way. So thank you for doing it and it worked out really well I, like the statement Costa. Thank you. I would like to say thank you for coming out Sunday. As you all know, we have a building and fully down what the gas line and then another building that has just a line down and Costa and Donovan. Rich is a borough president and Carolyn Maloney and Congresswoman were all there to support us and introduce themselves to the residents of the you know of this and hearing their concerns about how they're dealing with this issue, as well as being involved with this test and trace for Astoria and long island city of the project director for a lot of those locations. And we thank you for also giving your testimony on that. To also include the fact about the seriousness of this, because I will piggyback off. Who said how it's not a lot of people are not taking this seriously and not realizing that. This is something that you can just die from and the numbers are peaking in our community and that's what we are coming up against, especially when you have far too many people that still listen to this administration. That claims that this is not as serious as it is, and I want to. Thank you for giving your testimony of what you and your family have gone through and God bless. You all. Thank you Vanessa, and thank you for doing what you did on Sunday I mean the residents at 104 story. Boulevard have been suffering for weeks and NYCHA has really screwed this up, and you know the fact that we that Queens together was able to organize and get food to them for the holidays. We're going to continue to advocate to get the gas on I think it should be electric stoves instead personally, but there we need to get that. We need to get something for them to cook and we definitely need to be able to support them. So I know that Ebby's been out there. A lot with hot food I know that Vanessa and Queen's together you organized on Sunday. Thank you. This is what a community is all about, right, we're in a pandemic, and we have this tragic incidence where the house, you know the buildings at a store of houses, has no heat and no cooking gas and community has come together and rallied around them. So, thank you for doing that. It's really been so much appreciate it. Thank you. What will you do? Thank you Marie. Thank you for having me thank you for all that you do and I miss you all and I look forward when Covent is over, that we're getting together and seeing each other again. Thank you guys. Take care of yourself happy, Thanksgiving, everyone, okay, Mr Granville! Thank you so much for being on pause, so you may continue now. Thank you. Should I go ahead and share my screen to put up the presentation? Yes, okay, everyone. My name is Michael Granville, I'm an architect with the firm Darius Taraby Architects and we've been engaged for the last couple of years, restoring the exterior of the queen's Plaza clock tower we're meeting tonight to talk to you about one of the last phases of that work, which has to do with repairing and replacing the windows on this building. The building is located right near this. Dutch kills park at the meeting of kind of Queens, Boulevard and Northern Boulevard, and the approach to the Queensborough Bridge there's some images of the building. From years and years ago, when it was constructed- and these are some photos of the building prior to our facade restoration work- that's been going on. The current work has to do with replacing 11 windows on the West facade of the building, and you can see them in this slide here. Prior to this landmark, building being designated as a landmark prior owners had removed windows and replaced them with louvers to provide office spaces with air conditioning and mechanical equipment. Heating ownership would like to replace these louvers now at these 11 openings with windows. The reason that we're convening public hearings for this subject is because we are proposing to use a different material for these windows than the original windows were made from the original windows are made from formed, bronze they're, all patina green now, and the windows we're proposing to use are either steel or aluminum, depending on whether the windows need to be fire rated or not. This is a an image of what a typical single window looks like they're, very simple, looking windows: they don't have a lot of ornate moldings, but, as you can see, the bronze has turned green over the years. Here's another image of another single window at the top of the building. There are arched top windows at the 12th floor. There are several of these on the building, but most are ordinary flat top windows. Although and at the back of the building, there are wider openings that have three windows installed in them. This slide shows the windows again that are proposed to be replaced right now, or rather the louvers that are proposed to be replaced with windows. These are the only windows that are proposed to be worked on. The only openings proposed to be worked on at this time landmarks when initially discussing this project with us, felt that, since we needed to go to a public hearing for permission to use either steel or aluminum and replacement of bronze, they asked that we present a window master plan for the entire building, so that the windows we're choosing in the that we're asking you to allow us to use now at these 11 would also be pre-approved for use in the future. These are some images of the existing windows and their dimensions and appearance. You can see that they're green, but they're also rather weathered some other images from outside and inside. These are just drawings of the elevations of the building the front facing the park here on the left, the West facade, which is the facade, we're planning to change the louvers to windows on and as well the east facing the elevated trains on northern Boulevard and the rear of the building, which is now facing the high-rise construction. That's been in progress behind this clock tower building, as you can see in the photos, some of the windows are two over two in configuration, and some are one over one in configuration, we're going to keep things just the same way as they are at the lower floors of the building. The windows are required to be fire rated and as a result, where we've very limited choices in what windows we can use there and, as you can see in this drawing the original windows are on the left. The proposed windows are on the right. The proposed windows are a little bit heavier in their sash frames than the original, but they do fall within landmarks, Preservation Commission guidelines for not reducing the glass area very much it's the reduction is less than 10 percent and then at higher floors, where the windows do not require to be fire rated, we're able to use a window that is much closer in all of its dimensions to the existing. These are some other images drawings of the triple windows at the back of the building and the arch top windows. We will be reproducing these in very closely matching the size and configuration of the existing windows there's also a courtyard in the building visible from the east side, although one can't really see what's going on in there from public places, but we'll be also be replacing eventually. The windows in that courtyard, with these windows matching the operation and sashes and a number of lights and divisions just to match existing. This is a cut sheet for the fire rated window, which is a steel window, and this is a cut sheet for an aluminum window manufactured by skyline windows and specifically made to mimic the appearance of this type of historic window which are known as Pomeroy Windows after the manufacture of these from 100 years ago. As a as you've seen in the other photos, the windows existing have a green patina and bronze, and the new windows will also be painted a patina green. They won't have a natural patina green finish, but will have a patina green factory applied paint that will closely match existing color. So that's it there's a little more technical information in this appendix, but I think you know. I could open it up to questions now, if you like, just to keep it short. Thank you very much as I'm going to turn it over to and ask Elizabeth everyone to chair that the co-chair of the committee. If there were any questions presented by the committee there, we go. Okay, hello, everyone, yeah, Mr, Ranville, came and spoke to us at our November 4th meeting and it's a very straightforward issue that we were dealing with. You know simple replacement of windows with a product that replacing a product that doesn't exist anymore with something that is as close as possible, and there were very few questions about. You know the substance of replacing it in terms of reproduction, etc. We, you know the only issue. That was the fact that you know there was a question about whether or not there would be future public hearings for other things, and my understanding is that for window replacements. No, but if there is any other change in the building facade that there would be correct me if I am wrong on that Mr Granville, it depends on the character of the change. If it's something that's approvable on a staff level at Landmarks, Preservation, Commission, correct and there wouldn't be a public hearing for that, but we've really done a pretty comprehensive restoration of this building and I. Think apart from these windows, we're not going to have we're not going to see much work there in the future. Good and I must tell you. I did pass by the clock tower that is completed now. It is one of them. I have never seen it so beautiful in all my life, even with the reproduction materials. So if you're on the train going around that curve or if you're driving over the bridge, stop and take a look at that clock tower now the question I have: is it going to be functional soon? Well, the motors are all in it's ready to tell time we're working out the we're tweaking the lighting to get that to work as well. So it's illuminated at night, so it's very close to telling time again great on all four sides: okay, but it is beautiful, so take advantage of it now take a look at it, but anyway there were. You know I the committee, just I, guess we'll talk about the recommendation during committee. Do you want to do that or yes, okay, does anybody else? Have a question for Mr Granville? Yes, I have a question: Daniel, hey Dan, yeah hi. You said that the old windows are no longer being made they're no longer available from 100 years ago. However, have you contacted any fabricators people who fabricate windows to use the old type use, bronze and fabricate new frames? Sure I mean we've researched this and the well one can buy bronze windows that are put together from bronze extrusions, meaning a piece together from bronze angles and T's and shapes like this type of formed. Bronze hollow metal window is very rare. It's not impossible to obtain, but is impossible to get in a to perform in a modern fashion in terms of energy efficiency. There, the windows that we're proposing to use are modern in terms of their ability to minimize heat loss. I mean windows. Are you know, big causes of heat loss, no matter what you do, but we're able to use thermally, broken windows and, with all of the modern engineering of you, know a modern era, steel or aluminum window uh-huh. So it's that's, basically, a modified restoration, not a 100 restoration to what it would have been I guess a hundred years ago. Now the question is the glass that would have been used in those days would be lead glass and how would the lead glass perform if you were to use the old style glass? Well, the building has two levels of window in terms of their performance right now, originally from floors. Three to six, because the there were adjacent buildings with wood frame rooms, they were required to have fire rated versions of these windows at floors. Three through six and at those windows. There is wire glass now and we're planning to put wire glass back in order to be true to the original appearance in that fashion and and then at floors, where we're not required to be rated where the glass is clear. Glass now we'll have clear glass at those windows. Thank you. Anyone else have a question to Mr Granville. Thank you! So much Mr Granville, you can unshare your screen now. Thank you. Okay, hold on will I stumble through the technology. Do we have any elected officials here who would like to make an announcement hi? This is Taekwon Coleman from Office of Senator Ramos I, just want to say, happy thanksgiving to everyone, we're also hosting a thanksgiving giveaway. This Friday at Louis Armstrong Middle school families will either receive a physical turkey or a turkey voucher, and also our constituent services team is available Monday through Friday same nine to five. Our number is seven one, eight, two zero five, three eight one and I'm going to put everything I just said in the chat. If you didn't catch it and on behalf of the senator and the entire staff we wanna wish you all a happy Thanksgiving. Thank you. Yeah Marie may I go who's speaking Joe from Queen, oh Joe. Of course you may go hi folks good to see everyone a couple of very quick announcements. 11:18 on the 18th, the borough president is holding her 11th job, fair, 2 pm. You can connect it's virtual, obviously P.M. It's on the website on 11:19 at 6:00 p.m. A virtual parent advisory board I will send Florence and Marie tomorrow the flyer for that, but you can also get on through our website and that's at 6:00 p.m. On the 19th December 3rd, we are hosting the borrow hall tree lighting and we're going to give it a run in doing it live. We have a big lawn, we're going to try and socially distance wink. Santa will be there, but we'll send out more information, that'll be 4:30 on December 3rd and with that I wish. You all well happy safe thanksgivings for you and your family. Thank you, Joe happy Thanksgiving to you as well. Thank you. Yeah Bernie Brooks here go ahead. Andy yeah here for Congresswoman Carolyn Maloney, who also wants to wish everybody well thanks for giving me this chance to update her activities a bit and wish everybody a safe and happy Thanksgiving. Obviously, it's going to be very different for many families because of the Covid-19 and really to piggyback on what Kostus was saying. It was great to see him and to hear everything he was doing. We were all at that event, Sunday at Astoria houses and the problems at NYCHA, and especially there have been something that Carolyn has been trying to work on. As you know, or people may know, there is a pilot program which nice has just instituted, I think starting three weeks ago, which involves trying to re-design the maintenance system there. It's a pilot program will be putting more of the skilled tradesmen in the houses themselves, so they can get on the job when there's a maintenance problem more quickly, because it's been a huge problem, the amount of time it's taken to fix some things which are should be able to be fixed very quickly. Obviously, this gas line is a fairly major repair, that's being made there, which is I. Guess everybody knows that there's you know 45 families that have been without gas for over 50 days now, and this is especially critical with how are they going to cook for Thanksgiving and that's one of the reasons that and a shout out to Evie to all the work she's been doing getting them hot food on saturdays and then Queens together, Jonathan Forgash who's been helping bringing on Sunday food from M Wells restaurant as well as a bunch of crock pots that were assembled, I, think Costco, chipped in and then other donors chipped in. So this is a anyway this whole all that's been going on in a story in long island city I mean obviously it's not great, because it's happened because there's such dire need, but it's encouraging that all this is continuing to help answer that need and obviously she's. The communist woman is in DC now and I guess, there's hope of pushing forward and getting some kind of a relief package. Maybe the fact that we have a new president, even though he is obviously hoping that the the one that we're hoping will leave, makes it easier for the transition to start happening or we're hoping his bully pulpit will help push the Congress and notably the Senate, towards allowing some kind of a new relief package to be ratified because, as we know, the Congress is voted too, but then the Senate has blocked them, and we all know that there's small businesses and restaurants that are really in dangers of dying in our neighborhoods. So anyway. On that note, let me just thank you and go on. Thank you. Ernie just want to wish everybody a happy thanksgiving. As Ernie mentioned, the house is back in session this week and they'll go back into session again after the week after Thanksgiving last week, the commercial hosted a virtual town hall on Thursday. He shared the most recent guidance from the city and state on Quova 19 and took questions from constituents. If you missed the event, you can watch it on our YouTube page at Rep. Aoc I'll share the link in the chat I'm trying to get to it. Thank you. Okay. I'm sorry, Daniel, that's! Okay! If you want to get notifications about our upcoming events, you can sign up for our newsletter. I'll also share those links. We have a the newsletter in English and in Spanish, like Ernie, said we're hopeful about a new stimulus package, but we don't have any concrete updates at this time. It's mostly waiting on Senator Mcconnell, but we'll give you updates as soon as we have them, and but this week on the floor, the congresswoman will recognize the centennial of the jewish center of Jackson Heights, we're proud of their long history of service to our jewish, american and wider Queens community. I note this knowing that the center is not in CB1, but just if you know of other institutions or individuals that you would recommend for recognition. Just please reach out to us. We, you know making speeches on the floor of the house to honor. You know, institutions and individuals that we're proud of in our community is something that we are excited to do when we're able, as always our con our office, continues to assist constituents with federal case work. Our staff are continuing to work from home, so we can continue to accept cases at our website Ocasio-Cortez or over the phone Thanksgiving 718-662-5970 I would just like to plug in real quick. Thank you Daniel, for I'm glad that she made it back in office because she's, phenomenal and I love her spunk-Ness Ernie. I'm sorry, I missed out with you representing Kathleen Nolan, our Assembly, but I just wanted to also say thank you for all your prayers that you do all that you all send to the residents of Astoria houses, because we are dealing with tough times and also I wanted to mention about a thing that even com communication is going off even from generis office. Trying to help the residents of the story, houses possibly get a discount or restitutions from their rent, because, although our utilities are not separately paid, but it is included in our rent, so he's working on with NYCHA and other officials, or whoever else needs to be involved in these talks to see to it that those residents who are suffering and the story is suffering and not only the fact that we got so much construction going in and around us that it has become a hardship on our quality of life. So I want to thank all those politicians. You all have been very triumphant in aiding us Evie. If you have you and your team has been phenomenal of not only just feeding on saturdays, but she does a phenomenal job during the week for a story of Ravenswood and Queensbridge and Queens together has been there with me since the end of March. When this part mademx started and I want to. Thank you all that you all have participated in the prayers and those of you on the sport and those who have been involved with us, making sure that we are being taken care of, and we are so thankful for you all. Thank you. Vanessa, oh I, just wanna I just add real, quick, I'm sorry! This is Andre. I just want to add Vanessa. If nobody told you don't let it go another minute without you knowing how much the neighborhood respects and loves everything about you and what you were doing, nobody never told you. Let me tell you now and tell you again that what you do I see you do every day your feet are on the pavement and what you do for us is so greatly appreciated. I just wanted to make sure you got your roses too right now, so thank you. So much Andre I appreciate that I love you for that. I appreciate it and thank you. Vanessa can I add that to from Carolyn to Vanessa too, and also just want to say that restitution or rebate on some of the wet rent is something that she's going to really push NYCHA for, because absolutely that's an important part. Thank you. So much I appreciate it. Thank you. Andre you're welcome, move on Deborah Harrington from council member Van Bramer's office. Can I speak? Yes, Deborah! Sorry about that, every time I have to speak. Somebody else gets in before me. I didn't realize it stays open, go ahead. I just want to wish everyone a happy thanksgiving on behalf of the council member and our team. We are still working remotely. I will put the telephone number in the chat if anyone needs assistance and that's it stay safe. Thank you Jeffrey. This is Harris with Controller Stringer's office. Could I get next? Yes, go ahead, sure just very quick update for folks we're doing a survey, a city-wide survey on work and family as affected by Covid-19 and we're trying to figure out what have been what has really changed over the past eight months in our lives and how that's affected our lives and using the survey we'll be able to identify policy recommendations for the way we recover from this pandemic and the way we move forward as a city going forward. So I'll drop the link to the survey in the chat box and, if folks, could you know spare some time today or sometime this week and I'll fill it out very quickly? It's you know pretty self-explanatory questions. It is anonymous at the end of the survey. If you choose to stay anonymous, just don't provide your name, don't find your and you can just hit, submit and we're trying to get as diverse of a group as possible so that the sample size is reflective of the city so do share around. If you have networks, I'll drop you through everyone, please mute, may I, add something. This is Richard Kazami. I'd just like to thank councilman, Van Bramer and for taking the reins that we are trying to rename I think it's 43rd street and 34Th Avenue for Whitey Ford and we started the process through Jimmy's office. I know these made the initial steps, so we really greatly appreciate all the work they're doing. Thank you. Is there any other elected official, their representative, who wishes to make a comment? Okay, thank you. All I would like to get in motion to adopt the October 20 minutes motion to adopt. Thank you cheers report. Well, I. We had a presentation by the test and trace score yesterday and in one word, I'm going to say one sentence: all New Yorkers should be tested. Whether or not you have a symptom is irrelevant, everyone should be tested and you can get more information on the testing sites at newyorkcity.gov, backslash, the loan device or Wwe New, York, NYC health and hospitals.org test and trace it's very important that we all get tested because unknowingly, we might be spreading the disease directly. My report is happy thanksgiving to all I. Thank you for all you do. Every single one of you and I hope you eat well drink well be happy with a mess not while you're eating and drinking, but whoever may ask and stay safe everyone. Thank you have fun hi good evening everyone. So today we had the district service cabinet meeting for the Queensborough President's office, and today sanitation made a presentation regarding winter scheduling, a lot of the local homes and businesses in our area. The scheduling has changed to evenings. So what is happening is you're. Seeing the snow trucks out and the trucks are doing, test runs preparing for what will be. We are going to see a little bit of changes due to the fact of the outdoor dining. There are concerns about the restaurants which are white right side of the road. D.O.T is working alongside the department of location to identify different pictures. A lot of the restaurants in our district have made substantial financial input into these outdoor dining areas and D.O.T and sanitation want to work with them so that during they may not be the snow. Trucks have the shovels to the right. So the major concern is for the businesses, which will be on the right side of the road when the trucks are coming down. The streets comments. Are you done? This seems to be. Are you done with your report? Not yet there's this three second delay on my end, I'm sorry for that. No problem with the snow removal we will be looking at. We will be looking at the major roadways cleared first and then the site you can follow the snow plows on their map. There's a 15 minute delay on the map. We have the map listed on our website. Yeah I want to wish you all a happy and a healthy thanksgiving and, as Marie said, please continue to follow all the guidelines. Wear your mask, wash your hands and do everything you need to do, because when you honestly like I'm, not watching the show okay committee reports, community and economic development rod, thank you. Chair no report at this time wishing everyone a happy Thanksgiving. Thank you, consumer affairs, Pauline you're doing that report tonight. I, certainly am yes good evening. Everyone, and, if you could, please review your consumer affairs spreadsheet emailed to you, we are voting on an application for the month of November. The entities with which we agreed stipulations are marked the 114 precinct provided a report stating there was only one business crystal lounge with issues that committee intends to address. 58,311 complaints and there were 15,911 calls that included assaults. The report provided by the 114Th on crystal lounge was delayed and we only received it a few days prior. As a result, we're going to ask the state liquor authority to delay the review of Crystal lounge application and we're going to invite Crystal lounge to meet with the committee and have the board vote on the application in December. In light of the 114 precincts report, that none of the remaining businesses have any significant issues as we're going to vote on all of the applications and stipulations on the list, except for crystal lounge I move to vote to the proof of the applications and stipulations on the list, except with respect to Crystal lounge. Will anyone second, the motion I. Second, the motion? Rosanna Lafayanas? Is anyone opposed to the approval if there are no objections, the motion will pass unanimously. Thank you, Paulie. The motion is carried. Thank you, okay, thank you and have a happy Thanksgiving everyone. Thank you, environmental Protection, Antonella hi. Good evening we had our third zoom meeting regarding the work at Astoria houses esplanade. We still have to. We still have to address the resiliency aspect of it. That's still being worked on we're at the stage of identifying a local partner or local partners, plural to share costs with the Army corps of engineers. We'll keep you updated as the meetings progress, we should be having a meeting every Friday until this is until all the repairs are done and resolved, we'll keep you posted, happy, Thanksgiving, every Thanksgiving. Thank you, Antonella Health and Human services. Pauline. Can you mute yourself please? Thank you. That's what I did hi good evening. Everyone Marie you reported on that meeting regarding the testing and tracing that they're, encouraging everyone to be tested so that if they are positive, it can be traced. This is all starting with clusters that are now. Clusters are going to be leading to community spread. I can tell you, it is growing. Our numbers are growing in Astoria, so I just want to say to everyone. Many people talk about this as if it's a war, but we have to be on the front line of prevention and the only way we can do that is by doing things that we can control and it's the same thing that we've talked about and many people have talked about all night, but it really works. So the key is to make sure that we're doing everything we can to prevent this from spreading and I would like to say that thanksgiving is a time that everyone's worried about that there might be. There is a very big chance for spreading, so please make sure that you try to obey the rules, such as less than 10 people, try not to go into close spaces, social distance, wear your mask, wash your hands and try to stay away from high-risk people or people that have traveled. So I'm with that, I'm saying happy Thanksgiving to everyone and we hope to see you next month, healthy and safe. Thank you, Judy Housing, Evie, Hanzo, hi, everyone. Just a quick update on the Ravenswood garage visioning sessions. I think I was I, got sick. The last full board meeting, so I didn't report on that. But we did have the second session in October and there will be a summation report. That's issued so I'll be sure to share that with everybody that should be coming soon. There is also a youth committee that is involved and engaged so they're, also going to give input onto kind of what the ideas are for that site. The other thing I just wanted to mention. We've been talking a lot about Astoria houses and the gas. There is going to be a rally and press conference on Saturday. There will be information going out tomorrow, it'll be Saturday at 11 o'clock right by the building, which is 1-04, Astoria boulevard. We're actually going to have it right at Radial park right next door, and that is to kind of again call attention to the issue of the residents not having gas for I think we're on day. 55, there's also another building that has half a gas line out. It's also down in Ravenswood there's a building with no gas. So this is, you know, a problem: that's widespread across NYCHA, so anyone who wants to join what I'll do is when we have the flyer I'll send it to Florence, and hopefully she can send it to all of you. If you want to join us, justice for all is coordinating that press conference and rally with the residents Vanessa is involved in other residents as well. So those are just kind of two quick updates for me. We will be scheduling housing committee soon. So we'll let you know when that happens, but wishing everyone a good thanksgiving, oh and we will be actually frontline foods- is going to be providing thanksgiving meals to any family within the building. That does not have gas that would like a thanksgiving meal, so yeah just trying to make sure that people have decent food to eat and can celebrate Thanksgiving if they aren't able to go out or go away because they can't cook. Thank you. Evie I'll announce in Sony, Elizabeth, Ariane Elizabeth, yes, I had to unmute I forgot to do it, hello, everyone going back to the business at hand. With the hearing closed, we need to vote on this. We will send a letter to the LPC on what you did on what you determine at the end of the meeting as I had mentioned before. The members really didn't have very many questions, except clarifications about what was happening within the building itself and then the recommendation that they agreed upon that they voted unanimously was to recommend approval of the certificate of appropriateness for this work and for future window work. So if, at this point the motion would be terrific approval of certificate of appropriateness for window replacement on the clock tower, building may I have a motion from someone on the board motion: Second Antonella, who first, who made the motion. It was said: baby, okay and second was Antonella, okay, and so I'm going to ask: if does anybody oppose? Because this is not a vocal vote? I understand? Yes, I'm opposed okay. Anyone, okay Daniel is anyone else opposed opposed Rod Thompson. I'm sorry who opposed Daniel, Alibody and Rod Townsend, okay, so from there being. Let's see that would be 35 who are present at this point and two opposed the motion is carried. A letter will go to the landmarks Preservation Commission and in support of this particular project. I just wanted to and I want to thank Mr Granville for the time that he spent with us explaining all of this most interesting project, and it would be nice to get a few more landmarks in our district. Maybe the land use committee can work on that in the future. We have some nice structures, some nice residential buildings, don't know how that would go over, but you know we can try anyway. The next meeting for the land use Committee is scheduled for December 2nd, and at that time we have tentatively two informational presentations for rezonings in Hallets point. But more importantly, is the zoning for the coastal flood resiliency text. Amendments that are coming up. The community board will have to hold a hearing on these text amendments so that in December, since we have to have our response in by the end of the year and to city planning- and we will review those, there will be presentation by city planning at the next meeting. I would also recommend that you go on to the city planning website and find the coastal zone, flood resiliency text amendments and review them, because I understand they're a little bit more complex than before. So when I get the information, I'll distribute it to the to the board through the office. Well, that's about it. I just want to wish everyone a good thanksgiving and I wish you all health. Thank you parks and Recreation Katie Ellman hi everyone. So, last month, in our report we talked about the Parks Department, giving a presentation and update on capital project in Rainey Park. What we did not bring up was the fact that we need a letter of support from the board to share with the parks Department. So hopefully the changes and the repairs to the park will commence in 2021 and will last a minimum of a year. The changes to the park include for those that may not remember Lauren sent around the plans if you had a chance to look at them, include retaining the basketball court, but moving it to the south end of the park, removing the baseball diamond but keeping the undulating nature of the open field. Renovating the playground, redoing landscaping additional trees, it does not include the Waterfront Esplanade area and the railing, and it does not include repairing or replacing the field house. So we unanimously. The committee unanimously supports the plan, and the only thing we're going to ask for is for there to be consideration in this project and also in all future projects in our district and city-wide, for greater accessibility for those that, just for it to be more inclusive for all people that may use the space. I guess. Do we just take? Are we raising hands? Marie Katie I got a quick question. It's Richard Kazami was it included in that also the construction of the barbecue pits, because that's something that was a big change right there having barbecue allowed there, so there will be grilling will be allowed. There will be designated grill stations, but in General Rainey Park, as everybody knows, is highly used by families and groups as a place to gather and hold events, including barbecuing, so to formalize that in a way there will be set picnic areas but understanding that people will not only use those areas. They'll use other areas so they'll be now. Hopefully we'll try to include more the containers for spent coals and things like that, but yeah. So it will be officially a space where you can barbecue, where unofficially forever everyone's been doing it. Okay, so does anyone have any other questions about that? Okay, I'm going to just assume exactly I did have a question in trod towns and I Katie I know during the visiting there was a lot of there were people asking about a dominant space. Was that just wholesale rejected, or was there discussion of it? Just curious yeah that came up during the meeting and unfortunately the parks Department only held one official meeting and there was a large group of dog owners that came and said that the way things are working right now is fine. So that's all they heard and took into consideration so I also know in my community visioning work that there was a big pool for a designated dork space, but because of off leash hours and a really big love from that from dog owners in the community. They're opting to retain off-leash hours till 9 am and not have a designated space for dogs. It's something that may come up again in the future, just because Socrates in some ways is also overrun with dogs and dog poop. There is a need for some kind of designated space for dogs, but it's not going to be at Rainey Park in this current configuration of capital project. Thank you. So I'm going to ask the board. Is anyone opposed to CB1 sending a letter of support for the Rainey Park projects as described by Katie? No, we I just this is Jeff. He disclosed that I work for park, so I won't be I. Can't vote on the matter and I do also want to say that in regards to the dogs at Rainey Park and in response to to Tarad, there was a lot of support to keep the off leash hours. Like Katie said at the public meeting. I know it's used heavily by many residents, or for that you know. It's one place that you know you can actually go and throw a ball with a dog in this area. I, don't think there's any others. So I think there was a big support for that at the community meeting and then I'll also say Katie. Just at Socrates Park in general, I know, they've been a lot more strict with dogs on leash in Socrates, so, which has been great I, do think that you're right there has been a big dog issue at Socrates Park, but I think that they've gotten that under control and I think that they're doing a lot better job of enforcing off leash hours or sorry enforcing leash dogs must be on leash, so I. In my opinion. In the past couple years it has been cleaned up Socrates, at least that is with dogs. I just want to be like I just want to be clear for a second I'm not putting down socrates at all and I'm not saying they're not doing a good job. I'm saying there is an abundance of dog poop there on certain days and that's not a slight socrates. That's a slight to the dog owners clean up after your dog sure I I'd like I agree with that I'd like to say one thing to clarify for everybody just so they know why this is an issue. If you build a dog run, you are not allowed to have off leash hours on a park on parks ground. This is the main reason why, back in the day, they never built a dog run in Astoria park. Instead they built it underneath the Triborough bridge, because many people wanted to keep the off leash hours in Astoria park. If it had been put in the park, then the off leash hours would have been denied. So that's, what's behind all this, that is correct and Katie. It's Mitch, Waxman I, just had one question sure I re as I read the the document you sent around. It said that waterfront access would be part of a different project. Correct, yes, okay did they give any indication that project would be forthcoming at some calendrical moment or or is it just? You know, someday there's, you know we're in a budget crisis. The money for this current project was put together over years and to get to this point is a huge accomplishment and so I don't want to downplay how wonderful it is and how grateful we are it's happening, but there are still obviously outstanding things in the park that need some attention. Water someday and we can all start. You know continue the advocacy work for that now those will be projects for another day which, in the meantime, mine is one abstention. You have your letter of support for Rainey Park, so thank you thanks. Everybody have a happy and safe holiday public safety and the 114 has changed their meetings. No meetings are scheduled as of now for the public safety. Please everyone take this Covid-19 very serious too many people are dying, but they're not doing what they're supposed to do and I want to wish everyone. The happiest Thanksgiving ever. Thank you, Anne Transportation, Mitch Waxman. We did not do a November meeting Thursday night this week, New York, City D.O.T will be doing a CitiBike town hall for the rollout of additional bike racks in the neighborhood and we're going to schedule a December meeting date to be determined. Thank you, Mitch, okay, Publix anybody have any older new business. Okay, see now we're going to the public session. Are there any members of the public who wish to speak? Please? Oh sorry, please introduce yourself. Tom. Are you on come on? Now? You have two minutes, sir hi I am Nav Kron Singh I am a graduate student from CUNY School of Public Health and health policy, and I wanted to talk about New, York City, which has an obesity issue right now, where 22 of the population is obese, 12.5 percent of the population has diabetes, while 36.2 percent of New Yorkers are pre-diabetic predominantly affected by this are Hispanics and African-Americans and sugar has been linked. Sugar-Sweetened beverages have been linked to the rise of obesity rates, diabetes and heart disease and increasing the chance of premature death. Currently, as we see, these are factors that make Covid-19 more people more susceptible to it and morbidity to it. Recently, a resolution 0,179 2018 has been introduced which would require the FDA to place sugar warning labels on sugar shooting beverages which will allow consumers to make well-informed education decisions which will allow them to make healthier choices, and this has been adapted in Chile, which has shown to be very effective, and it's a hope that it can happen here as well. So it can counter the obesity issues we're facing right now. Thank you so much. Thank you. Mrs Singh: can we talk about the bike lane on Crescent Street who's speaking, please, Mario, D and Tony. Two minutes go ahead, so we are residents of Crescent Street between Hoyt Avenue and Astoria Boulevard and Newtown Avenue. We had found out in the past that the bike lane was put through during the pandemic in the wintertime as homeowners and residents on this block. We are suffering with the bike lane because we don't have access to the front of our homes. We don't have access for senior citizens to get in and out of the car to deliver deliveries packages, our oil trucks can't you know, make our deliveries. We want to ask if the D.O.T can come out and reassess the situation, it's a one-way lane, Street these two blocks and it just it doesn't work for pedestrians. It doesn't work for homeowners, it doesn't work for anyone here. It doesn't work for anybody. It's a danger for the cyclist. It's a danger for the older people, the pedestrians one minute. Anyone give us any guidance, it's horrible. We don't know what to do. We would have never let this go through if we knew when the meeting was and as a homeowner. What are we supposed to do? How do we address this? Okay? Can you put those? Would you put those your concerns in writing please and forward them to the Community Board Office hello. We also want action. We want to know how is how we can get. It changed past that giving you the details and the information. Well, the details come first and then it will be sent to DOT. I mean there might be no way to reconfigure that, but you have to express your concerns and we will forward that to the D.O.T okay. Thank you. Yes, hello. Is it okay by chat? Yes, my name is Matty Umia I I represent a story of values, we're a not-for-profit located in a story, obviously, and I just wanted to introduce myself to the people that are on the call and everybody I've always been meaning to go to these board meetings. My dad ago, when he lived in in New York, but each time he was only on Tuesdays and I'm really happy that you guys are now online. So we have the opportunity to say hello, let you know about ourselves and what we're doing we're here to make good things happen and the way we do that we provide help to parents right now, and we've been doing this for the last two years, with homework, help and also with languages and with a lot of things that they need in order to make the most for their kids lives. You know to help their kids with school to help their kids. You know, learn new things. We do robotics, we do all kinds of stuff. Another thing that we do is we provide food security and we also do donations, so we've been distributing items and food one minute to people all over and we're very grateful for the support that we've received from the community. So if anybody wants to get involved with the story of values, you know you can go to our website. Storyvalleys.Com join us on Facebook and then finally, what I one thing that I also wanted to mention: the dog situation. I live in a story: I live right by the park. You know, as somebody who has a phobia of dogs I, feel like a prisoner in my home because of what's happened in the mornings. I go to the park. The other problem is the dog. You know leaving the poop on the ground when they leave the poop on the ground. Please somebody give them a ticket, you know, and the dogs, without the leashes, it's going to take some kid being mauled to death before something is done. It's out of control. I would like to think that somebody will do something about irresponsible dog earners because they might be miserable for everybody else anyway. Thank you. So much for your time and I wish all of you happy Thanksgiving, God Bless! Thank you Mr. Would you please put your information, your website or Facebook page in the chat sure in this chat over here? Yes, okay, thank you. So much I appreciate it. Thank you. Marie can I speak comment. Gloria, yes, go ahead! I just wanted to mention I agree with the people who are having the problem with Crescent Street Bike Lane, because it comes all the way down into dutch kills and we're having a terrible problem. Also, and as far as this city bank, Virtu, CitiBike virtual town hall, I, really don't feel that we need any more bank bikes in historians in long island city in Dutch kills. We have a problem on 36Th Avenue that we've been trying to deal with where they moved the bikes onto the street and took the parking spaces away from in front of the businesses. We were told that it was probably temporary while they worked on the train and now I know. George is trying to get them to re respond to us, because the streets underneath the train are done. The sidewalks are done, there's more than enough room on the sidewalk to put those bicycle racks one minute, and they continue to be on 36Th avenue between 31st and 32nd street. There's no reason for them to be in the street when they could be on the sidewalk, where the sidewalks were made big enough for bikes exactly. There has to be some control as to where they put these bike racks and they don't seem to be listening to the people in the communities and the businesses over there are suffering. Thank you very much. Thank you. Gloria Harry can I visit. This is the public section movie wonderful publicly to the public? Okay, thank you hi! It's you, Zois can I make a comment. Please, yes, I had wanted to make a comment at the last meeting, but was having technical difficulties and I really wanted to piggyback on what was just said. I am a parent of a disabled 16 year old, who has physical cognitive disabilities and is non-verbal before Evie mentioned how we need more barricades. I am here to tell you that these barricades impact our seniors are disabled in a very large way. That I feel the community needs to be aware of the closure of 31St. Avenue I can not tell you the man hours I have spent with Dok with the community board to get change. There is no reason we are denied access to a street for one yoga class. It is just unacceptable, as residents for us to do that Thursday evening. Here's a prime example of the lack of common sense. One minute I am driving my son to the doctor in the rain, and the entire train is barricaded, move a barricade, so I can take them to a pediatrician. It that's useless, 30 seconds and I want to know who I need to talk to other than D.O.T to get this resolved. Thank you 10 seconds. Thank you. I'd like to say something. I also have an issue with the first Avenue being close. I live around this area and every time I walk by or drive by, there's no one really in the streets at all. So what is the purpose of barricading all the all that space for nothing I, also work in Jackson Heights, where 34Th Avenue is being used so I understand that being barricaded and being used for the public, but here in Astoria it's common knowledge. That avenue is not being used at all. If my father who's eight years old needs to go to the hospital, am I supposed to get out of the car and move a barricade when it's not even being used like we have an Astoria park, that's been remodeled. We spend lots of money getting that park done so that people can be in the street, which is not even happening. So what is the purpose? I drive through those barricades, I and so do many other vehicles. The police see me. They say nothing, it's not being in force it's time to remove them. Are we allowed to respond to any other comments? I'm just asking Tom, I'm not going to I'm just asking. Well, let's make a comment, please that woman finished yes, I believe shows another. This is a community, that's very bicycles, there's so much traffic, yet barricaded they're. Not being used, okay, all these comments will be relayed to D.O.T. Maybe there's a solution here, whether the hours can be tweaked for the days for each week. You just work on that. Please make a comment. I'm sorry. The days are currently Saturday and Sunday from 8 am to 6 pm and, as one of the people just said, they drive through you are able to drive through people. Do it all the time and have since the inception of the open street? Yes, I'm driving through a street that's empty. So what is the purpose of barricading all right? Thank you. Okay, please, make a comment. Marie Mari can I make people are suffering, I'm I live in this neighborhood. We need to do something, I told the transportation committee meeting last month and it was not taking care of, and I've been told that you know the industry and on October, but you know it is in November people are suffering it's now cold. We need to take care of this as soon as possible. Please do so. Thank you. Amy. Please make one comment. Two minutes. Okay, even though I'm listed as a story boy, my name is Michael and I live in that area. I'm a single father of two children and I work, multiple jobs. One of them is as a delivery person and 31st Avenue I have witnessed, and I did notice in the chat Evie. I'm not sure if I pronounce your name correctly, you're saying that there's no denying of access, I counted, 35 people laying down doing yoga the yoga instructor came out as a car was about to go through, ran to pull the barricade almost causing an accident. So please don't say that axis is available when it's not and he motioned to the people laying down on the floor saying I'm sorry I can't do anything they're laying down on the floor. That is ridiculous. A lot of people are we waiting for someone to die, especially now we're 4:45. It's dark out. Let's reconsider this. Thank you, I feel like I came home again. This is fantastic. What you do you want to congratulate you and I want to let you know that I will be a regular and I will be here. This is truly democracy at work, so congratulations to each and every one of us is attending and caring. So much it's a pleasure. Thank you thanksgiving to everyone. Thank you and I would like to say something. I would like to say something two minutes. There's a lot of people on the chat saying for the 31st Avenue issue, where it's only on saturdays and Sundays, from eight to six, which is not true, especially on 32nd street and 31st street, that street they close from 8 am people that street particular is closed. Every single day, I live right in front of it. I can see the barricades every single day and sometimes now the problem is people will go there early at 7:45 and close the street for no reason and I have argued with people multiple times, I'm not closing it before 8 a.m. Problem is they'll do this early, but nobody wants to collect it at 8 pm yesterday, for example, not yesterday the day before yesterday, the barricades were there until 9:00 p.m, in the middle of the street. So when people are saying in the eevee and then that is not true one minute a minute- go there right now that the street is closed. I have nothing else, hello excuse me, I am speaking so and only I think the hours have changed recently to only the weekend. Correct me anybody, okay! So if you live right in front and they're closed other times, listen to what I'm saying to you, finally send a photo and send it to the board office. Can I make a comment? Okay, this is Richard Kazami I'd like to make one quick observation. This open street program, which I think is a great program. I'd like to see more streets. You know open promoting human power transportation. Things like that. I would say one thing, though this is a very successful program in Jackson Heights, because Jackson Heights has a huge problem with lack of green space. They don't have parks. The only parks they ever had were those little privately held green areas within those garden departments that were privately held. So they make a lot of sense and, as a matter of fact, existing parks like Travis parks, are basically on asphalt and similar to this we've actually I. Think in the past we closed a few streets up for these kind of available. I hope that some kind of discussion can be made where a compromise happens. This is a great example of where we could all compromise to give some space and sometime the because there are a lot of issues with the barricades. If people have to move them the majority of the time they don't put them back and if somebody has a child or an elderly parent, it's difficult, but maybe there's a way to tweak it in the future. Rudy. I'm sorry, yeah I have a just a couple of comments and comments. One is it for the bike League, which is my association. We have there's a lot of complaints there now everyone and nobody says that this bike lane makes sense. We don't say you know so you're supposed to use the bike he can use. The bike for 100 years should be news. It has no problem right. What do the right things and the cars you always look for? They saw the expense, the money yeah. You hear me how much money does a spend they could be sending otherwise something better than this by the way. Another question the 31st Avenue I go every day. The only thing about say using it was Saturday and Sunday when there was a warm day like 70 degrees. It was about five six people's street today for every day I passed today, maybe at least twice a day was nobody there and they have this. It can't go through. You got ta move there in order to go through it. It's not no sense today, so in 30 seconds. Thank you Rudy. All right, so take a look. I want to thank him. This is terrible. Sabbah Frasier did you want to speak hi? Yes, thank you so much for letting me speak. Can you hear me? Yes, okay, great I just wanted to say that I have been volunteering with the 31st Avenue open streets, and it's been a really positive experience. I'm a mother of three children and the parks are pretty far for us to get to and not every family is lucky enough to like, have a car and be able to get out, and so during the summer I thought it was a great experience and I think a real highlight for our community. I'm sorry significant demonstration of what we can do as a community when we come together was our halloween event that was very successful, well, distance, very safe and a positive thing for all the neighbors and I think it's the kind of thing that we can do going forward and I want to reiterate what everybody else has been saying that we have adjusted the hours for the winter. It's 8 a.m, to 6 p.m. If you do see some barricades out there after 6 p.m, feel free to pull them off to the side. We appreciate the help. We can only do what we can when everybody volunteers together. Thank you. If this is Dominic, Stiller yeah, just a minute, Dominic Eli. This is a public session. Yes, I would like to speak. So, I'm probably aside from the yoga class. I'm probably one of the people who uses the open street the most. No one is saying that this program is perfect, but the idea that, like we've been people have said, like oh we're, forcing people to show I d or like ask them if they live on the street is absolutely ridiculous. People can't get through all they have to do is ask nicely. That's it and then also too, in terms of like the protection of the street, people are saying how it's an inconvenience I think it's going to be a lot more inconvenience with, because if we have these crappy barriers that aren't being replaced like D.O.T and NYPD said they would be like someone's going to get hurt so like. Why don't we all work together to make it safer for everyone? Nobody is using 31st avenue when you know that so because the complaints are either one at a time for the rest of the community. Thank you not a debate one at a time. Please, because the complaints from people who are against the open street are saying two things they're like one. Oh, it's too full with all these yoga people and all these other people and then you're saying no one uses it so, which is it? Thank. You could I make a comment. Please two minutes the Sarah mentioned before the Halloween event and how successful it was on the 31st, Avenue Open Street correct. Well. I would like to note that I found it appalling, because a box truck shows up from the people's bodega that has hanging body parts and dECABitated heads which I did not find child friendly and maybe that's a little more traumatizing, so I think it depends on who you talk to and what their side of the view is in terms of how we feel it. I approached D.O.T I spoke with John O'neill I asked for a compromise. I don't want the program to end I, want fairness for the disabled, I want fairness for the elderly and basically, that's not what's happening. Everyone's commenting, oh Monday, to Friday no one's denying you I had to show Randy the yoga teacher. My son's disability play card, so don't were not asked. I was asked and I showed it, but I shouldn't have to there's no reason during the week that we should have the street closed. We are residents. Our input should be taken into consideration just as much as on the weekend. Take it barbecue Eli, it's great have a weekend for the children it's great but meet us halfway. You can't have it every day and don't tell me it's not closed today at 3 p.m. A fire truck had an emergency call and had to stop to move the damn barricade to get through. Are you kidding me? Let's wait for someone to die first. What if it was your parent I can't exactly okay says. Thank you for your comments. Anyone else want to speak, who hasn't spoken yet I do I wish to speak. Okay and I'd be recognized two minutes, sir. Yes, your name, please Max, Frankston I live on 20th avenue by Steinway for the past. Maybe year there are drag racers on 20th Avenue and it gets so bad that on the back window of the apartment, the fumes come in the summer, so I I've called the police. That's called the community board. Nothing seems to do it. Does anyone else notice it? Yes, okay, no, it's an issue of safety and, in addition to air and noise pollution, what can be done well? Have you called you've called the precinct, then? Have you I've called the precinct. That's called the Community Board Office, okay, I would also suggest you call three one I don't live too far from you and I have drag racing on 23Rd Avenue and you should call 311 when it occurs too, so they can track it right. Hopefully, we'll resolve this problem sooner or later. Okay, thank you. Something hold on two minutes. No, it says something simple: is there any way to get more garbage cans around Astoria got a chance for the most part on commercial districts yeah, but it's there's a problem: either they're not being picked up they're getting very full. The community is disgusting. Okay, there's a problem. Another problem, unfortunately, there used to be basket. Pickup is not as it often as it used to be I understand it's being worked on. Are you talking about a specific location, Broadway 30Th, Avenue I mean I've grown up in this community. I've never seen it this dirty all right. So there have been budget cuts of sanitation and biscuit pickup is not what it was several months ago, yeah and in front of businesses I mean if businesses could be encouraged to sweep up in front I, don't know something has to be there. Thank you. Anyone else, okay I, would like to get a motion to adjourn and just want to wish you a happy thanksgiving before we do that again. Thank you for being here. Second, thank you good night, Happy Thanksgiving Tom are you there? Did you take it off from you? Huh yeah I see a number of people. There I see some lady, but how can people talk they're, big.",
            "summary": "Thank you for having us welcome everyone to the November 17th meeting of Community board, one Queens.\nGood, evening, Captain Jenkins, and welcome to community board one Queens and please feel free to introduce yourself and tell us a little bit about what's going on in the 114.\nYou know, like I, said as an introduction happy to be here.\nOf what side, Queens bridge and Ravenswood got to do some interesting work, there, a lot of work with the you know, the federal prosecutors, as well as our local state out of Queen's district attorney's office.\nYou know working with my partnership, my partners, community affairs, NCOS.\nListen to community concerns, quality of life overall conditions, and you know, formulate a plan to address these issues that I've seen.\nWell, you know a lot of the biggest crime increase that I've seen since I've been here.\nYou know the body shops and the and the repair shops being that they have limited space when they want to work on vehicles and.\nSomeone will use that as an opportunity to jump in the car and drive off I attribute a lot of that also to the outsold outdoor dining, because people are trying to go into the restaurant or these 24 hour shops or a food truck, and you have the outdoor, dining tents or huts, which is giving them limited sight on their vehicle.\nI. Believe I took a call from Jimmy Van Bramer councilman Van Bramer about less than seven days ago in regards to gatherings and the lights, and that issue was directed towards the housing development commander and whatever can whatever plan he has with where he places his vehicles or how what he does with the light.\nI, think you know in terms of the agency's approach, but it's really traumatizing the children who are like nine and 10 years, old.\nI left a message for you, the other day, but I know that department of transportation has reached out to the 114th many times and said we would get some new barricades because they've been damaged, they're falling, apart.\nAny major gang activity issues in this community board at this time.\nWe did see an increase of like shootings, or what have you and just Sunday detectives came to each of our homes in front of in my building, I'm, asking about a shooting.\nIs not where they're able to freely be able to get back into the community centers get back into different activities to keep them occupied, and we I remember before I'm sure you have heard this before Brian when he was in that unit about how we trying to rid a lot of young people from joining these games or any other variations of games, because sometimes they go outside communities and other games are influenced by each other.\nWe could get it on an open, forum, 100 right that the small minority does get a lot more attention and the overall good that does happen in the developments.\nAnd, like you, said, a lot of the minority, get the majority of the press, and, unfortunately, there's Astoria.\nAnd also, you know, start to spread that outside of Queensbridge into the other development, basically into the entire community.\nLet's, not get this mistaken as it's only a housing issue like I said a lot of our crime is being driven off development with property, crimes.\nYou know it seems like crimes of opportunity, nothing that I can contribute to a gang, but.\nBut is there any way we can bring back some form of the community Council and the NCO meetings, because I think they're important.\nMy question: Can you speak about the impact of the significant influx of homeless people to our dutch hills neighborhood and how that's affected your metrics of crime.\nI was muted thanks for your answer, so you've, given the facts on the increase in homeless, but I didn't really hear any increase in your like changing your procedures and also I'd, be curious to know which of those four hotels are the permanent ones, and thank you well.\nCaptain Jenkins, we I just have a final question that came in the chat, sure about advertising or letting the public know about the build the block meetings.\nMoving, on public hearing item the New York Landmarks Preservation Commission approval to facilitate replacement of 11 windows on the West facade of the queen's father, clock tower I.\nYou know no garbage trucks on that street unless they're picking up garbage on the 20th, Avenue or they're plowing 20th.\nIt's going to be opportunity when Covid-19 is over, that you know whenever that is.\nIs that you know housing, preservation, development, HPD committed to going through a community process, because, right, now, the western Queens community, land trust and the Ravenswood tenants have been holding meetings along with Community board, one on the future of that site.\nThis it'll be public use or 100, affordable housing on public land, and they have to work with the community to come up with a vision for what it is.\nI think there's some concern also about 11105 and the lack of testing sites in the area, because the city Mg lines are blocks, long.\nWe know that there is going to be more contact, trace, testing and tracing in 1.05 they're working on that.\nThank you for all the help you gave along with Andrew or excuse me with Andres and Lisa Stone from the Ps 171 Claudia Kover for working on getting the four-way stop at 12Th, Street and Astoria Boulevard.\nRich is a borough president and Carolyn Maloney and Congresswoman were all there to support us and introduce themselves to the residents of the you know of this and hearing their concerns about how they're dealing with this issue, as well as being involved with this test and trace for Astoria and long island city of the project.\nThis is what a community is all about, right, we're in a pandemic, and we have this tragic incidence where the house, you know the buildings at a store of houses, has no heat and no cooking gas and community has come together and rallied around them.\nWe're meeting tonight to talk to you about one of the last phases of that work, which has to do with repairing and replacing the windows on this building.\nDutch kills park at the meeting of kind of Queens, Boulevard and Northern Boulevard, and the approach to the Queensborough Bridge there's some images of the building.\nHere for Congresswoman Carolyn Maloney, who also wants to wish everybody well thanks for giving me this chance to update her activities a bit and wish everybody a safe and happy Thanksgiving.\nWe were all at that event, Sunday at Astoria houses and the problems at NYCHA, and especially there have been something that Carolyn has been trying to work: on.\nYou know 45 families that have been without gas for over 50 days now, and this is especially critical with how are they going to cook for Thanksgiving, and that's one of the reasons that and a shout out to Evie to all the work she's been doing getting them hot food on saturdays.\nThank you for all your prayers that you do all that you all send to the residents of Astoria houses, because we are dealing with tough times and also I wanted to mention about a thing that even com, communication.\nAlthough our utilities are not separately paid, but it is included in our rent, so he's working on with NYCHA and other officials, or whoever else needs to be involved in these talks to see to it that those residents who are suffering and the story is suffering and not only the fact that we got so much construction going in and around us that it has become a hardship on our quality of life.\nYes, go ahead, sure, just very quick update for folks we're doing a survey, a city-wide survey on work and family as affected by.\nToday we had the district service cabinet meeting for the Queensborough President's office, and today sanitation made a presentation regarding winter scheduling, a lot of the local homes and businesses in our area.\nA lot of the restaurants in our district have made substantial financial input into these outdoor dining areas and D.O.T and sanitation want to work with them so that during they may not be the snow.\nYeah I want to wish you all a happy and a healthy thanksgiving and, as Marie said.\nWear, your mask, wash your hands and do everything you need to do, because when you honestly like I'm, not watching the show okay committee reports, community and economic development rod, thank you.\nGood evening we had our third zoom meeting regarding the work at Astoria houses, esplanade.\nWe're actually going to have it right at Radial park right next door, and that is to kind of again call attention to the issue of the residents not having gas.\nSo, we'll let you know when that happens, but wishing everyone a good thanksgiving, oh and we will be actually frontline foods-- is going to be providing thanksgiving meals to any family within the building.\nThe members really didn't have very many questions, except clarifications about what was happening within the building itself and then the recommendation that they agreed upon that they voted unanimously was to recommend approval of the certificate of appropriateness for this work and for future window.\nWhat we did not bring up was the fact that we need a letter of support from the board to share with the parks, Department.\nThe committee unanimously supports the plan, and the only thing we're going to ask for is for there to be consideration in this project and also in all future projects in our district and city-wide, for greater accessibility for those that, just for it to be more inclusive.\nThere will be designated grill stations, but in General Rainey Park, as everybody knows, is highly used by families and groups as a place to gather and hold events, including barbecuing, so to formalize that in a way there will be set picnic areas but understanding that people will not only use those areas.\nThat came up during the meeting and unfortunately the parks Department only held one official meeting, and there was a large group of dog owners that came and said that the way things are working right now is fine.\nSo I also know in my community visioning work that there was a big pool for a designated dork space, but because of off leash hours and a really big love from that from dog owners in the community.\nThere is a need for some kind of designated space for dogs, but it's not going to be at Rainey Park.\nAnd I do also want to say that, in regards to the dogs at Rainey Park and in response to to Tarad, there was a lot of support to keep the off leash.\nJust at Socrates Park in general, I know, they've been a lot more strict with dogs on leash in Socrates, so.\nThere has been a big dog issue at Socrates Park, but I think that they've gotten that under control.\nThey built it underneath the Triborough bridge, because many people wanted to keep the off leash hours in Astoria.\nPolicy, and I wanted to talk about New, York City, which has an obesity issue right now, where 22 of the population is obese.\nI agree with the people who are having the problem with Crescent Street Bike Lane, because it comes all the way down into dutch kills and we're having a terrible problem.\nWe have a problem on 36Th Avenue that we've been trying to deal with where they moved the bikes onto the street and took the parking spaces away from in front of the businesses.\nAnd I want to know who I need to talk to other than D.O.T to get this resolved.\nI live around this area and every time I walk by or drive by, there's no one really in the streets at all.\nIf, my father who's, eight years old needs to go to the hospital, am I supposed to get out of the car and move a barricade when it's not even being used like we have an Astoria park, that's been remodeled.\nWe spend lots of money getting that park done so that people can be in the street, which is not even happening.\nAnd I want to let you know that I will be a regular.\nI can see the barricades every single day and sometimes now the problem is people will go there early at 7:45 and close the street for no reason.\nI just wanted to say that I have been volunteering with the 31st Avenue, open streets, and it's been a really positive.\nProbably one of the people who uses the open street, the most.\nIn terms of like the protection of the street, people are saying how it's an inconvenience.\nNobody is using 31st avenue when you know that so because the complaints are either one at a time for the rest of the community.\nPlease, because the complaints from people who are against the open street are saying two things: they're like one.\nAnyone, else, okay, I, would like to get a motion to adjourn and just want to wish you a happy thanksgiving before we do that."
        }
    }
}