{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB6",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "Manhattan Community Board Six - Full Board Meeting - 11/12/20",
            "publishDate": "2020-11-13",
            "shortDescription": "",
            "lengthSeconds": "2:21:05"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB6",
            "normalizedName": "Manhattan Community Board 6",
            "twitterName": "Manhattan Community Board Six",
            "youtubeChannelName": "Manhattan Community Board Six",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "twitterHandle": "@cbsix",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "jl0Mc1K9FqY",
            "fillerWordCount": {
                "uh": 443,
                "um": 250
            },
            "readTimeFullTranscript": "83 min read",
            "readTimeSummary": "13 min read",
            "wordCountFullTranscript": {
                "years": 29,
                "chair": 24,
                "report": 23,
                "street": 22,
                "work": 20,
                "ballot": 20,
                "state": 19,
                "member": 19,
                "budget": 19,
                "bill": 18
            },
            "wordCountSummary": {
                "years": 9,
                "street": 8,
                "state": 6,
                "leadership": 6,
                "streets": 5,
                "areas": 5,
                "housing": 5,
                "work": 5,
                "boards": 5,
                "program": 4
            },
            "fullTranscript": "Oh, there you've got tournaments in the background Rick yeah, but it's two bands we're live now. People Kyle you're you're good to go. Oh my god. Let's get started, then all right so welcome everybody to the November 12 2020, full board meeting of Manhattan Community board six. My name is Kyle Thaide and I'm the chair of CB6. This meeting is being called to order at 7:00 pm and tonight we are joined by Secretary Seamasara, District manager, Jesus Perez and Assistant district manager, Cody Osterman, but before we begin just some granbles out first, no one may speak until granted the floor. Cb6 members, if you have a question about board business or wish to make a motion, please raise your hand through zoom. If you click on the participants icon, the participants panel should appear and you should find the raise hand function there if you still are having any technical difficulties, click on the chat icon and you can express your difficulties there. Next. This is most important. The chat function should not be used for CBS or questions about agenda topics. All such remarks should be made on the record. By raising your hand, through zoom chat should only be used to alert us to any technical difficulties you are having or to state in writing information like an email address, for example, that was already stated allowed on the record during the meeting so no side conversations please when a member is given the floor to speak, I will identify you and you can unmute yourself so that you can speak. We're also required by executive order to create a verbatim transcript of this meeting. So everybody please keep questions and comments, succinct and germane to the discussion and finally, members of the public in lieu of submitting a speaker slip to speak in the public session. You can register to speak in the public session by using the q and a feature of zoom and posting your name affiliation to the topic and what topic you're wishing to speak about this needs to be done by 7:15. So the agenda for tonight's meeting was distributed ahead of time by the board office, was posted online and appears on the screen before you. If there's no objection, we will adopt the agenda as stated so board members. If you object to adopting the agenda, you may raise your hand through zoom at this time. Seeing no objections. The agenda for tonight's meeting is adopted. Now the secretary will take attendance by roll call hi everyone good evening. If I call your name, if you could just verbally share that you are present. That would be great I appreciate that all right, kyle, president okay I see a body present Martin Barrett, President, Elvi, okay, I do not I. Do not hear her he's excused all for the email to the board staff: okay, Joan Barrenbaum, President Matt, Bondi, Matt, Okay, Claire Brennan, I'm here, Jim Collins, Jim, Okay, Dan, Divine, Dan, Okay, Beatrice, Disman, President, Janine, D'onofrio, here, rich edgars, Rick eckers, here all right: Andrew, Gross, Andrew, Adam Harkey, here molly hollister, here, page Paige, okay, yusef Khalid, here Abigail Cruzmark I am here: Anton Walner, here Kavitha Matthew, here, Sandra Mckee, here rich Mintz, here, Philip Napolitano, Patel, President, Matt, Roberts, President, Gene Santoru, I'm virtually here good enough. Frank, Scala, Frank, Lawrence, Shearer, Present, Anne seligman, here Lou Sabrisky Lou! Are you here? Yes, Yo, okay sounded like no sean Sherman Sean. Are you here, Sandra Sherrod here Letty Simon, here, Susan Steinberg, Anju Surish, here Mark Thompson, here korean Vanderdon, here Brian Van, Neufenhoeven, President, Ronnie, White Ronnie? Are you here and claude winfield, okay I believe we have cora fantastic all right, so we'll move on to the elected and agency representative reports, so holding our meetings over zoom has allowed more of our district's elected representatives to join our meetings each month, something that we're obviously very grateful for so to be respectful of everyone's time and that often elected to have multiple meetings to attend a given evening. We're asking that all reports be brief and that we refrain from duplicating what other electeds have already said. There are very topical things going on right now, so I'm sure a lot to say so. Please do be succinct and concise so going in the order of people who rsvp'd we first have Senator Hoyleman Senator Holmes tonight does not look like he's joined yet. Okay, do we have Pedro from Council member Rivera's office, Sarah Newman from County Number power's office hi, I'm here I can just give a short update unless anyone any other electeds are here beforehand sure. So, a few different things going on. Obviously, right now, everyone's focused on managing the recent uptick in and covered cases, but council member powers has also been looking ahead to make sure that we're preparing, for you know in particular what Midtown and the transportation system need to be ready for economic recovery, so Councilmember powers published an op-ed in cranes last week. You know talking about how safe, reliable transportation is going to be a really key part of midtown's recovery, and he talked about a few different items that he thinks we should prioritize. So that includes more space for CitiBike stations, including working with developers to place CitiBike stations in you, know, pops and other locations using new development to increase accessibility in subways and further pedestrianizing streets in Midtown other than that we've also been focused on you know. Some street cleanup work in the district, we're contracting with Ace programs this year for extra cleaning in the district and last weekend they helped out with a great community cleanup in the skytown area, both on 14th street and in stycove park, and they also to a few weeks ago during early voting, helped keep some poll sites clean in those areas that we're seeing you know long lines and lots of extra folks in the area. So let us know about any spots that you see in the district that you know might need some extra cleaning. They have a regular route that they're doing. But you know if there are any spots that are emergencies, then we can definitely ask them to deviate from that, and you know head on over to those locations. So I'll put my email in the chat it's S newman at Council.Nyc.Gov, and if there are any specific locations that you see there needed some extra street cleaning, then you can send them my way, fantastic. Thank you! So much Sarah. Next up, we have Taylor for Congress member Maloney's office, hello. Let me just pull this up good evening. Everybody. My name is Taylor Abruzzi, I'm from the Office of Congresswoman Carolyn Maloney. The congresswoman is heading back to DC next week with what we can only expect to be a heavy plate of work with some of the issues we're seeing in the transition process. I'm sure, in her role as chair of the Oversight committee, that she will be keeping a close eye on all aspects of this. In other news. This past month the congresswoman fought and succeeded to get the administration to agree to pay back millions of dollars that it took from the fdny's 911 treatment program the census ended and though we will not know what happens in regards to accuracy and the time it takes to get the data for a little bit. We do know that New York City did pretty well, given the circumstances and the Census Bureau says they were able to enumerate almost all the households, even those who did not sell respond. The congresswoman has continued her fight, checked the USPS, getting additional documents and information regarding the slowdowns and changes. She also introduced a bill to saving the civil service Act to block the President's recent executive order to reclassify elements of the civil service to make it easier to hire and fire Federal employees, Congresswoman Maloney, subpoenaed customs and border patrol over their lack of investigation into lewd and threatening social media posts made by its agents. Her request for a report on latino representation in Hollywood was accepted by the gao she released documents following a department of justice settlement with purdue and sackler families. She called on usgs director James Riley, to be removed. After an inspector general investigation, determined he'd retaliated against a whistleblower she's, seeking information on the administration's efforts to withhold federal funds from cities deemed anarchist jurisdictions, and this week in light of the transition issues mentioned earlier, the congresswoman joins other House Committee chairs and sending dozens of letters directing the White, House and federal agencies to preserve documents in accordance with the law. That is all the updates I have for now, although I probably missed a few. As always, you can stay updated on the congresswoman's work by subscribing to our newsletter or visiting our website or reaching out to a member of our staff. Thank you. Thank you. Taylor. Next up we have rebecca from Assemblymember Court's office good evening. Everyone. This is rebecca from Assembly member court's office. I hope you are all doing well. I only have a few notes for tonight we have been getting some calls about the new homeless, shelter, opening up on East, 40Th, Street and Lexington avenue, and we wanted folks to know that our office has been in conversation with the department of Homeless services and the agency that will be running the shelter and we are confident in the measures that they are taking and we will be in close touch with them, as the shelter opens up for residents most likely at the end of this year, and as always, we are still helping folks with unemployment, tenant resources and, amongst other things, so please reach out to us if you need help with anything stay safe, and that is all I have for my report. Thank you, kyle. It looks like Claire is. He do you have a question. Sorry, it's okay, I've actually put it up, is Sarah still can I ask Sarah a question about the Ace program. There is someone I'll email, her, I'm still here. Okay, I just wanted to know. Do they like to have a regular schedule, or is it just kind of these one-off volunteer days where folks come out, so they have a regular schedule. They work I, believe six or seven days a week and the schedule focuses on you know it's throughout the district, but focusing on specific areas that we've noticed are outside of bids that are already you know, getting extra street cleaning services or areas where we've gotten a lot of constituent complaints in the past few years, so they'll be focusing primarily on that they have five different folks in their cleaning crew who are going to specific areas. You know on different days, but in addition to that they can do one-offs both like community events but also like. If there's a specific area. That's you know outside of their regular route, but really needs an extra cleanup. Then you can, let us know, and we can see if they can deviate from the route and go over that day. Thank you. Thank you. Next up we have bryce from Assembly member Gottfried's office. Yes, thank you very much. Can you hear me? Okay, hello, yep, I'll, be very brief. This month, Assemblymember Godfrey is joining with Senator Hoyleman to offer free flu shots next Tuesday between 10 A.M and 3 P.M. It will be across town in Chelsea, outside Penn south, at the southwest corner of 26Th Street and 8Th Avenue. You need to rsvp to make an appointment. You can call 212-807-7900 or via email, Godfreedr Nyassembly.Gov or look at his facebook or twitter. Thank you very much. Thank you. So, going back, we have Alfredo from council member Kayla's, so we'll become rejoining us later, or will you be giving the report with right now the council member will be joining us, so he will be given the report. So I will give my time to the next person. Thank you. Thank you. Sam from Senator women's office. Will the senator be joining us or will we be delivering the report? Senator Hoyleman will be joining shortly. Okay, thank you. So next up we have the president's office. We're told that thank you. So finally, we have Joe pasculo from the Grand Central library. Joe welcome, hey everyone. It's been a while have not seen you. We have not really been open, so there's been a whole lot to talk about, but I definitely wanted to stop in because it's kyle's, you know first day, I wanted to make sure everything went well and also to congratulate molly. She did not get impeached so, but no, it has been a long time since I've been here a bunch of the grand central library workers were scattered about the system. So right now, I'm at 67th street a lot of people are at Webster, really there's no information as far as Grand Central reopening at the moment, I do have a quote here from the branch manager at Grand Central. It says, there's no info on reopening. Unfortunately, it's all mixed up with phase two success quote the general situation on and on we've been told to prepare all libraries that are closed for a longer than expected closure, but nothing should be read into that than the lack of staff to cover that many locations under current conditions and right now they call the staten island libraries. They were about to go into phase two and they've been brought back to phase one, because the numbers are really bad over there. So right now, Grand Central is probably going to be closed if I had to take a guess, probably till the spring, so I do not have any programs to really talk about. Nor do I really have any information on us reopening, but I did want to show my face. You guys are not going to get rid of me that easily it's good to see so many familiar faces. We'll. Definitely you know reintroduce ourselves when the time is right, but it's good to see everybody. Thank you thanks for joining Joe and definitely to keep us updated on the libraries in the district thanks so much next up we have Michael Stinson from the controller's office. That's me, yeah! Actually, I just wanted to let you know I wanted to contradict Joe a little bit, because actually our book club from Grand Central is still going strong and I. Think there's like a music club, that's happening too. So, if you're not on their newsletter, you know we may not be able to see him in person, but the library's, not let's still not letting us down. Yeah I. Think I'm just I'm the only grand central person at 67Th Street, so I'm really focused on. What's going on, there I really do not know what the other Gc people are up to, but I know that they are doing some sort of program, but I've mostly been like a 67th street guy at the moment. So do not worry, I promise. You, though, once Grand Central is open. We all huddle and you know kind of get back into the swing of things. My presentations will resemble the you know the way they were in 2019. Well, welcome back, it's nice to see you! Thank you. Thank you. I'm sorry, Michael! Please go ahead now. Hi everyone, Mike Stinson from Scott's Junior's office I just have two quick updates from our office. Today, comptroller Stringer announced support for a breakthrough proposal released by the New York Taxi Workers alliance, to address the taxi medallion crisis that has led to widespread financial devastation among drivers whose medallion values plummeted. The taxi workers alliance plan calls on lenders to write down outstanding loans to a maximum of 125 thousand 000, allowing medallion owners to repay loans on terms they can afford. With current earnings. Under this agreement, the city would act as a backstop for medallion loans held by individual owners. After reviews. After reviewing the proposal, the comptroller's office has concluded that it offers a comprehensive risk management approach that could reduce future liability and costs for taxpayers and about two weeks ago we sent a letter to mayor De, Blasio and gregory Russ from NYCHA to address alarming ventilation, deficiencies and other conditions in NYCHA buildings that leave residents vulnerable to a potential second wave of Covid-19 during the winter months. In our letter, the comptroller called on the agency to expedite capital projects that address chronic issues across New York, City's, 326, public housing, developments from poor ventilation and elevator outages to broken boilers and mold outbreaks that will become even more dangerous when colder weather keeps residents indoors and I'll. Leave you guys with that, because I know you're. You have a tight schedule tonight, but thank you. Thanks. Michael I see that Senator Horman's joined Hi Kyle nice to meet you Maria. Congratulations! Thank you. Looking forward to working with you a couple of announcements, I just wanted to say hello to everyone. The governor signed a couple of bills of mine this week. One is a bill that will strengthen New, York's anti-slap statute. Slaps are strategic lawsuits against public participation and their lawsuits that are filed by powerful people or interests, usually business interests, sometimes real estate interests. But the number one filer of strategic lawsuits against public participation is none other than Donald Trump. He sues a lot of people to silence them. You probably have read about some of his lawsuits. He sued miss America once he sued Bill Maher, he sued people who oppose his developments he's suing the Hamilton project, which has those billboards. In times Square and I had a time square press conference last week that Sam Vasquez who's our colleague who's on the line with me helped out with, and the bill will now create. A I did I call it Hamilton project I meant to call it Lincoln project so confusing my my founders here, but the although Lincoln was not a founder, so I'm just really screwing up. But what I mean to say is that these lawsuits are often filed, they're, often baseless and frivolous and they're used, so that the subject of the lawsuit the defendant has to spend a lot of money and they're, often in a less well-positioned. Positioned of power and are unable to continue with the lawsuit, often it's a defamation suit, and so they end up settling and as part of that, they agree not to speak out any longer against the plaintiff. So another example is Harvey Weinstein, who sued for defamation against some of the women who accused him of misconduct in the workplace and someone who some of you may know has been a defendant in one of these lawsuits is Michael Mckee, the Treasurer of Tenets Pac. He testified at a city council hearing a couple of years ago and as a result, the rent stabilization Association, the Landlord lobby, sued him for speaking out in support of rent stabilization for 40 million dollars. So these lawsuits moving forward will now require if a judge finds these suits to be for the intention of stifling public speech or journalists or critics, the plaintiff will have to pay attorney's fees. So that's going to bring New York up to the level of anti-slap lawsuits as other states like California. So I'm very happy about that. The second bill, the governor signed of mine, is what we call the quit the gym bill. No longer will your gym memberships be automatically renewed without you actually opting into that arrangement, and if you, for example, sign up for Gym membership online or any other online subscription service say a quote: unquote free offer if you sign up online and opt in you'll, be able to cancel that membership. Online I had two constituents aged 89 and 90, who were asked by New York Sports Club to actually physically go to the New York Sports Club office during Covid-19 to cancel their gym membership. That's completely unacceptable and with this new law that the governor signed, you'll be able to cancel your membership and the safety and convenience of your own home, and then I wanted to mention that Councilmember Keith powers and I have been advocating in grand Central with the MTA for rent relief for small businesses there, and we worked on an arrangement with the MTA, where the rent by small businesses will be forgiven for a certain period and moving forward. The rent will be based on how much the small business actually is able to accrue. As we know, foot traffic has been a minimal in places like the grand Central Business terminal. So this is really going to help the small businesses out. We think that's a model that we'd like to see put forward and a bill that I carry with assembly. Member Harvey Epstein called the save our storefronts act. Look for save our storefronts act online, there's a coalition of small businesses that are joining behind us to try to get this bill passed and then finally, I want to tell you that I am participating. I'm participating in a Covid-19 vaccine trial, the one by Pfizer and I'm still standing I. Think I got the vaccine because I had some minor side effects, but we're all very happy that it's showing you know a 90 plus percentage, effective rate. So, hopefully you know this vaccine will be distributed to the public. The government has spoken out about how it needs to be distributed in an equitable and fair way, particularly to communities of color and lower income communities, so I'll be supporting him in that endeavor and also as the issue of vaccines is pertaining, pertains to general confidence that we have in the next vaccine. I'm glad that we're going to have a new federal administration, that's going to usher this vaccine through and get it to the public. That's my report thanks! So much krom, also brad. We have to thank you, our own saint, anthony in the district for finding two wallets and returning them to books in the neighborhood. That's a great story! Thank you. Thank you. So much we have a question. I'll tell you, in addition to two wallets I found an umbrella on the way, so brad I have a question for you, dude. Whatever he happens, to know what happened with the Michael Mckee Dude Michael Mckee is he did they throw it out, or is he still fighting he's still fighting we're hopeful that this bill, which is now a law, will encourage the plaintiffs to drop it? This is, hopefully Susan going to be one of the more immediate results of the governor signing the bill. Thank you for your hard work. All right. Thank you once again, senator for joining us and for the report and congratulations on all the legislation. You're able to get passed next up, I see we're joined now by Pedro from council member Rivero, Hey folks good, seeing you all glad to be back always with you. So obviously we're you know in terms of our of our office's work on the legislative front. Carlina is chair of the hospitals Committee, so we are obviously paying very close attention and to the recent spike in Covid-19 cases in the city, we are constantly in communications with the private and public hospitals to ensure that we do not run into a supply issue again, should hospital cases surge along with the positivity rate, so those updates happen quite frequently. It looks like we're in pretty good shape right now, even for you know worst case scenarios, but we're constantly checking in to make sure that there's no disruption to those supply chains. In fact, a lot of other agencies are just in case discontinuing use of n95 masks and providing them to the hospital and Clinton network and using lower grade mass that are still safe, but that do not involve you know longer term exposure as hospital workers would so we will be sure to continue our work on that in terms of legislation. We recently passed at the last stated meeting or sorry not passed, introduce a bill to correct a wrong that we think has been on the books for way too long. The city was still using the phrase in certain co: administrative codes, mental retardation and we introduced a bill that would replace that wording with intellectual disability, which is a much more person-centric wording that the disability community is quite pleased with and that we want to see move forward as quickly as possible. We have some great advocates from the disability community behind us and we're very proud to lead the effort on correcting that language and not having it exist within our laws anymore. In terms of some park updates. I know this board. I. Think I actually had the pleasure on voting on the design at one point has been looking at Albano Jr. Playground playground for quite a long time. Money was allocated under rosie mendes to that project and the MTA has been holding it up as part of a an alienation agreement between them and the city or the parks Department as part of a combo of several park locations that the MTA has either an easement or ownership of. So we've been in touch with the governor's office and we're very hopeful that, with a last push from his office onto the MTA, we can get this agreement over the hump and start work on that project, hopefully into next year and then finally, an update because I know CB6 works a lot on complaints regarding phone booths. We were, after a few years, actually working on a series of phone booths throughout the district. It looks like link. Nyc is finally moving forward or do it it's. Finally, moving forward with removal of many of our more troublesome spots. We've actually had a couple already removed, one that I know of in the in the CB6 area. Off of second avenue in the 20s- and there will probably be a few more some, but not all- will be replaced by a link NYC kiosk, but regardless we're looking forward to a dramatic drop in complaints related to these troublesome phone booths. So I do not want to take up any more time. I want to thank you for all your work and I'm ready for questions. I think I see a hand from gene yeah, hi Mr Correa. How are you anyway? I just wanted to say: I was very impressed by your council members performance on the panel about open streets last night and I hope that other people on the board I believe it's been recorded. Other people on the board can watch it. I'd urge them to seek it out, because her position on open streets and her vision for them is something that we shared when they first came out, and we complained that the mayor had chopped these things up into unusable bits rather than the sort of networking and freeing things that they could be for people living around the city to get around in the age of Covid-19. So I just want to point that out to people and we're looking forward to working with you and her on, hopefully, updating and upgrading all those things in the near future. We I appreciate that gene. You know it has been a difficult issue. The city has tried to discontinue I'll, say the nicest phrase discontinued use of many of these open streets that were created in recent months. We think that they need to be given a chance, and that means in many cases, city resources where strong, volunteer networks do not exist to be able to keep them up and I would also add that you know and I think you may be getting a presentation, but there will be some changes on the east side in terms of the bike network, where we're looking to expand protected bike lanes to Houston Street and to avenue, C and I. Think some of the treatments on Avenue C are getting into the very southern part of CB6, but we're really looking forward to that, because that's going to be essential in absorbing some of the the East River Esplanade Bike traffic that we currently have that we will lose access to during ESCR construction. So the idea is to basically have Avenue c serve as some of the for some of the overflow as well as first and second Avenue, since Houston will be hosting a protected bike lane. Thank you. Chris I see your hand up as well. Yes, thank you. Hi pedro I just wanted to alert you, I'm not 100 sure if this is still in your district, but when you mention phone booths we have been CB6 has been asking for quite some time now on the request of the 29Th Street Association about two particular phone booths around 31st and Lexington. So it can, if those can be kind of fast track, that would be great well, we will. We will take a look at them. That is our district by the way. By the way. Thank you you're here. Will you be speaking, or will the assembly member be delivering his report today? Jeff Jack? Are you there hi cody? Do we know if we, if the assembly members joining us or will Jackson, be delivering that report? I do not know. If he's on a meeting yeah sorry assemblymember Epstein will be he'll, be joining us later on the evening round, eight will be joining us. Okay, no problem. We are going to move on in the agenda. So please let us know when your representatives join us so that we can have them speak moving on zeus. Are there any members of the public who would like to speak tonight? Yes, so the public who has registered to speak Ms Daniela schill, the graduate student at the CUNY Graduate center and she'd like to speak word about the restaurant meals program. All right welcome, and please do remember that you have about three minutes. Okay, perfect! Thank you so much for having me good evening. Everyone, as said my name, is Daniela Show, I'm a graduate student at the CUNY grass center for public health and health policy. I'm also a resident here in community Board. Six I've lived here for several years: I wanted to speak to you all about the restaurant meals program and the benefits that it can bring to our community both for local businesses that are struggling right now, especially with rising cape towns and the potential, for you know, indoor, dining disposals and the residents that call us our community home. So due to the pandemic, a lot of our residents have been struggling with food insecurity and a lot of businesses have been struggling to get revenue that they need to. You know, stay afloat. In these times, some of the most vulnerable have been people who rely on snap benefits, particularly elderly, disabled and homeless populations, and all these people are unable to use their benefits on prepared foods. Many of these people may have trouble preparing meals for themselves or may lack the space to keep these supplies that they need to cook food and, as you can imagine, it's a lot more difficult. For example, my grandmother to prepare a meal than it would be for me to do so. The restaurant meals program would allow for these specific populations to use their existing snap benefits on hot foods at restaurants and Delis and other food service places. A lot of states around the country have seen a lot of success with this program and I. Think a program in New York state would also bring a lot of benefits, both in terms of increased revenue to restaurants and increased flexibility for people when it comes to using their snap benefits, so I think it could bring. You know a lot of really good things for Community Board sticks. The reason I bring all this up is that there is currently a bill in the state Senate addressing this issue, and it would not make an impact on the budget. It would be net neutral. I know the community board does not deal directly with you know, promoting legislation, but I think it would mean a lot if the community board would show support for it through a letter to the state Senate or through some other kind of support for this issue. It could really be a very big help. Thank you for your time and if you have any questions or any clarification points, I'd be happy to do to clarify all right. Thank you so much. Thank you for respecting the time as well. Please do follow up with us by email if you are interested in working with one of our committees on that or working directly with the office on that as well. So please do follow up with us. Thank you. So much just clarify that, in fact, the board, often our resolutions, are in fact on support of specific legislation and encouraging that to get passed. This sounds like a great program. Both the restaurants and the elderly population. So I think it would it you know. Obviously we need to learn more about it, but it seems like a good, a good program for a resolution. Okay, thank you. I'll follow up also Jeannie Dinocrio requests the floor. Thank you, hi Daniella, just a question. Are the restaurants familiar with this program? How familiar are they yeah? So restaurants are allowed to join this program based on their own willingness to do so they have to apply, and if they choose to become part of the program they can, you know, sell their food to people who use ebt benefits and if they choose not to participate, they're not mandated to do so. It's very much restaurant oriented and person oriented, so you do not have to mandate anyone to do anything. They do not like to do so. My question actually is: are they already involved? Are they are they aware of this block by block? Because it's such a great program? So I'm thinking that you would might if you get a lot of letters from restaurant owners that might be really helpful to you. Oh okay, yeah I have not. We have not spoken to anyone personally, yet it's more of a state legislation issue, but that would be absolutely wonderful. It's a very good idea. Okay, thank you. Thank you all right he's. Did you see me another speaker, no other speakers, but it looks like use of college requests before you stuff. Please yeah, just a quick point. I would ask you know how to follow up with us on the business affairs, the basic committee, just because, like the point that was either mentioned, that was mentioned before it's either a partially a kind of knowledge and outreach question for a lot of the restaurants that we speak to and then there's the legislative component. So we're actually meeting next week happy to give you my email or follow up after and see if you're able to join us, then or the following month. Okay, that'd, be wonderful! Thank you. Thank you all right. So we'll now move on to the adoption of the previous meetings for board minutes a note. The minutes from the October 14th floorboard meeting were distributed to board members ahead of the time by the board office. In those minutes, the vote count for resolution. 4B was incorrectly listed as 45 in favor. Zero opposed zero abstain, zero, not entitled the vote. Count was actually 42 in favor. Three opposed zero abstain, zero, not entitled. The minutes will be amended to correct this era. If there is no objection, we will adopt the minutes from that meeting board members. If you object to adopting the minutes, you may raise your hand through zoom at this time, Steve injections, the minutes from the September 19th full board meeting are adopted and they will soon be available on the CB6 website. So now I'll begin my chairs report and before I begin I just want to recognize that yesterday was veterans Day. So I'd like to thank those within our board and our district who have served or have family and friends who have or are serving in the armed forces. As we all know, these individuals are confronting the atrocities of the world and so we're always in debt to their sacrifices. So I do want to mention that before beginning I also want to express my appreciation for the previous executive committee for their leadership over the past several years, and specifically I'd like to recognize molly hollister for her tenure as chair and all that she was able to accomplish I know we keep saying it but honestly molly. Thank you so much for your leadership as the chair for the past couple of years and lastly, I want to thank all of you for demonstrating your faith in the new Executive board. Our new leadership understands the gravity of the challenges ahead and is amped up to address these issues head-on, with shared vision and passion. So over the next year, we're going to focus on increasing engagement within our board and with our district as a whole during a time when everything is being conducted remotely- and this begins with a renewed sense of purpose and meaningful approaches to our district's needs. So in the next few months, we're going to be rolling out efforts to enhance remote partnership among board members to build a leadership pipeline and new ways of engaging the public in our processes and decision making, and it's my hope that you know we establish our community board as the think tank of our district, a place where ideas can interact where we can think outside of the box and where things that seemed impossible yesterday can finally begin to become a reality. So to accomplish this I'll be working closely with our executive committee to ensure that we're establishing a space for innovation, difference in ideas and approaches and collaboration, and so again my call to action to each of you as we go forward, is to be proactive, creative and engaged like never before. So it's an exciting time, there's a lot going on, and so our passions and energies are going to be. You know needed by our communities to address these issues some housekeeping, so my tenure obviously began last week and we've reorganized some of the committee leadership and I'd just like to mention that now so gene santoro is the co-chair of transportation and public Safety Phil Napolitano is now the vice chair of transportation and public Safety. Kevin O'keefe is now the chair of parks and I also want to take some time to thank Pam Vassell, who stepped down from that role for her service on this board and on this committee for the past several years with that Jeannie Dinofrio is now the vice chair of parks and Claire. Brennan is now the chair of business affairs and street activities with Anton Mallner becoming the vice chair of Basa. So I'd like to just congratulate everybody in their new leadership roles and to thank you for all the work that you've done aboard before and really looking forward to moving forward with all this energy to address these issues in our neighborhoods. So that's it for me with the chairs report, so I'll turn it over to Jesus now. Thank you. Kyle I'll. Be brief, just let the wanna let the board know that the comptroller's office will be conducting an audit of all Manhattan community boards, compliance with the city charter and with New York City Administrative code requirements for meetings, public hearings and websites. One of the things the comptroller's office will be looking at is whether each community board takes minutes at their meeting and post them on their website in timely manner, as you've heard before. Taking minutes is an important part of board service, and this is one of the reasons why so if the CB6 office has been in touch with you regarding overdue minutes, please submit them right away or get in touch with us. Thank you very much. Thank you. Jesus moving on Brian with the Trans report, hello, everyone here, let me give you the treasures report. Our budget summary report for our board for November 2nd showed that our personal services budget for the year is 228,000 321 and we have a balance of 168,018 with 60 0202 spent or obligated current budget for other than personal services. Excluding our rent is 140,659. This figure contains 110 0185 of our retained street fair money, and our remaining otps budget is thirty thousand four. Seventy four. We have the same numbers as the last report, a balance of thirty thousand two, seventy four with two hundred spent or obligated. Finally, we have a rent budget of 162,935 and it has now been used to pay our rent obligations for the remainder of this fiscal year. Does anyone have any questions all right? Thank you all right. Thank you. Next up, I'm pleased to welcome the Manhattan borough president Gail Brewer. Thank you very much. Kyle. Congratulations. I also, too, want to thank molly for incredible leadership. Both of you make us all proud, so I do not know what to say, except congratulations on all of your work. I was just thinking in terms of Kyle suggested about thinking outside the box, which is one of my favorite activities. Implementing is always a challenge, but two examples. One of course board five is looked at a little bit, which is this issue that I keep talking about, which is the public realm or public space are I. Think community boards are really the place to try to work on that, because it is even today so complicated getting calls about what the streets are supposed to be used for and I think there are about 20 agencies that think they're in charge. So it would be great to have your ideas and then formulate it so that it could be something that we could make suggestion, perhaps for the next mayor, but anyway that's one topic and the second one that I just heard on board five, which I had not thought about before. To be honest, every time I hear a green new deal. You know me if you do not have specifics. I go probably say a bad word. What the hell does the green new deal meet in New York City I can tell you that I was in the council. I spent I do not know three years at least because Bloomberg to his credit said you know as part of his plan NYC every building had to go from six oil to four oil to two world I had on my desk the most disgusting jars of these different types of oil, because I really did not know what they were and then, of course you know you go to electric. Do you go to gas? You go to you know Jen. It was all very nice and sideways I spent so much time, literally going door-to-door knocking on doors and excuse me, you can no longer do sick. So that was my small contribution to this green new deal and we could talk about trees, there's so many parts to it. The one of the members of board five said something: I never heard something about. The concrete I did not understand. One word he was saying and then today, in other words, how you and he wanted to- you- know, talk about it as a capital issue. What you mix in the concrete I got as far as asphalt. I know a little bit about asphalt. I know nothing about concrete, and but it certainly sounded to me like something that was part of this green new deal, and then today, I was in a building that a brand new commercial that I'm going to call it HVAC system. It was not. It was so much more complicated. I said to the contractor a stupid question: can you open the windows? That's my idea of air. No, you can not open the windows, but he had Blah, which sounded to me like a green new deal kind of a brand new, I'm going to call it hp A6, not that anyway, what I'm trying to say is you know, there's no there's. You know Lee Gold silver so on which probably does not mean much anymore and then there's the efficiency and it goes on and on, but there's something kyle I think that you could help us with. What exactly does this mean? I mean we're not we do not have sun necessarily for the solar. You and I are not going to have windmills or win things on our etc. What does it mean? So I do not know something to think about because, as we move into hopefully a better situation in Washington, it would be nice for us to know what we actually want. So that's one topic, but I do want to thank you because you know a lot of people talk about affordable housing, but but the fact that you've been working with core and DHS at the adult family, shelter that could come to 40th and lex. That's important and that to me is the kind of leadership and if we have the opportunity- and we are calling every hotel in Manhattan to say, are you available to be purchased? That could be a small silver lining of this god-awful pandemic. I do not know we're trying, because I love the papers today they said Brooklyn cost more than Manhattan I love. That was great. Everybody pay all your money in Brooklyn and we can get cheaper rent we're not going to last very long in that kind of scenario, but we have to take advantage of whatever we can and the affordable housing is the number one challenge. So I know that everybody's thinking about it we've got to find a way to actually implement ideas and bring a 4000. I know. You talked about the veterans, I'm very supportive and I will tell you that the oath, which is, of course the office of Administrative trial and hearings on November 18th, is having a special discussion of how that agency can be supportive of veterans. There are a lot of veterans, for instance, as you know, that work in Defender world and other places where they oh feels they have not been responsible, but that's a good idea on November 23rd in our office, working with HPD we're doing a tenant virtual at six o'clock. The information is in our newsletter, which I think you all get it's mentioned today in our newsletter and it'll be on our website. I will say that in terms of voting, I do not know whether you had this issue, but I know that early voting is terrific. You can talk about the long lines and so on, but the main issue is we can not use schools, they're, very upset and I. Do not blame them. There's one thing on election day when the schools are closed. That's the general election, but this is the early voting and they're, understandably so upset. So we all have to work because I spent a great deal of time working with the board of elections and a lot of people say no I will not have elections in my building, and so maybe there's something else that we can come up with. Maybe you could look to see what did exist for early voting in board 6 and what else could be preferable if there were schools, there's also a pull? We won't get the same numbers so for the city election, so it may not have to be the same challenges in terms of the number of people who are complaining that we're not enough early voting locations. So just be aware of that. There's a hearing on all of these issues on December 9th at 5:30 sponsored by the New York City campaign, Finance board I, do want to thank molly and all of you and your work on waterfront issues. I know they're ongoing, there's a coastal flood hearing coming up, which may or may not be relevant to you. That is going to be at Cpc. I. Think you know about that on December 28th, the helicopters again may not be a big issue in board: six, they sure are other locations, so we are focused on New Jersey because it looks like the downtown teleport in New. York does have some which I've been trying to stop in terms of tourism helicopters, but it seems like New. Jersey is the culprit, so we have been talking to the elected officials there trying to get them to understand that flying over Manhattan as a tourist is not a good idea, but I can't say: we've been successful, but just so you know we're very focused on it. I know: we've all been working on the cleanups and all of those issues because of the cut to the sanitation budget. Just in terms of Covid-19. It's pretty scary. We had a big meeting this morning, virtually with all the uptown community boards and elected officials, because the inward section is the highest in Manhattan. Now it's pretty high and we're going to try to get more testing and you know. Obviously I've done my whole PPE thing last weekend, but we're going to do more with everybody. I think just be aware of it, you know not to say it's high, but if there is, if there are testing issues, tracing issues try to find out. If your sites that are doing testing are long lines are they you know what's going on, because it could happen anywhere. You know, there's no one area that is going to be exempt from all of this in terms of the schools. I know we can talk endlessly about. You know what to do about opening closing all of that. But the real issue is no matter what we need these devices. So you it's daily news is running a series. I've been talking about it for I, do not know like two years three years now way before Covid-19 and what's frustrating to me is when we do our budget for the schools we put in last year, we put in 15 million dollars for technology, but guess what the deal we and OMB would not. Let us spend it until recently. So now, here we are way into the school year and now we're meeting with the executive superintendent, the principals, the superintendent trying to get this money out the door to be able to buy these devices. Despite the you know, the city has this city has that kids do not have them and so and then, of course, there's a whole another topic. Kyle for discussion is this whole bandwidth, internet connection, speed and so on, which again seems to be a lot of talk and no action. Child care seats is another challenge for some reason. They all seem to have disappeared in terms of early childhood education all day, whether it's head start or early childhood. The city of Manhattan has put in a lot of pre-k. That does not do anything for parents who are working, and so we are fighting with them, we're going to make a big stink because they all went to other places of need. Unquote, we lost 550 slots in the ball of Manhattan overnight, and that's that problem of you know you're, not in a low-income area, even though you may have housing or you may have pockets of it- desperately needed, and parents who work in Manhattan who are low-income, working, low-wage jobs and need the slots. So we are fighting hard on that issue. Also, thank you very much. You you're a great board and I look forward to working with you. Thank you so much. Thank you. So much for a president I see we actually have a question for you from Susan sure actually hi, okay, guys Susan hi, just two things one is: there was a homeless encampment on 15th street between first and this little half street going towards second, and to my surprise, it was the police department that cleaned that came and cleaned all the junk instead of the department of sanitation. So I was kind of surprised because I would not have thought that was what our police department should be doing. I, I'm surprised also I, can find out. I know that this whole issue of who's in charge of the homeless is very much up in the air. I saw that the mayor and the first lady are talking about some pilot program, but I do not know where and I do know that in general the police have not been involved with the homeless, so I think on many levels. Your question is a good one and let me find out it has traditionally been sanitation, but before Kathleen Garcia left she told me that it was hard to get sanitation to do the work, even though she was the commissioner. Let me let me find out Susan I'll, let you know thank you and one other. This is not a question. It's just a little piece of historical data regarding concrete I do not know. If you know this, but concrete is ancient. It was being used by the in Syria and Jordan in 6500 Bc. It was being used in Egypt and China in 3000 Bc and the Romans were using it in 600 Bc. So you know I do not know what's in the concrete today, but it's been around I love. It God knows what's in the concrete today, but whatever it is tristan on board five had some idea about what it should be and it's not, but that's an extent of my knowledge. This is what I love about community Board. Who else knows at the top of the hat, the history of concrete molly I, see your hand up yeah hi good evening. Everyone hi Bro, president Brewer I was going to say that the 15th street encampment I think that's commanding officer Hellman the 13th precinct they're exceptional and they will say, and in some in some areas, and they will say that they'll work with the sanitation, they'll work with the DHS and the breaking ground. So, unlike a lot of the precincts, 13th precinct I think it helped. You know helped out with that encampment because they understand that it needs to be a. You know. Several city agencies combined to get those things done so I know that they've said that to us before and I wish. All the precincts would do the same, but I think that that's why that 15th street encampment was taken care of because of Hellman. So, just to clarify that all right, I'm not seeing any other question coming from the borough president. So thank you once again, my brother president for joining us and thank you Brian and April for joining us as well. Thank you so much. Thank you. I see that assemblyman Epstein has joined us yeah good evening. Everyone it's good to be here and really excited with the new chair and new leadership of the board. So welcome for people who do not know me. I'm harveyepteen, some member in the 74th district and so I represent heart of CB6 and I. Just really wanted to just follow up some of the things I'm sure you've heard already just Malia. It's true I tied a conversation with inspector Helen a couple weeks ago. You know maybe now a month and a half ago about the 15th street and he knew it was a problem. So they were planning on doing something. So I think that was the issue. Susan I think they are just trying to be responsive to concerns not just that concern, but obviously there's concerns around 14th street between first and a and then we keep talking about it. But there are plans in place to manage allowing people to vent, but also to do it in a in a much more hygienic way. So things are going on. We got four new assembly members who were sworn in today, so we're going to be back up to, hopefully a full cast of democratic members, even though we had 107 in this past year, a bunch of people stepped down and in the election there'll be a few, a handful of fewer democratic assembly members, but we'll still be a good number of people who are advancing a progressive agenda. Some of the things we're going to do before the end of the year likely is a revenue raiser and the expectation, as the governor has been saying, is we're going to get money from the federal government seems less and less likely. So I expect in the next couple of weeks, at least on the assembly side, we'll be going back up to Albany to vote for, hopefully some revenue raisers one will be an income increase income on high income errors, but hopefully there'll be a comprehensive package either. We can do with this in this fiscal year or it may be pushed over to the next fiscal year. Other things that are in our district board is in March. We are supposed to do a women's of distinction event. Unfortunately, because of Covid-19 the assembly stopped printing proclamations. We were unallowed to do events, but luckily we were able to start getting them printed last week, so we'll be doing that next week and we'll be including a CB6 member who shelly winfield, who has been a really outstanding leader in our community and we're lucky that she's we will be getting that award next week. So the date for the women of distinction, I think it's in our new and our mailing and Jackson could put that in the chat for everyone to have, but I think it's Tuesday, the 17th it'll be a zoom, so people if we want to join the zoom we'd love to have you again. You can find the link in the chat or send an email to Jackson our Rep or you can send a tour back in the emails and they can send you out the zoom information. A couple of other things that have been going on in the district as people know, there's been a lot of conversations around the roles of the police and there's been in the southern part of the my district, but not, but in the Cp3 area there was an issue with an officer Garcia who had a violent interaction with one of our neighbors Donnie Wright, and we were planning to go to a hearing to suggest that officer Garcia get terminated. In the end, he resigned the day before the hearing, we're calling on criminal sanctions to be brought against that officer. Just because of you know the chocolate they used against Donnie Wright and the over aggressive policing, where we're going to have to figure out a plan to deal with this in a comprehensive way and really thinking about what policing should look like in this city in this state and luckily, as we move into a new calendar year as we move into a new budget cycle, a new legislative session there'll be a lot of opportunities to work through those issues. The last thing I'll just mention is the issues of the struggles with people with disabilities. That's unfortunately, gotten worse during the pandemic, where upwards of more than 60 of people with disabilities are now unemployed or underemployed. In our city in our state, and so we've looked at for legislative solutions under President Obama, we had. He had a really good plan through an executive order that, through the federal government's procurement as well as hiring process, they would try to set aside an average at least seven percent of positions for people with disabilities. In the end, after five years of moving forward to that plan, he got to 14, so New, York, City and New York state does not really have any markers or any sense of how we're doing with hiring with people with disabilities and 30 years after the ADA. We still do not have a real comprehensive plan. So that's what really big effort that we're going to be working on for this upcoming year and if there are suggestions or ideas that people have I'd, love to be able to talk about it. I should say one more thing. Just on the small business front, if I can so we've seen, you know, crisis with Covid-19 in our city, and you know potentially another Covid-19 epidemic coming back and what we've heard is the small businesses are just dying left and right. We all know this doors are closing Senator, Hoyleman and I have legislation to buy rent support for those businesses is assembly. Bill 10901 Jackson can also put that in the chat and that bill will hopefully help with rent relief for a long period of time, whether we get federal dollars or state dollars. Our goal is really to help our small businesses. You know, obviously we're concerned about more people dying, more people being hospitalized. We also need a lively business industry in New York and our small businesses and our backbone. So whatever the board could do to support that legislation, I know we'd greatly appreciate it and if there's any, if there's time for a question or two and Kyle I'm happy to take to take a question if there are any from the board members. Thank you. Assemblymember I, see a hand raised by marty. Bear yeah I understand that Opw is holding back 20 percent on all the invoices from the many agencies that support the developmental disability, disabled people in the whole state and the they can't run when they're not getting paid, and so the services the services are being are being destroyed even further by the state's inability to have funds. Well, you know interesting on that topic. So on in the state, we passed a budget that fully that funded them. The governor made a decision to hold back 20 percent. So basically we said he if he wanted to make cuts. He had to do it through a process that would allow us to come back and propose alternatives to cuts or new revenue sources, instead of doing that, the governor just unilaterally held back 20, not just of you know, of those agencies, four billion dollars in non-profit funding, he's held back. So it's whether it's you know, support services for people with disabilities or legal services, or people who are potentially getting evicted. Agencies across the state have seen 20 percent hold back up funding. It also affects municipalities, schools, higher Ed, so we've seen this wholesale cut, which the governor's not calling a cut, but it's basically withholding resources. We had a hearing this morning around judiciary because they're now not reappointing almost 50 judges in New York state, which means tens of thousands of cases, are not going to get heard. We're going to overcrowd the court system again, and this is because the court's doing a 10 unilateral cut. This is all under the guise of the governor thinking where need cuts instead of revenue and, unfortunately, he's doing it in a not transparent way, because he's holding it back and not doing what he's supposed to be doing is proposing. If he wants to do cuts, he should propose cuts. These agents used to get their money. We passed it in the budget they're entitled to their money I, and about a hundred other members, wrote to the governor saying he should release these funds. We will continue to push to have from releases funds, but because of the way the budget was crafted in March, and not really for seeing him holding back 20 of these resources, we have little leverage until we get back into a budget conversation, but we will continue. I know, I'm continuing to push I know our senators and assembly members and CB6 are going to continue to push to have those resources released. We do not want. We need to have these non-profits provide services during a pandemic, not reduced services or even worse, we've heard from nonprofits who are potentially closing so I think the governor's taking a wrong path here. I discourage the cuts. I encourage the fully funding of the nonprofits and I, encourage us, then, as the state to really speak out and say, this is a time for revenue not cuts during this. The probably the worst global pandemic we've seen in 100 years in our lifetime, and it's not getting any better cuts, is just going to make it worse with the unemployment and services. But thank you for the question. Thank you so much. We also have a question from Ann yeah hi, I'm just curious if speaking of revenue sources, if there's been any discussion in the assembly or the Senate for any Senate representatives that are still here about legalizing Marijuana Recreational Marijuana, especially with the passing in Jersey yeah, so we've been talking about that for years and we have a bill. The mrta and Senator cougars, the prime sponsor in the Senate and Assemblywoman people stokes, it's a prime sponsor in the assembly. I'm a co-sponsor of the bill. Our bill basically says that we need to legalize it and then take the resources and the funding available and to put it back into communities of color who've, been historically disadvantaged by the criminalization of Marijuana. The governor wants to put the money and put it all into the general fund. So we've been fighting with the governor about how the resources should be spent. No one disagrees. We should legal legalize it. Everyone talks about legalizing it, and so we need to go ahead and do that this year and we need to figure out how we're going to win this fight with the governor, because they can't just go to the general fund and they can't just go like medical Marijuana. There were 10 businesses that created American Marijuana industry in New, York state they're, all white owned. It is very really reinforcing a problem in our society that white people are taking financial advantage over something that we criminalize for people of color. We need to not do it that way like we did with medical Marijuana. We need to do it the right way with the legalization and we're going to continue to push our bill and I. Think we're just going to have to figure out we're going to continue to fight with the governor and stand underground or he's going to see. His point I mean especially given how much worse communities of color have been hit during Covid-19. It seems all the more important. So thank you. Thanks for the update, yeah sure, and we want small businesses, we want to make sure that the kid on the street corner, who might be selling weed right now, can have a legitimate business and get into the from the gray market to the legal market and the way the governor's proposing. It is not going to put the resources necessary to make that happen, and thank you for bringing up that really important issue. Hi I see a question from korean and then we move on to the next elected after Corrin's question or comment just a really quick comment to remind people, and I'm not sure if you remember but I believe the very first reso I passed as the housing and homeless Human rights committee, together with the when I became chair, was a resolution that passed in support of the legalization of Marijuana and in particular this Krueger's bill. Just as a reminder, so CB6 is fully on board with all of this, and thank you for doing that, and thank you for the leadership on that issue, and hopefully, if we can't get it done this calendar year, we can get it done in the next legislative session all right. Thank you once again, assemblymember thank you for having me have a good holiday thanksgiving to everyone. Thank you and last but not least, we have council member calos. Thank you for joining us tonight. Thank you so very much for having me good to see assembly, member epstein and hoping that he can work with our state Senator Liz Krueger to legalize and make it so I do not even know if we're currently required to do a two week stay home. If we go to New Jersey to smoke, so I think the best thing we could do is just legalize and I think most people are doing it like co-chair the progressive caucus where we've been fighting this fight, and so, if Albany can't figure it out, give New York City some power and we'll do it. I'm Councilmember Ben Kayla's at Ben, Kayla's on social media I, want to congratulate your new chair, kyle I think you may be one of the youngest chairs in city, maybe even the youngest in history, but either way we're just glad to have you congratulations to cv6 for electing it. Just thank you for your service to the state and now the city we're all home, I'm home. So if you happen to hear my two and a half year old, she recently came up with some new excuses for why she can't sleep so I may have to run I just want to thank everyone for voting. I. Think Saturday was a pretty fun day for a lot of us. In my district we were literally dancing in the streets. People were banging pots and pans and then stopped paying their pots and pans because everyone bought we're out of champaign in my district, and so people stopped being pots and pans to drink it. Out of there, I was out there on 91st street at an impromptu party. With my congressman, our Congress member Carol Maloney. It was quite a lot of fun. It almost makes you forget that people had to wait hours in line for early voting and part of that's, because we only have 16 sites in Manhattan, and part of that is because, when Albany passed early voting, they only required seven sites, no matter how big the county is, and so 16 is still better than the seven. But I've been trying to raise that alarm Bell before I'm sure you've heard me talk about it here in CB6, I believe the only site you had was at hunter for my district I had three sites for my district and Keith powers, district, hundreds of thousands of voters- it just was not enough. So I have legislation in the city council that we previously introduced and we're going to reintroduce to require more poll sites longer hours here in the city. What can you do what you can do as a community board? I've mentioned it at Borrow Board before is convene a poll site task force and work with the cultural institutions, the medical institutions, everyone and anyone- and just say we need, for the sake of democracy, a space that we can use 22 hours a year, sorry 20 days a year to host elections, and I'm happy to work with you and support you in it. But if we've got culturals and schools and others who are not paying taxes, the least they can do is support our democracy I, also just as we're facing another wave of the pandemic. I had a hearing on PPE, we posted the numbers for the city's fit 90-day stockpile and if you think those are the right numbers, I think it's 13.5 and 95 masks. One of the things we did here is from our doctors and nurses on the front lines that they were saying. We do not need 13.5 million and 95 masks that get thrown away every hour. We need to get something called elastomer masks, which kind of looked like darth, vader or Bane's mask, but it would be reusable and they could just wipe out the wipe down the outside with with alcohol, and it would not leave scarring a lot of our nurses and first responders were seeing scarring a lot of our workers, particularly people in H, plus H, who are of color, and women of color were forced to wear garbage bags that died of this pandemic, and we need to do better. As a city. We also passed legislation that I co-sponsored to make outdoor dining permanent. This is after I worked with gail Brewer to bring it out there, and a lot of folks are talking about what the new normal is going to look like and I just got to be honest, the previous normal that even just was not working for me. I do not know very many people were like oh gee, golly gosh. The city is an easy place to live in. In fact, this is probably the only place I know of where in most places, if you mess up in life, you get trapped where you grew up and New York City is the only place where, if you, if you, if everything does not work out for you in life, you're more likely than not to get forced out of the city, we need to change that. We can't just have a corporate-led recovery, so I've been pushing for a worker-led recovery, and that means paying people who work in our nonprofits a prevailing wage and I've introduced legislation to do that along the same lines. The Albany is not the only place that cut nonprofits, one of the things that mayor de Blasio did after he asked our non-profits and essential workers on the front lines to work through the pandemic risk their lives to help our seniors. Our youth delivering food is the first thing they did. Is they cut funding and they cut indirect funding? Not only did they cut it for last year, but they cut it going forward. So if you're, a non-profit that laid out a million dollars last year, you just got a two million dollar cut, so we're having a hearing in my committee on contracts on November 25th at 10 A.M the day before thanksgiving and we're hoping that we can convince the grinch of a mayor to restore funding to our nonprofits in time for Thanksgiving and the Christmas and Holiday season. Full disclosure, I'm jewish, but it it's the the analogy as it were. Another issue we're dealing with is in the public schools, where we're almost into we're in November and 77,000 public school students still do not have laptops or internet for remote learning, particularly kids in homeless, shelters, and so I've introduced legislation that would guarantee every public school student who needs one, a laptop with intranet and beyond that. We spend about 82 million dollars on textbooks that talk about white people from Europe, and we can do better with a textbooks that re reflect our rich shared cultural diversity, and so they would be loaded with these. In July, I asked the mayor to set up remote learning, centers all over the city and he set up Learning Bridges. We got one Learning Bridges location in my district, just one to serve 9,000 students. Sorry, four thousand students across nine schools, I I'm curious how many Learning Bridges locations you got. We set up a clearinghouse education at benkaylovs.com if you are a developer or a landlord who has a space if you are a provider looking for a space, if you are a parent who needs it, we're hoping to open 400 slots on Roosevelt island which we're actually being sent to Cv6, so we'd love to partner with you on that the fee on bags has finally been implemented. You may have noticed when you go to the store, we're giving away free, reusable bags. We just gave away a whole bunch today we're going to be doing more tomorrow, sorry next week, if you're interested we're having to work with you. If you know residents in public housing, we've been, we distribute turkeys to residents in public housing and I. Just want to thank all of you as we celebrate Thanksgiving I am thankful to all of you for spending your evening. This way to for your service, and I'm incredibly thankful for my wife, daughter and my cat and just throughout all of this being able to spend more time with my family is just something. I will be incredibly grateful for this year, as well as what happened on Saturday. Thank you so much Cha council member for joining us and for leadership in the district as well. So thank you got it. No questions right. I do not see any questions. Are there any questions for the council member, all right, good job, short and sweet all right? Thank you to all of our electeds and agency representatives for joining us. We've now arrived at the committee reports and resolutions section of our meeting tonight in order to conduct an efficient meeting, we're going to observe the same ground rules as before. So again. If anyone has a board, members have a question or comment: please raise your hand through zoom and again. Please do not use the chat function for any board business or conversations or anything about agenda topics. Anything should be made on the record by raising your hand and speaking, we are again using a digital ballot, so the CB6 staff will post a link to the ballot in the chat box. Please open this ballot either clicking on it or copying and pasting the url into your browser. Select your name from the list of board members and select your vote on each resolution as it is presented, so please do not submit this until later in the evening. After all of the resolutions have been presented and at the end of the meeting once you have indicated all of your votes on the ballot, only then should you submit the ballot. You will not be able to submit the ballot unless you vote on every single resolution and if you plan on abstaining, please select abstain. Final votes will be counted and announced after the second roll call. So please stick around for that. If, at any part of our voting procedures and clear, please raise our hand through zoom and we will address the question as we get it. So first up is gene from the transportation and public Safety committee. Gene I think you're still on mute. I can't hear your audio try again. Yes, no got it good, yeah new guy up first okay: here we go first I'd like to thank Claire for her brief, but effective term as transfer chair and I'm glad to see. She's moved over in the world to basa and I want to thank Sandy and molly, obviously too, for the leadership they provided for this committee over the years and we'll be following up on that and expanding it. Hopefully, because, as gail Brewer mentioned, one of the things we're very concerned with is redesigning open space in the streets in New York, especially in our district, and that's a that's, a vision that we're going to be pursuing in any number of ways. So to get to the report, Good news and bad news. So let's do the Good News first, the Good News is that the Second Avenue Bike Lane in front of the Midtown tunnel is finished, do not all cheer it once it's only been about a hundred years, but it's done, and so people are happy even sandy I know is ecstatic she's been writing it for the last couple of days and she seems really happy about it. So that's a big accomplishment and my thanks to the committee, because we've been at this for years literally and it's taken that long, but finally it is done, and so now we can move on to the other 180,000 problems we have. But you know that's one thing at a time and we're clearing them. The bad news is one of the other problems. As many of you are probably aware, we had a sinkhole open up in our district at the foot of the FDR drive where it starts to rise at 32nd Street, it's a lovely sinkhole is eight by ten feet. I stumbled on it when I was coming back in on my bike towards Stuyvesant town last week, and there it was. There were swarms of DEP and D.O.T people who had just gotten there trying to figure out what happened so after pushing and shoving with some help from kyle and definitely back up from Phil Napolitano, our new vice chair. We managed to get find out what was going on, or at least what the agencies thought was going on. So the Good News is that it looks like the repair should be done in the next couple. Three weeks they tested for the structure for its integrity all around there seems to be no evidence of erosion in any other area, so they're going to repair that sinkhole and then return things to normal, because right now you know, Waterside has no bus service, just for example, because buses can't run through there. The detour is really a mess, but, on the other hand, I got to give props to both D.O.T and EDC and well maybe DDC as well. I'm not sure who did this, but whoever set up the the barrels and the barricades at the exit for 34Th street did a really good job by making them really tight and curving them enough, so that cars can't speed past about 30 miles an hour at best, and most of them are going way slower than that they put up, stop signs at the north end of the parking lot and they had transit safety people. The Ta a people at both ends the stop sign at the north end of the parking lot they had them in 34th street, so they're monitoring the situation. Hopefully it'll be resolved soon, and things can go back to normal because we did fight for that bike, Lane and the reconfiguration of that space also for years, and we just got in place, it feels like when Bang the ground literally sank, underneath it so we'll keep you apprised of that. We're going to be following up on the at the next committee meeting, obviously at the beginning of December about that, we will also be pushing as Pedro mentioned. Cd3 has a plan to bypass the ESCR work on the East River shore front. We do not. We have verbal things that they've told us and a couple of diagrams. They showed us years ago about how they want to send everybody over to first and second avenue via 14Th Street and 23Rd Street. Many of us are not happy with that. It's too far away from the river sending bikers there is bad enough sending joggers and pedestrians over. There is pretty ridiculous, so we are going to do everything we can to pull this back toward the waterfront so that people do not have to go two or three blocks out of their way just to enjoy the day or do their exercise, because we're all stuck in Covid-19 and the outings that we take are necessary for mental as well as physical health. And it's a point we're going to have to make very strongly with EDC who seems to be in charge of this entire process and at our next meeting we are planning on having I'm pretty sure. We will have an update about the CitiBike expansion in our district, which is something that we're all looking forward to and no doubt people are going to have observations about exactly where the chorales are and everything else so I encourage you all to dial in and if you have not been in any of the planning sessions about this, that DOT held show up, and let us know what it is. You have to think because this is just the beginning of things that we want to do in terms of rearranging how the streets work we're going to we've seen during Covid-19 cars went down, bike use, went way up everyone's seen, the appearance of e-scooters and various other appliances that people use to get around what they call micro mobility. That's only going to multiply and we're all behind it. I think it's the wave of the future and I think that's the area we're going to pursue the hardest, so we'll be looking at that stuff, as well as shovel ready projects, as we've already started to do, and that's really about it all right. Thank you so much gene and thank you for your leadership on the committee again. That is a wonderful accomplishment with the bike lane and thank you as well, and the new vice chair, phillip, as well as Adam from land use for really monitoring those sinkholes. I've received more pictures of sinkholes than I ever have in my life, so welcome to being chair of CB6. You got a scrapbook now I do well. Thank you. So much all right. Moving on, we have a health and education Abby. Do you have a report on behalf of John tonight? I do not right so you're waving. Thank you. Next up we have 197a kavitha yep Hi Kyle. Congratulations it'll, be really good to work together on some of this stuff. I think our main focus continues to be around the msbi site and ongoing. You know predictions about and updates about what they're actually going to do in terms of selling the properties and, what's going to happen there, but we have been working. The committee's been working really hard on putting together a website and updating things and getting ready to launch it and then put together a timeline for community Outreach and engagement around that, and we also have been really discussing how 197a working group should be really closely connected to the other committees, particularly land use, housing, homeless, transportation, all of them in some way or other, because we think there's opportunities in that 197A to kind of achieve some of the things we're looking to do, whether it's you know trying to prioritize, affordable housing or other things, community, centered things we want to do in our neighborhood I- think they're waterfront access, there's a lot of opportunities there that we've been looking at so already been discussing a little bit with land use and others how we can move ahead with that. So Kyle will be we'll be kind of connecting with you on all of those ideas to see how we move ahead. Minor tweaks needed on the website. It's kind of a subdomain of Rss I, think I mentioned before, but some minor tweaks and then we can launch it and do some outreach. We also kind of looked at in conjunction with the land use committee. The Soho Noho rezoning plan, as you know like. Are there any things, the ideas from that we can take in our own community and how that all came about? So those are really interesting. I do not have much more in terms of updates, although I can definitely give borough. President Brewer some more information about. What's in the green new deal, so you know we can connect on that later. But that's all I really have thank you. Next, we have corrine housing, homelessness and human rights. Do we start with the I'm sorry Kyle? Do we start with the resolution sure? Let's start yeah, let's start with the resolution. Maybe just explain it a little bit and then great I, Wanna, Anju Suresh is the one who worked on the resolution and I'd like for her to to speak to it. If that's okay, awesome, thank you so much karen and thank you Kyle, so to give some context to the resolution. So, during the last housing homelessness and Human Rights Committee meeting, we actually had a few representatives from Community Board 10. Come up and present a resolution that they're working on that they had worked on in past to establish a permanent exhibit in the northeast section of central park to honor social justice reform and the exoneration of the Central Park, five, which I'm sure most of us have heard, are familiar with the five black and latino children who were wrongfully convicted and prosecuted in 1989 for the very brutal rape, a white man who was jogging at Central, Park and they're, proposing a permanent piece there to serve as a to reflect on like the human cost of racism and demonstrating that this is an isolated incidence of injustice, but really a systematic problem. So, as of now, they've been going around and doing presentations to the community boards, the Central Park Conservancy, the New York City, Parks Office of the mayor office, the Manhattan border president and kind of getting everybody's buy-in and so in support of the permanent exhibit in Harlem. We wanted to or not in Harlem, but in the northeast section of central park. We wanted to put together this resolution in support of those efforts and yeah. Take any questions. If we have not thank you Andrew are there any questions on this resolution, members off the board, all right, seeing not are there any motions? Sc kavitha your hand is up. Yeah I have a question about the actual idea for what they plan to do. You know I, just I. Do not fully understand I, understand the concept, but I just did not know what the plan was for memorializing that do you have any more details, yeah anju. Could you provide more detail about what exactly the exhibit or the design is yeah, so they have not. They have ideas for what the design would be so I know one piece of it. I remember them mentioning in that committee meeting was, for instance, putting up like as part of the exhibit on the news newspaper clippings from when trump had called for the death penalty of those by black children or black latino children. They still have not so they're, not in that part of the process where they have solidified the design yet and how it's going to look like. So they have the objective in mind for what this piece hopes to convey and some general idea of like what they can do to get there. But it's really right now they're trying to get support for it and secure the funding before they go out and do a search for an artist who can take on commissioning the piece of work. I do not know if Corinne or anyone else from the committee would have anything else to add on to that yep, no I think about have it right there. It's part of the concept is also not like. You said it's about the kind of this, the systemic issue of it. So it is the exonerated five is more, is a hook and it makes a kind of location important, but beyond that they want it to be kind of a permanent exhibit. That really makes people and realize the broader issue of this, and just to provide some context to it too. As also someone who is sitting on this committee, when this presentation was made, the idea is community board. 10 is looking for support for the concept of it, not for an endorsement of a specific design or anything like that. It's just about supporting there be an exhibit at all, so I just want to clarify that for everyone all right. First, we have a couple of hands raised for this, so I'm going to recognize the four so Marty Barrett first up does any of the five or the designer have any connection to community Board six, we historically the issues that CB6 would get into would have specific connection to CB6, especially if it has to do with something that's outside of our area generally. We do not, or we have not stuck our nose in other people's issues. Okay! Well, oh sorry! Yeah you want to take you want to take that on you go ahead. Just a comment. I would also just push back a little bit in saying that the purpose of the exhibit is to really bring light to the work that needs to be done to advance racial equity and I would not say that would be specific to just community board 10, but really something that us as a city and really as a country, especially in light of all the black lives matter. Protests of this past summer should take responsibility in furthering and in supporting this exhibit I thought was one way that we could do so in recognizing that these issues are not siloed just within that community board, but very much do extend to our neighborhood as well. Thank you, andrew next up Asean did you guys get any sense of if there was other support from other community boards, especially the ones that were connected to central park? Cb7 I think CB5 also is on the internet. Have they have they gotten any other reserves? I do not know about the other community boards. I know that the office of Manhattan borough president was very much in support of the resolution, so they were also on the call to present it and reiterate their support. I believe that the community board 10 had only very recently passed the resolution when they had presented it to us. So I also have not gotten an update since the two weeks from when they had that presentation, but could not find out and let you know nope I mean it's good to know that the Manhattan border president's office was on that culture and supportive of it. So thank you next up, Kevin, yes, I do not know if this was answered. What was the vote? The committee vote on this? There were for housing homelessness, human rights. It was everyone who was present voted in favor of writing. Drafting the resolution, I'm trying to get the exact number. Thank you, ten in favor all right next up, Dan yeah! Do we know if the victims of the Central Park five in fact personally support this and then was there any concern around something like this potentially being triggering. The purpose of the piece is for it to be healing and serve as a as a reminder of like the work that has been done to this point. I can't speak to whether or not the the five men at this point have actually been consulted. I can't remember if that was part of the presentation. I know if corrine or kyle, if you, if you could recall, but they are working with numerous stakeholders, both like on a city level like the residents themselves, as well as like what I've seen before the New York City, Parks offices, mayor, yes, I, want to say yes, that they have been consulted and they did agree, but I would have to go back into the very extensive by the way Community Board 10 did a very extensive presentation on this was not you know, a one-page presentation. It was 25 pages, something like that. Yes, and it was significant and again just to clarify so questions like that right, it's more about like that, would relate more to like kind of the design of the actual. You know final product of it. This was simply a presentation from CB10 to see if they could corral the support of other community boards in an effort to do something to commemorate so this is even before we get into questions like that. If there was support for it at all, so that they could have those conversations at some point. According to the presentation, they made last hand we have up, is b dismantling. Thank you. So I wanted to comment a couple of things. First of all, this is symbolic and I think it affects all of us in New, York city, as well as the country and I. Think our support is to do something that would show the symbolism of what happened to the city and the country on this whole thing, also at the same time that you're dealing with the issues of racism now so I'm not as concerned that we do not have the design or any of that I think we're supportive of having something that commemorates the wrong that was done and the reason that was done so it affects all of us and I would support the resolution. Oh and thank you, thank you. So much and also I, just looking back through the conversations Community board, 11 and Kibuni Board Community, Board 7, are also in support and if I could just really quickly interrupt, I was only regarding the design process. It's a lot longer and slower, but as long as we get support of the monument, then the city will take it over underneath their monuments committee and then they'll commission, an artist and go forth from there at the longer process, and it goes under the arts and culture, but at least we can encourage them to do something that addresses that. Thank you. We have two more hands. Sandra I wanted to call the question all right. Just before that Claire did you have a final comment. I was going to do the same. Thank you. So are you seconding? Yes, I'll be the one! Second all right! Thank you all right. So leave a call to question yeah a motion to to vote on this. Yes right, I'm not sure if this chair I can do this I'll move to vote on it. That's fine! Second, there we go. Can you just say identify yourselves because I can't see you speaking, it was jean and Anne. Okay, all right! So now mark your vote on your digital ballot for this resolution and do not hit submit those of you who are not using digital ballot. We will ask for your vote verbally during the second roll call. So please take time now to put in your vote on your online ballot and again, please do not submit it yet because we still have other. Could you go through the mechanics of voting again on top of that sure, so, in the chat box, you should see a link that the board staff has submitted. They cody has just sent it again, so you should see it in the chat box either. Click on that link or highlight the link and copy and paste it into your browser once that loads on your page, you'll see a section to check your name. Please highlight your name as your ballot and then you'll see there are drop down menus for the rest of the resolutions. This one should be at the top and you can choose if you're in favor or against or abstaining or not entitled to it and then do not submit the form, do not click submit until the end of our meeting tonight. If anyone is having trouble, please let us know in the Chat box and we'll be able to help you. So as people are finalizing their vote. Corrine do you have a committee report? Yes, I'll. Do a quick report. First off the committee, spearheaded by rich Mintz, has been working with the housing rights initiative, a non-profit housing watchdog group that investigates real estate fraud. They have not identified a few buildings in our community that may have a violation in terms of their tax exemptions, and we are. We are about to begin reaching out to tenants via flyers, in these very specific buildings, to work with them to determine if their landlock their landlord is violating their tax exemption and then, last but not least, next Monday. Our committee is meeting to hear from department of Homeless services and core services group about a new permanent adult family, shelter at 118, East, 40Th Street. The Renwick hotel, we are collecting questions and comments, four core and DHS through a form that you can find on our website in the calendar. Where you can, you can submit questions ahead of time, which I think is great for DHS to have and core so that they can answer them. They have time to really look at them and really answer them in a good way. We also ask, but there's also already a fact sheet about what exactly this adult family shelter is, how many beds, what kind of people qualify for these spaces and we're looking forward to seeing anybody everybody on Monday and that's it. Thank you Corinne and again just encourage everybody to utilize the form that corrine was mentioning to submit questions. This is one of the new things that we're implementing to make time more efficient and also to make sure our questions actually get answered at meetings. Instead of being told that they'll get back to us, we want to make sure that they have the questions beforehand and we'll be prepared for those meetings. So please do use that all right. So next up, we have Kevin with parks. Thank you, kyle. Congratulations to you. Let's start between 35th and 36th Street at Saint, Martin Park, with a resolution on a design plan for the park's, nearly half acre playground. I want to point out that extensive community discussion helped deliver this revised plan. The design includes input from PTA leadership from ps116 and ps281 input received at a scoping meeting in February and at committee meetings in September October and this month. The committee vote on this resolution was unanimous with 10 votes. Thank you. Are there any questions on 5a the supporting the proposed design for the reconstruction in the St Martin Park Playground, see Marty Barrett's hand up call the question and I'll second that motion, but I also just want to say thanks to the Parks Committee I know that this has been a long time in the making and I just I appreciate all the work you've been putting into it. So thanks for that, echoing that, thank you is there a motion. I'm going to make a motion for us to move ahead on this almost to approve yeah, who was that was gene? All right gene make the motion. Did anyone second? That I'll second, is that okay? So again, please your daughter, which should still be open and not submitted. Please make mark your vote on the digital ballot for this specific resolution. This is 5a and again do not hit submit yet so we'll take a couple seconds for that, and while we do that Kevin do you want to explain 5b? Yes, we will head north to Tudor city to the 11th floor, cloister building at 321, East, 23Rd Street, and we do have a resolution of no objection to a certificate of appropriateness for window replacement. The scope does not include the penthouse as part of the presentation to the committee. Lane Engineering showed noticeable decay on window structures. It is looking to replace the committee vote on this resolution was unanimous with nine votes. Thank you Kevin. Are there any questions or comments on 5b, which is a resolution that was a no objection to the granting of a certificate of appropriateness for the replacement of windows at 321, East, 43Rd Street, any questions or comments all right seeing on? Is there a motion from anyone? Please raise your hand if you have a motion and please raise your hand if you have not yes, sandy motion. No objection, no objection. Thank you is this seconded by anyone. This is Ann seconding. Thank you, and so again, please go back to the ballots and mark your vote on the digital ballot for this resolution and do not hit Submit, and while people are taking time to do that, Kevin do you have a committee report, a brief one? Yes, the agenda for our next committee meeting will include another starting park item about a request for the general public to gain access to the public garden facing First Avenue separately. It was nice to hear from Pedro and Council member Rivera's office that the MTA Albano Jr. Playground playground discussion has progressed. Some of you may be wondering what the MTA is doing in the playground. Business just some background history. More than a half century ago the Triboro Bridge and Tunnel Authority now part of the MTA gained control of that parcel. Why? Because the space had been part of the city's, never realized plan for an elevated, crosstown, 30th Street expressway. Last but not least, for this brief report, I'd like to extend my gratitude to Pam vassell for her service, as committee chair through this month's committee meeting to Jeannie D'onofrio for her active vice chair service since that meeting, and to erase me Patel for her handiwork on the cloister resolution. Thank you all echoing that again. Thank you to all. Next up, we have Adam from land use there we go. Thank you Kyle! Thank you all. So we have one item to vote on. It is no objection for granting an extension, the term of variance to permit use group, six retail for the premises of 234 east 58th street. It's a very simple sort of BSA application. We've been on record in supporting this variance before in the past, and we as a committee, voted for no objection, and that was a 10 0,000. I'd like to thank you I'd like to thank cassandra for writing this and for cody for proofing it do you have any questions. Can you read that title ten times fast? I can not I see a hand from Sandy yeah. I'm just wondering why it's only for five years and not ten, they asked for 10 did not. They I could answer that if please I was just going to say that it actually is our board's custom. The variance that is normally granted is a 10-year period, but it has been the this board's decision for several decades. I believe that five years would be a more reasonable term, although that is not what is granted. That is what our resolutions normally say and could I just ask why that is I mean it's more cost to this particular to the people who are coming in. They have to hire the lawyer, and it seems like it's typically granted for 10 years. Why would not we? Why would not so I mean just to answer your question? It? It's actually not more cost, because the granting is ten years, so they do come back in a ten year term. Not every five years currently I think the logic behind this originally was that because of board turnover and because of an attempt to try to make sure that there was more direct action between variance approval and Committee Board involvement that it was a shortened time period that was requested. Okay, thank you. Are there any other questions or comments? Okay, seeing none is there. Anyone would like to take a motion. Please raise your hand. I moved to vote. Okay was that eugene? Yes, it was right, so Jean has always been yeah. Jean has a motion. Does anyone say that's a second set clear secondary all right. Thank you. So again, please mark your vote on your digital ballot for this resolution 6a and once you do now, you can actually hit submit. So please take your time and vote and complete your ballot by hitting the submit button at the bottom, and please make sure you also enter your name at the bottom as well to endorse your ballot. Thank you. Let's move on to basa and whoa! Oh sorry, that's fine! You know just shuffled all the way back anyway. You know you know. Last month, I went first, that was that was wild, so anyway, thanks I, so I would have been happy to let you go first, Adam really I thought it was a coin flip. You know so anyway, we in theory when we, when we met when we met a few weeks ago, we actually passed two resolutions. The second resolution was basically a motion for support for solar one. They provide last I think about a month ago, solar one provided us with general updates in the project and construction timelines and, in short, solar one raised concerns about how their portion of project was put on hold because of budget concerns. We initially passed a resolution like I, said and then to have the city properly fund this project, in tandem with the larger ESCR projects. Larry did a lot of did a lot of heavy lifting as to cody in terms of writing in the initial resolution and then reaching out to Chris Collins. So we spoke Chris and he gave us some good news at this moment. We do not need to pass a resolution. You know OMB has agrees. It's agreed to sort of tentatively to release the funds for this project so that both ESCR and the solar one updates can continue hand in hand. They, however, are working this out with the with their legal teams, and you know the lawyers amongst the lawyers, and so, if we're going to we're going to look for an update in the next month or so, and if there's any sort of issues we'll bring this back up to the table, you know solar one's been a valuable public resource for this community and for people who visit our community and also too, you know it's a very sort of fiscal, prudent thing. You know it does not make a lot of sense to complete one massive project and then have to sort of work around or deconstruct it to complete solar one. It just makes sense to do both at the same time, and so so most of the meeting last week discussed. You know the larger updates from ESCR and other sorts of updates, and one of the big things that came out basically in the last couple of days is that they will begin construction. At least on our portion of the project, starting Monday November, 16th they've gotten the notice to proceed. So if you've been around styco solar one sort of area, you might have seen some more construction action things of that nature. You know, Pedro was talking about it earlier. You know, we've been talking about this for years and years and years better part of a decade. It's finally happening. Shovels will be going into the ground. You know in some way shape or form starting Monday, and so what does that mean? You know that means all sorts of construction mitigation and sorts of stuff of that nature, and so we've asked for an update of the DDC team to present us each month, which they've been doing and also, if you have not signed up for alerts. You know I'd highly, encourage you to visit the ESCR website to sign up for sort of time alerts and maybe to get way too many emails. But there's a lot of stuff, that's going to start happening and we think we have an idea of it, but as with all construction projects, there's always something that does not quite happen. The way you think it would so we're sort of all in this together for the next few years, and so we're going to do our part as a committee and as a board to kind of keep the community abreast with that said, you know an issue has already cropped up. Solar one was talking about granting access to the construction, crews onto their property. You know the legal liability, things of that nature and the similar items coming up right now with waterside Plaza and so cody's been working, the phones, gene molly others with Janet and waterside with the waterside reps and that there's still sort of things that they need to sort of figure out and to address, and so, as we sort of get more updates, we'll do our part to update the committee on the 23rd when the next time we meet and just to sort of work for a timely resolution on these items. This item and items going forward so speaking of the next meeting, we have quite a doozy, so we're going to be hearing from updates from the ESCR team again we're going to try and keep it as brief as possible, focusing on just sort of near-term mitigation efforts. You know gene talked about this in his report about Avenue C. You know we've heard about stuff for the last couple years. We have not seen anything real concrete, so we really want to see where the what they're thinking with this project and see what we need to do. You know again as a board to kind of get real, concrete sort of mitigation efforts for open space for walking and jogging paths. But in addition to that small important piece, we have our first public meeting. We have a euler and it's a very big one. It is regarding the city-wide rezoning for coastal flood resiliency, and so this is what Bro president Brewer was talking about during her remarks and so we're going to be hearing an update from the DCP team and we will be soliciting feedback and comments from the board and from others. This is going to be a real public hearing. I think it's going to be really good for the lack of a better word. I encourage you all. If you're interested the materials are online, cody will recirculate these probably starting tomorrow, and you know it's some light reading, it's only 50 pages or so with lots of colorful images, but it's a very important thing not just for our community but for the city as a whole, and so we're looking to pass the best piece of rezoning that we can so with that. Thank you very much. I've talked way too long. Thank you all right. Thank you. I'm sorry about that again. Adam. The title of the resolution was so long. I thought it was a committee report all right. Moving on to business affairs and street activities, claire hello, everyone I will keep my report brief. There was not a meeting last month or this past month, so not much to report, but I'm honored to be serving in the chair position here, big shoes to fill with kyle, but we are meeting a week from today so I encourage you all to join. There's a new applicant, and hopefully we can hear more about the restaurant meal program. The one thing that I want to share that you all probably already know about Cuomo was established an order recently that, starting tomorrow, all restaurants and establishments that are serving food beverages, alcoholic beverages must close by 10 p.m, starting tomorrow. So that's a new development that we'll be keeping our eyes on, but that's really all I have to share thanks again. Thank you so much claire and if I have budget and governmental affairs rick, we had a. We had a sort of an organizational meeting recently and we're going to be looking more at how to use the district needs statement and our list of priorities throughout the year, so that we stay on track with what we say. We have a need for and try to address that and that during the year we start picking up those kind of things, so everything does not become overwhelming at the end of the period I want to thank the board office for all their help in putting together the district needs statement. It's a it's a it's one of our more important documents and I hope when it's posted by the City Planning Commission that everybody will take a look at it and we'll and there's a lot of work goes into it from all the different committees and we do hope to be working with it. A little bit more. Our next meeting will probably not be until January. We will be taking up some various issues that would fall under the heading of the the voters. Experience we've done this in the past, where we've looked at some issues about voting. Certainly some things have come up recently: the counting of ballots and mail-in ballots versus absentee ballots and analysts how those are counted when they're counted. Also we're going to take a look at. Do we need to have something, or should we join in with some other organization to talk about the ranked choice ballot? That's coming up for the fall, so anyway, that's pretty much. What we're going to be doing no meeting expected in December unless some critical budget thing comes up. I should say that the mayor he has an opportunity in December to issue a document that will adjust the adopted budget. Basically, that'll mean we'll be seeing some budget cuts and we'll have to take a look at how import how much that affects our priorities, and but we won't know about that until the middle of December. So we're not going to worry about it until then, and that's it all right. Thank you. Rick all right, we've come to the conclusion of the committee reports. The resolutions section I want to thank all of the committee chairs and all the committees for their work and, of course, as always, the board staff with such an incredible job for all of us, I do see, and before we move on by marty, alrighty, yes, I did the December borough board is a very important one in if for the com, for each community board to push those budget priorities that they find most necessary and though it'll be your first meeting at the borough board, come prepared with all the priorities in, in alphabetical order of the commit of the departments that they're in aging, Et, cetera, Et cetera and do not be afraid to raise your hand and push for hours. Because then you then you'll find other community boards agreeing with you. Yes, that's a very important issue and the borough president will hear a greater consensus in so far as what we need and the other community boards I really want. I want to congratulate you and I want to congratulate the new community chairs. Do understand that this is the beginning of a possible career in politics. For you, when I was chair at the turn of the century, one commun one, the the housing chair that I made was Jonathan Bing, which was his first chairmanship. He went on to become a really terrific, assemblyman and sharing committees. So it's great to see you all taking charge. Thank you so much marty, thank you and do you have a question or comment from previous thing, or do you want to move on to the business section and you're still muted? I'm sorry not sure why the space bar did not work. I have something really quick for new business all right. So let me just actually move on to the next section. So now we are moving on if board members. If you have any older new businesses state, please raise your hand through zoom, I'm not recognizing Anne for older newsness, okay. So this is just a new pet peeve. That I am not sure even what committee it would belong on and that's leaf blowers, which I feel like this year everywhere. Everyone used to just like sweep their leaves, and this year they use leaf. Blowers and I have issues with both the energy use and the noise pollution, as well as the ineffectiveness, because they blow them into the street and then, when they dry off or whatever they just blow back, you know onto the sidewalk or people blown down to the building next door and they just start early and I. Just literally I do not know if this is, you know we're talking about a green new deal and you know reducing carbon footprint, and this is just not so it's initial I do not know if anybody else cares about this or if this is just using my pet peeve, so yeah so I have not actually heard about this and I have not experienced it, but I would encourage you to attend the Parks Committee. Well, except I. Do not except Kyle, I'm not sure it's parks, private I, almost wonder if it's bossa, because it's literally the street activity yeah so part of you know, Kevin's priorities will be focusing more on the environment as well, and things of this nature actually so we'll get more into detail at the next Community Board meeting Full board meeting next month, but I would suggest to bring that up at a committee, because that is definitely a committee topic and committee business for sure, thank you and if anybody like, if I'm the only one we'll just drop it, but if there's other people here that are equally irritated, like give me a shout out, thank you. I saw your hand up. Was that by accident? Did you have a question or comment? It was. Are you telling me yeah your hand, your hand? Oh yeah, no I put it up and I put it down. That's a service issue that could go to the board office and if you give them the particular streets, they can find out whether there's a problem or not perfect. Thank you all right. So does anyone else have any older new business all right, seeing none we'll move on to the second roll call great hi everyone I'm going to check to see if you've submitted your ballot. In addition, so if you could just say that you're present that'd be great and then I'll check to see if you've submitted your ballot as well, Kyle President, okay, Asean, Present, Martin, Barrett, President, Elvi barroso, elvie I, think you're. Here, she's no okay, Joan bear she's here, I see her. Okay, all right got it. Thank you! Joan barrenbaum she's, here too I, she's, muted, okay, Matt Bondi, here Claire Brennan, here, Okay Dan Divine, here Beatrice Desmond, here Janine D'annabrio, here, Rick eckers you here andrew Gross, is not here. Adam Harkey, here molly hollister here Paige judge youssef. We have not received your ballot, I'm not sure if you're still on the line, Abigail cruzmark here, Anton Mallner here Matthew here, Sandra Mckee, yeah, Richard Mintz, here Philip Napolitano. Yes, here all right great. If you could submit your ballot that'd be great we're just waiting on you, rajish nayer, here Kevin O'keefe, President, Reshma, Patel, President, Matt Roberts. Here, gene santoro here Frank Scala, he was not here, Lawrence Cher, Lawrence, I, think you're. Here, let me know if you're not cancelled, I'm unmuted, I'm here, okay, great thanks and silicon here. Okay, great Louis, key Lou, I, think you're. Here all right: Sandro Charon, here Laddie Simon, here Susan Steinberg, here Andrew Suresh, here Mark Thompson over here korean vanderdock, here Brian Van Euvenhoven, here Ronnie white I, do not think she's here today and claude. Thank you. That's a wrap all right, seema is there. Anyone else needs to submit their blade or to do it not by the internet. No, all the ballots are accounted for. How about a motion to Adjourn? Oh okay, yeah! Let me see if I can do that cody. If you could do that, that'd be great unless okay I get it so four. Thank you. Thank you. Cody 4a 33 in favor, one opposed three abstentions: zero, nine, not entitled that motion passes five: a parks 37 in favor zero opposed zero abstain, zero, not entitled that motion passes, parks, 5B 37 in favor; zero opposed, zero abstain, zero, not entitled that motion passes and then land use number six, a 37 in favor. Zero opposed zero abstained; zero, not entitled that motion passes all right. Thank you. If there are no objections, we will adjourn the meeting to adjourn for their business. The meeting is adjourned at 9:21. Thank you. Everybody and I hope you all have a holiday and.",
            "summary": "Let's get started, then all right so welcome everybody to the November 12 2020, full board meeting of Manhattan Community board six.\nObviously, right, now, everyone's focused on managing the recent uptick in and covered cases, but council member powers has also been looking ahead to make sure that we're preparing, for you know in particular what Midtown and the transportation system need to be ready for economic recovery, so Councilmember powers published an op-ed in cranes.\nYou know talking about how safe, reliable transportation is going to be a really key part of midtown's recovery, and he talked about a few different items that he thinks we should prioritize.\nThat includes more space for CitiBike stations, including working with developers to place CitiBike stations in you, know, pops and other locations using new development to increase accessibility in subways and further pedestrianizing streets in Midtown other than that.\nThey helped out with a great community cleanup in the skytown area, both on 14th street and in stycove park, and they also to a few weeks ago during early voting, helped keep some poll sites clean in those areas that we're seeing.\nPast month the congresswoman fought and succeeded to get the administration to agree to pay back millions of dollars that it took from the fdny's 911 treatment program the census ended and though we will not know what happens in regards to accuracy and the time it takes to get the data for a little bit.\nIn light of the transition issues mentioned earlier, the congresswoman joins other House Committee chairs and sending dozens of letters directing the White, House and federal agencies to preserve documents in accordance with the law.\nWe have been getting some calls about the new homeless, shelter, opening up on East, 40Th, Street and Lexington avenue, and we wanted folks to know that our office has been in conversation with the department of Homeless services and the agency that will be running the shelter.\nWe are confident in the measures that they are taking and we will be in close touch with them, as the shelter opens up for residents most likely at the end of this year, and as always, we are still helping folks with unemployment, tenant resources and, amongst other things.\nYou know it's throughout the district, but focusing on specific areas that we've noticed are outside of bids that are already you know, getting extra street cleaning services or areas where we've gotten a lot of constituent complaints in the past few years, so they'll be focusing primarily on that they have five different folks in their cleaning crew who are going to specific areas.\nWe have not really been open, so there's been a whole lot to talk about, but I definitely wanted to stop in because it's kyle's, you know.\nBut I know that they are doing some sort of program, but I've mostly been like a 67th street guy at the moment.\nIn, our letter, the comptroller called on the agency to expedite capital projects that address chronic issues across New York, City's, 326, public housing, developments from poor ventilation and elevator outages to broken boilers and mold outbreaks that will become even more dangerous when colder weather keeps residents indoors.\nHe testified at a city council hearing a couple of years ago and as a result, the rent stabilization Association, the Landlord lobby, sued him for speaking out in support of rent stabilization for 40 million dollars.\nThat's going to bring New York up to the level of anti-slap lawsuits as other states like California.\nLook for save our storefronts act, online, there's a coalition of small businesses that are joining behind us to try to get this bill passed and then finally, I want to tell you that I am participating.\nSo, obviously we're you know in terms of our of our office's work on the legislative.\nA lot of other agencies are just in case discontinuing use of n95 masks and providing them to the hospital and Clinton network and using lower grade mass that are still safe, but that do not involve you know longer term exposure as hospital workers would.\nWe recently passed at the last stated meeting or sorry, not passed, introduce a bill to correct a wrong that we think has been on the books for way too long.\nI. Think I actually had the pleasure on voting on the design at one point has been looking: at.\nWe can get this agreement over the hump and start work on that project, hopefully into next year and then finally, an update because I know CB6 works.\nI'd urge them to seek it out, because her position on open streets and her vision for them is something that we shared when they first came out, and we complained that the mayor had chopped these things up into unusable bits rather than the sort of networking and freeing things that they could be for people living around the city to get around in the age of Covid-19.\nSo I just want to point that out to people and we're looking forward to working with you and her on, hopefully, updating and upgrading all those things in the near future.\nHi pedro I just wanted to alert, you, I'm, not 100 sure if this is still in your district, but when you mention phone booths we have been CB6 has been asking for quite some time now on the request of the 29Th Street Association about two particular phone booths, around 31st and Lexington.\nWe know if we, if the assembly members joining us or will Jackson, be delivering that report.\nSix I've lived here for several years: I wanted to speak to you all about the restaurant meals program and the benefits that it can bring to our community, both for local businesses that are struggling right now, especially with rising cape towns and the potential, for you, know, indoor, dining disposals and the residents that call us our community home.\nThink a program in New York state would also bring a lot of benefits, both in terms of increased revenue to restaurants and increased flexibility for people when it comes to using their snap, benefits, so I think it could bring.\nThe community board does not deal directly with you, know, promoting legislation, but I think it would mean a lot if the community board would show support for it through a letter to the state Senate or through some other kind of support for this issue.\nSo, much just clarify that, in fact, the board, often our resolutions, are in fact on support of specific legislation and encouraging that to get passed.\nI would ask you know how to follow up with us on the business affairs, the basic committee, just because, like the point that was either mentioned.\nSo I, do want to mention that before beginning I also want to express my appreciation for the previous executive committee for their leadership over the past several years, and specifically I'd like to recognize molly hollister for her tenure as chair and all that she was able to accomplish.\nThank, you so much for your leadership as the chair for the past couple of years and lastly, I want to thank all of you for demonstrating your faith in the new Executive board.\nIn the next few months, we're going to be rolling out efforts to enhance remote partnership among board members to build a leadership pipeline and new ways of engaging the public in our processes and decision making, and it's my hope that you know we establish our community board as the think tank of our district, a place where ideas can interact where we can think outside of the box and where things that seemed impossible yesterday can finally begin to become a reality.\nYou know needed by our communities to address these issues some housekeeping, so my tenure obviously began last week and we've reorganized some of the committee leadership.\nAnd I also want to take some time to thank Pam Vassell, who stepped down from that role for her service on this board and on this committee for the past several years with that Jeannie Dinofrio is now the vice chair of parks and Claire.\nSo I'd like to just congratulate everybody in their new leadership roles, and to thank you for all the work that you've done aboard before and really looking forward to moving forward with all this energy to address these issues in our neighborhoods.\nLet the board know that the comptroller's office will be conducting an audit of all Manhattan community boards, compliance with the city charter and with New York City Administrative code requirements for meetings, public hearings and websites.\nOne of the things the comptroller's office will be looking at is whether each community board takes minutes at their meeting and post them on their website in timely manner, as you've heard.\nOf course, board five is looked at a little bit, which is this issue that I keep talking about, which is the public realm or public space are.\nI. Think community boards are really the place to try to work on that, because it is even today so complicated.\nThank you because you know a lot of people talk about affordable, housing.\nThere are a lot of veterans, for instance, as you know, that work in Defender world and other places where they oh feels they have not been responsible, but that's a good idea on November 23rd in our office, working with HPD.\nWe all have to work because I spent a great deal of time working with the board of elections and a lot of people say no I will not have elections in my building, and so maybe there's something else that we can come up.\nThere's a hearing on all of these issues on December 9th at 5:30, sponsored by the New York City campaign, Finance board I, do want to thank molly and all of you and your work on waterfront, issues.\nYork does have some which I've been trying to stop in terms of tourism helicopters, but it seems like New. Jersey is the culprit, so we have been talking to the elected officials there trying to get them to understand that flying over Manhattan as a tourist is not a good idea, but I can't say: we've been successful, but just so you know we're very focused on it.\nI know, we've all been working on the cleanups and all of those issues because of the cut to the sanitation.\nGuys, Susan hi, just two things: one is: there was a homeless encampment on 15th street between first and this little half street, going towards second, and to my surprise, it was the police department that cleaned that came and cleaned all the junk.\nI was going to say that the 15th street encampment I think that's commanding officer Hellman the 13th precinct they're exceptional and they will say, and in some in some areas, and they will say that they'll work with the sanitation, they'll work with the DHS and the breaking ground.\nA couple of other things that have been going on in the district as people know, there's been a lot of conversations around the roles of the police and there's been in the southern part of the my district, but not.\nJust because of you know the chocolate they used against Donnie Wright and the over aggressive policing, where we're going to have to figure out a plan to deal with this in a comprehensive way and really thinking about what policing should look like in this city in this state and luckily, as we move into a new calendar year as we move into a new budget cycle, a new legislative session there'll be a lot of opportunities to work through those issues.\nIn, the end, after five years of moving forward to that plan, he got to 14, so New, York, City and New York state does not really have any markers or any sense of how we're doing with hiring with people with disabilities and 30 years after the ADA.\nWe had a hearing this morning around judiciary, because they're now not reappointing almost 50 judges in New, York state, which means tens of thousands of cases, are not going to get heard.\nWe need to figure out how we're going to win this fight with the governor, because they can't just go to the general fund and they can't just go like medical Marijuana.\nWe want to make sure that the kid on the street corner, who might be selling weed right now, can have a legitimate business and get into the from the gray market to the legal market and the way the governor's proposing.\nBut I, believe the very first reso I passed as the housing and homeless Human rights committee, together with the when I became chair, was a resolution that passed in support of the legalization of Marijuana and in particular this Krueger's bill.\nThank, you so very much for having me good to see assembly, member epstein and hoping that he can work with our state Senator Liz Krueger to legalize and make it.\nIf you happen to hear my two and a half year old, she recently came up with some new excuses for why she can't sleep so I may have to run I just want to thank everyone for voting.\nThis is after I worked with gail Brewer to bring it out there, and a lot of folks are talking about what the new normal is going to look.\nI do not know very many people were like.\nNew, York City is the only place where, if you, if you, if everything does not work out for you in life, you're, more likely than not to get forced out of the city, we need to change.\nLast year, you just got a two million dollar cut, so we're having a hearing in my committee on contracts on November 25th at 10 A.M the day before thanksgiving and we're hoping that we can convince the grinch of a mayor to restore funding to our nonprofits in time for Thanksgiving and the Christmas and Holiday season.\nAnd I want to thank Sandy and molly, obviously too, for the leadership they provided for this committee over the years.\nOne of the things we're very concerned with is redesigning open space in the streets in New York, especially in our district, and that's a that's, a vision that we're going to be pursuing in any number of ways.\nThere seems to be no evidence of erosion in any other area, so they're going to repair that sinkhole and then return things to normal, because right now you know, Waterside has no bus service, just for example, because buses can't run through there.\nI'm, not sure who did this, but whoever set up the the barrels and the barricades at the exit for 34Th street did a really good job by making them really tight and curving them enough, so that cars can't speed past about 30 miles an hour at best, and most of them are going way slower than that they put up, stop signs at the north end of the parking lot.\nYou have to think, because this is just the beginning of things that we want to do in terms of rearranging how the streets work we're going to we've seen during Covid-19 cars went down, bike, use, went way up everyone's seen.\nThe committee's, been working really hard on putting together a website and updating things and getting ready to launch it and then put together a timeline for community Outreach and engagement around that, and we also have been really discussing how 197a working group should be really closely connected to the other committees, particularly land use, housing, homeless, transportation, all of them in some way or other, because we think there's opportunities in that 197A to kind of achieve some of the things we're looking to do, whether it's you know trying to prioritize, affordable housing or other things, community, centered things we want to do in our neighborhood.\nCome up and present a resolution that they're working on that they had worked on in past to establish a permanent exhibit in the northeast section of central park to honor social justice reform and the exoneration of the Central Park, five, which I'm sure most of us have heard, are familiar with the five black and latino children who were wrongfully convicted and prosecuted in 1989 for the very brutal rape, a white man who was jogging at Central, Park and they're, proposing a permanent piece there to serve as a to reflect on like the human cost of racism and demonstrating that this is an isolated incidence of injustice, but really a systematic problem.\nAs of now, they've been going around and doing presentations to the community boards, the Central Park Conservancy, the New York City, Parks Office of the mayor office, the Manhattan border president and kind of getting everybody's buy-in.\nAre there any questions on this resolution, members off the board, all right.\nI know that the office of Manhattan borough president was very much in support of the resolution, so they were also on the call to present it and reiterate their support.\nI mean it's good to know that the Manhattan border president's office was on that culture and supportive of it.\nI know if corrine or kyle, if you, if you could recall, but they are working with numerous stakeholders, both like on a city level like the residents themselves, as well as like what I've seen before the New York City, Parks, offices, mayor.\nThis was simply a presentation from CB10 to see if they could corral the support of other community boards in an effort to do something to commemorate so this is even before we get into questions like that.\nOur support is to do something that would show the symbolism of what happened to the city and the country on this whole thing, also, at the same time that you're dealing with the issues of racism, now.\nOur committee is meeting to hear from department of Homeless services and core services group about a new permanent adult family, shelter at 118, East, 40Th, Street.\nAnd I'll second, that motion, but I also just want to say thanks to the Parks Committee.\nPlease go back to the ballots and mark your vote on the digital ballot for this resolution and do not hit Submit, and while people are taking time to do that, Kevin, do you have a committee report, a brief, one.\nSo we're going to do our part as a committee and as a board to kind of keep the community abreast with that said.\nI want to thank the board office for all their help.\nYes, that's a very important issue and the borough president will hear a greater consensus in so far as what we need and the other community boards.\nAnd I want to congratulate the new community chairs.\nYou know we're talking about a green new deal, and.\nThat's a service issue that could go to the board office and if you give them the particular streets, they can find out whether there's a problem or not."
        }
    }
}