{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CB 3 Manhattan - Executive Committee Meeting - 9/17/2020",
            "publishDate": "2020-09-18",
            "shortDescription": "",
            "lengthSeconds": "1:21:47"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "jP5BdKT_h7Y",
            "fillerWordCount": {
                "uh": 78,
                "um": 203
            },
            "readTimeFullTranscript": "41 min read",
            "readTimeSummary": "4 min read",
            "wordCountFullTranscript": {
                "agenda": 26,
                "vote": 21,
                "month": 20,
                "information": 15,
                "budget": 13,
                "services": 10,
                "center": 10,
                "night": 9,
                "wording": 9,
                "task": 9
            },
            "wordCountSummary": {
                "agenda": 6,
                "vote": 3,
                "advance": 3,
                "information": 2,
                "budget": 2,
                "ballot": 2,
                "public": 2,
                "example": 2,
                "park": 2,
                "land": 2
            },
            "fullTranscript": "Hi Susan, let's see here it was not today, hey Susan. I think you did not send me the final Bylaw amendment I think you're muted. Am I no I'm talking to Linda, I'm not officially muted, but that does not mean. Oh no. You know what sorry I did not have my earbuds in that'll work. Now I hear you I'm asking about the Bylaw amendment. You were going to publish it and I do not know it's not in any of these things. I think because they're all too early, no, I sent it. Yesterday. You did yep the finalized one yep. I must have missed it. Did you get the agenda yeah both well. So I said I said with the with the resolution on second page: it's on the back of the agenda. Oh you said it to everybody right and I ignored you. Yes, I ignored you. Sorry do not ignore me. I figured everybody needed to read it beforehand. Yes, that's a good idea. I just thought I would so I need to replace this agenda. I've got here which was on the 17th. No, it's the same one. Oh. I only sent one and was yesterday okay. What I said today was a voci right which what I do not see is hi want me to try and resend it Linda. Let me just look at what I've got here. I have not got it as a separate document. You included it in the agenda when I sent it yesterday, I sent, I think three documents, I'm not sure, but the second page of the agenda. Okay, is the resolution. Okay, the second page of the executive committee agenda is the resolution. Yeah. Okay, you found everything now I believe so I'm just waiting for it to come around and open here. Okay, taking its own sweet time of my course is got the slows. Okay, we got it. Okay, good, so foreign, all right, foreign c. Hmm, this people are late tonight. How unusual is there some? Oh yeah? This is a little unusual right. Okay, here we go. How are you Linda, I'm all right? Who has a dog? I hear a dog barking. Oh there's a dog walking outside. Oh, you hear it well and outside I'm on the third floor and the door is outside downstairs. It's like this is very sensitive. What I guess this is a very sensitive microphone. Then huh yeah sounds like my neighbor's dog: oh okay, Alicia's. The zoom is still installing she's on Jim's computer, so she and I are going to switch so that she can start the meeting. Okay. Thank you very much. Hi everybody how's everybody! Tonight! Oh wait headphones everyone. How are you all right? How are you how's it at school? Oh, my gosh. I want to just kill the mayor, but that's not nice. I should not say you have a lot of help. Are we being recorded right now? I should not say that those are not nice things. Let me see for community board 3 September, 17 2020. I would like to ask for approval of last month's minutes. Can I roll call yeah Michelle? Thank you. Yes, I'll set the record straight. I tried to use the link, but it was not working on my ipad, so I had to sneak in. So thank you for moving me. Yeah, okay, Alicia. Here. Yes, my goal is not here right, he's running late: okay, Lisa, yes, Eric he's not here yet, okay! Thank you! Michelle Cooper sent yes Herman. Okay, we're switching places just give us a second herman is not here yet Anisha. Okay, thanks gotcha Melee! Yes, here Jackie, he just put up his hand. Okay, you wrote on my screen thanks Linda, yes, Alex Trevor. Thank you, Paul everyone's muted themselves. There's all these messages in the chat about people who can not mute themselves, they're going to have a little difficulty being in a meeting if they can't unmute it'll, be a quick meeting. Then try pressing your space bars if you're on your computer, no, not working. It was for me now bring up your participant list. Yeah check it out. It's saying that the host has to let you unmute, but now it's working host does not have to let you unmute. I do not think so. Well, I'm just asking people to unmute. I guess that's working yeah! It is okay, all right! Well, roll call is good, so chairs report where's the chair there. She is Susan. We do not seem to have Anisha. Okay, something is wrong because it says the house is not a lot, one of them mute us and then you unmute us, and then it goes back to Muting. I do not even have a button that says that I can unmute everybody. The only thing I've got is ask to unmute, which seems to work, but only temporarily right and you're the host correct. Can you guys hear me? Oh? Can you hear me now? Okay, great, I do not know what in the world headphones do not work. I do not know. Nothing is very strange. It's so strange. It's like the office ghost okay. So anyway, I want to thank everyone that was able to attend last night's budget priorities. Meeting of the public hearing for 2022., especially want to thank Anisha, Linda and Susan for filling in the gaps. Last night, Anisha at the drop of a dime took minutes. Linda took the time and Susan ran the zoom, so it was really awesome, and even though I had the same kind of technical issues, everything kind of went well, I think so, and we had a great turnout was at least 50 something people that were there. Almost 60 people showed up last night to attend the meeting. A couple of agencies really glad to hear from some of them some agencies. I had never even known what they did, and it was really great to hear from them. I'm going to be setting up some individual meetings with you guys with all the board chairs just to go over where we are where we need to be and what direction we're going in. So if you have some available time in the afternoon after three o'clock like after I get off work, I would love to set up a meeting to talk with you. We can either meet in person or we can meet over the phone or we can set up a zoom. I do not. I do not mind whatever you want to do. It's fine with me. I just want to make sure that we're all connecting and we're focused on where we're going to go for the fall season, because we're still in the middle of Covid-19, we have not gone anywhere, so I just want to make sure that we're all on, like the same page and whatever you're working on whatever your committees are working on. I just want to check in because I noticed that it's been a minute since I checked in with you all, okay and that's it for me. I do not. I do not have anything else to say. Thank you. So now we're going to go on to the first vice chairs report, which he is not here yet right. Michael still is not here: it's not coming. Okay. Second Vice chairs report, Lin Lisa! No, I do not have anything to report, but could you just instruct me when the best time is for me to ask my little question that I sent everybody the information about in an email sure when we get to that particular topic? I will definitely give you the floor. Thank you. Okay, no problem. So now we're going to go on to treasures report, which I believe Susan gave us a spreadsheet yeah. I do not have a report. It's just every few months I distribute it's it's a printout from the financial management system and what it shows. You know, as I mentioned earlier about two months ago, that they took four thousand dollars out of our budget. What was very fortunate is that we got nine thousand from the two council members, so we have left right now. We have our contracts covered like photocopy and cleaning and other than that we have 9,900 left 9000 of it is from the council members grant. So anyway, it was just showing everybody. It's nothing really to report. Did everyone get a copy of it? Yes, everybody got a customer, you're, muted, again at your leisure. I hope you all got an opportunity to read it. Thank you so much. Okay, district managers report. Okay, thank you first thing is: I got a call from Chuck Schumer's office and he wants to come speak to our board. This is first either this Tuesday or next month. So I'm just giving a heads up if I hear more I'll, make sure and contact Michael also, so he knows just want to ask people as far as your agendas you know, they're made up the committee agendas are made up. You know both with agenda items from city agencies as well as issues that you went on. Please send me, you know sometimes I'm not thinking about your agenda and that's the last minute. So when you know what you know what you want, even if you do not have exact wording or anything, please let me know one of the things we do is if we need to invite somebody we always like to have that confirmed by the exec, because you never know when it'll be a problem and you might have to change the agenda like, for instance, this month. We just heard today from EDC that they're not available for our parks Committee, so just try to always do everything ahead of time, so we're prepared for that. So thank you for your help on that there were two workshops. Recently one was from city planning on district needs and budget priorities. It was nothing new for anyone, that's been doing this for a while, but it was pretty well organized and well presented. I just got the recording and powerpoint today, so I'm going to send that out to the whole board. No one from our board went to that. The other workshop that people did go to was one put on by the Civic Engagement Commission and it was on board elections, and it was really unfortunate that they investigated all parliamentary procedure, but not community boards and open meeting, and they gave a lot of incorrect information and the bur aldrin from the borough president's office was on the workshop. So by the time we had our borough service meeting the next morning, Adele Gayle's lawyer was very aware of this. She said she was going to send around an email to all the boards correcting the misinformation. Basically, what they were saying is that elections could be secret elections at community boards, which they can't. That was that was the big issue, and so I just wanted to make sure that people were aware of that, and I will talk more during the budget priorities section. But if no one has any questions, that's all I have for now can't hear you and alicia okay. Next we have the Nominating Committee Linda, Jones, hey! Let me let me share this thing. Okay, so here's the issue which you probably realize that we can not hold our election. The way we traditionally have done with paper ballots because we'll be zooming. So we need a temporary amendment to the bylaws to permit us to use an alternative method, and this amendment does not specify what that method might be. So we're still free to you know to play with that. So can you all see it? Okay, it's the same thing you emailed out right. It's the same thing! Yes, you have it in the paper. That's great! So it says the proposed temporary modification to section 1.3 point b of the Community board, 3 by- laws to enable voting during teleconference board meetings, and it currently is very simple. It says the election of officers shall be conducted by written ballot. We propose a modification due to executive order, number 202.1, which suspends article 7 of the public officer's law, to permit any public body to meet and take such actions authorized by the law without permitting in public in- person, access to meetings and authorizing such meetings to be held remotely by conference call or similar service, provided that the public has the ability to view or listen to such proceedings and that such meetings are recorded and later Transcribed and to fulfill Biola requirements that currently require a written ballot. Community board, 3 temporarily modifies section 1.3 point b to allow for an alternative election method that can be conducted remotely and will comply with the open meeting law. This modification shall apply so long as executive order. 202.1 is in effect, and it is not possible to hold in- person meetings. Okay, Linda, so I believe that this is where Lisa sent out our concern to everyone. Lisa. Oh sorry, now I can you hear me now I could not yeah yes, it was not a concern. It was just a suggestion. I just you know just in keeping with the bylaws being brief. I thought we could say the whole thing in one sentence and I do not have that sentence in front of me because I'm connected on my tablet, but maybe somebody else could it was an email. I sent a little above before five o'clock and I think it basically does the same thing and I in a sentence, and I think it's also a little clearer, because this wording talks about it being temporary, but it does not really specify what that temporary is. So. My wording was just meant to say you know when there is an emergency in effect such as blah this, and it refers to. Let me see if I can I'll tell you what I said so it it's just. I think, a little bit more economical way to say the same thing. Did everyone receive it? I sent it. Let me see if it came in late, I got it. I did not get it, so I, if I had to pop I just post it to the chat. Okay, take a look at the chat phone, okay! Well, the the I'm sorry I had the the thing that was sent out also has additional language about how the meeting has to be recorded and there has to be an ability for the public to view it right, but that's not at least this thing yeah. Well, that's a general part of that executive order. That's why yeah it's just not re-, quoting the executive order, but that's what the executive order says right I mean I do not. I do not really have a problem with the wording of the one that Lisa sent out. I mean it's just it's shorter a little shorter. I think it's a little more concise instead of going over article blah, whatever probably a little less confusing for many of the members, including myself somebody I should read me what Lisa said and I'll put it in here. It's in the chat. I can send you that when I'm sharing I'm sorry, I just forwarded it to you Linda. I forwarded it to you, linda into your email. I would suggest I would suggest that we add that comply with open meeting law at the end after the word implemented. Yep, okay, cause after a while. Nobody will remember what article seven really said without looking it up right. Well, that's why it was put in so it would stand alone, but basically what it all it does is it allows for remote meetings right and that- and it does say that, okay, do you see any problem with that Susan? No, I just those few words at the end except yeah that comply with open meeting law you, it should probably say remote voting methods which comply with open meeting law must be implemented not at the end but okay between methods and must. Okay, all right there, everybody happy with that. Yes, okay, good! Thank you lisa sure, so we have to send this out for 28 day notice to the board. I really do not remember Lisa, you were the chair of the last Bylaw committee. Does the exec have to vote on this tonight first and then send it out for 28 day notice? I do not think so, but why do not we just for the heck of it yeah, I would say: yeah. I'd have to go back to the bylaws to double check, but it would not hurt to do it, we're all in agreement. So Michelle can you take a roll call vote please, and we have to. We have to also state what we're voting on. So was not the problem last time that it says something about setting up a task force so that we had to now I'm thinking of this through the very last time we did not set up a customers. We just clarified language right, but we no. We took we determined that the executive committee was acting as the oh right, so I think we may have to do that again. Maybe we should go back and look at the bylaws to make sure. But and again I'm at my tablets, not at my computer so like, but I think we have to yeah. I do not have to meet separately, no yeah. Oh, do you? Well, let's simply constitute this committee as the task force. If we can do it all in one swoop, I think we can okay last time when we had to buy laws when we had the task force, it was like separately separate time, but like right before right, it meant from 6 to 6:30 or something like that. You know so we admit the same day same time, but it was distinctly different meeting. Well, I guess we could adjourn the executive or we could take the vote at the end. Did not we need to give 28 days notice for that? That's for the full board, okay, where's David, when we need him, so I think you sounded, I think at when the meeting ends we'll call the role and then we'll have a meeting of the task force and but we did not, which we did not have the agenda and give public notice for so actually that's a problem. Yeah. I think that's what the problem is. Do we have time? I mean we're not going to have this vote until November right, so I guess we could make the change before the vote at the November full board. We could have the task force meeting before the exact next month and then vote on it at the beginning of the November meeting and then it'll take effect for the November meeting yeah. Is there any reason to just not take care of it tonight because there's no notice of the meeting of the task force? Oh okay. So in the notes should I say that we're creating a task force to okay, should I include these, this proposed change or no, you do not. Okay, oh okay, I'm looking through the bottom laws now I'm trying to so. Is it the chair created by a bylaws task, force: yeah? Okay, thank you! Okay! Linda! Do you want to start talking about how to vote or no sure, because that was I had just had to do this? You can put it in the minutes yeah, because I had nominating Committee as a separate agenda item yeah. Okay. So then the question is: how do we do this? We've given ourselves permission Susan and I talked about it some we could do it with a roll call vote. That's the simplest way. As you probably know, votes are public information anyway, the ballots can be requested and Susan sends them out if they're requested. I do not. I do not have a good alternative method actually. Well, if we maybe just mentioned there are electronic ballots, we have information on them, but they're extremely complicated board. One used a complex electronic ballot that they spend hours and hours and hours on community board eight is having their election. The same time. We are they're using a roll call and those are the only other boards so far yeah and I was concerned about the electronic ballot. Since people join our meetings, you know from their phones they're not going to be able to you know. I do not even know how you would switch people to the electronic ballot to vote and then to come back to the zoom meeting again, you know. Well, there should be no problem with the roll call right. I do not think so. Unless people just find it embarrassing to have to speak, who they're voting for right and we would have to have a separate vote for each office correct. We could not do it as one slate unless there were no opposition to anybody correct. Why would not I? Why would we need to we've discussed that we're trying to figure out? Why? Because, if I wanted to vote for one person but not another, how would I do that? Oh, you would just go down the slate. You know the way some people say yes to number five. Now you know. As for roll call, you would just give each vote. You could do roll call once and have the person give their vote for each office right. Michelle has her hand up. I I'm not sure how others feel, but, depending on who's running, I feel like people might want their vote to not be public, as it traditionally happens to public yeah, but maybe not like in person calling out. I do not know. People sometimes feel like a little weirdly about that, but, like I did not know they were public, but not that I care about who I vote for, but just people can sometimes be a little weird about that. Is there a possibility of even using just like a Google DOT like a Google form or something like that, could be easier for people to do? You can just choose from a drop down who you want to vote for and then it gets sent into a spreadsheet. It's really easy to use. I do not know this, they say the Google form is the least secure. Because, potentially I mean you can I mean you? Could I mean you could easily someone could easily manipulate it later yeah? Well, my concern is: will everyone on the board be able to do that? Some people do exactly what was said earlier. They call in yeah. It means we have people that have issues with technicality with technical. You know, so I just want to make sure that we're doing something that is feasible why everyone can do it. You know just we just got to be careful with that: okay, without an opinion one way or another, I think Linda I think Dougal got Doc was one of the choices they gave it yeah. It means somebody has to create that Google Doc and test it and make sure it's correct, and then we have to figure out what to do about people who are only calling in on their phone and do not have access to a computer at that point sounds like a lot of work. Well, I I'm not creating the Google Doc. That's for sure I do not volunteer to do that. It would definitely have to come from your committee. I mean I would think that would have to. You know be this rule, but unless we come up with another idea, I think we have to go with the original plan and I just ask a question when we say these are public always been public in the past. I do not know that we've. I do not recall that we've said Lisa Kaplan voted for Sam Schwartz. No, but they people request. That's not excuse me, that's not what we think about public Lisa, it's like it's a public like anyone could come in and request. I want to count the vote sheets. I want to look at the vote sheets and see how someone voted, and they have the right to do that, because it's public, for instance, Lincoln Anderson spoiled all the votes a couple years. But what I'm saying is this doing it by roll call would be more public. It's a different level of public, yes yeah and I think that's what Michelle's concern and I share it. Well, I like what the alternative, what about the Google Poll idea and that we just tell people in advance that it's going to be Google and if you're going to call in then you should get to a computer ahead of time. This is the ballot and we can distribute it in advance and you fill it in beforehand. We tell people that in October and then we send it out. You know a week ahead and if they, you know, they'll find a computer in a week. There are other things that other than Google docs. That may be easier to easier to create the ballot in them. That are, you know. Maybe they cost a little money to run. So there are alternatives, but could we just send out the ballot? Ask people to print it check the box and email it back to the board office by that night? I see it. I see a handful and I see I saw your hand Jackie, I'm sorry, I'm sorry, my fault, I'm talking without being recognized. Okay, Paul and Paul had his hand up and then yeah. So we went to that training. The nominating committee, most of us went to that training a couple weeks ago and there was a lot of these options being brought to us, and I know when we do finally get a consensus time to meet as a nominating committee. We can bring all this information up and figure out what we're going to want to use. As the alternative. I know the first hurdle was the bylaw to get that change. So I know that's the number one hurdle and then we can actually really figure out what we're going to use as the alternative option, while we're on zoom and all this technology stuff. I do not have no more question. I just share the same concern as Michelle and Lisa about a little embarrassment to do the role calling. So if we're going to do something other than the roll call, I need somebody who's got the technical capability to create this Google doc. On my committee Ray's hand enter Chat box. I do not see any hands. Lisa's has your hand up Lisa. I I'm not offering to do the Google doc. What I thought I heard Paul say was that it was going to be taken back to the committee and the committee was going to decide what methodology to use- and I think one of the things that they would discuss that you all would discuss would be. Can somebody create the Google Doc and I do not think it has to be somebody who's on the committee? I think you could ask somebody to do. It does not have to be the person on the committee, but that may or may not be what you decide the methodology you would use. I agree Lisa. I do agree with you yeah Paul. That was a good suggestion. Does anyone else have input they'd like to give at this time? Okay? Mate? Maybe so, if you really want to do the Google doc, you know they say it's the least secure thing because, like I said you know, I mean you have to trust in the community. They won't manipulate it because it's just a spreadsheet I mean I could help create it. If you want to do that, if you have nobody else on the committee to do it, okay, so should not nominating meet again, so they can decide. This is what they want to do. Yeah. We have not met yet because it was not quite time so we will meet and we will talk about this and get back to the board. Thank you, Linda. Okay, if that's the last question or input that anyone like to give we're going to move on. Okay, we're going to go on to the next item on the agenda, which is the budget priorities? Okay, so I wanted to briefly go over the process because, I'm sorry, I'm sorry Susan Lisa Kaplan, you had your hand up Lisa. I think she already spoke. No again, I got to find out something with the way this meeting was set up. It causes this and I do not know I did not set it up, so I have to find Lisa. I just wanted to make sure that we were leaving the committee with the Nominating committee with the understanding that they would try to find a methodology other than voice vote. Roll call vote that that's highly. That seemed to be the consensus of the exec. Is that correct? That is correct? Okay, thank you. Okay Susan, I'm sorry sure to just first briefly go over the process for the budget priorities. Each committee will vote on their budget priorities for that committee under their jurisdiction for the agencies that they cover and they will rank the the budget priorities from most important, to least and then all of the committee priorities will be collated together. But the rankings from within each committee has never changed and the way we've always done it in the past is the office collects all the ranked priorities and we make a straw like a straw poll list based on the way they were ranked the previous year, and then that is brought to the exec and then the exec goes through them and makes any changes that they think are necessary and then that list will be voted on by the full board. What I would like to do is generally the office worked with the chairs to put together a list to present to the committees and Jim, and I would like to speak to you know: have a conference call with each chair before your meetings to ask you how you want to stay, how you want to handle it and how you want us to help you and that's basically it for the process. If there's no questions, I think a lot of people are still having are more trouble this year than last year, at least in the public and understanding what priorities are, and I thought it might be helpful if I sent last year's priorities out to the whole board and say you know just say this is what we did last year, just to give you a sale, an example of how it's done. One of the things just sort of an alert is last night, a lot of people for some reason organized to have Charis a budget priority, and we knew this was happening and Alicia tried to explain at the beginning that it was a privately owned building. You know this is not on an agency budget and one Greenwich village, Harry bubbins, representing Bennett's village, said to everybody. I looked at it and it was on there last year. I do not know why he said that I've sent him last year's since then twice and asked him. Maybe he was looking at the district needs because it's definitely in there and the reason I'm bringing this up is just to alert the chairs that you may. It would be really helpful. I think if it comes up, if you help explain to the public or whoever brings us up, sometimes it's members also who kind of insist that there are programs that do not exist. That is be waste, it'd be wasting a priority because what happens if you vote on something- and another thing people can look at- is the answers from last year. If you vote on something, that's not an agency budget program. Well, you will get an answer saying you know. That's not you know we do not fund that happens occasionally with City Council discretionary funds, where we're not aware that a program is funded by City, Council and that'll be the answer that we get back. So I just want to give that a heads up and something that could come up at committees, and you know we'll deal with it. Then, if we have to, I think I'll go to the district needs, but are there any questions or issues on the budget priorities? First, okay. District needs. I think everything is complete, except economic development and human services, so we've we're putting those together we're working on introduction so that we can send it to the exec before the next Exec committee and that's kind of it and no questions from anyone. Any comments, any okay. Thank you. Susan. We're going to move into our committee reports SLA, nothing to report. Thank you, Alex Transportation, Public, safety and environment. All right there. We go nothing to report. We just had the D.O.T and Fdny come in for updates and I think they'll come back in November to answer some of our questions that we had, but no resolutions are passed or anything like that. Thank you. Paul economic development Anisha we met and we did have one resolution which was about returning application fees for applicants, who've applied for sidewalk, cafe licenses and it was discussed at the committee and it was passed besides that we just worked on district AIDS and sort of the usual things. You said for sidewalk, so before the pandemic, folks that had applied for sidewalk cafe, licenses, which now it has evolved where open streets is the method for which sidewalk or restaurants bar restaurants are or other businesses are using outdoor space and the department of consumer affairs is still holding on to the fees that were associated with applications for the licenses, and the request is really to have those application fees returned, because small businesses are in a crunch right now and could use the you know between hundreds and thousands of dollars that are sort of tied up in those fees. Thank you Anisha. Thank you for explaining that health and human services all right. So at the last meeting we like everyone else. We just talked about our district needs statement and it's you know kind of getting pretty much finalized. I just wanted to talk about our October meeting. So like everyone else, we also will be you know doing the budget priorities and district needs and voting on it. But in addition to that, we will have another agenda item, which is the alliance for positive change. Most of you know it probably, as the lower East side harm reduction center. You know it's been in our you know in our area for a very long time on Allen Street, so they have moved. You know to East Broadway between market and chatham. It's near Chatham. You know 35 east broadway, so it's a couple of doors down from the Chatham Square library. They, you know, found the place last year and their building, I think, is being sold and they had to move. So you know they looked around and found this place on East Broadway last year. Well, last year and this year they came to our board twice to get approval for this new place, one some they were applying for a grant to. I guess, build it out more yeah and then the second time so that the build- out thing was that was like last fall. I think, and then this year I think right before the shutdown they came to us again. They were still you know, working on it, but they also, you know, a part of their program is a those needle return boxes. You know where people can return needles, they can they can, they can drop it off, or else I guess, if they're not there, they can drop it off in this box. So often you know you may have seen some of these boxes in the park like like Thompson Square, for example, so they've always had one outside the door on Allen Street, so they also want to locate it there too. You know to provide the same services to that service to their clients. So I guess so. We wanted us to approve of a place, but you know we saw that it was near. The needle box would be kind of near the library and we launched door. So then we never. We never voted on that. You know because they were going to go back and think about where this needle box would possibly be. So that's where we left it, and after that it was a shutdown, and you know we never talked to each other again much so they're officially have opened their new office on last week. It was around September 8th. So now we will have them come again to our meeting to present about it and part of the reason. Why is because one of the Chinatown organizations? Well the Chinese Consolidated Benevolent Association? I guess you know, got all alarmed about it and I think there was some misinformation as well, but you know it was one of these things. Oh you know this. They called the naloxone center. It's going to bring in all these people who will be a danger to the children at the library when it reopens, and you know, and I've heard stuff people are going to be lying in the streets and yeah. So we so what we're having well so we're having this meeting where you know a lot, the harm reduction center will come and give a presentation and for those who miss the last two meetings, they'll definitely be able to come in here and ask questions, so I think it's a little complicated with what's going on in Chinatown. Well, first of all, you know what they do not get. What the lower East Harm reduction center or the alliance for positive change does not get as they've. Even though they've moved a couple of blocks a few blocks away not too far away, you know they sort of moved into a different world. That's the way it is in CB3 right. So you move a few blocks away and you yeah you end up in a different world so part of it. Is that part of it in Chinatown? I think there is a bit of this NIMBY- ism and then, but also the other thing that the you know the harm reduction center. They provide. You know really excellently substance, abuse services, but they're, not the services, not the type of substance, abuse services that Chinatown residents would need. So no one will say that you know there is no substance abuse in Chinatown, but it's not the services that they provide. So it's a little hard to argue that they even provide those services for Chinatown. So, as you see, it's just very complicated so, but we are having this meeting on in October and I believe it's going to be an ongoing thing. You know I do not know where it's going to go. I mean I do not even know what motivates ccba to do this, but no that's what it is. So I just wanted yeah so and me and Alicia were going to talk about it a little bit too right, yeah for sure. Okay, if anyone has any comments or questions or advice, please feel free, no hands. Okay, I do not see any hands raised, we're going to go on to the next committee land use. We met this month. We did not have any result, but we had an information session on 70 Marbury street and there are two major public opinions, so they want details to provide the details of the engagement process, such as the time frame and the number of meetings they're going to provide, and also the public one decades to move forward with the preservation assessments immediately. So after the land use meeting, I contacted dcas for their response and d. Cars agrees that they will prophesize the engagement details once they are finalized, see. The thing is that they just recently contract a consultant to do the engagement plan, but a lot of details has not been ironed out, so they are saying once they have all the details. They agree to prophesize them, so the public would know and but on the preservation assessment the preservation analysis. They are saying that they want to wait until the outcome of the engagement comes out. So I'm going to follow up with maybe Gail's office to see what else we can do and that's for the land use meeting and also I want to talk a little bit about nature subcommittee as well, because we are planning to reactivate an hsf committee in October, and I have submitted agenda to Susan, as you can see in the documents that she sent out and I think my chest of committee, we still have to spend some time to work on it to see what else we can do to make sure the October meeting is smooth and productive, and that's all I have yeah. Thank you Jackie. I agree. Okay, any questions for Jackie anyone Alessandra. Are we taking questions from other board members Sandra? I see your hand, but I think you're going to have to have a conversation with Jackie and myself. If you have a question for him. Okay, I can't see you, but I want you to just know that I do see your name in your hand. Okay, all right, so we're going to go on to the next committee landmarks. We did not meet. Okay, thank you. Parks come on trevor. Here we go, I'm muted, so I had done no resolutions but a lot of issues, as always with parks, mainly that there's a lot going on with our waterfront. It's taking quite a bit of time to the point where some are asking for two meetings and some people do not want two meetings, but when you have two major flood resiliency projects going on at the same time, a lot of them have a lot of they both have a lot of detail and a lot of issues. It's just difficult to manage and you add the other issues that we've managed to push for months, that people want to talk about and we're really running into long meetings and a lot of issues I'll go over a couple of them for one main one, and that is the lower East Side Ecology Center's request for relocation. I think there was a big committee and from board members which caused an issue because folks were like, we keep moving the ecology center every month and we have not. We actually voted on a resolution in June to approve that resolution, but somehow people forgot about that. What they're seeking to do- and this is the other issue- is asking for relocation to pier 42 they're, calling it a parking lot. But it's part of pier 42 a park that the entire community has fought for. You know it was given to us by the city and turned into a park, and I really do not think people understand that you can't just say we're going to move one particular facility to another area without really doing extensive community outreach. It's the same thing, if it's as if someone were to say, let's move the ecologies or the compost chart to seward park or Corlears Hook or to a community garden without doing any outreach, so I think it's difficult. I think it's going to be interesting next month, and I appreciate the offices, Susan and Jim getting me the resolutions for pier 42 to show folks that this is a park. It's not just a we're, not moving it. The temporary location would not go to a parking lot. It would require us to change the plans. It would have to go back to the federal at the federal level because it does have federal funding and require months and months of outreach. That appears to be the sticking point and I've informed the ecology center about that particular issue, but it does not seem like it's working. Those are the main issues. Anyone have any questions. Yeah I see. Lisa Kaplan has her hand up go ahead, Lisa Unmute yourself, yeah. I do not agree exactly with trevor. That was the intent of the discussion with it was up mentioned with regard to the ecology center, but I know what I wanted to see happen and I think I can speak for at least one other member of the board that suggested a resolution at that meeting was that we were looking for a resolution that talked about the permanent re of the ecology center to East River park, which is not in the plans at this point and that there be a temporary reload that they'd be temporarily relocated somewhere in the neighborhood. I completely understand the complications of pier 42 as a permanent location, but I'm not at all sure that that's what was being presented- and I yeah- I think that- there's a misunderstanding about the intent of the rezo- and I guess that's also. It was not just the parks Committee it also. A similar thing happened in the land, Use Committee, on a on a different subject about just clarity about when a resolution can be suggested when there's a when there's an update listed on the agenda. So I would like a discussion of that, but I really disagree that the only issue that the low recited ecology center is concerned about is pier 42.. I think they're concerned about their permanent home in East, River Park and a temporary relocation more accessible to the neighborhood than 124Th Street. One of the things we were trying to do was get clarity, because no one even knew that they had they were in or talking about a contract to move it uptown and no one knew about the existing relationship or whether they had signed a contract to move the umbrella age group to seward Park. So the first thing we were trying to do is get clarity so that everyone could understand exactly what's going on, because we did not have that discussion on our agenda and this was the same thing in land use. We set an update because we needed for everyone to understand exactly what was going on the two resolutions that were set included, language that said relocation to pier 42.. Those are the two resolutions sent and, as a matter of fact, the same resolution was sent for discussion for October. The agenda item will now read for October that we're going to discuss the temporary location, we did not say Pier 42.. In regards to returning to East River Park, we wrote that resolution in June, which stated that we wanted them to return back to East River Park, oh well, okay, I did not want to respond. If I was not yeah, I agreed that we did in June, but I think that the intent was to have that reiterated because that it the it at this point, we've seen designs of the park that do not include it so that it's at a different level of urgency, and I think we have to up our ante there and I, as the first version of the resolution that was suggested, did have pier 42. The second version did not mention pier 42.. It called it a parking lot, which is pier 42. know I. My understanding was that I my communication with Kay and my understanding was that when she revised it, she made it broader than that. I think she said something like pot explore pier 42 parking lot, there's no confusion. At least on my there might be with some people, but not with me that the parking lot is part of pier 42.. I'm not confused about that. In any case, we're going to discuss it at the October, it is a is. It is an agenda item for October parks and resolutions, so we can have a full discussion and write a resolution and restate our position that we wanted to return to Israel's report. Okay, Jackie has his hand up yeah, so in terms of when we can propose a wrestle, I just feel like if we are doing this as an update, if we made it clear, this is update information session. My experience from the past is that we do not normally pass a retro based on if we already said that this is an information session unless it's different, so I just have that kind of understanding and also if someone is going to introduce a session. I think it also need to support from most of the committee members and that's what I understand about when to propose a wrestle. Susan, okay, go ahead, Susan, just a procedure on the agenda. We try. If there's going to be a resolution, we try to be very clear that there will be a vote and what it will be specifically on, and this is something that's in the last few years have come up a number of times in the exec. That's why we sometimes very specifically put informational, which means no vote. Update, is a little bit more between, but we just try and be very clear if we're going to be taking a position on something: okay, all righty. So thank you any other questions for trevor. Any comments for Trevor. I have a comment. Okay, Lisa has a hand up go ahead. I would like for parks waterfront to move up in the committee reports for one month. I will move you up. I will make sure that I make that happen next time. Thank you so noted trevor so noted. Lisa go ahead. Lisa, it's muted Lisa. We see her plants, yeah Lisa, I'm I can't until you ask me myself, I am unmuted now I still am not clear with what is the wording that requ that is necessary for their to allow for a resolution and what yeah? I guess I want to know what specifically has to be in an agenda to allow it to have a vote. Update yours, you said, is not clear. So is it yes, or is it a no? I who determines that and well I'm just going to say from my end, if someone tells me that we're going to be voting on something we very clearly put that on. You know it's. What I put on the agenda depends on. You know what information I'm given, and so I do not that's about all I can say, but if I'm told you know that we we're going to have a resolution, we try to be very clear on saying what that resolution is. How do the members of the committee know? I mean I, it really has to be something there has to be a clarity on this. You know that in two committees I attended this month. Certain members asked for something and they were told you can't do it and then there was no discussion from various members about. Yes, we really want to. They were just told you can't. So I, if you're referring to my committee, that's a misrepresentation, I did not say you can't. I said at the chair's discretion we're going to discuss it next month. I felt that this agenda item required more information. I never said you can't and you're right 10:40 at night, so I did not like it okay point well taken at the land use, we were told. No, I did not say no. I was just saying that and I think for clarity reason. Maybe in the future we want to make it very clear. What is the right wording to say that this is a information session and the vote is feasible. Like I mean since we are talking about this today, so maybe we can clarify it for future like what is really. I think it needs to be clarified. So people know it in advance and it's just it's too murky at this point. That's all I'm trying to say and I'm not blaming anybody. I I'm not pointing a finger at any committee chair, I'm just trying to say. I think this needs clarity, so Lisa in this case it was really unclear right that we were discussing something that was going to result in a resolution. So we do, I agree with you. We need to make it clear and it's not always. You do not always have a resolution, even if the possibility exists right sure all right. Okay, I see two hands and Trevor had a request, so I do agree with trevor. We should definitely put it on the agenda for exact next month and why do not? We just add that to the agenda Susan for next month? Okay, so what exactly? Are we adding to the agenda this discussion about the wording for when we intend to vote and when we do not the wording agenda item wording that provides for vote yeah? Yes, I mean, if we're doing something like a euler, if it's real, clear right, it's not necessarily clear if I could just say the two ends of clarity. We've agreed that if it says information that there is not a vote, when someone requests a vote, we always put support for. So those are the two ends where we know we're going to do something or we're not going to do something. Okay may had her hand up as well may yeah. Well, my understanding was that if it says for informational purposes, only there won't be a vote, because that's only what it's for, but potentially you could vote on anything. You know what you vote on, whether you do. It is another thing, but you know in theory, I thought that you know there is no way to you know so, there's only one there's, I know a way where you can say: you're, definitely not voting it's for information purposes only, and maybe it's on a larger issue that you're going to vote on later, and you know that the information being presented at the meeting is not enough. So that's one reason why you do it, but I knew so. That was my only comment, but since we are talking about this next month, that's all I'll say for now. Okay, thank you. Thank you, mate. Any other comments. Before we move forward. Okay, so Michelle did you get that? Did you capture that we're going to bring this discussion back next month? Okay, thank you. Okay, so now we're going to talk about task force subcommittees so NYCHA section 8 subcommittee is on the calendar. If you all looked over your calendar, you put it on there Jackie and I will be chairing that meeting until we make a decision as to what we're going to do so we're going to do a collaboration, jackie and I Yay and arts and cultural subcommittee- anything happened there. Anyone this is an issue I do not think Caroline is on okay, but the district needs for that subcommittee is not final for economic development. We did finalize ours, but arts and culture is still working on theirs and hopefully it will be ready. I did not see that they have a committee. Yes, they do October 14th, okay, yeah they do and they're presenting at economic development. Okay, great! Okay, wonderful! Thank you for that information, nominated planning subcommittee. Nothing! Could I ask for scheduling purposes. I've heard for the subcommittees that they're going to meet every month every other month and every two months could we figure out so that we have some idea for scheduling and if they're both not meeting every month, I would it would be good to have one month and one the other, I'm not asking for an answer now, but maybe that's something the committee subcommittees can think about. Are you speaking in reference to all of the subcommittees? The two subcommittees? Okay, yeah. I think that's what Jackie and I plan on discussing with the subcommittee when we meet with them well, but it would be good for to coordinate if it's not every month, that coordinate with arts and culture definitely but we'll. We will definitely be in discussion about vessels and thank you so much. Okay, any old business, no new business. I just want to say oh Michelle, go ahead. Michelle! Thank you. Thank you. I have two things that I'm not sure that we really need to discuss right now, but just maybe we'll come up next month. One is that, as everyone I'm sure knows, indoor dining is coming back to New. York September 30th and I've been reading about how the regulations in New York are subpar to what are in New Jersey, where people are required to put their masks on when they're, not eating or when servers or staff comes over to their table, and that seems like I do not know, maybe an intersection of public safety and health and human services, or something like that, maybe just health and human services. Maybe it's SLA, also, I'm not sure, but it seems like a cross- cutting issue if we wanted to pass some sort of resolution suggesting that the city Council implement stricter regulations. I just I I've been eating on a lot and I see people just being wildly disrespectful about how they interact with staff, and I can only imagine it will be worse. I do not understand why we're not trying to protect the workers- and I bring this up because our district is so saturated with eating establishments. So perhaps we could be leaders on this if we wanted to be, and then the other one is that, as I'm sure you all know, I've been a zealot about the NYPD blocking off their streets and I walked around the district. Looking at the fifth, seventh and ninth and it seems like I mean Alex correct me if I'm wrong, I know you live in the same block as the ninth, but that the ninth and the seven have really drawn back, but the fifth has almost in some ways barricaded themselves in more on Elizabeth Street, I'm not sure if anyone has been down there recently and they're doing the like angled parking up against the buildings. In fact, in front of like a medical building, I saw an older woman struggling to get inside because the car was so close to the door, and I know CB6 recently passed a resolution asking him to take it down. Gail is doing a lot around that, so I hope that there might be some support to pass a similar resolution as a CB6, if see if the NYPD does not draw back shortly. That's all. Thank you. Thank you, Michelle, any others. Okay, I want to congratulate Eric he's been a parent for one whole year. Baby turned one years old, congratulations! Eric! I know who you are? Yes, you do. I should not have made it myself: okay, Alicia, yes, Michael here, Lisa Yes, Eric, Sarah cuddling, oh yeah! Thank you Michelle! Yes, Herman is on Anisha. Yes, you may! Oh yes, Jackie! Yes, Linda! Yes, Alex! Yes, Trevor! Yes, Paul! Yes! Thank you. Thank you. All have a great evening I'll see you all next week at Full board, okay, good night good night, good night.",
            "summary": "The, only thing I've got is ask to unmute, which seems to work, but only temporarily right, Okay, great, I do not know what in the world headphones, do not work.\nSecond, Vice, chairs, report, Lin, Lisa!, No, I do not have anything to report, but could you just instruct me when the best time is for me to ask my little question that I sent everybody the information about in an email sure when we get to that particular topic?\nSo he knows just want to ask people as far as your agendas, You know, they're made up the committee.\nYou know both with agenda items from city agencies as well as issues that you went.\nThat people did go to was one put on by the Civic Engagement Commission and it was on board elections, and it was really unfortunate that they investigated all parliamentary procedure, but not community boards and open meeting, and they gave a lot of incorrect information and the bur aldrin from the borough president's office.\nThat was that was the big issue, and so I just wanted to make sure that people were aware of that, and I will talk more during the budget priorities, section.\nWe did not, which we did not have the agenda and give public notice for I mean we're not going to have this vote until November, right, So I.\nSince people join our meetings, you know from their phones, they're not going to be able to you.\nI do not even know how you would switch people to the electronic ballot to vote and then to come back to the zoom meeting.\nDepending on who's, running, I feel like people might want their vote to not be public, as it traditionally happens to public But, maybe not like in person calling out.\nJust we just got to be careful with that: It means somebody has to create that Google Doc and test it and make sure it's correct, and then we have to figure out what to do about people who are only calling in on their phone and do not have Access to a computer at that point Sounds like a lot of work.\nIt's a different level of public, yes, And I think that's what Michelle's concern Well, I like what the alternative, what about the Google Poll idea and that we just tell people in advance that it's going to be Google This is the ballot and we can distribute it in advance and you fill it in beforehand.\nThink a lot of people are still having are more trouble this year than last year, at least in the public, and understanding what priorities are, and I thought it might be helpful if I sent last year's priorities out to the whole board and say you know just say this is what we did last year, just to give you a sale, an example of how it's done.\nWe met, and we did have one resolution which was about returning application fees for applicants, who've applied for sidewalk, cafe licenses and it was discussed at the committee It was passed besides that we just worked on district AIDS and sort of the usual things.\nSo, like everyone else, we also will be you know doing the budget priorities and district needs and voting on it.\nSo often you know you may have seen some of these boxes in the park like like Thompson Square, for example, so they've always had one outside the door on Allen Street, so they also want to locate it there.\nIt's going to bring in all these people who will be a danger to the children at the library when it reopens, and you know, Definitely be able to come in here and ask questions, so I think it's a little complicated with what's going on in Chinatown.\nAnd that's for the land use meeting and also I want to talk a little bit about nature subcommittee as well, because we are planning to reactivate an hsf committee in October, and I have submitted agenda to Susan.\nWe still have to spend some time to work on it to see what else we can do to make sure The October meeting is smooth and productive, and that's all I have But I think you're going to have to have a conversation with Jackie and myself.\nI think there was a big committee and from board members which caused an issue because folks were like.\nYou know it was given to us by the city and turned into a park, and I really do not think people understand that you can't just say we're going to move one particular facility to another area without really doing extensive community outreach.\nAnd I think I can speak for at least one other member of the board that suggested a resolution at that meeting.\nI, completely understand the complications of pier 42 as a permanent location, but I'm, not at all sure that that's what was being presented- A similar thing happened in the land, Use Committee, on a on a different subject about just clarity about when a resolution can be suggested when there's a when there's an update listed on the agenda.\nThe agenda item will now read for October that we're going to discuss the temporary location, we did not say Pier 42.\n, I am unmuted now I still am not clear with what is the wording that requ that is necessary for their to allow for a resolution and what I guess I want to know what specifically has to be in an agenda to allow it to have a vote.\nSo people know it in advance: I'm not pointing a finger at any committee.\nThey do October 14th, okay , The other, I'm, not asking for an answer now, but maybe that's something the committee subcommittees can think."
        }
    }
}