{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "title": "CB7 Preservation Committee",
            "publishDate": "2020-08-13",
            "shortDescription": "",
            "lengthSeconds": "1:33:10"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "jUfCk_fley4",
            "fillerWordCount": {
                "uh": 133,
                "um": 166
            },
            "readTimeFullTranscript": "47 min read",
            "readTimeSummary": "4 min read",
            "wordCountFullTranscript": {
                "building": 48,
                "floor": 32,
                "screen": 28,
                "street": 25,
                "window": 24,
                "view": 17,
                "brick": 17,
                "equipment": 16,
                "windows": 16,
                "storefront": 14
            },
            "wordCountSummary": {
                "street": 8,
                "building": 6,
                "floor": 5,
                "units": 5,
                "vote": 4,
                "window": 4,
                "end": 3,
                "idea": 3,
                "marquee": 3,
                "portion": 2
            },
            "fullTranscript": "Three hotels every day, just on my bike riding and I at different times of the day. I have not seen a lot to give me concern. I do not know you're right there by the Lucerne ride by at 9:30 at night tonight: yeah! Okay! Maybe I'm not coming late enough! Yeah! Okay! Now I have to mute. I'm sorry, I'm setting up the oh. It is okay, good, okay! So we're now streaming sorry! This is taking a look. I had to upload those things from the 541 that I did not know about. Thank you. Yeah word to the cloud. Okay, so 6:30, hey we're actually ready to go. How about that now we're we'll be visiting Josh and Susan tonight: okay, Peter Jay! Is there Thomas Barry you're 541, no you're, which one of you hi we're 55 West 86Th street? Okay, I'm going to I'm going to hit broedcast, which will let attendees in I'm not sure if there are any but we'll let them in, and then you guys, let's see, you have one two, three, four, that's actually a quorum, but let's see, if there's anybody else in attendees Madge. Can you like yeah, move your screen, so we can see your face a little bit better tilt it toward you yeah! That's my there. You go beautiful. Oh you can see your scenery too, which is very nice and Jay. You're home yep help mine a little bit too. I can't hear you maj. You got ta unmute match things yeah you have to unmute honey. Oh push! Your screen, hey doug, hello, you're hard to hear Doug. Oh, can you hear me how's that much better who's going to take minutes? Jay Madge? I can't do it tonight, I'm going to have to get in the car and go somewhere part way through. Can you hear me now yeah you need to tilt your screen a little toward yeah, because we can't see your whole face there. You go beautiful with the background. What do you have? A lake have a stream and a tree a bay, a bay wow, oh nice. Where is that match? Fisher's island? Oh there's island yeah, the bay that goes into the sound excuse me. Oh okay, my relatives have a story about fishers Island, because when my relatives were kicked out of Hartford colony, they set off for what eventually became long island or New York colony, but they stopped on fishers Island, which is why something so close to Connecticut is actually owned by as part of the state of New. York they've talked about trading it for years, but has not happened. What do we get? Instead? What some people want to trace staten island to New Jersey, for I do not know what, but you know the story of Staten Island, supposedly right, the boat ranch, the Arthur kill right yeah. I think New York and New Jersey had a competition in New York lost, so we got it. There was actually a Supreme Court case a few years ago about who owns? I forget. Is it liberty, island or or Ellis Island? It was one of them and because this is liberty, I think it was liberty too, and the question was well. The original island was owned by one but the, but the so who owned the landfill versus who owned the original island and anyway looks like you got a quorum guys. So, let's get to let's get hello Doug. How are you nice to see you? Other dogs? Apologies for being a few minutes. It's okay, we're going to start the meeting. We are the. We only have one applicant here mark. No, there are a couple of in attendees who I assume are applicants, including somebody by phone. Let me just take a moment to unmute the 201,826 number, and can you tell us who you are and what application you're here for I'm going to be presenting for 305 West end Avenue! Okay, thank you all right. So we are the Preservation committee. Thank you. Welcome we're here for our August meeting. We look forward to hearing your applications. Our mission is to advise the Landmarks Preservation Commission on the appropriateness of the changes you want to make and I'd like to have all the committee members introduce themselves. My name is Michelle Parker, I'm co- chair with hey carpenter, yeah. Thank you and Matt Rosenberger Matt rosenberger Adolph, yes, doug you're, a committee member right, yeah, Doug, Mcgowan, Doug Kleinman is one of our veeps and our chair, Mark Diller, and you got Peter Sampson because I did not see his face. His lovely face and Peter Sampson is a committee member and did we Jay? Are you taking notes or is somebody? Did we decide that I was not planning was not planning to. I think I did it last time. Well then, Doug, could you do that? For us? Oh okay, awesome! Thank you! Oh let me just I'll do I'll. Do it next time, okay, so Doug Mcgowan! Thank you very much for taking minutes and the first application, I believe, is 305 West end Avenue. You know I'm just going to promote everybody to panelists. There are not that many folks and I'm guessing that one or more of the people I'm promoting right now are the presenters for each of these applications. So, okay, great okay, so now you've got a whole bunch of folks. Will the folks for 305 please identify themselves 305 west end anybody here. Let me let me I'm going to go. Take a look at the materials for 305. that would be tuller, mcneilless and Feld. Are the architects she's saying in the chat that she's on the telephone yeah? Ah, okay, is that Danielle? I can't. I can't promote somebody on the phone to panelists, so you'll just have to speak. Probably so Danielle is that you hi Samita, yes, Tyler Mcnellis, yes, correct something on behalf of them can't hear yeah. We can't we can't hear you. Can you hear us use the chat if you can sumida you're appearing both as a phone number and as a panelist yeah? That's interesting! I'm not sure why it's showing that's. Why can you all right now I just muted you on phone. Can you speak through the the other one, the panelists sumita? Can you hear me and if so, I'm not okay, you can hear me okay, so you all right so now I'm going to do. Is I'm going to mute that and unmute the phone? Try that now? Okay? Does it work better? Yes, except I need you to mute your computer. If you're going to use the phone the phone and the computer will have a back will have a loop, she did yeah and tell her. She does not have to share her documents because we have them. Okay, great! Is this better now? Can you hear me now much better? Thank you. Okay. I apologize sorry, I'm typically when we use zoom for architectural meetings. We do not share screens and I usually just call in and we just share screens, that's why I'm used to doing it. This way. Do you want to do you want to do you want to share your screen instead of me, putting the document up then she's going to echo not necessarily not necessarily as long as she's muted. She should not echo. Oh, I see yeah you're right as long as the computer is muted yeah. I can share that's fine, okay with the marquee all right, so you should have the power to do that. Now. Go right ahead! Okay, everyone can see my screen yeah all set great okay, great, so I'm presenting on behalf sorry for the little hiccups technology. As you know, I'm presenting I do not know how much you know about the building, but this is 305 West end Avenue. It is an assisted living facility and I'm just going to go through the photos that we have to get an idea of what it looks like currently, I'm going to zoom in here. Okay, so this is a photo from 1940 taken from 74th street. It is located on West bend Avenue between 74th and 75th, and this is a view from 74th street looking up at the corner of the building, as we continue you can see here. This is the photo taken in 1980 designation, and this just shows the marquee at the state at the time. It was a hotel at that time, and this is a current photo. So, as you can see, it's still the same structure for the most part, that's been untouched and we're just proposing, which I will walk you through, how we plan on restoring it, and this is a image from the front, so you can see so existing there's a metal frame, that's clad with a metal fascia here with like a bronze frame around it. It's got a fabric spawning below which we've already found separately. It has been approved for the fabric running portion of this existing, underneath just to give you a little understanding of it, there used to be a two by two hideous drop ceiling down here, with some fluorescent light, so we are proposing to remove all of that because, as you can see up through here, there are some beautiful architectural details that do exist and our intent is to highlight these some photos to give you an idea, so we're going to carefully remove anything these. You know anything that was hanging from this structure here. We also do have to remove the frame, unfortunately, for this fabric awning just to replace it in kind because it is rusting out- and this is our proposal to give an idea of the rendering of you from underneath, as I mentioned before, as you can kind of tell on these images here, there is some beautiful coppering. So we're going to look to highlight that the intent is, as you can see here, is to actually paint these out see a similar colors to the frame. That's here on the fascia, even though we are actually supposing to just update the fascia, because, as you can tell here, it's not in the best shape. Necessarily, you can see there's burning on here from the lettering that used to be on here, we're just going to clean it up by installing new metal fascia panels, a new frame and underneath matching the same color as the fascia to the underneath panel, we're proposing to paint the existing architectural detail on the perimeter. There are three coppers existing and then we were going to drop a metal aluminum dark, Bronze aluminum panel in these three sections, which will then have some accent lighting, which will then further draw attention to this detail, and then the remainder of the canopy underneath will be painted out this chalk white semi- gloss just to brighten it up again. It's just to bring attention back to what character would actually tell we do have. This is just showing you an existing canopy, longitudinal section. So, as you can tell, as I mentioned before, there are three sections here. This is the Crawford area here and, as I mentioned before, we're just going to be removing the awning. For this I mean the framing, for this part just to reattach it just because it is damaged. This is the transverse section again sorry about that again through one of these copper areas. That shows the copper is coming up on the perimeter. This is not. There are like existing holes at the perimeter, but they are pretty rusted out and damaged. This is just showing the removal of that framing again, and this is just some details in terms of what we're proposing to install, as I mentioned before, we are looking to drop three dark bronze and as aluminum panels in these locations, and it was going to be lighting and solved in each of these corners to highlight the existing coffers. Within each of these panels, there will be some general illumination down lighting installed as well and a recessed heat lamp. Again. This is the living facility, so someone's out there, you know waiting for a pickup or a car is just something that the building runs off for comfort and then this is the plan showing what I just spoke about. So you just take a quick look here. This is the existing cost. You know for me, and this is those drop panels with the general illumination and the accent lining around the perimeter here. This is typical, except for the recessed feeder in each of these locations, and this is just a little detail of that condition again existing coffer. This is a marquee. This is that drop panel. This is actually a slowly and then it's showing you the light. That's highlighting that coffer again, there's also a transverse section from the other direction here, showing you, then general illumination perimeter, Lighting, to highlight the crossers and again just to summarize all that you've seen the thought process there. This is where that rendering came from just to give an idea of what it would look like underneath because from the street space coming from the facade, you would not necessarily notice this change, but obviously underneath we're trying to bring attention to the architectural detail that is present and then re- cladding and cleaning up the fascia that exists here. So that is what I have for the marquee today, just where's the signage and what what's on each face of the marquee in terms of signage again, just the fabric awning has already been approved, we're not adding anything to the metal fascia. Okay, and could you explain how you're showing the architectural details how those will be shown? I mean we're going to be, like I said, moving everything and pulling this back so that it's just at the center, just as a vehicle for adding lighting to highlight the copper. So if we go back we're pulling back everything, that's there and just dropping a panel in the center just so we can install lighting because we do not want to disturb the existing structure at all right and the heat lamp is the one in the middle, correct yeah, because that's where the center of the doors are I'm sorry right. That's the main entrance of the building. So that's where it would be okay, yeah, and could you review the materials you're using again sure for the canopy? Well, yes, it's aluminum powder coated, dark bronze. Color the same, I believe color on the fascia as well. It is on the drop panel and then we would just like, let's see I'll, go again, it's break metal! That's a dark bronze finish here! That's the fascia and underneath the frame is a bronze and then the frame is an ample and then the rest of the underneath of the existing area, which does not have any detail. Okay, is that painted chalk White? So again, it's mostly just a canonized aluminum panel Fascia A and a we're going to use a frame that has a color of an antique grass. I do not think we're actually going to get an antique breast frame here and then we're going to be coloring a similar kind of anti- glass here for the copper, so that is material go ahead. I would just be the location today and because there's scaffolding, I can't tell how this I can't how this canopy interferes with the window or not. It does not. Okay, I mean it's with the you know again replacing in kind in terms of the structure: that's there, so that does not update the window. Currently, okay, mark you going to say something yeah, I thank you. I had a question or two. I assume that the purpose here is to use the existing framing and infrastructure and to do as little additional work as possible. Otherwise, I'd be asking you why, because in that stretch of West end avenue, most of the entrances have traditional canopies as opposed to you know. Marquee type arrangements like this is that the is that the goal is to do as little additional work as neces as possible. This is what makes sense if the idea was to restore what we already have in terms of the structure yeah. I guess my question is around the choice of the dark bronze colored. Is it aluminum or whatever the metal is, that is above the fabric, which I think currently has signage on it, but you're proposing it to be blank. That has not weathered well over the years and it also kind of is. It appears to me to be a creature of its time, which is of the 1970s and 80s when I believe it dates back to, and I'm wondering why you know, even if you were to have a marquee like structure as opposed to a more traditional canopy. Why that color and material were chosen because there's an argument that it might be a little out of out of date and out of place on that stretch of West? I end it's more related back to the building, because the window frames themselves are more of that color on the window, frames that are on the building right now, so keeping in contact with the color of the building. I know right here- it's maybe not rendered well, because it does look a lot lighter than it would actually look like. I think I do not think it would be this light of a brown yeah. Okay, I think I think that's a little bit and then also obviously we're all seeing it on our own screens and even on my screen, it's appearing differently. I just I find this to be a little bit of a missed opportunity. I know that is effectively replacing and kind what's already there, but but I do think that it's a little bit of an anachronism in itself, so replacing an anachronism does not but you're lucky, because I do not vote with the committee. So you wanted something more in keeping with the other buildings on the block. Well around the corner from this building is that is it the pythian temple which I believe has, and then we saw an application for a building acrosss the street from it a couple of months ago, or maybe a few more. My grasp of time is losing is eroding, but fairly recently we saw a hotel that changed its name and changed its use and they also had a bunch of stuff on the roof and they had a marquee like entrance as well, which is which is, I believe, appropriate with respect to a building that used to be a hotel, even if it is not functioning as one now. So I do not have a principled objection to that, but I believe that they went to some lengths to update the marquee appearance or rather not update it, but to bring it back more historically to what it had been when it was first created and again I do not want to harp on this, but the but what's being proposed here seems to replicate an intervention from a previous era and maybe not the best era at that. So what would be an alternative we've seen, we've seen interesting things that have metal framing with glass panels. We've seen fan like treatments that have different kinds of no one wants me to design their building for them, but I, but we've seen other things in this kind of a context that I that I, that I compare this to is what I'm, I guess, what I'm getting at Peter, I'm sorry Jay and you're muted Jay. As far as marquee versus canopy on west end, just as a point of reference, two doors south of my building, the building has a marquee and it once was the hotel, mayflower and then a nursing home. And now it's a co-, op and also on 79th and west end on the other side of the street. I think it's 400 west end also has a marquee. So there are you know there is. There is some precedent along the avenue, particularly when that's what was there historically yep Peter. Do you match? Did you want to say something? I was just wondering if there was a picture of the hotel before this particular mark, he went up if it had something different or if it's always looked like this. You know the 1940 picture yeah. Thank you for that yeah. Can you go back to that thanks? Yes, it's a little hard to see everything down the street. To be honest, anything in the 1980s photo. Oh, this nope look we're kind of going closer back. To that I mean if you look at the coloring and everything which I understand, but this is the only color photo we ever referenced. No, obviously, anyway, shall we yeah, okay, yeah. I mean sort of redesigning something I guess I can live with it all right. There's the second part of this presentation. You want to continue. Miss sure all right, so you want me to comment the other one. Can we go on these separately? If you want to do that sure they're two very different yeah. They are that's true, so this is 305 west end a canopy restoration. Okay, as is we, the resolution is to approve, as is as presented second as presented all right, also, all those in favor or maybe I'll make a roll call. Okay. I vote yes, j, yes match! Yes, doug, yes, Peter! I do not muted Peter, yes, very good, thanks, okay, and so that is one and myself is yes, one, two three, four five, six any other. I think that's the whole committee zero non- committee board members mark Oldstein, okay and Doug climate. Yes, anybody else! I do not see anybody else. Am I right mark. There are no other non- committee board members when it's not when it's not my screen being shared. I can't help you there. So all right, Michelle, that's correct. I think that's right, so that vote is one zero one, zero all right. Okay! Now! Thank you. The second part of your presentation, please! Yes, okay! So, as you now are familiar with the building same location, obviously the second floor, we're talking about limited visibility from 75th street, let's see context again so on 75th street, I'm just going to zoom in here for a second to get an idea. As I said before, the building is fronted. Okay, it's pressing on West End, Avenue, 74Th 75th. There is a building here and a building here hang on a second. I do not think I think excuse me. I think you need to exit the share screen and then call up the new document because you're pointing things we can't see. Oh I'm sorry! Okay, hello, yes, Peter! Yes, I have to leave the meeting. I'm sorry! I have not something else. Coming up. I apologize good luck, Peter good to see you stay well all right! Thank you. Thank you. September all right, I'm trying to figure out how to share. Thank you. So if you go to the top of your screen, I think it's the top of your screen. There should be stop share. Then new share right! Okay! There. You go sorry about that. Okay, let's start again there. We are thank you so again with the building. It's fronted on 305 west end avenue, as you know, that's where the entrance is, and it's between 74th and 75th this year on 75th street. This is the view that we're talking about now and there's a setback on the second floor. Okay, at this setback, there was existing equipment which I'm going to show you here. This is the existing equipment, locations and I'll walk you through the views. If you look at we'll start with photo9 just so, you can understand the existing the view that was there when you're from 75th street looking up. This is what your view used to be. There was this large ugly, existing dryer vents? There was a cool air unit. Here there was a lot of miscellaneous mechanical equipment, so I'll just walk you through the views here. This is a terrace that is accessed through the second floor. At that time there was all this equipment up here, as you can see, there's exhaust sucks vents cooling unit, a large cooling unit over here with this ugly ductwork. This very large driver, which I brought your attention to earlier. So this is just giving you the context of what used to be there who has access to this second floor space, the the residence it's a common space, it's a common, the pool area. They have a pool table, billiards area lounge that type of thing that's inside and then they can come outside exactly yes, so inside is like a lounge area and outside is the Paris. Is that green color? The act accurate? Is that the act? That's? What was there? It's probably just the waterproofing. That was there at the time. I guess in this location. That's not there! Now! No okay is that this school next door to the west of it, or is that 304 75th street just to get the bearings? This is on the West side of West end right. I think this is on 75th street between west End and Riverside. Is that what we're looking at so the visibility is from the visibility is 75th acrosss the street on the 75th street? Okay, yes, okay, I understand what you're saying now: okay, this is again just giving you a comparison of the existing equipment that was there. We removed the large ducts, we removed this equipment here, and this is the proposed equipment. Well, it's already installed. So that's the portion of this. So you have to get to this. Equipment is installed. It was installed because it is an assistive living facility and they are, they have a certain. I guess it was installed in the spring of 2019 and it provides air conditioning for the common areas it replaced existing equipment. There was limited visibility. They were concerned about the safety of the residents, so they got it in they also at the time, had a permit for the second floor, mechanical and the contractor at the time and his understanding thought he had a permit to install these units at the time. So that's what has been installed currently so we're only being asked to consider a screen installation, the equipment's already there, the equipment's already there legally well, no that's what I no. It was not installed with a permit again the contractor. We had a permit, he had a permit for the second floor, mechanical equipment or a mechanical permit rather- and he understood that as because he's not from New York City, they are out of long island. So from his understanding, he thought he was approved to install these units and he gives his concern for the safety of the residents because they are older and they have certain health conditions in the building. There's numerous you know occupancy throughout, and this provides air conditioning for the common areas to install them. So then, so it's a legalization application. It is for the units, yes and then with that because of OSHA there's the second portion of it, which is why we're talking about the screen is because of OSHA, because this parapet is too low in this existing location. They had to install a railing so that an idea was that requirement by DOB. We have to install a railing as it is, so we decided to use as an opportunity this shield to create a screen for these units. So this part of the application- B really has two portions one is the legalization of the installation of the air conditioners and two is the railing correct screen spring? It's a yeah. I mean there's a railing on this side, that's not visible, but for the units that are visible, we are suggesting you know a mechanical spring, flash Whale in combination. I apologize if I'm jumping ahead, but do you just have a photograph of this? Yes, I'm going to get there yeah, so here I'm going to jump ahead a little bit, so you can see it. So this is a photo from acrosss the street here, there's actually three okay, so, as you can tell here, there is an existing water iron front here that at 75th street all of these locations- those are the units zoom in. If you want that, are installed back there, e3, let's see and the fence is staying as is right. We're not touching this we're not touching anything here and technically. This is not our property, our properties. Our building is back here that property in the front there that's a garden for residents. Is that right not for these residents? No, but for the residents of the adjacent property? Yes, yeah yep, since we're here, we might as well speak about the screen and I can go back and show you some more. Is there a picture of this up on the screen somewhere because I'm not seeing it I'm not able to see it yeah it's there. Can you not see it at all manager, just not what okay now I've got? I had to swipe acrosss a few things to get to it. Okay, I can zoom in again for you just so you can take a look so again. This is a view from 75th street. Looking up, this is the existing wrought iron friends, that is on the adjacent property. Those are the three units back there, as you can tell it's limited visibility. What we're proposing to do is build a wall, a brick wall that matches the brick would match the same brick as on the facade. The coping here would match the same as the windowsill and the Wrought iron rail here and adjacent to it would match this. That's here in the foreground, so I'm just going to go back for a second just like I'll walk you through the rest just and these are the existing sections that are required. Let's just show what was the existing section was like so again. That's that large duck that used to come down. That's our share doc, there's some of the other equipment that was up here- and this is our now current condition, which is these are the mechanical units that have been installed. Obviously I mentioned before that drier exhaust has been removed, and this is our proposed screen, which you know aligned to the top of the unit. Hybrid. The site from 75th street will include the brick wall and part of the Wrought iron rail, correct. Well, the entire iron rail I'm having a hard time seeing this I stared at these plans for a while, before the meeting too I mean this, is you know my problem, but I can't you expect the residents of the building to come outside and go walk past these air conditioners. No, if you look at the plan, let's go back, I'm sorry! You have to do that for me again, it's okay, so here so this is the plan again proposed plan. As you can tell the door's in the same location, we did not change anything see. This is how you used to come out to the top. Yes, there's existing equipment here, okay, there's a lot of the majority of equipment existing was already on this path of the setback. Okay, so that's why they installed the proposed equipment on that same location again, still the only usable space for them is this small section here: okay and the you have to change the only outdoor space they have, and you do you have to change the railings of the fencing around this space for the residents? No okay! So that's! This is an adjacent building. I mean we're only touching okay. Now I see it. Okay! Thank you thanks everybody, I'm sorry, you had to be the one to say that the guys who installed the air conditioners are from long island and they did not know they needed to permit. I'm sorry, they put you in that position. I know it's not the best decision, but again I grew up on long island. So be careful me too. No, I'm not saying anything bad about it. You're beautiful! I love it. It's gorgeous beautiful. He was also the fact that he had a mechanical permit for the second floor. I guess also clearly confused him because he thought it was okay. Well maybe it's best that you do not say anything on his or their behalf right, I'm just telling you that yeah. So again, this is the existing duck. That was there, I'm just giving you all the different vantage points. This is the same elevation of what was there versus what's proposed so existing. We already have a laundry exhaust, that's that LPC already approved, so that's already that actually did get approved and was installed correctly. This is okay, a little lightweight, but this is the forefoot high brick wall and this is the Rot I was speaking about that you saw in the section previously, okay Jay, you wanted to say something. I'm sorry Mark. I was just asking. I heard the word screen before and what I'm seeing right now is a brick wall of the railing on top is the railing on the screen, or is there a screen in addition to the railing? No, this is it so we understand. So we met with landmarks. When this first happened. We went and talked to them about the situation and they said to they. We had actually talked about putting in a green screen. It does not have foliage because it is a terrorist, but they said they would prefer something that blends it in with the context of what was already there. So that's why we looked at the foreground and there was already iron prints in place and because the rest of the facade in this location, when you look up is brick, that's why you basically combine the two elements together because they wanted something that they said that did not draw too much attention so and blended it with the rest of us aside. Okay, so we've been, we've been treating the word railing and screen as synonyms for this purpose. I was, I had the same little bit of confusion, so it's a brick wall and a brick wall yeah, it's only four feet high because we can't actually technically build higher than that by DOB. So that's why the remainder of it is the wrought iron. Okay, a four foot high brick wall built of the same material. That's on the facade of the building correct the intent is the math fabric. All right, I think we understand and there's just a detail section through it. This obviously existing section, that's the parapet as it is now which is just breaking the stone coping. And then this is our new brick wall and that's existing brick on the facade. Oh, is the coping for that just scoping and then the wrought iron and go on to the top of the unit right so Michelle and Kay. If I may, generally speaking, our task with respect to legalizations is, would we have approved it if this were presented as if before neither penalizing them for having not done the correct procedure nor giving them a pass because it already exists right? So that's my understanding of how this is supposed to work. Yes, I would have said the same thing yet that's I would you know we could put in parentheses. That we still do not like illegal mark is correct, so I think we could vote yeah. So, given the situation, it's a good solution, yeah. I agree right. So any other questions or thoughts. The only other question I had was lots of times. We see with the Spectrum Mechanical equipment, especially in a little canyon like this is in, is whether neighbors want it enclosed further for sound baffling purposes. So I guess I do not know. If there's anybody on the call who wants to speak to that. But why do not you stop sharing screen, so we can see who's on the call now and I'll see. So I do not think no, those two people, the people who are attendees are people who are here to present other things. So there's nobody else from the public here. Okay, so we resolved to approve the second part, the two parts to the second part of this application right. So it's going to be b one which are the air conditioners to legalize. That with- and I agree with you Jay, we should say we're not happy about them coming to us for legalization now, but yeah, but we would likely have approved this if they had come to us. Yes and two b2, we approve the installation of a four foot, brick wall with the railing on top yeah Michelle. I you can phrase it any way you want, but I think it's following up on what mark said about treating essentially we're treating it as a new application. I think we should put a sentence in that. At least I feel I would not have voted to approve it originally without the addition of this brick wall and railing. It's all right. I, the thing that makes it okay is the addition of the brick wall right, the Wrought iron right. So we should say that. Okay, I think you got that done because you're pretty good at picking up on that. Okay, all right! Okay, all right so I'll make a roll call of those in favor K. Yes, j, yes madge, just like we lost her for a little bit. Remember she had to get in the car and go somewhere. Oh yeah, dog, Mcgowan, yes, and myself is yes, so that's one, two three four for now we'll see what her vote is zero for now and those non- committee board members here: Mr Diller, yes and Doug, climbing, yes, thank you, so that's two zero did match stations going to. Oh, this is Madge. What's your vote on the second two parts of this application and are you with us? Let's leave the record open, so we can fill in your vote. If we get it okay, can you want to take the next one? Yes who's here at 55, west 86? Okay, great, so that's Thomas, right, hi! All right! Take it away! This is a facade application. I do not think you can make it worse. Oh this is the bank right. Oh wait! Are you trying to share your screen, I'm trying to yeah all right. You should be able to now give it a try. Okay, my name is Thomas from Opera Studio architecture. This is a facade restoration for a building at 55, West 86Th street, located in the block between Columbus Avenue and Central Park West in the upper West Side historic district. It located there's a block plan for reference, so this is a really interesting building the first time I after my client, purchased it or was about in the process of purchasing it and we walked through it. I could not really understand exactly what I was looking at and then the research that followed sort of opened up a lot of interesting history for this building. So this was an 1889 townhouse Queen Anne style, one of one of many on the on 86th street, typical four- story, plus a basement level basement level partially below grade with a parlor level and a stoop accessing the parlor level in the 1920s. This building was modified, so the facade was set back several feet from the property line from the front property line. You know as typical townhouses do to allow for the stoop and the a and the entry and the front the front garden area. At some point, the adjacent building to the left, which was two separate buildings, became combined into one and became a converted. Building a converted dwelling the building to the right is obviously much larger in scale. This is r10 zoning, so there's a lot of floor area on the slot. So basically, this is a converted dwelling where it was. It was a one or two family townhouse that was converted in the 20s into a multiple dwelling and in the process of doing that they took the ground floor or what is the parlor level floor and raised it up to create a taller, and they also raised the basement floor level to street level to create a taller ground floor, commercial storefront with the second floor above which would was used for offices. So this is an elevation from the 1920s 1928 for the conversion. So, basically you have a storefront with a metal and glass very thin profile, metal and glass. The glass transom marble bulkhead at the base, brick facade kind of a deco styling, which does not read as much in this elevation as it does in the actual. The actual views with divided light, casement windows at the second floor for the office spaces that were created the upper three floors, so we've one two. So three, four and five were converted into two apartments per floor at that time. So converted dwelling, this is a plan of the 1920s storefront, with its deep recess, display windows and then separate residential entry to the right for the for the apartments. So in the in the 80s they did a conversion and the ground floor use was changed basically to a dental office and the second floor office use remained except they took the back, half and converted it into an apartment and when they did that they created these four individual arched openings at the ground floor, one going down to the cellar one connecting to a separate stair, going to the second floor, one going into the ground floor offices and finally, the fourth one going into the residential apartment stair. So they basically took away the openness of the storefront. It's used as a very like open, glassy, porous storefront and, at the same time, I think mimicked tried to mimic what was going on in the original Queen Anne style upper floor with another archway, but in a sort of paired down, 1980s post, modern reified approach, not very appealing large glass plate with a polished granite with some other detailing on it. This construction photo is really interesting because it shows how the masonry was re- constructed at the time to allow for that to happen, and this this affects a lot of what we're doing, because in our project you know we. Ideally we would go back to this fenestration pattern with the restored storefront, but the viability of that is not really there because of all the structural work that would be required to remove all this block and refrain this entire facade to do it. So, in our proposal we want to do two things: one we want to restore the storefront. The new use of the ground floor in the cellar will be a combined retail and or restaurant space is basically commercial space that depends on the future tenant. So the new storefront would be steel and glas steel, mullions, tube, framing glass, transom, very open to the street, a recessed entry which you can see more detail in a further slide and then the residential entry to the right being reconstructed as well. The sign band, which was part of the original storefront or the 1920s storefront. And of course I do not know if I mentioned that the whole the whole storefront was extended forward to the property line when they did the 1920s renovation. So it aligns with the adjacent buildings, but the original queen and townhouse kind of tucked back there. So then, we would like to give a better treatment to the existing facade on the second floor without having to reconstruct the whole thing, and the idea here is that we would use a limestone panel treatment with a deeper return at the arched window and then bring back some of the steel casement windows that were part of the original or not original. But the 1920s version with divided lights together get more depth and texture into the second floor, and part of the intention here is that the limestone cladding will draw from the limestone trim and columns which has been painted over, but we will expose it as well as the adjacent building to the left. So here's the facade. This is the existing condition with the four individual entries we'll open it up. We'll keep the limestone cladding, we'll restore, replace the cladding around the perimeter with a flush limestone arch and then narrow sight line windows with casements at the middle for the second floor office space. It's a pier, recessed entry door from the street, not as deep as the original but similar in its configuration and then the residential entry detailed view. So again, the storefront would be reconstructed and built up out of steel plate and tube elements. The residential entry door of a similar character, the second floor office window. The large archway, will have the limestone panels, return into an opening with steel, we're proposing a dynamic illumar window which is basically very similar to their steel generally broken windows. But the sight line is Al is: has the same width as the steel versions. The depth is a little bit bigger, but significantly more economical, due to the just the difference in material to create the two casements in the middle and then the fixed windows at either side. It's really much deeper opening up there, that's the profile of the window, we're proposing in the limestone panels and that's the presentation all right. Thank you questions from the committee. Okay, just a comment, I find it very attractive and I was just curious. I assume that labeling, you know showing the signage as book. Culture is just for the purpose of illustrating, what's going to go there and not does not reflect a tenant coming in. Ultimately, the tenant would do a signage application which would have to be approved by landmarks separately. This is illustrative in its nature. We intend to have signage at this location, not a not a great time to be constructing new retail space. I assume. Well, I think we can be pretty sure it won't be book culture. Hopefully, by the time it's done, the things will be different. Maybe our ideal tenants is a restaurant, but that's really wishful thinking. Yeah. We missed that diner from the corner. Everything is wishful thinking these days. Yeah. Can I ask what the materials for the for the sign band are? Is that also limestone or what is that? I think that what we're going to build will be limestone and the Steinbann will be a separate item and that can either be pin mounted letters on the on the limestone or a similar or full sign band to be considered separately. So the answer is it's limestone? Yes, could you explain to me the where the deeper you said something about a deeper return sure so we'll look at? What's there? Oh yeah, basically, you've got the granite arch and then emollient right flush with it uh- huh very flat. So in our proposal we're going to take the limestone as a panel and return a panel and curve it you see about one foot to get depth and shadow. I see so you're going to recess the window back. That's correct an indentation really other questions. Yeah are the are the casement windows that you're showing on the second floor. Are they true divided light, or is that a panel inside a inside of a double pan? These would be the full glass unit will be this tall and we'll do a spacer, a spacer in the in the air space, with a mountain at front and back typical of modern divided lights. I guess what I'm asking is: will the muntins be on the exterior of the glass or are they going to be in the inside? Absolutely I would never just put a muntin in the airspace. Thank you. Okay, that's an easy, suburban move! Glad thank you, Marilyn's, taking it on the chin tonight, yeah for long island. It deserves it. Okay! Well, the other thing I was, I probably misunderstood, one of your drawings, but it looked like there was a recess at the ground floor for the new entranceways yeah. So basically, what we have here is due to the existing condition. Let me go back to that slide. That shows this yeah, the more you show us the original, the existing condition, the more we're going to vote for anything else. Yes, I remember when that alteration was done, and I just was flabbergasted in 1988. It was like why I like to I like to know where he got that shirt even for 88. That's pretty bad! You know when he got it, though. So sorry, you were saying Mr Barry, so we'll keep this pier, but because it's a good, it's a good separation between the two parts of the building and clad it in a steel channel to match the rest of the storefront and then the residential entry will be set back with a little recess and rain shadow in there, and then the commercial also has a little recess. It looks like right, so the door can swing out because it looks flat on the other. The other illustrations, I'm okay with it. I just wanted to understand it yeah, but that's. The idea is that it will have this kind of typical recess, much more appropriate to the neighborhood, and I should mention that as part of this project we're doing a substantial rehabilitation of the building and the sorry. I think I have a full view here, we'll be repointing and replacing all the windows with new wood windows for the whole facade, wow, wood windows, yes, good, bhcr program for substantial rehabilitation, it's not in bad shape, someone painted over the limestone which we're going to strip and re- point the brick and replace the windows so that color on the top is going to match. Yes, okay, are we ready to vote or we have more questions? Are we okay? Yes, ready to vote? Okay, let's see if we can do this as presented right. The Res resolution is the application to approve the application as presented Michelle. You want to poll everybody sure whatever you say, I vote yes Jay. I vote yes, but I want to observe Michelle that J comes before k. Yes was that true in men in black chairs today, right, yes, okay, Doug, Mcgowan, yes, and I'd like to note that Doug D comes before j, okay, no argument and I'm a yes also. So that's one two three four five committee members, oh Madge, did we get your vote on the Senate? Okay, I'm sorry! I was totally disconnected from the internet at that point. Okay, so that's fine! I did I did not. I did not record it. Is it a yes for yes, okay for the second vote for this one as well. The second part is yes, the last one I I'm not voting on. Okay, so abstain for the second part. Yes, that's the second part of the first vote right edge. Are you not voting because you did not hear the whole presentation? I did not hear the pres right exactly do not record the do not abstain. Just do not record a vote because she was not present. That's right because an epstein is a no it's a softball, but it's a no. So for this application, the 55:86. We have five zero by committee members and Mr Diller. How would you like to vote? I vote yes, and I note that there was a mention in the chat from someone named alice. I think her name is who is a community member and says that she supports this, so I thank alice for for weighing in and- and I am encouraged by that, but I would vote yes as well. Thank you and the other Doug is he still here I am and your vote Mr Kleinman is a is an I affirmative, all right so for non- committee board members, the voters two zero. Thank you very much. When are you calendared at LPC? We're not, but we will probably after this right, okay and whenever you start your construction, when do we start the construction yeah after approval? I have a DOB plan examiner who is six weeks between meetings so 2022., that's optimistic, Paul! I can't see you because we're on share screen mode. So I'm sorry, I did not see you, but he says he votes yes, so that makes it three zero for non- committee. Thank you perfect. Thank you. Thank you. Thank you. So much all right before you go make sure you agree: okay, great excellent. Okay, now we have a 320 Riverside drive. Are they here who's here from 320 Riverside? That's 104.! Yes, we are here, I'm Michelle, Moody and Steven spandel is here as well. I think, or he was oh yeah, you see him yep great. I do not know if you can hear me or not sure. Yes, okay, perfect, do you want to share your screen, or should I put up your panels happy to do it either way, whatever's easy? Why do not you put up yours and we'll go from there perfect, because then you can move through the slides, as you will. That sounds great okay, see if I can drag this out of the way. Okay, so 320 Riverside drive we're looking at penthouse a on this building. The building is at the corner of 104Th and Riverside drive. What one in this view, moving on just a few more details of where it's located penthouse a is in the corner of the building. There are three penthouses, a b and c so we're at the corner of 104Th and Riverside. Here we have our 1940s tax photo. You can not see the penthouse at all in the tax photos in view two three and four you can see the penthouses at the upper portion of the building just peeking over the cornice, so this is penthouse a where I'm circling in this view, it's here and then view four. It is here. Oh there are only the two houses in the building. There are three: there are three tenth houses in the building two facing west and one facing south okay. So these are a few views of the existing conditions from the terrace. You can see it's a it's actually a stucco product, currently not true, stucco and and some metal, clad, double hung, windows and very poor condition. Were these penthouses built when the building was built? No, yes, they were but apparently had almost no detailing, or I think it's safe to say no detailing to them, which is surprising, considering how beautiful the building is below yeah wow. Were they staff quarters exactly? It almost makes. You think that this we've already received approval from the LPC to cut new openings into the penthouse and reconfigure the fenestration we're looking at installing hope's steel window units, I'm painted a dark brown color to match the LPC approved color for the building windows, the taped off areas, the Orange tape signifies the new openings that have all been approved, correct, they've all been approved already. So the only thing we're looking at right now is adding a small bay window onto the terrace, which is indicated by this netting. Here, we've ghosted in with orange outline where the new windows will be on this elevation as well, and apologies for all of the other clutter on the terrace they're doing facade maintenance right now. So it's a little bit confusing, and why did not? They approve the Bay window they are in. They are supportive of the Bay Window but said that it was something that needed to go before the community board, so they suggested that the LPC actually suggested. We go ahead and approve the windows, the overall fenestration package at the staff level, and then we go back again just for the Bay Window itself, but they're, actually rather supportive of this. They do not feel that it's the detriment to the building, but I'm not going to continue speaking for them. Moving on these are some views of the building the view at 100 feet. We've come back in with some bright orange here to show how much of the new windows will be visible from 100 feet as you get further into Riverside park, you of course, can see more at 250 feet. You would see roughly what's shown here and orange where's the Bay window, because the Bay window is actually here on the south side. So this little sliver here is the Bay Window, okay, one it's this area is the Bay window with all these windows being visible. I just I do not understand why they did not just approve the Bay Window. Also well, I agreed, but this process is fine too okay. Here we have the view at 500 feet. We've kind of marked in orange the trees pretty much obscure this view completely, so we've shown in orange. Yet again the Bay window is where the cursor is this tiny spot over to the far right, and then we added in view number two, which is from 250 feet away that the looking from the east- and this is one of the other penthouses, so you can not see penthouse a at all from this view is the window glass on all sides? Yes, and there are some details showing what that looks like as we get further along. So this is the floor plan the existing floor plan, as approved by the LPC. We are looking at this opening off of the master bedroom and the proposed plan is to just bump that out onto the terrace two foot two inches does the bump out obstruct drainage? No, not at all. So it's just a linear, like half Rectangle window, correct curious to put the Bay window in a bedroom, but maybe sounds good like to wake up with some light. That's right! That's right! So the elevation at the top number one is the approved elevation. So we're essentially taking this door unit, that's already approved. We are sliding it forward, two foot two inches and we're adding side lights, to return, that back to the wall of the building and putting a very shallow pitch freedom gray, which is essentially the color of lead, coated, copper, roof on it existing and proposed it's just going back added in some images showing what is there currently penthouse a and here and then what we are doing that's already approved. Moving on this is the view from the west. So here you see the approved West Facade, and here you see the proposed Bay Window, the side view of it. So it's just one light deep, it looks like the gate is also the railing is also being increased in size is that the railing was also approved by the LPC, and that is changing for code reasons. Basically, the current railing as it exists. It functions as a ladder and the client has small children. So we opted for something a bit safer, but that was already approved by the LPC as well. Okay, a mystery yeah, there's no egress from the Bay window. It's a window, it's not like something is, there is a. There is a door unit, I'm going to slide back up to the elevations of that. So essentially, this is the bedroom door unit, as already approved, so there's a french door in the center and that exists in the Bay window as well. So it's a it's. Maybe it makes a difference because there's an egress j. Well, are you saying that the Bay Window is an egress point? It is not an egress point. It is not necessary to have from there yeah that's other than so. You have the you. Have the french doors facing West and the New Bay window to face south, correct yeah and it's a window. Okay, are we ready to vote yep, I'm ready, I'm ready to start with Doug. What do you think Michelle yeah, I'm I'm okay with this as presented yeah I'll? Second it. If that's a proposed resolution. Yes, is there any community comment before we vote? Can you unshare your screen now? Please sure thanks no problem! Thank you want me to take the vote. Okay, Jay there. You go! Yes, okay, sure, yes M! I mean mad: yes, Doug M, yes, and I'm a yes, so that's one, two three four: five: zero and M Diller, I'm a yes with a request that they put the same windows on the adjoining. I just think I should do the same thing to the other penthouse that this is much more handsome. I see beautiful right. The neighbors the neighbors should did update beautiful you're right, Doug, Clyman, yes and Paul Fisher. I think he's writing us. Let's see, maybe in the chat, Paul and Alice G said she's in favor and we do not know about Paulie, but he's not he's not muted. No, but he often has trouble all right. We'll leave that open. So the resolution indicator passes. Thank you are you? Are you scheduled at LPC? Yet? Are you calendared Michelle? Are we scheduled at this point? Yes, we are September in September. I think it's the 11th September 11th, okay, michelle. If you do not have any further business, I have to go yeah. I yeah. I just wanted to say two things about. Oh no. We have somebody else here, but you can go. I have two items of new business, I'll, just really quickly say them if I may, because they were not for discussion they're for like getting putting a b in your bonnet one is that maybe we could talk about at some point taking on the department of buildings and the scaffolding permits. Maybe the community board can be have some give some feedback when a building wants to put up scaffolding, that's a little be in your bonnet and then maybe Kay, and I will work on the district needs statement which I sent to you all on the fourth of August. I just wanted to add something about future issues on maybe Covid-19 redesign, how that's going to impact things and ADA accessibility, because we see more of those kind of permits, so maybe K, and I will work on that little paragraph. But that's all I wanted unless anybody else has a quick, really quick new business. Doug did not you have something that you wanted to bring in. Well, yes, and I think the well they're not only an applicant right now, it's really more for discussion, you'll see on the screen, Anastasio Janopolis- and I think many of you will be very pleasantly surprised. This is a complete coincidence, although someone, you know sometimes universe, they say there's no such thing as coincidences, but this is actually the neighboring building to the 55 West 86th street. When I think Kay said, I missed that diner. Well, guess what you have the diners owner and here is Anastasio promoted to panelists. Yes, he is okay. I just want. Excuse me, I'm sorry Doug, but madge. If you have to leave, you can but we're going to talk to we're going to talk to Mr Anastasio yeah there'll be no vote on this right. We're just hearing this right, yeah, I'm just going to say full disclosure. I represent this property and I'm very proud and very happy that Anastasio, who I affectionately referred to as Tommy is here. This is they've. This is a legacy. Ownership they've owned the building for many years they're without getting into too much dirty laundry. There was an estate issue they're getting ready to make this building beautiful and leasable, and I think to everybody's, I believe, aesthetically it'll be very pleasing and it'll be good for everyone again. I will not be voting on this because I would be ineligible, but this is we're not going to vote on anything today anyway and in the future. I would not die there. Okay, no problem, so I put up this. I've received two screens at like 615 from Mr from Tom. If you will so that's what I've put up here and I'm putting up the one that appears to have the elevation as opposed to the floor plan, because I'm not sure we can help a lot with a floor plan, but does somebody want to tell us what we're looking at and why we're looking at it? And here I'll try to zoom in a little bit so we're essentially previewing something that we will see at a later date? Well, it's entirely possible that this could be Jay. You remember that there was that Storefront Warfront yeah could be staff level could be staff level, but so Mr Gianopoulos. Why do not you? Is there a question you want to pose to our committee? We do not generally give advisory opinions, but we want to be as helpful as we can to our small business owners. So why do not you ask a question or two and let's focus in on what it is that you want to ask for about this? Assuming that you can hear me- and I can hear you where am I oh, you appear to be unmuted so Doug. Can you help us out here yeah, I'm? Actually let me just see here. I am texting with him. He's been standing by here. I'm messaging him now to see. If there's any issue I mean just from my perspective. It looks like this is the kind of storefront infield that the rules might allow for with a staff level approval. Oh, but it's nice that we see that then it depends go ahead, saying that he is speaking, but nothing and we're not hearing him. So he's not muted Nope Tommy. Can you unmute yourself or I do not your microphone active or can you write something in the chat so that everyone can see? What's going on and Doug, we have Paul Fisher's, yes, fyi for 350 Riverside drive yeah the last application. Lonnie is calling me right now, each one three two Riverside three, two, oh yeah, okay, Michelle and Kay. I just I have to call somebody at eight o'clock. Okay, anyone tell you what Doug, rather than take the whole committee's time with this I'll, hang on this for a few minutes with you and anybody else who wants to of course is welcome to. But I do not presume your time and let's see if we can, you know, answer a question or two. So why do not you see if you can, if he just called me, he said, he's signing off and signing back on he's. Normally he does present on zooms. This is some anomaly he's going to sign off and sign right back on, hopefully that'll clear, the problem yeah, but yeah. If you have to go, I do not yeah, I got ta go, but certainly as being generally supportive of these kinds of efforts. I'm sure we all are, or certainly what's the address of this stay. Well, everybody I've, 41., 541, Columbus avenue. Thank you less than a month. Okay he's back right. He has to be unmuted, I'm trying to unmute him, but I think he has to unmute himself. Okay, ah hello, are you with us? Go ahead, not hearing him, maybe try for month. Well, can he hear us? Yes, okay, so I'm going to offer a couple of things just in case it's useful one is that there are regulations on the Landmarks, Preservation Commission and your architect should know about them that allow for staff level approvals without a public hearing. For I'm going to interrupt you, Mr Gianopoulos is an architect. He is the landlord he was a former owner of the diner, so he's very familiar with the with the process. He is an architect okay. So then, you know, if there's a question you can put in chat that you want our thoughts on then, since we can't seem to hear you by video audio. Maybe that's a way or I do not know call Doug and he can relay the question. The only other thought I have bummer yeah. Can he bring back the same weight staff? Then some good people there yeah family, so Tommy is calling you right now. Let me see what he's saying she so he's still having problems with his microphone he's. It's he's not sure he's he'll try again next month, and you know he appreciates the opportunity. We appreciate that he came to us. Also, yes, you'll be very welcome. Yeah. We're really happy about that. Thank you, yeah all right and anything else, you guys or should we call it today? I think we're done time for Margaritas or whatever. Yes, thank you very much. Everybody see you in less than a month, thanks for all your good and hard work.",
            "summary": "I, do not know you're right there by the Lucerne ride by at 9:30 at night, tonight: 55, West, 86Th, street?\nLet me just take a moment to unmute the 201,826 number, and can you tell us who you are and what application you're here for I'm going to be presenting for 305 West end Avenue!\nThank you very much for taking minutes and the first application, I believe, is 305 West end Avenue.\nIt has been approved for the fabric running portion of this existing, underneath just to give you a little understanding of it, there used to be a two by two hideous drop ceiling down here, with some fluorescent light.\nThis is where that rendering came from just to give an idea of what it would look like underneath because from the street space coming from the facade, you would not necessarily notice this change, but obviously underneath we're trying to bring attention to the architectural detail that is present and then re, cladding and cleaning up the fascia that exists.\nIt appears to me to be a creature of its time, which is of the 1970s and 80s when I believe it dates back to, and I'm wondering why you know, even if you were to have a marquee like structure as opposed to a more traditional canopy.\nBut we've seen other things in this kind of a context that I that As far as marquee versus canopy on west end, just as a point of reference, two doors south of my building, the building has a marquee and it once was the hotel, mayflower and then a nursing, home.\nThe resolution is to approve, as is as presented second as presented all right, also, all those in favor or maybe I'll make a roll call.\nI, think that's right, so that vote is one zero one, zero Obviously the second floor, we're talking about limited visibility from 75th street.\nLet's see context again so on 75th street, I'm, just going to zoom in here for a second to get an idea.\nI think this is on 75th street between west End and Riverside.\nThey were concerned about the safety of the residents, so they got it in they also at the time, had a permit for the second floor, mechanical and the contractor at the time, and his understanding thought he had a permit to install these units at the time.\nHe thought he was approved to install these units and he gives his concern for the safety of the residents because they are older and they have certain health conditions in the building.\nIt is for the units, yes, and then with that because of OSHA there's the second portion of it, which is why we're talking about the screen Is because of OSHA, because this parapet is too low in this existing location.\nThe street here, there's actually three So, as you can tell here, there is an existing water iron front here that at 75th street, all of these locations- If you want that, are installed back, there, e3, let's see and the fence is staying as is right.\nI'm just going to go back for a second just like I'll walk you through the rest, Just, there's some of the other equipment that was up here- This is our now current condition, which is these are the mechanical units that have been installed.\nWe approve the installation of a four foot, brick wall with the railing on top We're, treating it as a new application.\n, we'll see what her vote is zero for now and those non- committee board members here: What's your vote on the second two parts of this application and are you with us?\nThis is a facade restoration for a building at 55, West, 86Th street, located in the block between Columbus Avenue and Central Park West in the upper West Side historic district.\nIt's used as a very like open, glassy, porous storefront and, at the same time, I think mimicked tried to mimic what was going on in the original Queen Anne style upper floor with another archway, but in a sort of paired, down, 1980s, post, modern, reified approach, not very appealing large glass plate with a polished granite with some other detailing on it.\nWe would like to give a better treatment to the existing facade on the second floor without having to reconstruct the whole thing, and the idea here is that we would use a limestone panel treatment with a deeper return at the arched window and then bring back some of the steel casement windows that were part of the original or not original.\nThe residential entry door of a similar character, the second floor office, window.\n, the more you show us, the original, the existing condition, the more we're going to vote for anything else.\nYes was that true in men in black chairs, today, right, yes, okay, So, that's one two, three four five committee members,, Oh Madge, did we get your vote on the Senate?\nThink that this we've already received approval from the LPC to cut new openings into the penthouse and reconfigure the fenestration we're looking at installing hope's steel window, units, I'm painted a dark brown color to match the LPC approved color for the building windows, the taped off areas.\nHave, the french doors facing West and the New Bay window to face south, correct Are we ready to vote yep That's a proposed resolution.\nThis is a complete coincidence, although someone, you know sometimes universe, they say, there's no such thing as coincidences, but this is actually the neighboring building to the 55 West 86th street."
        }
    }
}