{
    "YoutubeMetadata": {
        "author": "MCB12",
        "channelId": "https://www.youtube.com/channel/UCquvBKUh8s9lhWOlsS0jx5A",
        "title": "Aging Committee Meeting",
        "publishDate": "2020-09-03",
        "shortDescription": ""
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB12",
        "normalizedName": "Manhattan Community Board 12",
        "twitterName": "Manhattan CB12",
        "youtubeChannelName": "CB12M NYC",
        "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
        "twitterHandle": "@MANCB12",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "You know getting all that organized. You know stuff, okay, he promised he'd take the minutes today. So yeah I still haven't finished the july minutes because for a couple of reasons, but first of all, because I was incapacitated for a few weeks, I had the shoulder replacement. You know. So how are you doing I'm doing? Okay, I'm in therapy- and you know it's coming along. Okay, so got a call. I got a call from the 33 prison. There was a shooting last night before midnight, 26 years old man I got killed. It says that since they have problems, one came on a bicycle or something like that and it was standing on the corner by the funeral home. I don't know it's like by the ribeira. Riviera must be uh-huh and they shot him dead. It happened this summer three times in the same area 174. Seventy some nicolas one in northern avenue- and this one is some nicolas again. No one is an amsterdam avenue plus and one another one. I don't know I don't know. No because last night there was a big issue about the police, no responding, but I'm telling you people are shooting you know this is like they were. All western movies shoot em ups, the agenda for today- and I saw it before and I'm looking for the thing. Okay, no, I'm looking for the agenda for today. I you know, I don't know what I did with that. I know I have it someplace yeah. I know I sent it out, yeah, nothing too complicated. No, I just got it just good and you got the you got the nucleus right. Well, they left me. They left me out of the youth services committee. So that's maybe yeah did they put you on a different one? Listen you know. After 35 years on the board, I go whatever I feel like going. You know. No one can see me. Someone is going to tell me the only the only thing about these zoom things. Ebenezer is when we have regular meetings. I mean personal meetings we signing. If we go to a committee that we don't belong to like last night, I signed in on boss committee but anyway, so that doesn't give me credit on my attendance for all the committees right, because I heard wayne benjamin saying to you give me: let me who's going to give you the name of the people who attended the meeting. Yes, your name is going to be there and they are the attendees for that committee. For that meeting. Yes, you remember, you know the designing sheet that we have that have committee members and then on the site has or board members that attend that committee. So we're going to do the same thing, I'm going to call gloria because I don't see her and she called this morning. I gave her the link and she said she got it. So I calling her to find out. She was able to log in or she have any trouble. Okay. How about you here? Link no, nor my birthday is saturday december 5th right, I'm going over there tomorrow. They don't let anybody in right. Yet no I'm going over to bring her mail tomorrow. No last year we brought in a little present, but I mean right: we can sing happy birthday over the phone at least yeah. I call her from time to time. I just don't know why she doesn't call you. I know she doesn't call me either. Sir hi, sir. I hear you hear me wait now you hear me now. I hear you now: okay, good, okay, hey friend, this is this is of the committee. Does anyone call anna casana? Yes, okay? We already spoke to her, but she doesn't want to spend all of her money to get nothing happening when they left. Apparently she does so. She had already refused medicaid with the nork yeah, but I mean, and so dory spoke to her and her daughter and explained what she needed to do and told her to get back to us if she wants to move forward. Oh okay, so I had her speak directly to dory. I didn't send her to any of the case workers. No, it's all right all right! So then, because I think I mean the money, the issue with the money- and you know she's almost blind, so she needs someone there all the time but right, I know that's what I told dory and I told her how to go about it and dory spoke with her, but she told dory, no, that she'll could think about it. Oh all right we can only. We can only tell people what we know maria. We can do what we think is best yeah, but about the economic issue. She has a problem. She has a problem, she weighs she wasted. A lot of you know opportunity. No, the amount, the money that she had. You know well anyway. Okay, thank you there! Okay, no problem! Oh rabbi is here. I think that we should get started hello, mary fern, hi marcy. Yes, we hear you, we just don't see you, oh all, right! No, because I was having trouble I got on and I could see everybody and I couldn't hear and I'm not getting the thing that lets me put the video on because she's an attendee his emily. Yes also, I see that glennis is on the attendee side, not the panelist side. How do I the little icons for the video and nothing's coming up at the bottom of my screen? You need to play a little bit with the mouse until the thing appears there. You're gonna appear in gray, yeah hi, everyone yeah, I it's it's marcy, I'm not on the phone, I'm on the computer. I can see everybody and I can't find anything it's coming up as a webinar and that's why and I'm not seeing anything that lets me put my picture up there. It could be how the zoom was set up, that only the panelists can show their face. Got it okay, but glennis should be a panelist okay, you're ready to go, I'm going to start recording, yes, okay, we're recording now, okay, so we are on beginning this meeting of the committee for concerns of the aging on thursday september 3rd, starting this meeting at 10. Calling the meeting to order at 10 45 a.m. Welcome everybody! I know people are having some trouble. There's richard allman hi richard he's on mute. He nadia I'm here hi. I've been here for about five minutes same problem. Other people were having okay yeah. I understand trust me. I do okay, so welcome everybody. We've been actually chatting a little bit. Oh, I see you were under a yahoo. No now he's a panelist yeah glennis you're a panelist. Now too, if you'd like to show your face, you can hi everyone, I'm actually at work. So I think it'd be okay for me to stay this way. Okay and who is NYC nadia, I don't know ebenezer. Do you know? I don't know? Yes, can you guys hear me this yeah hello? I can hear you. Yes, oh you can hear me. Okay, my name is nadia. I was I got the invite and I am joining. I just wanted to see how you know how this group works, and hopefully I can learn something and if I can, I could co-operate as well. I'm not sure how to get the picture on, but hopefully next time I'll be able to join properly. Are you a board member, or are you an I'm, not a board member, I'm just a resident of the community. I live in washington heights. I live 166 on the 66th street area, I met ebenezer, maybe he'll. Remember he brought me over some bags that I was supposed to on behalf of from frankfurtmon, and this is how I'm getting you know this. I'm learning about all these community groups that are here I'm born and raised in washington heights, and I am proud to be here perfect great happy to have you, okay. Thank you. My mom is also joining but she's joining via youtube. So you know she's gonna. She she's gonna, learn she's she's more fluent in spanish, so I'm here on the other side trying to translate for her. So hopefully more people will join as well. Okay, thank you. Thank you all right, so everybody's been welcomed in and we know who everybody is. The new committee lists have gone out to everybody. I I'm assuming that everybody has checked it and know what committees you're on what committees you're not on there weren't changes. They were changes made. Yes fern am I still a public member? Okay, perfect. We still have the three public members: okay, it's myself! The rabbi yosef richard allman glennis, marie luna and the three public members. Okay, thank you. That's the entire committee at this point. Okay right, she just wrote in on the q a that she's on board as well: okay, yep, okay, just getting used to trying to do all these things. I have not if you've been looking for minutes from the july meeting, I have not finished them yet for a variety of reasons. One is because I've been physically impaired and not able to use two hands to type, because I had total shoulder replacement in my left, shoulder at the end of july, I'm in recovery. Now the wound is healing well and I'm in therapy. So eventually you will see those minutes. So as far as the agenda goes today, it's some repetitive stuff, but I've look looked into the question about the long lines: businesses, banks, post offices, etc and, as discussed in our other meetings, I spoke to domingo estebas, who felt that it was important for the seniors to have priority in those lines seniors and disabled. I further spoke to isidro medina and he felt the same way, but he also felt that if we had a resolution, if we came up with a resolution regarding this, that would give him more clout to to be able to convince the businesses to do this. So I don't know perhaps some discussion about this. Do we want to do a resolution? Is there any more discussion? I know we've discussed it at length, maria who, if we do a resolution who do I we address that too number one businesses is a different. You know have to be on the probably economic development committee with ours and also the post office is for the bank of post office. It does have federer mandate. Who are we going to be addressing those resolutions too? Anybody have an answer for that. Well, I would think it would. It should be joint with economic development as a result, and I would think that you're addressing it at least to the bid and the chamber of commerce right to get the word out to the businesses that belong to those two entities right. I don't know beyond that. How you would reach out merchants associations? Do we have the organized opi? I know that we have. We have business groups and we have you know, chamber of commerce and since, like apple, how much cloud do they have in all the businesses and not just the business that they are members of well. I think I think it is a good question. They don't really have clout so to speak, but they have the ability to get the word out and make it an important ask. I think, and I'm pretty sure that isidro had mentioned, that there is an inwood merchants association, because I believe he was working with them on some of the bid projects. I see richard and maria you're, both nodding I'll speak for my nod. I nodded go ahead, maria! No. I know that there is a chamber of the washington heights. English chamber, of commerce that is headed by sandra harris. Is the president of the chair of the board she's also on the board of the chamber of commerce in harlem? I don't know who is on the one uptown. There is another one. There is a chamber of commerce that women's that's headed by kenny abreu. Maybe we can you know sound yeah, that's a good, that's a good thought uh-huh and there is another one up. Well, it's not a chamber, it's a business improvement. Maybe that would be a good thing to do the business improvement agency. That way, I think we have one, is headed by one standard cloth and the other one is up by 207th street or diamond. I don't know who is in you know. Who is the head of that one? I'm sure I'm sure would be very helpful and he said he would help us. You know if we wanted to do a reza, that he would even help write it. I kind of put a giraffe together. You know at least with some thoughts out of my head, but you know: isidro is involved with a lot of different business organizations in the community and I think- and he volunteered to you- know kind of be the spokesperson and get this you know get the word out that this is something that we really want to do. Yeah he felt the reza would be would give him more clout to be able to. You know, sell this. That's fine one! The one question about the re: it's a good idea to do it jointly with the business development committee, but they've already met this month, so it pushes this back. I want one month in the cycle all right, so we can do it. You know hours. So then I I'd be inclined to do a rezo here today. Move it and ask business development, then how they want to sign on to it. They may find some other procedures for signing on before the september general meeting- and you know, like I said domingo was, you know very much into it. Since a resolution had to be then presented to the executive and then from the city. They said the integrity goes to the general meeting. How about maybe a letter that we can expedite this thing and then he said his resolution is needed. Then we can do that later on, but I think that if we wait for the resolution, the end of the month is going to be like what september 20 something. So you know we're just wasting time right, so maybe a letter from isidro and you maybe and that can be forward to the to the business organization up here. That could give us a little time, maybe using that both ideas there pass the reso out of committee. Today it goes to the executive committee and if there they decide working together on a letter is a good first step will happen right away. I would draft both. My recommendation would be to draft the reso and draft a letter so that we're not waiting for somebody else to say what we want to say and then, if they want to tweak it, they can tweak it. But at least we've put our thoughts together as a consolidated group. Okay, might you be willing to draft the letter? If you send me your ideas, I will draft a letter and I'm gonna ask richard if he'd be willing to draft the resume all right. So we can. We come back sort of I sort of have a brazo draft written book here, but you know I was about to volunteer, but I think the appropriate volunteer is to help mary with the work that she's already done. Yeah. We all done that. Yes, absolutely! That would be my intention. Okay, all right, so I guess that we have to vote on that right and then we have to in support of that. You know the resolution, the letter, you know the concept and then we'll just let it go right. I think mary should read out what she's drafted so that we have some idea of what we're voting on okay. I can do that, so I started out with, whereas Covid-19 19 created a hardship for everyone causing businesses to close, whereas when businesses were allowed to reopen, restrictions were put in place for everyone's safety masks, social distancing, limited number of people inside etc, whereas these restrictions created unusually long lines of people waiting to enter grocery stores, pharmacies, banks, post offices, etc, whereas seniors and disabled are unable to wait or stand for an unusually long period of time in lines, creating a severe hardship on them being able to meet their needs, whereas priority for entry to these businesses need to be given to seniors and disabled. Therefore, cb12m resolves that seniors and disabled should be allowed to skip the long lines and enter the necessary businesses to be able to do banking, mailing and buy items necessary for survival, such as food medicines and other necessities. I was writing this in the park yesterday, when I was sitting in the park that was perfect, yeah, it's great yeah. The only thing I would think is perhaps instead of skip, you might say something like be prioritized to enter first or something yeah. It's marcy. Can I was just gonna, I was just gonna say that I think it sounds better to say that seniors and disabled people be given priority in the line. I think that sounds better. You beat me to the punch fern or in the line or in the queue yeah, but it's a great reso great job, mary. You don't need our help. I always need your help. I need at least your confirmation, but, like I said I had to be, I had to be ready to focus on this and I was sitting very relaxed in the park late yesterday afternoon and I brought my little book and my pen with me, and I said you know what let me sit here and play with this. So marielle keeps adding great suggestions, so I just wanted you to make sure that you had her list because it won't show up on the tape. So she said merchant associations, washington, heights and inward improvement, corp and cloth. Those were her three suggestions. Beyond what we had said. I love it. I make a motion that we vote on the rezo unless there are any other comments. Richard second, are you in a second great? Thank you joseph. Are you writing in these suggestions from marielle, or should I do it on my notes? Yeah? If you can see them and yeah, I guess yeah, okay yeah, it might be easier and then you'll get it all to me at once. I'm trying to also do two things at once, as you are too merchants yeah mario, these are great while you're doing that mary nadia. What is it? What is your last name for attendance purposes? Well, my lesson is r-a-m-I-r-e-z. Thank you very much. You're welcome, okay, so just to get straight myself. While I'm writing this up. So we're going to address this reso to all of these different associations, and so the rezzo is from the board. But what we're going to do, I think, is use the rezo to draft a letter, yeah, okay and the other way to do. That is to put an additional. Therefore, in the reso thing- and this should be communicated too therefore say it again, richard well, I didn't have. I don't have it exactly, but you can put a line in there. Therefore, this should be communicated to all business and merchant associations in washington heights and inwood business improvement, districts, elected officials- and I know I'm missing a few. I've got just the spirit of it. There development corporations merchants yeah. No, you said merchants. First, we have merchant associations, but merchants should probably be a separate okay bullet in there by the way. Yes, if much appreciation for the golden gate background background, it touches some very warm spots for me pretty easy to do on zoom, okay, so I will type this up and send it to you guys. You need us to vote. That's great. I moved the vote and richard ii. Okay, all in favor aye. We have glennis glanis linus. You need to unmute yourself, honey, okay could be she stepped away. Well, we'll have to get her afterwards, so otherwise it's one two three four five or five that are on the board: yeah. We are pending lennis and then we need to ask the people who are not on the board. Okay. So what did? What did the public have to say? Okay, marcy, that that's fine. I think it sounds great with the changes as noted. Okay and nadia. Are you interested in voting? Are you allowed to vote? Oh, I think so. Right he's not allowed to vote, so she, you would just have to say, not voting yeah. Why way, due to her position for the comptroller? Oh, I see because she's representing the elective, okay yeah, she said, put down abstain, yeah, okay! I is that what you're talking about? Yes, oh look at this on my screen. You guys gotta, laugh on my screen, joseph you're, on the left, with the golden gate going this way and ebenezer's on the right with the door going this way. Well, then, I have a question: what is the golden and richard doing there, what happens in Manhattan? Why can't you have the Manhattan bridge or the you know instead of the the golden bridge? Maybe you like the color, I like the color okay, so I keep throwing in this. You know future meetings and seniors in the community being unable to join meetings due to lack of equipment, technology skills, etc. Nadia, maybe you have some ideas since your mother, you said your mother was going to join in on yahoo or on youtube yeah. So I ideas I'm up here just to learn the process, but in regards to ideas, I do see that I do understand that it is difficult for people of the that are older to communicate via zoom and via whatever any other means other than the regular phone right now, I'm kind of blank on to in giving in a suggestion, but I'm here to listen to other people's suggestions. I'm sorry, but I'm not here, to give a I'm, not I'm not ready to give a suggestion. Yet, okay, so maybe can I maybe suggest nadia your mother. She she live around also in this community. Maybe she can join one of the senior centers and that you can get all the information about what we do here, but also all the activities within the centers. Maybe okay, are they bilingual and most you know everything that I think we do on the seniors. Centers are you know bilingual? We have you know latinos, jewish chinese. We have you know, all sort of you know, information to you know to the community. All right is there. Is there any okay, that's great in regards to the community center again, like I'm, just learning the like learning the different options and the different opportunities here that we have so that we could learn about the community when you mention about the centers. The first question, on my mind, is okay, which is the closest center that we have I've heard about this one, I think, is on port washington on 163rd, but I'm right, I'm not aware of all of them, and I think I could follow up with you, maybe if possible. Maybe if I could get a listing and maybe especially my building, I don't think that we're very familiar with that, and maybe I could put up a flyer and just letting people know no idea. There's there are a lot of. There are two senior center representatives here, fern and myself. Although fern is much more adept at all this, but you can get a list of senior centers from the new york city department for the aging. There are a lot of centers in washington heights in inwood, and I can certainly I'm happy to be in touch with you about our center. If you'd, like you know, I can send you my information, your it's NYC, nadia, yahoo, DOT com. Yes, all right, I'm gonna send you an email after this and you can. I can give you some information about our center yeah I'll. Do the same. I believe I may also have the list of all nine senior centers in washington, heights and inwood, and if I do, which I I'm sure I do, I will forward that to you as well that works and that works, and it's appreciated. I could also post it in the church too. That would be great, so you should just be aware that, right now, due to Covid-19 19, all of the senior centers are functioning. Virtually we're not allowed to have in-person meetings right now, but it's good to have the information and the background for when everything does completely reopen mary and that sort of speaks to what you when you said before about issues of seniors participating in this meeting. Coming to the aging committee, I mean, I think the issue of technology is just an across-the-board issue and even in terms of the senior centers and people being able to connect to virtual programs, you know one of one of our members mentioned a tablet to me and he asked me to check into it. It's called grandpad and it's designed, especially for seniors, so I went on their website. It looks like a really wonderful device with the hitch that nothing is free. So you can get this tablet, which does all these things and it's specifically designed for seniors. But depending upon the plan, you get you're going to end up having to spend 500 or 600 a year for the privilege. So you know it was a great it's a great thought, but I don't think he realized quite the implications of what it would be, but I think that's the biggest thing: how do we get? How can we get devices to seniors and how can we, you know, offer ways and help people learn how to use the devices, so I would say, there's a another approach, so I think that one is an important one that I am working on in several ways, but the other approach is making the phone more usable. So, for example, many of our seniors already use whatsapp for communicating with their loved ones over the sea where, over, wherever over the sea happens to be. I first found out about it because of friends in israel, but I found out that the seniors use it to call all over the world and it has a video feature and it enables people to connect and see each other through the phone without necessarily needing a device that they can't afford to maintain. So I'm trying to cut at this in several different ways to increase accessibility for seniors. I I've also reached out to the hospital about about devices, so we have a variety right, because we have some seniors who are on safe link, phones where their minutes are extremely limited and we have others who are paying for their phone and are not fully utilizing its capability. Your phone, that's a yeah! That's an idea because, what's up is what you're talking about the seniors are they have to pay for the minutes and sometimes they're not going to be using it to talk to all of us, as opposed to with their relatives. I propose at the last meeting of the white core that maybe they could work with the city of new york, since they are supplying computers and devices ipad to students. If they have a senior in their, you know their household, they should be able also to link to some of the. You know, agencies of the information while the children are not using the computer. Of course right. Excuse me. They look at me like I'm crazy, but I think that would be because a lot of our seniors live with families they live. They have, you know, live with their grandkids and things like that and some of them you know junior high school, so they they'd be able to you know to train them through the page. You know the steps of using that system. They, the commissioner told me lorraine, said well. Let me let's take a look at that, how we can get the city too, but of course she was concerned about that seriously. I'm going to pay, you know, there's an additional expense and things like that, but that's a that's a good idea about the wasso, because I know that mexico, the dominican republic, everybody's talking exactly south America to south and central America, okay. So we can have certainly continued discussion about this and you know fair and keep us updated on what you're finding out and what's hopefully, going to be successful mary in addition to the senior centers. Do you see ways that we could connect with seniors at the nursing homes in the neighborhood that there might be something within their organized activities too? Actually, their activities are organized only on the floors that they're on and often just individually, because again they're not allowed to go off the floors. Okay and many are confined to their rooms because of the Covid-19 I mean this is still you know my information from isabella. I don't know about fort tryon, but odds are pretty good. It's the same yeah they. I can tell you that isabella has been very appreciative of everyone who has brought magazines and books and whatnot to to their facility they're very happy with everything. So keep it up. You know if people have magazines or books to contribute or anything that you think that the seniors might use, or if anybody wants to make a contribution. I bought three word search books the other day that I'm going to bring up along with some magazines, because a lot of them like to do those. So you know I mean anything like that is very happily received maria. I have I'm concerned that, although this is not a part of the agenda, maybe in the new business are we into the new business now how to okay? How to research? I want to oh go ahead. Go ahead. We can just wait I'll wait until the new business yeah. Let's do that, let's just one more time review what I have down for c, which is reviewing the capital and expense budget listings that we the ratings, that we actually did back in June. I think it was. I just want to do one final check-in, because these they'll they're gonna ask us to submit these next month, so the capital budget items we decided to re-re-prioritize them number, one being a system-wide upgrade of various senior centers. That seems to make a lot of sense now to improve connectivity to wi-fi and telecommunications services right in light of code and everything else. That seems to be really critical in terms of connecting people with the outside world. Absolutely I agree. So we said that should be number one number two renovate existing or build replacement senior centers as necessary to comply with ada and difter regs fern is the expert on those yeah. We still have centers in our community that are not accessible right. Number three, I'm sorry and three to provide funding to construct, affordable, accessible housing for seniors, so everybody is good with those and once it's gone twice. Yes, any objections to any of that. Seeing none we'll move to expense budget under the expense budget. We decided to keep all of the existing items which I'll read off but to add as number one to expand mental health services for seniors number. Two increase: the expansion in the program expand home in-home services for elderly persons, funding number three increase funding to expand services at senior centers in cd12 to include hire additional social workers. Number four increase funding for transportation for seniors by restoring prior budget cuts to expand access and outreach number five increase access and outreach to healthy food programs for seniors with medical and health related needs number six increase funding for naturally occurring retirement communities or multi-family housing. It's been some rumors about the newark programs. I don't know you know how true it might be, but you know wondering if some of the newark programs might end up in jeopardy because of well, there were a decrease in available funding. I would say they're avoiding food, multiple factors, one is that seniors are moving out of the neighborhood, which the newark eligible eligibility actually relates to the percentage of seniors in a building or in an area. So, as the percentage of seniors proportionally goes down, that funding can be affected, not to mention state and city budget cuts, which are also huge, but I haven't heard anything specific about norks. No, I haven't either it's just. You know, kind of a thought. That's been in the back. You know in the back thoughts of a lot of people that are involved with the norks and then okay. How many sides do we have did the north, because I know that there is one everybody right: okay, 1719 and then hillside fairview. Now fairview avenue I mean ferry is sorry. Are they affirmed? Maybe for another? Are they thinking of combining that services with other services within the senior centers in our area? There's not really been talk about it. It's just something that people are wondering about who are involved. For instance, people involved with isabella they're wondering if, because you know no, because isabel is the one that's running those right- those yeah all three. You know yeah so point of information. That's what's going to happen. They are actually funded differently. The one at fort george hill is funded by the state and the one at river, terrace and 169th street are funded by the city, so it has to do also with what cuts might happen from whom and the resource center carol ben at the resource center or whoever is in georgia now is actually overseeing all three. But you have to remember that those funding mechanisms are not the same so how we release those on our the idea, the the budget, the expense budget, it's one of the state- and one is this- you know the city, so I believe our budget that we work from is recommendations to the city, correct mary. I believe so. Yes, so I don't believe that we make in this budget recommendation, set recommendations to the state. We could do that with a letter, but actually nobody knows right now where the state or city are going to make their cuts. If the federal government doesn't come up with money to support us, so maybe a letter, a letter be sent to the assembly person from the 72nd, which is like and the one that you are mentioning and for george right that within her district right and the other can be added to our budget, because it's a city and controlled by the city council members could be. You know, tweaked to make you know for both, but then one was a letter and one is entered as a priorities for one. You know for our committee right now. I'm married the number six on that list. On that the. What was that I somehow I lost this is the number six one now and how about the one number five then number five increase access to out and outreach to healthy food programs for seniors with medical and health related needs, for how was that the food distribution and whatever is going because I know that my was eliminated, so I'm not giving food anymore. So evidently, difta is looking at a whole lot of possibilities to bring food back to the senior center's provision, but they haven't resolved it. Yet that's what I'm saying a lot of this stuff is almost preliminary, because the city hasn't formulated its actual ideas and plans. The city asked us to submit pilot proposals for reopening the senior centers over and for serving food, and then, four weeks later, they sent a message that oops there's no money, and then this week they said, oh well. Your proposal is approved that when I called up and said which one they were like oops, there's no money so they're really confused. They really don't have a definitive idea. What they're planning to do right now, but they their ideas, seem to center around bringing cooking back into the senior centers and doing actual deliveries from the senior centers instead of the global get food program. I have a question for a rabbi. Are you familiar with? I mean I know that you do know the sentence mariah and jcc are they? Are they in need of? You know some of our support. You know because, like this is the time that we can, you know, add whatever you know of requests they have or I'm putting out budget, and you know community with 12 budget. I don't know anybody well, I know that firm. They are. They are connected with the white core, but specifically anything that they may have. You know as their priority needs for those centers and that population I'm happy to call today yeah. I can happy to call today to check in that's a very good point. The real question for us as a committee would be if we want that food issue to be higher up in our expense request, because that's sort of where we can weigh in more heavily- and I think the way mary has it phrased- would include culturally appropriate diet right mary, I or it was it all about health. It was more about medical and health related needs, but I don't see why we couldn't include right. I think we should and think about raising it in the in the priorities on the expense side, maybe at least at least to number four and have the transportation come down, I'm open to other people's opinion. Obviously I have a self-interest with transportation, but what I see to see is that mental health and food have been number one and number two over these last six months. It's more it's mercy! I want to I'll. Second, what fern says. I think the food is a is a top priority. I think you know when, in terms of our seniors getting the get food, those who were registered or those who were grandfathered into the get food program, countless complaints during the course of the whole pandemic, many fewer complaints when we were still able to provide, grab and go, and we were also our sender- was able to deliver, and it seems that that's been the biggest issue. So I would support that. I think food and I think the mental health also I mean we're checking in with people on a regular basis to see how they're doing just anecdotally. You know some of the members, our members, that I've spoken to some have been weathering it better than others, and I think some of our members whose lives are much more challenged in terms of just their day-to-day lives. Just generally I mean we have a number of members who are homeless or a number of people who are really facing. You know we're facing strong mental health issues before the pandemic. My sense is that this has exacerbated a lot of that, so I would absolutely say that those two I'd say food as an absolute top priority right. You think before mental health, meaning even if you could maybe right, because in other words this is something that's across the board. More perhaps yeah I mean, I think those are two issues that I think are key at this point: yeah they're, almost 1a and 1b. You know right they're, both so important. I know mary as a as a retired psychiatric nurse. You already know the high percentage of depression normally among older adults and our experience and our calls that it's easily doubled and maybe tripled what it would normally be between depression and anxiety and fear. So I would say that they're number one and number two in either order, I'm comfortable with both yeah I'd, say that too, and I mean even some of the members. You know that are maybe a little quirky or eccentric but managed to hold their own just talking to some of them recently and I've started to think you know it's having its effect. You know in a more noticeable way now whether it's the pandemic or just, but I yeah. I think those two issues have to be like top priority. Yeah I mean certainly the mental health issue. I mean I feel, like I'm doing therapy in the park. Sometimes you know I sit with my friends and you know it's like you know I'm and some families they. They believe that this has something to do with age. It's not with the stress that they're going through for many reasons. It's a combination of things right. You know, you know you're all and you're supposed to have all these. You know problems as opposed to really taking care being taken care by an expert on the you know that issue on the mental health issue. I think everybody's affected by it I mean- I even see it in some of my staff. This most of most of the staff are working remotely, I'm on site every day, but seeing even staff and friends of mine. You know people's reaction to all of this is it's taking its toll and some people are better able to weather it than others. I mean, I think, with our seniors. You know who may be less likely to have other people around or who aren't as savvy or able to engage the way. Let's say we can so we can kind of mitigate some of the stress that we may be feeling by connecting virtually or whatever. I think I think, that's something. That's maybe more specific to the populations with which we work, but I think it's hitting everybody and and it's an issue for everybody it is and listening to all the people, all the groups we just talked about. What I'm thinking about is what mary just said. There are lots of people out lots of seniors out there who don't have a friend like mary and the issue is even more isolation there and it's a particular group to try to reach not always the easiest and then the and then it cuts across because you have the isolation and then, let's say people who are isolated because of mobility issues, or maybe don't have a lot of people. Then that's going to impact their ability to get food. You know unless they have it delivered by some means, so it kind of one segways into the other or they segue into each other, which makes it even more challenging the isolation from everything and I'll tell you have. I have a friend on facebook, I've known her for many years, she's on facebook, but I know her from the community and from the organizations that I've been in, and you know her sense of you know, depression and being able to cope and she gets food delivered she's. You know she's disabled, but she gets food delivered. Her neighbors help her and all that, so she has a lot of supports, but even with that she's up and down she's up and down, I mean one day: she's like oh yeah. I wish I could just end it all. You know, and the next day she's very happy because she got five meals delivered to her. You know so it's tough. It's tough, all right so back to increase access and outreach to healthy food programs for seniors with medical and health related issues. We need to reword those so, and so it includes cultural awareness as well appropriate. Cultural, let's see culturally appropriate, is the is the catchphrase. Let's see appropriate cultural. Okay, help me reword this now. The whole thing increase access and outreach to what I am down is increase access and outreach for healthy, good programs for seniors with health and medical needs, including culturally appropriate meals. I like it okay, what about do we want to even say with health and medic health, medical and mental health needs? This is for food yeah and I don't think you want to separate medical needs from mental health needs they're. Both medical needs. Okay, yeah. The mental health needs may include comfort food, but you say that's not necessarily healthy, sorry for jesus. We don't want to go there. You think more chicken soup for the soul, excellent, absolutely or add a copy add the book they should. They should deliver a copy of that book when they deliver the meals. Actually, my my evening, chocolate works for me: okay, [Laughter], all right, new business, maria no I'm concerned about november 3rd and how we are trying to deal with the seniors that are homebound to help them to fill out absentee ballots for the election. I have a whole bunch of applications and since the senior centers are not open, I just don't know how to reach those people. Who are you know anyway? Yes, the northern Manhattan agenda, as a group has decided on september 17th as voter registration drive day and then and we are- we are going to have a table out in front of our three senior centers nimik is going to have a table out in front of its facility on wadsworth and 175th cloth, dwdc they're doing something, I'm concerned about the homebound, not the people who are walking on the street, and you know up and down broadway and san nicolas avenue. My problem is the people who are you know the seniors that are homebound and they don't have anybody to. You know to help them to do that, and also some of them. They can. You know someone's gonna say: oh, they can access by NYC vote or that you know whatever they don't have. They don't have it. No, they need the paper, so we just need to increase that number. I, though I cannot send seniors, I mean I cannot send caseworkers to the house, transportation and the caseworkers are available. Sorry, it's okay! The caseworkers are available by phone to provide assistance at all of the senior centers. So if you give me a list of people that you want absentee ballots dropped off to, we can make that happen with transportation yeah one day I mean the last monday, the numbers of people that we you know we helped to fill out essentials. For was I mean this small. I mean this. We were all over the place. We were all over the place wow, so people talking you know they don't want to stop and do it and most of them says I already done it and you can see on their faces that they haven't done there. It's just to encourage people to do. This is a you know very critical election in november. For everybody I mean you know, yes, all parties I mean I'm not, is you have to be a non-partisan type of absolutely? But but of course we don't want to leave that that open. So I mean I know that we're doing voter registration, that's another thing, a lot of people most of the people already register. So seniors are. We are we are concerned about, you know getting the application in so they can get the ballot and have the ballot you know return. I have a question, you know you're, not talking you're talking about homebound, these aren't in senior centers. So where I mean I'm trying to reach out to anybody that I know my point is like I would take a step back saying we're concerned about getting seniors to be able to vote so there are different pockets, those that are in the senior centers that are connected to a senior center. Obviously, the senior center should be doing that work. You know, and that fern is you know mentioning that there is. There is advocacy out there to get the senior centers who are connected to the seniors that they're in touch with to take this on right and then the next category you're saying maria is those that are not necessarily connected to a senior center. What are we doing? That's a much tougher group. Is there a third group also that we're that's or is that those are the two basic groups? No, we need balloons. Then we need volunteers to help us out on that right. No, I'm saying is there another, I guess those that are in assisted living and other things, so the nursing homes generally have a voting place right on premises. If somebody is a recent resident, they have to re-register with the new location, but they can vote right in the building like isabella always had it right in the in the main level yeah, but we have. We need to make sure that they know that is available to them right and at the register tell people you know this is something I have to be. That must be done and whatever, and we help you out right and now with the problem that we don't. You know they don't have a social internet. You know with each other because of the you know the virus. They isolate a lot of things. Unless, if you know relatives you know take care of that, but I just wanted to drop that it's really it's a crisis, it's really critical. I know I know that julio is bringing around the ballots and the absentee ballot. I mean the registrations and the absentee applications for I'm the one that given it to him yeah, I'm sure of it. I have no doubt in my mind, so I'm I just want to make sure that if we know of pockets of people that we should be reaching out to that, we make sure that everyone knows to either contact julio or you or you know all right that we have, that we have them and that we have people that can walk them through how to fill it out. But we don't necessarily know who we're reaching out to okay, all right that was my you know. My new business along my and mine was that transportation is operational. We started on august 10th, providing medical transportation and we had an immediate request to take people on individual shopping trips, and we are doing both no more than three people at a time on our bus, but we've got operations happening. So if people need the service, definitely have them call us. Oh, can I have a question. I noticed and I have heard the urban hospital you know 165 right 165 and for what's in the camera, a lot of people are waiting for the the the bus that they wait. Do they because it is like the lying, is huge people waiting and waiting for this accessorizer vehicle? Can they take more than one or that's not a it's, not a. They cannot do that, no more because there are people that say that they've been waiting for hours to get a to be picked up. So I don't know if that's happening all the hospitals or just in certain areas and things like that. Most of them are, you know, elderly people or disabled people with disabilities. Do you know any idea about that? Okay, mary? Was there any? Has there been any discussion from the committee about the census, because I know the the deadline was moved up now to september 30th I mean we have talked about it and talked about the importance of it and trying to engage with seniors, and you know with people with you know, people in the community of any you know sort, but you know just spreading the word and writing the word talking to people about the importance of it, and I know people are going up and down. You know wherever I go or there's somebody asking me if I did the census, it doesn't matter where I am right yeah, so I'm like yes, I did it. Yes, I did was going to say that she did it three times already [Laughter] all right. Okay, so I think that you know, I think that that's well communicated- and you know- certainly I've been after everybody in my immediate area of the community, so all right, hopefully everybody's doing it doing it yeah marcy. Are you interested in being part of the voter registration drive? That's the 17th, that's a thursday. Yes, I yeah. If we can figure out how we can, how we can do it sure I'm just putting a table outside the building, I got phone. I got a whole lot of forms if it's okay, what language is up here terms in different languages, so you can give us the forms and we could just put a table out or I would say english and spanish. Do you have chinese? They are chinese also or russian. That's the russian! Also. Those are the languages that we have up here. Okay, those are the languages, so that's on the 17th all right so wait. Where is your table going to be in? I guess we'd put it out front we're at 54, natal right, okay, word, 54 nagel, all right, so I may be able to get some people to help most of our staff is working remotely, but yeah. I think we should probably do that all right. If anybody needs volunteer, I can volunteer that day to help out. You want to come help us mary. I could I could. If you want, I could. I could all right all right, so four languages, english, I would say english, spanish, russian, all chinese! I can't help you in other languages, but I can help you well we'll have the forms available. At least we could have the phones available, so mary we can be in touch about time and all of that yeah. Just let me know. Okay at this point that day is empty on my calendar, okay, good, okay, mary! Are we ramping up? Do you want to ask if anyone likes marielle's, anything to add or she's just here, including adding her thoughts on the text? I'm writing my notes, I'm not taking that much notes. I hope that nadia. I hope you enjoyed the meeting as well. Nadia are you there? Are you still with us? No on the thing unmute yourself doesn't happen anyway, marielle. I am I'm here, I'm sorry. I just couldn't get okay, that's! Okay, any other comments or questions that you may have. Oh, she muted again. No, it goes to me. Thank you. Thank you for for making me conscious of all these different things that is available. I appreciate it. I enjoyed the meeting I hope to join again. I hope well, our next meeting will be in october. Let me just check with ms medieval still on the line here. Marielle you still with us. You have anything to add to anything. No, I think it's good. I added some suggestions on the in the comments, as you all mentioned. So if there's any other thought that I have when it comes to that merchant piece, because there can also be people that it is addressed to that it may not pertain to, but just to kind of give it like, you know more teeth. I know that some, like the restaurant associations and the supermarket association. So again you might be. You are talking to supermarkets and they have their own division of. I think it's called the trade group. I guess and then also too for the senior centers is. I can always ask just because we have a very strict policy when it comes to political things, but if I can help with a voter registration drive I'll, let fern know, and if there's, if you need me physically, then I can be helpful. That's amazing, okay and foreign, so I saw you say something, but I saw I didn't hear it you're still on you. I was actually gonna answer you that thank you for offering and please let me know if you're available, awesome. Okay, great! Thank you. I forgot. I admitted myself and then also I had a question because I know that maria hi everyone first of all, because I'm just looking at some because my screen is half blocked, but maria you mentioned for whatsapp that seniors get charged by the minute they tell their telephone. They have they purchased minutes for their for those telephone. It's not like the one that you know those fancy ones that you've registered with verizon or atm t, and you know, and so on, for the internet for the day, because someone else told me what the internet that charges for your day for because you're not using phone minutes sure, because I remember one of my- I think it was my father that was saying the internet. So that's the concern, because the internet costs a certain amount of money, so yeah I'll send it to you it's going through internet yeah. So I'm not sure if that's actually no I'll, send you guys. That's not my impression of what it is. What, though, what with the what is the assurance phones or the phones that people have yeah, I I'm pretty sure that they count down minutes. No matter what your utilization is yeah for, what's up they do they not. I have I have neighbors that they say. Oh, my god, I only have like few minutes left or something I have to go and and buy more than things like that, so right, because whether you're on the phone or the internet, the assurance safe link, phones, are counting down the time right. Well that sucks. Okay! Thank you. No problem. Any announcements. When are the casinos gonna open, sydney's like to go to the casinos? I don't know, but I know the ones that you know I gotta notice, the casinos and aruba are all gonna, be smoke free now, really yeah wow. Nobody has anything to say about the rebel scooters. Oh well! You know that. That's how that's back that I'm really extremely concerned about is the situation, the sanitation problem that we have in our communities. It's not just that they don't pick up the garbage in the corner is that they there is garbage all over. Someone can fall down, come to sleep and break your neck because it just you know some of the merchants. Are you know accusing the sanitation or not picking up people are bringing garbage to the corner instead of putting them in the basement and disposing them? You know from their building, they just come and lumbeesing, and that is dangerous. Not just sanitation. Is that it's a danger? It's a public safety issue. It's a health issue, it's an environmental issue, it's a senior situation for everything, and I spoke to ebenezer. You know recently about how to address that, because any senior that can full break a heap and that's the cemetery. You know you know visit immediately. That's one of the most dangerous fractures that any senior can have is fracture or the pelvis or the you know, and things like that. So that's an issue that we you know we need to. You know to have address all over and it's not just on the you know in some blacks for more banging orders. It's just insane. It's just insane! So I'm I've been going after poor ebenezer about that. But something has to be done. Something has to be done about this annotation up here. It was not terrible. It's terrible in the park too. I know too closely park that garbage is not picked up routinely and I'm seeing more rats than ever well wow stay away from them. I'm trying the one I saw was dead, though oh my god, you know the one that runs away from me. That's okay, but the one that I did smells bad well anyway. Let's not get into that. Let's don't get into that all right! I have to go, oh my god, so we need to big day all right next meeting october, 1st, okay, I'm putting it in my calendar. Okay, I have to say something all right. I love that rabbi. I love the picture. You change the bridge background now, [Laughter] everyone, it's nice to see you all adjourning the meeting at 11 55 a.m. Take care everyone good meeting. All thank you. Bye, all right, bye, all right.",
        "summary": "We go to a committee that we don't belong to like last night I signed in on boss committee : Let me who's going to give you the name of the people who attended the meeting and they are the attendees for that committee You remember, you know the designing sheet that we have that have committee members and then on the site has or board members that attend.\nOne is because I've been physically impaired and not able to use two hands to type, because I had total shoulder replacement in my left, shoulder at the end of july As far as the agenda goes today, it's some repetitive stuff, but I've look looked into the question about the long lines: businesses, banks, post offices, etc and, as discussed in our other meetings, I spoke to domingo estebas, who felt that it was important for the seniors to have priority in those lines.\nWe have business groups, and we have you know, chamber of commerce and since, like apple, how much cloud do they have in all the businesses and not just the business that they are members of well They , don't really have clout so to speak, but they have the ability to get the word out and make it an important ask and I'm pretty sure that isidro had mentioned that there is an inwood merchants association, because I believe he was working with them on some of the bid projects.\nThe business improvement agency That way I think we have one- is headed by one standard cloth and the other one is up by 207th street or diamond but you know: isidro is involved with a lot of different business organizations in the community and I think- The one question about the re:: it's a good idea to do it jointly with the business development committee, but they've already met this month, so it pushes this back.\nThe letter you know the concept I think mary should read out what she's drafted so that we have some idea of what we're voting on so I started out with, whereas Covid-19 19 created a hardship for everyone causing businesses to close, whereas when businesses were allowed to reopen, restrictions were put in place for everyone's safety masks, social distancing, limited number of people inside etc, whereas these restrictions created unusually long lines of people waiting to enter grocery stores, pharmacies, banks, post offices, etc, whereas seniors and disabled are unable to wait or stand for an unusually long period of time in lines, creating a severe hardship on them being able to meet their needs.\nWe're not allowed to have in-person meetings right now, but it's good to have the information and the background for when everything does completely reopen mary and that sort of speaks to what you when you said before about issues of seniors participating in this meeting Coming to the aging committee, I mean I.\nThink the issue of technology is just an across-the-board issue and even in terms of the senior centers and people being able to connect to virtual programs, you know How can we get devices to seniors and how can we, you know, offer ways and help people learn how to use the devices so I would say.\nYou know junior high school You know there's an additional expense and things like that, and what's hopefully going to be successful mary in addition to the senior centers Okay and many are confined to their rooms because of the Covid-19 You know if people have magazines or books to contribute or anything that you think that the seniors might use or if anybody wants to make a contribution.\nDo that, let's just one more time review what I have down for c, which is reviewing the capital and expense budget listings that we, the ratings, that we actually did back in June they're gonna ask us to submit these next month, so the capital budget items we decided to re-re-prioritize them number one being a system-wide upgrade of various senior centers That seems to be really critical in terms of connecting people with the outside world We said that should be number one number two renovate existing or build replacement senior centers as necessary to comply with ada and difter regs fern is the expert on those We still have centers in our community that are not accessible, , Number, three I'm, sorry and three to provide funding to construct affordable, accessible housing for seniors.\nThere were a decrease in available funding, I would say they're, avoiding food, multiple factors, one is that seniors are moving out of the neighborhood, which the newark eligible eligibility actually relates to the percentage of seniors in a building or in an area That funding can be affected, not to mention state and city budget cuts, which are also huge, but I haven't, heard anything specific about norks Thoughts of a lot of people that are involved with the norks and Now fairview avenue I mean ferry is sorry They thinking of combining that services with other services within the senior centers in our area?\nThe federal government doesn't come up with money to support us, so maybe a letter, a letter be sent to the assembly person from the 72nd, which is like and the one that you are mentioning and for george and the other can be added to our budget, because it's a city and controlled by the city council members But then one was a letter and one is entered as a priorities for one You know for our committee right now then number five increase access to out and outreach to healthy food programs for seniors with medical and health related needs, for how was that the food distribution and whatever is going because I know that my was eliminated Evidently difta is looking at a whole lot of possibilities to bring food back to the senior center's provision, but they haven't resolved it.\nThe real question for us as a committee would be if we want that food issue to be higher up in our expense request, because that's sort of where we can weigh in I It was more about medical and health related needs, but I don't see why we couldn't include right.\nYou know we're facing strong mental health issues before the pandemic, You think before mental health, meaning even if you could maybe right, because in other words this is something that's across the board.\nShe's on facebook, but I know her from the community and from the organizations that I've been in You know she's disabled, but she gets food, delivered, It's, tough, all right so back to increase access and outreach to healthy food programs for seniors with medical and health related issues.\nMy my evening, chocolate works for me, okay, [Laughter], all right new business I'm concerned about november 3rd and how we are trying to deal with the seniors that are homebound to help them to fill out absentee ballots for the election."
    }
}