{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB6",
            "channelId": "https://www.youtube.com/channel/UCXwRxm0zS0jBNTMOVI6xZJw",
            "title": "Manhattan Community Board Six Parks",
            "publishDate": "2020-09-01",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB6",
            "normalizedName": "Manhattan Community Board 6",
            "twitterName": "Manhattan Community Board Six",
            "youtubeChannelName": "Manhattan Community Board Six",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "twitterHandle": "@cbsix",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 340,
            "um": 222
        },
        "wordCountFullTranscript": {
            "playground": 52,
            "area": 42,
            "play": 38,
            "parks": 34,
            "questions": 34,
            "park": 34,
            "lot": 31,
            "question": 31,
            "people": 27,
            "time": 26
        },
        "wordCountSummary": {
            "area": 9,
            "playground": 8,
            "meeting": 7,
            "committee": 6,
            "community": 6,
            "play": 6,
            "site": 6,
            "park": 6,
            "time": 4,
            "people": 4
        },
        "fullTranscript": "Well, but this opens a lot concerned absentee voting and where you can drop off your ballots, and I don't know if it says that I didn't read your yeah. We have. We have an item in the newsletter about it. So, okay! Well, if you're so interested, you can stay on at the end and just hear it again. So yeah you can stay on and read the newsletter. You can just read the newsletter if you're pressed for time, but most of all make sure you're informed by brendan, I think, would be nice mustache mark, yes scar. I didn't put makeup on. I'm gonna get a fake mustache okay. So what do you say? Should we begin or not? Yet the youtube stream is going and the recording is going so okay, so you should feel free to start whenever you are ready. Pam, okay, I'm ready. So I'd like to welcome you to the september 1st 2020 meeting of cb6 landmarks parks, landmarks and cultural affairs committee. My name is pamela vassell, I'm the chair of the committee and the the vice chair. Who's new to us is kevin. O'keefe kevin just wave your hands. So that people can see you well you'll wave later mark is taking a powder. This is kind of his last official meeting, somebody crying or be really upset or sad. Well, we'll present the present afterwards. Okay sounds good. So now I'd like to introduce the community associate brendan birth and he will be on the call with us and he's helped us considerably. Cody is also on the line, but he just wants to be a picture, and you know he doesn't want to speak so we'll follow his directions. So I want to be clear about some of the information members of the public who may be on this call, I'm not sure I haven't seen your faces. You can raise questions or comments, anything that you have to say through the q and a feature of zoom. If there's time following the committee's discussion will field questions from the public, this is the way it works. The committee speaks first and then, if there's time we we interact with the committee, so I'm happy to announce that anton muller will be taking the minutes for tonight's meeting, which is very nice of him, and we're going to take attendance and brendan will call the roll call and when you hear your name, unmute yourself and say present or hear or yo or whatever moves you so brendon, take it away sure committee members, I will call your name and you will unmute yourselves when your name is called please say present. I will announce if there is quorum. Pamela vassell here, kevin o'keefe, martin barrett. Oh marty, yes, he's not on yet he's at the snack table: matt bondi, matt, bondi, gene dinofrio, adam hartke, he's here anton mallner, okay. I thought I'm here. Okay, rajneer here, I'm here, okay reach my patel here. Sean sherman here mark thompson. Here: ronnie white, okay ronnie. I guess ronnie's not here yet gary pappush, okay. I did see gary on earlier. So oh, he has marked us here: dean, stephanies, dean, okay, we do have a roll call or we do have a quorum excuse. Okay, so the agenda for tonight's meeting was distributed ahead of time. You see it on the screen. If there's no objection we'll adopt the agenda, as stated members of the committee, if you object to adopting the agenda, you may raise your hand through zoom. I don't see a hand so seeing that there are no objections. We there's no need for a second, a second or a vote on this motion, but we will adopt the agenda. Okay, brendan will okay, so let's establish some ground rules here. So no one should speak until granted a voice by the floor. Otherwise it's just too hard to hear and it's a zoo committee members. If you have a question about committee business or wish to make a motion, please raise your hand through zoom or you can just wave it around and we'll see it. If you click the participants icon, the participants panel should appear and you should find the raise hand function there. If you still have technical difficulty, click, the chat, icon and relay your difficulty or just wave your arm around the chat function should not be used by commit for committee business or questions about agenda topics. All such remarks should be made on the record by raising your hand through zoom, the chat should only be used to alert us to any technical difficulties you're having or to state in writing information like the email address that was already stated aloud on the record during the meeting when a committee member is given the floor to speak, I will identify you and you can unmute yourself so that you can speak. We are required by executive order to create a verbatim transcript of the meeting. So please keep your questions and comments, succinct and germaned to the discussion and all comments about something in somebody's background. You can send an email afterwards, okay, so now tonight's agenda begins and I'm very happy to brendan. Do you want to introduce, by name and title all the people who will be making a presentation on the first agenda? Item? Okay, so there are several members: there are several people from the parks department here, but the main one presenting from my understanding is benjamin nicolsi. My apologies. If I botched that no problem, it's nicolosie, endo nicolosi, okay, thank you! Okay! I guess steve is not here yet steve is here actually, okay, so who begins steve right? Are you beginning? Are you introducing this? He seems to be included, he's talking, but he's muted, steve you have to unmute. Oh, how can I be muted? Who would do that to me? Okay, go for it! You're unmuted, okay! Well, number! One! We're glad to be back at community board six to present another project to improve one of your parks. We we had a community input meeting or what we also referred to as a scope meeting back at the end of february at yeshiva university pam. You were there as well as maybe about 40 other people from the community, and we got a lot of input and got a lot of con. People voiced a lot of concerns and had a lot of questions and gave us a lot of input on what they would like to see done. You'll see how we gathered that input and then analyzed it further along in this presentation. So this is a project which has a budget of 4.49 million. 3.18 million came from the mayor and was allocated back in fy 18 and then councilmember powers supplemented the mayor's funding with another 1.31 million. So benjamin I just want to cover the first two slides and then I'll pass it on to you. Can you can you put on? Can you put the second slide up? Sounds good? Have you read all those books, most okay, very good yeah, go to the second slide, all right, so this shows the the timeline for our capital projects and, as you can see, we're in the second column at this point with the community board 6 presentation, assuming that you guys like what we're proposing, we would then move on to the public design. Commission. Benjamin would then spend several months working on the contract documents and getting whatever permits are required, and at that point you know, I'm not sure we would quickly move on to the procurement process. I have to tell you that all of our capital projects for the most part because of the covert 19 crisis have been paused after the design process. Only those projects which, where we already had awarded contracts or were already in construction in March, have been allowed to resume. So it is our hope by the time you know, benjamin has still had would have several months worth of work and maybe you're taking him to you know to the end of the year early next year. Maybe by that time the the pause will be lifted and we'll be able to move quickly into the procuring process. But I can't promise that to you at this point, but we are trying to finish all of our design work so that we'll be ready to move on as soon as we get the word so benjamin, why don't you carry it forward and and show them what what we've come up with great thanks, steve steve mentioned. My name is benjamin nicolosi endo, a landscape architect for new york city parks? Thank you all for joining tonight. So we have the goals, for our project are to provide a flexible space for active play, upgrade amenities to enhance comfort on site and add play opportunities for different age groups and establish a safer site to attract park users. As many of you already know, the park is located in the murray hill neighborhood at first avenue and east 35th street st barton church, after which the park is named, is located along 2nd avenue. The entrance to the queen's midtown tunnel is just to the north. The east, river and ferry terminal is just a block away and ps. 281 is across from the playground along first avenue. The playground is elevated. It's about four feet above sidewalk level and is outside of the 100 year, flood plain, so there's no major flood hazards. When the park opened around the 20th on the turn of the 20th century, it was known as st gabriel's park, as was mentioned earlier, and featured a track field and playground and with the construction of the queen's midtown tunnel, around 1940, a new street was planned to run through the park, effectively cutting it into two parts the buildings to the north were demolished, and that includes saint gabriel's church. Today, the surrounding land use is mostly residential and mixed use. There are several hospital facilities that are nearby that some may be familiar with. There aren't many parks with don't worry, they're familiar with it. There are many parks within a within a five minute walk of st bartons, but the closest park with similar features is albano playground and it's about a quarter mile to the south. So, as steve mentioned at the end of february this year we held a community input meeting and we explained that the funds we initially had for the multi-purpose area were freed up for use in another part of the park. That was because our in-house turf team would be able to take over the project for us rather than going through the typical capital process, and then we asked the community which areas they thought needed. The most attention and the choices were the basketball handball courts, the playground, the entrances or the garden and here's a nice photograph from that meeting. A few drinks keep that one up and at the end of the meeting we asked the community to choose an area of their greatest interest or reconstruction, and the playground was the most chosen. We asked everyone to put stickers on the on the plan that we brought with us and, as you can see, these little round, DOT stickers, sort of for the most part are within the playground and among the most common comments we heard at the meeting was a desire for a track that accommodated bikes and scooters, especially since the community expressed dismay over losing the large riding around space they had in the multi-purpose area. Other frequent requests include more climbing structures, a safer spray shower and less exits. These are the existing conditions of the playground that we looked at. There are two entrances from first avenue: there's two interior entrances from the multi-purpose area. The comfort station and preschool are directly across from the playground which contains swings. There's a swing set to the north and one to the south. A sunken spray shower and play equipment, and the last minor reconstruction of the playground was in 2002. are the swings the same for the same age range? So the swings to the north are tire swings, so they're a bit larger and then the swings to the south are a mixture of bucket seeds and strap teeth. So it's for a variety of ages. The bucket seats are for younger children. Thank you. You're welcome. Some discoveries in our analysis and discussions with community were that the playground is too open to the street. The spray shower is unsafe, since it steps down a few feet. The access to the multi-purpose area is difficult to get to and traverse, because you have to go over a playground, equipment and granite block some safety service, and because there are so many trees, there's really only one area that gets direct sunlight and these are the trees, as I just mentioned, on site, there's about 40 that can be seen here around the playground and most are in healthy condition. This is a solar study of the site, so the area that receives the most sunlight is in the center of the playground just across from the playstation. If the trees are pruned, is there more light, there could be a little bit. Some of the trees require pruning, but not many, and they do have quite a large canopy. So I'm not sure it would help that much. Okay. Currently, the playground contains a play unit in the center of the space. These are the two sweat two sets of swings that I mentioned earlier. The spray shower that is recessed and it is not accessible, and this left image shows the preschool entrance directly across from the playground and the right image shows a six foot perimeter fence around the park and unfortunately, we cannot be because it cannot be lowered their current funding, and these are the two entrances from first avenue. Each has a gate and ramps up to the playground, and this is the schematic design that we that we created based on community input and our analysis. The area for the design is a little bit less than half an acre. So a consolidated entrance to the playground makes a safer and more dis defined space. It could be seen at this central arrow right here and to the west is a wider and smoother more visible pathway that leads to the multi-purpose area. So, as you walk into the playground, you walk in through a new large welcoming entrance on access with a comfort station and when you enter a large spray shower larger than what is there now becomes a nice focal point. It's on grade for easier access and to the south is an area for picnic picnicking and to the north, a seating area adjacent to the spray shower and above that is a 5 to 12 play area, and it has many challenging climbing opportunities, as requested by the community. The 2-5 play area located in the center opens up just below. There is a generous bike and scooter area just below the new wide entrance to the multi-purpose area and to the south. There's more of that bike and screw area along with seating areas and a cozy. Seven foot swing, seven foot high swing set. This is the play equipment. The two play areas are in close proximity. We try to keep it light and colorful airy, because the playground is so shady. This is the two to five play: equipment with lots of opportunities for group play and solitary play. There's nice play panels that are scattered around the play unit set, and this is the 5 to 12 play layout and the spray shower that you see when you, when you first walk in and has gentle low flow water features for smaller children and that's adjacent right to the plate, equipment for the smaller children, the two to five and the larger, more exciting spray features for older children is to the north. Next to that play unit set and then echo some of the forms that play that had the current play. Sorry, not the current. The proposed play equipment has just to the north, and these are the proposed site furnishings. So there will be a drinking fountain that will be near the playground entrance a bottle, filler near the multipurpose entrance and we'll be using the same style bench as what is currently in the park, and we will be placing some new lampposts in a few locations to make the space more evenly lit the materials for the playground are fairly neutral to allow the colorful play equipment to make a big impact, so the bright colors reflect the nearby contacts. So the goal is to see the same foreign church and the river just to the east and a new four foot. Four foot steel fence is going to stretch along the entrance that provide a sort of more safer enclosure and it will be, it will allow just one main entry into the playground and a new gate opening and the existing chain link fence will be placed more centrally for ease of access to the multi-purpose area, we'll be placing shade, tolerant and native plants where appropriate on site, and there will be new trees also placed throughout the site, and these new plantings will make a more sustainable site by increasing the permeability by more than double. As you see on the left. Currently it's about 12 and with our proposed design, it will be about 32 but benjamin how many new trees about seven new trees, along with some smaller shrubs and right, some also some yeah right trees as well. So this is a bird's-eye view of the proposed playground. Looking southwest, you see the church in the background, a view from the proposed entrance when you first enter the playground. The new picnic area just to the south of the entrance- this is a view from the new bike and scooter area to the west and another view from the south, just south of the 2-5 playground and once more the schematic plan and I could remain in the slide. If there's any questions or comments, thank you. Does anyone have any questions? Can you please show the slides for the site? Furniture? Please brendan. Did you hear that or benjamin did you hear that? Yes, the site furniture? I have three questions pam later on. Okay, ask them yes, and also is there one for the for the play features hold on? I know that, there's the the you know the spray showers, but what else is included in that? I'm sorry what else is included in the spray shower? Yes, what no the the other areas like the tire swing and any other activity so that the tire swaying is now the in that area. You have the five to twelve play equipment, so that'll be the new 512 play area, because the tire swings there's only three tire swings there presently and they take up a lot of room and they require a lot of space for safety reasons. So now, we're able to put all this play equipment in offer a lot more climbing opportunities for play where those swings are currently. Okay. Mark you had questions. Excuse me pam, I'm not finished. Oh sorry, the on the belly, where the I don't hear anything about the ada accessibility or for inclusion for all that may need some sort of activity or recreation. I know there are some people. There are some people, for example, that have that may not be able to grasp, but they would benefit from the movement of this. Do you have anything that would address that would be more encompassing to allow more to participate? You know I'm thinking of standards set by like magical bridge and items that they have for their famous design and introduction of revolutionizing playgrounds, and you know it swings, and I don't see anything for if there's a caregiver to be next to like a person coming down to catch that participant because they may not be just all those kind of considerations. Sure- and we worked with. We have an accessibility coordinator that we worked with for the design of this playground. So we made sure that there were plenty of play activities for for, say, someone in a wheelchair there's lots of it's a little bit hard to see here in this rendering, but there's lots of what they call ground opportunities for play and also the spray shower which is currently not accessible. We now made that accessible. Currently the it steps down about two feet, there's large concrete steps. The slope is too steep for anyone to you know who is not able to get down to the spray shower, so we have tried pretty hard to try to accommodate every everyone, and also these these play panels. Here are also meant to be very accessible to all and in addition, with the seating areas, we made sure that there is an accompanying area next to the benches. So if someone did have a wheelchair, they could easily kind of sort of settle up to that bench and can be included. Oh great fantastic, and is there any consideration with surfacing just going over all surfaces with something that is, you know and permitted with some sort of copper or silver? The I mean all the surfaces that are proposed are are accessible and we made sure that all the slopes as well are meet ada standards, so they're none are over five percent. Okay. My question my question: actually with the coding it has to do more with we're in the age of kelvid and any sort of a treatment like that on the clay equipment. It could be electrostatic. You know at the factory before it's installed. It doesn't have to be anything super cute because it's already built into the manufacture, yeah having I'm not familiar with the I'm, not familiar with any sort of copper coating, yeah, definitely, and also to consider for this project. It's doable and it's right now, and so it whatever it is, go back to the manufacturers and you know bring that up. Please. Thank you. Thank you. Okay mark yeah. I I just think in response. The last thing I think these are the same play pieces that they presented to us like a year or so ago, where they talked about the caregivers being able to get up to the things I mean it looks like the same stuff, but I think that was what parks talked about a long time ago. So I think it's looks like the same stuff, but I'm pretty sure, but the three questions I had were: is there our age-old issue of skateboarding? What will happen when skateboarders come into the park? Is there a way to let them do their thing or not do their thing, and was that considered it was? It was considered and I'd like to just go back to a photo of one of the existing conditions. So this is the shower. That's adam harkey. On that little scooter, isn't it I think yeah. So I think I know this area is quite popular for skateboarding and that's mostly because you could kind of grind along these steps and we're so that opportunity is as well as the of the concrete benches so that opportunity will be taken away with the new design, because the spray shower will be at grade you're, a conflict between the ages of the skateboarders and the little kids. I mean yeah, I mean yeah, I mean. Usually we I think we like to keep those those two activities separate just you know, because there is greater speed with skateboards, and you know there might be some type of injury that could be had, but I just also want to mention that the multi-purpose area that is now covered in asphalt there are plans to have that turfed over the synthetic turf. So that will also, if you're, if you're, worried about skateboarders using the park in general. That will also decrease the opportunities for city reporting. Second, one is, I love the security with the one gate. Thank you yeah, because we've had a bunch of times I mean over the years I mean steve. You know that people came about kids running out into the street having two gates and stuff so having one gate's, a great idea. So thank you, but is there any idea of having security cameras on here? Is that necessary and the lighting is there, which is great, but right we are adding more lighting so that it's more like I, we didn't talk about having security cameras, that's not something we normally do in our science, but I'll do it. We generally don't do security cameras and that's something that we that we leave to the NYPD to do if they decide that this is a crime prone area or wherever we have such situations in our parks. It works out better if the cameras aren't stalled by them and they become part of their system and they can gain access to them more easily than than if they're, under our room and if they have to come to us and try to get them access through us. So we there was a time where we would put in security cameras, but we through experience, determined that it was better if it was done by NYPD directly. Okay, maybe pam. We should talk about that later on, okay for the NYPD they're funding it that it was not included in the priorities, even though it was requested. Unfortunately, okay mark, you had a third question. Third question: I I've totally excuse me for forgetting this. I know at some point somebody a long time ago brought up the dog run issue and I think it was decided. We there wouldn't be one here, but have you guys discussed it or thought about it or that's, not something we have discussed since the community input meeting, because at that meeting in general we were wondering what the community most wanted to see within the park. So once the playground was chosen, that became our main area of focus. Okay, all right! Okay, I are you. Are you finished mark, I'm done. Okay on you, I have three quick questions. First, I'll ask all three at once, and you can answer. How often are the bathrooms cleaned the squirrels, like those wooden benches? Will they get eaten alive and is the tube that the kids crawl through made out of metal or is it some silicone soft material? Okay, the well number one is wes on the call. Yeah wes should answer your first question. Okay, the bathrooms are cleaned daily and they're checked multiple times throughout the day to see if they need any more supplies or stock and toilet paper or so, okay. So the the play equipment, the tubes are made out of a type of plastic material and it is meshed, so it's transparent, so you can see a child playing within it and regarding the squirrels. So what we've done is we we're planning on having a lot of trash compactors within the playground, and I think that also helps deter, squirrels and also rats, because the some of the mesh wire baskets they tend to crawl into and get up, and I think that also creates an issue within the playground. So I think that will help if there is an issue in the playground, I'm not aware of one currently. Okay, so are there other questions from the committee. Adam harkey has his hand raised okay, adam well, so I one of the when you headed when you were had a rendering of the of the aerial. I saw that they that there was the turf on the sort of the multi-purpose area, and I remembered oh yes, they're- going to be placing turf sort of in the concrete yeah right there in the multi-purpose area. Do we have this actually asphalt just special in the current condition? Yeah, so is that turf or set asphalt? That's going to be [, __, ], okay! Well, currently, in the running rendering it's asphalt, let me just clarify and then right there are plans to put in synthetic turf in this right. Do we know? Do we know the timeline for that yeah? We don't have an exact timeline, but it's projected to be either this fall or very early next year. Okay- and I have to ask in the comments somebody brought up a pickleball big fan: has there been any consideration of locating pickleball elsewhere, it's kind of hard to play on the turf you know after the fall? Well, isn't that something that could possibly be done on the on the handball court? Eventually yeah, I mean, I know just from just kind of personal experience observing in the park. I know the plate. The handball courts currently are used for a variety of different things, including lacrosse. I've seen yeah so that is potentially a possibility for the thing about pickleball is that it appeals to a range of ages, so it would be good to include if we could well, I mean I think we could talk to our recreation people, but I think there are other places where we have adapted handball courts and people. People will end up using the those courts. Any other questions we do have some questions from members of the public. So let's take them. If we may, there seem to be 18 19. So I would ask the members of the public. If someone has your question, but please stand down so we're not duplicating okay, so brendan you want to call on people. I want me to call them people or just read out the questions. Oh read out the questions, that's good, so one member of the public said: please explain the preschool component of the comfort station. So currently there is a preschool within the conversation and, as I shown in an earlier photo the two front doors to that preschool face the playground and, as far as I know, I believe one of the women who, when the preschool was at our scope meeting, I think they also use the garden as well is stephanie on the call all right, we can always have stephanie. Give a report to the committee at some point. Stephanie sauce is the preschool director and the I should just clarify also that the comfort station, so the actual restrooms, are on the south side of the conference station. Okay. So just because the comfort station came up at west, you said they would be cleaned once a day, but they would be checked frequently. Who would check them? St bartons is actually the headquarters for district six maintenance and we base basically keep our fixed post staff. What we call fixed posts, meaning that they would remain on site throughout the day, but usually generally, between 7 and 3. 30. fabulous, okay, go for it brendan. Okay. Is there play equipment for children with physical challenges? I think we might have discussed that already yeah, there's many opportunities and, as I mentioned earlier, we worked with our accessibility coordinator to make sure that they were okay next, okay, next will the park be closed for the construction work, just the just the playground, just the playground area? Okay, where are the monkey bars? There are no monkey bars, but there was a quite a lot of requests for more climbing structures, and so we included that in the design of the playground. As you can see here in this north structure here this there's a big climbing net which is sort of akin to monkey bars. I would say it probably even offers more opportunities. It's also accessible with this ramp that leads into it. There's also these kind of wavy noodles these. These still orange balls on ropes, there's plenty of climbing opportunities that we strive to create in the playground that aren't currently there right. Do you have a quiet space, designation, there's an area for the picnic tables down to the south. Here, there's also some benches some little seating areas just placed outside of the the playground of those the swings. There's a few up here by the multi-purpose area I do want to and there's also some smaller, more intimate seating. That's near the entrance of the 5 to 12.- and I do just want to mention that the play area is a half an acre, and so we tried to put in as much activities and different varieties of play experiences as we could. So there is a garden just to the the south along first avenue and we're keeping some of these benches and picking tables just outside of the playground, so that can be used by by adults without children who won't acquire or replace this a bit. Okay, next question is: there is a requirement in one of the tudor city parks that adults must be accompanied by children? Will it be similar? Will there be a similar safety requirement in this park? Most likely? Yes, okay, but as let me clarify, as in terms of the area that we're referring to right now within the dotted lines, the playground proper. That rules would would most likely apply. So I mean adults would still be able to get to the comfort station. They don't need to go into the playground to do so. We would expect that only adults with children would be entering the playground. It's proper, okay. This is a question I know you all have already answered earlier, but this person joined a little bit late. This person is wondering whether what the timeline is for the start and completion of the park renovation. Correct me if I'm wrong, but it's a bit uncertain due to kovid yeah. Unfortunately, at this point, as I mentioned earlier, there's a a general hold on any projects going into the bidding process. So you know by the time this project is ready several months down the road to go to into the bidding process. Hopefully we will get agree, we'll have a green light by then and can proceed as we normally do. But at the moment I there's no such assurance brendan. I see that there are 33 questions piling up we'll be here until tomorrow. Can you skip over the ones that have been answered already and pick the ones that are the most relevant to what we've been discussing? Can you do that? Yeah I'll look around to see some. You know some of the questions that have been asked. Let's see and just give me a brief moment, there are 33 questions too to very quickly sift through. I would ask members of the community to stop putting in questions now. We we've reached a max and we're not going to 35 questions. Well, it's just. We don't have enough time to do that. So please stop questioning. I'm sorry go ahead brendan! Okay, so will permits be limited to youth teams rather than adult leagues. That's that that's really not relevant to this particular project and the priority will be given on the new field to youth leagues. I don't know at the moment whether or not whether or not we would be able. We would be denying all permits to adults, but the priority would be given to you. Okay, let me see what else looks like we've had a few questions and comments regarding looks like regarding pickleball, we already addressed the picture, but we've already we've already addressed that so skip the pickleball. Okay. Will the garden be open to everyone, so that is outside of the scope of this project? We were just focusing on the playground. Currently, I believe the garden has a steel fennel, a steel panel fence surrounding it, and it is, I believe it it's mainly used by the preschool. So I'm not sure steve may have more info about that. Well, we we're gonna. Look at that question. I don't have an answer at the moment, but we're gonna we're gonna review that situation. Okay, brendan! Go ahead! Okay, I'd like to understand more about the thought to turf over the entire asphalt area, there's less functionality for bike riding ball playing, etc with turf right, and so that is also outside of the scope of the playground, but because that comment came up quite frequently in our community input meeting. We did our best to address it by providing as large as possible scooter and bike track area just to the west of the play units. Yeah I'd like to say that I don't know of any other playground where we've, where we've done something like this. So this is fair. This is pretty unique. Okay, brendan okay, I'm just sort of skipping over here trying to get to questions that haven't already been addressed. Okay, one question is the equipment appears to have a lot less surface area in terms of what is there now? Could it be partially more traditional there's not a lot of space for kids to stand together like they do now on the different levels of the play space, so this play equipment was also responding to a great need to have more climbing structures and also to have separate play areas for the smaller children and older children. So we did our best to accommodate that and I would say, because there was such a great desire to have an area for biking and scooting that did take up quite a large footprint of our playground. So in thinking about the design, we wanted to create sort of more airy sort of lighter structures that wouldn't have such a big footprint, while giving an opportunity for biking and scooting and many other activities, including a much larger spray shower. Okay, will there be a gate at the entrance exit and by the way, pam if like? If you need to like stop at a certain point, let me know I'm just. I certainly will, and I think we discussed the gate. There are two gates currently at first avenue at the entrance to the north and to the south the right now there isn't a plan to have a gate at the entrance to the playground directly across from the conversation because of the two gates that are at first avenue to get into the park. Okay is the bike path flat hard to tell in the images if the paths are just flat the floor material for the water area? Is that one that is not slippery? Yes, there will be a texture. Oh sorry, gone! No, you go on there'll, be a texture for the water, the yes, so this surface is a colored concrete that will have a texture that will prevent slippage and the I'm just going quickly to the renderings of the bike play area. They are flat for the most part, yeah, okay, brendan. Why don't you pick five more that seem most relevant? Okay, I will do that just while you're doing that, I'm going to ask steve a question steve. What is it that you want from us tonight? Do you need a vote or you just are making the presentation? No, I guess I no we would need. We would need a resolution from you so that we could move the project forward to the public design. Commission, okay, brendan, go ahead; okay, just very quickly before I get to the final questions, we're still getting a lot of things in the q, a feature about the garden, even though correct me. If I'm wrong, that's not within the scope of the project as well as comments about the pickleball. I just thought I'd say that if you can I'd like you to forward the comments about the garden to me, so I can deal with that separately. Okay, so comments about the garden forward to you yeah. Please note that, okay, just a moment pam. Could I ask a question timeline question for steve? Yes, when is the your? When are you to be heard at the public design commission? So we just have a sense of the timeline here. Actually leslie. Do you have that answer leslie? Are you still with us? Benjamin? Do you know? I'm sorry, I'm sorry! I'm here I was muted. It would be mid-september. Okay, I ask because our our full board meets a week from tomorrow and so that then they would be able to vote on any resolution at that time. Okay, but we would need the resolution from the committee first right, no from the board right. Thank you, okay. So someone asked we were hoping for more swings, but in actuality, we've lost swings. Is there still room for adjustment? Well, we so the springs to the north that I mentioned earlier are the three tire swings which take up quite a large footprint. So what you gain by removing those spring. Those swings is a large clay unit structure for older children. We can't put everything in into this space. So if we were to place some more swings within the design, you would lose quite a bit a lot of of play, equipment for the older children or something would have to give you'd either use lose part of the spray shower, which I know was a major request, have a much larger spray shower in that grade or lose an area for biking and scooting and correct me if I'm wrong, but the tire swings allow multiple children to sit in one swing. Is that correct? That's correct! There could be a few different children that could okay. Another question: can we see what equipment is in the center of the play ground up close again sure this is the play equipment. This is for ages, two to five, okay and staying on the topic of equipment. I think that's a good segue to another question, which is the slides are metal they can get very hot in the sun is making them a different material, a consideration. Well also. I should say that one of the things that makes these slides very hot in the sun, too, is if they're south facing so we made. We made sure that all the slides are facing north away from the sun, so they will be, they will be cooler. It's also a very shady playground right. It is there's a tremendous amount of sheet in this playground. Thanks john, don't know if I've gotten up to five yet, but if not I'll continue firing away. What is in the areas to the side of the comfort station outside the playground area, I see some gray rectangles on the rendering there are two picnic tables on each side currently right, so the so we're leaving the the picnic tables. That's just outside of the playground, there's one to the south and one to the north, these gray rectangles. So that's right now, there's granite block papers and a tree pit. So that's what they're, seeing just to the north and south of the comfort station. Okay brendan what else still a lot of a lot of comments about pickleball I just I just thought I'd make that clear. I know I know I've brought that up already, but all right send those comments to me as well. Okay, I can do that is so we have to so this meeting. We have to write a resolution right or at least discuss. Yes, we have to decide if we're in agreement about what we see and then can we move on to write the resolution yeah. Should we move on to that? It seems like we're hitting a wall. I think that would be a great idea, yeah cool, so I'm addressing the committee. Are we in agreement that we want to write a resolution about this and about the approval of this? Yes yeah? I would. I would like to make sure that there's language on any sort of updates on having micro, bacterial surfaces, protection on all the surfaces you know if there's this equipment is all commercial and for anything that is all these new, updated standards. For that not to be addressed and incorporated and mentioned at all is just ridiculous. We can put this into the resolution. That's exactly what I'm asking. Thank you! Yes, okay! So, are we all in agreement about this brendan? Do you want to ask if everyone is in agreement? I don't know how we do this on zoom or whether we just ask if there's someone who would volunteer to write this reso? Yes, so since I have, since I had the expertise I'll do it is that you ronnie yes, okay, yeah, ryan! Thank you! That's great! So, okay, so you know the full board is next week: okay from tomorrow, yeah all right, I'll work on it up until this weekend. Okay, that's great so steve, while you're still here, I have and was there a motion on the floor? Oh would someone like to put a motion forward sure a movie. We write a resolution of support the plan for the part. Second, okay. I was in favor right folks who are okay, so I'm going to call each of your names all those in favor. Please say I all those against say: nay, all those who abstain. They abstain, all those I'm not entitled to say not entitled pamela basil, I'm all forrest kevin o'keefe, affirmative marty's, not here, matt, bondi, paul ford! Thank you. Jeanne d'onofrio is that is that in favor or in favor, in favor, adam harkey aye anton malmer in favor, raj nayar in favor race, mattel in favor, don sherman in favor mark thompson in favor, ronnie white in favor, gary paplish in favor. The resolution passes splendid and, let's add that ronnie white has volunteered to write the reso. How many people passed it was it nine for the record. It was 12 voted in 12, a firm and zero against yeah 12 in favor, zero against zero obsession. Okay, so all right steve, I just while you're here I just have one other question bellevue park. Has that been put on hold? Yes, okay, all right! So let's move ahead with our agenda. Thank you all appreciate your comments. Thank you so much for your for your work and what you've put forward. It looks really it's quite splendid. I have to today and I'll stop the share and turn it back over to brendan okay. So next I wanna on the agenda. We have the east side, coastal resiliency project and adam harkey is kind enough to give us an update. It doesn't have to be a forever darling, update, he's just going to give us a quick overview, just the greatest hits so anyway, just giving an update of the escr. The last time that the project team came and spoke to, cb6 that on June 22nd, they came to the land use from waterfront committee and they provided a general update, and so, according to the project team in June they're on schedule with major construction, and this is set to commence in the fall. This is due primarily to federal funding with the project, so in terms of funding and all the other general overarching questions. Those seem to be answered with by that also the latest development, since that time has been. There was a lawsuit alleging that the project resulted in park, alienation and that was dismissed in court and so again the project's moving forward. Most of this work is going to take place below 14th street. The project is still broken up into basically two phases that above 14th street and that below 14th street ddc will present the land using waterfront at the end of the month to provide a more detailed timeline, they will discuss outreach methods which include website social media community information center et cetera. The board continues to monitor mitigation efforts throughout cb6 and cb2, though most of the work is concentrated in cb2. Both residents of the board are affected by the broader project. One mitigation option in the district, the continent peer activation, seems to be on hold due to the current crisis budget situation, we'll continue to press for improved mitigation efforts, especially as we get closer to the work. That's supposed to begin in the district again, the project team will present at this month's land use waterfront committee, which I will be chairing, which will be real fun. So if you wanna, if you wanna, attend and join and ask some questions, so we'll be happy to entertain those. So that's pretty much all I have adam have they been delayed because of Covid-19 or everything is just moving ahead. What they've told us is that everything's moving ahead? Will there be delays, we'll see we'll see what they have to say at the end of the month, but full steam ahead and on all on all fronts is what they're saying okay. Thank you any questions for adam okay, jeannie. I have a question. Sorry. I was trying to raise my hand just a question about the budget. Is it 100 secure? I mean what they've told us is that that's the way they made it sound again, there's a lot of federal funds that are tied up with this and there's also a lot of sort of other city funds are earmarked as we sort of continue in this budget crisis of all sorts of things that seem to be getting worse with each day. Who knows, but as of as of right now, they're saying everything's, security. Okay, thank you. Okay, seeing no other questions. Let's move ahead to agenda point number three, which is a very quick little discussion. I asked brendan to send you an overview of where these, where the pops are located and there's a document that explains what they can be used for. I thought it would be important for those of us on the committee to read this so that we know, for example, if a school wants to use one of those parks. Also, we pass those parks a lot if they're not open if they seem dirty if the garbage is overflowing, if whatever those are the kinds of pieces of information that would be very useful to all of us, so it would be great, even though the document is long and probably convoluted, I think that reading it would be really helpful and would be good to know what exists in our in our district so that we know what we're looking at, because these things come up all the time mark. Do you have anything you want to add to that? Given your history with pops, I guess that's a no he's muted. So I guess he's saying no! Okay. Does anyone have a question about the pops? I you know. I just wanted it on the agenda. So that we could at least address it in some kind of way any questions from anybody. Well, do me a favor just don't call them parks. No, I I'm sorry, pops they're, not parks right. That is correct. I sit corrected. Okay, okay, so next we're gonna move on seeing no other questions, we'll move on to wesley hamilton, who is our man in the park and he's gonna, give us a report about what's going on wesley? Would you be sure to include things about glick and about garbage pickup and the overall budget and the trees being replaced after the storm? And I heard today that west nile spraying of of mosquitoes is going to happen on thursday? Can you address that please? I will go into some of them. Yes, good evening. Everyone thanks for coming here on our zoom meeting, just to touch base with pam on a couple of things. The west nile treatment is done by department of mental health and hygiene. So it's a different agency that usually performs the west nile. Occasionally, in some cases, parks is work with them in some of our larger park lands, but I don't believe we have any areas in district six that we work together with the department of health on that, so they will be doing the treatment of the mosquito treatment for the west nile disease. Brief update, I mean a lot has changed since July or as I guess, since the last time we met all of our parks are now open and full swing as everybody's seen and know, they're all being heavily used being that people are a lot a lot more people are at home and using our parks for exercising. But all the features are open. Now our playgrounds are open. Our spray showers are on our basketball. Courts are open, our dog runs are open, so that's a new adjustment for us as well, but you know with the heavy usage but we're adjusting to some of the challenges that we're getting daily with our staff. Did you have to cut staff? We did not have to cut staff, yet we haven't had any staff cuts. We did not receive any seasonal staffing, so we didn't get any additional theft that we would normally get this time of year and district six did used to get a couple of staff, so we didn't lose any staff, but we didn't gain what we normally do to help accommodate the larger volume of park usage in the summer. However, to answer your question on garbage pickups we're still able to do garbage pickups. We generally pick up our parks depending on the usage and the volume of garbage anywhere from three to five times. A week varies from park to park, but our larger parks, our playgrounds, we hit them. We try to hit them daily if we can, but at least five times a week and then some of our smaller locations. We may hit two to three times a week, depending on the volume of garbage that's collected there, we're still able to mobilize and go to our parks usually daily, with our mobile crews, our biggest issues that we have from a maintenance standpoint. Right now is like I said we did not get any additional staff for our seasonal summer staffing and, of course, we're going through Covid-19, and you know we still get people that get ill. You know if they get ill. We don't know how long they're going to be out we're doing pretty well we're not with many people get covered. But, however, it is a possibility and it's a real, realistic situation that we have to deal with and we try to be as friendly as we can with our staff. So if they're, if they're we're encouraging them. Obviously, if they're not feeling well don't come in right, because you know we don't know what it is until you know until you go through it so from day to day that sometimes causes a little bit of an operational changes or may delay some garbage pickups or something until we can figure out a person's coming in. Do we need to get a second person to take over the garbage route, but we've been over accomplishing that and we've been able to overcome these challenges. But those are some of the challenges that we do arrive in this time and era with pandemic. What about the ambassadors that were hired to work in playgrounds? Are they still are they part of your budget? Is it somebody else's budget? What's the deal there, the ambassadors were existing employees who were redeployed okay, so they still they're still. We still have them. Okay, wes, go ahead. Sorry we do and we don't have any assigned in district six, although they have worked. Some in district six they've been used, mobily and they've worked out of the rec center and they've walked to some of our parks, but we don't have any assigned directly to my maintenance staff. Thank you, steve. Going into that after we've opened up our parks. We've discussed that tropical storm issue. I can say that the tropical storm actually did a fair amount of damage in district. Six at six in Manhattan did a lot more damage in six than it did in my other district in eight and as well as a the city in general. It did a lot of damage, especially in Queens and staten island, my hometown here. So our forestry crews have been working diligently. You may have some of our parks. We still have some debris. They've been prioritizing their work based on the the danger and in many cases a lot of people do not understand that you know we were checking. First, we had to check to make sure all the streets were cleared and then we're going through and making sure that people have access to their doorways, so ems could get to their houses if they needed to, and then they started looking at trees that were could fall or could injure, and then they started looking at stuff that was on the ground so for the most part, we're specifically in district six, I'm happy to say that we've got everything on the ground. We've got a lot of it cleaned up. We do have a few limbs and brush piles that we need to remove, but most of the dangerous work has been done. We did have some closures like sutton place, was closed for quite some time, and people were wondering why it took so long and that's. What I'm here to explain is our forestry crews are working not only in district six but they're working throughout the borough and many cases they were deployed to assist forestry crews in Queens, Brooklyn and staten island for those emergency situations and making sure that the priority, what we would call priority ones were addressed, did the limbs get put in a chopper or do you chop them up and use them for firewood that can go to other place? You know. I have no idea how that works. Sure, in most cases we don't have any quarantine areas, I don't believe in Manhattan, but in Brooklyn and Queens have some areas that are quarantined for the asian longhorn beetle, but in most cases and that's a little separate situation, how they handle that type of wood that comes out of what they call a quarantine zone, but for the wood, that's chopped down in Manhattan, it's chipped up and then reused in many cases we're using it right back in our parks and gardens and yes, and with chip and mulch, we don't use it as firewood. We use it as mulch. Well, I thought perhaps you supply firewood to gracie mansion go ahead. I don't think so, but I tell you in Manhattan we lost a total of 238 trees that were downed in that storm and that and we probably we were not- the our borough- was not the worst off by far, but in Manhattan alone we lost 238 trees. That's a lot of trees, yep, okay, wes! The fair amount was that was in district six, we're still currently working on that, and that is for the most part, my wrap up. No, we have the biggest issue which is glick park and that sinkhole, which is really problematic. Well good, I mean that's. Why I'm glad you asked that it's actually not a new sinkhole there's, not actually a sinkhole there. It is an area where the piers underneath have concerns through our engineers, so we've blocked that off yeah. But excuse me the blocking off isn't really blocked off. It's that yellow tape and it gets moved all the time and it's a potential danger, because it's a very heavily used park. We have french barricades that we've installed there as well and we try to wire them up. Unfortunately, many vandalism people are breaking the wiring and the way we're connecting the french barricades. We are looking into having a temporary fence a more permanent fencing until it goes under capital, but the site is planned to go under capital and it is budgeted to make repairs to the pairs underneath there in that capital project. Is that something that we have to wait until Covid-19 is gone well? Well again, this is a project, that's in the design process, so we don't know yet whether we're gonna run up against a Covid-19 issue when we're ready to when we're ready to proceed. So you know we're I'm hoping to see the the design work in the next few months. Okay, so I don't mean to be a naysayer or the or the predictor of gloom and doom, but I'm concerned that there's going to be a very serious accident that happens there and then we'll have to do something after the fact. So I'm really concerned about how precarious it appears to be right now, yeah. Well, we have our engineers looking at it. So at this point they don't apparently feel that it's in any imminent danger of collapsing. Further steve will you let us know what your engineers have to say so that we can stay on top of it and know what's going on? Yes, definitely that would be great yeah. How much of our budget got cut wesley? The budget information I don't have. I don't know if steve may have any more information on the budget. Well speaking about the, if we're talking about the expense budget, the parks department as a whole got cut by 14, which works out to 84 million dollars. Wow, it's a it's, a very significant cut I'll say: are those cuts? Is there a way to sort of break down those cuts so those by to see how they're are they distributed just throughout the entire parks department as a whole, or are they or there's their way sort of itemized? By district? I don't know, I don't think we've itemized it by district, but the most significant issue you know, which is obvious to us during the summer- is that we were unable to hire our seasonal workforce roughly 1700 people that we depend upon to keep our parks clean and maintain them during the heavy usage of this the summer season. So the the effects, I guess, are somewhat noticeable in many of our parks, but it's so it's very difficult for wes and his staff to keep up without having the those seasonal workers, okay, so, ultimately who's going to decide what gets passed out to what district for the cuts. Well, the these cuts have already taken effect. I mean you know the you know the those that those the problem we face at the moment is whether or not we're going to experience any layoffs, and so you know, as you read in the papers, and here every day you know this is a decision which is still is yet to be made dependent upon whether or not we get some assistance either from the state or maybe from the feds. Okay. Does anyone have any questions for wes or for that matter about the parks I see? Adam has his hand raised okay, adam, you must have it raised very small yeah, so I mean to I guess to be a little proactive on the just the previous doom and gloom that we're talking about. You know you've been seeing in the with the articles about you know with the cuts, the trash collection. Everything like that there's been sort of independent efforts to sort of assist. You know is there anything that you know that I know we've had it's my park days and other sorts of stuff. Is there anything that we potentially can do as a community to help sort of carry the load during these tough times? I don't think we can fix the sinkhole, but you know maybe with trash and other sorts of things. Is there anything that we can do to assist? Well, our partnerships for parks program is still working with friends groups all over the city and is you know with it's my park day, projects and other such volunteer work? We do have some groups that are coming out and helping in some respects. Okay. Well, steve will you let us know if there's something that comes up, that you think we could assist the parks department with raj. Are you going to say something or just changing position? Changing positions? Okay, but I'm still in support of what you're saying anybody else have a question about. Porks I see raceman has her hand raised. Oh yeah, I had a question about the trees. You mentioned that 238 trees we lost in Manhattan. Will those be replanted? That's a good question. I don't have an answer. I would assume at some point they will be. They will be added to our list, and you know I don't know whether if they were on the sidewalks, I I'm more confident that they will be replanted than if they were in inside parks. But that's a good question I'll try to get an answer for you. Okay, thank you. Thank you, steve, that's great, and actually I have a question. Okay, also related to you know, trees being down. I know at least in some cases, trees that had issues and the tropical storm were due to trees that were sick, and I assume for that. Obviously you call 311 about them. But my question is how long like, when you called 311 about a sick tree? How long does it usually take for the parks department to to inspect to check things out? Well, we have a whole new tree management protocol and dependent upon the severity of the condition that generally determines the response time, but I would I would assume that we could probably at least get it inspected within a week yeah I found there was a tree that was in bad shape and I called, but I didn't say that I thought it was in danger of falling, so I called back and said that I thought it was in danger of falling and in two days somebody was here and the tree was gone, so I think it depends on how you report it and what kind of danger you see yeah. Well, yeah. It depends upon the, as I mentioned, the this severity of the condition and the hazard that it presents right. Okay, seeing no other questions about parks, wes and steve. Thank you very much. We appreciate your input and I have a question for mr harkey. Oh dear, go for it, I want to know, if he's related to the former senator from, was it indiana indiana? I'm not. I get this. I get this a lot at least up here. I think we're distant cousins they're the much more successful family, okay, all right- well, all right, yeah, but you're, the very nice part of the family right. No, I think he was a pretty damn good. Senator okay, that's right here he was yeah all right, very good, okay! So now we're going to move on to the chairs report. I don't have, but thank you all. Thank you all right, very good talk to you talk to you all soon, god willing, thank you, maybe hopefully in person. Okay, that would be great. So what I wanted to do. This is very brief. I just want to give some kind of overview because there are some new people here and I think it would be great if everyone would just introduce themselves, even though your name is under your picture, just introduce yourself and if you have something to say fast, you can say it. If not just say your name, so people hear your voice and know what the deal is so who wants to start kevin? You start because he's our new vice chair, thank you. Pam kevin o'keefe. I live in peter cooper, village and happy to be working with pam more closely. This year, okay, great I'm pam vassell, I'm the chair and I live in gramercy park in the park yeah. Well, I'm in the park, often enough, but not in the park. No, I live on the park. Okay, raj! You want to speak next sure it's for josh nyer and I live in murray hill, okay, antoine sure, anton malner and I live on the upper east side and he's a superb note. Taker mark mark thompson. I live in skytown, I'm former vice chair. Thank you, kevin yay, former chair of the committee and former chair of the board. Okay, steve simon. Everybody knows, I think, because he just spoke and he's not part of the committee, but he's here often enough sean, hey everyone, sean sherman. I live in on gramercy park, I'm not in along with pam and I'm super excited and glad to be a part of the committee so nice to meet. You all hope to see you soon and we don't live together, I'm just making that clean. Okay, we got the mystery pam, adam hi, I'm adam harkey live real, close next to raj here in murray hill, okay genie hi, I'm jeannie dinofrio. I live in stuyvesant town, I moved when I moved to new york city 30 something years ago. My first destination was murray hill and I'm still considered a relative newbie to the cb6 and this committee, having served now for about a year and a half okay, reshma hi, I'm rachel patel and I live in turtle bay near tudor city, and this is my third year now, starting on the committee. Thank you, ronnie, hello, hi, everyone, I'm sorry! I hot butterfinger spam hi, everyone, I'm ronnie, and I am a longtime resident- and I own my apartment here at 330 third avenue, which is at the corner of 24th street and the original location of the rose hill, mansion wow. Okay, thank you. Who did I miss brendan? Do you want to say a word dean? I'm here? Yes, okay, I'm dean stephanies! I live in beekman place. Thank you. Anyone else who I missed brendan, say a word and office. Okay, gary gary pappash, I'm semi retired. I was chair of the board chair of the committee, and I wanted to ask steve simon, if he's related to paul simon well, we'll ask him to hum a few bars next time. He joins us and anybody else. I guess not. Okay, so I wanted to say something that I think is really important, given that we have all these budget cuts, given that the city is in bad shape, given that schools are going to open- and nobody knows really, if you know what those circumstances are going to be, if they're they need outdoor spaces, what kind of outdoor spaces can we provide? Which is why I'm asking that you look at the pops and see if you see anything that might be suitable as a as a space for the kids, but I would ask that you function as if you had a third eye and the third eye is for the is for the community board and for the people who we represent on the community board so that we can do them a service and help them in whatever way is possible and I'd like us to be as proactive as possible. If you see a project that you think we should participate in or that we should do, please bring it to our meeting and let it be heard everything is open and totally available for comment and input. You know we look to you to make this work. So does anyone have a question for me about anything? If not, let's then move on to the to old business, and I've asked kevin to to be the the chair of this discussion because it seems to be something: that's come up and and kevin has a great deal of information about it kevin. You want to give an overview and then say what you said. What you're talking about so I'd be happy to so a community board member asks the committee to address the topic. That was the topic of a recent daily news op-ed. It was co-written by her rabbi. The piece questions why the statue of former new amsterdam, governor peter stuyvesant in stuyvesant square has not been removed, reported anti-jewish and pro-slavery opinions held by stuyvesant are among the rabbi's concerns. Now he had just asked that we talk about this, so I guess we are talking about it. It's important to point out that in 1836, when the farmland that was donated not donated it was a five dollar fee for the city to purchase farmland for the stuyvesant family. It was peter gerard stivenson, not peter the governor stuyvesant. He and his wife, helen rutherford were actually the ones that gave the land to the city. For that five dollars, which I think brandon is what about 140 today. I think so that's what it said: yeah so yeah for very little money. You know even by even if you adjust for inflation. Now the statue was actually came in the 20th century that was added and that is of the controversial new amsterdam stuyvesan. I think it's important to point out that the sculptor of that statue is gertrude vanderbilt whitney. Let me try that again. Gertrude vanderbilt whitney now she, as a lot of us know, holds a noted place among female artists. She started the whitney museum of american art when the met turned down her offer to donate some 500 works by american artists. Many of them women because of that turn down she started the whitney museum, which I think we're all familiar with. She did the statue without a fee. I saw the request from the rabbi was to take the name of the statue. Well, there's actually two names on the statues. As pam knows, I went by there yesterday to reconfirm miss whitney's. Ms whitney's name is also sculpted into the statute. Peter stivenson's name and title and years served are on there and gertrude whitney. It just says gertrude whitney sc for sculptor, so there's no necessarily written praise of the former governor. Nor is there any praise necessarily of the sculptor, but I think that's important. Further. Research according to associated press shows that robert moses was the one who asked a peter stuyvesant descendant augustus van horn stuyvesant to unveil the statute in 1941 and, of course, robert moses has public grounds named for him in cb6. We can talk more about this, including the potential rabbit hole we would go down to. If we start questioning names, including the duke of york, the namesake for new york city, who was the first head of the royal african company known for creating british slave trades, not to mention stytown and the park and all the other stuyvesant named whatever right now, the request was: can we just replace peter stuyvesan, maybe with a statue of ass or levy? Well, there are questions after research, as brendan knows about interaction with native americans and slavery by mr levy that a lot of people would find unpleasant. It is an example of something that may need to be understood more leo herschwitz and his john hopkins university press books book from 1990 american jewish history is the title rights of levy and his wife quote. The couple have the services that of at least one negro boy, unquote: herskowitz discovered the home inventory compiled by asser levy in which levy listed, one negro boy, for which levi placed the monetary value of 20 pounds. The boy was listed between sundry pieces of gold worth 13.1 pounds and one belt and hat worth 0.15 pounds. So he listed his servant as property. That's the person that was requested to replace potentially governor stuyvesant kevin. Have we gotten comments from the community about this or just from the rabbi just from the rabbi who asked a fellow community board member to please address this at this committee meeting, okay, so cody and brandon and mark actually and probably gary, have you heard anything? Has anything like this come before us up to this point I mean I don't want us to be on the wrong side of this. At the same time, I don't want to open up. You know something that I just don't know it seems humongous to me. Oh yeah. I think we should table this. It's gotten too much is too much already taking down statues of confederate generals is one thing, but it seems like there's. Nobody. Who's ever lived who's ever been important enough to be talked about that you can't find one thing politically incorrect by our standards of our time. If you checked into it, and if you really was going to do it, there probably would be no statues left in new york and all streets would be named, maple avenue or fifth avenue, and I'm sorry mark, I'm sorry mark. Oh my gosh hi mark, I'm sorry! I love you. I love you have to have the african american lens and perspective on a comment on this one pam and I have to agree with gary okay. So what I'm gonna suggest is that we table oh mark. Sorry, I didn't mean to cut you off. Go ahead, I'm fine! I kind of agree. I think that we need a table and look at it, some more because there's a there's so much going on. You know it's not! You talk about things in board, six named after anti-semites how about the ford foundation? Okay! So, let's, let's table this discussion until such time when it either comes up again or when we have a clearer mind to like address it, given what else is going on in the city, although I don't mean to minimize this, I think it's a it's a big deal issue and it obviously came up for a reason. So you know, let's just keep it in the background for the moment and if anyone hears anything or if it comes to us, let's raise it and discuss it and and see what we think about it. What kind of resolution we can, I don't mean writing a resume just in conclusion. I hope that comes back. I hope it never comes back. Well, it will that's for sure. Okay, we could just add plaques to all the statures and say this is an anti-semite or this is a slave owner. Leave the statues up. It might be possible to just have a statue of the sculptor since it's the whitney, but you know let's, let's just let it be for the moment, and so I think, given that there's is there any other business that anyone wants to raise, or you know what pam I have to say. I was very inspired by the playground presentation. It's out, it's outrageous that parks and whoever would give us the recycled playground idea, it's so old that it's not even up to current par standards and the absolutely ignorant of you know, sort of like safe surfacing and knowing how about antimaterial surfaces and silver and copper impregnation in electrostatic spraying. These are already available. It's not as if it came about because of Covid-19 it is it existed before it and it you know, without having those kind of standards written into the when they're doing rfps for the vendors is asinine, and so I would propose- and I would work on it in spearheaded that we, you know, work on that with parks with d cass and with who whoever comes and starts presenting playgrounds and any sort of updates where the public is involved, that they too know that cd6 has you know a certain standard and don't bring anything that doesn't mean that, because it's ridiculous just to have the same old same oh when the new thing is available and it's cheaper and it keeps people healthy ronnie. Thank you very much, and I and I look forward to the resolution where you've added some of that language into the into the reso, and I think it certainly is a good point. I'm cheered by the fact not really that it's going to take forever until this finally happens, given the budget cuts and given the fact that we're on pause- and hopefully we may be past some of this pandemic craziness, although for sure there'll be another one. So I think the points you're raising are valid and wonderful and I don't mean wonderful, but we certainly appreciate you're bringing that to our attention. Yes, no problem, it should be standard, it's not as if this is a one-time thing because it has to be updated. You know if there is a some sort of levy- and you know it's too short- you make it larger. You know- and this is basically the same thing it's fortifying and in budgeting. So thank you. Thank you kevin. I have some, I think it's old and new business. I just wanted to say, for the record, about we've had a made a pre-covet request for basketball nets for the 13 public hoops in cb6, ashley, kunicki, kunichni. Sorry, the Manhattan senior outreach coordinator for partnership for parks called last week to say that, thanks to the push by deputy chief of operations for the parks department, ralph mussolino cb6 has been given at least two nets for every hoop how about a ladder, and she is looking for a ladder now because she said it's okay for us to take the any concerns about us doing the work ourselves. If we want to she said I don't see any concerns whatsoever legally. Otherwise, so should try to find us a ladder, but you know there's also an opportunity for us if we want to upgrade some of the backboards with funds, so I didn't know if we wanted to go ahead and start putting those nets up or wait and see if we can maybe upgrade some of the backboards for example, or rims that are have seen their day. This is what I think I think we should put up the nets so that at least people can play and we should look into what the cost of the backboards are and and see how we want to move forward with that. I just think that would be the better thing rather than delay any possible games. That could happen. Okay, great all, right kevin. I have a dumb question: how much were the nets? How much is in that? Well, I don't know how much ralph got them, for he didn't say I think they may have had some stash somewhere is how it sounded. I priced him out at about 13 dollars for a halfway decent now, all right, so I think it's stolen, no big deal yeah exactly. He said he can go these two deep, hopefully more, okay, cool, okay! So thank you. One ladder will do it or we need several ladders at different locations. Very small person could do it. Okay, all right! So, let's see what the deal is and given that there's no other question or what have you I'm going to to say that we should have a motion to adjourn? Don't move back end, okay, so at 8 40 we are adjourning. I wish all of you a very good night. Thank you very much for your participation and and we'll see. You soon see you next week at the full board. Thank you bye. Thank you. So much bye! Oh no. If you want to stick around for the voting, I can tell you something it's quick. Anyone who wants to stick around I'm voting in person. I don't trust him. I'm voting.",
        "summary": "If there's time we we interact with the committee, so I'm happy to announce that anton muller will be taking the minutes for tonight's meeting, which is very nice of him, and we're going to take attendance and brendan will call the roll call and when you hear your name, unmute yourself and say present or hear or yo or whatever moves you So brendon, take it away sure committee members, I will call your name and you will unmute yourselves when your name is called.\nAll such remarks should be made on the record by raising your hand through zoom, the chat should only be used to alert us to any technical difficulties you're having or to state in writing information like the email address that was already stated aloud on the record during the meeting when a committee member is given the floor to speak, I will identify you and you can unmute yourself so that you can speak.\nSo there are several members: There are several people from the parks department here, but the main one presenting from my understanding is benjamin nicolsi.\nWe're glad to be back at community board six to present another project to improve one of your parks.\nBenjamin would then spend several months working on the contract documents and getting whatever permits are required, and at that point you know, I'm, not sure we would quickly move on to the procurement.\nWe have the goals, for our project are to provide a flexible space for active play, upgrade amenities to enhance comfort on site and add play opportunities for different age groups and establish a safer site to attract park.\nIt was known as st gabriel's park, as was mentioned, earlier, and featured a track field and playground and with the construction of the queen's midtown tunnel, around 1940, a new street was planned to run through the park, effectively cutting it into two parts.\nAs steve mentioned at the end of february this year we held a community input meeting and we explained that the funds we initially had for the multi-purpose area were freed up for use in another part of the park.\nWe asked everyone to put stickers on the on the plan that we brought with us and, as you can see, these little round, DOT, stickers, sort of for the most part, are within the playground and among the most common comments we heard at the meeting was a desire for a track that accommodated bikes and scooters, especially since the community expressed dismay over losing the large riding around space they had in the multi-purpose.\nAccess to the multi-purpose area is difficult to get to and traverse, because you have to go over a playground, equipment and granite block some safety service, and because there are so many trees, there's really only one area that gets direct, sunlight, As, I, just mentioned, on site, there's about 40 that can be seen here around the playground and most are in healthy condition.\nAnd we'll be using the same style bench as what is currently in the park, and we will be placing some new lampposts in a few locations to make the space more evenly lit the materials for the playground are fairly neutral to allow the colorful play equipment to make a big impact.\nSteel fence is going to stretch along the entrance that provide a sort of more safer enclosure and it will be, it will allow just one main entry into the playground and a new gate opening and the existing chain link fence will be placed more centrally for ease of access to the multi-purpose area, we'll be placing shade, tolerant and native plants where appropriate on site, and there will be new trees also placed throughout the site, and these new plantings will make a more sustainable site by increasing the permeability by more than double.\nEquipment, so that'll be the new 512 play area, because the tire swings there's only three tire swings there presently and they take up a lot of room They require a lot of space for safety, reasons.\nYou know I'm thinking of standards set by like magical bridge and items that they have for their famous design and introduction of revolutionizing playgrounds, and you know it swings, And I, don't see anything for if there's a caregiver to be next to like a person coming down to catch that participant because they may not be just all those kind of considerations.\nSo I think it's looks like the same stuff, but I'm pretty sure, but the three questions I had were: is there our age-old issue of skateboarding?\nI think we like to keep those those two activities separate just you know, because there is greater speed with skateboards, and you know there might be some type of injury that could be had, but I just also want to mention that the multi-purpose area that is now covered in asphalt there are plans to have that turfed over the synthetic turf.\nSomebody a long time ago brought up the dog run issue That's, not something we have discussed since the community input meeting, because at that meeting in general, we were wondering what the community most wanted to see within the park.\nCurrently, there is a preschool within the conversation and, as I shown in an earlier photo the two front doors to that preschool face the playground and, as far as I know, I believe one of the women who, when the preschool was at our scope, meeting , I think they also use the garden as well is stephanie on the call all right.\nAnd I do just want to mention that the play area is a half an acre, There is a garden just to the the south along first avenue, : is: there is a requirement in one of the tudor city parks that adults must be accompanied by children?\nOkay, I'd like to understand more about the thought to turf over the entire asphalt area,, there's less functionality for bike riding ball, playing, etc with turf right, and so that is also outside of the scope of the playground.\nWe would need a resolution from you so that we could move the project forward to the public design.\nAsk because our our full board meets a week from tomorrow, and so that then they would be able to vote on any resolution at that time.\nOkay, but we would need the resolution from the committee first right, no from the board.\nIf we were to place some more swings within the design, you would lose quite a bit a lot of of play, equipment for the older children or something would have to give you'd either use lose part of the spray shower, which I know was a major request, have a much larger spray shower in that grade or lose an area for biking and scooting and correct me if I'm wrong, but the tire swings allow multiple children to sit in one swing.\nThey've been prioritizing their work based on the the danger and in many cases a lot of people do not understand that you know we were checking.\nAnd, then we're going through and making sure that people have access to their doorways, That were, could fall or could injure, We do have a few limbs and brush piles that we need to remove, but most of the dangerous work has been done.\nThis is a project, that's in the design process, So we don't know yet whether we're gonna run up against a Covid-19 issue when we're ready to when we're ready to proceed.\nI. Don't think we've itemized it by district, but the most significant issue you know, which is obvious to us during the summer, is that we were unable to hire our seasonal workforce roughly 1700 people that we depend upon to keep our parks clean and maintain them during the heavy usage of this the summer season.\nI didn't say that I thought it was in danger of falling, so I called back and said that I thought it was in danger of falling and in two days somebody was here and the tree was gone, so I think it depends on how you report it and what kind of danger you see, I, want to know.\nI was chair of the board chair of the committee, and I, wanted to ask steve simon, if he's related to paul Okay, so I wanted to say something that I think is really important, given that we have all these budget cuts, given that the city is in bad shape, given that schools are going to open- If they're they need outdoor spaces.\nLet's then move on to the to old, business, and So a community board member asks the committee to address the topic.\nWhat I'm gonna suggest is that we table I think that we need a table and look at it, some more because there's a So Let's table this discussion until such time when it either comes up again or when we have a clearer mind to like address it."
    }
}