{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB2",
            "channelId": "https://www.youtube.com/channel/UCRWur6iMQnSZfA9fbj_YaDA",
            "title": "Bronx CB2 Housing Committee Meeting  2020 October 7",
            "publishDate": "2020-11-16",
            "shortDescription": "",
            "lengthSeconds": "0:41:12"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB2",
            "normalizedName": "Bronx Community Board 2",
            "twitterName": "Bronx Community Board 2",
            "youtubeChannelName": "BronxCommunityBoard#2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCRfzp2GSHg6CIjALtX73JGw",
            "twitterHandle": "@2_bronx",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "khCbTvNEtzg",
            "fillerWordCount": {
                "uh": 135,
                "um": 131
            },
            "readTimeFullTranscript": "19 min read",
            "readTimeSummary": "3 min read",
            "wordCountFullTranscript": {
                "building": 25,
                "space": 11,
                "tenants": 11,
                "companies": 8,
                "Covid-19": 7,
                "b": 7,
                "spaces": 7,
                "production": 7,
                "food": 7,
                "workers": 7
            },
            "wordCountSummary": {
                "building": 3,
                "end": 2,
                "outreach": 2,
                "pandemic": 2,
                "tenants": 2,
                "brewery": 2,
                "decision": 2,
                "space": 2,
                "money": 2,
                "dollars": 2
            },
            "fullTranscript": "You can commence whenever you're ready everyone and then I'm just gonna mute each meaning somehow, okay hi everybody. It's really great to see, see you all and I hope everyone's doing well, I think as I believe. The folks on the committee and city planning and HPD know all of our projects. 700 monitor, building 1a at the peninsula and building 1b were all determined as essential, and so we have actually been working over the last eight months, seven and eight months, and not without some delays. You know so suppliers and contractors and other you know, subcontractors you know slowed. There were slowdowns due to some activities. There was a huge amount of DOB activity. We've been practicing, you'll see our powerpoint in a minute. You know social distancing has also you know it's just a whole new way of doing the work, but we're really proud to say that we've been managing this and we're really. We have a presentation for you on peninsula, 1a and 1b, and before we dive into that I'll. Just give you a quick update on 700 Manida, so 700 mineda is at 85 complete. We are just actually putting the the final touches on first floor and then getting ready to go through all of our inspections to get our certificate of occupancy. Our goal is to have the building have Pco by the end of the year. We did our lottery over the summer. It closed at the end of August and we and we're waiting for HPD, and then we opened the lottery because the mail was really slow and we had a huge number which I expected and I'm glad a huge number of paper applications came in from the Bronx, and so we input them. It took us three days to input the paper applications and now HPD has been generating the log so any day. Now we should be getting the log from HPD and then we will actually start outreach to to start preparing folks and selecting residents for 700 manida, so really excited about that and I expect people will probably start moving in not early next year. Do you have anything else? I'm sorry yeah. Anyone has any questions. Paula I do what's the pto, I'm sorry Paula temporary certificate of occupancy. Okay! No, that was Cynthia yeah, I'm sorry, Cynthia, I'm sorry. How are you I hope you will follow me I know it's me. Do you know how many appetizers you feel for them? No I, don't know yet that's as soon as I know, I'll send a ralph and you are and Bobby, and you would email me yes, yeah I will so as soon as we get the log from HPD. If you I will tell you the total number and how many came from the zip codes that are cp2, these mini I just need to know. Was there a lottery for this and who did you notify us on that lottery and when was it? Oh, yes, absolutely notified you several times. I was over the summer. It was open from July from June 28th to August 20th. All right did you get a call from the board from Ralph or from Cynthia, stating that, okay, that there was no problems that we'll put the information out they emailed us, they didn't call us, they did email and we send it out to the board as well as we put it in on social media. All right yeah, my the only question I have is that remember that we set up that little group between you and Paula to assist those that are to qualify. Did that happen, I sent out I called at the Gracia and, and she was fine I dropped. Applications off to Autogracia for people and Apollo was on the email. So I did not talk to Paula, but I went without the glasses worked up, because I know that her people were going to be much more on the paper applications and Bobby you were, you were include. I know it was just a very weird time. We didn't have any choice. We had the market during Covid-19. They actually marketed two projects during coldwood and it was very peculiar. We fielded a lot of calls Korea at the point. Fielded calls and yeah I was in touch with Ralph and Cynthia via email to make sure that everybody, you know if they were getting calls if they were getting outreach to make sure that that we were touching as many people as we possibly could from the community board. Well, I understand that my own, my again it's my only concern has been with everybody that everybody's been sending out the information during a major pandemic issue in the city of New York and in all true honesty, I, don't think many people paid attention to those flyers or whatever and so I don't know what kind of true outreach was done out there. But if you have the, if you have your list and HPD has their list, then we'll just wait to see how many 105.9 and five and seven twelve tickets? Okay, all right, I! Think that's with seven hundred menada now. Do you wanna, discuss La, Pena, sure I do wanna put up the powerpoint? Oh yeah I got it, I'm sorry yeah, I'm not good great, so this actually is a picture that was probably taken in the last 48 hours. Again. Josh can correct me from wrong, but the buildings are are really moving along the building one, a I'll. Let building one b talk about 1b when they is the roof is on the cladding. You can see the metal cladding is on all three sides of the building and we're waiting to install the glass and the glass will be installed sometime at the end of October, beginning of November, so the building is defined schedule but is moving along we're about 70, complete right now and so we're expecting to finish early in the upcoming year, yeah sure any questions for building 1a yeah. So here's some pictures for building 1a here. When did you say the glass is going up at the end of October, beginning of November? Actually the store from this class, which is Bentheim, which is a fancy glass. That's at the this space here that we're looking at is the is where the light box spaces for the media and production studio, and so all of that that's open. Now, right now, there's nothing there. That's all gonna, be a glass called bend time class that let the light filter really nicely into that space. My understanding has been that there's been some problems that most of your tenants have left that they don't have most of those 10 anymore. I, don't know what tenants you have now and I. Don't think that the board knows what tenants or don't have yes, so I actually did not bring a slide with all the tenants. So if you go back so in 2016, there was an entire list of possible interested tenants right that included Ilforno. It included Bascom. It included the Bronx brewery so cook there was a cookie company. There were several companies, they were all either Bronx-based or interested in being in the Bronx light box lightbox and, as you know, over the last four years, life has happened. David from lightbox has passed away and left us with a space that was designed actually specifically for lightbox that we are actually actively talking to two other organizations that are doing media and media production and studio production, because the space is so kind of set up for them. And then you are correct that over time the original tenants fell off, including a year or more ago we had taken. We were left with three tenants: Il Forno, the Bronx brewery and and Bascom, and the brewery decided to step off all very good relations because they actually made a decision that they actually didn't want to brew beer, and so this is a production space. They wanted to basically throw parties- and this is not a. This- is not a venue, a party venue. This is a production, light industrial building, so they left. Then we met with Ilforno and Alforno. At the end of like a huge amount of in time and money investment in El Forno, we actually came to a joint decision and a recommendation to them to Ramon that they should actually buy a building. They right now, rent the building and they're, paying like twelve dollars a square foot, originally five dollars a square foot in space and have saved up a huge amount of money. So our recommendation to to Ramon had been to that this didn't quite he kept. You know he didn't. You know the rent of 18 was high. You know he you know, and there were some very interesting. He had some really specific criteria, and so we actually thought it made a lot of sense for him to to not come again. He's totally welcome, but we kind of came to that understanding. I think we presented that to the board last year. Kelsten from from Bascom is completely still interested and and what we've been doing over the last since the building really started to come out of the ground which is about in last winter right before. Actually the pandemic we've been doing a huge outreach. We've put the the building with all of this, with pictures and square footage out on loop net, which is where light industrial and business people look. We have hired, we've put it out through all types of food media outlets, and we have probably over a dozen to 15 interested tenants all of the tenants that we have separate from the production. Second floor space food tenants. We have a coffee maker who is currently in the banknote building and is really paying too much rent. He actually is going to have to either move or close down, and so he is actually actively negotiating his lease right. Now, to move out of the banknote, building and move into this building, so we are so we're focused on the Bronx, we're focused on food. We had to tour of the building with interested tenants. Three weeks ago, six groups came out and are, and people really started to kind of pick their kind of their interested spaces. So what I can do Bobby is give you send to Ralph a list and an update companies. They are almost all minority or women's owned businesses. Several of them are currently in the Bronx and need to move out of their spaces, and a few and they're all food related and kelston is still extremely interested in. We have reserved a spot for him and we're gonna he's really kelston really suffered during the pandemic, and so we are but I told him that we were going to do everything we could to to make sure that he you know he was going to go in here. So if he stays and you get out of the 15, you said you're getting about six more positives out of the 15 am I correct. Yes, and there are 11 spaces and there are 11 spaces in the percentage. Is that taking care of 1a? What percentage? If we get the sixth in kelston? What would that look like yeah? It actually takes it's about thirty percent of the building and the reason it's only thirty percent of the building is because this is looking at on the screen right now. Bobby is is actually a huge space, but it's a thirteen thousand square foot space, so the of the food space it's about 50 of those of the food spaces of the 11 and then the other, and then the the production media space is separate roughly still there, because I understood from Ralph that there was possibly the brewery was I think still interest. But there was discussion about the negotiations on the rent. You know I, think about that. I! Don't know nothing about that! Well or whether you had told me Ralph that there was somebody that was interested from originally and then they they're having pride. They walked away and they're, not thinking about coming back. No, it was a brewery right. It wasn't about rent. It was just about the concept of what is mean. He was saying about actually brewing and catering, but I did have a conversation with Paul I. Think he's meaning to be. If you don't, you know just to reach out or someone reach out just to see what you think it was because thinking something else, maybe a different idea. Oh good, oh okay, sure all right, yeah, full remarriage. So that's what I was, but it wasn't about the Rent Bobby. Okay, so you know that's why I'm asking for you to chime in so like this. You because I know that it was something that somebody wanted to have a discussion on coming back, but I didn't know what it was for if it was okay, all right, that's what it was great I will definitely reach out to Paul tomorrow. Absolutely thanks! All right and Bobby I think you know what you're just making me think. I was thinking about it and I didn't act on it. You know I will reach out to Ramon. Also now that the building you know again, I, don't know you know, people have really you know survived, or you know kind of made it through this pandemic in very different ways, and so I will reach out to Ramon, also at El Porno and see what what's happening. Okay, really I appreciate you kind of thank you. What's next, so I think we're gonna. We can move to one b and we're gonna go back and forth Ralph with one a and one b because we were trying to but I think you're gonna see some images now of one b. If you move, if you progress the, if you progress the screen, absolutely so moving on, so we're still waiting yeah, that's one, a that's fine! That's the inside! You can see the spaces, and here you go here's one b: okay, one b, I'm sorry, that's okay! You might want to put who's going to talk for one b, ble I, please I, don't know who's talking. Oh I'll, do it? Okay, great everyone, so we've been making some great progress. There was a bit of a stall during the outbreak of Covid-19 in the city, but we've reached a good stride. Work is at we'll be topping out a wing of the building, my police, next to it, and the full building will top out in November. You can change the slide. Just more pictures of I'm sorry say that again, that's fine and then Josh will be the presenter all right. Thank you. I was just saying that we're making some good progress at 1b, where we've laid plank on the 11th floor, we're supposed to lay some more playing today, but it was a bit windy. We should be topping out a wing of the building in the next week or two and topping out the entire building before Thanksgiving Mid-November. So the plank trucks will disappear after Mid-November, so you can move to the so. Some more footage we're lucky enough to have a drone. So we could take these fantastic images. We're scheduled for Tco in January of 2022, initially we projected November but due to Covid-19 and some other minor delays where we're now slated for January of a little over a year from now another aerial shot. You guys are familiar with that and we can move to the next one. It's just the is just the phasing plan. So just rough just wait a second! Let me just get it right: you're getting Tco in November, 2022 November of this year, we'll be topping out January of 2022. Okay, that's what I wanted to get clear, January of 2022 you're, going to get Tco or expecting well at this point, we're expecting that! Okay, that's what I want to make sure? Okay, all right! Thank you! Don't quote me on it, but we're in good shape. Right now you know barring another huge breakout, but I think we know how to deal with that. So things are going well. So, as you know, the site plan phase one on the North West corner at Tiffany and phase 1a, is at the corner: Tiffany's bofford, real, quick, we're working with the city to close phase two, but the city's been a bit of a budget crunch after recent events, so we're trying to get a handle on when that will be. We are in with DOB on our new building permit for phase two. So now it becomes a conversation of when the city has the ability, the financial bandwidth to fund the project. So I don't think it's going to be sooner than December of next year, December of 21 that we close on phase 2. Okay, we can go to the is the meaning you want to just do a highlight of 1a I. Think we talked I went through most of these points about everything, yeah, so I think we're good and I think we've pretty much covered everything at 1b. We've got hours of operation, we do have we've gone through the Saturday permit, so we're working saturdays to catch up on time and we're 35 complete. So we can go the my colleague, Serena Dang at Hudson, we'll tag team back and forth, so you wanna take over hi everyone, so I will go over the measures that the buildings are undertaking to to be compliant with Covid-19 requirements. Excuse me what was your name? Please hi. My name is Serena Deng. Okay, thank you. You're welcome, so we have no touch temperature readings taken for all site workers before they enter the sites and the workers are social distancing all day. The workers are all provided with proper Pe PPE and they are aware of the protocols to you know social distancing and maintaining cleanliness and hygiene. There are hand washing stations throughout these sites, and you know the workers are told to use the hand washing sanitizing stations throughout the day and when they exit the sites the sites undergo regularly scheduled, cleaning and sanitizing and for building 1b. You know there are a you know, a pretty big number of workers on site right now, so probably averaging about 90 to 100 a day, and so, given you know that the amount of workers to manage when he does have a medic who does the daily temperature readings and also is responsible for maintaining social distancing and encouraging and monitoring social distancing for all the workers on the Wendy sites. That is this slide and then I think the as well right. So we just split up these. These Covid-19 measures on two slides, but you know basically 1a and 1b- are all you know putting into place extensive Covid-19 safety measures. I also know that for building 1b, the DOB has visited the 1b site two times now to check for Covid-19 compliance and both of those visits. They found everything to be in order, and you know no concerns were presented or any violations issued. So we are definitely maintaining all safety measures on both sides, and so, along with the Covid-19 measures, we are continuing to to manage aspects of construction, logistics and security, on keeping control of any noise dust or pest issues. With the fence bordering the site to mitigate noise and dust, there are acoustical mats to help muffle the sound and we're maintaining baiting for pest control, and there are as far as pedestrian pathways. So we have those pathways outside of the construction fencing and there are flag persons that manage the movement of vehicles in and out of the site, and we are coordinating the deliveries with the with NYPD and then as far as security, we do have cameras along the perimeter of the whole site and security guards are staffed during the off hours. I have I want to mention that Luke and Bernie from the construction side, the general contractor side for building 1b are also available. If anybody has any specific questions so so we are also continuing to engage consultants to help us with compliance and also you know, maintaining efforts to you know to meet. You know: efforts around local, hiring and community outreach, and we are you know, working with local partners, for you know, workforce training and recruitment purposes and continuing to you know ensure that we're making all the efforts possible to to perform local hiring when possible. Before you go to the before, you go to anything else, just need to know how much how many jobs are being provided locally each meeting. Yes, the perfect timing. Excuse me, your question is perfectly timed: with our presentation. No I understand I see the numbers in front of me, but it's not telling me how many people that represents it just tells me 40 40.51 of minority and women business owners. What does that 41? That 40.51 show? Is it two people? Three ten? If you look down at the local labor you'll see that twenty percent from one million twenty-five percent of one b I know, we've got a hundred guys on site each day. So if you wanna bring some of the numbers, we can provide that to you after the meeting. Please provide that to the district manager and the chair because we need. We would like to know how many those hirings did occur since you're already using Crossworks and Miguel I like to know how many that represents so I think so Bobby we will get you I am I. Yes, we are showing you percentages and we will get you actual numbers of people yeah and as well as the companies they're coming and they're on the slide they're coming yeah, because the you know my biggest on these projects is that you guys come in and all well and good. But you know we don't have the jobs, and then we see companies from long Island and Westchester County coming in and bringing in supplies to you guys and I really would not hope that happens, because that was an agreement that we all made, and you know we haven't been in touch with each other for several months. So I just want to keep that in everybody's mind. Yep bye, all right, well, Bobby will definitely be sure to get you the numbers and keep you up to date on local hiring for both sites. Thank you, of course, so the last few slides just provide more detail for both sites around the names of the local companies and the M/ WBE companies. To give you some more detail and some specific names on that so feel free to advance through the next four or five slots, just to get a sense of who you know what kinds of trades, what whether they're, local or mwpe or both. So if you move over to the we put that breakdown there right, so this is the firm's for 1a you can see and then the will show for 1b the local companies if you want to advance and the slide after that will be M/ WBE firm. Just to again give you sorry on your previous page oligario. What was that Oliverio Company yeah Olivero construction? Where are they from because I see they have several segments of b, one two three four: five: six, seven, eight segments of one b they're around the corner, they're a block away from the site they actually walk to the site. Can you get those addresses to Ralph? Also, please, and the reason it's so many trades is because it's separated in our construction budget, but it's all related. You know it's all related to. If you look at the category, it's mainly digging demoing foundation goes on there right, classical contracting yeah, okay, good there and so is Fnf and I know royal flush without them on Webster Avenue. If I'm not mistaken, yeah there's a few there. It's just this when you see so many one name for so many segments of a construction and I never heard of that company before and I, don't know if the district manager had, but that's a concern. So that was you know the conclusion of our update on the peninsula. Does anybody have any questions Madam chair? Do you have any questions? I had a question, but I totally lost it. Just let me go back. I want to reflect just a minute for the protocol for Covid-19. Presently, most of the work is being done in building 1a. Both work is being kind of both builders. At the time it's really hard to grow. You Paula, how is it I'm sorry? Yes, Paula is asking questions as far as Covid-19 they're doing in both 1a and 1b measures on site on what they're doing Paula I know you're on the phone yeah I. Can forward you the presentation, okay and I'll forward it to the executive I'll forward it to Cynthia and I, simply offend it to all the respective members on the committee. I'll do that now? Okay, well, I want to make sure that Ralph gets all the all the numbers and addresses to these companies like to see who they are we'll get all the addresses and names to Ralph. Yes, please any anybody have any other questions all right. This was a great thing. I was just how I put back up the agenda. Paula we've done with the presentations we're up to any new business. I'm gonna email me again: anyone have any new business going twice, no one having a new business. Okay, so we're moving old businesses. Does anyone have any old business? I just want to say, isn't council remember having a food drive on the earth tomorrow, I know he's planning on one, but I, don't know if it's happening or not? Oh so either John or home will reach out to Cynthia me. Normally they give us a couple of days notice, so we can advertise it, but I have not received anything. Oh I've seen it I shared it on Facebook and supported me tomorrow. Yeah I think that got cancelled. I. Think that that's what so all right. Thank you, okay, so any announcements, okay, so I would like to get a motion to adjust motion. Thank you. Well, everyone is, let me just see, hold on a moment. Paula everybody's off mute right now, I, don't know if anyone else has anything they want to say we have one. We have four callers and Jeffrey and Paul. So we have one two, three, four, five, six, okay, no one, two three four was on. Oh I'm and Joyce was on okay, I, don't know, but you know what it's too late now, because we already gave it we already opened it up, I'm just going to mute them all. In the name of the Lord Jesus. We asked so God that you will follow me right, we're hearing a sermon, we're in a sermon, so we got a service. This is the beauty of this right. Well, I'm gonna mute everyone for now, I think everyone had an opportunity to speak. Paula was asking for a motion and then Bobby seconded it, and we do have quorum off of this committee. So I don't know how y' all want to proceed with this any nays on the any names from the committee members to adjourn all right there. It is all right, so it's unanimous to adjourn Ralph he's, meaning thank you. So much I want to thank you yeah. It's really nice to see you anything yeah. Thank you for the presentation and Josh. Thank you so much for the presentation. It was very I, like the breakdown of the numbers, but, as the chairman said, if we can get some addresses and some more details on the contractors, that would be great. Thank you thanks for that. Thank you.",
            "summary": "The folks on the committee and city planning and HPD know all of our projects.\nIt closed at the end of August, and we and we're waiting for HPD, and then we opened the lottery because the mail was really slow and we had a huge number which I expected.\nSo I did not talk to Paula, but I went without the glasses worked up, because I know that her people were going to be much more on the paper applications and Bobby.\nI was in touch with Ralph and Cynthia via email to make sure that everybody, you know if they were getting calls if they were getting outreach to make sure that that we were touching as many people as we possibly could from the community.\nAgain, it's my only concern, has been with everybody that everybody's been sending out the information during a major pandemic issue in the city of New York and in all true honesty, I, Don't think many people paid attention to those flyers or whatever.\nWe were left with three tenants: Il Forno, the Bronx brewery and and Bascom, and the brewery decided to step off all very good relations because they actually made a decision that they actually didn't want to brew beer, And so this is a production space.\nAt the end of like a huge amount of in time and money investment in El Forno, We actually came to a joint decision and a recommendation to them to Ramon that they should actually buy a building.\nThey right, now, rent, the building and they're, paying like twelve dollars a square foot, originally five dollars a square foot in space and have saved up a huge amount of money.\nActually, the pandemic we've been doing a huge outreach, We have hired, we've put it out through all types of food media outlets, and we have probably over a dozen to 15 interested tenants.\nOkay, So you know that's why I'm asking for you to chime in so like this, Because I know that it was something that somebody wanted to have a discussion on coming back, but I didn't know what it was for.\nYou might want to put who's going to talk for one b, ble I, please I, don't know who's talking.\nI also know that for building 1b, the DOB has visited the 1b site two times now to check for Covid-19 compliance and both of those visits.\nI know, we've got a hundred guys on site.\nYep bye, all right, well, Bobby will definitely be sure to get you the numbers and keep you up to date on local hiring for both sites.\nYes, Paula is asking questions as far as Covid-19 they're doing in both 1a and 1b measures on site.\nI'll do that now, Okay, well, I want to make sure that Ralph gets all the all the numbers and addresses to these companies like to see who they are we'll get all the addresses and names to Ralph.\nI, don't know if anyone else has anything they want to say we have one.\nSo I, don't know how y' all want to proceed with this any nays on the any names from the committee members to adjourn all right, there."
        }
    }
}