{
    "data": {
        "YoutubeMetadata": {
            "author": "Other",
            "channelId": "https://www.youtube.com/channel/UCNZyLULUQBp5e9Q1cKtvk6Q",
            "title": "Bronx CB2 FLP Committee Meeting  2020 Sept 23",
            "publishDate": "2020-11-16",
            "shortDescription": "",
            "lengthSeconds": "0:50:53"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "Other",
            "normalizedName": "Other",
            "twitterName": "",
            "youtubeChannelName": "",
            "youtubeChannelURL": "",
            "twitterHandle": "",
            "dateCheckLast": "",
            "status": ""
        },
        "properties": {
            "videoURL": "kLBA1MCI2Sk",
            "fillerWordCount": {
                "uh": 76,
                "um": 104
            },
            "readTimeFullTranscript": "31 min read",
            "readTimeSummary": "5 min read",
            "wordCountFullTranscript": {
                "club": 21,
                "restaurant": 15,
                "state": 14,
                "sergeant": 14,
                "guy": 13,
                "sidewalk": 12,
                "license": 10,
                "problem": 10,
                "permit": 10,
                "event": 9
            },
            "wordCountSummary": {
                "restaurant": 4,
                "club": 4,
                "permits": 3,
                "sergeant": 3,
                "company": 2,
                "street": 2,
                "precinct": 2,
                "problem": 2,
                "gentleman": 2,
                "money": 2
            },
            "fullTranscript": "No meetings being recorded whatsoever John, the first are you there John, yes, first item on the agenda is bqn they're here with us, also and they're up for their renewal. I, don't know if it's for their black car or their tlc, so bbq. If you remember John, if you allow them to just give us a quick, you know what they're looking for. Okay, then who's presenting state, your name for the record. Okay, my name is Julie Garcia from Bqn Voucher Inc, and I'm requesting a letter of no objection for the renewal of our license, which one Bqn Voucher Inc. This is the one where we do medical transportation, quick question: please have we have they received a lot of support from us in the past, for this particular one? Yes, Reverend John. They have multiple I. Think it's every two years, if I'm not mistaken Julie, is that every two years, three every three years so I know since I've been on the board. This is probably the fourth or fifth time that bqn has come. We've always given them the letter as long as the 41st precinct informed us that they had no issues with them within that three-year period. So we do have the community affairs on and we have sergeant Rouh. So I don't know. If community affairs has anything to say hi. How are you hi? We don't have anything to say we usually we give you letter of support and we really don't have any complaints on the location. This is Abby Crespo, hey man, how you doing scared the heck out of me. Seeing somebody over your shoulder question. Is that no problems with double parking or anything? No, we haven't received any complaint of them double park, all right, because I know that the Black Car Inc means that they're on the road constantly yeah. Are we John or Barbara? Whoever wants to talk one of the concerns I have that lately I've seen that people are putting all of those machines and money missed atm machines up to the front now hold on this is regarding the bqn Barbara. They come their services Capcom in Kenya, before we do that. Julie yeah I have a question, and that is that we're always asking the cab companies to have representatives on our board and you think, for a long time you had what's her name, Alexa Campbell and then I started going to the meetings yeah and now it's like nobody's showing up and I know right now: there's no real actual in-person meeting, yeah I, don't know any of that, so yeah, so we're doing everything virtually now. You know until the mayor opens up the Community Board office or wherever I don't know, what's happening with that. But my question is the mayor: opens up I just received another email, it's the governor's executive order of no in-person meeting or no large gatherings, okay and that's what it comes down to so right now that applies to boards as far as having any committee or full board meetings indoors. Oh, so that's what that is. Okay, thank you Ryan for clearing that off for me, but here's the thing we need to have remember eight. We did it with another cab company. What was the cab company came up? Do you remember all right and they're located on prospect now in our district right on our moved across the street and they ended up in our district? They have a full board. Member representative who Agape none essential gathering agape is the next one we catch when we, but you know we need to get representatives from the companies, because when we have a problem or if the 401 has a problem, then we can, you know, definitely address it with you or whoever. It is yeah in person when it was going and if you go into virtual, you know you can just send me the link and then I'll join because I'm the one who was going yeah, we're doing it virtual now until further notice yeah, but once we get the notice that we have to go back in-person meetings, you know we need to see how we can arrange something with your company to get a at least a member of your company into the at least the committee meetings, because, as a former member, oh a new member yeah. Thank you slipped! Yeah! You know it's like this: we don't we, you know like one-on-one. Instead of you know something like this. No yeah. Definitely the person would be me. This is pretty much okay, all right all right. That was my question. Rob, I'm sorry, Reverend, John, now I think he wanted to make a motion, but it's only him and Barbara that are actual members, so they're the only two that can vote, and then this goes to the full board. Next Wednesday, the 30th. So here's the thing reverend. Do you support this application? Sure and I can move the motion. Okay and how about Barbara I just want to make sure Barbara gets barbaric, have any problems. Yes, I'm a little bit confused, because I didn't really hear the whole story, and it's hard for me to just agree on voting on something that I don't totally understand. What was it that you didn't understand? I didn't understand what was going on, but in Kenya I, don't know. What's going on right now, there is nothing going on with boarding Kenya what it is: they're asking for renewal on their black car service, which is the service that they have for people that are on Medicaid that they pick up to take to clinics. My concern was that there was no representative in the board or the committee from Mourinho anymore, so that was my concern all right and then Reverend John's question was: did you ever receive a letter of support on this particular license before and Ralph acknowledged that they have so? Is there a so? Is there any questions or concerns that you may have, because you know it's: okay, I! Let I agree with what Reverend John do because he was there, so it carries unanimously from what I see, but Julie you'll have to make yourself available for the next board meeting all right. Okay, in the event that board members have any questions or concerns. Okay and Cynthia or Danielle will reach out to you to make sure you have the information, because it'll be a personal meeting out anyway. It'll be just like this it'll be next Wednesday at six o'clock, so we'll make sure that you we'll get you the information and then it goes to the full board. Then all right, perfect. Thank you. Do you have any questions? Julie? No, not everything sounds good hope to see you again all right, bye! Thank you. What's next for the agenda, Mr Chairman, John, Reverend John! You have the agenda. I! Don't have it in front of me. Can somebody help me? Okay, oh yeah, we're good. We will yeah I got it here. The next agenda is a discussion with the 41st president regarding the open restaurants in the district. So everybody knows what the open restaurant is right, that they're having the restaurants open on the sidewalks the street. They gotta blockade the area. They can't be serving alcohol only they got to be eating and not just potato chips. It's got to be eating food. What else guidelines they have to submit to the DOT in order to get the permit and they are required by measurements? You know not on the sidewalk Bobby but on the street, so they allow the parking spot in front of their property. So their property is, you know full park parking spaces. They allow four parking spaces, but they still have to observe social distancing, so they can't be sitting on top of each other and if they have an active liquor, permit they're allowed to you know, serve alcohol and the permit is free and we just want to know from the 41st precinct if there are any concerns with any of our restaurants in the district that do have the open restaurant or do not I know of two places that I know of that. The owners have reached out to me the first one was Lily's corner so at Millie's corner, because she has a bus stop in front. She is allowed to utilize the sidewalk on tipping street and then I'm losing here. I can't even hear you I'm sorry. So Millie's corner is the only one that I know that's allowed to use the sidewalk, because she has a. Can you hear me now? Can you hear me now hello, no yeah, okay, I'm losing you. How about now? Can you hear me now really low? Oh there's some background, though someone else is on and is causing interference. There we go. Can you hear me now? Okay, so Millie's corner is the only one that I know that because they have a bus, stop right in front of their main entrance. They can utilize the sidewalk and safe vesinos also because they and Millie's corn actually has a sidewalk permit. Not too many people get the sidewalk cafe permanent, but Millies does stays for Sinos because on prospect is a fire zone, so the fire department needs in front of their to maneuver their trucks, so she's on the sidewalk. Also, those are the only two that I know that that reached out to me regarding the open permits, but I just want to hear from the 41st precinct. If there are any other ones. I know that sergeant Guglielmo has been keeping us informed regarding club Exito, but I, just you know for this committee, so that everyone is made aware of because those permits- and any concerns will come through this committee, so Sergeant, Guglielmo or officer Sokoto. If any of you have any anything any input, you want to put yeah Ralph, so we did a March operation with the SLA about a month ago, so we actually shut down tequila mezcal, which is on which of the revenue questions from woodlock. Yes, La went in there, I mean nothing was you know, nothing was basically being done. The employees weren't wearing masks. They had hookah there, so I think they ended up shutting them down. Unfortunately, that night there was a heavy rainstorm. So by the time we got to exit all which I wanted to hit late exhibit was shut down, but exit, oh, is a complete disaster. The owner is not being compliant. I've told him time and time again he's on the sidewalk. He does not have a permit to be on the sidewalk he's on the sidewalk. The tables are literally two feet apart and I've. Never seen one ounce of food on tables they have hookah, which I told him he can not do a hookah, so he's providing hookah. There's no food and I explain to him time and time again you have a temporary license to serve alcohol with food, so he keeps saying he's got a kitchen, but I've never seen food on the table. So the guy is like I mean I, keep explaining to him. He can not be set on the set up on the sidewalk. I went through the rules and regulations with him time and time again. This guy does not want to listen, so I was trying to get the SLA back there again, but I mean it's just they're overwhelmed right now, with with March operations, so I don't know when I'm going to get them back over there, but exit. Oh really is the only I've I went over the lilies they're in compliance. I've gone to a couple other spots. Everybody else is in compliance, it's just Exeter, which is really a problem there. Their employees were inside the restaurant with no masks and I explained to him. He said they're on their meal break, I'm like it doesn't matter they're in the restaurant. They have to want me. He just doesn't want to. He doesn't want to deal with it. Unfortunately, like I said that evening, when we went there by the time I got there, it was pouring rain and obviously it's outdoor seating. So he closed up early. There was no people there. You know it was just dead night to end up doing tomorrow, but it's a huge problem. I mean it really is the whole one that they closed on quick. What was the one tequila something over there yeah it's right by by Whitlock on Westeros, okay, yeah I know which one it is with them: yeah 1292, Westchester, 1292. Westchester, where Martha and Porter lives that we always had the issues with them. So I'm happy to hear that they got shut down. So when they come up for renewal, we have it already documented and why we're going to? You know why the committee can do whatever they need to do with that, all right that we can maybe reach out to SLA and try and give the sergeant a helping hand and getting them back down here to hit. The sergeant is getting more luck with SLA than I am because I did sent them an email regarding club, w and I have not heard back from the SLA on how they got their license renewed. So right now, that's the next discussion. Yeah I know, but you know I, don't have no luck, because they're really backed up and they're not getting back to nobody. I, don't know how bad they are. They were able to get them approved right, she's, right, Ralph is there any way we need to. The bad part is that we have no actual elected assembly member in community in CB2 I mean we do have, but they're just there, because their name duck accession right now and they're no longer going to be members after January we're going to have members in January to assembly. You told me already about our Senate, though right you told me when I was willing to jump on boards. I spoke with Senator Sir and he said that he's willing to send the FDA a in article 78 so like that they can go to court. So the reasons why this happened, and the only thing is that you told me that there was no written correspondence as to them denying them the lack the license. No, they just said they'll take it into consideration, and that was it so, but I also have I reached out to Senator Bianji right. So I'm just waiting to hear back from her chief of staff, because I know they told me that it is escalating all the way up to her, because I had to reach out to one of her liaison to Us Emily Vasquez. So Emily's gonna Emily said that the chief of staff- has she just emailed me this week about that. So I am trying to get the state officials for that. You know that represents that part of our district, but you're right. So this is falling under the 85th assembly and I've already informed assembly member Elect Burgles, so Kenny Burgos will get on board with us with our club, w yeah, but that's in January right yeah, but we don't know so. I know that sergeant Guglielmo said he had conversations already with the owners of club, w and they're looking to open up soon sergeant. Is that correct, yeah, so I actually did a site survey of the location. I met up with the new director of security. There, sorry about that. What I gather from speaking to the owner and then speaking to the new director of security. There I believe I mean it's my understanding, because the way that they were able to secure the I mean these guys aren't playing around with the attorneys I looked up. The attorney I forgot his name I'll email. If you were out but I mean this guy's like 800 an hour, but what they did was they presented their case to the state and they did upgrade the security cameras there they put in metal. Now the club is not open and that's the other thing. This is I reached out to the state as far as like, because you know September 1st September 30th is the the opening date for indoor dining and it's going to be 25% capacity, but they still have not ruled on whether or not because this isn't a restaurant. This is you know. This is obviously a strip club, so it's a gentleman's club, so they still haven't, ruled on whether or not they're going to allow that I believe that they're not going to allow by the end of the year I really don't I mean these guys are underneath that they're going to be open by like November, but from my understanding they presented their kid. Their attorneys presented the case that they upgraded the security there. It's a new owner which it is a new owner, I guess the license is now under this gentleman who I guess bought out the club, so it's under his name, but that's how they were able to secure the license. As far as that's concerned, but like I said, I mean I've reached out to even the SLA guys that night I did the March operation. I said you know: I asked him like: what's the likelihood of them being able to open up a gentleman's club, and he even he doesn't think that it's going to be an issue until the end of the year, he's like at the earliest he's thinking, maybe January, because it's not really a restaurant you're. Talking about you know it's a toughness joint I mean it's not. You know you're not talking about a lot of chili's, it's not a steakhouse, you know so, but they did put in a full kitchen, so they're pushing to provide food as a guide for opening. So that is the route that they're going. That's always trying to eliminate that in this area, yeah we Barbara. We thought that it was eliminated. We thought that they were. We thought the SLA was not going to give them a license, but now I understand that they said that they were that everything that we objected to, that they would hold it into consideration. What are we doing all of this, for? Are we fighting so hard for our community and they're going against what we're doing and you're correct and that's why? Both Ralph and I have been reaching out to the only two real elected officials in the state, which is state senator Biagi and State Senator Asha public to help us out in reaching out to the state liquor authority if need be, I will call Senator Sepulveda and ask him if he can set up a meeting for all of us, meaning Ralph myself, Reverend John and Sergeant Guglielmo, and whoever else wants to be in it and see if we can get a meeting with the state liquor authority and maybe Ralph can work with Biagi to request the same thing. I think we should have. If you can do that with, we should invite Biagi and burgles to that meeting in particular, because Biagi and Burgos that's their district. Is that on the border he's willing to help us man, we got to take advantage of that and we also need to take advantage for finally, senators Biaggi, who hasn't done nothing for this community and I. Don't have a problem telling it to her to finally step up to the plate on an issue. That's affecting two schools, all right homeowners and the record that it had in the previous I, don't care who the director security may be. You know they brought us that lieutenant that one time and tell us he was the director. He was the director of security. He was a lieutenant in NYPD and you know: I spoke to the captain about it. The captain said: listen, Bobby Dick, he came to me. He spoke to me and I told him that I wasn't interested in anything that he had to say. So. The truth of the matter is that this, if they open it up as a if they open it up as a restaurant I, have no problem because as a restaurant, then it's a restaurant, but if they open it up as gentlemen's club, then I believe that the community and the community board needs to mobilize itself to our two state elected officials, to move on them to get SLA. To close excuse me we're going to have to rally the way we did against the heat one yeah. Then we do it that way. Then we do it that way, but we need to let the SLA fight know that we do not want a gentleman's club there if they want to open up as a restaurant, I have no problems whatsoever, restaurant no problem because they have parking for a restaurant and everything, but if they open it up at the gentlemen's club, then there's a problem. We've been fighting too many years not to have that for us to accept that today. So what we need to do, then, is Bobby see if we can reach out to Sepulveda. Let me know if he's interested and then I'll let Biagi and Kenny know we can even have a zoom meeting something similar. I'm happy to hear from sergeant Googs that you know we got a couple of months here. We got at least two months and that's about three months to do this until January, if that's the case yeah, so just to clarify Ralph, I'm sorry just interject just to clarify Bobby Crestfall. So yes, the new director of security, the captain and I have discussed it. The guy's name is Fuhrman, he's a retired lieutenant, so he's not yeah and I found out through my sources that he now I guess they're, making him a stakeholder in the club. So at that point, like listen, I have all the respect in the world of the guy. He did 25 years in the NYPD, but this guy is more of a businessman now than he is a lieutenant. At least he doesn't have our interest or the interest of the community in mind. I mean he's a part owner of the place now I guess they're, giving a mistake in the club. So that's where he's coming from and listen no disrespect to the guy I look forward to being retired one day myself, but at the same token I mean now. The guy is a private citizen. So he's you know he has a vested interest as far as financially in the club. It's not really coming from a law enforcement. Now, let's say they upgrade. I'm not gonna lie. They put an hd camera they put in metal detectors. They did put a lot of money into the place, but at the end of the day, it's still a gentleman's club and it attracts a certain clientele and Ralph and Bobby said it's near two schools, not one but two. You know and that's my issue and I've had issues there before I mean my guys literally have been around the corner when shots popped off I was two blocks away. The night of the shooting you know so I mean it's just that's the unfortunate reality of the situation. You know, I, don't want to take money out of people's pockets, but it's near school and that's the kind of client tell you draw on at three o'clock in the morning and that's the kind of situations that we end up. Having right all right, we'll get people rolling on this. Hopefully, by the next sop meeting we can have a meeting shut up. Right Bobby yeah speak to Kenny you gotta. Let him know that club Exeter is in his district, so we're gonna be aware of it. So we're gonna have a question about Club, W and club. Two issues of liquor license okay and then this way well, we can then proceed with that and naturally I want Reverend John to be making himself available when that happens so like that he can say his piece and make the statement for his members of his committee and and I wanna. You know I inside I, re I understand the guy is now no longer a cop and I understand that my thing is that far too many of the merchants or people that have business in this community do not live in this community. So they do. What, as they wish to please to make the money off this community I agree and I can not no longer sit back and say: okay, yeah that guy's all right and that guy's not right. You got to hold everybody to the same standard and to me this lieutenant came to us that one time and I told him. I'm I told him. I'm sorry we'd all do respect to your former rank and to be in NYPD, but we can't we can not and I think Barbara was there and so was Reverend John at the time now we can't entertain any of this stuff and yeah. They got a high priced lawyer because the owners of that particular place are guys that are infamous you know in the industry of gentlemen's club. So you know I, don't want to be involved with anything like that and I believe one of the owners was an ex-member or a former member, or still a member of a organized crime. Yeah I wish to have that. I'm sorry yeah so Ralph we can do this as quickly as possible. You know I'll reach out I'll try to reach out to Supreme without tonight, see if I can reach out to him. He's gonna. Ask me about the letters and I want to listen weekly. The office is closing right. Now we can't get to the letters, the writer that stated that they would consider I, don't know, I have an on email, every all the documents that 4-1 gave me that we submitted to the state liquor authority back in October of last year. Okay, so I could forward them that email and then I have from their response that they're going to take into consideration on the community's interests right, and that was the last correspondence that I received from the Slas. My question that question came into Biagi so yeah they can say it to Sli I haven't forwarded it to Kenny. So just how was this approved when you react itself, you know any I think we can need fresh letters, new letters from everybody from the banknote, building everybody from the the thug, so Bobby I got the hunts point Longwood coalition, which is all the Cbo's they're all ready to write letters, okay and we're really. We can have our congressman elect because he's gonna be in our district yeah. So I can have him also write a letter because that's in this district also so I have everybody ready. It's just a matter of now when they open, because if all the new letters are going to state everything that happened from last year because they've been closed since then so yeah, but we'll I'll definitely follow up with Bialji and Virgos and Congressman Torres I can follow up and make him aware of. What's going on here, I don't know, and then you, let me know, what's going on what's up yeah, I'm gonna invite our sergeant, goobs and we'll write this committee. Yeah can I ask you a question: is that going to take place at the next flp meeting? Or is this going to be a separate meeting? It's probably going to be a separate meeting before the flp next or is it something that you want to discuss? I, don't want you scared? We got to see the schedule yeah because even with that said Cynthia, which is the point that I want to make, they came to us. They never got a letter, and so if they got their license after the fact they should have still come back to the board. You know so that's another point of you know that I want a point of clarity. You know a point of reference actually that I want to bring up, but we'll definitely follow up and we'll let this committee know and we'll keep community affairs and sergeant groups in the loop so that they can participate in any meetings we have regarding club, W, yep, Mr, Chairman, yes Sir. Yes, I would like to say that at this point this case is beyond the the franchise committee, so it has to be taken by the full executive vote because it is an upfront on the on the community board too all right. Well, what I could do right now is again take another vote from you and from Barbara. If you still feel the same way about club w, we can still send a letter to the state liquor authority, a fresher letter stating that we have heard- and this is the concern- and this is where the committee feels- and the board feels look- I've already reached out to them we're waiting to hear back. We need to know their reasoning to send a letter without knowing their reasoning. You know we gotta at least find out why it was approved in July and that nobody notified the board, like they never came back to the board and we didn't put anything in the mail either, because I was still going to the office. Yeah I know they would have reached out to me. The SLA should have reached out to me via email or the date of the hearing like if they did have a hearing. How come we weren't informed, knowing that we were objecting to this, so they haven't responded back to me and I included the executive or committee in my email, so I'll follow back up in the morning with that I have borough board and then after Bro board, I'll shoot another email to the state liquor authority and we can take it from there and I'll call, of course, okay yeah. We can do that all right. So anything else on the agenda. Oh yeah, I do have something. I got something very brief. I want to, and I'm happy that the caller's on here. First of all, the mayor just sent out another email. The executive order I think is running for has been extended to the end of the calendar year. This is regarding permits, sample permits, parks and police sound permits. We have casino, Maria who's, looking to get a sound permit on Halloween to have an all-day event in front of their office. What, and so Cola is saying that there's no permits allowed so I just want to make sure everyone's on board with that, because we always support the precinct and I think we should continue supporting the precinct with this. So just keep that in mind. That's the only thing that I have that. Well Ralph. You know that the boy we as a the executive members could vote to cancel the Halloween Day parade and I feel that you know, and that was in support of the 4-1. So you know I feel still feel the same way and I'm sure that the makers feel the same way. I know that casita Maria may mean very good, may have very good intentions in doing you know. You know they're even advising people on the news and in TV not to go out and do any halloween trick-or-treating. You know, because you don't know who you're touching or who's touching. Why and again anybody could be asymptomatic and get and pass it on to anybody else. You know so you know I leave it up to clarify how she feels about it. But for me it's still a no. So it's kind of difficult, especially when again like Acevedo, said Casita Maria. We support them in every event, but putting their time in the middle of approving their sound permit and then is bringing attention with other events that my once down permit that we're not giving them they kind of fall under the executive order that they could have events up to 50 people because they're cultural organization, that's what they're known for. But when you do an event like that, you're just gonna call a big crowd as well, so I would love to give them a sound program. I would love to support their event, but I feel like giving them a sound permit for them to have an event on Simpson Street between 163 and Fox. It's just going to call the wrong attention. It's going to give out the wrong information that we're picking who to give permits to, and that's the problem that we had with the Halloween Day parade, also because if we would have pushed it as an issue, would have put you guys into a catch 22 of why them and not us, you know, and so we canceled it totally so I believe that it shouldn't be any because Casita Maria alone, with their students alone, is over 50, not to mention that the minute you put sound and you're out there, the people, the community, is going to come out on Halloween day, which is a Saturday. You know, I Ralph I, don't I personally as much as I like Casita Maria and you know, and all the other stuff I can't feel comfortable to say. Yes, you know I'm still holding to my guns as isolated for our own halloween parade. I know, listen, I'm supporting and whatever the 41 41st person wants to do with this. So I'm just advising this committee that this just recently transpired so Cola and I was discussing it so Cola. Just so like that, you know my sentiments on this. Okay I have reverend here who also would have covered this. The permanent request on this and Barbara. We could take an official vote and the committee could say no and then that's it. You know, I'm gonna sit just asked me down of courtesy to reach out and I just mentioned it now. There's no need for us to vote on. It has nothing to do with us. I, don't think we should be voting on that, because then that really extends our message that we're against them like this is the casita extremely intelligent, okay, I agree, nice I, don't think they're gonna get their permit regardless anyway, I'm just mentioning it to people. They know, I'm gonna sit down with my commanding officer and let him make the final decision. I know from where the community Board stand and with everything that's going on that. This is not a good idea, so I will bring it up. Sit down with my commanding officer. I will sit down with Julian I. Let him know about Casita Maria, and we kind of already know what the answer is, especially when it's more of a no than a yes, we can afford to give somebody a permit and not other organization, because then everybody's going to use the cultural. You know we're doing something. That's cultural for you know to take advantage of this I love casita. This is a great person and again like Christmas. I'm surprised that they want to do this event during this time. Yeah, I'm here with the chairman. Here, though, this is something that they shouldn't be getting involved with: they're risking their children, their students, their participants, they're jeopardizing their health here and they're risking too much and like I, said I'm just mentioning it here, because they did reach out to me and they reached out to Sakota. So Cole and I spoke I think it was yesterday right or was it? Yes, we did yeah, you know, so it's just something. I wanted to bring to this committee's attention that I'm supporting the 41st I think we should support the 41st precinct with this, and that's that but I agree with you chairman, there's no way why they should be getting together on Halloween and putting on risk there's a lot of safety measures here and I. Don't think they're going to be able to for. If that was the case, then we can have our halloween parade. You know something along those lines, so Ralph just interject really quickly. So captain Schumer and I met about this subject a few days ago. So the deal is like they don't want any gatherings, and unfortunately, in this day and age, like I'm 44 years old, so I grew up without social media, but unfortunately, in this day and age, everything is all about Instagram Facebook, so the minute that we give permits. For one event it goes on social media and it's not just the 41st precinct and the Bronx it's city city-wide. Then people in Brooklyn are like well. Why are they doing you know? And in this climate, like the May I, don't know if you guys read the paper today, but the mayor basically stated that the ball drop on new year's eve is going to be virtual. I mean they're, already saying the ball drop, which is you know, December, 31st and right so unfortunately, I mean in this day and age. I would love to give out permits, but I mean it's got to be a blanket. You know it's got to be a blanket statement, but, like officer scholar, said I'll speak to captain Shublin again today, we'll have another meeting about it and I mean he's going to have to come forward with downtown, because it's not just us. It's also chief of patrol's office, but I mean at this point right now. I can't see it happening and getting approved from downtown only because they're denying these I speak with the NCO sergeants in other boroughs and they're denying these permits everywhere. It's not just us, listen, it hurts us not to do events, especially when this community needs it. We just have to sit down and just wait to see. What's going to be the outcome, everything that's going on glad event we're not. We may not even end up having our Christmas giveaway because of the same thing you know, and that really hurts us. You know and I don't feel comfortable with it. You know that's why we were going to pull back to school and we put it off to April, hoping that by April there is so much at that time. We're going to be celebrating the end of the school year. Never you know so I like I, said I, don't know what to say other than I can't support it. You know I, it's not fair to other people in this community that want to do the same thing and we're telling, and that means they have to close down the street anyway, if they were to get the sound for me, and you know I'm against that. That's like allowing black parties you're gonna, have to allow the black parties. If you do that yeah. Yes, all right, that's the message that it does yeah and that was the only thing Reverend John and Chairman Crespo that I. You know that was recently came up that regards this committee, but I'm happy to hear that we shut down one place, we're looking to shut down another place and we keep keeping an eye out on club w so that place tequila makes cow that they're still open by the way you know so, I don't know what's going on there so because I drive right there almost every day when you, when did you see them last open because we they were closed weeks ago, I was there. You know I drove there like two days ago and I thought it was one they were double parked there I saw people hold up hold on a second there's, another restaurant next door. No, this was sticky laughing, so they got the I'll. Do a business inspection tonight Cynthia? What time around? What time was that? Oh, that was like? Maybe foreign right. Thank you. Yeah, okay, I'll tell you, I'll take Bobby I'll, take a ride by there. I'll do a business inspection tonight, I'm actually at work right now, so yeah, okay, other cameras are working. Look at you guys! Oh listen! I want to bring up something. Oh I'm sorry go ahead. Barbara wanted to say something. I'm sorry go ahead. My concern is what's the capacity of the outside dining capacity as the length of the storefront, the restaurant yeah, but they still have to be distancing, so they got to be six feet apart. The chairs and tables I want you on the weekend to find someone to go to save latino restaurants and look at the capacity of how crowded it is and how they're pulling out more chairs as more people come in what time? Okay doing that, because I was there on Friday with my wife, what time they going! That's like around the hours between seven eight o'clock, you're sleeping already, yeah, you're right, Ralph won't be sleeping anymore, but I don't know if I'm sleeping or going or whatever, if you're still on the air. Maybe you could stop by say the scene late in the evening to see, if that's true, yes, I can do that. So just clarify it. There's nobody they drive by, but they're, not seeing what's going on and that surrounding right in there they're just driving by they need to get off the car and look in there for real and see what's going on, because they're Danny you're writing what you're saying, but it has to be a specialized unit that does that and that's sergeant, Guglielmo okay I'll handle that so just to clarify there is no. So the indoor seating rules, September 3rd I've, read up on all the rules. I studied it. I've been in contact with the state, so the outdoor seating. They give you a certain square footage for your like to reiterate what Ralph and Bobby were saying earlier. They give you a square footage so like in the case of lilies. They have a bus, stop there. So they're allowed to be on the sidewalk, but normally it's on the street there's a certain square footage that you're allowed for your restaurant and the state gives you the parameters. The only thing that they ask is that the tables are exactly six feet apart, so if they had extra chairs, there's no okay. Yes, let sergeant googly emo go there with his unit today, you know and give it a you know today's Wednesday, so it starts picking up a little on Wednesday, tomorrow's Thursday. So maybe you know for the next couple of days. Just keep it. You know an eye out if possible, no 100, no listen! This stuff was not on my radar and brought from Bobby. You know: I worked very closely with both of them. I mean the minute that they text me something I'm on it. So I to be honest with you, I wasn't aware of the situation of the problem, but I will definitely go there and I'll I'll shoot an email to the board and I'll I'll. Keep you guys apprised of what I find. Thank you one other item that I want to present since I have sergeant googliemo on and my staff. So we had at my dlc meeting last week, Sergey Googleymo presented to us these break-ins that are occurring these truck break-ins and the ibz and how they know who the perp is and the perp has been arrested multiple times so we had Christina from the Da's office. Also present, so they finally she's gotten back to sergeant Guglielmo who's, been you know really on top of this by sending her emails of the perp, the profile of the purpose, actual name and everything they just recently arrested him. But finally, this morning we got an email back from the Da's office regarding that so I just want to thank sergeant Guglielmo for his efforts, and hopefully we can get some better results with this appreciate it Robin thank you for reaching out to these offices very frustrating because we keep arresting the same guy and they keep letting them out, and you know I mean at this point. It's I mean it's just you know, I feel. Like I'm banging my head against the wall, I mean we literally arrested him again. Last night, the exact same thing breaking into a truck in the hunts point area, and this guy is responsible for I mean over 70 percent of my truck break-ins. So but I appreciate you putting me in contact with with the Da's office. Thank you for me. That's it for me or very John anything else. No I would like somebody to move the motion journey. Try and get some sleep. Bro I am thank you guys. I appreciate that God bless you good to see everybody again. Thank you all right.",
            "summary": "Medical transportation, quick question: Please have we have they received a lot of support from us in the past, for this particular one, If I'm, not mistaken Julie, is that every two years, three every three years, So I, know since I've been on the board.\nDouble park, all right, because I know that the Black Car Inc means that they're on the road constantly.\nOnce we get the notice that we have to go back, in-person meetings, you know we need to see how we can arrange something with your company to get a at least a member of your company into the at least the committee meetings, because, As a former member, Oh a new member.\nRob, I'm, sorry, Reverend, John, now I think he wanted to make a motion, but it's only him and Barbara that are actual members, so.\nI, Let I agree with what Reverend John do because he was there, so it carries unanimously from what I see, but Julie you'll have to make yourself available for the next board meeting all right.\nEverybody knows what the open restaurant is.\nRight, that they're having the restaurants open on the sidewalks, the street.\nOkay, so Millie's corner is the only one that I know that, because they have a bus, stop right in front of their main entrance.\nAlso, Those are the only two that I know that that reached out to me regarding the open, permits, but I just want to hear from the 41st precinct.\nUnfortunately, like I, said that evening, When we went there by the time I got there, it was pouring rain.\nYou know why the committee can do whatever they need to do with that, all right that we can maybe reach out to SLA and try and give the sergeant a helping hand and getting them back down here to hit.\nSo I'm, just waiting to hear back from her chief of staff, because I know they told me that it is escalating all the way up to her, because I had to reach out to one of her liaison to Us Emily Vasquez.\nI know that sergeant Guglielmo said he had conversations already with the owners of club.\nI mean these guys are underneath that they're going to be open by like November, but from my understanding they presented their kid.\nAs far as that's concerned, but like I said, I mean I've reached out to even the SLA guys that night.\nIf need be, I will call Senator Sepulveda and ask him if he can set up a meeting for all of us, meaning Ralph myself, Reverend, John and Sergeant Guglielmo, and whoever else wants to be in it and see.\nI, have no problem because as a restaurant, then it's a restaurant, but if they open it up as gentlemen's club, then I believe that the community and the community board needs to mobilize itself to our two state elected officials, to move on them to get SLA.\nWe do it that way, but we need to let the SLA fight know that we do not want a gentleman's club there if they want to open up as a restaurant.\nI'm happy to hear from sergeant Googs that you know we got a couple of months.\nThey did put a lot of money into the place, but at the end of the day, it's still a gentleman's club and it attracts a certain clientele and Ralph and Bobby said it's near two schools, not one but two.\nYou know, I, Don't want to take money out of people's pockets, but it's near school.\nYou know, I, don't want to be involved with anything like that.\nIt's, just a matter of now when they open, because if all the new letters are going to state everything that happened from last year because they've been closed since then, I'll definitely follow up with Bialji and Virgos and Congressman Torres.\nYes, I would like to say that at this point this case is beyond the the franchise committee, So it has to be taken by the full executive vote because it is an upfront on the on the community board too, all right.\nWhat, and so Cola is saying that there's no permits allowed so I just want to make sure everyone's on board with that, because we always support the precinct.\nI would love to support their event, but I feel like giving them a sound permit for them to have an event on Simpson Street between 163 and Fox. It's, going to give out the wrong information that we're picking who to give permits to, and that's the problem that we had with the Halloween Day parade, also because if we would have pushed it as an issue, would have put you guys into a catch 22 of why them and not us, you know, and.\nYou, know, I, Ralph I, don't I personally as much as I like Casita, Maria.\nI, know, listen, I'm supporting and whatever the 41 41st person wants to do with this.\nI know from where the community Board stand and with everything that's going on.\nAnd in this climate, like the May I, Don't know if you guys read the paper today, but the mayor basically stated that the ball drop on new year's eve is going to be virtual.\nI mean they're, already saying the ball drop, which is you know, December, 31st and right.\nYou know, that's why we were going to pull back to school.\nYou know I, It's not fair to other people in this community that want to do the same.\nAnd, we're telling, and that means they have to close down the street anyway, if they were to get the sound for me, and you know I'm against that.\nYou know, I drove there like two days, ago.\nYeah, you're right, Ralph won't be sleeping anymore, but I, don't know if I'm sleeping or going or whatever, if you're still on the air.\nI mean it's just you know, I feel."
        }
    }
}