{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "Manhattan -  Land Use Committee Meeting",
            "publishDate": "2020-12-10",
            "shortDescription": "Agenda\\n\\n1.    Approval of previous month's minutes\\n2.    Referral back to committee for Land Use Application N210095 ZRY \\Zoning for Coastal Resiliency\\ Citywide Zoning text amendment\\n3.    Vote to adjourn",
            "lengthSeconds": "1:35:24"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "kTuNEaJHVPw",
            "fillerWordCount": {
                "uh": 87,
                "um": 410
            },
            "readTimeFullTranscript": "51 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "flood": 37,
                "buildings": 37,
                "building": 35,
                "zoning": 28,
                "language": 27,
                "text": 23,
                "floor": 20,
                "development": 20,
                "amendment": 18,
                "resiliency": 18
            },
            "wordCountSummary": {
                "building": 9,
                "flood": 8,
                "zoning": 7,
                "buildings": 7,
                "development": 6,
                "amendment": 5,
                "construction": 5,
                "language": 5,
                "resiliency": 4,
                "incentive": 4
            },
            "fullTranscript": "Are we recording now it has started? Okay, so are we accepting other people into the meeting? Yet? Oh there's nobody else lurking out there right now. Oh my god. It's only 15 of us. This is the first time I see so few people in the late news meeting. Are you sure I see 77 people waiting? You do I'm just kidding. You scared me Trevor, I'm going to try it I'm going to try to scare back on you if there's any opportunity. Okay, so it's 6:36 and let's start the meeting and good evening. Everyone welcome to community ball. 3 Land News committee meeting for Wednesday December, 9 2020 and we are conducting the meeting through zoom tonight and my vice chair Linda, is managing the platform and she's gonna give a brief introduction about the zoom functions and also some basic guidelines: Linda, okay. So the basic guidelines for the an outline of how the meeting goes is that we will have committee discussion of the issue tonight. We don't have a formal presentation. First, when the committee is done with their questions and discussion, we will entertain questions and discussion from the public. If you wish to speak, whether you're on the committee or in the public, please raise your hand and if you don't know how to raise your hand, you click on participants at the bottom and then you'll see the little hand and you can click it. Okay, yep and the juice mentioned that we only use the chat box to check in and in fact we should use the chat box to check in so, if you're, here and you're, not a member of the committee, please just put your name and affiliation in the chat box, but do not use the chat box for aside discussions right. Thank you. Linda and I also want to emphasize that everyone who wants to speak should raise their hands first and get recognized by the chairperson, even committee members. This is to maintain the order of the meeting, so we can move it better and faster and Mike. Thank you, Linda Michael. Can you please do a roll calling to take the attendance please or Jackie? Yes, here Linda here, Michael present Dominic, yes, Jonathan, yes, Herman! Yes, Trevor! Yes, Lisa here Olympia here, Damaris I, don't see her on the list, so I'll keep going Troy. Yes, thank you, Troy Steve. He can not make it tonight. Okay and Tim I, don't see him either. Okay, thank you Michael, so tonight. Our first item on the agenda is to approve the minutes for our November meeting. So let me know if you, if any one of you have problem with it or we'll just approve it. Okay, so I see no questions. The minute is approved and next item is the dcps application for the citywide zoning test, amendment on zooming for coastal flood resiliency, and there are a couple points I want to make before we go on discussion, so I did mention that the ratio well when the wrestler was referred back to the committee at the full board. I did mention that I don't plan to change our position. However, since the football did not make a position on this issue and if committee members have any other thoughts on our position, it can be brought up tonight, although I don't sense that coming but I just want to put it out there and like I, said before. Jim already has a lot of come time and I don't want to add more to it. So Jim is only scheduled to be with us for two hours tonight. Hopefully we can finish it earlier, but just take advantage of his presence and expertise. I mean because I feel like this plan is very extensive and complicated, and if you have anything regarding like technical, you can ask Jim and listen to his opinions. So I had send you a list of points to be added to the wrestle. These are the points that I put together from the comments I received and for the sake of avoiding chaos during the discussion. I want to I want Michael to bring the base solution from last month to the floor first and then we'll discuss each point on the list and then move to amend the resolution by inserting the language of the points. I want to take this piece by piece. So we are not arguing about different parts of the proposed language. If we spend five to ten minutes on each amendment, we can go through this quickly and orderly I think we will spend a bit more time on number one but move fairly, quick for the rest and so I guess Michael. Can you share the base solution from last month with us from last month, yeah sure one second sorry I have like 10, more docs open, I'm trying to clear up my screen. Thank you, okay, right! Okay, can everyone see? Yes? Can you go to the second page, so I just want to read that therefore be resolved clause. So basically, this is a continuing. This is. We are continuing on the discussion from last month. I want to read it out and community boss 3 disapproves of application and 2 1 0 9 5 Zr Y, the zoning for coastal flood resilience, Citywise Zoning test amendment with following concerns and observations, and then we're going to insert the comments from the points that I share with you. Are you guys? Okay with that? Okay, so sorry, Jackie I have my hand up. Let me see yes Olympia. Thank you. So I think that when Jim wrote this the whereases are just enlisting everything that was in the Zeta Cfr that we don't need to enlist everything, because we're not addressing everything and I think we may need to change a few of the, whereas, depending on the therefore you know what I mean right now you have 14 their asses 18 their asses. Sorry, whereas is that you may not be actually commenting upon and you don't need them, it's going to be just confusing, so it needs some editing. This part. How about this? When we finalize the points and then we come back to see what do we need and what we don't need for the awareness clauses personally I think that's unnecessary I. Think it's fine. It's just summarizing the bill. It's not saying these are the things we're referring to I, don't see I'd rather not go through 18 points and decide whether or not there we've talked about them. Thank you, Lisa just an introduction. Okay, so I'm gonna go as planted. Let's just go to the point number one: Michael: can you pull out the points I share with you guys? Sorry I was on me. Let me stop screen, sharing real quick to pull it up. Sure this document right. Thank you so I think one of the concern we have from last meeting is that we thought that these zoning change would incentivize and encourage a large new development in our area in our district and I guess. Most of the concern would be like, for example, the two bridges area and such and I want to hear Jim's opinion and also Trevor, because I feel like after the Scl is done. Our district may not have as much as Us flood plain as right now so just curious. What Trevor's input on that too? So Jim. Do you like to go first? Yeah sure? Can everyone hear me? Yes, okay, so let's address so just so. Everyone understands what me this first item, actually Jackie and I, just kind of went back and looked at the transcript from last month and tried to make kind of trying to aggregate what we were hearing from people and put it together in what could be an amendment you know to the existing base resolution I mean I think this would probably be something that could be added as like a whereas and then also maybe with us. Therefore, but I wanted to clarify I. Think just so. We are clear: I mean the DCP kept referring to this as an incentive last month and I think that that's accurate to an extent but as I thought about it more over the last 20 days or so. I think what we want to be clear about is what exactly it's incentivizing and that's where I think I've started to rethink this a little bit. I mentioned it a little I mentioned it last month, but I hadn't thought it really through all the way. Yet so I think one of the issues is I. Don't know that this program in and of itself incentivizes new development, where there is not development today and I. Think that the reason why is the way that they're structuring the program is you know you can relocate additional developable floor area in a building to a higher elevation but you're not gaining net new floor area? You know you're not gaining net new residential units in that building, so I'm not sure certain that extra height you know without, like the addition of you, know, significant developable floor area is alone, going to encourage a developer, who you know wasn't going to build in the floodplain to now say: yes, this is financially viable. Now, I will do it now. I do think it incentivizes something and I. It took me a while to come to this conclusion, but I think what it does. Incentivize is not new development per se, but it incentivizes resiliency measures, but only in a certain building typology right, I, think that is the kind of key incentive here that it largely only encourages resiliency measures in new construction. So I don't think it's per se encouraging new construction, but it is mostly only encouraging resiliency in new construction, because I just don't see after thinking about it more and more, how that extra exemption would really make a rehab financially viable. For you know an old tenement building or an old multi-family building to you know, relocate mechanicals or ground floor residential uses to a higher elevation. So I just wanted to open up with that to kind of be specific about what we're concerned about incentivizing and then the other thing is I. Think I just want to echo Jackie's point that I feel like they didn't emphasize this enough last month. But you know we have the flood maps as they exist now, but they are going to be very different after ESCR is complete and we don't know when that's necessarily going to happen, although we can picture this out, maybe five or six years from now so I think when we're thinking about this a lot of the current floodplain in kind of the East village neighborhood. A lot of those buildings may ultimately not even be subject to these requirements if they are ultimately out of the flood plain after ESCR I do think we want to pay special attention to the two bridges neighborhood. If you look on the map that DCP provided last month, there's currently a smaller area of buildings down there in the flood plain but I. Think after ESCR, that's going to be the majority of the eligible buildings in the district, I can't say for sure, because we would have to wait to see how those flood maps change, but that's just what I'm thinking at the moment. So it's just a way to focus the conversation and like what the impact might be. That's all from me for right now, thank you, Trevor and then Olympia. What I will add that my concern is really about current buildings. In fact, the building I live in, which is affordable. It's only is undergoing a significant rehab, where we are moving mechanicals to the roof. In fact, this weekend we're getting a generator on top of the roof now, and there were some incentives to do that. I'm not exactly sure what they were, but if we were in a height area that had height restrictions, that might be a little more difficult, I'm sure they could file for some variance. But that's my concern in terms of buildings that are doing this and I think there are at least three in the two bridges there who are doing this I were either moving mechanicals and I know. There was at least some talk about changing the ground for uses of some of the buildings. I, don't think that's gonna happen, but there was some talk about it with regards to the ESCR just for clarification, Ecr stops at Montgomery Street and then the Bmcr begins from Montgomery Street to the Brooklyn bridge, which would actually be bmcr. They were not clear on that. How the new maps would affect that area, because we're not actually lifting the round as we are in the ESCR area. I just did want to make sure we don't restrict a lot of the tenement buildings or multi-family buildings which are affordable strip, that ability for them to move mechanicals, which is extremely important, such as generators and borders, to a different level, or at least that's emergency power backups to different levels and I. Don't have the expertise to see to determine whether this prohibits that, but that is the primary concern for me. Trevor I just wanted to piggyback on your points that I actually had a conversation with Jim on that I use, Nika Baka as an example for the discussion and like I, guess like to encourage them to move the mechanicals to their to the top of their building. It actually will vacate their space in the basement right and they already have business in this in their basement and I. If I remember correctly, they have several one or two medical office in their basement in and by removing by vacating. Their basement looks like they can convert that for more commercial use, but then I also think that I mean most of these affordable housing complex. Their finance is not really strong. So by giving them even if we are giving them that kind of a new income would is that really problematic I mean to me. It seems like it's also supporting those low-income and moderate income residents in those buildings, so I mean, since you brought this up. I didn't put this in the points, because that was just a private discussion between me and Jim, but I just feel like, since you bring this up. I want to add on that right and I think our building is using a number of incentives to move. It's not a straight-up cost. It doesn't affect the roles for people who live in the building and my building, as do others, also have commercial storefronts or some sort on the ground floor which help the commercial, the residential building, so I, think I mean I, don't think. Does commercial incentivizing commercial development in affordable buildings is a bad thing because it helps to financial stability of building overall, thank you Olympia. So my reading actually differs with your reading. Gym and I basically see very clearly. How is this an incentive because it lowers the cost of making business? This is a law mandated by the building code. You are constructing in the flood zone. You don't need an incentive to abide by the law. If the law is, you need to have weatherization and you need to have flood proofing. You have to do it. You have to pay for that. Instead, what we're saying now we're gonna find a way for you to offset that cost. So this is a clear incentive and it goes to private development of new construction, and it makes it more palatable to construct in an area that, as a city, we know we'd rather think about it more before attracting new developments there, because it is a flood zone and because new development does impact already vulnerable populations that live there, and so I clearly see this. How it is an incentive and I also believe that there is a little bit of confusion in terms of what happens with pre-existing buildings. We hope will have other programs right now with this zoning thing only if they have a very high level of reconstruction, they would be able to use any of this. You know incentive and so I think that we should say we have no problem with anything. That is a technical amendment. In order for the zoning to not contradict the law, that is the building code right, so the building code has been updated, because this is a flood zone and after Sunday we know what that means the same way. It's updated after seismic accidents or other issues, and so the technical amendments should go forward. But what we are against is the idea of these very obvious subsidies that are in there, and the second thing is that the building code is currently I, think Monday mandatory only in the 100 year flood zone and these incentives, this Zeta Cfr, is extending them to the 500 year, flood zone and I. Think what would that actually end up mean is that new construction that has more capital will actually be more flood, proofed and others who don't have capital they can not do it so I believe the best way to do it is to make it a mandate, and then, if there is low income construction, you subsidize, but you actually want to make sure all the communities have equal safety from flood and about the ESCR comment. I, don't think at all that the work that we are doing with you know the ESCR elevation and, if they're going to do anything in the harbor is a permanent solution. You know so I feel we need to always build with the understanding that there is a you know, climate change, and if it's not the river, it's going to be extreme rainfall. So there are different issues, so I believe we need to behave as if you know this zoning is important for a flat zone. We should not be presuming, as you suggested, Jackie, that this may be less of a flat zone, because maybe you know after the park is finished, maybe in eight or ten years- and we don't know, what's going to be happening in the other side, it's going to work and before I leave because I as I said, I have to leave one comment that it hasn't been mentioned. Yet it is the streetscape because the streetscape, the vibrancy of the public space, is actually could be very much impacted by zoning regulation and zoning is an inflexible tool. So we do know Olympia. We need to be stay. We need to be on the points like I said before, like the beginning of the meeting, so I was trying to be helpful because I shared all the comments and I will not be here and I saw that you ignored that comment. I wanted to put it in the record, but of course the floor is back to you. Thank you, Olympia Trevor, just one comment and I see someone in the comments says that they can't raise their hand. Oh I'm sorry, but let me just be real. Quick clarification on Olympia's point about ESCR in flood plains. That's actually incorrect, because this zoning is based on flood maps. So after ESCR the flood maps will change, but that has nothing to do with as to whether there will be flooding or whether it works. The flood maps will change and this will no longer apply. Just the point of clarification on that Michael. You have a question, I'm sorry, I didn't see your hand. No it's fine. It's not a big deal. I yeah, I, think I mean I. Think the point here that says it encourages large development. I, don't know that. That's how I would describe it, I mean I, think I agree with Jim in what he was saying. You know, I, don't think that this there are four area exemptions, but they're, not massive and they're, not like bonuses or something- and you know I think we understood that at the last meeting, but maybe we weren't being clear enough about it or maybe we're trying to you know think of two things at once, but I think for me personally, it seems like this is really geared towards developments that are much smaller in parts of Brooklyn other places, yeah and places that have very different building typologies than we do, and so I think that it would just you know, I think the proposal would be better if it was modified to target different types of development differently, because, like Olympia just said it doesn't make sense that this legis or this you know this text amendment will in a way be easier for new construction, which is you know, especially in our district, usually very different than like a what a small home owner in south Brooklyn has so I guess that's my comment. I think that it would be more powerful if it was different for different types of building typologies or different sizes of building. Thank you. Michael I want to hear from other committee members I'm just not sure that if I agree with what Olympia said before how this would reduce the cause for the developers to do the resilience, improvement, I, don't think she was saying it would reduce the cost. Yeah I think she was saying that it. You know this is burdensome and is expensive and right. Big developers are more likely to be able to take on that cost than like a small homeowner that already has existed. I think that's what she was saying, I'm not sure. Okay Jim, can we hear from other committee members first and then come back to you. Thank you other committee members. Do you have any opinion on that? Whether we want? How do we take on this a larger and new development issue? Lisa? Do you have any opinion? I'm sorry to cut you on the spot. Well, I suggested some wording I and it appears there so I. Would you be comfortable if we may get some little bit of like changes? Of course, okay I see a I'm gonna go back to you before corner yeah, I'll, be really brief. I just I want to I think we're not as far apart on this all right. It seems like at the moment, because what I was trying to point out before I agree with the point that Michael brought up I. Think part of the issue is that we're just we're, maybe being remember, maybe overstating that what it will do is induce, like a certain type of large development, so I think we want to maybe be more precise with that language, but I also don't want to dismiss I think what Olympia is saying is absolutely right in terms of how it this policy kind of privileges, certain building, typologies and type development right. My point that I was trying to kind of parse is that I? Don't think this alone will trigger new development at a significant scale, but I do agree that you know a like higher capitalized developer is much more likely to do this than the owner of an existing. Just based on the finances right and actually, if anything, based on how limited the actual incentive from the city is financially right, you know then there's limited subsidy available. Besides this, we talked about that with Stephen earlier meetings, so I think you might want to say something. That's the issue here is that the zoning incentives that do exist through this program, they concentrate all the results or they may concentrate the resiliency improvements in new construction and that leaves behind you know the many existing buildings multi-family buildings, old, tenement buildings. In the flood plain who now they will have additional zoning flexibility, but no financial flexibility to take advantage of it. So that's just I think that is an important distinction and we might want to try to capture that yeah. That has been what's in my second point: yes, so if we want to be more precise, then I don't know. If I could ask someone, Jim or Lisa I mean trouble either one of you to maybe start working on the language. For the first point, and then in the second point, I mean Lisa and I had a background discussion, and we also agreed that we feel, like certain type of housings, that don't have the financial ability to do go through this kind of work, and it is on the second point so Jim, maybe I can trouble you. Could you look at like first point and second point? While we continue to discuss and to see based on what we just talked about, we could modify the language to fit. What we want. I think you are right. We are not that far from that. Thank you. Jimmy I'll work on that. Thank you. Jim Connor, hi yeah, thanks for having me and I just I had a question, and you know I'm happy to support with this conversation as I can, because I've also been spending a lot of time on this beefy text. Amendment just Olympia made a point about the building code, the resiliency building codes that are referenced by the construction standards and the you know the flood elevation and things as being required in the floodplain. Is that something that we? Because that's something that I hadn't come across as like all of as like these construction standards being required, and then these being ways to make it easier to do it. I I've been reading it as an opt-in process, but I just had to I just want to ask that question. Thank you. Let me see if Olympia is still here, I mean you don't I. Think I can answer that if you I don't think she is, but there's both there's a bit. There are building code requirements that require some special zoning and not special zoning, but special approaches to the construction that are part of the building code. That's the section d, I think it's referred to in the documents and those are required and what the zoning these zoning changes are supposed to do are to make it easier to accommodate those. So it will say in the, for instance, that you can't put if you're building in the hundred year, Fl Floodplain, not the 500 year. You can't put the boiler in the basement, but it doesn't say that you can go higher if you want to put that boiler on the roof. Okay, that's helpful. Thank you. Elisa, that's right is the questions of like dry flood proofing and wet floodproofing are those do you know if those are required by the building code or those opt-in, I, don't know specifically, to be honest, maybe yeah I mean I, wasn't aware of wet and dry proof I'm from the past, so I don't know on that too and Jim. I'm sorry, I have to go back to you on the language of the second point that we are going to work on. The zoning is not the best tool and subsidy is needed. I think it wants to talk about existing buildings. I want the language to be more explicit, talking about tenement buildings and also why just tenements, not just ten men but also I mean or using them, as example, or and also existing, larger, complex I, don't know what is the right wording because I want to see buildings like Nicaragua, Village and also those session 8 buildings also covered, and maybe traffic can help with that. Well, is there any reason why we need to specify I mean it's every building in the flood plains yeah. It's a hybrid building, I think what you were trying to differentiate is in a single family or you know, small density area. It might be one thing, but the way I worded it in the second point, it talks about higher density. So okay, I think we're talking about anything. You know that I'll make this up anything over. Okay, all of our I, don't think, there's anywhere in ncb3, that's under a seven R7 density 3.66 they are. Thank you listen so should we move to I mean basically, first point and second point is similar: I mean not related, so Jim should we move to. Second, while you are working on the first editing, the first point: if you get I mean if you, if someone can you know, move to, amend it or play you know or insert it somewhere in the resolution, be my guest, I'm still editing the first piece, okay and then let's talk about the second point, then, while Jim is editing, the first point so the second point, basically it is similar to what we just discussed a little bit earlier. We think that zoning is not really the best tool to address this issue, because certain building types are not able to afford that kind of changes in certain compared to larger developers, and we want we propose a subsidy should be included for them. However, I also feel like Bcp is not an agency that gonna deal with subsidies. I mean the language. Is there but I feel like? Is that really something that gonna I mean you put a point out there, but is there something really gonna work for DCP or not I mean other committee members? Do you have any opinion on that? This demands can I just talk or am I hi Damaris I got my camera off cause, I'm starving and I'm eating and I really don't want you people to see me eating. We don't want to see you either. I'm sorry, I didn't even want to tell you because I know it's torture, you know, but you don't really I think that we put that in there not so much because DCP is gonna. Do I think we're giving a rationale right for like what we're thinking what our position is and we're saying. Zoning and you know zoning is not a tool and what we really need is subsidy and by the way, I'm making that assumption, because I can't completely read the document, because it's too small Niko can you help a little bit yeah. Thank you. Sorry about that Damaris. Can you see it I still think yeah I still think that's the case. I think you know we're saying that you know to address this issue. You know it's not zoning. That's gonna be the best tool, but it is you know looking at you know, resources and subsidies, whether you know that doesn't mean we're saying DCP give that it just means. You know we're giving them a rationale for why we believe why we're saying making these comments to begin with. Thank you Damaris. That's my next one I think yeah and you got a point. Okay, great, so I guess point number two just sustained. We don't need to. If nobody wants to change the language, we just keep the entire paragraphs and move on. Okay. Before I move to the non-conforming use, I want to go back to what Olympia just brought up a little bit earlier. She talked about like 100 years for playing versus five years. 500 years for playing I mean I sent that I sent his her notes to all of you before the meeting yesterday. I, don't know if you guys care so much about that part or not. I didn't put that, but if you guys think we want to keep it in the to wrestle, I'm open for it. Okay, so I mean I. This is related, I guess, but you know my I guess. My problem with this in general is just in terms of a climate resiliency like forward thinking, don't know the text amendment that DCP could be doing I just don't feel like lifting regulatory burdens and some of the other things in this text. Amendment are what we should be doing to plan for flooding in the next 20 or 30 or 50 years. I. Guess I'm not sure how helpful this comment is, but it just you know, I again: I, don't think it incentivizes and I hear what they were saying last month with saying you know we have a finite amount of land and we obviously can't say you can't build on the hundred and five hundred year. Flood plains. That's pretty unrealistic, but I just feel that there could be more meat in this. That does more for the people of New York City to better prepare for climate change and sea level rising and not just you know, making it slightly easier to lift HVAC systems and things like that. I think that the city could be doing more and I'm not really I, don't know I, I'm a little bit. I guess disappointed in this. In terms of like a broad forward, thinking, piece of is not legislation but a text amendment to think about climate, resiliency I know it's kind of broad and it doesn't necessarily address the first or second points, but maybe that's more like a whereas clause or something okay, I mean I, like I said before I don't have a very strong opinion on that. I think it is a big thing and just like one sentence doesn't really like have impact or not, but listen are you going to talk about it Lisa? Do you have an opinion on that or no okay? So can you can she hear me Lisa I think you are muted. Are you talking? I am I was muted. Sorry, yeah, I'm sorry, I'm let me think an answer for that. I'll get back to you. Okay, all right, okay and then, in that case we are just going to go to point number three, I'm gonna give you guys some background on it. Basically, it is right like right now, if you let's say if it was a residential use and we caught it non-conforming because it is used as a commercial right now and if the business is not doing and being vacated for two years. The law requires you to be revert back to residential. However, under this new proposal, this new plan, if a place, is declared a disaster area that clock actually stopped for two years, so the maximum you will get four years and the minimum you are getting two years and now so, but then Community Board received a lot of complaints about this non-conforming use from the past. I mean I. Don't have a lot of experience on that, because I believe it's more related to SLA and Lisa used to sit on SLA for quite a while. So maybe Lisa has more thoughts on this Lisa. Do you have any problem with the language? Sorry, I'm no I! Don't have am I on mute. Can you hear me hear you I'm trying to work on some wording? At the same time? Sorry so I'm going off online, but no I don't have any. The issue comes from the fact that there are so many bars and restaurants that are grandfathered in residential areas that have been problematic in our community board for a long time, and one of the ways that we've been able to reduce that number is strict enforcement of the grandfather clause, which says that if that restaurant doesn't continually operate and there's a two-year break in its operation, then it no longer can it can't re-establish itself in a residential zone. So this zoning ordinance would or this text amendment would extend that period for at any point that there was a you know like there is now a executive order that suspends development, so I think the thinking was that we should not allow an extension because it would only add to the number of or it would not help us reduce the number of bars and restaurants that were non-co that were existing in residential zones where they otherwise can't exist under the zoning. Sorry I couldn't make that any clearer, you're very clear. You are very clear: I mean I personally, when I was reading. This paragraph I feel like I, actually wanted to support I personally dislike on my personal level. I wanted to support this pause. However, I don't know SLA enough I, don't I, never really heard about people's complain about how the bars troubling their lives, so I don't want to put myself oh yeah I mean there, aren't that many that are still existing on residential streets that wouldn't otherwise be allowed, but quite a few I see I mean it's just that like to me when I was reading these paragraphs I was like. Oh. If this is a like a declared disaster, I mean we want to support more to the small business and everything, but I guess like I. Don't know enough about like the that these people that the residents complained, but thank you for that. So other committee members, do you have problem with this language? This paragraph, Damaris, I, just have a question. I just want to make sure I understand this correctly, so the current amendment would suspend this two-year period of vacancies to revert back to residential. What exactly does that mean that if the property becomes vacant immediately, it reverts back to residential, it would still have the two years, but the what this legislation says? That is, if there is an extraordinary event like there is now under the executive order of Covid-19, where no construction can happen, then that two years can be extended for as long as that executive order is in effect, so another two years, if I understand it up to yeah up to two years right, yeah, so you'll be four years old. There's the executive orders been in effect for like nine months, so it would be two years and nine months would be the period rather than just two years. You understand is that clear of Damaris it is but I mean I, don't even see that in the text at all, so I'm so confused. No, it's believe me. It's there uh-huh it's in there. It's in the text, yeah, okay! It wasn't in the summary stuff that in the presentation that they made I, don't think. But Demaris do you want me to email? You the it's just not here you're, saying it's in the original text: I got it understood, yep, okay, so other committee members, do you have any problem with this language? If not, then we're gonna move to nursing homes. Thank you Michael. Can you enlarge that part? Please pull it up a little bit higher sure. Sorry, thank you. I'm getting oh I like these are so tiny to me. No it's hard with the screen share because it's not the same size as my screen. It's much better for the nursing home I feel like we don't have a lot of I have heard some people disagree with this point, but then I feel, like most of our committee members seems to be okay. With this point, I mean the issue. Is that I feel like I? Don't want to limit the building or expanding of nursing home beds in our neighborhood and also other supportive housings? That kind of thing I understand the reasoning why DCP I want to limit it, but I also feel like a lot of this issue can be resolved by better planning of infrastructure and also emergency protocol, so, and also like Lisa, brought up a very good point right after last meeting. That hospital is also a hospital requires a lot of support life supporting equipment, but then they are examined in we feel like, even though I mean I. Just imagine if we are going to build something on the infield or two bridges: I, don't mind if they are nursing homes, even though I understand the risk we have to take and I mean I, just thinking like if fraud I can build nursing homes, New York, that's just my point and I want to know if Trevor I just want to add one thing that yeah one is one thing that we're I, think we're kind of missing: is that it's not so much constructing and nursing homes and hospitals along the floodplain along the waterfront, which I think is problematic in its own way, is that you still have an evacuation order. Even if you have safety protocols, evacuating hospitals and nursing homes can be challenging, especially if the storm is not as predictable as a hurricane and I think most cities. They do have them, but they want to avoid putting in a direct line of where you might need to evacuate and I. Don't necessarily I mean I, don't have an opinion one way or another, but just bringing that up about the evacuation portion of it I see. Thank you. I feel like it does not change the way. I want to see the language I mean at this point that does not the committee member have any thoughts on it. I actually think that that's a good part of the text, amendment I, don't personally agree with the way this is written. Just because I don't think you know if there's a flood and people in nursing homes are stuck in a flood zone. That just is like such a logistical nightmare. To try to you know, figure out, evacuating them or you know if they lose power in that building or something like that. So to me it makes sense to stop building new nursing homes in the flood plain, but this text amendment does expand that area and it is, you know, a significant part, I guess of CB3, so you know it's not a hill, I'm willing to die on, but I think it's, okay, that it's in there. Okay, other committee members, do you have any thoughts on it? Okay, then I guess before we move back to point number one I just remember Olympia says something about building walls. Do you guys remember that before she left the meeting yeah? Do you want me to I can address it? I, don't recall what she was talking about, but I have her written notes in front of me because they were emailed out. It's very short just give me one moment. Okay, so she said there could there will also be streetscape impacts due to new flood-resistant construction standards with mandatory wet floodproof ground floors that could detract from the vibrancy of public space, something intrinsic to Cd3's cultural identity. So my only comment on this is I think this is true a true statement as it stands kind of on its own. But one thing is the proposal that they are that the city is brought to us today. Actually, it's not great, but it requires a more active street wall than the actual current emergency standards allow or actually require. So my only kind of response is: it's not perfect because just ground floor floodproofing is kind of ugly by its nature, it's bulky and obtrusive, but this is kind of they have made steps in the direction that Olympia is kind of asking for at least from what exists today. So you know you could ask for more, I'm not sure what they would be, but it's a little bit better than what exists right now. Other committee members, do you have an opinion on that Trevor, just some clarification when you say what exists now? Are you talking about the current zoning that they put in place or the previous zoning? In other words, if let's say this doesn't pass, what would they be required to do if anything with regards to proofing yeah? So that's a good question and I actually really wish. Dcp was here to answer this because I actually am concerned that if this doesn't pass, we might lose a lot of the current requirements because they're all mostly emergency measures. They were. You know the 2013 coastal resiliency zoning text was all emergency and I think there is a sunset on it. I, don't know the date for the year, but I. Imagine if they're pushing this right now. It's probably soon I should know this. I'm sorry to everybody, but I am comparing I'm comparing like the incremental change from the 2013 emergency blood resiliency measures to today, and one of the things they've changed is to try to provide more flexibility on like the street wall, with like how you could have different types of like entrances and transparency and I to get more specific I would have to look at the text again, but I just I know they've addressed that this is a problem, as things exist today, but and I also think what exists today may expire. If we don't pass something new I think that's a big driver behind. Why they're trying to do this Jim is right that I know that the 2015 flood text is set to expire. It's it says in the in their original zoning for coastal flood resiliency document that is set to expire in 2020 and the 2013 text I'll just it says it expires within one year of the adoption of the of new firms which are expected to be revised by FEMA in the next few years, and this is from the document that they wrote a few years ago or actually in 2019, so yeah it's set to expire within the next couple years. Thank you can I just say for what it's worth I mean DCP. When we asked this, they basically said this is pretty much guaranteed to pass right. Didn't they say that and so I think that was the reasoning behind our original idea. To disapprove of this was because we thought that would I don't know, make our comments more visible or something to them, but they essentially told us that you know just to say I guess I, I'm not too concerned about this. Not passing, and you know the points I bring up. I don't think are deal breakers to me. I think it's just you know it's just important and I'm glad that we're doing this again this month, so that they will receive our comments, but it sounded like last month they essentially said this is pretty much guaranteed to go through. Thank you, Mike I thought. If I remember, I mean if I remember this correctly. I thought 2015 already expired in 2013 still have some time to go, and just to put this in context for point number, one or point number, two Jim I remember from last meeting that DCP was saying that 2013, the zoning actually allows, is more relaxed than what they are proposing right now. They actually are more give more bonus square foot in terms of square footage for properties owners. However DCP according to them, properties, owners still wouldn't want to go through the resilience improvement, even with better, more generous, assuming cooks, so I feel like I. Just this is just a contest I want to put maybe on the second point, that to emphasize that certain type of certain scale of properties owners are not able to do it because of the financial consideration, even if you give them like higher incentive, I don't know if it makes sense. Let me try to. Is it helpful if I address those and just everything I'll try to do it very quickly in order, so the first thing was the expiration of the existing flood texts. The 2013 flood text is going to expire when the new FEMA flood insurance maps are issued. So there was some contingency that it's based on the new maps being issued and that's expected in the next year or two I believe the 2015 coastal the recovery text, that's what they called it that expired in 2020 already over the summer. So we that that's all correct what Michael said also is correct. They said: look it's a city-wide text amendment. It has pretty broad support from a lot of the community boards and it certainly has support I think from some of the council members. So it's probably going to pass I, wouldn't guarantee that, but probably and I think you could think of exactly what Michael's saying right. You can frame your response with that in mind. Even DCP admitted that and then the question of like how the incentives are working, because we do have like this model of the program that exists currently in some areas they are making their requirements more restrictive. It's not like significantly more restrictive I, don't think it's gonna make or break someone participating or not participating, but it was things like they capped the amount of like transfer or exempted floor area for commercial spaces to no more than 10,000 feet, rather than like the whole ground floor. So it's just like little tweaks around the edges. It is slightly more restrictive than is allowed today. They also admitted right and I think this is going to get you another point that a number of you have brought up that, despite it being quote unquote like more permissive today, they've actually had relatively little participation in the in this like program as it exists, which I think should point you all to your, therefore about. Why, like additional subsidy, is very important here and that zoning alone, both like it, isn't functional to like achieve this as a goal, but also hasn't proven to do that right, there's actually a track record here. I, don't think that's incompatible with. You could approve the zoning text and say it doesn't work without or you can approve up pieces of the zoning text and say it doesn't work without additional incentive. I, don't think those are incompatible positions if that's kind of like the universe, people are swirling around, so I hope that's helpful, yeah. Thank you, Jim. That is really helpful. I want to know if committee members have any other thoughts because I think Jim have you already finished your language for the first point yeah. So maybe, if you're ready to do it, what I could do is I could paste it in the chat and read it out loud someone's gonna have to this is what we're going we're not really doing this. Procedurally in the right way someone's gonna have to move. You know to insert this at a certain place in the resolution, but I can introduce the language yeah, because my plan is that we all agree on these points and then I would just ask someone to introduce it to motion that and move that all the points to the wrestle. Okay, so I'll copy this, and I'm going to recommend that you just in input both of these as whereas clauses after the like bullet point list of the regulations. So I'm pasting them in the chat now and I'm going to read them. And let's see if this matches what everyone was hoping for. So I'm saying, whereas these regulations rely on floor area, exemptions to facilitate the flood proofing of ground floor spaces and to encourage the elevation of mechanical infrastructure in new and substantially improved buildings. And while these exemptions can not exceed the ground floor area of the building, it does provide owners with an opportunity to move one floor of developable floor area to a higher elevation. And whereas these regulations are easier or highly capitalize. New developments to take advantage of and the same regulatory incentives are not as financially viable or existing building owners, which may further exacerbate built fabric inequities in Cd3, with newer buildings having stronger, resiliency infrastructure in place. A lot of this was just copied and pasted from what Olympia sent in and what Lisa wrote and so trying to incorporate everyone's language into that. Here's, the problem, if we do it this way because, like in the beginning of the meeting, we agree that we are not changing the way as the existing, whereas clauses we are not adding more. We are just putting the comments under the resolve, but if we are doing this, like the this format, right now like provide way as clauses to each be resolved clauses, then we have to address clauses to each other points. Well, you know their clause has to have an act. An actionable position right, I mean where what was submitted here was more of a the community board's assessment of the or description of the efficacy of the program. I mean you can change it to it. Therefore, but I don't know what like? What's the ask there if it wasn't there for I mean I feel like the hearing is that we not rely exclusively on zoning measures and also prioritize. You know direct subsidy or tax incentives or whatever to make this viable for all types of buildings. I mean I'm happy to change it to her. Therefore, if someone can you know, no, it wouldn't be the way we wrote. It was that there would be one therefore, be it resolved that we're opposing based on the following concerns and observations. So those points that you've raised would be the concerns and one of the concerns it would be among the concerns and observations. Okay, so I misunderstood, so basically there'll be kind of like a bulleted list of like the rationale for why we have taken this therapy. Exactly. Okay, then ignore that I wrote whereas, but you can use that text and edit it. However, you know, however, and I'm also gonna, test the water, because I don't know how you guys think about it, because from what I heard from all of you are we going to stick to the same position or you guys are comfortable to change the position a little bit or you guys think it's okay. We can continue to disapprove this wrestle and just add these comments why you sorry Lisa go ahead. Oh I'm I! I'm sorry, I'm just talking out loud, I'm fine opposing it, but I think we should have as one of the observations something to the effect of that. Although the this zoning text amendment is well intentioned in its effort to address critical issues in New, York City's, climate change, something to that effect, my only quick comment and I will be quiet after this is you know, you're free to reconsider the position you've taken, but I would recommend that it's probably easier to do that once you've agreed on some language. You know you can look at the resolution as a whole and see if it's something that's worth approving or disapproving, but it's I feel like it can be a little confusing to do it, while you're actively crafting the actual language. So okay people could think about it, but I would maybe wait just because it's hard to do that. I think right, you're right so Jim will wait for your paragraphs and then we're gonna move to insert those language to the result and then decide. If the position should can you just? Can you insert what I pasted in the chat and just take out yeah I? Can people see the draft reso on the screen, or is it still the other the point about the nursing homes? Okay, one second I need to change. My screen share. Okay, I just dropped in those two paragraphs and took out the, whereas is but I think we have a few more I. Don't know if people are comfortable with this formatting, it's a language that Lisa provided earlier so that point Lisa added. Are people should I put that as a number three? No, it should be number one I think number one. Okay do we have do you have that paragraph CB3 is concerned that paragraph no yeah, no, that's I, think he's talking about the one that qualifies, although yeah I can send it. I can thank you. It would just be an intro to one or the other of these I think I see you've written something like that in it's the second in Jackie's document. Yes, there, it is again just leave off I didn't mean to yeah at least this nice right yep. The one Lisa dropped right now right. So we want that to be aware as or we want that to be point number one I want that to be Aldo, but not with the last after the comma. Just leave it well, we don't need to use the word auto. Just Cc is well intended so skip remove. Although the and then put it as point number one. Okay, oops gotta, do a little grammar change there addresses to address. Thank you. I need a for to see that looks good, sorry, Jackie. What did you say? No, it's! Okay, I was just joking, I mean like because that is too small. I can see it really well. Oh I can zoom in more I wonder if you have options in the way. You view the document yourself. If you look up at the top of your screen, it says view options, and if you drop that little arrow down, you will see doom ratio- and you can you know if you have trouble watching you can zoom it up to 100, I, see 200 and you'll be able to see it very well. Thank you. That's why you are the zoom master. That's right! Thank you! I! Don't want to be a master though, and I don't want to be the zoom mistress either. Did we so the point Lisa posted at 7:30 a little bit higher up in the chat? Did we want to put that in as well yeah? That was intended to address your point Michael about you know this. There is a bigger question about whether we should be just addressing issues of buildings in the floodplain and not thinking broader, about I, really like this point, but I'm not sure how other people feel if they're comfortable, adding it in I like it. Okay, should we do it as maybe number four yeah. This is a very silly question that I should know, but do we format it this way, CB, no CB3 yeah. We just use Cp3 yeah and sometimes we're saying Cd3. So should we say CB for like that for all of them yeah. There was some determination a while ago. That was what we would standardize on. Okay, just CB space, three yeah cool. The only thing is if this is citywide, that's why I did Manhattan in there once yeah. If there is a CB3 in all five boroughs? Oh it's true and Mike. Can you take the points from other file and put it there, so we could take the conforming and also the nursing home and move it to this file. Sure yeah, let me see the point about non-conforming use. Yes, are we comfortable just with this whole paragraph? I mean I, ask everybody if everybody has any thoughts about it looks like people are comfortable with it: okay and then the last the nursing home point as well right and nursing home. Okay, I'm sorry am I sharing the reso. No sorry about that there you go that's good, okay, so I added those three points, so maybe we did it do we have that second point in the wrestle regarding oh strange Sonang is not the best tool. Do we have that here? Oh no, you're right! We don't so we still need a couple more minutes. Yeah can I I'm getting a little confused because I think I've looked at too many versions of this I want to drop something in the chat that you could consider. If you want I, think actually Lisa wrote something better, but I can't find it right now, but so I'll I will drop something in about this and use it. If you want to I can drop it again mine. Why don't you do that because it's like I send your language to everybody already, so why don't you drop it? I can I. Have it just that document in the matrix, the zoning may not be the best way to address particularities yeah. Did we want to put it as number three in the list or does it matter should I just put it at the end? To be honest with you Michael, we need to read everything so I. Okay. To make sure the order is the flow is good. Okay, yeah! Do you have something to say? Did you raise your hand? No I didn't mean to I'm sorry, that's okay, so I think we have all the points right. Yeah so can I Michael can I trouble. You maybe just read it out and then we decide. If there's any changes needs to be made. Do you want me to read the whole? No just from the therefore be resolved. Okay, yeah! No problem just move the chat box. Okay, so it says, therefore be it resolved community board. 3 disapproves of application, N21009 5z Ry, the zoning for coastal flood resiliency citywide Zoning text amendment with the following concerns and observations. The Zcfr is well intentioned in its efforts to address critical. The critical issues New York City faces as climate change and coastal risk threaten a significant portion of the infrastructure of our city, including a very vulnerable portion of Manhattan CB3, and these regulations rely on floor area exemptions to facilitate the flood proofing of ground floor spaces and to encourage elevation of mechanical infrastructure in new and substantially improved buildings. And while these exemptions can not exceed the ground floor area of the building, it does not provide owners with an opportunity to move one floor of developable floor area to a higher elevation, and these regulations are easier for highly capitalized. New developments to take advantage of and the same regulatory incentives are not as financially viable for existing building owners and may further exacerbate built fabric inequalities in equities in CB3, with newer buildings having stronger resiliency infrastructure in place, and zoning may not be the best way to address particularities of the various neighborhoods most at risk, and particularly, it does not address the needs of higher density. Existing buildings which are not required to renovate and which, because they may house low and moderate income residents, do not have sufficient funds to make the significant investments in resiliency improvements that the Zcfr permits to accommodate really to accommodate real resiliency in our communities. Subsidies would be necessary and CB3 is concerned that, because the Zcfr concentrates on issues related to development in the floodplain, however, there is considerable thought that, because of ongoing climate change, development in such vulnerable areas should be curtailed and redirected to more sustainable areas. It behooves the city to think more comprehensively about this question and CB3 is concerned about the provision of the Zcfr relating to grandfathered non-conforming commercial uses in residential districts, section 65-13, dis, continuance provisions. Cb3 has had a large number of complaints over the past 10 years because of a conflict between businesses and residents caused by grandfathered non-conforming commercial uses on residential streets. Examples of this are generally bars. Open till 4 am on residential street, I'm going to say sorry until 4 am on residential streets with bedrooms on the street. This was caused by a lack of enforcement to zoning regulations. For many years, this commercial use reverts back to residential use, providing much needed housing when vacant. For two years. The current amendment was to spend this two-year period of vacancy to revert back to residential and CB3 objects to the provision of the Zcfr, which imposes a particularly harsh restriction on nursing homes. Nursing home beds are needed, Sorry Lisa, do you have something yeah, I'm sorry, I shouldn't have interrupted, but I. The last sentence of number six I, don't think is what we mean. The current amendment would not suspend but extend the two-year period of vacancy, correct, yeah. Sorry, no problem, CB3 objects to the number seven CB3 objects to the provision of the Zcfr, which imposes a particularly harsh restriction on nursing homes. Nursing home beds are needed in community district 3 and limiting their expansion on the floodplain would rule out a significant part of the district for potential expansion of this important use. Other critical medical facilities, such as hospitals, community health clinics and supportive housing are not limited by the Zcfr, and the risk imposed to nursing home facilities located in flood prone areas should be mitigated by emergency protocols and infrastructure upgrades rather than zoning. Thank you. Michael I have two comments. First is for point number four, the last sentence before to I think that is a space that need to be removed and also for point number. Five. Thank you for point number five I feel like point number. Five goes back to our very early discussion. Whether this plan, spurred more development or not I, mean you guys, can talk about the language I feel like the language. That's the language like implying that or you guys, okay with the language, no, I'm okay with the language, because I don't think this implies that you know there's. No. This isn't saying like it encourages. You know more development. It's just saying that you know there's a line of thinking that says that we shouldn't continue. As is sorry, my dog is going crazy. We shouldn't continue, as is in high risk flood areas, and so this is just addressing that. It's not necessarily saying that this like encourages over development, or something like that. My original wording did but I changed it to take that out. Just saying that, okay, maybe I, was still reading, yeah I think you were looking at the old word, no one yeah, okay, other committee members, do you have any comments? Other comments about the Hi Jackie hi Herman on in for that last line? You were thinking about sentence and it said subsidies would be necessary. Are we talking about subsidy, new construction or for subsidies to existing housing? Something like that. You wanted to be more specific. Is that what you bet that I was thinking about in terms of being more specific of who would need this? Maybe because we say that it, maybe we could say to accommodate resiliency in our community subsidies would be necessary, especially for those low and moderate income developments, or something like that and small property owners. Oh so you wanted to be more specific for small properties owners. Is that right? What you meant? Yeah I see because the reason I'm saying that I mean my three buildings right and some of the things that is necessary near was done on those buildings, but it's not because of they would be this program, it's only because it the is Herman Frozen looks like it and those needed subsidies, Herman I, think we lost you because your computer just frozen. We lost you a big part of it, yeah. Okay. What is you hearing me now? Yeah I said that the buildings that conform to this in terms of was done not because of we were considering about flood floods, but because the property was being built on places where the water table was too high. We couldn't do that, so we put all those systems on the roof, but during sandy two of those buildings we needed subsidy for those affordable house buildings in order to conform to this kind of system. So that's exactly the point. This is trying to make I, don't understand what I would say just to be, it's not strong, be specific I would get the subsidy, oh. So the sentence before says, because these may help slow and moderate income residents there are not sufficient funds available to make this investment to accommodate real resiliency in our community subsidies would be necessary. Yeah. Something like that. How about this Herman? If we add to accommodate real resilience, improvement or resilience construction in our community subsidies would be necessary. Would that be more specific for you or is too redundant? No, it's okay, except I'm figuring. Suppose I want to develop a new building and I could afford to do that. Doing new building right and for new buildings. They're a private developer would that subsidy go to a private developer? Who would develop their buildings from the start and they would include the expenses for providing I think throughout our discussion. The subsidy was is intended for the existing buildings not really for new buildings, but I guess other committee members can that's what I'm asking? How could that be put in there so that we know that a big developer wouldn't come in and say? Well, I'm going to do that because you asked me to do it: I need subsidy from the government or somebody well. I. Think number three addresses that right and number higher four existing buildings yeah, not new development yeah, so the language already covered that Herman like to make sure existing building owners. We want to encourage the government to fund the resilience construction for the existing building owners like tenement buildings in low East side or attendant buildings in this village. That is what we want to encourage, although DCP may not take that road, but, like demerits said before you provide a contest Damaris, you have a point. You have a question yeah just gonna say that I mean I'm not sure. You know that at this point having that discussion is really going to change anything, because we, this is regarding zoning and we're writing to DCP and we're just providing them with I think a rationale for why we're not supporting their zoning recommendations as they stand. If we were sending this to HPD or to an you know one of the city agencies that may be able to provide some kind of resource subsidy, then I think we, it makes sense to spend time and be thorough yeah, but we don't expect that they're going to adopt this. We just want them to understand why I am I agree. Thank you. So I think we are done with the wordings, and now it goes back to our position. I want to ask everyone again. Consider everything was discussed before us. Do we still want to I mean I, really, don't have any thoughts about that? Do we still want to disapprove this application or take a more nuanced position or I mean something like that. I mean I want to open this for discussion right now, I would like to disapprove in jacket, and if we try to change, it probably have three more hours to go. No, first of all, no first of all the comments. We are not changing the comments anymore, but I respect your point to continue to disapprove. It I don't have any problem. I just want to tell you that if we are changing the position, it will not and be another three hours is only gonna, be like two minutes, maybe I, don't know I mean, but I don't want to hear from you guys. May I ask. Is there a reason why you're asking us to reconsider this that we voted on? Yes, what is it that you're suggesting? And you know no, the reason I asked that question is because, first of all, we are allowed to change that because we didn't adopt any position in the last full board, so we are allowed. That is first thing in my mind, and the second thing in my mind is what Michael brought up a little bit earlier, that this has amendment probably gonna pass anyway. So and that's why I want to bring that question to the table again, but we don't have to if you guys choose not to I just thought that I want to bring it to your attention. That's it may I make a comment. Then I don't know that well for me, if whether we voted or passed the last time, I thought that at the committee level, we had agreed that we disapproved it, which is why we're having this conversation now and writing out this rationale so, to some extent, I'd really like to honor that but I understand that folks want to take up. You know the conversation and change it with that being said for me that they are going to pass it anyway is not a rationale. I think at this point for changing it. Unless we think that you know not changing, it puts us in some a weaker position moving forward in the future, for some reason, and that's not a position that we want to be in I, think if that is okay. If that is not the case, I say we leave it, and we put on the record that you know this is our position and I think we've, given them plenty of meaningful feedback as to why we think this and they're going to do what they're going to do at that point, but at least they know this is where we stand so that if we ever have to go back and look at or defend or recommend, we have these. You know points to reflect on I'm. Okay with that embarrassed. Other committee members, to you guys feeling the same way or have different thoughts. Michael is agreeing with Damaris I agree, okay, Dominic agree, so it looks like we have quite a few fox and Linda I would just say that maybe slightly disapproving would get a little more attention than approving okay. So you also disagree. Okay, that's good! So I we are not changing the position. That's good. That is just makes my life easier. So at that point, I need someone to motion that we adopt this position and also with these comments, don't move. Thank you any one. Second, thank you. Oh, we have to do roll calling or do we just yeah I think we need to do roll calling closing yeah. Let's do that so, like I, thank everyone for making the contribution to this wrestle last month. I think we, under our understanding with this wrestle, was very much different and I. Think with one more month of time, we were able to do a lot of more reading and study on the issue and to come to this conclusion and I. Thank everyone who helped me getting the wrestle done, and this is almost the end of the meeting. So I'm just gonna say that this role calling is going to be together with the motion to attend the meeting, so that would be just easier for everyone. Michael. Thank you Jackie! Yes, Linda! Yes, Michael, yes, Dominic, yes, Jonathan I think he left. You left. Okay, Herman, yes, Trevor! Yes, Lisa! Yes, Olympia she's gone Damaris, yes, Troy! Yes, thank you! Steve is not here right and Tim is not here right. Thank you. So the wrestle is passed and we are joined for tonight. Thank you. Everyone great! Thank you for all the help. Thank you, okay, good night, thanks everyone good night. Thank you, Connor for joining us tonight, good night. Thank you good night. Thanks.",
            "summary": "And next item is the dcps application for the citywide zoning test, amendment on zooming for coastal flood resiliency, and there are a couple points.\nThink one of the concern we have from last meeting is that we thought that these zoning change would incentivize and encourage a large new development in our area in our district.\nAnd I want to hear Jim's opinion and also Trevor, because I feel like after the Scl is done.\nEveryone understands what me this first item, actually Jackie and I, just kind of went back and looked at the transcript from last month and tried to make kind of trying to aggregate what we were hearing from people and put it together in what could be an amendment you know to the existing base.\nI mean I think this would probably be something that could be added as like.\nI'm, not sure certain that extra height you know, without, like the addition of you, know, significant developable floor area is alone, going to encourage a developer, who you know wasn't going to build in the floodplain to now say: yes, This is financially viable.\nI, think that is the kind of key incentive here that it largely only encourages resiliency measures in new construction.\nI just want to echo Jackie's point that I feel like they didn't emphasize this enough.\nYou look on the map that DCP provided last month, there's currently a smaller area of buildings down there in the flood, plain.\nTrevor I just wanted to piggyback on your points that I actually had a conversation with Jim on that I use, Nika Baka as an example for the discussion and like I, guess like to encourage them to move the mechanicals to their to the top of their building.\nTheir basement looks like they can convert that for more commercial use, but then I also think that I mean most of these affordable housing, complex.\nI, didn't put this in the points, because that was just a private discussion between me and Jim, but I just feel like, Since you bring this up.\nThis is a clear incentive and it goes to private development of new construction, and it makes it more palatable to construct in an area that, as a city, We know we'd rather think about it more before attracting new developments there, because it is a flood zone and because new development does impact already vulnerable populations that live, there, and so I clearly see this.\nIn order for the zoning to not contradict the law, That is the building code right, So the building code has been updated, because this is a flood zone and after Sunday we know what that means the same way.\nWhat we are against is the idea of these very obvious subsidies that are in there, and the second thing is that the building code is currently I, Think Monday mandatory only in the 100 year flood zone and.\nSo I believe the best way to do it is to make it a mandate, and then, If there is low income construction, you subsidize, but you actually want to make sure all the communities have equal safety from flood and about the ESCR comment.\nAnd, If they're going to do anything in the harbor is a permanent solution, So I feel we need to always build with the understanding that there is a you know, climate change, and if it's not the river, it's going to be extreme rainfall.\nThink the point here that says it encourages large development.\nYou know, I, Don't think that this there are four area exemptions, but they're, not massive and they're, not like bonuses or something.\nDifferently, because, like Olympia just said it doesn't make sense that this legis or this you know this text amendment will in a way be easier for new construction, which is you know, especially in our district, usually very different than like a.\nMichael I want to hear from other committee members I'm just not sure that if I agree with what Olympia said before how this would reduce the cause for the developers to do the resilience, improvement, I, don't think she was saying it would reduce the cost.\nSo I think we want to maybe be more precise with that language, but I also don't want to dismiss I think what Olympia is saying is absolutely right in terms of how it this policy kind of privileges, certain building, typologies and type development, right.\nDon't think this alone will trigger new development at a significant scale, but I do agree that you know a like higher capitalized developer is much more likely to do this than the owner of an existing.\nAnd actually, If anything, based on how limited the actual incentive from the city is financially right, you know, then there's limited subsidy available, Besides this, We talked about that with Stephen earlier meetings, so I think you might want to say something.\nFor, the first point, and then in the second point, I mean Lisa and I had a background discussion, and we also agreed that we feel, like certain type of housings, that don't have the financial ability to do go through this kind of work, and it is on the second point.\nAmendment, just Olympia made a point about the building code, the resiliency building codes that are referenced by the construction standards and the you know the flood elevation and things as being required in the floodplain.\nI'm from the past, So I don't know on that too, and Jim. I'm sorry, I have to go back to you on the language of the second point that we are going to work.\nI think it wants to talk about existing buildings.\nLarger, complex I, don't know what is the right wording because I want to see buildings like Nicaragua, Village and also those session 8 buildings also covered, and maybe traffic can help with that.\nSecond, While you are working on the first editing, the first point: If you get I mean if you, if someone can you know, move to, amend it or play, you know or insert it somewhere in the resolution, be my guest, I'm still editing the first piece.\nWe think that zoning is not really the best tool to address this issue, because certain building types are not able to afford that kind of changes in certain compared to larger developers, and we want we propose.\nZoning and you know, zoning is not a tool and what we really need is subsidy and by the way, I'm making that assumption, because I can't completely read the document, because it's too small, Niko.\nMy problem with this in general is just in terms of a climate resiliency like forward thinking, Don't know the text amendment that DCP could be doing.\nI mean I personally, when I was reading, I feel like I, actually wanted to support.\nI feel like we don't have a lot of I have heard some people disagree with this point, but then I feel, like most of our committee members, seems to be okay.\nI understand the reasoning why DCP I want to limit it, but I also feel like a lot of this issue can be resolved by better planning of infrastructure and also emergency protocol, so, and also like Lisa, brought up a very good point right after last.\nI mean at this point that does not the committee member have any thoughts on it.\nSo to me, it makes sense to stop building new nursing homes in the flood plain, But this text amendment does expand that area and it is, you know, a significant part, I guess of CB3.\nI thought 2015 already expired in 2013 still have some time to go, and just to put this in context for point number, one or point number, two Jim. I remember from last meeting that DCP was saying that 2013, the zoning actually allows, is more relaxed than what they are proposing right, now.\nI want to put maybe on the second point, that to emphasize that certain type of certain scale of properties owners are not able to do it because of the financial consideration, Even if you give them like higher incentive, I, don't know if it makes sense.\nAnd I think this is going to get you another point that a number of you have brought up that, despite it being quote unquote like more permissive.\nToday, they've actually had relatively little participation in the in this like program as it exists, which I think should point you all to your.\nIf committee members have any other thoughts because I think Jim have you already finished your language for the first point.\nGood, sorry, Jackie, Okay, I was just joking, I mean like because that is too small.\nThere is a bigger question about whether we should be just addressing issues of buildings in the floodplain and not thinking broader, about I, really like this point, but I'm, not sure how other people feel if they're comfortable, adding it in.\nI mean I, Ask everybody if everybody has any thoughts about it looks like people are comfortable with it.\nYou want I, think actually Lisa wrote something better, but.\nI think we have all the points right.\nI, think that is a space that need to be removed and also for point number.\nI feel like point number.\nWith, the language, no, I'm, okay with the language, because I don't think this implies that you know there's.\nLooks like it and those needed subsidies, Herman I, think we lost you, because your computer, just frozen.\nSuppose I want to develop a new building.\nThe subsidy was is intended for the existing buildings, not really for new buildings, but I guess other committee members can that's what I'm asking.\nYou know that at this point having that discussion is really going to change anything, because we, this is regarding zoning.\nI mean I want to open this for discussion right, now, I would like to disapprove in jacket, and if we try to change, it probably have three more hours to go."
        }
    }
}