{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UCUR3i_hvk3-3i8vtrPg6v1Q",
            "title": "Transportation Committee",
            "publishDate": "2020-10-14",
            "shortDescription": "",
            "lengthSeconds": "2:08:40"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "L0RREjlsUcA",
            "fillerWordCount": {
                "uh": 295,
                "um": 402
            },
            "readTimeFullTranscript": "76 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "helicopters": 33,
                "street": 27,
                "traffic": 25,
                "bill": 24,
                "parking": 24,
                "vehicles": 21,
                "space": 20,
                "safety": 19,
                "helicopter": 18,
                "noise": 18
            },
            "wordCountSummary": {
                "helicopters": 9,
                "street": 9,
                "safety": 5,
                "cars": 5,
                "parking": 5,
                "crosswalk": 4,
                "space": 4,
                "situation": 4,
                "ways": 3,
                "vehicle": 3
            },
            "fullTranscript": "Howard, can you hear me absolutely oh, but I can't hear you can't hear me having trouble with the sound on zoom today. Can you hear me now? I discovered that if I use the, can you hear me now hear me now. I can't hear you now is not one of those old commercials for a wireless service when something like that. It's get smart right yeah. So I can either I can either my default microphone. Can you hear us yeah? Unfortunately? Yes, hello, hey doug, hey Doug, oh god. I can't hear a thing andrew how's, your hearing and talking. So I guess you guys can hear me now right. I can not hear you and yes, you can't hear me now. Yes, I can hear you. I can hear you. I can't hear Andrew. Okay, now you cater any of you. I do not know. Are we going to say anything if somebody gets a fly on their head? No, we'll do the pence thing. I thought on the agenda this week we were going to talk about the road, the rogue motorcycles and that's what we said at the last transportation committee meeting. You know that was put on there in error. We, the idea, was to have someone from rebel come and speak and we'll probably have that rebel. But this for this meeting we do not have anyone. If we want to quickly talk about it under new business, we certainly can, but it was not rebel. I was that was last week bro, you know I actually was going up 6th avenue on a CitiBike and it was deafening and really scary. I had to pull over to the sidewalk and wait until this caravan passed. Yeah I'd never seen it are we starting our meeting already at six? No we're just chatting great, because I know there are a lot of people who want to talk about Revel and about the helicopters. It'd be great to include them. In that conversation too yep, you know Elizabeth. I just asked yeah last meeting we were talking about these rogue motorcycles and I thought we were going to have it on the agenda tonight. So just asking why it was not on the agenda. That's all well, what's what is the? What is the exact issue if we put something on the agenda, it's usually with the idea to have a resolution regarding it an action item. What's the action item? Well, you said in the meeting, because I was looking at the video from last just to see that my memory was serving me that we wanted to talk to the commanding officers, possibly about what they can do, even though, because they understand it's, a policy city- wide not to pursue, but maybe there are other ways to to stop they're not scheduled to attend this meeting. So maybe for our next meeting. We can get them to attend and put that on. I could not agree more that that's something that we should grow them on. Absolutely: okay, fair enough! Thank you all good. Okay, let's see what we have done. Can you guys hear me now by the way? Yes, you can hear me. Yes, okay. I have solved the problem for now, although so folks we need a volunteer to take minutes tonight. We have been a little remiss thinking that the recording was enough. It should not be that complex. Can somebody do that? For us who has not done it in a very well nobody's done in a very long time, but let's see what do we have here? Helen is here we have 12 people who has who has done minutes in the past. Just raise your hand, okay. Well I have, and quite a few have bill. Would you be willing to do the minister tonight it's a little difficult for me right now. My computer is not working, I'm using an ipad. I do not know how to jump between screens people recording yeah. What, if you just did the record watch the recording afterwards? Would that work for you? I can do it. I can do it do not worry. That seems like a lot of work I'll. Do it yeah we've tried for a long time to have the minutes of our meetings that are recorded since we're recording this meeting thanks to a lot of the work we've done. It's just transposing a lot of that. Hopefully we can have somebody do that in the course of the next couple days, pretty simple yeah, it's all right, I'll record it it's all public. So it is. It is, but it means living reliving the meeting again while we envy that okay, we should probably start welcome to October transportation committee, Andrew, Albert, Howard, Yaris, Co- chairs. Item number. One is discussion of a resolution supporting a bill in the New York Legislature S07876, which would assign pedestrian safety rating for every motor vehicle model. Howard. Did you want to speak about that? Actually, that's Ken's issue. Ken knows all this issue. Okay, so Kim will speak, I'm not totally familiar with the bill, but I'm sure ken is not totally but I've read it. First of all, I wanted to say: welcome back to meg. Yes, absolutely hi everyone nice to see all of you here good to see you thank you. It's actually s7876, there's no o there. Oh there is in the result in the in the thing that we receive, but okay, good yeah. I do not know how that happened, but it it's a bill. That's introduced by state Senator Gunnardus, who represents portions of Bay Ridge and what it would do is create a pedestrian safety rating for motor vehicles that are registered in the state, and this rating would be posted on the dmv's website. It'll be similar to crash test ratings that the federal government I believe, mandates, but rather than just telling people how they would be protected it as occupants of a vehicle. It would tell the potential buyers of a vehicle what threat the vehicle that they were considering buying causes to pedestrians and cyclists and Ken. Who does that rating? I would be based on crash results from New York state. Let me get the wording of, and vehicles that have the automated anti- crash technology, which stops the vehicle prior to getting too close to another. I would assume, would receive amongst the highest ratings yeah. They say feature safety features that the commissioner determines are relevant to pedestrian and cyclist safety, including, but not limited, to automatic collision, warning or pedestrian detection features. Automatic braking and visibility would be taken into account and or any other factors. The commissioner determines are relevant to pedestrian and cyclist safety. It will be made. Is there a co- sponsor of the bill in the assembly? Yeah? I believe. Let me I should have gotten that. Let me see if I still have it up. I know. Brad Hoyleman is a Liz and Liz Krueger are co- sponsors in the Senate uh- huh. Actually, I do not know whether there's a companion assembly bill. Okay at this point there may not be the main reason for doing it is that we have a proliferation of suvs on our streets in a congested city and while overall deaths in the Us traffic deaths are dropping. Pedestrian and cyclist deaths in the Us are rising, and it's believe that one reason for this is the the rise of suvs suvs. There are four reasons why suvs are more dangerous than regular sedans one is they're much heavier two is they have a blunt front, end design that when it hits a pedestrian or a cyclist, it's more likely to kill them twice as likely, in fact, and also due to the front profile, there's a blind zone so that somebody who's up high and has this long nose in front of them. Wow we've been able to get rid of that blind zone on buses, and we can't do it on suvs, huh right. Well, there's too much of an engine out there. So you think that stands for some ugly vehicles, yeah or some other word for you, yeah there's a dozen children can sit in front of Cadillac Escalade and not be seen by the driver and then finally, drivers, high higher driving position means that they're like more likely to drive faster according to the Insurance Institute for Highway Safety. So those are the main four reasons why suvs are more likely to kill and to injure and, of course, their weight as well. I would imagine yeah. That was the first thing I mentioned, and also the rideshare that is going through most of the rideshare that is going through our city in our neighborhood. Right now is those types of vehicles, so those who want rideshare also have to deal with the fact that they are large vehicles, as you said, can so how do we deal with that right and if we do not get help for the MTA, there may be a lot more ride shares out on the street yeah, and this is just disclosure. This is not trying to prohibit anything. It's just so. People know what the situation is. Yeah, it's public information yeah. I have a motion to support this for a resolution to support this legislation. Is there a section my hand up? Oh I'm, sorry Jay. Unfortunately, I entered the bill number and I got a totally different bill. So I have not read it. Can you read it? Does it apply to trucks, buses, every vehicle motorcycles? It just applies to. It applies to motor vehicles, so whatever is in the vehicle traffic law yeah? Presumably, that would include trucks and motorcycles, okay, a motor vehicle being anything that has a license plate on it. Technically, I think a motor vehicle by definition has to have a license plate well, so that a rebel would even be part of this yeah motor scooters are vehicles. I would guess that their pedestrian safety rating would be less than a cadillac escalade so can or. However, I do not think we should make the judgments on science. I think we need to leave that too, but it's just a disclosure of what equipment is on the vehicle. It's not a requirement to have anything now: correct disclosure. Yeah. My point is just disclosure, I think whatever we do. We need to just make sure we're following the data in the science on everything. That's all would this have any impact on insurance. It would have no direct impact. I guess if the insurance industry wanted to start paying attention to these things, it's conceivable that it could affect rates, but no, I think, there's already a federal requirement that requires the manufacturers. We've seen the stickers to disclose all the equipment. Anyway, when you apply for automobile insurance, they have usually a list of what safety devices you have and so forth and so on in order to underwrite the particular policy. So to some extent, this bill is redundant because this stuff, I believe, has to be disclosed by federal law. Well, this bill would quantify. It would be, I believe, a five- star rating system, so you could also make it more apparent to the consumer right. Any other comments, I think someone said they wanted. A question, have a question that was me my question yeah. I just posted both the link to the bill and the text of the bill in chat it excellently sent before I got rid of all the line numbers, so you can ignore the 13 through 18.. But again I want to propose a resolution to support this legislation. Yes, it's been moved. Has it been seconded? Yes? Okay, let's vote wait. A second is there? Is there anybody in the in the public that wants to comment on this before we start taking votes? No hands are up, I'm just curious, and I agree with Elizabeth to follow the science, but this is just I'm just curious if smaller vehicles sedans are, would also you know, because of the shape or blind spots might surprisingly be dangerous vehicles in addition to Suv. Yes, blind spots are dangerous about that. Well, they're, going to make the determinations not based on what they think is safe, but what the evidence shows in terms of crash actual crashes yeah, as the tech says, it's the frequency of collisions involving a bicyclist or pedestrian reported in the state for such motor vehicle model compared to the total number of such motor vehicle model registered in the state and then also the safety features that the commissioner determines are relevant. Paul Fischer just posted a question which says: how will this affect vintage vehicles which presumably do not have the latest and greatest that more modern vehicles? Have, I think it would not. It would include all vehicles if a model T Ford is involved in a huge number of pedestrian crashes. It would get a higher rating, but if someone's still driving one of those, I would be very interested. I think it's also in the context of a sale is not it. No, it is not. I think, Lisa is wrong in posting, as my read of the legislation says, for every motor vehicle model registered by individuals, so it's data about existing. So how would it be? Who would be providing what to whom? Presumably, if I understand the bill correctly, what they would be doing is looking at the crash data and then determining how many of those crashes involved the categories that Ken just mentioned and then correlating that to the make and model of the vehicle. So almost by definition, vintage vehicles would not be anywhere near the top of that list, because there's so few of them on the road that, even if every single one of them were involved in a crash, it would not compare to the Cadillac escalades that were the topic of conversation earlier. But in what context would this information be given to people how's the bill? Where would this rating appear? It would if the bill says it would appear on the website a dmv website. Okay, oh so somebody would actually have to go, know that and go to the website yeah effectively. It's a data. It's an open data bill who determines the rating the dealer, the manufacturer, the dmv would not be the manufacturer. You can be sure that I think it's the dmv. I think the bill the legislation calls for the dmv to do this does not it. Ah I mean until this is public until they've actually surveyed every vehicle. That could be quite some time. So the the resolution has been made and seconded. Are we ready for a vote? Yet I I'm reading the bill and it says the commissioner shall cause to be created a pedestrian safety rating system on the department's internet website. So it is the in fact the energy commissioner dmv itself would be compiling the data. Does anyone know what the dmv's position on this is, whether they can do it or whether they want to do it? But they do not want to do it whether they can do it. Anybody know. Well, I think you're asking. Are they in favor of more work for themselves? I'm going to take a wild flyer on the answer to that one, but I kind of had that in mind myself, but I think our decision is it a worthy thing for the for them to do. Yeah I think you know, knowledge is in from information, is knowledge and if it makes you if it has buyers, make a more informed decision on which vehicles they might want to get. I think it's all worthwhile, but ken one thing you did not mention: does it rate safety on accidents versus other vehicles or just pedestrians and bicyclists? This would just be pedestrians and bicyclists according to the bill. Okay, I would imagine I would imagine a manufacturer would enjoy bragging rights if they were listed, they were highly rated yep. You can be sure yeah, that's part of the idea. Are we ready to vote yeah? How do you vote? You want us to be on a chat or raising our hands can't be on chat. So, let's do, let's just do a raise of hands participants! Oh yeah! I do not see the raised hand feature on this now for some reason: it's disabled because you're co- host Andrew, so you have not you and I do not see it. I'm racing. So I see four virtual hands and Doug Andrew Howard, Elizabeth and William is five richest. Six. Is that everybody? Six plus four is ten. So that's ten all right! So, let's lower hands, Paul Fisher says no. Okay is Paul a member of the committee. I do not think so. Yes, no, I thought he was no he's come to every meeting. I thought he was. I will tell you right away. Sorry, I should have the answer to that. I do not think so, and the answer is no. He is not oh, okay, glad to have him just the same, but not a member of the committee. Okay, so hands down now all those committee members in fa opposed rather who those against I do not see any hands of either variety, all right. So ten to zero anybody abstaining. I see one hand okay and okay and then nobody's ineligible for cause, so I have ten to zero to one to zero and then non- committee board members in favor. Let's see so Paul you're you're going to be a no on that yeah Natasha is a yes, so I won two for yes so hands down. Please all those opposed I'm going to count. Paul is no it's one. Anybody else. I do not see anybody else raising a hand and anybody abstaining. So we have two to one to zero to zero. On the non- committee board members, can I ask who the abstention was on the committee me? Okay, you do not see the you do not see the list yeah. I did not get to it quickly, enough, no problem. Okay, all right! There is a question in the Q&A which we'll get to at some point. So thank you for that question, but the chairs have the floor to go to the next item and we'll take turns. The next item is a discussion of a resolution to daylight all intersections within a two block, radius of any school or senior center. What this means is, there is a a significant safety advantage when people in the crosswalk have a better view of the cars coming and cars and cars have a better view of the people on the crosswalk when cars park close to the crosswalk, there's a blind spot that clearly results in injuries and unsafe conditions, and so what this resolution proposes is to daylight, the those intersections that where people with particular vulnerabilities, namely children and seniors, are present and to try to make those inter increase safety. At those intersections comments, questions howard, I'm wondering if we should not also include other types of centers for disabled folks like a center for the blind or or people who have disabilities. You know some a place like that. I would do that clearly as a friendly amendment. There are many fewer of those that there are schools or seniors many fewer yes, but I would definitely view that as a clearly a friendly amendment. What do people think senior center would does that also include an a senior home or old age home senior center suggests like an activity center. Well the goal. You know the motivation behind this is that you want to. You want to increase safety where seniors are out and about if it's, if it's a a home where people a nursing home, for instance, where people are not going out and about you know, increasing safety is always a good thing. I do not know how essential it is, but the idea was to increase safety where vulnerable people are on the street and at risk. We know what DOT position on this is. Has anybody spoken with them D.O.T here? How are you oh hi, so we are always supportive of daylighting. We think it's a great initiative. It does create visibility for motorists to see drivers if you've identified the locations that you want us to look at we'll be more than happy to do so. Well, what we've done Colleen is we've just said, a two block radius of all schools and senior centers. That should be pretty you know either the D.O.T can do that or we could do that. It should not be too difficult. I think it would be helpful if you help us with that, identify the school and the centers. I think yeah. It should not be a difficult task. Wonderful right, so the if I could be heard on this- I'm not a committee member, obviously, but the one thing that I would want to make sure that we've leave room for is a follow- up to the discussion we had last month and in July about the request by people with disabilities to change certain parking regulations so that their placard would allow them to park a vehicle that allows handicap. I'm sorry, disability access to the curb, and I did a site visit just around the immediate neighborhood of a person with disabilities who brought this issue to our attention. Just a 10 block, walk and most of the places that he pointed out to me were intersections, and so I'm glad to talk some more about that during new business and updates. I just want to make sure that we do not preclude the possibility in by this resolution, of making room for that kind of parking. That is placard parking and Colleen helped me very greatly with last meeting sending me the magic list of what parking regulations mean and summarizing. If it's a white sign with red letters, then the placard can probably be used and if it's a red sign with white letters, it probably can't I know I'm oversimplifying, but I would like to leave just enough room so that some of these accommodations might also be made, because it's kind of in the same spirit as the day lighting that you're talking about Mark you're talking about parking adjacent to intersections, not in intersections. I hope. Thank you. Yes immediately. Next, it's the same way that daylighting would be yeah. I would raise the question of if there's a need for curb access, there's a you, there's, usually a huge block. It should be at a spot along the block where there is not an impingement on safety. So clearly there is a need for curb. We've discussed the need for curb access in literally every meeting, but I would say that curb access should be in a way that gives easy access for the person who needs access to the curb and does not unnecessarily create an unsafe condition for others. So the extent that there's the extreme ends of the blocks are off limits. I do not see that as unduly preventing handicapped people from accessing the curb, I think there's a great amount of space that they could use to access. We had this discussion. We had this discussion once with Colleen Colleen somebody who has this placard that has been referred to earlier. Are they only allowed to park where there's a certain sign that allows that or are these placards? I mean we noticed there were several of them around disabled, centers or whatever you want to call them on a particular block, but we've also seen them right on Broadway, where there were not any and they were not ticketed. So what is the actual rule for these parking placards? They can park in areas where it's a truck loading and unloading they can't park in a no stopping, because the no stopping is a very stringent sign they can park. I think in a no parking regulation. I think Mark raises a really important topic, but I think we're off the topic of the agenda, and I agree with what mark said at the start, that it's really a new business issue and to Howard's point they're, really conflicting issues. If we're talking about having. If we're combining them and saying that mobility impaired people should be parking in the spaces that we'd otherwise be daylighting, then we're it's a conflicting issue, because these are space influences with no vehicles in them. So I think it is an important topic, but we should discuss it separately and not commingle the two okay. I agree. I want to ask Colleen when you do daylight intersections. What is the signage? I think it's a no standing, so it would you, according to your daylighting signage, you would not be able to use a placard there anyway. You know what I think you can. Let me I would have to look up the regulation. I think you can with a no standing. I think no standing is more liberal than no stopping yeah. So with the no stopping you can't, you would not be able to park there period or even load or unload and how long like 97 in west end? How long can you stay there? I mean if you have a planner you can you can pretty much be there all day. If you have a placard, that's a problem time limit. It depends on the kind of platform you have. If you are an Md technically and legally, you should really be, I think, at a location for near hospital for three hours, if you're using your placard. But you know again, it goes back to lots of people. I want to say that when they park their cars- and they put- you know- put a placard on their dashboard they're pretty much there all day. Can I raise a slightly related issue because we have daylight at some intersections already and then we just find that people go and sit in the spots anyway. So we've talked before about bollards or some other ways to make this actually daylighted versus just kind of a free parking spot. So I just wanted to raise that issue. I do not know that we can like solve it tonight, but I think it's important to keep that in mind. So you know that's interesting. You should say that, because in some areas where there is a bid that can help with the maintenance, when we do daylight and intersection like that, we would probably have a planter and a quick curb so that no one can you know pretty much be in that space yeah, but that's well. Ideally, the problem is there's lots of places on the upper West side without bids. I know I know just like the ideal situation is where you can ultimately bump out the the sidewalk in the crosswalk, making a shorter crossing distance and a more attractive intersection for pedestrians, but that's down the road, it's capital money yeah. I just had a question with re the way it's worded now we're talking about all schools right and senior centers, but I would not us. I would not want us to eliminate like the Lighthouse blind in Lincoln, Center or Doug. That's clearly a friendly amendment, we'll incorporate it. No doubt about it. Sure thanks shall we any comments from the community? Shall we call the question all those in favor on the committee who's doing accounting? I will okay, so I've got Howard Doug Andrew, oh power, just moved Howard, Andrew, Doug, Elizabeth and rich is five plus four is nine and those are all the hands that I see. Okay, so that's nine. Let's see so, let's go to hands down all those opposed. I do not see any going twice so nine to zero anybody. Abstaining. I've got William and Jay. That's two! So that's nine zero two, and is there anybody ineligible because of a conflict? I do not think so. Nine zero, two zero non- committee board members in Favor, Paul Fisher says yes and you have Mark Diller and Natasha is yes, that's three: are there any other? So that's three, all right so hands down. Thank you. Anybody opposed non- committee board members do not see any anybody abstaining and I do not see any and no one's ineligible. So three zero for the non- committee board members, okay, well back to Andrew for number three. Okay, if I could interrupt for just one second for Andrew, I saw Helen Rosenthal's name in the attendees. I do not know if that's julian or if that's Helen Julian wrote in chat that it's julian, very good. Okay. So if anybody wants to be promoted from the elected officials, please let me know- and I'm glad to do it sorry to interrupt. Go ahead, no problem! So, as most of you know, there is a rising amount of aircraft, particularly helicopter noise, over our neighborhood virtually every night. Now I have heard from neighbors, I have heard from other people in the area. Mark has gotten emails. We have Melissa Elstein with us on hand tonight from stop the chop, who has organized to try to do this. I had a conversation today with Rob Gottheim from Congressman Nadler's office to see because congressman adler has been a leader when we had aircraft noise issues in prior years and I'm afraid the news is not very good. Rob said: what can we do about this? Absolutely nothing. The Faa does not want to do anything at this moment. The current administration will not pressure them to do anything. They have met with the local branch of the faa at Jfk Airport they take their orders from Washington and Washington is not doing anything. The mayor will not get involved in this battle. Unfortunately, there's a lot of other things he won't get involved in, but this is another thing he will not do, and the aviation lobby does not want regulation and will fight it. So we do need to find another way of solving this issue pending the outcome of the election. Obviously, but do not look for help from Washington, as the is the clear message I got on this earlier, which is depressing they're, also holding up the congestion pricing of benefit for the MTA there's just so many bad things going on right. Now, but I would like to hear from from Melissa and her stop the chop compatriots about what they're experiencing. I did mention to Rob that not only our helicopters endlessly circling over the area, almost always at night, but sometimes in the day, but regular aircraft on their routes to and from laguardia and or Newark are flying directly north south over the island of Manhattan, rather than using the rivers and Rob said they can't get them to change it. It's just up to the Faa and it's depressing so Melissa. Would you like to add something: hi Andrew hi, everyone nice to see you all. Thank you for inviting me and the stop the chop coalition to this committee. I'm glad that you were able to speak to rod at Congressman Nadler's office, and yes, that is very depressing as he and I think six other Congress members had put forth that legislation, the improving Safety Helicopter Act of 2019 in October- and you know that seemed to be what could be potentially a great solution. Of course you have to get other Congress members and then the Senate as well we'd have to get Schumer, but at least it was a federal ask by Congressman Nadler for the first time, given that he and others have been fighting this issue for over 20 years. So I think we do have to obviously wait and hopefully there'll be a new administration fingers crossed, and maybe the Senate will also shift, because nothing will happen with the Gop in control in Dc. So having said that, one thing that we're doing with the stop the chop coalition- you know we still. We still are trying to get a lot of petitions signed to support the Nadler at all bill. But we also now want to look at the pending local legislation and I know City Council member Rosenthal and I believe Chin had drafted some that are currently pending and we wanted to next figure out. Okay, let's look at these local laws and see if there's anything we can do about that, but we'll need some help with that. So organize some meetings with the local electeds we'd like to make this as well a mayoral campaign issue as well. As you know, the comptroller is going to be turning over the city council members next year. We have a lot of political positions right that are changing because of term limits. So we would like to see this actually as a campaign issue, and how do we make it a campaign issue again? We need numbers on the petition. We need to really show that there's a huge community support, because we hear people complaining on nextdoor and just you know, speaking to you and other people, but how we need to prove you know just like we did with the historic district when we were organizing around that we ended up having thousands of signatures. So we need help with that and I'm open to ideas. One thing that came up with one of our phone calls with people from Midtown this week. You know: we've been Andrew Rosenthal and I have been reaching out to people throughout the city, different boroughs as well, and we're going to reach out to New Jersey, but some someone who lives near the empire state building. He mentioned that a request for a temporary flight restriction that exists. You know around trump tower, but also that disney had gotten put into some federal omnibus bill like that, could also be something we asked for. So you know even maybe there's a way to chip away because most of the places it seems to make right now that are the most obtrusive and also that are flying the most, which is ironic given as a pandemic. I do not see how you can safely sit in a helicopter with the pilot in a small space. Yeah, that's social resistance, but we wonder if there's a way to look at other regulations just to make the industry have to comply. So if we can't get a ban, even though we're seeking this ban, we can also ask for more regulations. For example, you know Brewer has been asking for a long time to have numbers and identifying words on the bellies of the helicopters, and you know we're open to other ideas, because right now, they're not they're, not a party to the 2016 agreement with the city in the lower Manhattan heliport, because these are all flying from New. Jersey people have the Flightradar24 Flight Tracker app, which I recommend everyone download the free one on your iphone and you can see they're flying from New Jersey and a lot of them are from this fly and on company that what had crashed in the East River they do the doors off they do. The Selfie shoe photo tours. They do not seem like they have a good business reputation from the articles that we've read. So there could be ways in which we try to find other types of regulations, but we we're just brainstorming now so we're very open to getting more members, and you have more expertise in all this and then we do so. I leave it at that. Thank you so much Melissa, it's gotten out of hand. Of course, two days ago there was a horrific accident on the henry Hudson parkway and we understand why there were helicopters aloft after that. But this is an everyday thing. Elizabeth Caputo would like to add something: Elizabeth yeah, no Melissa, I've known you for a long time, and I agree with a lot of what you're saying and I've been working with a number of people related to stop the chop over the years, people who live in Manhattan people who live in Brooklyn. I think we all agree that the noise has been amplified in recent days and I've gone public to say how I feel about that, and I want to get into the politics of this, but I also feel like we. We need to bring the private sector into this conversation. There are a lot of folks who do not join these types of community meetings who are flying privately into and out of Manhattan, and that needs to be regulated in a responsible way, and you know I just I put that out there as something that has been something. That's come to me over the past few months as something that, especially in the Covid-19 era, people won't get on the subway, but they'll get in their private helicopter to drive. You know to fly acrosss the city to do things and that just should not be how we operate in Manhattan, in my view. So in any event, I care about this a lot, and I look forward to speaking with the team and remaining on the transportation committee on CB7 to try to address it and really prioritize it in a way that we need to get. You know it's a it's a noise issue, it's also a really poor environmental choice for a lot of people and for those who are in the one percent who can take a private helicopter somewhere, that's great, but for most everyone else. It's not thank you. Jay's hand was up yeah. I had a question. I had a question for Melissa or Elizabeth or anybody sure is there a compilation of who who's operating these helicopters. I mean there's, obviously, myriad possibilities, everything from police to press private helicopters. To I mean there's do we do we have some decently reliable statistics, because my thought would be certainly for the activists on this issue, the focus and perhaps put pressure on the organizations that are operating these helicopters, and I think we should know if there are pressure points by who's operating them. Melissa. Do you want to answer? I believe you have the names of some organizations that are flying these things. Yes, so thank you Jay for that question. This came up in one of our calls and Ken actually was on this call as well, and we currently have a community member on the upper West side. Who is doing research on this, so you could use you know you could easily go online and search helicopter tours New Jersey over New, York, City and you're, going to pull up a lot of these companies like liberty and, like I said flying on so he's, currently doing research on that. For us, I think that the industry is supposed to be self- reporting, and so it would be in just interesting if we could get the information directly from the industry as well, and I do not know if that would require some kind of a foia FOIL request. Maybe somebody else knows, but I also believe that Gail Brewer's office was supposed to be compiling, updated information on this like way back when we all met in cb7's offices before the federal legislation was proposed by Nadler, so we do not have we want to get the full list, but we do not. We do not have it yet. If anyone else has it on the call, it would be great if we could communicate that together. Let me jump in for just a quick second to say that April adams is at a CB9 meeting tonight, she's hoping to join us. She prepared some statistics which have more to do with the number of flights than the companies that are flying them. I'm glad to share them later, but I'm hoping she'll be able to join us and tell us straight from her own research, but if, but if she can't join us, then I'll fill in later with, and I think I think I do not know if it's still true, but certainly on fridays and sundays. There was an awful lot of helicopters going to and from Teterboro airport for people who had private planes and then were coming back either from the hamptons or wherever other points in the northeast. And perhaps I can speak to Rob Godheim again and maybe whoever the Congress person is from the Teterboro area or wherever these flights are originating could be of some help. In this regard, I think it would be very revealing as to if we could get the statistics as to who's operating these things. Yeah and that's really important, but also is I'm curious from the committee and from the community who's on the call tonight. I know there are at least 24 people who are not part of the board who are on the call tonight the big issues like it's noise, it's the environmental damage. It's stuff that's been going on for a long time, but what are? What are the big issues to me? I think if we could spend a minute or two just taking some notes on what the community really thinks is the big issue- and I know the noise is the big one, but are there other long- term environmental issues that are happening? I'd love to hear from the community tonight on that as well. I had a question commune, I'm trying to hear from the community. I do not know if the community is going to speak up, but if they are not all right from the community, maybe committee questions first, I think that we serve the community, so I think it would be great to hear from the community first, if that's possible, does anybody have the hands up? I had I raised my hand about five minutes ago. I did too yeah and you also have three folks from the community four folks from the community yeah. I see I see four folks from the community right and I see rich Robin's hand up too so take him in whatever order you want. Let's just make sure we get everybody yeah, so let's, let's take Doug and Ken, and then we will go to the four folks from the community. So I think I can be helpful here because some people may or may or may not know this about me. But I was a student pilot and I happen to be a bit of a hobbyist which is to get my mind off of all the troublesome things. I actually from my vantage point where I live. I actually monitor some of the air traffic. I have a scanner that I can listen to all the traffic at all the airports and I and a good pair of binoculars. So I have a pretty good feel of who's flying around. First of all, we sit in New York City under Class B airspace as class A b and C air space, which is restrictive airspace, limited to IFR instrument, rated pilots and then there's a VFR visual flight rules corridor over the Hudson, which is a north to southbound kind of like a highway and those that's only used in visual flight rules, weather and under certain altitude and so in. What we have a lot of traffic is from so we're talking about helicopter traffic, private pilots and then commercial aircraft. So to talk about commercial aircraft for a second, there is their traffic patterns. Every airport has prevailing traffic patterns and airways and the prevailing pattern for laguardia, depending on the prevailing wind. Remember an airplane always has to land into the wind and take off into the wind. So if the wind is coming from the east, you will see the aircraft coming up the Hudson river and making a right easternly turn right. Around City, College, Washington, Heights, Area and that'll go into that runway. If the wind is not coming and coming from the opposite direction, you'll see those aircraft flying over actually Queens and then coming to land from East to West. So again, the wind has a lot to do with where and when these aircraft are coming in, like Newark Air Airport, usually coming from the west and then making a southbound turn or coming up from the Hudson and then not really traversing much over Manhattan, so there's a commercial aircraft. Then you have Kennedy, which usually are flying far overhead either East to west. If they're going to Europe and they're pretty high altitude at that point, you've got teterboro. You've got Caldwell Airport Sussex, County, Essex, County, Airports, Morris, Morristown, Airport, Westchester, Airport, Kennedy Laguardia in Newark. So in terms of the helicopters, you've got definitely sightseeing. Helicopters, you've got commuter helicopters, you have news helicopters, you have NYPD, you have coast guard, you do have army helicopters too. There are some seaplanes that actually come back and forth, usually seasonal. And what I see I see a lot of you know there are a lot of police helicopters at night. It's the aviation unit and all of this by the way, if you have a scanner, is public, you can always listen to the frequencies and you can hear exactly. What's being what's being said, and on the VFR quarter, all the aircraft self- announced they have to self- announce so because they're not in the controlled airspace. But the one thing that I that I know as a pilot is that as a student pilot is that there are areas and airports all acrosss America, where there are noise abatement procedures and some of those noise abatement procedures are in effect during the weekend or certain hours like, for example, during the U.S open laguardia has noise embankment procedures where they bypass during the Us open right. So there's ways to do that where you can have these noise abatement proceedings effective again, it's a federal policy, but you could ask for it for certain days of the week and you know: there's no tams, which are noticed to airmen where they have their. They know what they can do, what they can't do, and the noise abatement procedures actually even limit the amount of power that an aircraft can use in throttling up in a certain area. Obviously, New York Metro is an incredibly busy area with you know, with three major airports they're having problems handling well with Covid-19, but anyway, I'm going on too long, but I I'm happy to provide any information or anything non-, scientific or scientific, because I know a lot about this stuff and I hope I can just be helpful. Thank you. Thank you. Doug okay, I believe Ken was next yeah. First of all, I just coincidentally, a helicopter has been flying around for about the last 10 minutes. Yes, I've heard it too. I guess we're all sort of in the same airspace. I want to ask Melissa, given that what were mainly what you're, mainly complaining about, which is, are the tour helicopters that, for instance, I understand, go to central Park and fly around Central park and show people what it looks like from 5 000 feet or whatever, given about fifteen hundred feet, sometimes yeah. We wish it were. Five thousand, given that those are now originating in New Jersey, I believe, as a result of the agreement in 2016. What is the utility or the purpose of the Rosenthal and Chen bills? That would be local laws that, given that we can't control apparently, who comes into our airspace from New Jersey yeah. I think that's a really good question ken and that's why we wanted to meet with the City Council members legislative, reps and figure out why they proposed these pieces of legislation originally and they've just been sitting there, because they would. We wanted to get a sense of what their reasoning was and if there was something that we could do, we're also reaching out to people that we know in New Jersey some electives. We know in hoboken- and you know maybe combined with our local New, York, City, regs or laws, and then people who are very frustrated along the New Jersey path. We understand they're people in Jersey City, like I said, hoboken, oh okay, thank you Helen and thank you Elizabeth for any contacts you can send us. You know that we have this almost a coordinated if possible, multi- state effort and by the way you know this issue is not unique to the New York Metropolitan area. There have been people fighting this in La. I think there's a bill in L.A. Of course, there's the grand canyon there's hawaii, those are not you know. Maybe La would fall under the Nadler bill, because that bill does not mention New York City. It says urban cities of eight million or more, I believe, but Hawaii would not, but you know it does seem like. Maybe I'm just reaching too far, but you know this really is a national issue, if not international. That's what Rob Gottheim said today too Hawaii the Grand, Canyon and New York City are the top three. It really is you guys it's a huge thing on the sightseeing issue, the problems right, nightsing helicopters. It is- and I do this in my day- job at the at the World Economic forum- it's happening all over the world and in particular acrosss the Us. So this is a good topic for us to be discussing tonight and we should be just pointing people in the right direction. It's not just a New, York city issue, it's something that requires them sort of cross- border since this, since helicopters do not originate and terminate in New York City, it's obviously a cross- border issue. Yes, one of the things that we are in the process of doing is reaching out to certain experts from environmental and economic experts. Of course they would charge, but we feel, like that's important. I think Elizabeth had said during one of the prior conversations. You know we need the science, we need the facts and we believe that as well. Even though quality of life, noise and vibration, you know is, is a quality of life issue and it creates a lot of stress and that can also be quantified. But you know one of the groups that we really want to start reaching out to. We have not had time yet are different noise pollution nonprofits, as well as acoustic acoustical, non- profits, because there is a growing movement all over the planet, about noise pollution and so bringing in these non- profits would be really helpful. Absolutely thank you. Melissa. Let's get a few more hands up, celeste Miller did you want to speak if you could unmute yourself? That would work, probably better. Thank you sure, and I think people that spoke already covered a lot of this. One thing that I that I feel is a long time resident of the upper West side that is different for New York City than from Hawaii or grand canyon, is that many of us have the memory of 911 and in terms of quality of life issue. I do not think any of us will ever forget all those helicopters flying around and whenever I hear it now my mind immediately goes there and it really does elevate, particularly now during Covid-19 time, the stress and anxiety connected with all those helicopters flying all over the place. Yes, thank you. That's a that's a point. Celeste was that you, oh yes, so Constanza! Okay constance, would you like to speak hold on? Can you hear me yeah? We have to hello. Thank you for your service. For me, it's three points. It's the sightseeing helicopters. I think that's what we have to focus on. I see them on flight rider their circle all day. Long is the same continuous helicopters that pick up passengers and go on. I think this is what we need to and they go over the upper West side in the 90s and 80s Circle central Park, and go over on the 80s upper East side and go down it's every minute. To two minutes. I have a helicopter, I'm on 94th on Broadway. I hear I timed it. I vlog it and, I would say, 80 the sightseeing on a clear weekend, it's from 9 to about 11 when it's cloudy or rainy, it's great. So it's insanity right now. It was never this bad. So it's the noise and the stress and the sickness comes from it. The second is the environment. We have flocks of birds coming over central park. We have. We are known in central park for the birds that microwave through and the helicopters are right in their line and I'm sure they're. I see them when I do yoga on central park in the morning, and you can hear three helicopters hovering at 9:30 in the morning and they're trust me they're outside seeing the birds all fly up and get Antsy. So it's the birds we have to watch and the third thing is sooner or later one of us will be dead and killed by one of these helicopters. There's going to be a crash, there's going to be dead people, so it's those are the three concerns and I think I I'm glad to find stop the job we all have to work together on this, because there must be loopholes with nylon, air and fly on air and all these companies. Thank you. Thank you. Mark. Did you want to speak well, rich, had his hand up before me. Oh I'm, sorry, rich did not see you richie got it on mute, yeah. Three things, one just echoing the safety issue. Having these things, overhead is a concern over such a densely populated area. Obviously, the noise is a major concern and I was just writing in chat. There's a woman, arlene bronzaft who's. Oh, I know her advocate. Do you know her? I do not, and I know of her grandson who wrote about her but he's her grandson is a Brooklyn CB2 member and she's been a real advocate for a quieter city. So if people know of her, we should try to get in touch with her and just see if there's a way that she might be involved. Yes, main thing I wanted to talk about is the issue of traffic helicopters, and I know Andrew you mentioned at the beginning. I do not know if it's a large percent of helicopters. The big concern I have about them is that they're often early in the morning and last Friday was a great example. It was maybe five in the morning there was an issue on the West side highway and there were potentially four traffic helicopters hovering overhead just to get a 10 second shot that they could use on their news of a traffic backup, and for me you know having them that early in the morning is just egregious. It woke up many people in the neighborhood. I saw a lot of complaints on twitter. Also, it seems like something that technology could easily fix. They could put very inexpensive cameras on light posts on the West side highway and on other highways around the city. Probably save money drones would be quieter, yeah, it would be silent. I would imagine D.O.T would be happy to give them access to the electricity they could make the feed public, so it would have other benefits of being able to see where there are traffic spots and save them the money and the pollution and the noise- and I do not know if anyone has, unless I ask, has anyone reached out to the local TV stations because they have interests other than just complying with the law. They want to be good. One would hope. They'd want to be good neighbors, especially ABC TV is in our district, a lot of journalists and reporters live on the upper West side and they're really creating a huge nuisance for the people they're supposed to be serving. So I would advocate that we have a meeting that we invite the local TV stations to join us and discuss the issue to see if there might be alternatives and just to make them realize that the community is greatly opposed to their being such a nuisance for the community yeah I mean, I think I think the news and traffic helicopters are a part of this and at certain times of the day and fridays and sundays are a huge part of this, and we certainly can reach out and ask them if there was, if there's any other way, they can think of with the technology being what it is to to get the normal traffic choke points recorded in another way, rather than a hovering helicopter at fifteen hundred or two thousand feet. Yeah and I see Melissa wrote that there's a first amendment issue and I'm not talking about banning free speech here, I'm talking about working with them to try to find creative solutions so that they're not antagonizing the neighborhoods that they're supposed to be serving and which they do their business in and which many of them live, and just to make them realize that the neighborhood really is offended that they would create such a nuisance right and but you can of course see that one channel does not want to be outdone by the other, so they're all going to have helicopters pretty obviously, but yes, I think we can. We can certainly reach out to the news we can reach out to the TV stations and I'm not sure that the borough president has not already done that. But if April joins us after being with community board nine, we will ask her that Jay has his hand up and then mark, I think, wants to speak just a quick suggestion. If anyone's in touch with any of these TV stations, we might suggest that they do what they do with their reporters. On a lot of occasions and trips on Air Force, one which is to have a pool where they could just have one helicopter with a feed, you know various losers, I mean at least one helicopter is better than four or five. That was one of the points I was going to make so and most of the points I was going to make have been made. So that's great- and I won't repeat I did want to mention one thing- that it is interesting to that. The borough president and council members were trying to get involved in this, because it says you know sometimes we're a city, a state or 50 states. Sometimes we're one country and air travel is an area where we're one country, and it is the principal regis regulation of air travel- is by the federal government which is frustrating to us, because it does not often it is not often responsive to local concerns and interests in the way that this discussion has highlighted, even though I completely agree that it should be. So that's why I was glad that we supported the federal legislation, because that would be the most comprehensive way to rein. This in. I accept the politics of it as described which, when without bringing partisan politics into the Community Board Chairs recitation of it. It is the case that the legislation, for whatever reason, has not been adopted and therefore we're looking for other ways. I assume that this that the local legislation is aimed at aspects of servicing and facilitating the the air travel as opposed to where it can fly itself, and I'm all for supporting that. The thing that, to the point that rich was making, many of those cameras already exist on light poles. If you look at New York One's traffic report, it actually has a map that has red, yellow and green lines on the major arteries leading into and out of New York City, and it actually switches to cameras to show you the congestion, as if looking at traffic is something that we all want to do. But they feature this already, so it's already there that infrastructure much of it exists. So this is, I believe, as Andrew was kind of referring to. This is as much a vanity exercise in branding the helicopter as it is, and if we can reverse the equity of branding the helicopter. That, I think, is a very interesting way that does not violate the first amendment, because we're not saying you can't fly your helicopter, we're just saying we're taking notes and we're not pleased. So I would be happy to facilitate meetings that would include the right folks from our committee and the right folks from the community to push this forward in any way. That makes sense whether that be at a future meeting of this committee or in a smaller group that we could convene and then report back to the committee on whatever you guys think, is right. That's one of the next steps. I think we need to take. Yes. Thank you. I know I spoke already, but I'd like to just add a quick go ahead. Doug. So in my non- scientific, just sort of you know monitoring the radio traffic one of the things where I've observed the most concentration of helicopters and noise is around a news incident right. So you have the regular traffic helicopters that happen during rush hour and on weekends and they will they'll hover. But then you have, if there's a if there is a crash or fire, a water main break protest whatever it is where the helicopters are going to want to get aerial coverage and they all are competing. So I actually will listen and you can hear you know ABC and CBS and NBC helicopters, and then you have a real problem, because I've actually heard this in real time where the NYPD has to ask the news copters to clear out because they're involved in an active scene. I believe that there's you know you can hear them. You know make way for the. Obviously they do not want to become part of this story, but that's something that you know when that happens. You know I've observed four or five helicopters in the same general area at the same time, and that's really noisy and probably pretty dangerous. Absolutely does anybody El? We will all follow up on this issue from various vantage points. What's the name of that application, doug that you can aim at an aircraft and find out its registration yeah, there's a number of them anytime, you get a tail number. You can pretty much. Google, the tail number and it'll tell you where the aircraft is registered, but there are a number of applications. I think we need to attack this from the federal, the local and the interstate, as well as talk to our local news. Folks, and I will be in touch with the borough president's office to see how far they've gone or the city council has gone and see. If we can elevate this to the next step yeah, he is I'm sorry to Interrupt. I see Aaa and the attendees is that April adams? Yes, it is. Oh that's great yeah April I was referring to, but not sharing the statistics that you gave us, which largely talked about the decrease in volume. But can you talk a little bit about one of the questions that came up for you was having to do with the outreach and work that your office and Gail's office has been doing on this with respect to trying to regulate this from a local perspective? Absolutely so, as you all know, gail, as well as congressman Nadler and a lot of other folks as well Councilman Mckayla's. They have been working on this issue now, for I mean Gail for years and last year we did reconvene the helicopter task force that Gail begun prior to my time with the Bp's office, and we basically gathered all the elected officials together, City Council, as well state representatives to find out what can be done around this issue. Of course, I think I came in a little bit where you mark were mentioning how difficult it is because of the federal regulations I spoke to the I spoke to Faa last week and they're a little hesitant to regulate low- flying aircrafts and so that it's not really on their radar, so we'll have to push it from that angle. You know this is this is an ongoing quality of life concern and you really do need to actually make sure that this is a priority and that you handle it. When I spoke to EDC last week there of the you know that, of course, I sent you those stats, so we know that you know the flights have decreased out of the heliports, but EDC stance at the moment is that they think that a there's a lot more tourist flights coming out of New Jersey, that's causing this traffic, which has always been the issue, but then b. They think that, because a lot of a lot more folks are working from home, they may just be noticed noticing the noise more often which I'm like okay, that might be a possibility as well. So we're really trying to attack this thing at angles. Honestly, any sort of innovation or any sort of you know. Creative thinking towards this issue would be very helpful and much needed. So thank you for that. I'm sure people are noticing it more because perhaps they're working from home, but these are frequently nighttime massive helicopter raids and folks were home in the evenings before as well. So there's definitely been an uptick and if it's from New Jersey, if we can identify where they're coming from in New Jersey, we can we can. We can ask Congressman Nadler to reach out to that, congressman and or others, and try to try to regulate this. Somehow, absolutely I know in the past. It was mainly you know, kind of, and you know I spoke with the Eastern Regional Helicopter Council, and they have said that you know there can be some bad actors as far as tourism helicopter operators and you know in the past it's really been focused around like fly nion, who, I think mainly flies out of kearney and Linden, is that new yeah Linden has been a problem, yep yeah, so yeah there. You go maybe Gail can get us a grant for surface- to- air missiles, surface- to- air paintball. Let's not promote violence. Yes, I think we've, but we've taken this issue as far as we're going to tonight. We will keep you all posted as we work towards a solution, because we need to get a solution to this one way or another howard. You want to move to the next item yeah. The next item we have is new business. Well, basically, it's a follow well before new business. It's the follow up on outstanding business. Yes, as you all know, the mayor made the restaurant seating program permanent, which is a lifeline for restaurants. My suspicion is that over the next couple of months, we on this committee are going to see issues arising regarding how broad a space restaurants can take over. You know in this great weather, it's very nice, but eventually there's going to there's inevitably going to become going to arise some conflict over the space they use, and I have a feeling that somewhere down the road, we're going to be hearing more about that. So there's the follow up on that. I just wanted to give an update on that curb usage. We had a we've, been talking about curb usage for quite a while loading zones, and we also have an outstanding resolution on West 72Nd street. So I asked colleen if there's any update on any of those issues. Howard, I had a quick question: can we well it's coming so howard, those the restaurant? What you've asked we are still looking into that. I do not have a definitive update as to when you know I will have the information. So let me check again with the division. Okay, because I know it's there, they have it and they're looking into it great, because we raised issues with access to the curb and the West 72nd street everyone's looking forward to to seeing that Jay, you had a question: yeah howard, I you know we all read about the mayor, saying that the usage of the streets by the restaurants would be permanent, the when he says permanent. The you know he really meant kind of open- ended until the virus issues, hopefully God willing are resolved or literally permanent Jay. Your guess is as good as mine. Well, we have colleen here. Maybe she knows so Jay I mean, I think, we're still working logistically with city Hall, and you know fine- tuning. All of this, I think, once we have more information, we're definitely going to share that with the Community board. I know there are some other community boards who already asked the same questions or who are still thinking the same questions as what you just posed. So when I have more information, we'll share it with the boards yeah. I think we've all been very supportive of throwing a lifeline to these restaurants and giving them space so that they can't survive. But if we're talking about permanent or even long- term, I mean we have processes for things like sidewalk, cafes, etc, and if these things are going to be even semi- permanent, I think that we need to have some process of evaluation for each one. The way we do with the sidewalk cafes weigh all the various consequences intended and unintended yeah. I think if this is something I'm not if this is something that's going to be permanent, you're, absolutely right. That there should be some mechanism where the community board is involved, just like with weighing in on the sidewalk cafe permits so yeah you're, absolutely right, Jay. Thank you colleen, while you're at it is there any move by DOT to mandate some sort of lighting on the on the street side of these in the street, set up tables so that a motorist or a bicyclist or anybody does not hit one of these structures. So the structures have reflectors they're supposed to have reflectors on them. It's clearly visible. Additionally, they checked as they're checking to make sure they are yeah. I remember I remember the accident in Greenpoint yeah. We have our inspectors that go out there and they check to make sure the structures are in compliance and that they are they do have reflectors on them. Great, thank you someone's hand was up. Yeah, mine, okay, rich yeah. Just on this topic, I'm a huge fan of the outdoor dining. I think it just adds just a great new dimension to New York, City, obviously much more so in the nice weather, but it just you know, really enlivens the streets. It's I find it wonderful. Having said that, I think it was thrown together, obviously on an last minute emergency basis and the way it was done is really extraordinary in getting it set up so quickly and yeah. There should be community involvement, there should be other issues, but given the circumstances, I think it was spectacular. Having said that, I think there are ways that in making it permanent, it could be there's potential room for improvement and, in my mind, that really gets back to sidewalk use and the need for, if we're, converting the sidewalks into space for restaurants, which again, I think is wonderful. There are places where there's need for more sidewalk space, and I think that you know there's an argument for enlarging the sidewalk to make this happen. That way, you do not have situations in some areas where waiters have to walk through bike lanes to get to tables or where there's enough room for for people to actually walk through a sidewalk, while the restaurant's also using it as sidewalk space. So I do think we should have a community discussion. I think we should put it on the agenda even as soon as next month and really talk through the issues, but I would love to see us put together a resolution calling on D.O.T to explore what it would take to make this permanent in a really strong way, such as enlarging sidewalks, to make this an even better experience and what was already a great outcome to a to a you know: horrendous tragedy in the city. Actually, you all made a did a much better job of explaining the issue than I did when I first introduced this. What I was alluding to by saying that there are going to be issues regarding on how the space is used is exactly what everyone else has been saying that it's great now, but eventually, there's going to become there are going to become issues on how much space and how the space is used, and we presumably, as she said, the community board, is going to have to have input into that. Any other comments on this ken not on restaurants. Can I move on to something related, absolutely: okay, open streets. I think we've benefited not just from having additional recreation space during a pandemic, but we've the streets that are open streets are undeniably safer, they're much easier for delivery vehicles to park and unload they're, quieter and more pleasant streets, and they also reduce overall traffic in the neighborhood by implicitly discouraging driving. So I would like to see us have a discussion in November about continuing these really great amenity amenities for our district. Great, any further comments on that I've been hearing from a bunch of people as well to try to make these amenities, like the restaurant, seating, more permanent. So any comments, yeah howard, you know I was Mark, has his head mark and then Jay thanks. I just want to make sure that we, when we have that discussion whenever it is that I want to make sure that the precincts are there. The West, End Avenue open street was there's a great deal of confusion on my mind about exactly how that's being monitored and administered and to the extent that we talk about extending this, I think we need to be a lot clearer than we are right now. I think it's a little bit like we were talking about the open seating, restaurant issue, where a great idea was pulled together at the drop of a hat to to address a need, but if we're going to make it, you know go forward that we would need to understand a little better, how that's going to be made kept safe, because I've heard things about barriers being knocked over and how they get set up and so forth. I just want to make sure we have a complete discussion and I think we need the precincts for that. This is. This is a major change. First, we have the restaurant seating and now we have the open streets and, to the extent these are made permanent, there's a great need to have buy- in from all the constituencies and clear rules. So, yes, it should be on the agenda and the precinct should weigh in and the[ _ _] should weigh in and as many people as possible, because we all have our worst interests I'll work with the chairs to make sure that we coordinate with the precincts yeah. And you know what I'll take this back to my colleagues, but I think it's fair to say that if both concepts are, if we decide to make it permanent, we'll obviously have to come to the Community Board and give a presentation about it. And you know in terms of the process and what the guidelines and criterias would be. So I mean I'll discuss it with border commissioner pink part tomorrow in our staff call and give him a heads up about it. Great who else Jay did you want to say something? Well, I agree with mark that the precinct needs to be involved. You'll recall at the Full board meeting I asked as an inspector, I guess, yamaguchi if he was aware of the problems that have developed on 96th street, the intersections of Broadway and West end and the disastrous situation, and his response was that they were aware of it, but he kind of shunted it off to D.O.T. But I agree: the precinct needs to be there. The responsibility for maintaining and instituting it fell to the precinct, notwithstanding the mayor's initial announcement that every open street needed a partner, a charitable organization, a non- government organization to partner with them, they went ahead and did it anyway. So there are all kinds of issues I had sent you a couple of emails. I very much want to have a discussion. I live on West End Avenue and I think I have a very clear, daily picture of exactly what's going on there and I'm looking forward to the opportunity to hear from other people, particularly if we can get other people who live in the area to participate in a discussion yeah. I do not think there's any question jay that the precinct and the other constituencies need to be involved. This is a big change to the streets and I think we all agree on that. Any other questions. There are some folks in the attendees. I see three hands threes. Are you going to see them? Okay, so I'm sorry Jessica Spiegel, then christine a while and then Peter Artisan First Jessica. You have to unmute yourself next month, but I was just wondering if in the intro maybe we could do something about the barriers, because, quite frankly, right now the car produces an obstacle course and they're pretty much driving down west end and you're like dodging in between them, especially in between like west end and between 95th and 96th, because everybody is like just driving in front of the school and I've always been hit late before there, and I mean we all know that corner. So the barriers have been broken. So I do not know if maybe we could get different barriers or more robust ones. I'm not really sure the answer is, but right now it's like kind of hard to use. It and with all the work going on Riverside park is crowded to like be over there. Sometimes so you know, west end is like such a great place to like walk and be yeah. I was just calling about that. Hi Jessica, it's colleen and I just want to tell you that the NYPD little cooperation reached out to me regarding additional barriers, so we're working on that we'll see what we can do to provide more sturdy barriers or see where they can get that as well. But they reached out to me today: okay that'd, be great colleen Hey Colleen are you? Is this D.O.T looking at where traffic that is diverted from West End Avenue is going? Are you looking at that at all? Well, we are- and I you know there was a few- not many, but I want to say some residents reach out to me about West, End Avenue and about the closure, and they were not happy about it. They felt that it was creating traffic congestion in the area, but we found out that there was an event that was going on that contributed to the congestion in the surrounding streets. So yeah we are looking at the traffic when we do these close these temporary closures. Yeah. Okay, thank you. I would certainly hope so because to not look at the traffic which has become dangerous to automobiles and pedestrians at those intersections, it would be criminal not to look at. What's happened as a result of the closures of West End Avenue. I think we all agree that this needs to be carefully looked at in the context of changing the street space. Let's see who's, we have Peter and then Jesse zoo. You also have Christina Weil. I think it is yeah who moved down in the list. I'm not sure why you want me to speak or wait, Peter first and then Christina Weil and then Jesse so hi. I'm thank you all for addressing. This has been tremendous for our neighborhood. I run the business improvement district north of 96th street and just it has been tremendous for the restaurants up in our neighborhood. We just do it on Saturdays and sundays, and the restaurants are doing well doing as well as they can right now and we're also getting a really positive response from residents. There are some concerns about cars coming through the barricades we've had motorcycle gangs come through the barricades, we've got delivery or electronic electric bikes that are going too fast and we've got scooters, but for them we have not had an accident and D.O.T to its credit. Just did a tremendous job of rolling this out and they took a gamble with us because we're a bus route and a truck route and we have worked with them and they've just done a really good job. We have asked for Columbus also from 110 to 106, and that is on hold and they're reluctant to give it to us because of Frederick Douglass being also closed down, so we'll see where it goes, but I will say that it has been very successful going into the winter. I'm not sure. What's going to happen, and nobody is of course, but for the moment it's been really great thanks your concern to colleen and that you know, there's always a problem with enforcement, but to the extent we can minimize that problem by having sturdier barriers or more more obstructive barriers. That would be enormously. That would be an easy and enormously helpful fix. So I urge you to look into that colleen. I want to ask Peter a question: okay, Ken Peter, just out of curiosity, how are you handling the m7 and m11 they're? Not diverted right? They are well, they are yes, we offered to create a larger emergency lane and allow for them to come through going five miles an hour, but they it was decided not to, and so what we do is when we're closing down the street between 11 and 12. We wait for the last bus to pick up everybody and we try and notify everybody at the bus stops that this is it so this past Sunday. I guess I waited there for half an hour waiting for a number 11. and it finally came and picked up the one person that was waiting for it, but anyway that's how we have handled it. We also had a request from DOT about a week and a half ago to open the street up for a oversized truck at 8 pm and we waited for an hour and it never showed up. So I'm not sure what happened there, but we've tried to be flexible in terms of accommodating those types of things, and I D.O.T, like I said, has really done a tremendous job with making this work, because we were not a a likely location. So thank you. Thank you. Christina hi everybody. Thank you. So much for letting me speak, I'm a west end neighbor at 93Rd and west end, and I just wanted to voice my support for open streets. I have two young children and it's been amazing to be able to just walk outside with them. I want to echo what another person said to people before me about the safety issues, which I think we all are aware of. The barricades are Dilapid, I mean they're falling down. I have called a number of times, 3- 1- 1. I even called 9- 1- 1 at one point, as a driver sped by me, and there just does not seem to be a good sort of solution for people who are noticing problems on the street and, like I noticed somebody who was driving too fast, I stopped and talked to her and she sped off and then I was able to get her license plate, but there was no way to report her. You know there was no way to report the dangerous activity, including calling 9-, 1-, 1 and speaking to police officers. So all I would say is I think this is great. I think we should find some solutions to make these open streets workable. During you know this Covid-19 period and perhaps beyond. I think signage is a huge issue, because a lot of people who turn on these streets have no idea that they're closed and the signs that are there now are like falling down. You can't read them: they're, not high and high, like large enough font. If you put a sign up that clearly said it's five miles an hour, maybe people would see it better. I do not know and then my other comment- and I know this involves community partners is just a way to activate the streets. It is getting colder, but I know that there are a lot of kids and families who use it to walk, but I go out there and I play badminton with my kid and like it's so much fun and it would be fun if they were like. I do not know just a moment where people knew that they could come out and we could play around Robin together. You know I'm I again. I know it involves community and involves time, but I think there's a way to make the open street on West end and elsewhere, really a fun space during this you know sort of difficult time so anyway. Thank you. So much badminton is permitted in Riverside park. Okay, thank you, Jesse Zoo hi. This is Jesse, I'm living in upper west side near Riverside, drive and I sense mark, and how will your mom invite me to this meeting? My question is simple: regarding street parking, and recently I saw a lot of off- state license plate vehicle parking upper West side for a whole week because of the pandemic season, city, changer, parking regulation, and I believe we have both already submitted requests to study this situation in the in April 2020. But this whole week of parking is a new situation in the OSI. So my question: does the DOT will study this kind of issue for us for residential blocking? Actually it's a great question that we adopted a resolution almost a year ago and Colleen. Could you tell us the status of the dot's response to that request for a study of the curbside use and again I do not have a response for that, because, with the pandemic, everything was on hold, so I can find out, though, about the residential parking. Okay, the request was actually broader than that is. It was to figure out what was going on with the curb and find out, and you know find the best use for this space is a concern we hear in almost every meeting and so that I, the sooner we hear about it, the better and obviously the pandemic makes everything just more difficult. So I you know, I understand how it could delay things, but it also heightens the need for some kind of good. We have asked repeatedly for a pilot of residential parking permits that we have that we've been very specific on, and I will just note that there are still well just anecdotally where I live. There are dozens of apartment buildings and there's literally, not one, not one loadings. So it's a it's a it's a major problem. Colleen now the outside state of motor. The motorists took advantage of this parking regulation changeup spot once a week. They come to New York City, because Airbnb is cheaper. Now they come here for one week and a parking street like a free parking. Well, if I could just jump in on that Mr Zoo, I would not overlook the possibility that permanent residents of the upper West side are registering their cars in other places, because I'm just going to speculate that the insurance rates might be lower or other regulatory benefits. From doing so, it may not be the case that we would lose the volume of parking we would just reap the benefit of having those parking parked vehicles registered where perhaps they're used and used and stored. Yes, that's true mark, remember all those cars from Vermont and in Michigan also and Michigan yeah. I saw this license only once a year imposter years, like a Christmas season thanksgiving now they may very well be new Yorkers yeah, there's no distinction made between new Yorkers and any other state for the use of this. The street space in New York City, which is another reason why we requested this study of how the curved space is used. But right now that's the situation and again we want it looked at to see if there's a way that the situation can be improved, one more hand and that's gene Thompson, hey Jane, you have to meet yourself. I live at 96th and west end and I would question why 95th to 96th street was included in that street thing between the highway exits and entrances and 95th and 96th, and now all the school buses in that block it. Just I do not see hardy anybody using it a few times I've been out there. I felt, like I had to yell at people to get off the street, because there were cars going back and forth all over the place between 95th and 96th. So I think that it goes for, I believe, from 87th to 96th. Then I would wonder if they might reconsider and make it 87th to 95th street, maybe or something just right. It's also a problem. I I'm handicapped and I can't come home on a car or a bus because they can't drive up West, end avenue technically, except from way downtown because of the one- way streets and the street closes, and what I do is just get off the car or the taxi at the bus. Stop so far nobody's objected to that right at the corner of 96, the southeast corner nice. Well, that's right are allowed on West End Avenue. They just have to go five miles an hour, so they should be able to take you to your door right and I'll. Also point out that these programs, the restaurant seating and the open streets where they were put together hastily in response to a medical pandemic, we will give more thought to them and try to improve upon them over the next few months as the sense. Hopefully, the sense of urgency gets reduced. Anyone else on old business, outstanding business, I see Peter Arnston's hand up again. I do not know if that's a redux or I think rich has his hand up yeah I'll yield to Peter first and then I have in case he wants to talk on this topic. I just want to go back to the topic of accessible parking. I just wanted to respond. Christina had mentioned about the signage. We've got some really great signage that came from D.O.T, it's two foot by two foot, white and red. I still get cars going through people, you know certain people will just ignore things or some not somehow just be unable to read them. It's really incredible. We patrol the entire length, usually on bicycle, because it's easy to go from one end to the other or to accompany certain cars or emergency vehicles, and that helps tremendously that's something that West end does not have, and that's we found it to be somewhat helpful. So, just though those are my two comments thanks, thank you rich yeah. I want to get back since mark raised the issue of accessible parking. One thing I've noticed in my neighborhood, which is 103Rd street near Riverside drive, is that there are a great number of cars with accessible permits, parking on the service road on Riverside drive, and it seems that there's they're not ticketed they're able to park there overnight, basically every night and I'm not sure what the right solution is. I think if there are people who have a real need to be able to park near their homes, I wonder if we should have something more permanent and more legal than this illegal, but you know potentially necessary parking. I do not know what the answer is. I just want to raise. It there's also a an elderly couple that has a first responder expired tag that and they park on the sidewalk on Riverside drive many nights and they seem to not get bothered either. So it seems that there's this this lack of enforcement, which in some cases might be appropriate, but I wonder if we should have accessible parking spots that are official spots, probably on Riverside drive not on the service road, which is very narrow, but I just want to raise the topic. Thank you rich anyone else. Rich people are parking on the sidewalk. Is that what you said yeah? Do you think that would be 103Rd Street? There are a number of cars that park on the sidewalk. It's a very narrow service road and a lot of those cars have accessible permits. As I mentioned, one of them has an expired, Emt permit and I've seen the couple get out it's I do not. I do not know if they're still active, emts or, if they're just somehow affiliated with an ambulance company, but they park a lexus on the sidewalk, basically every night and have for years like far before Covid-19. Well, I I'm not sure that should ever be legalized yeah. If that's what you're suggesting I do not think so, yeah no, I was not suggesting that I was suggesting if there's a need for accessible parking for people with valid accessible permits. Maybe we convert regular spots to accessible spots, but I think we do not want to encourage people to or even allow people to park on a narrow street either on the street, blocking traffic or or on the sidewalk, and the precinct does not do anything about it. Anyone else! Okay, I think it's your turn Andrew, so I guess we have to speak about next month's agenda. I think that is the next item. We will certainly know more considering it would be the second week of November. We will know a lot more about the mta's fate as a result of the election. Do we want to invite Revel and any of their affiliate scooter companies to attend? I think somebody mentioned that at the beginning of this meeting I think you'd draw a card if you did well, we could talk about that offline. Okay. Well, I understand there's some interest in it and we'll discuss what kind of issues we could bring up. Okay, we can do that. Let's see what other items stand out that we need to address. We can possibly get somebody from EDC or somebody else to speak about the helicopter issue. If people are still interested in pursuing that, maybe we will have a little more news on that item. Let's see what other outstanding there was a park through the park issue that we discussed several meetings back for bicycle Access, East West in the park they were, we were going to speak with either the conservancy or a task force that the police were going to set up about devising routes acrosss the park that were not the transverse roads, but other routes do we know where we stand with that, or would that be joint with Parks Committee? I assume it would. My regulation is that is that we've asked Colleen for an update on that, because Colleen was going to or D.O.T was going to be the lead agency and that they started to work on it and then Covid-19 hit and the ability to follow up was inhibited D.O.T would be the lead agency considering it's in the park. That's that was my understanding of how the answer came back to us, but but Colleen's here. So I do not want to speak for her other than to frame that as a question sure Jay has his hand up Jay go ahead. I just wanted to let Colleen know you already know, because I sent it on to you guys. Last month I put in a refoil request for a copy of the citibike contract and any information statistics, etc that the city has on accidents between well accidents involving operators of CitiBikes. The response I received from the Department of Transportation was that they would get to my request in March. That's really incredible! Well, that's when Covid-19 hit, but yes, simple enough. Well, I look forward to hearing what comes of it any other new business. Howard yeah go ahead. Could could we ask colleen if there's been any update on the Cross Central Park Route Task force, because bicycling is not showing any signs of abating, it continues to increase and cyclists really need safe ways to get from the east side to the West side and vice versa. Oh, I would amplify that Kim by saying that Covid-19 hit and I understand how a lot of projects were sidelined by Covid-19, but this is a project that is Ins is essential given for cover. It should be looked at as a Covid-19 project. So with that introduction, colleen, yes, Colleen, are you still on she's, muted? I'm here you know Ken the we have not decided on creating a task force and I do not know if we're going to create a task force, but what I've mentioned in the past- and what I continue to say is that we will work with the conservancy and we will work to with parks to see what we can do to make the improvements. And if we do have something to present, we will come to the board and present it. Okay, my recollection from our meeting I forgot when it was, it was January of 2019 January 2020, all right. It just feels like it was that long it was pretty pandemic was that it was that you were committing to a creation of a task force. That's what I thought I agree completely. Ken yeah! I remember that so please keep that in mind colleen, because we're we we're very anxious to have that move forward. We also spoke. We also go ahead, howard or just whether it's a task force or not. This is a matter of some urgency. So, however, it's achieved there's a great need for it in view of Kobe yeah, we do not care what it's called. We just want it to move forward right. We also spoke about a requirement, and maybe we need state legislation for it if somebody's willing to sponsor it- and we can, we can see if they want to that all taxi companies and for hire limo companies when, when purchasing new vehicles, must purchase ones with the anti- crash technology that is now available in those vehicles. Surely you might you remember that discussion, I think, would be great if we could find a sponsor for such legislation. I will ask some state officials, if they, if they'd, be willing to do that, because the technology is out there. If we can save lives by mandating that they purchase this technology, it seems like a no- brainer yeah. Can I get back to Central Park, I mean the resolution we passed close to a year ago was done as an urgency just in the aftermath of a fatality and I'd hate to have it lose momentum because of what's happening. As Ken mentioned, more people are riding than ever and I'd hate for it to just lose momentum, not get it the attention it needs and for there to be another fatality- and you know, as we talked about in that meeting, there is no safe legal way for bicycles to cross the park, except at 72nd street. That's correct, then yeah, yes, but you know there are plenty of signs in the park telling cyclists where they can not go, are not signs in the park telling cyclists where they can go and cyclists. If you're, using as I've done, if you're using Google maps it steers you to go in the transverses, and I can you know flat out say: the transverses are not currently safe for cyclists and they should not be used for by cyclists either yeah there's no room for anything else yeah. But if you're trying to follow the law, I've seen I've seen cyclists on the sidewalks on the transverses, believe it or not, and that's a little hairy, also yeah, and we need clear direction for cyclists where they can go, because if you follow Google Maps, which is what I would imagine, many cyclists do they're being steered to something that's putting their life at risk. There are no signs in central park on where you can go and there's a number of real, easy, quick low- hanging fruit, fixes that we proposed close to a year ago and there's some logical places that bike paths through the Park East- West could be constructed yep, which would not inhibit park land. Basically in getting the conservancy to the next meeting, a joint meeting of parks and transportation yeah I mean I feel, like we've done, that and we've and we've asked D.O.T to meet with the conservancy and with with the precinct and with the department of parks to come up with a quick solutions and that just never happened and granted. You know we've got extraordinary circumstances but, as Ken said, those extraordinary circumstances make a fatality that much more likely and it's something where we really. There are a number of things that can be done quickly and would love to see those happen right away. Have you brought this to board Aids attention? Yes, okay, did they have a position on this? They agree or they generally agree. I can there's borough board this coming. Thursday I can chat with Elita camp is the is the chair of CB8 she's expressed support for the idea. I can bring it up again. Yeah. Maybe a dual board would have a little more ammunition. I do not know that it would in this climate, but maybe it would could not hurt Doug did you did you want to speak on this? Not on this, I just being a new business like just reminding that the road motorcycles and Atvs I'd like to address it, but the other thing which is not necessarily a new business, but it's just a concern being shifting our attention to MTA for just a moment. Yes, I take public transportation fairly. Often I am worried that there, even though there is supposed to be enforcement of mask wearing, I have yet to see a single person on all of my bus rides on the m7, the m11 M104 M57 m31, the two three, the one trains. I have not seen anyone approach, anyone there's no one, just in my own personal observation and I've seen a lot of people without masks and what I'm worried about besides getting covered is that it's going to scare people off from getting on the subways in public transportation, and it's going to just be this self. You know this awful, yes problem of giving people confidence to come back so Andrew. Do you know anything about what kind of enforcement there has been? Yes, I do. Okay, the MTA police and the bridge and tunnel officers are the people that can enforce the mask. The regular transit employee can not and is encouraged to not do that. I'm reminded of a bus operator who told somebody you need a master board and he was punched out. I mean it's just crazy time. There is, however, two good pieces of news. One is the Sam Schwartz study that came out about a week ago, that showed you are far less likely to catch Covid-19 on public transportation than in several other indoor environments due to the replenishment of air on a regular basis through the ventilating system. The other good piece of news is that the long island Rare is testing this air filtering thing now, which kills every kind of virus and has proven very encouraging at the moment. If this is a successful test, it can be moved to the subways and buses as well. We obviously must get people confident to come back to transit. Hopefully we will still have transit if these horrendous service cuts do not go in effect and we can get some federal help. Otherwise, it's you know. 40 service cut on the subways and buses and a 50 service cut on this commuter rails is really a non- starter. It will. It will change the New York way of life completely. You do. You know how many people that the MTA police are how they're? How do I do not have the exact number, but they are, they are rotating. They are moving around. There's a mask force. Every few weeks, I'm going to participate in one of them giving out masks. What you said is what I have seen on many trains. I see 98 wearing masks, I'm wearing them correct correctly. I see one percent without a mask at all and one percent with the mask around their neck or just over their mouth, which is which is might as well be not wearing one. It's not doing any good by the way. The other thing just, incidentally, is that I think people are getting a little bit confused about when you're sitting in a restaurant and you're at your table. You could take your mask off to eat. A lot of people are now eating on the bus and train and taking their mask off, and I actually heard someone say you know you've got to put your mask on yeah, but I'm eating yeah, but you're not supposed to be eating on the on the bus to train anyway and literally, for you know, 20 minutes of a particular commute. This person was just eating without a mask on and breathing, and it's just I I'm. I have not seen anybody even making a suggestion in a position of authority, yes and of the 50 fine that was imposed a couple of weeks ago has raised mass usage somewhere Andrew. That filtration system you mentioned sounds amazing. Is that something we could get? It is amazing. Is that like just for transit, or can we get that in our schools? I'm guessing that if it's successful on the long island railroad it will be expanded to Metro, North and subways and buses, and I'm guessing. Everybody would want to take advantage of this because it has such promise. It would be a game changer. I'm sorry. I have one last thing this is before I forgot to so we have occupancy limits right in restaurants and stores and for various reasons. Again, I'm a proud- and you know, strap hanger, but I have been on the bus when it gets very crowded and I find myself you know during rush hour as people are coming back and using public transportation, I'm now two feet away from someone's face whether they have a mask on or not. What I choose to do is get off the bus, because I am scared, so I do not want to discourage anyone by having occupancy limits, but there's a practical issue here. If a bus is jam- packed it's you know, the idea is six feet apart and a mask not six feet apart. You know not you know a mask makes feet apart and a mask right. It's not always possible on public transportation, obviously, which is why we need this air, filtration and or vaccine or combination of sooner rather than later, but that situation you described Doug if we have 40 service cuts. Just imagine yeah Andrew you have, I see, Celeste Miller has her hand up, I'm not sure. If that's yeah, I see that celeste. You want to say something. Yes, I do I'd like to go back to the bicycles for a moment, and I know you're looking for new business for next for the agenda for next month, and this probably, I suspect, is not new business, but I appreciate the concern for bicyclists, but there's also a big concern, obviously for pedestrians, particularly on Columbus and Amsterdam avenue. There is minimal adherence to the one- way street by bicycle, especially on Amsterdam you're, finding a lot of people coming downtown on the bike lane and also paying attention to the lights which the bicyclists are supposed to and for me like, and lots of people. I know we understand all this for people coming from other places into the city. It's a huge safety issue and I have to assume there's many accidents in the city where pedestrians are getting hurt. So again, I appreciate the concern for bicyclists. There are more pedestrians than bicyclists absolutely and everybody is a pedestrian, whether you take mass transit drive or a bicyclist you're a pedestrian. At some point, could I respond to that two things. One is the data that we have does not show that there are a large number of pedestrians being injured by bicycles. Now it could be that there are injuries that are not reported, but chances are that those are less serious. Having said that, I completely agree with you celeste that we need to protect pedestrians, especially vulnerable pedestrians and, in my mind, there's no excuse whatsoever for bicycles, either riding the wrong way or riding on sidewalks. I've been begging for years for us to have a joint transportation, bci meeting to address the issue of delivery cycles. It's a very complicated issue. It gets into workers rights, not workers rights, but just low paid workers, undocumented people who are barely surviving if at all and they're just complicated issues. I think we need to address the issue. It's a much longer conversation absolutely, and I beg us to have that joint meeting that we have not had for years, and we can. We can try to schedule that, just as an aside, I was at a restaurant on Second avenue adjacent to the bike lane there the wait. The way bikers are biking on second avenue. We're doing a much better job here on the West side. They are racing. Waiters have to take their lives in their hands to get to the outdoor seating bikes are on top of each other, and I saw several motorcycles and or scooters with license plates going down the bike lane there. So this is a city- wide issue. Fortunately, I have not seen too many go the wrong way on second avenue, but we've got big arrows on the sidewalk. I know the D.O.T has installed look both ways when you're crossing a bike lane, but I mean stopping at the lights and going the right way. I think, is the minimum that we should ask for of bicyclists and it protects them as well, but I think your idea of a joint meeting with Bci rich, because I'm guessing that the majority of folks going the wrong way on Amsterdam and Columbus are delivery, folks, who are trying to get their deliveries to their to their customers in the quickest possible fashion. And I understand that I do not hear you you're rich, you muted, yeah, it's what the customers are demanding. So I think part of the issue is making customers realize that if you want food to arrive in 30 seconds, you're, basically forcing people to risk their lives and other people forcing people to operate in an unsafe manner, there's also the complication of a lot of the restaurants are outsourcing their delivery. So it's seamless and these other companies that are basically forcing their workers to ride illegally. In order to do the deliveries that they're being forced to make have you brought this up to Bci at all, rich? I had under previous leadership. Okay- and I know this is the first time hearing of this, but I'm glad to facilitate that conversation, yeah and Steve Brown is really dying to have this meeting as well. Yes, he is so we'll include one schedule. We will schedule it good anything else, folks, I guess that's it guess that is, it have a great evening and stay safe. Everyone. Thank you. Thank you. Well done both.",
            "summary": "No we're just chatting great, because I know there are a lot of people who want to talk about Revel and about the helicopters.\nYou said in the meeting, because I was looking at the video from last just to see that my memory was serving me that we wanted to talk to the commanding officers, possibly about what they can do, even though, because they understand it's, a policy city- wide not to pursue, but maybe there are other ways to to stop they're not scheduled to attend.\nOne is discussion of a resolution supporting a bill in the New York Legislature S07876, which would assign pedestrian safety rating for every motor vehicle.\nI. Think it's all worthwhile, but ken one thing you did not mention: Does it rate safety on accidents versus other vehicles or just pedestrians and bicyclists?\nThere is a a significant safety advantage When people in the crosswalk have a better view of the cars coming and cars and cars have a better view of the people on the crosswalk when cars park close to the crosswalk, there's a blind spot that clearly results in injuries and unsafe conditions, and so what this resolution proposes is to daylight, the those intersections that where people with particular vulnerabilities, namely children and seniors, are present and to try to make those inter increase.\nI do not know how essential it is, but the idea was to increase safety where vulnerable people are on the street and at risk.\nI'm, not a committee member, obviously, but the one thing that I would want to make sure that we've leave room for is a follow- up to the discussion we had last month and in July about the request by people with disabilities to change certain parking regulations so that their placard would allow them to park a vehicle that allows handicap.\nYou should say that, because in some areas where there is a bid that can help with the maintenance, when we do daylight and intersection like that, we would probably have a planter and a quick curb so that no one can you know pretty much be in that space.\nI know just like the ideal situation is where you can ultimately bump out the the sidewalk in the crosswalk, making a shorter crossing distance and a more attractive intersection for pedestrians, but that's down the road , it's capital, money, Now, we're talking about all schools right and senior centers, but I would not us.\nThat is very depressing, as he and I think six other Congress members had put forth that legislation, the improving Safety Helicopter Act of 2019 in October, As well, we'd have to get Schumer, but at least it was a federal ask by Congressman Nadler for the first time, given that he and others have been fighting this issue for over 20 years.\nYou know, we've been Andrew, Rosenthal and I have been reaching out to people throughout the city, different boroughs as well, and we're going to reach out to New Jersey.\nYou know, Brewer has been asking for a long time to have numbers and identifying words on the bellies of the helicopters, and you know we're open to other ideas, because right, now, they're, not they're, not a party to the 2016 agreement with the city in the lower Manhattan heliport, because these are all flying from New. Jersey people have the Flightradar24 Flight Tracker app, which I recommend everyone download the free one on your iphone.\nThere are a lot of folks who do not join these types of community meetings, who are flying privately into and out of Manhattan, and that needs to be regulated in a responsible, way, and That's come to me over the past few months as something that, especially in the Covid-19 era, people won't get on the subway, but they'll get in their private helicopter to drive.\nA lot, and I look forward to speaking with the team and remaining on the transportation committee on CB7 to try to address it and really prioritize it in a way that we need to get.\nWe have some decently reliable statistics, because my thought would be certainly for the activists on this issue, the focus and perhaps put pressure on the organizations that are operating these helicopters, and I think we should know if there are pressure points by who's operating them.\nWho is doing research on this, so you could use you know you could easily go online and search helicopter tours New Jersey over New, York, City and you're, going to pull up a lot of these companies like liberty, For, us, I think that the industry is supposed to be self- reporting, and so it would be in just interesting if we could get the information directly from the industry as well, and I do not know if that would require some kind of a foia FOIL request.\nSomebody else knows, but I also believe that Gail Brewer's office was supposed to be compiling, updated information on this like way back when we all met in cb7's offices before the federal legislation was proposed by Nadler.\nThere was an awful lot of helicopters going to and from Teterboro airport for people who had private planes and then were coming back either from the hamptons or wherever other points in the northeast.\nI do not know if the community is going to speak up, but if they are not all right from the community, maybe committee questions first, I think that we serve the community, so I think it would be great to hear from the community first.\nWe sit in New York City under Class B airspace as class A b and C air space, which is restrictive, airspace, limited to IFR, instrument, rated pilots Then there's a VFR visual flight rules corridor over the Hudson, which is a north to southbound kind of like a highway and those that's only used in visual flight, rules, weather and under certain altitude and so in.\nThere's ways to do that where you can have these noise abatement proceedings effective, again, it's a federal policy, but you could ask for it for certain days of the week, They know what they can do, what they can't do, and the noise abatement procedures actually even limit the amount of power that an aircraft can use in throttling up in a certain area.\nObviously, New York Metro is an incredibly busy area with you, know, with three major airports: they're having problems handling well with Covid-19, A helicopter has been flying around for about the last 10 minutes.\nI want to ask Melissa, given that what were mainly what you're, mainly complaining about, which is, are the tour helicopters that, for instance, I understand, go to central Park and fly around Central park and show people what it looks like from 5 000 feet or whatever, given about fifteen hundred feet, What is the utility or the purpose of the Rosenthal and Chen bills?\nThat would be local laws that, given that we can't control apparently, who comes into our airspace from New Jersey We wanted to get a sense of what their reasoning was, and if there was something that we could do, we're, also reaching out to people that we know in New Jersey some electives.\nYou know maybe combined with our local New, York, City, regs or laws, and then people who are very frustrated along the New Jersey path.\nWe understand they're people in Jersey City, like I, said, hoboken, You, know that we have this almost a coordinated if possible, multi- state effort and by the way you know this issue is not unique to the New York Metropolitan area.\nYou know is, is a quality of life issue and it creates a lot of stress and that can also be quantified.\nIf people know of her, we should try to get in touch with her and just see if there's a way that she might be involved.\nYes, main thing I wanted to talk about is the issue of traffic helicopters, and I know Andrew, you mentioned at the beginning.\nThey'd want to be good neighbors, especially ABC TV is in our district, a lot of journalists and reporters live on the upper West side, And They're, really creating a huge nuisance for the people.\nAnd I see Melissa wrote that there's a first amendment issue and I'm not talking about banning free speech here, I'm talking about working with them to try to find creative solutions so that they're not antagonizing the neighborhoods that they're supposed to be serving and which they do their business in and which many of them live, and just to make them realize that the neighborhood really is offended that they would create such a nuisance right But you can, of course see that one channel does not want to be outdone by the other, so they're all going to have helicopters pretty obviously, but yes, I think we can.\nIf April joins us, after being with community board nine, we will ask her that Jay has his hand up and then mark, I think, wants to speak just a quick, suggestion.\nWhatever it is where the helicopters are going to want to get aerial coverage, So I actually will listen, and you can hear you know ABC and CBS and NBC helicopters, and then you have a real problem, because I've actually heard this in real time where the NYPD has to ask the news copters to clear out, because they're involved in an active, scene.\nSo we know that you know the flights have decreased out of the heliports, but EDC stance at the moment is that they think that a there's a lot more tourist flights coming out of New Jersey, that's causing this traffic, which has always been the issue, but then b.\nThey have it and they're looking into it great, because we raised issues with access to the curb and the West 72nd street Howard, I.\nYou know he really meant kind of open- ended until the virus issues, hopefully God willing, are resolved or literally permanent, Jay. Jay, I, mean, I think, we're still working logistically with city Hall, and you know fine- tuning.\nIf we're talking about permanent or even long, term, I mean we have processes for things like sidewalk, cafes, etc, and if these things are going to be even semi, Permanent, I think that we need to have some process of evaluation for each one.\nI think it just adds just a great new dimension to New York, City, obviously much more so in the nice weather, but it just you know, really enlivens the streets.\nHaving said that, I think there are ways that in making it permanent, it could be There's potential room for improvement, and, in my mind, that really gets back to sidewalk use and the need for.\nThe, West, End Avenue open street was there's a great deal of confusion on my mind about exactly how that's being monitored and administered and to the extent that we talk about extending this, I, think we need to be a lot clearer than we are right.\nI think it's a little bit like we were talking about the open, seating, restaurant issue, where a great idea was pulled together at the drop of a hat to to address a need.\nI want to echo what another person said to people before me about the safety issues, which I think we all are aware.\nI. Think signage is a huge issue, because a lot of people who turn on these streets have no idea that they're closed And You can't read: them: Maybe people would see it better.\nI know it involves community and involves time, but I think there's a way to make the open street on West end and elsewhere, really a fun space.\nThis is Jesse, I'm living in upper west side near Riverside, drive and My question is simple: regarding street parking, and recently I saw a lot of off- state license plate vehicle parking upper West side for a whole week because of the pandemic, season, city, changer, parking, regulation, and I believe we have both already submitted requests to study this situation in the in April 2020.\nIt was to figure out what was going on with the curb and find out, and you know find the best use for this space is a concern we hear in almost every meeting And so that I, the sooner we hear about it, the better and obviously the pandemic, makes everything.\nBut right now, that's the situation and again we want it looked at to see if there's a way that the situation can be improved, one more hand, I live at 96th and west end.\nI felt, like I, had to yell at people to get off the street, because there were cars going back and forth all over the place between 95th and 96th.\nBasically, every night I think if there are people who have a real need to be able to park near their homes, I wonder if we should have something more permanent and more legal than this illegal, but you know potentially necessary parking.\nWe convert regular spots to accessible spots, but I think we do not want to encourage people to or even allow people to park on a narrow street either on the street, blocking traffic or or on the sidewalk, and the precinct does not do anything about it.\nAs Ken mentioned, more people are riding than ever: And I'd hate for it to just lose momentum, not get it the attention it needs and for there to be another fatality- As we talked about in that meeting, there is no safe legal way for bicycles to cross the park, except at 72nd street.\nYou know during rush hour as people are coming back and using public transportation.\nYes, I do I'd like to go back to the bicycles for a moment, and I know: you're looking for new business for next for the agenda for next month, and this probably, I suspect, is not new business, but I appreciate the concern for bicyclists, but there's also a big concern, obviously for pedestrians, particularly on Columbus and Amsterdam avenue."
        }
    }
}