{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB8",
            "channelId": "https://www.youtube.com/channel/UCS9hjBllkp127zguu5d_7Mg",
            "title": "Community Board 8 General Meeting",
            "publishDate": "2020-11-13",
            "shortDescription": "Nov 12, 2020",
            "lengthSeconds": "1:45:10"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB8",
            "normalizedName": "Brooklyn Community Board 8",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 8",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "l7TsOZbqP9s",
            "fillerWordCount": {
                "uh": 157,
                "um": 215
            },
            "readTimeFullTranscript": "53 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "land": 25,
                "motion": 23,
                "owners": 23,
                "building": 20,
                "information": 17,
                "chair": 15,
                "housing": 14,
                "changes": 13,
                "evening": 13,
                "business": 12
            },
            "wordCountSummary": {
                "land": 18,
                "owners": 9,
                "building": 6,
                "project": 5,
                "documents": 4,
                "applicant": 4,
                "housing": 4,
                "work": 3,
                "motion": 3,
                "boundary": 3
            },
            "fullTranscript": "Robert Callahan here, thank you, Hanji Charles, somewhere yeah. Thank you, Helen Coley, Norah Daniel here. Thank you, James Ellis here. Thank you, Kevin Farley here. Thank you. Andrea Ferris here. Thank you. Fred frazier drew Gabriel here. Thank you, tamika gibbs here. Thank you. Johnny Granville here. Thank you. Eugenie Harris Blendman Marva Henry Zuzima Jordan another. Thank you, Regina Kinsey Sarah, Lazar President. Thank you, Marie Lemayne! Thank you, Elaine mahoney! Thank you, Robert Puka. Thank you. Yaya Raji Adam, sacks present. Thank you. Brian Saunders, Meredith, Staton Brian's, here Brian's here Brian is here. Thank you. Mr Saunders, Camisha, Superville, Audrey, Tate, Paul, Mark Thurton here. Thank you. Greg Todd, Mr Tom, oh I, see him he's here. Thank you, Ethan Tyus, Miss Tyrus was here. Thank you. Mr mcconnelly give the coney here. Thank you, yves Villas, Kimberly, Watson you're, so Weatherspoon here. Thank you. Robert Witherback's, here, Deborah young. Could you reple repeat that number? Please 37! Thank you when 27 20, okay, 27.! Thank you. Okay! So tonight's agenda, we have we're going to go over the October minutes at our next meeting. As far as correspondence goes, you should be getting a notice in the newsletter regarding changes to the theft programs from City, Council and Ms. George had asked Ms George to tell us about any additional correspondence that we need to review yourself. A mute yourself. I said we do not have any at this time, but cara clock from Senate Elect Jabari Bisport has an announcement she wants to make. Thank you so much I hope everyone can hear me all right good evening. Everybody. My name is Kara Clark and I'm the chief of staff to the Senator Elect Jabari Brisport, who represents the 25th district and all of you so I just wanted to introduce myself and say good evening. The Senator Elect would be here himself to make these announcements, but he has a meeting with some other constituents this evening as well. So I won't take up too much of your time. I just wanted to announce that the Senator Elect's office is hiring and I wanted to share the job listing with you all for yourselves or to circulate to anyone that you think might be interested for his constituent service advocates. There are three positions that we're looking to hire so I'll share the job listing in the chat after I speak. The other thing I want to they're say, is in full-time positions for the office, but volunteer their time, they're more open to do so. Whoever has their Mic open. Please close your mic so that we can hear Miss Clark. Thank you. Thank you very much. Thank you. So if anyone is interested in volunteering for the office that are more than welcome to reach out to us as well and I'll, send an email address in the chat for people that want to reach out to us and then lastly, I wanted to invite everyone here to a town hall at which the Senator Elect will be speaking along with the assembly woman, elect to front forest about the New, York Health Act, and how that or statewide health care could improve the health of all new yorkers. So that's all I wanted to say to you all, it's so nice to see all of your faces and have a wonderful meeting, I'll paste those resources in the chat for you all. Thank you for sharing that we look forward to getting the vacancy notices so that people can check their education and past work. History meets your requirements, so I wanted to know from our fellow board members who are watching the chat if we have other elected officials or representatives in the audience who wish to speak at this moment, seeing none we'll go on to action. Item, Robinson, Kim, Robinson from House Woman, okay good afternoon, everyone, my name, is Kim Robinson and I represent Councilmember alika Andrey Samuel from 41st district on behalf of the council, member I bring greetings, I want to wish everyone a safe and a happy thanksgiving. Thank you. Thank you very much. Ms Robinson. We very much appreciate you attending our board meetings. You keep your finger on the pulse and rapid response. Timing is something we look forward to from the council member's office. It's always been there. Thank you very much, Ms Tyus, you're muted. Thank you. Thank you. Mr Ellis we're moving on down the agenda, which I hope everyone has next up is Mr Ellis with the SLA and sidewalk Cafe Review Committee Report. Thank you. Miss Tyus I also would like to add that as one of the monitors of this online teleconference, along with the other vice chair, Mr irsa Weatherspoon, we're asking. If there's any questions or comments to any issues to please ask all panelists, or we also will try to monitor the hand, raise function on the list there on your participants list. There's a small hand icon that you can use to indicate that you have a question or comment. If you use either one of these options, we should be able to monitor any responses and comments comprehensively and make sure everybody has an opportunity to have their question or comment heard or articulated. So thank you for that little piece of housekeeping that I wanted to share in advance as I move over into my committee, Chair Role position. I'd like to share a couple things. This committee really oversees permitting and applications for liquor licenses at the state level, as well as sidewalk cafe, permits for at the local level. Obviously, during the current circumstances, sidewalk cafe permitting is not necessarily a major issue, because the city has granted open access to use for businesses to set up outside. Also, if you followed in the news recently, I think, as of yesterday, the governor announced some restrictions and limitations on restaurant and bar service that will currently, if you have a SLA license, you will be limited to a 10 pm closure, starting Friday at 10 pm. This there's other restrictions involved as well for gyms as well as private gatherings, but more concerned with those licenses in our community board. District I say this because, as we continue to navigate through this process and trying to advocate for businesses to be good neighbors as well as neighbors to be understanding of current circumstances, I want to share with you a program that the city has that are concerns and issues regarding hospitality establishments or any business. For that matter. There's a program called Mend, NYC and I'll put the link in the chat. This is an organ. This is a through the office of tribunals and hearings that allows neighbors. Forgive me one. Second, I've got a siren going by all right. Thank you for that. Your patience there. So this is an opportunity for neighbors to be able to work with the business through a mediation process rather than seeking regulatory enforcement agencies on their activities. Typically, the business is willing to make some adaptations to their operations. If, knowing that there's concerns by neighbors and the community at large, so I really do encourage our neighbors and sharing with others to either directly speak with the business before reporting to regulatory enforcement agencies unless of course, there's a personal, a public health risk or public safety issue that needs to be addressed immediately. Then, of course, please take whatever steps you need to take in that case. But again the link is in the chat. It's called mend, NYC it's to help businesses and community members navigate through conflict resolution in a way that may not be punitive and cause the businesses any other regulatory enforcement concerns. So thank you for the opportunity to share that and now I'll move into our action item that we had from our last meeting. The SLA committee met on Monday November, 2nd by a webex. The committee entertained. One new liquor license application for Trinity, Girl, West, indian cuisine at 628, nostrand avenue for a license to sell beer. Wine and cider details of the application include hours of operation, 10 am to midnight. Sundays 8 am to 1 Am Monday through Saturday outside of current Covid-19 action activities. Indoor seating will be four tables with eight seats and one bar area with eight seats bringing a maximum patron capacity to 20. There was no outdoor space indicated on this application outside of current allowable Covid-19 opportunities, but all establishments are allowed curbside seating in the parking lane provided there's neither a bus stop or fire hydrant or other infrastructure. The committee voted 10 in favor, with no abstentions or opposition to support this application in hopes that the full board supports its recommendation at this time. I'll ask for any questions or comments on this action item. We'll start with any members of our community first and then we'll move on to members of the board. Checking for any raised hands. Miss weatherspoon. You can also I see a raised hand from an andrea. Would you like to unmute yourself and make a comment? It just says: Andrea in the participant list. I do not know, and then I also see Mr Robert. You know I'm trying to get the hand raised down all right, andrea, no problem, my hand is not raised. Okay. Is that Mr Puka? Yes, so we can clear out those races. Thank you. Okay, seeing or hearing no questions from any members of the community are there any questions from the board community Board eight members again either make a comment in the chat, raise your hand, I, believe it's between Pacific and thank you. Okay, no ques I do not giving just another five seconds to review to make sure everybody has a chance to unmute or make a type a question or to raise their hand. I do not see any so at this time I'd ask for a motion from any member of the community board. I move. We support the committee's recommendation, emotion, who is that second emotional by Tamika gibbs? Thank you and the motion was by Sarah Lazar, wonderful, to repeat for record motion made by Sarah Lazar Second by Miss Tamika gibbs any questions or comments on the motion. Seeing none Miss Tyus. We should call the roll. Thank you Mr Weatherwax! Thank you! Mr Ellis, Kearmini Allison. Yes, thank you. Mr Ellison, Linda, Andrews, Desmond, Lisa, Atkinson, Wayne, Bailey, Princess, Ben James. Yes, thank you. Miss Ben, James, Julia Boyd welcome back to Miss Boyd Gale branch. Muhammad! Yes, thank you! Mr Muhammad, John Buchholz! Yes, thank you! Mr Buckles, Robert Callahan! Yes, thank you! Angie Charles! Yes, thank you! Helen Coley, Norah Daniel! Thank you, James Ellis, President or yes, sorry, wrong! Vote! They're both true! Thank you! Kevin Farley! Yes, thank you! Andrea Ferris! Yes, thank you. Fred frazier brew, Gabriel, Jimmy gibbs. Yes, thank you! Johnny Granville, yes, Bill Gabriel unmuted himself and did Mr Gabriel Vote. Did you hear me Mr Weatherwest I did not miss Boyd, but I do now. What's your vote? Whatever do not say that yes or no I could do yes or no I can't do whatever? Yes, but I can't get this phone together. Yeah, okay, Gabriel Hi, Genie, Harris Blendman; yes, thank you, miss Blairis, Blendman, Marva Henry, yes, Susie, Mcjordan, Gina, Casey, Sarah, Lasser, Miss Jordan, just unmuted herself. Yes, thank you. Miss Jordan, Sarah Lazar. Yes, thank you! Marie Lemayne! Yes, thank you! Elaine mahoney! Yes, thank you! Robert Puka! Thank you, Yaya rajiv! Thank you. Thank you. Mr Sacks Adam! Sacks! Yes, thank you! Brian saunders! Yes, thank you. Carmichael Superville, Audrey, Tate, Hall, Mark 13, yes, Greg, Todd, Mr, Todd I see thumbs up ethel Tyus. Yes, thank you! Gib bocconi! Yes, thank you. Willis Kimberly Watson, here's a weatherspoon! Yes thank you! Robert Witherwax, yes, Deborah, Young, Vin, Lazunga Promotion passes 30 in favor. 3-0; no oppose no abstentions. Mr weatherwax! As always. Excuse me, I'm sorry. I could not unmute myself! Oh you're! Here, I'm I unmuted myself. Now I was trying to unmute myself, I'm sorry when you called my name, but I'm going to abstain, cause I'm just joining in and I do not even know what we're voting on. I'm sorry. Thank you. Miss Young. Thank you. Miss young welcome to my recordings, your attention and your practice. Thank you hi. Yes, this is yours before you continue. I just want to remind everyone, those who are making and second motions as you as you do this. Could you just please identify yourself, so we won't have to ask. Thank you very good point. Thank you, miss Weatherspoon, so I. Thank you all for the support of the committee's efforts. I want to remind everyone that the community board, AIDS, SLA and sidewalk Cafe committee, meets currently via Webex on the first mondays of the month, whereby we hear any application and renewals to liquor licenses within the boundaries of community board eight. So please join us and if you're looking for the dates and times, please contact the board office or check the website for details. Thank you very much. Thank you. Mr Ellis, well done well done. Next. Up is a report of minutes from the land Use committee meeting, which I will ask the secretary Ms Nord Daniel, to read the resolution and recommendation just a moment. Are you asking me? I'm sorry, you read the minutes? Yes, okay, no, the resolution same thing: okay, the actual animal is a resolution, application lpc21-00136 for a certificate of appropriateness to legalize facade, work and installation of a mailbox in non-compliance with certificate of no effect 16-7468 for 875 marks avenue in the Crown Heights North historic district, whereas Guy Cohn of cone architecture presented plans and photos describing the project and whereas two of the seven condominium owners at 875, St, Marks Avenue, implored the land Use Committee to understand the financial burden caused by the prior owners. Cavalier treatment of the building's extraordinary details, curved windows in the Turret stone and wood detail, accents on the turret facade surrounding the fenestration, among other LPC violations by removing those details and whereas the project proponents presented the application as a hardship case damage done by prior owner. Notwithstanding that, apparently no research has been done into historic preservation requirements, related tax credits or grants, whereas damage done by the prior owner includes a placing a modern multi-unit mailbox in the front Airway, and whereas committee members voiced concerns regarding setting undesirable precedence by supporting supplications from owners requesting forgiveness for out of character. Work done in violation of LPC permits and whereas, based on the work presented, Committee member Deborah Young moved the committee to withhold support for legalizing inappropriate work for the second by Sarah Laser and whereas 11 community members voted to withhold support for the project that's presented with. None against no extensions, therefore, be it resolved that the committee withholds its support for the above described application certificate of appropriateness network in violation of Lpc's permit and recommends that the full board do the same okay, Mr calling we can hear you coughing, you have your hand up now. You would like to say something before we put this to the full board. Yes, I would, if I could please? Yes, okay, three minutes! Thank you very much. I appreciate the opportunity to speak in front of the full community board. I sent a letter along with some supporting documents yesterday to the community board, which supported the case that we had presented to the land Use committee that showed that the building owners, through no fault of their own, were the victims of the developer, Mr Boaz Gilad from Brooklyn capital. That was information that we did not have at the time of the land Use Committee meeting. We were somewhat taken aback by the reaction that the land Use Committee had towards the owners of the building, and so we felt that it was important that we would send some supporting documents that show very clearly that the owners had entered into an agreement with Boaz Gilad and that he broke the agreement and that Brooklyn capital went bankrupt and they tried to contact. The attorney general's office actually did contact the attorney general's office and sent letters through their attorneys to try and get some sort of closure and try to get Mr Gillard to honor his agreements, and basically they were as I as I explained in the landlord's News Committee meeting. They were the victims, they had no idea and were not complicit, and it was to no fault of their own and they've been spending the last couple years trying to figure out how to deal with this issue and that's when they brought me in and I just wanted to make the appoint the point that and that these were. These are average everyday people, there's they're teachers, they're artists. They are just like everybody else in the community and that they are victims here and that's why I wanted to express my concern that the community board, at least at the land use meeting, felt that they might be somehow at fault or complicit, and that I just wanted to reiterate and that's why I sent that documentation to Ms Tyus, so I sent it yesterday because I just obtained it yesterday. So that's why I'd like to just make the point that they're trying to work with the community board. They want to work within the community. They want to try and rectify some of the issues, we're willing to work and rectify some of these issues, but there are other things, such as the bays and the replacement of the windows which are so financially difficult that it would and disruptive to the building that it would be almost impossible for them to be able to afford it and the idea of getting grants, and things like that are very difficult for private homeowners in this particular case. So I just wanted to try and appeal to the committee and say that we're willing to work with you, but we also would like to sort of set up a dialogue and see if there's things that we might be able to work with and keep and other things that would be easily corrected, and so that's what I wanted to say. Well, it's been it's been more than three minutes. Mr Cohn and I personally feel that the presentation that was made to the land, Use Committee was not as in-depth as it should have been, but I want to hear from one or two committee members and then I would like to see to ask you if you would be willing to put off your LPC hearing, that's coming up on the 17th and do some more work on what can be done to save the wonderful details on your building and come back to the land use committee in December or January. So I want to hear from a couple members of the land, Use Committee or the full board. What members is there? Anyone who would like to speak to this issue? Mr Tyler? Yes, I have my Hannah Deborah Young. Thank you. Thank you. Okay, Miss Titus, hi, glad that you made that suggestion, Mr Cohen I did read the documents you sent. The only comment that I have in terms of that is that I did not in my because I made the motion and it was not against the owners I understood very clearly that they were the victims. So whatever comments that I might have made and the discussions that I heard were not targeted at the owners, it was about the legalization of the proposal in a historic district. That's what was on the table but as I thought about it from the land Use committee meeting and upon reviewing the documents that you submitted yesterday. I wanted to see if we could come up with a way that could be a win-win for everyone. Clearly, I do not support legalizing the pro project as presented so for me, I would support if you would go back to the drawing board and come back to the land, Use Committee for further discussion and see where we might be able to meet. So it's a win-win for everyone. We just can not just blanketly approve things that do not fit into the historic district. We've worked too hard to maintain our properties and to maintain the historic district, so we're very cautious of when things like this is presented to us so again, I think it's a win-win for everybody. If we could come back to the table, that's all I have to say thank you. Thank you. Mr Weatherspoon who's! Next, did you have a question? I did not have a question. I'll just be very brief, though kind of building on what Ms Young had to say, I do not I. Do not think that the result of the land Use committee meeting should be taken as a as laying blame as defeat of the owners of the building approving proving retroactively. That was not the historic district, unfortunately sets a precedent that will be an encouragement to other property owners to not adhere to the procedures necessary to approve these sorts of changes in advance, and it just makes it just very difficult to maintain and I think that's really the takeaway. It's not a it's, not a referendum on the integrity of the people who live in the building. It's just right. It's just what's necessary to be able to manage the historic district. Thank you. I would also like to say something as well. Mr Cohen. What kind of stunted me a little bit is when you use completely and I do not I do not believe that any of us walked away or felt in that discussion that they were complicit to what it is. A developer did or did not do I think that we were really clear about how we we, you know that we can. You know we that we do understand the difficult situation that they have found themselves in, but I just that was not a take away from me that they were complicit so I just needed to speak on that word that was used. Thank you. Miss Weatherspoon. I'm also monitoring the the comments and questions that I noticed that both Rob Puka and Sarah Lazar have their hands indicated. I also see a third in line with Mr Robert Callahan. Just a quick point of information. Sorry one second Mr callum, while waiting for the chair to call you I was just acknowledging who's in cue, okay, I believe you mentioned Mr Puka being first I did and then miss Laser, Lazar and then Mr Callahan. Thank you, Mr Puka. Yes, my question was I. Wanted to I. Wanted to. You know, get third, what everything everybody said about it, not we're not holding the owners complicit I had a I had a question about the owners. I had an issue in my building and we ended up taking that alone. To you know to finance the the changes in the building has have the owners consider that I'll have to answer for Mr Cohn. The presentation, as I mentioned earlier and, as we heard this evening, is devoid of any numbers or any details on the financing and I tried to make it clear to the applicant and the owners during the land Use committee meeting that this section of the community district, the historic district over this part of cva, is still considered. Most of it is still considered distressed census, tracts and therefore homeowners can avail themselves of historic preservation, tax credits, which the credits can be spread over a number of years, and it was apparent from the presentation and from the comments from the owners that attended that they were totally underway. Unaware of these documents, in addition to the grants and and as a source of funding, to restore the building properly to what its former glory was. So they are they're not aware of it. I hope that, as time goes by, they may take advantage of these programs that are only available in certain areas of historic districts throughout New York, I'm sorry, who's, next Mr, Miss, Lazar and then Mr Callahan. Thank you. I am general, I'm overall in agreement with everything that has been said so far, I guess: I I, I'm feeling like the way that Mr Cohen has presented this is to set up a sort of tug of war between the owners of the building and the land Use committee and I, just I do not feel that was the case. I'm I do not feel that that's what was communicated at the meeting- and you know the owners of that building are not the victims of you know the historic districting rules, etc. They were victimized by the developer, who took off without fulfilling their duty to and also after having damaged the cultural patrimony or the artistic or the architectural patrimony of the neighborhood. So the solution is not necessarily to just you know, give it a blanket pass just because these particular owners did not know what they were doing and I would encourage the owners and their advocates to work with the very knowledgeable head of the land, Use Committee, to work with chna, to discuss all of the options for restoring the building to as close to its original condition as possible, which I just personally I, do not think, is possible in having a vote tonight and trying to follow the the calendar that you had imagined prior to this I. Just I do not foresee that as being possible. So thank you. Thank you, miss Lazar, Mr, Callahan and then I have a one of the property owners. Who's indicated that they'd like to speak so Mr Callahan, please, yes, just a brief point of information, Miss Tyus the documents that Mr Cohen is referencing I, actually can't locate in in the forums I I'd love to have a chance to review those documents before we take any sort of action, so it I do not mean to put anything off. I I think that the action that's being proposed is appropriate to give us time to review the documents, but just wanted to know if I had not if I had misplaced those or if they just had not been distributed. I do not believe they were distributed to the land use committee, but I have to ask the Miss, George or Ms Neil to confirm that they were not. They were not just the people that he emailed; no, they were not so now we have the applicant here we're not going to revisit what was done in landing committee. Okay, we do not do that. What we can do tonight is is to take a motion from the core on how to perceive the applicant. If we decide to support the applicant and looking at making changes to the project proposal, the applicant would have to agree to withdraw from the scheduled hearing that they currently have with Rpc. So those are, those are avenues that you can take and at this point I have to ask I have to ask the committee the the board for a emotion on this side. Madam chair, I, think I indicated that we have one of the property owners that has to speak. Okay, yes, thank you. Mr Ellis I want to be clear. We do not want to revisit what the work that was done in the land use. Community I would argue, Madam chair that a response on behalf of one of the property owners to many of the members comments would be a fair and equitable opportunity for them to respond to what was said by other members. I understand your position put clearly and we did have Mr Cohn make their case to them. This was a. This is one of the condo owners. I understand that they have a representative. I'm fine I just wanted to be clear as to the fact that there's someone that was wanting to speak and then Mr has a response too. So that's just keeping traffic flow I appreciate your your support for the homeowners there and they're. They had the first opportunity to speak. Thank you. If I can be clear, I was not trying to express support for the homeowners. I was expressing I was expressing their opportunity for them to speak. Okay. Thank you all right. So we're I'm asking now for a motion from a board member on the recommendation from the land Use Committee I'd like to make a motion that we hear from the homeowner. Oh I, second I. Second, that motion I do not think we need to vote on that. It's it's a common courtesy! Okay, as I said earlier, their representative was the first person to speak on this item, but we will hear from one of the homeowners. Thank you more I'd like to second, what Mr Callahan had to say. If there was a document that was relevant to this evening's deliberations, that was not distributed to either the land, Use Committee or the full board I think that's a problem, but we'll deal with that in a few minutes, the name, the name of the homeowner that requested to speak, is sorry, I believe it's Mandy, Moxley Miss Motley. Please make your statement three minutes please. If Miss Moxley is calling in, she has to press star six to unmute herself Star six to unmute yourself on your cell phone. Okay. I, do not see her in the in the participant list is I, think Caitlyn, Henderson yeah, maybe there's another home, Caitlyn Henderson, I'm not sure, but as we move forward and take a vote on this, please Mr wither wax correct the list of the role it's 875 St marks. I will do that and since now the homeowners are here, perhaps we could hear from Mr Cohn as a final word. That would be good. Thank you. That would be good again three minutes. Thank you very much. It won't take three minutes. I believe that the homeowners are willing to work with the Community board and postpone the landmarks hearing. We feel that it's important that everybody gets all the information that we sent out and that they're aware of the situation and also aware of what you know everybody is willing to do and try and bring the the building back to as much of a historical, the original historical appearance as feasible within their means. So I think everybody is willing to work with you. We we're happy to do that and I think we're willing to postpone the LPC hearing to begin those discussions. Mr Conway I give you contact information for a representative, the representative for kings County at the state, historic preservation office, so that you can conference with him to get information on the historic preservation, tax, credit programs, as well as the grant programs sure, of course, okay. His name is Daniel Mcinerney, M, E, N, Y and Y. Let's see five one, eight two, six, eight two one, six two and I know he'll, forgive me for giving out his mobile phone number because they're not in the office, no problem. Okay, let me give you the office number just in case five, one eight four, two one four thousand got it: okay so, and they have a very deep and carefully presented website. New, York, State, Historic, Preservation office, SHPO Madam chair. If I may work to dispose of this item, as I said earlier before, it was proposed that we hear from two or four or other people. I do not know what he said. I'm prepared to dispose this and make a motion to send this back to committee for a review under the understanding that the applicant is withdrawing its or cancelling its hearing date at Lbc, okay, I. Second, that irsa. Thank you. So we'll call the role on that. Please Mr Witherwax, but can we confirm with the applicant that he will withdraw his LPC hearing? I? Will yes, and will he send confirmation to the board office for our records as soon as possible? Certainly, and will you all distribute the documents that we sent around as well, I'm seeing indication from our board office that they will thank you for Miss George. Thank you very much. Yes, George is shaking her head. That she will distribute the materials, and so we have a motion to return the item to committee and we have a second for Ms Witherspoon, and we will call the goal of that now that we have agreement from the proponent to withdraw from LPC and Implicit in that is not to file again until you've appeared before a committee. I do not know how to do this. So excuse me, if I'm being disruptive, but how I think it's going to be important for not only us but for applicants to know what they need to come back to the table with and I'm not so sure about how we do that with them. I mean there were some issues with what was being proposed, but I think in all fairness, for them to come back, not knowing what not being clear what our concerns are about. What their proposed plan are is just us revisiting, possibly revisiting where we were before I talk with you, I agree with you 100 ms young, and what I would ask that they come back with. Is a plan to restore the things that Ltc has asked them to restore for the violations that issue? Excuse me the violations that were issued, so that would require a cost analysis and visitations from contractors that would give them quotations for the work to be done. That would meet Lpc's requirements for restoration to a status pre-removal of the curved windows and the slate or stonework on the on the turreted, rounded turret, and the doors being placed back with the glass in the front and all of the things that LPC cited them for those. That is the standard that they would have to meet, and they need to cost that out and figure out how they divide those costs amongst themselves and plan for the tax credit. That's what these tax credit programs are for to reduce that financial pinch when you, when you want to do the type of detailed work, that's involved in these 100 year. Old buildings is not just slapping up some concrete and plasterboard the way they do now. So that's what I would expect they to meet the violations and cure them in the spirit of the recommendations from LPC. Is that what you're looking for yeah that well I would ask Mr Cohn to say whether he understands clearly what we would be looking for if he ig and as long as he understands what he needs to come back with? Okay, I just wanted to add. The motion that I made was just to send back to committee. I. Think the conversation of what the applicant needs to do in that committee meeting is a discussion that can be had with the committee chair and potentially other interested parties in advance of the next meeting. Okay I said, but in effort to dispose of this item telling tonight's meeting and guarding in taking the sentiment that I've heard from many of our members as well as other conversations the item, the motion was just to move it back to committee for additional review before making a decision on this. That's right! Thank you! Thank you. Mr Ellis and Ms Weatherspoon I believe we all agree with you and what Ms Young is trying to do. Is to make all of that activity truly fruitful and focused and productive at the end, because between now and the time they come back to committee they'll be working and Ms Young's recommendation was to give them the proper target to work toward, and I'm with her 100 percent and I appreciate the motion from you and the support from Ms Weatherspoon to have them do that work. Now they know what the work is so again to return it to committee. That's emotions on the floor. The question is seconded and I again. I ask for a roll call, hear me allison, yes to support. Thank you, Mr Ellison, Glinda, Andrews, Desmond, Atkins, Lisa, Atkinson, Wayne, Bailey, Princess, Ben James. Yes, the support! Thank you Julia Boyd! Yes, thank you! Gail Branch Mohammed! Yes, thank you! John Buckholtz! Thank you! Mr Callahan, Robert, Callahan Hi. Thank you, Hanji Charles! Yes, thank you. Helen Coley that they wanted. They wanted to feel like more involved. James Ellis, yes, Miss Daniel! Yes, thank you! Kevin Farley! Yes, thank you! Andrea Ferris. Thank you drew Gabriel. Yes, thank you jamaican gibbs! Yes, thank you. Johnny Granville Jeannie Harris Blendman. Yes, thank you marva Henry. Yes, thank you, susiema Jordan, thank you. Miss Kinsey, Regina Kinsey, Sarah Lazar. Yes, thank you. Moray Lemaine mahoney! Yes, thank you! Robert, yes, Raji! Yes, thank you, Adam Sax Upstain! Thank you, Brian saunders! Yes, thank you. Meredith Armisha, Superville, Audrey, Tate, Hall, Mark Thurton. Thank you, Greg Todd. Yes, thank you ethel times. Yes, thank you give for Tony. Yes, thank you. Angelus Kimberly Watson is a weatherspoon. Yes, thank you. Robert Witherwax, yes, Deborah young! Yes, the motion passes 28 in favor. One abstention. So now Mr Cohn. Are we clear on the next steps? Yes, I am and we'll begin putting together some information and package that we can start discussing with you. Okay, would you please send us a copy of the copy of the board on the email that you sent to LPC requesting a postponement? Thirdly, absolutely. Thank you very much. Thank you. Okay. You're welcome next item up on our agenda for this evening. I. Do not think that we've had an opportunity to hear from any other elected representatives in New York in the audience, Ms George good night, everyone- this is Karen chambers, I represent the Brooklyn district attorney's office, I bring you greetings tonight. I just wanted everybody to know that we are working remotely from home. Only 25 of the staff goes into the office. So if you have any issues or concerns, I'm here, I'm still working helping. My phone number is 718. 250-4877 and please reach out to me if you have any issues or concerns. Thank you. So much thank you. Are there other elected reps in the audience who wish to speak now? If not we'll go on to? We have our new district leader from the 43Rd Assembly district, he's on oh okay: where is he you do hello? Everybody hear me yes, hi. How are you good evening? Everyone Madam Chair, Executive Board and the rest of the community board. Eight members at large, my name is Edu Herman and I am the new Male district leader and New York State Committee men for the 43rd, assuming district I have 20 years of experience. Working in government and in education and I look forward to working with all of you in ensuring that we can move this community together. I am also an active member of Kappa alpha Psi Fraternity incorporated, and we do a lot of social community activities throughout Brooklyn and Queens and we're looking to do part we're looking to partner up with Committee Board eight to do some community outreach. Once again my name is Edu hermelin I am the new Male district leader and New York State Committeeman of the 43Rd Assembly district. Thank you for joining us. Thank you. Man, Indiana wow, hello, I, was about to say Mr Hermelin. Thank you for joining us. We look forward to working very closely with you to make life better for everyone who lives in this district. Thank you very much so who do we have up next Ms Weatherspoon Mr Ellis, a representative from Senator Myrie's office? What is his name? Godfrey is Godfrey. Still here, Godfrey yes looks like he's. He might have left I think we should move on to committee reports first up at that would be economic development, I believe that's chairman, Brian saunders, leading the charge Mr saunders good evening. Everyone just want to tell you to do a brief update. I was going on at Economic, Development Committee. We had a meeting this last Tuesday and Franco Poplar made a presentation. The media's been kind of on reserve status for the last few months, so welcome aboard new members so come and get involved with. As far as helping this committee to support or look forward to working with it where everyone together I'm meeting, you are usually the second Tuesday of every month, which can be referred to go back to Miss, Charles, George or the website. But I look forward to having anybody could help me. You know, move us forward and just help us out in this drastic and entire situation, we're going as far as the economic and community itself, okay, Mr saunders. Do you want to do an advanced distribution of the proposal from popular bank on the business banking industry? Our meeting was about banker popular Business development, district and I was. We did not have a quorum for this last meeting, so we could not vote to support. So what I was sort of looking forward is to actually I mean a couple more members come together, community board members or future community members come together to find out what we want, as far as for banker papa to get the support from us and then at a later date pushing towards the full board to vote. But the president's moment is I. Do not think that we have enough, as far as like the needs of the community, to push you forward at this present moment. So that's why I need members individuals to come on board and to help me to find out what are our needs in this community before we can support and put it to the whole board. So I'd like to have at least one more meeting before this is like presented to the full board and I welcome anyone to come on board and help me out with this. Thank you, Mr Saunders, District, leader George. Would you want to doing advanced advertising on this, so banker popular sent out the presentation late today, so I will forward it to all the board members tomorrow, so everyone can review it. Thank you keep in mind everyone, the things that you would ask for yourself very similar to the things that a business owner would ask for their business lower rates for the services from the bank. The bank is going to get help from the government, take a look at what they put in writing and be prepared to join Mr saunders at his next meeting the date he which he can announce and bring your asks too popular. So it's a good handshake. They get something and we get something Mr saunders. When is your next meeting date? It's next on December, the second Tuesday December, 8th, December, 8th, December, 8th, so that's good that'll be that'll, be on the calendar and Mr saunders will share the information, hopefully in advance and make sure you bring your you bring your the things that you would want for yourself or for your business to that discussion. Well, I got the information later this evening. I pass it on, and hopefully everyone on this call can get the information by tomorrow and then we can move forward. That way. Thank you. The next committee report would be from youth education and use no report, Marvin Marva, Henry or Norma Daniels, nothing to report. Okay, next committee Est on meetings. We did not meet this month. You have to speak louder, you I'm barely hearing you sorry I was having trouble. Can you hear me now very faintly turn up your speaker? The youth and Education Committee did not meet this month. Okay, no meeting, okay and your next meeting is when December 1st at 7:15 pm. Okay, thank you very much. So next would be Est good evening. Everyone Robert witherwax, chair of the Est Mr Weatherspoon, is the co-chair of the Est Committee. We did not meet in October. We will be meeting a little off a rotation because of thanksgiving we're going to meet on the third Tuesday of the month, which is the 17th this month. So it's this coming Tuesday Agenda to be determined, but it might include a review of the co-naming application and in the coming months we do not have a date set. Yet we're going to hear from the department of information and technology about some of the new 5 g infrastructure. That's going to be coming out into our district soon, so hope to hear from you and see you on our zoom on Thursday. Thank you, Mr Witherwax Next committee report should be from the health committee. Hey everybody, so we are getting restarted as the health committee next week will be. Our first meeting it'll be Thursday the 19th from six to seven. So please join myself and tamika. It's a really exciting opportunity because we're going to be setting all of our priorities for 2021. We have a draft list, but we're really enthusiastic about hearing from the board and the community about what everyone thinks. Our health priorities should be going into this year, where health is extra, important, yeah, so come out and we're looking forward to hearing from you that was short and sweet. Thank you very much truly appreciate it. Next committee report is from the housing committee would be Ms, Granville I believe Miss Granville stepped away, she'll be back in five minutes. So can we come back to her I think we should we'll move on to the Parks Committee, and here we could not hear you speaking Miss Tyler. It was no, it was actually it was actually here. So I'm just saying that I do not believe Miss Glinda Andrews is here this evening. No okay, then we'll move on to the public safety committee. I. Believe that's Mr, Thurton Mark Third got ta. Excuse me: I lost my voice over the weekend, so I'm going to have a little difficulty over here talking. We met on October the 26th, which is Monday Deputy Inspector Buddha Fortio was attended a meeting. He gave us a summary of the activities that we have going on in the in our community. We had an increase, unfortunately in shooting incidents and victims in the 77th precinct. We also touched on the scooter concerns. That's that we have all over the place that they're riding on the sidewalks, unfortunately with the 77 priests and the police as a whole. If, if a school is stationary, they could address the concern with the with the scooter, but if they're, if they're rolling off their riding away faster running through lights, the police departments will not chase them for safety reasons, for the pedestrians and for the other citizens. What else we have going on? Oh, we had a big change. Deputy inspector pierre Louise who's been serving the 77th precinct for about 20 years. He's moved, he's moved on, he's moved on to one police plaza is his last day was yesterday and he started his new position today. So all the best to him over there. Our next meeting will be on Monday November, the 23rd. We hope to have a presentation being done by representative from neighbors in action from the Sos. So is he going to give his standpoints of what they're trying to do to reduce the reduce their crime and and violence in the area without the police intervention? So if you guys can participate on that will be on November the 23rd, that's on Monday and we'll send out the invites for that and that's about it for public safety. Thank you. Thank you, that's very encouraging to hear very encouraging just hope. It's done cautiously. The next committee report will be from seniors, I, believe I, believe that's miss muhammad good evening. Everyone. This is Gail Mohammed Chair of the senior Committee the senior committee met in November and we usually do a wellness check and it's a challenge with meeting with the seniors because we used to have on-site meetings but because of Covid-19 we've been doing everything by a telephone conference and many of our seniors do not have computers or cell phones to be able to participate by by cell phone or by computer. So it's been a challenge, but we've been able to maintain about 13 seniors from the building David Chavis, which is located on Kingston Avenue between St John's and sterling one of the issues that came up last meeting. They were interested in getting vouchers for the fresh fruits and vegetables and thankfully Michelle has been able to secure vouchers for them and we're looking to give those out to them prior to the thanksgiving holiday. Also, we've been in touch with Diana Richardson's office, and today they delivered 300 meals to the seniors at on Kingston Avenue. Unfortunately, we sent back about 250 because we were not able by the time the foods arrived, the boxes arrived and we were able to make contact with the seniors. We only were able to reach about 50. so we had to send them back because they were perishables. There's also a joint venture about to happen where the seniors in the same building are going to get pre-prepared meals for thanksgiving one of the businesses on northern avenue, sweet Brooklyn, they're, donating 150 meals to the seniors on Kingston Avenue. Our next meeting is scheduled for December 2nd and we send out notices and people can call in for the meeting. I think that's it. That is such a fantastic news. You are racking them up gold star. That's help talk to my back about it with the because when they make those deliveries they are not, they are not able to come inside, so they have to do curbside and it's up to the facility to move those meals indoors so and that was done today. That's fantastic! Thank you! So much Ms Mohammed there are some young folks on my blog who might be willing to come in and do the ferrying from the curb to the to the kitchen or, however, that would be helpful. Okay, let's talk about it. Offline, okay, I think we're going to go back now and thank you again. Ms Mohammed we're going to go back for the committed report on housing, I hope Miss Granville. Can you hear me I can hear you now, okay, good. We started out by talking about the tax liens. Our meeting was October 14th and as far as I know, the tax lien sale was postponed. They did not have it. There had to be some conversations with the elected officials and with the mayor because it seemed as though, because of the budget, he was inclined to have a tax lien sale anyway, even though it would mean that some homeowners would lose their property. We talked about some things that we could do this year as far as letters that could be written and one of the items that came up was the fact that the affordability level for afford the level for affordable housing was changed from 25 to 30 percent of the household income and when they look at 30 of the household income they're looking at the gross and not the net and they're, not considering electricity or gas, when they look at that. So it's a problem, Mr barack from the Bro President's office, recently had told Miss ties our chairperson, that a lot of people who have put in for affordable housing have been rejected. Because of that, and that's something that people were not aware of. So it's something that we have to take into account. The other thing I wanted to mention is the fact that we have. We have had some moratorium with evictions because of the pandemic, but some people have taken advantage of it to the point where they're not paying rent, even though they're still employed part full time and that causes a problem. So we're thinking that there should be something in the process where people should have to document the fact that they're truly unemployed and can not pay, because, if they're not paying and they can pay, it is a disadvantage to landlords who must continue to pay for the services in the building. So we're looking forward to other people coming out we're looking forward to hearing what other people have to say and that's basically, my report for October. Thank you very much. Ms Granville look forward to following up on that. It's a constant fight and we're glad to have members like Crown, Heights, Tenants Union in the group, so that we can make our voices heard. Let me see what else we're missing here. Miss George I have to come back to you for old business. Anything we need to pick up. Mr Weatherwax has his hand up hand up yeah, bylaws, yes, dialogue. I've got to do my three minutes of bylaws aerobics, so we're we've been present in November and we're going to vote in December, so tonight I need to go over the changes that we've proposed there are. These have been circulated all the members, but I'm going to just go over them for the sake of the record, so we made some changes to the membership we put in default languages for leaves of absence from board service. So if you want to go off board service and not resign, there's a procedure for that we did not have before we put a notice requirement in for excuses for meetings. Tell us you can't make it, and you won't have an absence on your record and we shorten the notice requirement for removal priorly at least 30 days. We shortened it to 21 days. We've made some changes to elections. How timely and topical we put in what I'm calling an escape clause in the event that we can not meet in person to vote, which is in our butlers and God forbid, Covid-19 stretches that would permit, and we, if we have a vacancy and a seat of an officer, and currently we have to have an election for that. But we've changed the rules to say that the chair should be able to appoint to the approval of the other officers to fill that a little more efficient, a little less vote. We made some changes to the officer rules. The chair is a non-voting member of all committees. The chair of the board is a non-member of all committees. We established the emeritus category saying that a retiring board chair who served two or more terms may bear the designation for the next board year and we put in some more specific definitions for the duties of our other officers, the vice chairs the secretary and the sergeant of arms. We propose a few changes for our committees. We propose that the vice chairs of each committee should be chosen by the board chair in consultation with that committee's chair. Previously, it was just by the board chair. We have proposed that committees have to meet at least four times right now the language is quarterly, which is a little muddy. Four times in the board year, we've rearranged the executive committee composition, we've proposed that only the officers and the chairs of the committees comprise the executive committee again currently, vice chairs also get incorporated, and it's just gotten to be about half the board, and we made a few what I'm calling miscellaneous changes. We've made it clear and explicit that the district manager has personnel authority. We have made changes to the bylaws of friends of cv8 that incorporate all of these changes automatically by reference and we've clarified the definition of board term and board year, which are kind of just muddied and mixed up a little bit in the text of the current violence. A term for a member or an officer is the two years that you are appointed or elected to serve. A board year starts in September 1 and ends in August 31st of the next calendar year. So we want to make sure that those two terms were clear. Those are the changes and next month we're going to have action items where somebody's going to actually propose we adopt or modify or reject some or all of these, so I look forward to that in December. Thank you all. Thank you for that update Mr Witherwax. So we are doing this again. I think. The last time the bylaws were updated was 2018, we're fine tuning them. I hope you will all take a very close look at what is being proposed and if you need an update, a copy of what is being proposed. Please contact the board office for a copy, I'm sure they were distributed two months ago. At this point, correct Ms, George, that's correct all right, so I want to back up a minute to a combined land use housing commitment can I just interrupt. Miss mahoney has a comment or, in addition to Ms Granville's information regarding the tax lien. Yes, you need to hear that yeah hi everybody I just wanted to add on so that the tax lien sale has, at this point been delayed, at least until early 2021, so we're looking at January, so I just wanted to tag a date onto it, so nobody has to feel nervous about it in December. At this point also, if you find yourself on the tax lien sale, the right thing to do is to get after your electives and dof, but to absolutely use social media as an advocacy tool to comment at your electeds in a public forum of twitter will get you a much faster and proactive response than a traditional letter writing campaign and the other thing I wanted to add. As far as the income limits on the affordable housing units, that is absolutely correct that it's gross and not net income, which is a bit unrealistic, but that rule is outside of the city's hands. That's a federal HUD regulation about how we have to look at affordable income brackets. They set the median income brackets, not the city directly, so it's something everyone has talked about for a long time, but unfortunately there's no local authority to change that interpretation of it. Thank you, Ms Mahoney I am not a fan of suffering and silence and our elected officials do not know what we need unless we tell them. So we need to tell them that they should make these decisions on a hyperlocal basis. It should be done on a district level. The lines are going to be drawn again in 2021 stay awake folks, because we will become roadkill if we do not keep our eyes on what's going on here. So thank you for those reminders and your opinions. I hope you bring them forward to the committees that handle them. As far as the lien sales we just want to avoid any mistaken transfers to third parties based on incorrect data has happened to one of our former board members previously, where sign off was done on misinformation, so I think we, the board, has to back up and we'll be sending a letter to the issuing agency. They have to respond according to the charter, and that would be the department of finance on that one. So we'll be working behind the scenes to get that letter out and demand a response, so I want to go back to housing and land use and talk about the meeting on the 10th where we had HPD come in and talk about their plans for senior housing and quasi market rate housing at two sites near in the M Crown Zone 15,516, Burger, Street and 542 Dean Street, so I'm hoping I can get Ms Granville will come back and speak about that Ms Granville you want to take it. Can you hear me I can hear you now to hear the opinions of the community who are not board members. Apparently, a lot of people feel that this rop is somewhat premature, that a lot of the details are missing and they're not really happy about the zoning. We I was not sure from what I heard if the zoning has to be changed to put the two buildings up as proposed. So a lot of people had questions about the zoning and they could not understand why rfps are being put out when a detail as important as a zoning has not been decided on yet so you can give them your impression, but I got the impression last night. A whole lot of people are not do not have too much faith in HPD and they also sound like they may not have too much faith in the Department of City plan. Thank you, Ms Granville, right now, the outreach for the HPD RFP is supposedly aimed at scoping what should be built there. They're planning for a design workshop on the 18th of November and this the links for these workshops are on the HPD website for the minority and women business enterprise contractors search. So if you want to attend that meeting by HPD, please go on to their website and fill out an rsvp, and so that you get the link they had planned to wrap this process up of scoping on December 10th. They have bruited about that. They have information or contributions from the community on what should be built there. But the first meeting with Community Board 8, where the projects will be located, was on the 10th, so we asked them to change their project, wrap up report back from December 10th to either December 14, 16, 18, 17th or 18th for reconvening and for the wrap-up. We have not gotten a confirmation back from them yet, but the survey deadline for them on their website for that project is the 27th of November. So you want to take a look at that. We had asked them to send us a brief presentation that they made but I believe that is also on their website. So we should be taking a close look at that: they're planning for the market rate site to subsidize the senior housing site and they're looking to build between 80 and 100 housing units on those two sites. So the contract award could be split between different contractors, we're not sure what's going to happen, but we want to work with HPD to help them make well-informed decisions, since this is going to be in our community district. So that's one thing: we want to continue to look at now, so that brings us pretty much up to date on old business. I'm sorry is there a new business? We need to cover Miss Tyus. Yes, this is Kathy. I'm sorry I asked if I had a comment in the chat. So if you, if you can recognize me or not, I'm recognizing you. Thank you very much. Thank you very much and thank you to Ms Granville for acknowledging that she was hearing from members of the community who who are in the northern part of Prospect heights, where the two sites are located and I. Think one of the important things to also stress, as you did, miss Tyus in requesting an RFP when zoning has not. Even there is no there's been no zoning announced to the community and what we some people were, making the point that, if you're requesting an RFP, the zoning will be baked into any proposal and we're being asked to comment on things that we do not have all of the information and what we really feel strongly as Andrew somer I. Think Alex, Omer and Winston Von Engel in talking about the entire M crown project, is that city planning needs to be holistic and this is not in any way as far as many residents of North Prospect heights are concerned, a holistic review and proposal, and we want to make sure everyone knows that we support senior housing in our neighborhood, but without information and without good planning. I think it that's. What we're asking for we're asking for further discussion for this conversation not to be happening so fast on the DCP side to already be having a design meeting without information, and you just said something: Miss Tyus, you mentioned a market rate site I do not think there. We had heard anything about a market rate site we'd heard about they changed from one site to the other site, but I did not understand that there was a market rate site. So maybe you could clarify that if you have information that we do not have, but thank you for letting me speak. I appreciate it. You're welcome Miss Tyson, Mr Bocconi, Mr Verconi has a comment. Thank you Madam. Thank you. Mr yeah I wanted to just make a couple of comments about this. There is no market rate. That's part of this project. The both sites are going to be affordable. The Dean Street site has been designated as being the site for senior housing. That site is the building that is intended to be built. There will make use of section 8 vouchers and, as such, will be deeply affordable to the seniors who live there. The Bergen Street building has not had any is supposed to be conventional, conventional apartments, fully subsidized all affordable, but the affordability levels have not been specified and that is I believe one of the key things to get into the RFP. At this point, there's been a tremendous amount of middle income, affordable housing built in Prospect heights over the last several years, more than half of atlantic yards is middle income and it's very difficult to give away in the lotteries, because the rents are almost market rate and as these properties are city-owned land and they are, they represent the lowest land cost you can possibly have for affordable development. In my view, there's no excuse not to make the Bergen Street building deeply affordable along the lines of, what's called for in the city's extremely low and low income. Affordability, programs I share the concerns about the zoning analysis. I think it's I think it's not possible for HPD to release the RFP without saying something more about the zoning that they've said so far. Hpd on their website does say that they're looking for art and up zoning to R7A. That presents a practical issue for any bidder, because if they're only talking about those two sites that are targeted for development for rezoning there's a requirement when R7A is next to r7b that there's a 25 foot transition zone between those two r6b there's a 20 there's a 25 foot transition requirement where they're limited to 65 feet maximum height as opposed to 95 feet as possible in R7A. In short, there's no way for a bitter, a bidder must know if they're going to be subject to that zone. Zoning Envelope before they can propose development there. So there's no way that can't be specified as a function of the RFP. So if HPD is planning on those sites alone being up zoned, they need to tell the bidders that, because it will significantly limit the floor area, they can develop. If they're planning for a bigger area, then I think they need to explain what that area is and how it's going to fit together, because in particular the Dean Street lot is right next to buildings in the Prospect Heights historic district that are zoned r6b if they were anyway. Let me just say it's important to know what the zoning boundary is. I, think everybody's calling for HPD and DCP to be clear about that and, in my view, that's a reasonable request. They should tell us what their strategy is there. Thank you, Mr Viconi, I'm struggling with the difference between 150 percent, affordable and market rate, but that's another discussion, I'm just I'm just what does that mean, though I do not understand. We could discuss it offline, okay, from what I heard they were planning a wrap-up, they meaning hp. He was planning a wrap-up on December, 10th and they've, been asked by myself to not have this wrap-up meeting on the night of our full board meeting for December and instead to postpone it to one of the dates that I cited, the 14, 16, 17 or 18 to wrap up and report back on what their decisions are going to be for this so somewhere in there. We will also be meeting with city planning. We should be asking city planning to sit in on these meetings so that we can nail down what the zoning will be from what I'm hearing from the community members who've been coming to the land Use committee meeting. This is something that we should be looking at lower zoning, but that would make the projects almost untenable. Economically, we're going to conundrum, so yeah I think I. Think that I mean if I might I mean I think that they should also explain what other zoning districts have been considered and whether other potential zones, zoning would have been financially viable for development, and they have not said that, but again, I think that's reasonable and they should. They should explain it, but I would like to propose that the community board formally requests Pcp and HPD to to share what the zoning boundary will be for this that's associated with this RFP, because it's it goes directly. They must know that what I'm saying is I hope that this is clear. They must know what it is for the bidders to propose. They can't not know this, and so I think that we should request it and perhaps I will even I will even move that the community board make that request of HPD in the Department of City planning that they that they disclosed to the community, the proposed zoning boundary at the at the urban design meeting and we tried to get them given. Thank you very much. We tried to ask them that question at the meeting the other night and they were not answering that question when we tried to ask that directly. So I appreciate you bringing that up tonight, Kim, because if you make, if you make a motion, I will second it gladly we're trying to speak in turn. Please acknowledge the process by either raising a hand or putting a comment in the chat. Okay, we have a nascent motion from Mr Bocconi. Could you rest restate your proposition? My motion is that the board request HPD and DCP to disclose the zoning boundary that's being proposed for the HPD RFP second, and that was Sarah Lazar. Thank you, Ms Lazar, Mr Witherwax. We have a motion on the floor to require HPD to disclose the zoning boundary for their mwbe RFP. That's under consideration now. Can we call a roll on that? Please I have I, have a friendly amendment. I do not know if the motion maker has will accept it, because I do not know what it is. Okay, gib I also wanted to be a maybe a little more specific to say. You know that they're asking for R7A to specifically say what zoning they're asking for each site, not just a zoning boundary. Well, they are asking for 7a on their website. That's what it says. Okay, so I mean I think that question has been answered, but the zoning boundary has not. Okay. Just from a practical standpoint, we're going to this is a request to HPD to disclose the zoning boundary by when by the urban visit design. Meeting that they're holding on the 18th of November from prior to the 18th. Is everybody clear on the motion? Hearing no objections, Kim Andy Allison! You have to support. Thank you. Mr Allison, Princess, Ben James. Yes, thank you! Julia Boyd! Yes thank Gail, Branch, Muhammad, John Buckholz. It's wait! A minute back up back, I, know, I, think she's still on the line. Miss Mohammed. Are you with us yeah? Okay, all right, Mr, Buckholz, Mr, Callahan little boy; yes, hey little boy, Angie, Charles, Laura Daniel! Yes, thank you! Miss Daniel, James Ellis! Thank you! Kevin Farley! Yes, thank you! Andrea Ferris! Yes, thank you drew Gabriel. Yes, thank you to Mickey kids. Thank you! Johnny Granville! Yes, thank you! Harris Blendman! Yes, thank you! Marva Henry Abstain! Thank you! Susie Mc Jordan! Yes, thank you! Regina Sarah Lazar! Yes, thank you, murray, Lemaine, Elaine Mahoney. Thank you. Thank you. Miss mahoney, Robert Puka. Yes, thank you! Yaya Raji! Yes, thank you. Adam Sax snacks may have left us Brian saunders, I'm sorry. This is Adam. Yes, sorry, Mr Sachs! Thank you. Mr saunders, yeah Mark Thornton. Yes, thank you greg Tom! Yes, thank you Ethan! Yes, thank you Giveaway! Yes, thank you. Here's a weather spoon! Yes, thank you! Robert Witherwax! Yes, Deborah young, yes gail! Yes, Gail was a yes thank you and Hanji Charles put in the chat that she said. Yes, she was not sure what was her. It was not so thank you, Ms Charles, Mr Ellis. Do you have something to add? I was just going to share the as I'm monitoring the Chat Miss Charles has come. Thank you. I had not heard that. So that's great, so that puts us at 28 in flavor. One abstention. 28 to 20. Excuse me miss Jordan. You want to mute yourself. Yes excuse me. This is irsa. I just noticed that Kathy Iceland had a question as we were voting. If can they confirm the zoning requests in the zoning boundary? Okay, as Mr Ficoni mentioned Hpd's website is announcing. The target is R7A, but we do not know where it ends. They do not know what the boundary they have not announced the boundary, so we're asking them to do that and we're asking them to make that announcement at the design meeting on November 18th. This is Hpd's meeting on November 18th, the RFP workshop design workshop for this RFP, but we have asked them to work with us on the wrap up and report back that they're advertising on their website for this project, and we asked them to get back to us on a date that is not our full board meeting date. It would be after our full board, so I will have to ask Ms George to work with HPD to get that commitment firmed up and to get this request out to them for the definition of the zoning boundary. Yes, look. We will get it out first thing in the morning. Thank you ma'am! So now, where are we on the agenda items? For today we have Orlando Ross from Congresswoman Clark's office, and then we can open it up to public comment announcements. Although elected official reps hello, everyone I just wanted to thank Miss everyone from Community Board, eight, who will allow me to speak. We did do an event and we wanted to thank Community Board, eight for the hand sanitizers and for partnering with us and making sure that the community is safe. As you know, we do have a newly elected president Biden, and we just want to make sure that our congresswoman wants to make sure that the Congress and everyone in DC respects that decision. If you have any questions, I am here and just have a great evening. Thank you. Mr Ross, it's good to hear from our Congress member we'd love to know what we can do to make the Senate Blue. So you can go forward from there move to Georgia one second, there are we would like. Well, I'm not going to say we would, but the way that you could do that is to try to make sure to partner with the Georgia democratic parties that are down there to make sure that that our senators are going to be put in place. But that's about it. You can just follow the news and I'll tell you what to do. Thank you very much. What else are we missing this george? Any additional public comments, announcements, elected official reps, anyone looking at all: attendees, hey, nope, okay, so hello, yes, who's speaking to a gift, I'm sorry I was, of course, I'm trying to find the what's name button. The unmute button I just want to extend the invitation. Just to I'm sorry, I'm in the middle of a bunch of stuff, the imperial bike is located on the corner of Saint. Martin Franklin will be doing our annual feeding the hungary. We have also been too close since March, but this is something that a lot of our shelter and our regular community members coming to come and enjoy Miss George. If it's possible, we actually have a meeting this saturday. If it's possible I can send a flyer to you, I think it's actually it'll be it's in December, but I do not think we have a meeting before we actually feed the hungry because we feed them for Christmas, because everybody feeds them for thanksgiving and nobody feeds them for Christmas. So just look out for our annual feeding the hungry. We also have a couple of things in the works, but again we're still trying to work around our parameters. It's copied time so look forward to that and everybody have a happy holiday. Thank you. Thank you. Miss gibbs, who else ms Weatherspoon Mr Ellis I, have no indications in the chat or by any reason. Okay. I just want to go back for a minute to the the motion to have HPD disclosure zoning boundaries, that is by November 18th, not on November 18th, but by their design meeting, which could be prior to prior to the November 18th design workshop. Okay. What else are we missing? That's it. We've covered everything. So unless there's anything else, then I asked for a motion to close the meeting again. Thank you all for coming and hope to see you at the land use meeting on December 3rd, we'll follow up and prior to that we have the RFP online with HPD on the 18th. What other updates should we be reminding people of happy thanksgiving to all that? Is it that's true? Thank you all right. So good night, all thank you all for coming.",
            "summary": "Thank you for sharing that we look forward to getting the vacancy notices so that people can check their education and past work.\nHistory meets your requirements, so I wanted to know from our fellow board members who are watching the chat.\nThere's any questions or comments to any issues to please ask all panelists, or we also will try to monitor the hand, raise function on the list there on your participants, list.\nThank you for that little piece of housekeeping that I wanted to share in advance as I move over into my committee, Chair Role position.\nKnowing that there's concerns by neighbors and the community at large, so I really do encourage our neighbors and sharing with others to either directly speak with the business before reporting to regulatory enforcement agencies.\nThe committee voted 10 in favor, with no abstentions or opposition to support this application in hopes that the full board supports its recommendation at this time.\nOkay, no ques I do not giving just another five seconds to review to make sure everybody has a chance to unmute or make a type a question or to raise their hand.\nI, want to remind everyone that the community board, AIDS, SLA and sidewalk Cafe committee, meets currently via Webex on the first mondays of the month, whereby we hear any application and renewals to liquor licenses within the boundaries of community board.\nSo, please join us and if you're looking for the dates and times, please contact the board office or check the website for details.\nUp is a report of minutes from the land Use committee meeting, which I will ask the secretary Ms Nord Daniel, to read the resolution and recommendation just a moment.\n16-7468 for 875 marks avenue in the Crown Heights North historic district, whereas Guy Cohn of cone architecture presented plans and photos describing the project and whereas two of the seven condominium owners at 875, St, Marks Avenue, implored the land Use Committee to understand the financial burden caused by the prior owners.\nApparently, no research has been done into historic preservation, requirements, related tax credits or grants, whereas damage done by the prior owner includes a placing a modern multi-unit mailbox in the front Airway, and whereas committee members voiced concerns regarding setting undesirable precedence by supporting supplications from owners requesting forgiveness for out of character.\nPresented, Committee member Deborah Young moved the committee to withhold support for legalizing inappropriate work for the second by Sarah Laser and whereas 11 community members voted to withhold support for the project, that's presented, with.\nNone against no extensions, therefore, be it resolved that the committee withholds its support for the above described application certificate of appropriateness network in violation of Lpc's permit and recommends that the full board do the same okay.\nI sent a letter along with some supporting documents yesterday to the community board, which supported the case that we had presented to the land Use committee that showed that the building owners, through no fault of their own, were the victims of the developer, Mr Boaz Gilad from Brooklyn capital.\nWe were somewhat taken aback by the reaction that the land Use Committee had towards the owners of the building, and so we felt that it was important that we would send some supporting documents that show very clearly that the owners had entered into an agreement with Boaz Gilad and that he broke the agreement and that Brooklyn capital went bankrupt and they tried to contact.\nWhy I wanted to express my concern that the community board, at least at the land use meeting, felt that they might be somehow at fault or complicit, and that I just wanted to reiterate and that's why I sent that documentation to Ms Tyus.\nThat's why I'd like to just make the point that they're trying to work with the community board.\nSo I just wanted to try and appeal to the committee and say that we're willing to work with you, but we also would like to sort of set up a dialogue and see if there's things that we might be able to work with and keep and other things that would be easily corrected.\nThat's, coming up on the 17th and do some more work on what can be done to save the wonderful details on your building and come back to the land use committee in December or January.\nSo I want to hear from a couple members of the land, Use Committee or the full board.\nWhat was on the table but as I thought about it from the land Use committee meeting and upon reviewing the documents that you submitted.\nClearly, I do not support legalizing the pro project, as presented so for me, I, would support if you would go back to the drawing board and come back to the land, Use Committee for further discussion and see where we might be able to meet.\nDo, not think that the result of the land Use committee meeting should be taken as a as laying blame as defeat of the owners of the building approving proving retroactively.\nAnd I tried to make it clear to the applicant and the owners during the land Use committee meeting that this section of the community district, the historic district over this part of cva, is still considered.\nThis, is to set up a sort of tug of war between the owners of the building and the land Use committee and I.\nI think that the action that's being proposed is appropriate to give us time to review the documents, but just wanted to know if I had.\nI, do not believe they were distributed to the land use committee, but I have to ask the Miss, George or Ms Neil to confirm that they were not.\nWe decide to support the applicant and looking at making changes to the project proposal, the applicant would have to agree to withdraw from the scheduled hearing that they currently have with Rpc. Those are avenues that you can take and at this point I have to ask I have to ask the committee the the board for a emotion on this side.\nSo we're I'm, asking now for a motion from a board member on the recommendation from the land Use Committee.\nThere was a document that was relevant to this evening's deliberations, that was not distributed to either the land, Use Committee or the full board.\nI believe that the homeowners are willing to work with the Community board and postpone the landmarks.\nWe feel that it's important that everybody gets all the information that we sent out and that they're aware of the situation and also aware of what you know everybody is willing to do and try and bring the the building back to as much of a historical.\nI'm prepared to dispose this and make a motion to send this back to committee for a review under the understanding that the applicant is withdrawing its or cancelling its hearing date at Lbc, okay, I.\nSo excuse, me, if I'm being disruptive, but how I think it's going to be important for not only us but for applicants to know what they need to come back to the table.\nAs far as helping this committee to support or look forward to working with it where everyone together.\nDo, not think that we have enough, as far as like the needs of the community, to push you forward at this present moment.\nI think we should we'll move on to the Parks Committee, and here we could not hear you speaking Miss Tyler.\nSo I want to go back to housing and land use and talk about the meeting on the 10th where we had HPD come in and talk about their plans for senior housing and quasi market rate housing at two sites near in the M Crown Zone 15,516, Burger, Street and 542 Dean Street, so I'm hoping I can get Ms Granville will come back and speak about that Ms Granville.\nWe want to make sure everyone knows that we support senior housing in our neighborhood, but without information and without good planning.\nIf they're planning for a bigger area, then I think they need to explain what that area is and how it's going to fit together, because in particular the Dean Street lot is right next to buildings in the Prospect Heights historic district that are zoned r6b if they were anyway.\nWe should be asking city planning to sit in on these meetings so that we can nail down what the zoning will be from what I'm hearing from the community members who've been coming to the land Use committee.\nThey should explain it, but I would like to propose that the community board formally requests Pcp and HPD to to share what the zoning boundary will be for this that's associated with this RFP, because it's it goes.\nMy motion is that the board request, HPD and DCP to disclose the zoning boundary that's being proposed for the HPD RFP second, and that was Sarah.\nThis is Hpd's meeting on November 18th, the RFP workshop design workshop for this RFP, but we have asked them to work with us on the wrap up and report back that they're advertising on their website for this project, and we asked them to get back to us on a date that is not our full board.\nIt would be after our full board, so I will have to ask Ms George to work with HPD to get that commitment firmed up and to get this request out to them for the definition of the zoning boundary.\nAlthough, elected official, reps hello, everyone I just wanted to thank Miss everyone from Community Board, eight, who will allow me to speak.\nWe, did do an event and we wanted to thank Community Board.\nThank you all for coming and hope to see you at the land use meeting on December 3rd, we'll follow up and prior to that."
        }
    }
}