{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "title": "Housing \\u0026 Human Services Committee Meeting",
            "publishDate": "2020-06-05",
            "shortDescription": "",
            "lengthSeconds": "3:04:00"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "L_G4lsfIFgg",
            "fillerWordCount": {
                "uh": 240,
                "um": 258
            },
            "readTimeFullTranscript": "82 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "language": 74,
                "person": 44,
                "gender": 34,
                "work": 28,
                "bill": 25,
                "taxes": 22,
                "pronouns": 21,
                "information": 19,
                "individuals": 18,
                "motion": 17
            },
            "wordCountSummary": {
                "language": 14,
                "person": 13,
                "pronouns": 5,
                "work": 5,
                "gender": 4,
                "individuals": 4,
                "housing": 4,
                "victim": 3,
                "conversations": 3,
                "member": 3
            },
            "fullTranscript": "Second, thank you. So this meeting is now called to order. It is 7:13 P.M just to begin going around. I guess it's not that we're having some new members joining us. If you, if each one of us can just introduce quickly ourselves so quickly I'll just say my name is Ariel Miranda. I'm the committee chair for the Housing Human Services Committee here pass along anyone else, oc coming our assistant, Chair Ruth, Robertson, Members, Marshall, Vanderpool public member okay. So I think if Alex- and I think we have- we have our two other public members- I do not think they're on today, but it's great to be meeting again we're going to be coming into the summer. I'm sure everyone's excited about it. Today we have a few items on our agenda, we're kind of revisiting some material that we mentioned previously, but we are thankful to have a presentation being done by none other than Naisha Diaz. She had mentioned that she wanted to try and present previously and discuss a little bit more about inclusive communication within the human services field, and so of course, I reached out to her this past month and made sure that we schedule some time so that she could present to us a little bit more about inclusive communication in the human services view. I want to just give a huge amount of thanks to Naisha for offering to do this and yeah I'll pass it along to Naiksha Naisha. Would you like me to do anything on my end? Can you access the share screen on your computer? I do not think I can access the shared screen. I do not know why it might be because I joined the public number link because I'm not a panelist. So if you all can guide me through it, maybe I can figure it out. Oh okay, that is odd. You should be able to because everyone is able to share the screen. Do you have to like a share icon next to the video icon like a little box with an arrow? No mine's is oh wait. Give me a second it's a box with the arrow up. I see it all right, so I need to quit the screen first. So I'll be right back. I'm sorry! So we'll just give her a moment here. While we're awaiting the presentation, do we have any other board members present? No, I believe it would just be us to today. Okay. So I'm back sorry about that. Let me just give me a second, while I think about this now. Okay, so hey, I hope everyone's doing well, given everything that's going on right now, so we can just get started. Can you all see the screen? Yes, yeah perfect, so this is just an Intro page and I also want to pre- face. This is just like an introductory very surface level like a set of guidelines and a brief overview of those guidelines. I have also given some resources at the end of the slideshow that you all can reference everything throughout the slideshow is hyperlinked. Let me just click on edit, or can you all please mute yourselves, because I'm having trouble hearing myself, I'm sorry, thank you. So I've included hyperlinks at the end so that you all and throughout the presentation, so you all can reference whatever I talk about so just in general. I wanted to give a brief definition of what inclusive language is, and ultimately it's just language that avoids alienating or excluding people or groups of people different ways that you can be excluded or people have expressed being excluded, is based on ability, disability or disability, age, nationality, language, accessibility or language barriers, race, ethnicity, religion, sex, gender identity, sexual orientation, and this is a very small list. I think this well, not that I think this can go on for as in any way, people can be included for various different reasons, and so here are just five guidelines that I've set up for us, at least as a committee, that I think that we should at least adopt as community agreements, because I think they're important in the field that we're particularly focusing on and just in general and everyday discourse. So our five guidelines are stay consistent with people first language, so using nouns before we use adjectives using active and positive language, so avoiding victimization and always putting a positive instead of a negative connotation using universal language, so avoiding idioms and ensuring that we're speaking play language using gender neutral language and not assuming individuals pronouns. So I'm going to just go through each of these very quickly, and I have some examples as well, so using people first language, just the rule of thumb, is noun before adjective on people, first, language, centers, the humanity of every person and acknowledges that before we are anything we are humans, identity, first language, which is often what is like, which what is most commonly used for. First one. I think individuals like density or a way to describe them before it refers to their personhood. I've included a link to the National Institute of Health that has more information about people. First, language and trends. You can you all can reference it there. You can also find more people, first, language, alternatives and information on the CUNY journal of teaching disability studies, which I've also high problems here. But I've also included a chart with do's and donots. So the reason I put this first was because this was what brought me to this presentation when we had our last meeting. A lot of individuals were mentioned were referring to individuals that live on the street as homeless peoples or people that are domestic victims of domestic violence, and I think that, if we're going to be having conversations- and our aim is to help these populations- that we should be make sure to be centering their humanity and make sure that we're talking about them in the most respectful and appropriate way. So, instead of saying homeless, person, hobo or bum, which are often words to refer, often use words, we can instead use a person experiencing homelessness, a person living on the street, a person that is unstably housed a person, a person without permanent housing. And again this is just putting the noun before the adjective. So this is a person before they are homeless a person before they are unstable, a person before they are living on the street, and I think again we should get in the habit of centering people's humanity. Another thing that I think is important for us to know is instead of saying poor person unfortunate or less fortunate people, we should say a person that is experiencing economic disadvantage or a financial hardship, a person experiencing poverty or a person living before the poverty line. So again, there are people before their experiences and then the last one that I wanted to bring up, because also it's also something we talk about very frequently is in regards to disability. We do not refer to people with disabilities as disabled people or non- able- bodied people right they're, people with disabilities, and I think again just reiterating the people first is extremely important, because before the circumstance they are people they are humans. So now I'm going to move on to the second of the guidelines, which is use, active and positive language, so we should avoid using phrases like suffers from a victim of because it assumes that individuals are suffering or identifies as a victim and when we're having these conversations, we do not necessarily know that everyone, that is a survivor of domestic violence or a person that is living with HIV or a person living with some disease, necessarily identifies as suffering or that they're a victim of it. So I think that we need to be mindful and very cautious about the way we talk about these things, because again, if we're trying to help this population, we need to center their humanity and make sure we're being as inclusive as possible, so avoiding language that connotates pity and trying to use the active voice when speaking about things that happen to or are done to, individuals. The rule of thumb that I like to use for this is things: do not happen to people, they are done to people. So with that said, I would like us to practice using the phrasing of this person was raped by beaten by battered by x, instead of x rate. I mean, instead of using this person, with rate to be in a battered by we want to say that x person did this thing to this person right, so we're using the active tense and not necessarily putting individual like making describing things in a passive manner. Something else that I wanted that I did not include here, but I did want to bring up, is the idea of a person like HIV positive person. Again, if we're practicing the people first, we want to say a person living with HIV and not necessarily suffering with a person that is living with diabetes, a person that is living with, but dealing with obesity right and these things that do not add negative connotations to the circumstances that individuals find themselves in third guideline is using universal language. This one is not something that's like regularly brought up, and I think it's something that I really wanted to bring up because of how much how charged language is and how important it is for us to be mindful of the things that we are saying and the connotations that they're associated with. So it's just like a rule of thumb on what I said is our rule of thumb, for this slide is secrets and coded language do not make friends and the reason I say that is because if we speak in idioms or Jargon or acronyms, we exclude people that may not necessarily be experts or like well informed about the conversations that or like the fields that we're having conversations about. So if we use uncoded and plain language, we make it a more inclusive space for everyone to participate in conversations just even in the same language. There are some idioms that do not translate well. For me, I speak Spanish, and I know that there are some oftentimes that I use idioms in my native language and they do not translate the same way that I intended them. When I speak to other people from different that speak different dialects of spanish, so it's just something to keep in mind, and I also wanted to note something I did. I was doing some research around this and I found out that oftentimes idioms are rooted in stereotypes and negative connotations, and I've included some below so hold down the fort sorry. This is wow. Okay, so basically holds on the fort is connotated with native American and colonization culture. So when someone left that left the fort they were, someone had to stay behind and hold down the fort out of fear of being attacked for being gypped or gypsy. Gypsy is a racial slur used to refer to the romani people. So when you say you were chipped off, it reinforces these negative stereotypes that the romani people are untrustworthy or that they reliance on best to survive, and something else that I hear very often is this reference of comments from the peanut gallery, and this one is my least favorite of all. I think that, because it's so Dis dissociated from its original meaning that no one really knows where it comes from, but the term actually is rooted in the fact that in the early 20th century, black people were forced to sit in a balcony that was often referred to as the peanut gallery or the n- word gallery. So I just want us to be mindful of the way that our language is coded and the words that we choose the idioms that we choose, even if we're going to speak figuratively, just being mindful of how we're communicating and ensuring that we're not excluding certain populations. The fourth thing I wanted to talk about was using gender neutral language. The reason I included this is because I often find members not necessarily from our committee, but I know definitely from the larger on board, referring to the chair as a chairman, and I think that if we should move away from that language, because not all people prescribe to the gender binary right- and this is the rule of thumb for this slide- it's not everyone identifies as female or male, and we need to respect that. So gender- neutral language helps eliminate what we assume about people just because certain people have certain gender expressions does not mean that their gender expansion and their gender identity match. So we need to be mindful of that and use ungendered like gender-, neutral language. I've included here a link to the United Nations website for strategies that may help using gender neutral language. For myself, I I'm very critical of the way that I speak and I try very hard not to use gendered language, but I do as a human make mistakes and often like not often, but when I do make a mistake and include gendered language. I just try to repeat non- gendered language in my head five times so that I know like when I'm going to say this. It's already drilled, so I've also included some do's and donots. In this slide, and just we often say like hey guys, hey girls right. Instead of that, we can say you all y', all kids and you're referring people to people under 18. Instead of man or woman, you can say person or individual instead of instead of men and women when you're speaking, plural, you can say folks and people himself herself to save themselves right. They are them before they are he or she, or not. Neither of the two chairman and chairwoman, just chair they're, our chair, they're, leading us, and then I've included the Congress like the elected representatives wording, because I think it's often very relevant to the work that we do and we're in constant communication with these offices. So I wanted us to note that so Chair Congressman or Congresswoman Congressional, Representative, Assemblyman or Assemblywoman, just an assembly, member councilman or councilwoman, just a council member and just again centering around the fact that these people are people and gender is just a social construct. Something else that I wanted to include that I find troublesome and almost most exclusionary when we talk about gendered language is the concept of girlfriend boyfriend, wife and husband. Not only does this include this decision, gender, but it also not only does this exclude people that do not necessarily prescribe to the gender binary, but it also assumes heteronormativity, which means that it assumes that men and women should be together and does not leave room for other things. So I try to like move away from that and use the words partner or spouse or significant other to ensure that anyone in the space that I'm in feels included. The last thing that I wanted to talk about was pronouns when you're in doubt of someone's pronouns. You should just ask I'm in the habit of introducing myself and ensuring that I state my pronouns, which are hers, but I think that it's really important for us to discuss pronouns, because for many people this is a relatively new phenomenon and they're not comfortable with the concept of pronouns or they're, not necessarily comfortable, but they're, not used to it and they're, not very aware or in the practice of using pronouns or asking about pronouns regularly. So here I've included some definitions, very brief ones. There are so many more definitions that it's a way to go in depth to this. We should become familiar with, but I think we should definitely at the very least know that pronouns relate to a person's gender identity, particularly how they want to be addressed when they're not being spoken to when they're being spoken to or about without their name being used. Gender is a person's conception of themselves as male female, both neither or another gender right- and this goes back to the gender binary. Male and female- are not the only genders. You can be both male and female. If you find that you're in a specific place in the spectrum that is not necessarily male or female, you could be neither you can be non- binary and decide that you do not actually prescribe to male or female, and you can be a different gender. You can be whatever gender you decide to be because at the end of the day, it's your identity and you should have the autonomy to define that gender non gender non- binary here. I've also, even though I've recently described it, it's an umbrella term for identities used by people who do not prescribe to male or female. So this is something I wanted to bring up, because this happens a lot. It happens in the workplace, it happens in casual environments, it happens in social environments and it's at least by my standards and by New York City standards completely inappropriate and that's misgendering, which is labeling a person with a gender that differs from the one they identify with. This is actually a crime in New, York, City, the division on human rights. The commission on human rights has laws against misgendering people and it's considered violent. I've also included references here to Vanderbilt University's, pronoun, Guide and Glsen's pronoun resource. If you are interested in learning more about pronouns, I've also included five yeah five most commonly used pronouns and their gender association. So she her hers, which is the pro which are the pronouns that I use are feminine pronouns. He him his is a masculine pronoun. They them there. Theirs is a gender neutral pronoun. So again, these are people that do not prescribe to the gender binary. The z, zero zeros is the again gender neutral, and the last is z here, which is also a gender neutral pronoun. The two, the later two are not frequently used, but some individuals do use these as a regular pronouns, so I just wanted to make sure to include them. I also want to note that a person may be okay with more than one of these pronouns. So just because I use she her, hers does not necessarily mean that I may be like if I, if I state that I'm uncomfortable with she her hers and they them theirs. You can refer to me as both of these and I will be comfortable using them as long as I've. Given you the permission to do that, I also want to know which I have not included here, that a person's pronouns can change whenever they decide that they are changing right and you're. No one to tell someone hey you were she yesterday or you were here yesterday or they yesterday what's happening, how a person's transitions is no one's business but their own, and we should respect those barriers and again ask when we are in doubt of what their programs are. I also did not include gender expression here, but I think it's really relevant to this slide and basically gender expression is how you express your gender, how the gender that you perceive to have, and so gender expression and gender do not always do not always match in the way that society has ingrained in us. So just be mindful that if someone presents to you as what is feminine, they may not necessarily use she her hers, pronouns and that's why it's always better to air on the side of asking. So this is just the end of it again like I said it was really brave, and I just wanted everyone to know that practicing inclusive language is only the beginning of an inclusive environment right. There are so many other things that we can do. There's body language, there's behavior, there's making space for people that are less fortunate or people that are more impacted than us and just ensuring that we're creating spaces where everyone feels comfortable having conversations and contributing to conversation or not, if that's what they decide to do without making them feel like they have to right, and so I wanted to focus on inclusive language, because I feel like in the time of search of Covid-19 and having virtual conversations. We need to make sure that we're using the language that's most respectful and that's why I focused on that. But I also urge you all to reference the Unitarian, Universalist Association, inclusive language guidance. If you're interested in learning or doing more, does anyone have any questions? Hi, first of all, naisha, I want to say this is exceptionally done. I love your slides. I wanted to first of all reiterate the statement that I made last month, which is that I believe that this should be put into result form and put before our full board for it to be hopefully accepted as general practice so that we can have it implemented, acrosss the board and continue to raise awareness on the broader scale. I think that this is also a great presentation to be done at the general meeting for the purpose of put furthering a possible resolution, but also so that we are informing not only our full board but our community. At the same time, that being said, I learned some things that I did not know some things that I did know. I feel that it this there's like a learning curve. With this I have had my own personal experiences, unfortunately, and unintentionally misgendering someone, because I assumed that, based on how someone presents that you can edge on the side of you, know having an understanding- and that is not true at all, and it was a very embarrassing experience for me. That was a tech conference that I went to and I'm very glad to say that I built a rapport with that same person. Who was offended that we are like very good friends now. That being said, when I went to Amazon for the for the Amazon web services conference, every location that we went to there was literally a bowl of gender based pronouns, which I just I thought that was excellent. Amazon does not do good in a lot of areas, but seemingly in the tech environment, they're very, very much progressive in making sure that everyone feels accepted and that there are safe spaces for all types of people, and I, for that was the first person that I saw it done so like it was so immersed in the practices and also in the discussions and meetings that we had that. The last thing that I want to speak to is exercising this type of spirit, not only in the words that we use, but also in our practices that in this board, specifically that there be safe spaces for people to express themselves about all things, and I honestly personally do not feel that I have, I feel, very often targeted in different ways, and I've also seen it happen to other people over the years. I've been on this board for seven years, so I would like to also see this same type of spirit exercise in practice in general, and not just related to these things that we talked about in this presentation last. I also feel that this type of work that Naisha has done here is things that people should be credited for like this body of work and the idea that this can be a part of this board's practice for all time now is important, and I feel like often over the years people's work when they put hard effort like this into things it just it kind of like, gets overshadowed something that's not done in our body. That's done in other bodies like ours is that it credit is given in that it is stated that this person sponsored this effort. This person sponsored this resolution or a practice or whatever. It is I'd like to see that I'd like to hear thoughts from the committee on how they feel about that. Thank you. So I wanted to say thank you, and I also want to echo the sentiment. The reason why I included that last slide about languages from the beginning to inclusivity is because I feel like there are a lot of issues specifically and I'm going to be explicit about this racial issues that are going on in the board and gender issues that occur and confrontations that happen or spaces that are not necessarily comfortable for certain people, certain races or certain genders, and I think, that's problematic. The reason I focused on the things that I did focus is just to be specific to the committee that we're on and like the language that we use regularly, but I do think that, if given the opportunity to make this, like a resolution and present to the board, I do want to include things that are relevant, more relevant or more specific to race and gender expression, because I feel, like those are the most common types of tensions that exist throughout the world. Does anyone else have a question or a comment? Okay, so I've also here included I'm going to share this with Ariel, who it chooses if he chooses, can share it with you all and it's just a list of resources. If you are interested in learning more about inclusive language and inclusive spaces, and so the resources that I've included are Lgbtq, inclusive language, do's and donots by the safe zone and allies guide to terminology by Glaad words at work by Diversity, Council Australia. What's your pronoun, how equal workplace advocates and disability inclusion guidelines by the United, Nations, Relief and work agency, so you all can feel free to learn more I've read through most of these things. I carefully chose them and I've read through most of the things that I've read through all the things that I've referenced in the in the presentation- and I know I do not- I would not say I'm an expert at any of these things- we're all learning every day, but I'm happy to engage in a conversation or answer any questions you may have. I know this may turn into I'm the expert of this material on the board, which I want to say. I am not an expert at all, but I definitely think that if you all have any questions or want to have a conversation or talk about a time where, like I used to share with you that you misgendered or you were misgendered and how that made, you feel I think these are important conversations to have so that we're normalizing these things right. We're normalizing asking for pronouns we're normalizing using gender neutral language. So we ensure that we're consistently in our everyday lives creating safe spaces for everyone all right, I just wanna. I just Wanna also make note that one I'd like to try and get this sort of presentation to be shared with really the entire board, and so I guess this also kind of leads into a question of well aisha. You've done this work now on this committee. Would you be willing to do it for the entire board? If ever we have a, I guess a much more unified opportunity to have everyone engaged as an entire community before the board. I mean, of course, not right now. You know well actually just to be clear, we're talking about language and I put forth language that puts it in motion as actual practice. So I set two motions: one is a motion for it to be put in resolution for form to be presented to the board so that we can adopt this as formal practice, and I do not know that this is good practice, doubling two different motions, but my second motion was to institute a practice of crediting people and work that they bring to the board and- and you know, put forth efforts to get that work either implemented in practice in resolution form or work. That is being done because that's not being done so those were the two motions that I put forward. So I just like I said, I'm more than happy to have it like put something together for the longer board. I do think that it'll, it won't be for this month's meeting. It'll definitely have to be for after the recess, because I do want to do more research about the larger issues that are affecting the board and make sure to include that there and, as a side note, I also want to mention. I know that there is an lgbtq task force, which I am kind of part of, not sure, because it's relatively new- and I definitely would like to consult the task force about this presentation before I do it and possibly make it a collaborative effort to ensure that all everything that we decide needs to be talked about. Not just necessarily because for me personally, I'm very passionate about, like I've always talked about gender language and like pronouns and things like that. But I also think that just like whatever they decide right because I am not, I do not identify as a trans person, but there may be someone that does and does not feel included. And I can not speak to that narrative because I do not have experiences with that. And so I would just like to make sure that I had the opportunity to run it by them and just like do more research. Because again, I said like this is very surface level and with everything going on with police brutality and racial tensions. I think it's extremely important for me to one have the time to both. Do this and perform self- care, but also to like ensure that I'm, including, what's important and relevant at this very moment, I do not want to just jump over everyone, but did anyone else want to go just because I'm trying to follow you know making sure giving everyone a chance. Otherwise, actually you can you can take it away again, but no, I was just going to say I think partnering with Lgbt is actually the best that makes sense, but the second, the second part as far I just wanted to know other committee members thoughts as far as implementing what exists, for instance, in City Council in the assembly, Et cetera, but as far as crediting people who bring ideas to the board as sponsors is done in any other. What would normally be a legislative body, but you know similar to the way that we work an amazing idea. I was like when you first brought that up in terms of just like giving credit, I was not sure, but I think that it. I do not know why we do not already do it. I think it's. We should give people credit right if people spend because people spend time writing these resolutions, and if people are spending time and bringing ideas and putting their time in even if it's like 15 co- sponsors and it's a whole committee right, we're all working and we're all putting it together, and I absolutely think that we should be credited for it. So I, if you put a motion, I second, that I do not moving forward. Thank you. I'm moving the motions by the way, I'm willing to draw something up to the spirit of that. Of course, this is our last month of session until I do not know if we're going to have committee of the whole, but if not then until September. So I can work on that. Thank you, Naisha, and, if I, if I may, I do want to say I did not mean to just jump over the motion. What I was actually going to say is that I would, I would even want to go further because we discussed really just the opportunity of providing for a by loss, task force right, and I think that there's been quite a bit of discussion about what we'd like to try and set up, as I guess just a more inclusive environment, but also in structure in terms of what could be included in our own bylaws for every member to receive upon starting service. I think that you know like yes. The resolution, of course, is still out of the word of you know things that we're following, but I think that it also says a lot if we're putting it in the bylaws for every single member that might join in the coming. You know, year or, however many this is a way in which to set in stone. What we'd like to try and see moving forward so yeah. Sorry, I did not mean to not say I was not supporting the motion, but also just wanted to add to it. And, of course, I think that, if you know you have the opportunity kind of like Manisha was saying to really go back to talk to the individuals that would be on Lgbt task force and maybe even try and start to study what other boards are doing in terms of their own inclusive language. I think that it might be beneficial as well to have included in a potential amendment are Bruce and oc still there yeah, I'm here, I'm here, I'm just I'm just really not clear as to are we voting on a resolution right now or Naisha is going to take it to the task force for discussion and then bring the resolution from the task force yeah. So I think I think that that's the action of the latter, where there's kind of an opportunity, then being given to go back trust with more individuals, also mentioning doing a bit more research on you know terms to be included in the. I guess, the future presentation, because I yeah, I think that's. That, of course, sounds like the perfect plan right there, that is, the Task Force Richard Allman's purview, yeah, and maybe you want to check in with Gail Brewer's office, to see what's being done with other community boards, a good plan. I can do that. I know that the city has some resources about some of the things that I mentioned, but they're not thorough at all they're, very so I think talking to Gail might I'm sorry. I lost you. What'd you say talking to talking to gayle might be a good idea, given the lack of information on city on New York, City resources. Thank you. That was a great presentation. Thank you. Thank you. Yes, any last thoughts. No, I guess we're going to go over it again at the next meeting I mean after Naisha is bringing into the task force, and now I do not have any other thoughts about it. Okay! Well, you know I just want to say again. Thank you. You definitely pulled together a great presentation. You know I generally just wish that we will have now the future opportunity to present to the board and use really what you've already put forward before us, we'll continue, potentially making changes where possible in a potential amendment. So thank you thank you for reaching out for me to do this very excited. I do not. I do not think I I've hinted enough about it. We're going to share the presentation with in our community thread on now, so you all can feel free to share with whoever and if you're, not a committee, member and you'd like the live sent to you, can just write, drop your information in the Chat box and I'll make sure that you do as well. So I'm sort of wondering if there are any other public people or board members on the thread here who want to make a statement? How about our new members that are present with Us Anna? You have something to say about you're, smart. You know you, I think, also, if so, if people do not so again, just like reiterating parts of my presentation if people do not feel comfortable speaking, we should also allow them to stand in their silence and feel I'm sorry so hi everyone for those who I have not met. My name is era Santiago. I am one of the newer Community board members and hopefully I'll be joining your committee. I stated my preference to join this committee as I'm a housing attorney at the legal aid society and very much concerned about housing issues. As far as a statement are we responding to nation's presentation, which I thought was very well done and that we should definitely do it for the wider group. Is that what our statement should be? I did not understand what feedback you were looking for, so I think we were all just discussing here that, of course, we're supportive of trying to have this being brought forward before the entire board yeah. I think that, right now, what we're looking to do is give a bit more time, because now nice shoes mentioned that she'd like to try and go back to the lgbt task force and also potentially discuss do a bit more research on terms that you would also like to add into the presentation currently yeah. No, I absolutely support it. You know, I think Aisha has said how everything is a learning curve and then we're constantly learning. I find myself in the same position since I joined legal aid last year I have gone through several of these type of trainings about you know, prop proper use of pronouns about the type of language we're using and how we could be more inclusive, and it's made a huge difference in my relationship with people in my understanding of communities that are different than I am so based on my few interactions with the board with the General Board. I definitely think that this is something that we should propose and that everybody would one everybody would benefit from two. Our community would benefit if our goal is to bring more people to participate in community board meetings to feel represented. Then we have to both use the proper language that reflects us and second make it a safe space, and I feel that from what I've witnessed, it has not necessarily always been a safe space for everyone, and so we certainly this is a good step in that direction. Thank you all right, so I think at this point I can open up to the public chanel. Would you be able to allow for individuals to speak yeah? They just have to okay unmute themselves like to speak yeah. Okay, thank you so much now, okay. I I'm hearing nothing at the moment from the public. So if they're and which is again, you know completely. Okay, just want to make sure that I'm trying to give everyone the opportunity head on to the next section of the agenda for tonight. Okay, so the second section here is the excluded worker relief fund. That's at least what the original name was. We have now been informed that it's been essentially given a new name within the most recent bills that were both released within the assembly as well as the Senate. I want to just make a note again that the past month we had a presentation done by our previous presenter, also our assembly member carmen De La Rosa, so they had come before presented on the kind of general description of the bill. I just wanted to give folks the opportunity, if they have not already seen it to review it is so the assembly bill is A10414, I'm going to try and send on over the link to the public so that everyone can also see it there. Just give me one moment here: okay, so first, you should be seeing the assembly bill and I will be sending on over now the Senate bill. Okay, so I'm actually just going to also open them up on my screen share screen in a quick moment make sure I open up okay, so first off, so everyone should be seeing my screen now. Okay, so hearing none right now, it has been referred to specifically the budget and revenue committing so just check the individual actions by clicking on this little tab here right so that seven or so yeah and below you'll see now a summary establishes a billionaire mark to market tax, taxing residents with one billion dollars or more in net assets and directs revenue from such tax into a worker bailout fund establishes a worker bailout program providing workers traditionally excluded from wage protection programs access to unemployment benefits, I'm glad they do so I'll, just begin scrolling on down. Of course, if you language have free, contain a clock, you'll see some further explanation as to why the individual sponsor of the bill wanted to present this good. Okay. So really you know you're looking at the summer kind of explanation of the individual bill as well. I just want to know as well specifically stating it's really focused on trying to provide 300 per month in relief, and you know if they. This is only really if they are excluded from unemployment and the additional protections or relief that was offered on the federal level. Does anyone have any questions concerns regards this? What's going on with the bill? Where is that so right now, just everyone sees Jessica Ramos. Okay, so is the Senate adjourned for this summer? Yet or no, he came back into session as far as understood, I believe, was supposed to have also come to an end. Now it's either Friday or next Friday. So you know really. It would be to move to say the very least: it's not going to take a total fall this bill and potentially yes, but there's also the potential to bring back another session even during this the summer months, whether that happens right I leave up. I want to use their clear language that says may do this, but it's not it's not for sure. So this is where the language of the building is already at. It's already been introduced into a committee. The committee would have to essentially review right. The committee does not necessarily have that much time, really. The incentives, of course, when you, when you're in that individual committee, comes up to the committee the same very well. You know that we're already here in our own committee talking about individual issues right, there's this an assembly counterpart and do you want to do a reso about them? Yes, so they're, so the sorry do we have any backstory as far as the political will to do this. I think this is valuable. To be honest, I just I fear. Well, you know. Good news is that we have the majority right. So I guess my question is the likeliness that this is going to pass and what district specific information? Actually I'm, assuming that some of the what we discussed in April was it in the resolution regarding coronavirus, and you know making sure that people that are affected get benefits and things of that nature. I do not remember the exact title of it, I'm assuming that some of those whereases can fit in here. We could reference that resolution in this sorry, I was just pulling up the link here. Yeah. I think that you know we yeah. We have discussed this already. We have some language, I think also just pulling from what was the past few weeks. You know articles that I had sent previously when we were supposed to. You know have originally discussed it the previous month and there's something that somebody never had came to present on that very bill that she's now that they have now introduced. You know we can. We can definitely use a lot of the language. That's there. I also can just know. Actually let me let me just switch quickly to the link for the assembly and I will pop up just a few items that I pulled from a number of links just before I started off. So this is the page for the assembly bill. You'll, see that you know what was the Senate who's, the sponsor. You have a few there's four. So far. Okay, we'll show you about there's additional here. Okay is Al Taylor in there get him involved. Oh there, we got a lot yeah good and okay, the number again for this England. I want to see the number for the assembly. I just I want to see if any media coverage it's A10414 10414. I want to see if anyone's rapping about this yeah. So if you, if you see, if you see the links that I sent previously from New York, which was the one that specifically they did their own internal, their own internal essentially searched for me, it was actually I'll. Do I'll do better we're losing your audio Ariel. I'm sorry, are you not able to hear me yeah now, it's good. So what's their survey internal? Where was who was the survey done with? Oh? Okay? I see hold on this. Is the report released? It includes the data on early conducted because it's a pretty sensitive report. It's about 36 pages. I think it was essentially they focused detail. The experience of working- class immigrant black and brown new yorkers during this crisis, based on a survey of 244, primarily latinx immigrants, acrosss New, York City on Ireland in Westchester, one third of whom are undocumented. It provides striking findings related to the endemic toll on community members, health income and work, housing and security and education, but essentially you'll see there's a lot of data. They present what I will just try and just focus more so on the findings. So here they pretty much make their own conclusions based on the data they've collected, where they find that there's most need or action at this time, and what I'll just go directly to is right here, really, the focus on providing immediate release to immigrant workers excluded from the cares act. These a number of potential options from the federal state and local governments, which I thought was pretty incredible because it actually, it hits at some of the things that we've discussed previously, actually so on the federal level. Of course, that's part of the discussion. It should not be really respect to those that can provide a certain status, their immigration paperwork or in terms of work, authorization and addition, which is really also just going along with the language, that's included in the the bill that that's introduced by carmen and also Jessica Ramos on the state level. They specifically cite the creation of a three and a half billion dollar excluded workers, emergency fund, and they kind of due to the very bill that Senator Jessica Ramos and Assembly member carmen De La Rosa already created facilities, of course, my favorite. So this is really highlighting a lot of the need, that's been, I think, poured over countless times. This is kind of running really, along with the other resolution. I think we're already you know discussing specifically today. In addition, although this is more so the language being specific to your workers, I think it also falls in line with trying to make sure that we're providing resources for those that are in need. So again, I do not want to spend too much time focusing on this one individual piece of just information here. What I will also just do is directly the notes that I highlighted 68 of job loss in New. York City has been among people of color with an especially high figure among latinx. New yorkers immigrants have been particularly hard hit. The report finds while foreign workers, fellow 49, of all private jobs, full pandemic crisis, account for 54 of the lost jobs. 54 displacement rate among undocumented workers is twice that of the 27 overall private sector displacement. The further the report further estimates that 192,000 undocumented workers in New, York City, have lost their jobs or been unable to work. Since the crisis began in New York, nearly one million undocumented people, 54 of renters, were not able to pay their rent in April. 89 were worried about being able to pay in May and yeah. It's just continuation of the language that I just was highlighting there. What I'll, also try and now just show is the press release that came from legal aid society think I got the link right. I have a question. Okay, so do you know what is the percentage of undocumented that pay taxes, because if, regardless of their residency status, I feel that if they pay taxes, why can't they benefit? From that? You know what I mean yeah, I personally do not you know. I do not think that I've seen language that has been able to, or even a report or a survey that's been able to. You know very clearly get that information that I have been able to collect is from various institutions that are pretty well known. I think that have definitely been huge advocates in discussions of trying to ensure that there's equal opportunities being made and available for those that are identifying as they're not having a certain status or, specifically, you know, being documented. I think that those individuals, visual institutions have tried to try and you know, pull together whatever resources are available to make a recommendation based on the data that they could find, because, right now you do not have to be a resident of the state or even a legal resident to pay taxes. You can be undocumented and pay taxes, so I think that they should benefit from that program. I thought I read that the issue was you're right. You could be on documents and still pay taxes and a lot of undocumented people who do not have a social security number will apply for an itin to be able to file their taxes, and I thought I saw the number. Unfortunately, the carers act. The Cares act prevents people with an item from benefiting so that six hundred dollars from unemployment through the cares act they're not eligible for that. Even though they're paying taxes, if they have an item and from the numbers that I thought I read- and one of the one of the documents that the committee circulated, it said that New York state had about over 190,000 people with an I-10 and again this is just going from memory, so I would have to confirm it. But if, let's say 190,000, people only have an item, not a social security number and they're actually paying taxes. Those people would not qualify for benefits under the federal Cares Act yeah yeah. I do not know the specific number either, but you I think you definitely hit pretty closely to it. I will pull that that individual article up in a moment I did just want to also just show here that the legal aid society was also trying to just make sure that they put out a proper release for what they also thought was very important at this time. I will just try and scroll on down, because I do not want to go too much into everything else. Yeah, sorry, so this is just here in regards to the excluded worker fund. They've also been supportive of this bill. If you take the time, hopefully a little bit later, you'll see there's a number of other bills right that are just being loaded here, but I just want to just try and focus on the excluded worker fund. Just because that's you know the bill of also just note. The New York Immigration Coalition was also in support. The booking Institute was highlighting their own data that they had been collecting themselves and really fine making the argument that you know the current restrictions in place on unemployment insurance are failing, many working- class individuals and even Scott Stringer's supporter. I think, really hurt too much, but I think that there there's ample amounts of data that could add to much of the discussion already being had, and I just highlighted some main things here. He also takes similar language training safety net for independent contractors, as well as non- citizens and undocumented new Yorkers. Yes, and again, I just want to also highlight the New York Post, also kind of yeah, just hitting at a what was just being mentioned prior. This is a statement from representatives, so with that all being said, I know it's a lot of information. I know I'm kind of hitting back at some of the things that we discussed the prior meeting. I did pull some language from really all of these sources for anyone that wants. The previous information was sent out past bum in the past month. Please do feel free to reach out to me I'll, actually just actually just share my own email address just so. You can also share that with you. If you want it, please do not spam me and ask what's on the links so little emails about all the money that was left to you by a strange family member that you never know about, because I do not okay. So what was it? Oh sorry, we're documents, so I'm just going to pull up a word document, pretty much very items that now I was mentioning before in one moment me again, just language that I pulled from countless documents right that was shared in the previous month. I think that also kind of gets highlighted again and now some of the other articles that were shared I'll just give everyone a moment to essentially look at what I just put together so far again. I know it's a lot, so please tell me to slow down. Maybe two: can you go back up a little bit? I want to see the part 30 now reported that among immigrants. Thank you so yeah. Sorry, I did not need to no worries. I did not know you were going to go on, so this is already the very bottom just to also make note it was just what I had been trying to pull together. I did find information about the amount of taxes that are paid by undocumented or people who are undocumented to begin her practice, which states that in 2015, according to the IRS 4.35 million tax returns, were filed using itin accounting for more than 13.6 billion in taxes. I'm sorry which year was that 2015, but this article came from 2019 and it's a Cnn article. So apparently that was the most recent information that they had. What it also says is that these are voluntary tax returns, so it just lends to the idea that probably there are far more people that could be eligible for something like this were their real structure for it, and but the reason why these people volunteer to do it is because it helps to show good moral character that they're following the rule of law etc. So, but I do not I'll see if I find anything, that's more specific to our district yeah I mean, but I I'd of course you know be happy to take in any language that would add to the things here. I think I mean I know I went a little a little much into it, but of course, I'm always happy to take in any anything else, comments for the article. I dropped the link for the article in the comments and let me see I'll, take that but I'll see if I find something more specific to our district, so I'm just going to stop sharing for a moment just to go. They also contribute billions to social security annually, not that that's specifically relevant, but it just helps to show how they are contributing to the economy. That quote is directly from the article all right. Let's see, oh my god, you guys hear that I hate what site does? Okay, music, you go to the website and it just starts playing okay, so I am going to switch now back to jared all right. So this is okay. I found another article from a restaurant tour who says he's an undocumented restaurateur who has been paying his taxes for 15 to 20 years using his tax. I d number his own business. Let's see he says, he's paying his put for 15 to 20 paying taxes using a tax. I d number owned a business for the last 12. last year he paid 15,000 in corporate taxes and his sales tax was between 12,000 and 15,000, every quarter, wow so yeah, which speaks to the business side of things. That's something that should be picked up by Biz Dev. So just some some language. Does everyone agree? This potentially be a good. I did not even see that I'm here, I'm hearing nothing, so I'm on the third, yes, okay, he goes on to say, because I do not have the papers, they do not question where the money for the taxes come from. But if I ask for money, they're going to question me speaking to like he's in need now other people because of his status, and there is the feed that anyone. You know, anyone that asking for green card need to pay before getting a green card. You know, regardless, if you pay taxes or not, it's more like forgot what they call it, because I did mine many years ago, but you just have to pay it and it's not like cheap change. It's a lot of money and we're proposing to raise it just recently. Do you know what is it now Scott Schneider was advocating against it. Let me see I was following it. If I remember correctly, that's an IRS fee: it's not the the immigration that is asking for that. I mean you have to pay through the immigration, but it's an IRS kind of thing. I'm not sure how they phrase it, but I remember something that you have to pay regardless. If you pay taxes or not, it's like an additional about how they call it so citizenship ceremonies have been delayed amidst the pandemic. So that's why there has not been much new information about the status of these changes but seems like they're going to they're going back to business as usual soon, so it's something to keep our eye on, but they were going to raise. It was like a ridiculous increase that was being proposed and not just related to the citizenship fee, but many citizenship related fees, different applications, the when they seek asylum that fee and others. I if I know my board or our board, they probably will access to pair this down a little. How many pages it now so right now it's one two pages. Look, it's fine! So I think it's all important information we may just want to put an asterisk next to things that are more background, information which the board can be told what that is so that if that comes up as a concern, we will know like what can be. You know taken out. That is not like the meat of the result, but that's important for the full board to just have an understanding of one other thing. Everything that you have data in here, I think, in my view, should have a source. So if anyone is questioning that there is a source, they can go to the source and check that out to your point, is there one item specifically that resource specifically like, for example, the 12 billion in state and local sales, just as an example which one sorry I'm right now on the first paragraph on the screen up here, whereas the grant makers right this one, so the 12 billion in state and local sales is that I mean like? Can we put like a? Where did you get the number from you know what I mean like it does not have to be in the actual. You know in the actual paragraph, but if you put a little like a, I do not know a star or something or even a number, and just on the bottom put the source of where you took the data from yeah, and I think that should also become a part of our general practice, acrosss the board for the board that we're using standard practices for citations. Okay, citation right, so I see what you mean, but when it comes to the resolutions, though, we do not put individual citations right. No, we do not we're not into practice now, but maybe we should so then maybe it should be a separate document that you know. Perhaps we can maybe include where you know when we're sending over the resolution once passed to let's say the governor's office that gets sent with it right. We have done that for the full board, like sometimes it will be added to our package extra context related to Erezzo. I do not know what the board's practice is related to outgoing Rezo's to the electives and so forth. Where that's concerned, though, what I would think is that they have not been doing that, because I've never seen that in effect. So, but I would not know for certain all you have to do. Okay, all right. So then. What I can then do is on my own and I can go through each one of the ones that I've already pulled and yeah just start collecting citations. Does that sound good that you'd like to take out like? Do you think that it would be beneficial to include, for instance, mention of those, particularly in certain fields? I know not a committee member, yet I'm wondering whether saying how poor non- citizens are is necessarily useful to this resolution. I mean because it seems like you're, you start with talking about how much they contribute to you know to the country with their taxes and whatnot, and then we go into the, whereas their liquid asset for like these two, whereas classes. I I'm just curious as to the rationale and how this helps us with the resolution. So I think that in mentioning how the difference is between a non- citizen and that of someone who has permanent, you know permanent residency as it's labeled, it's really just getting out where the need is, but if you know, of course, if that's language that we'd like to take out I'm happy to do so, I think if we knew when the status of them being liquid acid poor is derived like, is that now it do in this during this pandemic, then that brings it home in the way that okay, well they over time they pay this amount of taxes. They contribute to our economy, but in this pandemic, this is how they're affected, then that helps to kind of like sell this reso and the bill as a you know, viable option to remedy that. So that's what we're trying to remedy so for at least right here. This is this is not so maybe then it might be beneficial to say, then. I'm just curious, because if we're concerned about helping undocumented immigrants because of the impact of Covid-19 right and my concern really about what their status was before like how liquid poor, like okay, to use the words here that how poor they were prior to Covid-19, are we just concerned more about like if you're making the case you're saying hey these people contribute a lot. So it's our duty to take care of them like they contribute to the country. They pay taxes, they're the ones they're, the essential workers they're out there, so we could continue on. So it feels like a strong argument, whereas, if you're saying oh well, they were poor even before copen 19, I'm not sure where this fits in. That's why the chronology of it is important like because if what we're saying is that this a result of the pandemic, then that's useful. But I also feel like a strong argument is despite the fact that they pay x amount of dollars into our economy in the form of taxes. They it's not they're, not getting a return on it, as do other citizens or residents, and you know parallel to that. They are resource poor when maybe they would be less so were they to have that same benefit that everyone else has, but I think we need to know dynamics to put that to present that I think it's even you know it. It's really. If you look at that in a more like in a simple way, you pay into a program that's supposed to benefit the people that pay into it right, so why can't they benefit from it and, if they're, paying into it right. That's just as simple as that. Okay yeah. I think that my intent was to try and lay out as many arguments as possible, and so, if it's seen more as that, it could potentially detract from one individual argument where we're trying to say that you know because of their contributions deserve x, then you know we can. We can definitely then remove this. I think that I want to highlight both the contributions that is already being made, as well as the current difficulties that are also already impacting individual communities acrosss the entire United States, but I hear I hear the feedback, and so is that is that fair to say that we would like to try and remove this? I err on the side of keeping it specifically, because I know that there are people that will argue against how appropriate it this is, and maybe not from our community but others, and so I feel like the fact that they can get this money back, speaks to the need to uplift that community, who have these disadvantages of being liquid acid poor, for instance, and the poverty rate, and that's so that's that, for me, is the why that is part of the. Why of why? Should they be as liquid as support or poor in general, if they actually should be in the same program in the same system? Is everyone feeling that that's yes can we can we hear from some other members? I'm curious, I think we're still all here. Yeah. Are you still there? I think it looks as if he's I can see his name there. Mack is Bruce. Oh yeah, okay, I think Faisha for some of the other members. At the moment they might be away yeah I mean, if generally I just want to get a bit more. You know just a clear answer: do they feel that it detract from an argument made on contribution? Do they feel that it potentially might add to the overall argument for why you know they should very well pass this piece of legislation? Can you pull it up again? I I'm thinking. I have an idea about warding for that for those causes. Again, I do want Wanna. Just you know if you feel that this is language. That would detract please what we want. We want the input I mean. Also, if we're at an impasse, we can leave it to the full board to hash out Aisha. I actually, I think, maybe if we did were asked despite their country, their tax contributions, something maybe changing the wording undocumented people. I can't remember exactly what it said: are liquid acid, poor prior to the pandemic, making them more vulnerable? I do not know maybe kind of hash it down a little bit, so you can connect them and we keep it. I like that you do not have to apologize you're, putting everything together. This is what this is very helpful, so this fusions, I think he should spell out by home, made by home, despite the financial contributions made by okay, I'm sorry, you were breaking up. What did you say just changing it from the word undocumented to make consistent with the second third sentence and what I think might be beneficial because of the additional language here in the first line: okay, foreign, I'm dropping the Link Web street from the New Yorker. I think it's from New York magazine about the restaurant that pays all those business taxes, but is not eligible for anything because he's undocumented, mostly for context, because since it is more business related, it probably does not completely fit here, but it does demonstrate how an undocumented is helping to generate economic activity and paying into the system without benefit. Okay, yeah, we can use some of those individuals. I was trying to remember if this article also was highlighting the kind of more broader number yeah. I wish we had something more recent, because I have that information on the state level, but maybe taxation shhh the language that you specifically I'm showing state. I do not think they're showing federal we can use. This is going acrosss, the entire country and talking about contributions of state and local, what's contributing to federal. This is using the same language here. This one is more recent right: it's not the individual study, but this is going back to 2015. yeah it does not. It does not account the federal level. I guess I think, would it be fair to leave it as one, whereas that focuses on the the contributions made to New York state, specifically to close field that we can include nationwide. The contributions in state and local taxes state is sufficient and then going back to. I think another question did they feel that they want to feel that we should keep this specific language? That is just really focusing on the occupations careers of many, I think so. I mean, I think, we're clapping. Every day, at seven o'clock for essential workers, I mean health care workers and essential workers. This connects the dots, we're not just giving money, because it's the right thing to do, but these people are actually helping us, keep our economy and keep our society moving. I think I think you can just take from this. You know anything I've already put on here. It'll echo my sentiment, but I also just want to make sure before I continue moving along that I ask everyone: can we consolidate the two, whereas is that, like the within essential retail, immigrants were partly high shares of pharmacists, and I mean leave it? It's fine. I was just going to say: make it one paragraph, but it's the same thing should we should we have these this last, whereas clause on that page and the next one, the percentages, do we actually need that? Does that help our resolution? Or can we just keep the previous one? I think the percentage? I think the percentage is important right. I think so too. So I think the of course you know that kind of specific data is great. What I'll just highlight is that you know we're talking about really what's something on a broader base, looking at individual sectors, something that's getting a little bit more detailed to that of the food wholesale process, workers who are essential in that specific area yeah I mean and that's kind of what why I was starting out, saying- maybe consolidate those two, whereas is because they're both from the same policy report and they both reference percentages of immigrants working in those specific fields as essential workers and contributing to keeping them afloat. So it's kind of like it's the same context, same source, but I do not know what everybody else thinks I mean. I'm focused either, or I think you know this is already getting it. The you know, data that's available on those who are doing. This is great work right, but if there's not a strong inclination, I'll just try and move along just because it's now we're hitting 902, oh yeah, so I just yeah. I just want to try and try and make sure I'm moving as well here so, whereas the international, so I just thought their work- is just it's incremental acrosss, our entire country acrosss the globe. I think that their specific feedback was very important. That's why I had specifically want to just include the findings that was in the report. They will also share the past month. They also are specifically highlighting a very strong role that takes place with direct cash assistance. I will say that I'm also just thinking about this right now. This can probably be moved up higher because I think it's also pointing out other governments have already done this fair to say we can move this one on up top where so, probably after this this, whereas right here, okay, good, I thought I had it- maybe not, but I write up an additional. Where does that seem fair? Actually, let me just pull up the line. I do not know what the language was, the state of California. I think, let's see if it pops up in the news, are we voting on this tonight? Yes, I would hope so. Yeah, do we have another resolution? No, I'm sorry. We do not have any other resolution after that right, just one other. The Net Refugee safety, okay, but yeah we'll definitely pull it up. That one has already been written out. Okay, we'll finish with this one and then which one which one has been already written out: the net Safety Refugee Fund. So I want to clarify- and I'm also continuously confused, because so what is our intention with that? Because that is a resolution which this board should have ratified over a year ago, yeah so so yeah. So I already reached out to the office. They said to look over the ones that had already been posted online. Those were you know the ones that we had already passed they you know they said that you know. If it's not up there, then it has not been passed. So listen, wait! Aisha! Can we, let's finish, is that the next item on the agenda, what you talking about? Yes, yeah, okay, yeah, in my view, because it's 908, we should finish that result and then we'll move to the next one. Then you you'll clarify things for us. Okay, so let's learn yeah. Let me let me just pull the language here. Yes, support undocumented, now, you're going to change the light, the language after you copy it right. Were you quoting the article I was. I was just pulling the specific language that's used in that article. Okay, I mean we can, of course, also put it as according to Cnn right, okay, yeah, because if we're quoting, we should you know so now, then that language we can continue going down from here right. This is the other we had so the these. Of course I recognize and not specific to mentioning immigrants. I think that it's kind of for us more so intuitive understanding the breakdown of our city. If it does not necessarily hold us strong, we can remove these two, whereas so I will make this similar to that. Okay, sorry, there was a really low helicopter flying over here, yeah, I'm hearing about the fly here too. So, if that's that seems good for now, we can end it here. I think so, let's go she to the individual okay. How did that seem for the resolve? Okay and I'll? Actually just make note of senator and our our whereases are not making any additional suggestions not listed in the bill. I'm sorry, what was that? Are we making any suggestions in our whereases that are not in the actual context of the bill, or is this all just reflective of supporting the bill? So, yes, I intended it to be for the passage of this well, both these bills in their respective chambers, was there a specific interest of adding an additional result. No, my question is basically if in the, if in any of our whereases, we make any suggestions that have not already been highlighted in the bill. Then we would want to add that in the resolved, but if not, if this, if all of this is only to say, here's why these two bills are important, because all this is true, then the resolved is fine. That's my only point okay. So let me just label this revolution market tax, sorry, so that I'll try and go back and just have a little where you know a little does that seem fine yeah! So save this. For now, I'm jumping to so many items. So are you doing roll call or how are we doing that trying to get it out of the here? We go sorry. Okay, I'd like to call for a I'm sorry we're asking if you're present, because we're now calling for a vote. I am okay. Naisha! Are you there hey? I do not think she is present, but we do have enough votes supposed, okay, so yeah, so I'm going to start calling so who is in support of the bill so say: aye, hi! Sorry! I I'm sorry now you say: did you did you say if you're in support or you do not hear me, I think you were. You were going out there for a minute yeah. I bought, I sorry, okay and I'll vote as well, so that will be members and support and the committee actually I'll just label this as committed Marshall. I'm sorry I okay Marshall is in favor, okay and any other board members present hi. This is etta. I vote yes, hi! Thank you, okay, so I will now save these at the bottom of the resolution and I will send it on out at the end of the meeting the presentation. Please, because I tried to respond onto the email thread, but because people are Cc's bcc, I can't have access to responding to them, but I did share it with you. If anyone happens to like me, the I think it was like earlier this year. At some point there was a directory shared if anyone still needs that directory again, you know you can always ask the board office too. Just in case you want to reach out to various board members. Can we sorry for interrupting? Can we possibly create like a google for like housing and human service members, so that we could like it could be like a lister where we can just send things or is that not allowed based on bylaws, I'm not sure like where we can send things to like the functions as in this serve so like? If you function, if you send it to the group, then everyone receives it and we can just send things and keep each other posted, because I know that I sent something earlier and now I'm only realizing that you were probably the only person that got it because of the bcc. But if we have a listener, we do not necessarily have to have everyone's email, but we can still get in contact with like relevant and important information. I was just going to say that the attempt has been made multiple times to do that in this committee, without a lot of participation from members. To be perfectly honest, some members did not even bother trying to sign on and not to say that is going to be the case here and I'm actually bringing that up with the hopes that it's not going to be the case, but I think deciding on the tool that is going to work best. We may need to put a little work into that because part of the issue was members did not have gmail and did not want to apply for a gmail and admit not to say that. That's going to happen here again, but that was part of the obstacles. I think there is another issue, because our email addresses can be foiled. How would you FOIL something like that? So I'm not. I think that this is something to check with Jim in terms of, if it's anything you can do like. The only thing is like it will be foiled equally, as our email, it's just instead of having to type out everyone's email, it's just the group receives it all. So it's just basically like a shortcut to emailing the whole group, so it functions just as an email, not as like a group chat or anything like back and forth. It's just kind of like I want to send to all. Instead of having to type everyone's email out, it's that's right. Hns, like housing and Human service. Like committee, I get okay, I mean, and the other suggestion that I made was actually for a facebook group to be created. The reason why I preferred a Facebook group versus a listserv or email list is because I personally find email to be very unproductive where you know someone sends something and someone else replies, or it just creates a thread where and then people split off from the thread when they're responding, it becomes a mess and it becomes a lot to manage as far as like you got, ta open all these things when the way that Facebook is structured or there's other platforms that are structured. Similarly, if I post a document, that's the document, if anyone says anything on it, the comments are all there embedded in that one document, and it also groups you can it you can upload files, you can upload pdfs versus adding attachment to an email. It's just more time, consuming I've seen a lot of confusion develop from that. So I do not know what people's thoughts are in that regard. Yeah I've. Never so I so this is. This is going to sound, very unorganized, but I've generally never worked with a specific list. Server, like I said very organizing of me, but you know I'm familiar with using a Google drive as well, but I'm open to you know using whatever other resources are available. That's if that's the concern there. The only reason we bring up listserv is because not only will it be easier for us as a committee to cover like talk to each other, but also if someone from the board has a human housing and human service related concern, they can just you know like talking in human service list server like cv, housing and human service, and then we all get that correspondence versus having to type in everything. I think it's just like it's more incentive to be involved and communicate about the issues that are occurring in the neighborhood in a way. That's like not exhausting and like tedious yeah, I can yeah I can go and ask if maybe then create some sort of general. Listen like I said, I'm not as familiar with it. That's why you hear some hesitant being my own voice, because I just do not know much about it, but yeah I'll definitely try and ask about it. Okay, there is an event in Washington Heights on Saturday I sent it. Did you get the flyer that I sent yeah and I sent it over to the staff and I asked them to share with the public yeah. So it's there's a black lives matter event on Saturday in Washington Heights, if anyone's interested in attending. I would literally be so happy. You need to show us noise. We can right now, I'm helping. So it's actually it's not I'm not organizing, it's like organizers in Washington Heights, along with assembly, umbrella crews, and she just reached out to me because, like I'm helping organize speakers not to be a stickler, we still have another item and I honestly I need to jump off soon and that all falls in new business. So, okay, so yeah, we'll just quickly, then said the language. Thankfully we have it pull it on up, okay, so, okay, so everyone should be seeing that you know what I was getting at before is that you know I had asked the office. They said that you know if it was not up there, then it was not something that was a past. You know, I understand, like the major concern, of course, about that. I think that when you know just to just where we are right now, we you know, at the end of the day we've been clear. We wanted this past. I think we had spoken. We had spoken some of the concerns that were just much more prevalent at that time because of response by really the current federal administration yeah. So I just want to take note that there was concerns being raised because there were a number of individuals being dropped off kind of in a. I do not even know how to explain this. It's still problematic today, but it was essentially a very political move by the current administration to drop undocumented individuals off into what was being labeled at the time as sanctuary cities. So I just want to step in here real quick. This sounds like we're about to readjudicate this and I on the side, had a discussion with Liz ritter, who is our secretary to ask her to dig into the records and find the vote total for this resolution. What this highlights for me is the incompetence that exists with this office. That has been a long standing issue and I really like our office staff like on a regular day I bump into them on the street. I absolutely love them right. I respect them their families. I hope I wish the nothing but the best for them, but what happens with this staff is counterproductive to the work that needs to be done. It really created a huge conflict in my and here we have an example of that. It also impacted that whole discussion of the minutes and my removal as housing and human services, and here we have a resolution that was passed 38:1 by the full board- that's near unanimous right, and yet it was never ratified. Despite my continued question about it, with Richard with the office staff by email and now with the second vice or the first vice chair, and no, I have no response from her to my last email. Thank you, Adiel Contact in the office, but it is total Bs for you to be told if it's not on the website that did not pass because the website and their activity with the website is no indication of what the status of work in this board is, and it has happened time and time again it's why people were out of apartment buildings for years, because the follow- through work is never being done not by the office and not by the chairs of this board, which their charge is to carry finalized resolutions to the next point, whether that be advocating for it with elected officials, whether that be mailing out the resolutions finding it all those things on their charge. Now they hold other people to extremely high standards, even when they can not prove some of their claims, and yet we have this kind of activity going on. It simply needs to be ratified by the full board and the actions of the chair put into motion. I think that I just want to bring something up. I think that, in light of all the things that we have witnessed, because I remember voting for this resolution, I think we should definitely think of and work as a committee to develop some resolution where there is accountability right like establish a formal process, but through bylaws, where, like we record or someone records right, like the secretary, keeps track of how we vote for things right. So the secretary should be responsible for like keeping track of what is ratified and what is not and what is implemented and what is not- and I think just to echo that sentiment like we need to establish a streamlined process where, like someone that already has a responsibility, has a responsibility to like keep track of these things, because I think, at the end of the day, what's happening, is we're spending so much time on these new resolutions that are really old resolutions that we're spending time that we could be like using for new things and new issues and addressing other issues that are not things we've already addressed. Thank you naisha. I completely agree with you and in fact, as the chair of I.T, which I was also stripped of the work that I was doing, and I have proof and documentation of this when I sat with Microsoft, which I discussed with the committee. Not only was I looking to create a solution in regards to all of the buildings in our district so that we can be able to have all the data, for instance, the fact that there might be a brown site at a certain location, and we do not. We can't have, unfortunately, ob being in the room who had a lot of institutional memory about those buildings. We no longer have them, but it should be in a system somewhere, so that we do not have to wait for someone to be the voice in the room that work was being done. But what was also discussed with Microsoft is our resolution agenda, Minutes office staff, responsibility, chair process and that was brought to a full halt, because the intention was more on let's pitch and hold aisha, because we do not like some of the things that she says despite whether they're true that- and here we are so yes, we're absolutely right- that's very important work that needs to be done. It could have been so I need to understand something. This resolution in front of us right now on the screen was already the housing and Human Services Committee voted on it already. Yes, okay and the whole board voted on it too, not the exact, I would not say the exact one, but I think before well this tweet like tweaked it and sorry there are fireworks, but before Wall just edited it. We had voted on a resolution that echoed the same sentiments echoed in this resolution that was voted by the committee and the board and enacted, but now we're being told that it was not okay. So it's right now, so it's here right now for additional vote. No, it should not be. That would be illegal actually, so why are we increasing that resolution, though? I think that there were some edits made to it that were made to this resolution were friendly amendments for from the floor that may have been grammatical in context or may have added additional concepts, but they were not a different resolution. It was this exact resolution. So what are you doing? What are we doing with this one? Why is it here? So what I want to just be clear is that so we yes, we had. We had voted on this resolution, even in the copy that was sent to me. You know from aisha. It already had our committee vote prior what all I've done, no edits whatsoever to the language I literally took this piece of paper took off the vote count so that tonight we can vote in committee again Committee again. I absolutely object to that. This is not your fault, and I do not think that is wise for you to take the responsibility for other people dropping the ball. It would actually be illegal. This resolution has already been voted on and should have been ratified in June of 2019, which, I might add, is an entire year, and that is a year. I'm an emotion to table. It's not there's nothing to table this yeah, but the thing is like right now: there's something there's immediate need right and so, like the Admin office did not do their job, but there we have a duty to the community. If you suggest that if by voting on this we'd be doing something illegal, then I'm just going to table it like I'm in a motion to table it. So we're not doing it, but emotion, is that this discussion be brought to the executive committee to determine why it was never ratified and that it be ratified that or really what needs to happen is that the chair needs to ratify it and also begin to do the work to put the spirit of the resolution in motion so that it can serve to do what it intended to do so two things here: one naisha put a motion: if we have a motion on the floor, we have to vote on, it would need to be seconded first, and my objection to the motion was to counter any second for the purpose that I believe that it that's not necessary or appropriate. That really what needs to happen is this resolution where it stands. There is a there's, a next step. That would generally happen. That has not happened and needs to happen. Okay, so just for the purpose of the motion right now, if okay is naisha, are you dropping your motion? If there is such thing, are you retreating your motion, then? If no one seconds it, no one, it does not need to be retreated, it would need to be seconded. I countered her motion with a another motion which is for it to go through the normal process that a resolution would go through, and anything else would be improper, but this resolution was already voted on, so I do not understand why it's here again, I'm still it got here, because I brought it up in the context of our last conversation with carmen De La Rosa about the fact that but mind you. I had already been communicating with Richard with the office by phone in person in email and have had conversation also with our current first chair right. That is why it's here- and I understand how it's not here- it's not Ariel's fault at all. It's many people, dropping the ball and ignoring what their charge was before this point. Why it's here it should not be, it should go. It should go to the chair to be ratified. It should have been ratified by Richard Richard Lewis by the way, but it was not, and so it needs to be ratified. Nonetheless, about the previous votes, because I think that there's we're just going to keep going in circles about something did Liz ritter, who is the current secretary of the board, I can screenshot her text and present it to you or whatever needs to be necessary, but nonetheless the record is there. She has just confirmed that and he should just ratify it and that's it. I've been saying that for months, you're absolutely right. Do you know why it was not ratified? I would say the spirit of the culture that exists within this board is a big part of the. Why so what I? What I can just say is that if there already is clarification right, I think you know that. That's quite frankly, just the most evident thing you can. You can bring forward right if the secretary is also agreeing that we have already written count. Let's discuss this at the executive: let's try and find out if we can just get it done there, but it does not have it's kind of weird, because at this at this point right this language in front of me all right folks are disputing that. You know this was never potentially either shared or passed, but if that is evident, let's just bring that so I mean what you're saying is that this resolution was not shared with the entire board. I'm kind of lost, I'm sorry. So again, I'm not saying that I'm saying of 2019 this resolution was voted on in the general meeting by the full board and passed 38:1. I made a mistake in my statement before I misspoke 38100 38.100. If it were not for one person- and I know who that one person is, it would have passed unanimously, and yet it was never. It was rather that is ratification. What did not happen is that the chair did not sign it so that it can go forward to our elected officials so that the advocacy can begin on behalf of what the point was in the first place- and you say this was on June 2019 a full year ago and that we would have to go into executive session for me to elaborate more, but this is the type of thing that centers around some other conflicts that have been brought up in executive committee and certain requests have been held back. Because of that I will not elaborate any further than that. Dynamic is not anything strange or peculiar. There's a lot of instances of this that I've experienced as chair and other tourists have spoken to as well and yes, naisha is right. It needs to be cleaned up. It's insane. I've never worked anywhere ever where these types of things are acceptable and that we would even have to be on this merry- go- round. For this long to fix the problem, people would be fired out anywhere that I've ever worked and instead in this culture I'm targeted because I'm the one that constantly has to be like what is going on and I'm sick of it. Okay, I just want to even find it on the June on the community board the website. I can't even find any of this like I said. I think that if it's clear from the secretary's end, if she had you know that count, then we need to go. Then contact Liz ask for that communication. There's internet executive. Hopefully, then the executive committee can ratify it at that point, I'm trying to if folks are without you know necessarily willing to follow that procedure. Then we really do have to bring it before executive. I'm generally not going to say. I know Xyz happened, I just yeah, I'm not there, so yeah so like I said, but you all know that you voted on this June of 2019. That much you do know. Ah I know how something and that it would not be ratified it did pass. This was I just want to clarify. This was the meeting we voted on when we had the presentation from the person talking about like sanctuary cities and like people being dropped off like the male identifying person was like he came in and presented right. I just want to make sure that I'm very clear, because I vividly remember that day and this resolution, but I do not remember it. I do not know if I was there or not for the General Board, so I just want to explore so listen. I was supposed to be on another call 19 minutes ago naisha. If you would allow. I know that you're doing something that you want to bring up, I'm not going to go in depth. I just want to put these on the table just briefly, but would you allow me to go before you naishes so that I can jump off no yeah discuss what I what I had to say? I just shared it with you. I was just making sure you could share everyone up like everyone else in the committee about the black lives matter, protest I'll! Look for that out. So these are the three issues really quick tipping practice, because my son, for instance, was working in a school, but he was also working in a restaurant in Indiana and it kind of highlights what's happening here in New York, which is that people who generally work for tips in this environment where people can not frequent restaurants, for instance, or any other things that have a tipping structure which, by the way, derives from slavery of the transition from slavery into other systems, is how tipping got implemented, and so the fact that the minimum wage for people who get tips is lower than the standard minimum wage is problematic and puts people in harm's way, especially in an environment like this, where they can not receive tips. People are frequenting spaces like that. So I want to put that on the table. Sorry, this is random, but I just can you share literature because, like I do not die at all like at 100, I believe it and it sounds like some american[ _ _] yeah, but like I really would like to see the literature for it just so. I can know more because, like this also is something that should be embedded in my presentation. Absolutely so, and so I really just want to put this out so that the committee's aware of it and that when you know by the time I pull together more stuff, that you know you guys have already liked mindset and understanding of that's the direction. I was waiting for a text from someone they did not get back to me, but seemingly right now. This may be something that we may want to exercise on the executive level this month, if possible, pending this information, Ex Parte evictions are still happening in New, York city experts say evictions. What they are and etta probably can give us more background on this. It's basically that they're allowed to bring a case against you attempt to serve you and you can be evicted despite your presence in court. That expert say if I'm right means that they can have a proceeding without the other side and a determination can be made. I was informed of this threat on someone that is in our district happening now, she's waiting to hear back from her attorney about the logistics of that, but I personally have been targeted with an expertise attempt on my apartment in the past, and luckily I was able to get my lawyer to basically step in the front of that and actually confirm that. My lawyer, my landlord, had told which, by the way's new presbyterian hospital, a bunch of lies in the upper court, Ex Parte, to attempt to get me evicted and it would have worked had we not intervened when we did so. This is a major threat, especially like how are you doing this during Coronavirus Times right, not to mention that evictions for people who have an attorney on both sides have moved forward? I think that presents an inequity for people. Just because I have an attorney does not mean that I'm I could not get evicted and why should be evicted when other people who cases that are imminent, can't get evicted and coronavirus, and there are people laying on the floors in lobbies and on the stairwell in shelters, as we have seen in the New York Times. I'm not sure if everybody saw that, but people have nowhere to go. They do not even have places in the shelter for people to go. How can we evict anyone, so we should not be having evictions moving forward. Is my point to that and Covid-19 succession. I believe that there needs to be something said about the fact that normally succession rights is two years you would have to be with the tenant in order to get succession right, but look at the amount of people that we have had, specifically in our district that have passed due to coronavirus and it those family members who may live with them less than two years with this sudden occurrence. They may not have pre- existing conditions, they may have just passed because of Corona virus, and now that family member is in threat of being evicted from their home because they would not be able to establish their succession rights so out there I feel, like, unfortunately, I wanted to some of these just came to me, but others I did want to bring earlier on. So it could be a part of the meeting, just a full transparency. My son's first cousin was pulled out of a creek. We learned that he passed literally on Monday, so it's been a crazy week for me, but I leave you with those three things. As things of importance, I will get more background information on them and forward that to you guys, and maybe we might need to do something on the executive level before general- just wanted to put that out there. Thank you guys. This has been a great thing. I'll just quickly, then go bills that I was going to mention from the city council. It's really their own of trying to deal with the specific issues that we're concentrating now very quickly do not need to go too much in depth. 1936 was actually already passed. It's already been made law. Essentially, the very kind of very quick information is just it's in relation to amending the definition of harassment to include threats based on a person having been impacted by Covid-19. It is essentially just ending it infant, the event that someone is being harassed because they're, you know either expected or actually have contracted Covid-19, and they are being harassed by you know whether it be a landlord or perhaps an owner of an apartment and being essentially threatened to be removed rather from their home. It also includes, in the case of an employee or worker relationship. You know it's really just providing those protections and also making it clear that there is going to be a penalty being driven in the case that they do find. This happens. What I'll, also just want to make note of is actually bill that our counselor Mark Levine had spoken about that he was you know. Also, personally, supportive of it was really to try and enact- I guess you could say an extension of really the egyptian moratorium for up to a year. You know, I think, that I made it clear that I was. I was more concerned about this bill because really keeping a more turn for a year could leave a lot of businesses lacking certain resources right to fund those businesses. You know in an ideal circumstance I think it does carry some weight of course offer that protection, but I think it goes a bit too much to one end, leaving out the concern for the economy. This bill is actually being laid over. It does not move forward. It's been pretty much kept in committee right now. In addition, I'll also just make note that, if you saw in the link I sent along with this bill, there is already a state wide sort of court case going on now, because Landlord's already upset with the extension of the current eviction moratorium in order to enact such a drastic measure, it really will take the actions of the state, and I think that you know members of the council also have to be essentially privy to that they have to understand. There will be a lot of pushback on this, not just because of you know, big time landlord, but also a lot of small businesses. It does drive a lot of questions for the you can not the economy for a lot of small businesses. So you know, maybe there will be some something happening along these lines. I you know certainly do look forward to learning more about it. If there is more work being done to understand the impact of this bill, I definitely would love to see it. Does anyone have any comments concerns about these last two items? Okay, does anyone have now any new business old visit to bringing forward again? I just wanna Circle around about what's happening in terms of racial justice and like all the things that are going on, I wanted a. I know. Sorry arya, if I see like I'm imposing, but I just wanted to provide space for people to speak about it if they needed to and for people to know that you do not have to say it here. You do not have to tell me now, but if you need to talk to someone or just to like express yourself, I know personally, I've been dealing with a lot of people. Messaging me on Instagram and being exhausted. Really is the only way that I can put it, but I just want to let everyone know that I'm here to have a conversation and to like can I have resources. I know that I can share with you all there's this resource for like people of color who are constantly being challenged about their fans of the black lives movement and like ways to like interact with those people in a way that, like does not compromise. Your life, well- being so, I just wanted to bring that up and offer the space for people to reach out to me if they feel that they need someone to talk, but also again bring up the protests, not the protests but like there's an event happening in Washington Heights in support of the black lives matter. Movement, specifically like Washington Heights in support of black lives matter, and I would really appreciate it if you all, I'm showed up and supported. Thank you, yeah! No, not ever going to be imposing at all. Looking out for this community did anyone else have anything else that they'd like to also make note of. I do also realize that I did not necessarily bring it up at the very beginning of the meeting. I think that I wanted to try and give also the opportunity at the very end, because I do know that this it's also it's also just very exhausting for a lot of individuals, mentally spiritually, health- wise. Quite frankly, I think that it's just that we have not necessarily always had a proper space. I think that even right now, even amongst the executive committee members, you know I'll just also state here that there's kind of I think just a very strong, problematic understanding of how to address this kind of concern, and I and I do not necessarily agree with some members that have already started making certain comments, but I do want this entire board to have a conversation going further than it has to address race to address racism, to address. Yes, all the individual outcomes and the impact that has had microaggressions that are had on individuals. I think that right now we're having an issue just even saying the word race or racism, and it's it. I think that's one of the most upsetting elements. You know, I think words, thoughts. Prayers are important. I think action is more important to me. I think that, having been a government an employee for years now, having seen concerns of accountability being raised, having participated on the 2019 Charter Commission, having really advocated for accountability, does not get enough attention. It does not get enough time that I just want to say that oh see did you have something to say, because I just spoke so just to follow procedures. I came back because of these two guys. I just wanted to say I actually. I wrote to my other meeting and told them that I would be back that I'm there, but I wanted to come back to my meeting, so I I really appreciate each and every board, member and all the board members that I have served with right and I feel like these conversations are so important because it can only serve to help us to do better work without the amount of infighting that we constantly see. If we're honest about the dynamics that people are experiencing. I know that the tangent of that is recently happened in the community and I think it's important to recognize the same way in the same vein of what Naisha presented earlier in this meeting, that everyone's experience is different and we can not assume because we have a specific experience. That is not for everyone else, and that and I'm not saying that you know everyone should be taking at face value for everything that they say, because I've had problems with things that I feel can be proved that people push back again, but when it has to do with certain types of experiences, even when you can prove it seems to not get as much light and people are not held accountable for that and that needs to change. And what's the biggest thing for me is the fact that before Richard Lewis passed, he sent out a document. I think it's like 21 pages that came from the previous retreat from even before I started, but which many of the senior members of this board were a part of, and I have to say to you that reading those 21 pages was astounding to me, because basically, everything that was documented from that retreat are things that many people on the board, people who have quit the board. I have been in meetings where people stormed out because they were exhausted. I've gotten to the point of questioning. Why am I here? If these are the dynamics that play out right and to see that a document actually confirms things that I've been saying over and over again and people who have been here and were a part of that process have been looking at me like, I have four heads yet that document exists. That is just to show how blaring the problem is. That can be happening that there's a 21 points document that says yes, this is a problem, but yet me not knowing the document exists, bringing up some of those things and other people doing the same and being treated like. What are you talking about? That's not a thing, it's a problem. So the fact that the inclusion resolution was held back after we did vote on it. That's another example. It was not even sent. It was not even drawn up and done what needs to be done with a resolution, which is another example of the feeling in the office that went forward all the tremendous work and angst there was angst around that resolution, and yet nothing happened with it until one specific person had to insist on it and when we have to be those people that insist, we are treated unfairly. We are treated like the squeaky wheel, that's annoying the hell out of everybody when, if the work was just being done according to how it needs to be done, we would not need to be those people. It is truly unfair. That's my spiel! So how do you suggest to fix that? I think that there can be like Naisha said, like I have attempted systematic structure also Ariel alluded to bylaws. There was a group that had come together to work on bylaws before the election, but now after the election seems many of those people are not the wanted people at that table, despite the fact that they worked for very hard and over months, looking specifically at those things, they've not been brought to that table as people that may have suggestions in that process. That's part of the problem as well, and another part of the problem is look how long this has all been going on. For instance, the claim about some of the experience that some board members have in this board started last March. It is June of the following year, that is a year and three months and we are still do not even have a bylaws committee like I do not get it, and it's really just willful lack of accountability. I'm sorry Aisha, I heard you, but I also just want to say that I have to get off now. Thank you, everyone for everything, and thank you for listening to me. I think there are great conversations. Having are we happening and we should be having them. I know I won't see you all for three months, but I just wanted to acknowledge and respect everything that was said and say that I value it and I think there's so much work for us to do and I'm so happy to be doing it. Alongside all of you happy to have you here doing it all right have a good night, y' all good night. So I I just also continue echoing that very introduction, already just being made by Asia in just giving people time if they would like to take any moment right now to say something that they have also been taking, especially to work through their own capacity. But I also understand that for some who may not want to say something that is because you're still trying to work through it. I have a question you know so some new girl and I'm still trying to figure everything out here so and I hear that the community board is still working out about their bylaws and whatnot. Does this committee have sort of like a mission statement, some values that we abide by some goals? Anything that kind of the reason I'm asking is this is because, when I think of a housing committee right, what is it housing and human services that that's our is the title of this committee? There's certainly a racial justice component that needs to be front and center right, because when we're talking about keeping people in their homes or not just affordable housing, but quality housing and what kind of populations we want to serve and what kind of issues that we want to propose to the board and to keep on the forefront? What kind of organizations we want to invite to our meetings. I think there are certain, maybe values or goals that, should you know check off. So I'm just curious if there's anything like that for this committee or other committees yeah. So we kind of came in at a very odd time, but the first meeting that we were supposed to have in March when I you know suffering the position for chair was supposed to be dedicated towards that. Unfortunately, we did not even have Quorum come now, April we're already literally in what is now. But yes, the intention is to now be in September, unfortunately, is to take time with the entire committee to set aside goals for what would be now the coming year and I'll say this from being September, then to will be May of next year to really try and focus on what we want to either study in more detail or potentially focus on bringing into this committee, and I say that it broadly, but I also want to just point out that if we have various organizations in the community or acrosss the city that have been doing already, the very important work right now. Can we reach out to them? Can we bring them to our committee? Can we have a present? Can we also have them discuss what are some of the findings that they have really come acrosss in their own research, because, quite frankly like I would, I would love to have the furman center present to us, but I would also love to essentially reach out to the center for law and social justice at Medicare Editor, never ever college. They have a great deal of work. That was already done. Quite frankly, they were very involved in something that had to deal with racial justice even prior years ago. So I think that that's kind of the things that we should outline- you know, I think, are in September. We want to have that at time right. You want to have an agenda set for a year, but also, I think that we want to start actually reassessing yearly what our goals are going to be because everything's going to continue to change, and you know personally, I think that we need to spend more time on discussing elements of the essential rezoning. I know that it has been quote unquote stalled now, but something tells me that might very well become another point of issue for us again. On that note, you know that the oral arguments are scheduled for next week, right, June, 10th, yep yeah. I yeah that. That's why I'm saying right away. I just I have a feeling so yeah. I do think that we will need to discuss a bit more, but also potentially even work with some of the other committees. What I also was mentioning I've been having some individual conversations with other chairs. I think that we also need to have more joint meetings. I think that might also add to some of the ways in which we could potentially work, whether it be, let's say with the youth and Education committee, talking about the homelessness rate for a lot of young children that are in public schools and potentially then working with, let's say small business so, like I said those are just my thoughts. I do want to take some time to really allow them to lay out what our agenda is going to be for the next coming year. That was really helpful and, of course, if I am if I join your committee, if I'm placing your committee I'll reach out to you separately about some other ideas, because it's already so late, so you know to be respectful of everyone's time. Oh well, thank you thank you and thank you for coming to today's meeting seriously. If there is nothing else on top of new world business, I just want to say I wish you all a wonderful summer. I hope you get to connect as much as possible with your loved ones, and I hope you know to see you all soon. Maybe if we get called into a committee of the whole, we might see each other sooner, but I do wish you all well, and you know again just thank you for the work you've done. I know this is a very odd time that we all kind of came and got assembled together, but it works well, and I again I appreciate every one of your contributions. Thank you. Thank you. Ariel good work. Thank you. Everyone, okay, bye, have a good night, everyone good night, oh and I'm so sorry, I'd like to call this meeting to a close. May I get a second okay, 16. everyone? Yes, 10:16 P.M have a night a great night. Take care bye. You.",
            "summary": "Our five guidelines are stay consistent with people first language, so using nouns before we use adjectives using active and positive language, so avoiding victimization and always putting a positive instead of a negative connotation using universal language, so avoiding idioms and ensuring that we're speaking play language using gender neutral language and not assuming individuals, pronouns.\nAnother thing that I think is important for us to know is instead of saying poor person unfortunate or less fortunate people, we should say a person that is experiencing economic disadvantage or a financial hardship, a person experiencing poverty or a person living before the poverty line.\nNow I'm going to move on to the second of the guidelines, which is use, active and positive, language, We should avoid using phrases like suffers from a victim of because it assumes that individuals are suffering or identifies as a victim and when we're having these conversations, we do not necessarily know that everyone, that is, a survivor of domestic violence or a person that is living with HIV or a person living with some disease, necessarily identifies as suffering or that they're a victim of it.\nIf we're trying to help this population, we need to center their humanity and make sure we're being as inclusive as possible, so avoiding language that connotates pity and trying to use the active voice when speaking about things that happen to or are done, to, individuals.\nIf we're practicing the people first, we want to say a person living with HIV and not necessarily suffering with a person that is living with diabetes, a person that is living with, but dealing with obesity right and these things that do not add negative connotations to the circumstances that individuals find themselves in third guideline is using universal language.\nThat's like regularly brought up, and I think it's something that I really wanted to bring up because of how much how charged language is and how important it is for us to be mindful of the things that we are saying and the connotations that they're associated with.\nI, think that, because it's so Dis dissociated from its original meaning that no one really knows where it comes from, but the term actually is rooted in the fact that in the early 20th century, black people were forced to sit in a balcony that was often referred to as the peanut gallery or the n- word gallery.\nThis is because I often find members not necessarily from our committee, but I, know definitely from the larger on board, referring to the chair as a chairman, and I think that if we should move away from that language, because not all people prescribe to the gender binary right- It's, not everyone identifies as female or male, and we need to respect that.\nYou should just ask I'm in the habit of introducing myself and ensuring that I state, my pronouns, which are hers, but I, think that it's really important for us to discuss pronouns, because for many people this is a relatively new phenomenon and they're not comfortable with the concept of pronouns We should become familiar with, but I think we should definitely at the very least, know that pronouns relate to a person's gender identity, particularly how they want to be addressed when they're not being spoken to when they're being spoken to or about without their name being used.\nIf that's what they decide to do without making them feel like they have to right, and so I wanted to focus on inclusive language, because I feel like in the time of search of Covid-19 and having virtual conversations.\nI think that this is also a great presentation to be done at the general meeting for the purpose of put furthering a possible resolution, but also so that we are informing not only our full board but our community.\nAmazon does not do good in a lot of areas, but seemingly in the tech, environment, they're very, very much progressive in making sure that everyone feels accepted and that there are safe spaces for all types of people, and I, for that was the first person that I saw it done so like it was so immersed in the practices and also in the discussions and meetings that we had that.\nThe last thing that I want to speak to is exercising this type of spirit, not only in the words that we use, but also in our practices that in this board, specifically that there be safe spaces for people to express themselves about all things, and I.\nI also feel that this type of work that Naisha has done here is things that people should be credited for like this body of work and the idea that this can be a part of this board's practice for all time now is important, and I feel like often over the years people's work when they put hard effort like this into things, This person sponsored this resolution or a practice or whatever.\nI focused on the things that I did focus Is just to be specific to the committee that we're on and like the language that we use regularly, but I do think that.\nIf, given the opportunity to make this, like a resolution and present to the board, I, do want to include things that are relevant, more relevant or more specific to race and gender expression, because I feel, like those are the most common types of tensions that exist throughout the world.\nI know this may turn into I Am not an expert at all, but I definitely think that if you all have any questions or want to have a conversation or talk about a time, where, like I used to share with you that you misgendered or you were misgendered And how that made, you feel I think these are important conversations to have so that we're normalizing these things, right.\nBut I also think that just like whatever they decide right because I am not, I do not identify as a trans person, but there may be someone that does and does not feel included.\nThe second part, as far I just wanted to know other committee members thoughts as far as implementing what exists, for instance, in City Council in the assembly, Et cetera, but as far as crediting people who bring ideas to the board as sponsors is done in any other.\nWe should give people credit right if people spend because people spend time writing these resolutions, and if people are spending time and bringing ideas and putting their time in even if it's like 15 co- sponsors and it's a whole committee, right, we're all working and we're all putting it together, and I absolutely think that we should be credited for it.\nThe resolution, of course, is still out of the word of But I think that it also says a lot if we're putting it in the bylaws for every single member that might join in the coming.\nOr Naisha is going to take it to the task force for discussion and then bring the resolution from the task force Maybe you want to check in with Gail Brewer's office, to see what's being done with other community boards.\nWe're, going to share the presentation with in our community thread on now, so you all can feel free to share with whoever and if you're, not a committee, member and So I'm sort of wondering if there are any other public people or board members on the thread here who want to make a statement?\nYou, know: you, I think, also, if so, if people do not so again, just like reiterating parts of my presentation, if people do not feel comfortable speaking, we should also allow them to stand in their silence and feel I'm.\nIt has been referred to specifically the budget and revenue committing so just check the individual actions by clicking on this little tab here, And below you'll, see now a summary establishes a billionaire mark to market tax, taxing residents with one billion dollars or more in net assets and directs revenue from such tax into a worker bailout fund establishes a worker bailout program providing workers traditionally excluded from wage protection programs, access to unemployment, benefits If you language, have free, contain a clock, you'll, see some further explanation as to why the individual sponsor of the bill wanted to present this good.\nEven during this, the summer months, whether that happens, I want to use their clear language that says, may do this, but it's not It's already been introduced into a committee.\nYou know that we're already here in our own committee talking about individual issues, right, there's this an assembly counterpart and do you want to do a reso about them?\nActually I'm, assuming that some of the what we discussed in April was it in the resolution regarding coronavirus, and you know making sure that people that are affected get benefits and things of that nature.\nDo not think that I've seen language that has been able to, or even a report or a survey- Whatever resources are available to make a recommendation based on the data that they could find, because, right now, you do not have to be a resident of the state or even a legal resident to pay taxes.\nIf I ask for money, they're going to question me speaking to Like he's in need now other people because of his status, and there is the feed that anyone.\nWe may just want to put an asterisk next to things that are more background, information, which the board can be told what that is so that if that comes up as a concern, we will know like what can be.\nI know not a committee member, yet I'm wondering whether saying how poor non- Citizens are is necessarily useful to this resolution.\nSo I think that in mentioning how the difference is between a non- citizen and that of someone who has permanent, you know permanent residency Is that now it do in this during this pandemic, then that brings it home in the way that okay, They contribute to our economy, but in this pandemic, this is how they're affected , then that helps to kind of like sell this reso and the bill as a you, know, viable option to remedy that.\nAre we just concerned more about like if you're making the case you're saying hey these people contribute a lot.\nI err on the side of keeping it specifically, because I know that there are people that will argue against how appropriate it this is, and maybe not from our community but others, And, so I feel like the fact that they can get this money.\nAnd I'll vote as well, so that will be members and support, and the committee I vote, yes, hi!, Thank, you, okay, So I will now save these at the bottom of the resolution, and I will send it on out at the end of the meeting, the presentation.\nAgenda, Minutes office, staff, responsibility, chair process, and that was brought to a full halt, because the intention was more on let's pitch and hold aisha, because we do not like some of the things that she says, despite whether they're true that- That's, very important work that needs to be done.\nThis resolution in front of us right now on the screen was already The housing and Human Services Committee voted on it.\n, if I see like I'm imposing, but I just wanted to provide space for people to speak about it if they needed to and for people to know that you do not have to say it.\nYou do not have to tell me now, but if you need to talk to someone or just to like express yourself, I know, personally, I've been dealing with a lot of people.\nI think that even right now, even amongst the executive committee members, you know I'll just also state here that there's kind of I think just a very strong, problematic understanding of how to address this kind of concern, and I and I do not necessarily agree with some members that have already started making certain comments, but I do want this entire board to have a conversation going further than it has to address race to address racism, to address.\nYet me not knowing the document exists, bringing up some of those things and other people doing the same and being treated like.\nThat kind of the reason I'm asking is this is because, when I think of a housing committee right.\nThere's, certainly a racial justice component that needs to be front and center right, because when we're talking about keeping people in their homes or not just affordable, housing, but quality housing and what kind of populations we want to serve If there's anything like that for this committee or other committees So, we kind of came in at a very odd time, but the first meeting that we were supposed to have in March when I you know suffering.\nAnd I'll say this from being September, then to will be May of next year to really try and focus on what we want to either study in more detail or potentially focus on bringing into this committee, and I say that it broadly, but I also want to just point out that if we have various organizations in the community or acrosss the city that have been doing already, the very important work right, now.\nDo think that we will need to discuss a bit more, but also potentially even work with some of the other committees."
        }
    }
}