{
    "data": {
        "YoutubeMetadata": {
            "author": "QCB5",
            "channelId": "https://www.youtube.com/channel/UCmNhzj_PNx2VtdyIU77KDyg",
            "title": "Queens Community Board 5 November 13",
            "publishDate": "2019-11-13",
            "shortDescription": "The regular monthly meeting of Queens Community Board 5\\nNovember 13, 2019\\n7:30 PM\\nChrist the King High School\\nMiddle Village, NY",
            "lengthSeconds": "1:46:09"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "QCB5",
            "normalizedName": "Queens Community Board 5",
            "twitterName": null,
            "youtubeChannelName": "CB5 Queens",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC51mApBs4KUp4T8avIhyAnw",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "lHzMn6hFhmU",
            "fillerWordCount": {
                "uh": 0,
                "um": 0
            },
            "readTimeFullTranscript": "56 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "students": 34,
                "school": 22,
                "census": 16,
                "services": 16,
                "money": 16,
                "business": 16,
                "schools": 15,
                "contract": 15,
                "reservoir": 15,
                "evening": 13
            },
            "wordCountSummary": {
                "students": 7,
                "services": 6,
                "contract": 6,
                "school": 5,
                "mayor": 5,
                "money": 3,
                "life": 3,
                "shelter": 3,
                "man": 3,
                "person": 3
            },
            "fullTranscript": "Because that's such a strong desire, Oh first, why? How much right yowls I tried one on they're. Looking for you? Oh good, have you attention? Please all applaud members should be signed in and get their mail. Anyone who wishes to speak under the public forum should be signed in by now elected officials and that representatives should be signed in also, please thank you. Okay, all right, everyone get him find a place, and you live good evening. Welcome to the regularly scheduled meeting of community board five Queens, just a reminder and no one else will be permitted to sign it to speak under the public forum. Once we start, we are once again live- streaming, so we ask you to comport yourselves in a lovely fashion, because your great- great- grandchildren will be able to see you cause you're going to be up in the clouds. All right. Would you please rise? The flag is back there. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands. One nation under God indivisible with liberty and justice for all. So we have thank you. Have a couple I added starts tonight, so we have Denise Esposito speaking to us on certain training from the New York City office of emergency management, wherever you want to be, there's a microphone on the table or the one back there Donald cheese, yellow. This is on yep, okay, I'm Denise, Esposito I'm from the emergency management and I left. Some cards out on the tables I can give some to those in the back and that's about the cert program. That's the Community Emergency Response Teams. We have them in every community board and we are going. We do trainings three times a year. We try to do it in every borough. The next one that's coming up is in February and it's ten sessions. Every night is a different topic and we're trying to do it here in Queens, five community board, five and also in the Bronx, but we're looking to get some signups tonight just to find out more information about the program. Cert members go out and they help their communities to prepare for emergencies, and they do that through the ready, New York program. They figure out how to make a plan for your family and how to practice it, how to pack a go- bag and how to get information some resources on how to get information. They also help out first responders. During emergencies. They can do anything from directional guidance, helping people get from point A to point B and then also help out in service centers. They do a lot of things. We can tell you a lot more about it. If you sign up on the sheet, we can give you a call or send you an email and just explain exactly what they do. It's ten sessions, as I said we do that on either a Monday, Wednesday or Tuesday Thursday night, and we do that three times a year if you would have to attend an orientation session, so you would go on the card. You can see, there's a website how you sign up and you attend an orientation session and we'll tell you all about the program. Everything we do is free and after you graduate from the program, we do other trainings like CPR. We offer a lot of different things and everything, as I said, is free and we give you the uniform and we hope that you will sign up on the sheet I'll, send it around rich Yogurt. Take that microphone down there. Thank you, Richards red, sorry about that. Do you have a date yet for the initial interview meeting that is required. What was the question? Do you have a date for the initial interview? We do orientations several orientations throughout the year, so you can attend any one of those orientations. Once you apply, we send you an email, that'll, tell you all the different orientations. Okay, thank you all right. Anybody else have a question. Okay, I know you want to collect these or we collect them and send them to you whatever you pass it around. Okay, thank you. We have another presentation and say Aki Kobayashi Bristow in the US Census Bureau good evening. Everyone thank you for having me today, I'm going to just show you a quick video about the 2020 census, the 2020 census. Every ten years the census records everyone living in this country and comes in questionnaire that counts. Everyone who lives at your address on a bill first, the data can be used to inform funding for services like fire stations, schools, clinics and representation that affect your community. How will 2020 Census data used where there are more people? There are more needs for public services. That's why the census is used by the government to inform funding decisions each year, but that's not all. It's also used by nonprofits to inform services by businesses to create jobs and even by students for school projects, understanding how the population changes helps us shape communities acrosss the country for the better. How does the 2020 census affect our presentation? There are 435 seats in the House of Representatives. These get distributed to the 50 states by population and an accurate census response helps your state get the right amount of seats. States with smaller populations get at least one, while states with larger populations might get more. How do I take the 2020 census in March 2020 every address in the country will receive an invitation to complete a simple questionnaire and there are three ways to respond number one. Do it online number two call by phone number: three: send it by mail for those who do not respond. A census. Taker from your community will follow up an assistant. Is my 2020 Census data safe. After sending your census response, your personal information is kept safe by law. It can't be shared with any other government agency, law enforcement or landlord to know so. Take your 2020 census with peace of mind, shape your future start here. Visit 2020 Census gov. What is the 2020 census every 10 years? All right, so I think the video speaks itself, so Census 2020 census is coming up April next year, so we only have 139 days to the census day and, as you saw in the video, we are hiring tens of thousands of census takers, and this year we offer$ 25 an hour, flexible schedule and weekly pay. So this is a great way to earn extra income. While you help your community, because your community deserves the federal funding money to build the schools, hospitals, roads, bridges and all the programs that's important to you and to your community. So please spread the word. The census is safe, important and easy, and we are also higher in tens of thousands of people. Thank you thank you and crystal where I crystal is had taken my place on the Census Committee for the borough president since I've been a little busy I want to thank you for that. So if you have any questions on the census, you can contact crystal or the Census Bureau or Borough Hall. Thank you. We'll now go to the public forum. Three- minute limit, try to keep things reasonably sane and no foul language. First speaker into the Public Forum Crystal Wolf. First I want to thank the 23 participants in the fall drive for the homeless tour. The toiletry drive hosted by my nonprofit catering for the homeless. I will thank all the participants at the next month's meeting after I have a complete total of items collected community Ward 5 is kindly extending drop- offs to their office until this Friday November, 15th I. Think all community members who have generalist generously contributed to our drive. I would like to now address the latest meetings and hearings from the cv5. While it is important to hear from the community on their concerns and opinions on any given topic, the bylaws of our board meetings clearly state no cursing slander, shouting disruptions, etc. The behavior toward the community board five members and expressly Mr. Binney are Carrie Mr., Gary Jared, a no and elected officials like assembly man, Andrew Hevesy from recent meetings, or in merited and uncalled- for cv. Five members of volunteers who donate their time to serving and improving the community, Vinny and Gary, are two of the most wonderful and caring men. I have ever known. Hevc is working hard to promote permanent solutions to homelessness. These are wonderful people who deserve our appreciation. I do not believe that the CB5 should continue to allow attacks from the community as much as I respect all community members and as much as we want to make sure that everyone has a voice. We must all abide by the bylaws so that everyone may be heard. Everyone deserves our respect. These disruptions and attacks are not helping any of us to reach our goals. It would be more productive to work together than to shout at each other. Therefore, I propose that cv5 elect a parliamentarian to keep the order in our meetings. If anyone is acting disruptive ly in a meeting I believe they should be issued, one to two warnings than have the NYPD escort them from the meeting. I do want to nominate Jerry, Drake I, someone with experience working with the NYPD like Maryann or Walter, Clayton or Jerry, would be best for this position. Thank you for your time, service, generosity and kindness that everyone on the board and the community has shown me and I present the CV 5 I brought flowers to show you how much I appreciate your kindness and your service. Thank you so much. Thank you. Thank You, crystal Kathy O'leary will accept the flowers. Thank you the second speaker under the public forum, Danielle Rivera good evening. My name is Danielle Rivera and I'm, a constituent of City Council, district, 30 and I'm here this evening to advocate for City Council bill, one four, one: six, which prioritizes environmental, health and public health by addressing the needs of lessen the amount of single- use plastic waste produced by New York City single- use plastics. Our products that are made to be used once so things like plastic cups, straws utensils and the overconsumption of these products is concerning because they often do not make it to a landfill or recycling unit and about 500 billion disposable cups are consumed annually. Acrosss, the country plastic waste is not only hazardous to the environment, but it also impacts our food and water sources because they break down into chemicals that are dangerously toxic and, in some cases, are even cancer- causing plastic. Waste is also an issue in New York City, because our garbage is carried out on diesel trucks and these trucks drive about seven point: eight million miles each year, which impacts air pollution in our city. One way that my peers and I personally act to address this issue is by using reusable containers instead of single- use plastics. The only issue is that currently food establishments in New, York City, can deny our request to be served in our reusable containers when purchasing a beverage I'm urging you to reach out to city councilmember, Bob Holden's again his support of this bill that would require all food establishments in New York, City, to honor the request of a customer to be served in their reusable container and also post signs to inform customers of their options. We should all be given the freedom to make choices that are healthy for our communities and healthy for our environment. The passing of this bill will allow us to limit the amount of plastic waste we produce and create a healthier future for our community. Thank you. Thank you. The next speaker is Wylie Goodman Thank You Danielle. It's going to seem like we planned this, but we actually did not. I do not know her, and she does not know me, but I'm here representing two issues. The first actually is the Queen's solid waste, Advisory Board, Organizing Committee. So for the past two years, I and a growing group of people have been advocating for our borough to be participating along with Manhattan and Brooklyn in a citywide effort, that's called a swab, their solid waste advisory boards, they're required in the Administrative Code and Queens used to have one and it fell out of favor at a certain point when people retired and moved away. So for the last two years we've been organizing and I'm happy to say, Joe Serena was here and he's been a big supporter of our work to bring this board back into a formal, recognized status by our borough president. We know that Melinda Katz is going to be leaving, and so we need everyone's support to ensure that the next borough president is on board with a swab as soon as possible. It's absolutely critical, so I want to encourage everyone to come to our next meeting. It's happening next Wednesday night at LaGuardia, Community College from 6:15 to 8. We have a website Queens swab NYC were on Twitter and Instagram in all of those places and I'm happy to share my email address. So that's my first plug here tonight. My second plug is really different. Some of you may know that last year, I worked with Ted runs from the Myrtle Avenue bid and Bob Monahan from the Greater Ridgewood Youth Council, on a project that was funded, a national grant that was funded by Enterprise Community Partners, to activate vacant storefronts in Ridgewood, in partnership with local artists. We did a really exciting event at the Ridgewood Bank that, like over 70 to 100 people attended, it was really inspiring and then the grant ended and it's been hard to keep that effort going so we're in a period of asking our council people for discretionary funding. I would like to ask and encourage anyone who cares about this issue. Who'd like to see some money going to a local nonprofit to work on this issue of activating storefronts activating public spaces in collaboration with artists and community people to step up, raise your hand, talk to Bob Holden, make it known that that's an issue you care about and again I'm happy to talk with anyone about it, because it's something I still care about my life to be involved in Thanks. Thank you very much, that'll close the public forum session of board five. The next item of business is the chairpersons report and that's me, Vincent our cure. Each a person hold on I think it's on that side is not it yeah, so I'd like to introduce some people. At a present tonight, Gary Giordano and district manager, Kathy O'leary office, associate Jonah Sereno from the borough president. It's office Joe if you step up please[, Applause], hi. Folks, very brief. The borough president sends her regards January. We have a new intern session coming up at Borough Hall and we've been rocking with that program. This past summer we had 37 interns in the summer at Borough, Hall and this past fall. We had 15 so for January, we're looking for interns and we're doing it a little different, College students. Yes, during the week, they can get hours which they flip for credits, but we're also taking high school kids, who need community service hours and though they can't get to the office during the week, we're booking them at events on the weekend, and this way they can get their community service hours so either give to Geary reach out to me or Borough Hall and Happy Thanksgiving. To all. Thank you. Thank you Joe. So some elected officials were representatives. Christian Romero, representing grace, Ming he's got a run, so let him go first, not jumping over you who Leon sorry good evening, cv5 thanks for having me Thank, You, Mr., Chair I'm, going to be very brief as well. The congresswoman had on Saturday November, 2nd. She hosted a town hall meeting at Queens, College I think I saw some of you there. It was a very informative, very nice meeting where the community got to ask questions. Also I wanted to tell you that the congresswoman is proud to of her education. Legislation were included in the recently unveiled college. Affordability act, I'm just going to go through them quickly. One is the Community College Student Success act. It improves completion at Community College's by providing funding to helping to help institutions, develop programs to boost degree, completion through academic and financial advising and then the second is the FAFSA translation Act, which would require that FAFSA be translated into multiple languages. The College Student Success Act was based on the successful CUNY program. So that's it for me. Thank you. Greetings from the Congress women and thank you have a great night. Thank you and representing Nydia. Velazquez is wholly on Salazar good evening again: Julio Salazar, congresswoman Nydia Velazquez office. Also just a brief update on two points. One of the pieces that I want to share with you guys today is upcoming on the members agenda. As a member on the Subcommittee on finance over and over in the House of Representatives, one of the things that's coming up is the CRA Community Reinvestment Act and one of the ones some of the proposals. One of the proposals is to ensure that the CRA is strengthened. Moving forward and what that means is that, if banks want to continue to expand some of our brick and motar, banks want to expand one to merge with other banks that they meet the CRA requirements and with the CRA requirements means is that they reinvest some of the those depositor funds. The funds that you guys deposit into those banks into the communities that they serve and the CRA is race- neutral, its designated by low to middle income neighborhoods. So what we want to do moving forward on what the members going to prioritize is that, as the regulator's continue to look at the CRA that we strengthened those requirements that banks continue to reinvest that they do not get waivers to skip that threshold. If they want to merge, if they want to expand, they need to invest in the communities where they are now. Second, the member was what's pushing forward as well. Today, some of some of her pieces of legislation as it pertains to our daca holders. The there was a hearing yesterday over the Supreme Court as it pertains to the daca recipients. So the member was proud to walk today with Senator senator on New York State, Senator, Chuck Schumer on the estate Senator Chuck Schumer, and more petitions and a piece of her legislation over in the Senate. So we can continue to keep the visibility out, so you can continue to keep the pressure on because we need to help our docket holders. We need to bring them out of the shadows. We need to provide them with some sort of security, so those are two pieces again Happy Thanksgiving to CB 5, all the board members again phone numbers, seven, one, eight five, nine 36:58, please feel free to reach out with any questions. Thank you. Thank you now. I'll introduce our councilmember Robert Holden Thank, You, Vinny and I want to thank everyone for being here and volunteering. Your time and I know I've been on the board for I was on the board for I guess 30 years so I know what it's like and I know how you do not get enough appreciation and I just want to. Thank you again for the for coming and being part of the board. I do not know if you I guess you heard, but I was appointed as chair of Technology, the Technology Committee of the City Council, and our last hearing this week was on next generation 9:1 next Gen 9:1, which essentially will be the future. We should have it already, but in the future, we'll you'll be able to send video photos and text to 9:1, among other things as evidence or as a complaint and many cities around the United, States and municipalities and things like 2000. Of course, the United States had it, or at least they have some sort of new technology. We should be able to at this point in 2000. You know 19 or even you know something to spells. You have Tech's 9- 1- 1 text to 9:1 way back in 2013. We do not have in New York City, especially for our death part of hearing population. It is vital, that's how we communicate what about domestic violence, victims who are under attack. They can't just pick up the phone and call without many times being further abused. So there's so many people that need text to 9:1 and for this city not to have it is ridiculous, especially when, like I said, Rockland County and many other counties around New, York State have it so apparently it's a big deal for the city to do it, and so I was on them. I was on the on the administration and said that we should have had this years ago. They did promise, listen to this one text and I on one will actually be rolled out and you heard it first June of next year. So that's a positive step, but I just do not believe them most of the time. As you know so, and you know, I asked the administration. Why not even do something like Smart911, which Nassau County had it since 2013, which and Suffolk had it also or has it you know? Smart911 is just like you get a profile that you can register yourself. So when you call they'll know a lot about you already that they'll know that you're hard of hearing or you're deaf, or that you had some domestic violence issues or whatever it's special needs. You have or issues that you have, they will already have that in the computer, your address and so forth and they'll be able to not ask you a million questions which delays response, emergency response, so we're on that as the City Council, but certainly my committee, it's a top priority because I I've spoken to 9- 1- 1 many times during by the way member the it was an attack at juniper, Valley Parkway back on July 4th. There was a couple of stabbings and I'm on the phone trying to tell them where I am on Juniper Boulevard, north and 77Th Street is that Jupiter, no juniper J you and I and it went on and on while somebody was getting stabbed and that caused. You know me to say this is ridiculous. We got to come up with a better system and we have it it's just it's not being implemented. So I'll do a couple more things. It have enough time Vinny and we're ahead. I, have you know, as you've heard about great Ford and I've been at the forefront of it there and we great for it is we have a number of situations and it's not only a mess with high school if you heard, but it's some whistleblowers came to me during the summer former teachers of Nance with high school, telling us in my office that we have a number of individuals that they were actually teaches. With pressure into past students who did not show up who never showed up, one did not show up most of his junior year and any he did not show up one day in his senior year and gets a lot. They graduated him early six months early. Now, that's that. So we uncovered that and then on some more and many teachers were actually threatened. If you did not pass this student because they want to have everybody graduate and they did not want to have them go to summer school, but then we learn just by asking more teachers and then more whistleblowers came forward and it's apparently widespread systemic. That Gravelord is now kind of in every almost every school to a degree, depending on the situation. The principles of leadership, the assistant principals. But it is an issue that we should all care about, because we're graduating students that are not ready and I saw it first firsthand as a professor at CUNY, and we saw students that years ago that were not prepared and it's still happening- and it's not getting better folks. So by that I've gone to the investigative bodies of the do- e and they took their sweet old time investigating this, and they did not interview the whistleblowers a month and a half into me, notifying them of the situation. They still had an interview, the individuals so that I did not like and I, went to the Queens, Da and now I've gone to the feds, because I think this needs actually bigger a bigger investigation because we're not only cheating, you know the students and that's a definite but we're cheating, the taxpayers and again when these students, when students go on to graduate from and it's not every student. But when many students graduate from the public school system. They should be ready for college and or ready for life, or both we're not seeing that most of the students that are graduating and that's not fair to the taxpayers in order to the students or the parents, a couple of things which I- and this was a pet peeve of mine as a civic member and certainly a community board member or these cars that play this loud music in many neighborhoods and ours, included in the will of ours that we've seen them all over. They play and actually put these huge speakers in the cars and spend thousands of dollars and they were congregating at Forest Park, and we were working on that. We finally got a gate, installed, parks farm and did a good job on that. They built it themselves and installed it very quickly and that stopped at the Forest Park man, shell, all that music playing, if you call it music, but they were playing it and we hearing it. I heard it on Coral Avenue in Middle, Village and I thought it was coming from Juniper and I walked to Juniper to try to find. What's there is its music coming from and my chief of staff Daniel lives in Glendale and he said no. It looks like it's coming from Forest Park, so he went over there and sure enough. The noise was traveling that far, but it was very loud in Middle Village, and so we discovered there's this whole group and many groups that move around, but they also it's a it's kind of a movement to soup, up your cars or at least to play at ridiculous levels. But it's a dangerous situation not only for the driver of the vehicles. You know hearing. You know the not good for their hearing, obviously and they're going to have problems later on, but it's really dangerous. When you think about it, they can't hear emergency vehicles. They can't hear another car horn alerting them. They can't hear somebody, maybe shouting you know you almost you're going to hit them or a cyclist. So it is a situation that is kind of dangerous, so we put in legislation along with uphold the law and council member of the loan I put in legislation to double the fines so from 100 to 200. It's a good hit and it looks like it's getting a lot of support in the City Council and we'll see when it has a hearing. There's many other girls that I have going on animal rights and so forth, but and on the homeless, shelter, I challenge the DHHS proposed homeless, shelters, 7816 Cooper, they have not given me the contract and we had the hearing on the contract on Monday nope. Was it November, 7th I think it was right and Gary did a great job and we had a number of individuals come down and testify and I said my staff, and we also had a member of this board, go down and review the contract and we had a couple. People look at it and we noticed that there were eighty eight beds listed, so I got a putting two hundred men in eighty eight beds. So that's what we have a question full on and we do not have an operating budget. They left that blank, along with other important information that we can't review so I've challenged DHS. To give me a copy, by the way, they're bound by law to get an elected official copy of the contract, and so far they refuse to do that. So we've challenged them with our City Council attorneys that they must produce it within a certain amount of time. It's five to ten business days, and that's already, you know the clock is going and we best. We had to put a formal request in we've done that and we're also going to challenge them in court, because there's a lot of things that they've done. That was really wrong on this situation. So it's this is not over folks we're going to keep fighting and we know the community will and I and I. Thank that we had very good turnouts, not only at the public cv5 hearing, but also at my town, Hall meeting at 119, PS 119 and certainly with the demonstration so I want to thank the community for coming out in force and telling the mayor that we're serious about this and smaller shelters are fine, we're very happy to take smaller shelters, I've established one already in Ridgewood and alpha-. I fund it. 100 now it's a hundred thirty six thousand dollars toward the food pantries in the neighborhood and I pledge to actually make some more smaller faith- based, shelters and I'll put my money where my mouth is and fund them. I just do not think a large shelter, out-, of- character, shelter fits into a one and two mostly one and two family neighborhood will accept. Certainly our citizens in smaller, shelters and I think everybody mostly everybody here- should agree with that, and thank you so much. Thank you for your time, cute councilmember and we're involved with that technology problem. It's interesting at the agency that handles that does. It is called Do Department of Information Technology, so they're in the process of converting us at the Community board, and anyone who is a faction ATO of weapons, try to renew your license or get a new one online, because you're not allowed to do it by paper anymore. You have to do it online and it takes a minimum rich six hours and it takes at least six hours to fill out. 17 pages electronically and downloading documents photos driver's license passport and then, when it comes time to pay, you can only pay credit or debit or a cashier's check, but you can't download them. You have to eventually wind up going to one Police Plaza and pay. So it's the technology is a disaster. Thank you, yes, rich. It also requires a lot of scanning of documents which many people do not actually have. Scanners. Most people nowadays are working on their smartphones and do not have all the technology that is required for that Thank You, Mr. Chairman. Thank you representing Antonio. Marine also is fine. Fatima Al men-- they and I always get confused. Is it Fatima? Okay, hi guys? So just some really quick updates for everyone. We are in participatory budgeting season, so that's happening. We had an assembly last week at PS 305 right now. We're done collecting ideas. So if you're interested in volunteering contact our office, we have some really amazing budget delegates and a lot of really interesting ideas. So if you want more information about that contact our office, we offer we also have CUNY citizenship now coming to office. Every Thursday about so you can also reach out to us if you or anyone you know, needs free legal services. We have that every week and yeah as it gets colder we're hearing from a lot of tenants about issues with their heating or their landlords. So we can also help you out with that. If you reach out, if you need to be connected to legal services for any housing issues, we can connect you so yeah. Well, so we're always a good resource for that yeah. Happy Thanksgiving again. Thank you, representing Senator Joe Addabbo is Sarah Spellman that way. Hi everyone I just have a couple of quick events. My boss will be stopping by later the first one we're having another Java with Joe on Saturday November 23rd from 10:00 a.m. to 11:30 at the Avenue diner at 90,106 should make Avenue in Woodhaven it's a good time for people who are normally working 9:00 to 5:00 to come. Hang out with my boss. Have a cup of coffee. The businesses that work with us do end up donating a portion of the proceeds to a charity of their choice. Oh no see I should have yielded my time. No, you can jump in okay, then we're also having a free, prostate screening on Saturday November 16th this weekend, I believe we still have a couple of more spots left from 10:00 a.m. to 11:30 I just realized. This was out of order. You can call her Howard Beach office to schedule an appointment and then we're also having mobile office hours on November 20 21st from 5:30 to 7:00, Woodhaven library, at 85-, 41, Forest, Parkway in Woodhaven, and now introducing some new Dabo to the microphone ya know you could hate did that on purpose, so you get a double shot. Yeah good evening, everyone Mr. Chair, just two quick things and I want to thank Sarah for doing the event stuff, knackering national, great I agree with the governor's doing at this point. You know nobody should be held hostage to a utility company. They got one job to do. Provide gas, it's critical service. If they can't do it, then we find someone else. Who can my people should not be held hostage to any utility company. I have two bills that would be pending. As we start next session, one bill says to be provided: a utility is civil right because, let's think of it now you're coming upon very cold weather, should not utility company tell you can't get guests because they know the cold weather is coming and they know that the only game in town to me being provided clean water, clean well gas in this case electric it's a civil right, so that's one, the other ones, a task force to figure out if we do deregulate ninth- grade. What do we do next? But if anybody has any issues with not great going forward or any kind of utility service being provided to them, please let me know so I do think of it as a civil right. Secondly, we're on the heels of veteran Satan, any veterans in the room. Anyone. Thank you Mike, of course. Thank you very much. Every day is better than say, please a round of applause for our veterans. So recently we did the hearing, send it to the hearing in Rockland County, as a member of the Senate Veterans Committee I was there and they had to do with veterans suicide rate. It's a high number. We know statistics I'll, give you one nationally for every hundred thousand people. The civilian suicide rate is fourteen per 100,000 for veterans that forty number goes up to thirty per 100,000 people. It's a number we can address, because if once we address the issues, that veterans are faced with every day: housing, employment, Health, Mental, Health and physical health. Once we address those issues as a city state in federal government, we can see that number decline, and so that is going to be one of my focuses are I going to the 2020 session as a member, the Veterans Committee, to address those issues at the veterans face, so that we can start to reduce that number of the suicide rate. So that's just a little something that again we need to address, but to the veterans in the room. Thank you very much in this season of Thanksgiving I say. Thank you. Thank you to everyone. At cv5 for the residents who show up and care about the communities, thank you so to all hey, Happy Thanksgiving. Thank you very much for share. Thank you. Thank you. Representing Assemblymember. Hevesy is Kevin with a new ski good evening. Everyone again, my name is Kevin was neski with Assemblyman Hevesi office. Just a few quick announcements tonight number one is that we had a successful Thanksgiving toiletries drive for the homeless. So thank you to everybody that contributed, and especially thank you to Krystal Wolfe, for coordinating the drive and including our office number two. We are partnering on a new drive with the shoe box project to provide gift packages for women that are either homeless or at risk of becoming homeless. So, if you're interested in seeing what we are collecting I will be leaving some flyers in the back and third I just want to wish everybody a very happy safe and warm Thanksgiving Thanks. Thank you represent the Assemblymember on well is lesya Rub I good evening. Everyone, just a quick announcement on a few drives that we're holding. So you know we approached a season of cheer and of you know. Community service, so again Thank You crystal for organizing the toilets you drive. I know you worked with a lot of different offices, but we're also going to have a turkey Drive. So if anybody I think Brian mentioned last time when he was here, if you can donate a frozen turkey a few days before Thanksgiving we're accepting them until the 26th, if you could drop one off or if you know anyone, that's in need of one, please let us know we're also having a toy drive until December 20th. So if you could bring any toys for children in need, we'd be a you know, very appreciative of that and also coat drive, we're having until the January 28th, so any coats that you could spare for anyone that needs. Those would be very helpful. I left some fliers on the tables for a pet adoption that we're having a free legal services event were having so feel, free to check them out and Happy Thanksgiving and stay warm. Thank you. Thank you representing assembly. Member of Noland is Allison, Cummings I do not have any announcements and I'm just sure, but thank everyone for coming out and the Assemblywoman like to wish you all happy, Thanksgiving and safe travels and we'll see you next month. Thank you. Thank you and representing Assemblymember. Miller is Christine Stahl I good evening, so our office is still collecting non- perishable thanksgiving items, so you can just drop that off to our district office. The deadline is this Friday, but we're extending it and also we're still, you know, accepting people for a biography check up in front of our office on Sunday November 24th from 9:00 to 12:00 p.m. just call our office to make an appointment. Thank you happy Thanksgiving, thank you and we're blessed tonight to have our community fans, offices, sanada and parish. Let's step up please[ Applause] good evening, everyone just to draw a quick recap of the past 28 day periods in 28 day period in crime, robbery, we're up by 3 felony assault by 7, burglary down by 7 Grand larceny up by 11 stay the same and grand larceny of the auto Grand Larceny Czar up the phone stamps is still going around I know. We've talked about it many times that all of the meetings around no police agency will call you asking you for money to donate, to anything so know right off the bat that that's a scam. If you do not know the phone number I would not even answer it. I know we do not get them on the phone I get about 20 a day between the job phone and your own phone I'm sure everyone receives the same amount. We recommend, if you do not know the number do not answer. No one's going to ask you to purchase a Google gift card or an Apple iTunes I play card to hand in for money. That is it. Sam do not fall for that. Social Security will only contact you by mail. They will not contact you by phone. That's a popular one, that's going around as well. So if someone claims to be from the Social Security Administration calling you as the new telling you that your social security number has been hacked, it's not true, do not call the number back. We've actually ran into someone on the street that flagged us down, saying that this socialist Erdogan contacted them, and this was the first we heard of it. So we called in the number back and it sounded legit it sounded like it was. It was real, so I could see how everyone would fall for just know that they will only poll you. They will not call the only contact you by mail if you worried, or you want to double check, go down to the office in person. Another thing that affects our grant Lawson is that driving our crime here in the precinct again. Another thing we talked about that could be prevented, lock your car doors and do not leave any valuable property inside your cars, especially with the holidays coming around. If you're going shopping, do not leave those gifts in the car, take them in the house do not leave any electronics in the car a lot of times. These people are just looking for loose change or something like that so they're pulling handles, but if they see something in the car as far as a laptop or an iPad or iPhone or air, but air pods they're going to break the window to get in again. These are all crimes that could be prevented. Lock your doors do not leave your key or your key fob in the ignition I know. It sounds silly that we even have to tell people that, but believe it or not it does happen. Something else is to touch on foot for the holidays. Coming up package, thefts I would recommend one way to battle. This is security cameras I know, there's multiple complements out there. All of them are great a lot of times. If the person sees is a security camera on location at the property, they won't even bother, and if they do, those cameras do help our detectives in tracking down the individuals. Most of them are the same people so a lot of times. The detective will just look at the video and say: oh I, know exactly who that is he's been doing it. If you order in online tell the delivery instructions if you're, not home and no one answers the door do not drop the package, do not leave it there unattended and if you're going to have them leave it there try to leave it when your time you know you're going to be home like the time frame. I know a lot of with the order and you could actually narrow down to when you want to deliver to when you're going to be home. That's about it and my partner has an announcement good evening. Everyone I'm officers tonight so Counterterrorism division and patrol burger Queens North community affairs are hosting a community active shooter training session right over here in the auditorium on Monday November 18th from 7:00 p.m. to 9:30 p.m. hopefully, you guys will join us I'm going to leave some Flyers on the table right. There I pick one up on your way out. Thank you. Okay, thank you for being here[ Applause], introduce the Porsche Diane for Forest Park and Highland Park, anything for us. Okay. Thank you all right, please, good evening. Everybody I just want to say quickly. We are going to be having a Highland Park like stakeholders. Meeting on December 5th at 7 o'clock, 94 Hale Street at the church I will send out some more information to the community board into the Parks Committee, especially to make sure that's good for people's calendars on and that's it St. Happy Thanksgiving, and thanks for having me thank you like to recognize Teresa Weitz, Lee manager, Community Relations, Lij, Forest, Hills. Anything you want to say thank you in our press corps. Without them, I do not know, people would not know we existed, so we have David Russell from the Queens Chronicle Benjamin found from the Queens ledger and Lula Powell New York City news, Queens Eagle. Thank you very much for spending time with us. As I said, we've been live streaming the board for several meetings. We will not be live- streaming in December because we have a very we start early and have a very short calendar and then we're going to have the toy drive and the holiday celebration. So far, we've been averaging and I do not know how you say whether it's people or hits 50 to 100 are out there watching us, and these meetings I think they're watching I do not know how it works personally, but you know okay, so I we have the reminder for the Christmas holiday toy drive that goes to Ridgewood wick, so unwrap the wrap-. What is it Kathy ages, 1 to 6 of rap today? If you can bring it with you at the next meeting and that meeting December is December, 11th 7 o'clock start ok. What else do you have here, as we announced in the past, and it's happening 70 first place between Myrtle, Avenue and Cooper will be changed in the opposite direction. Tomorrow, be converted to a one- way, northbound it's currently southbound and that's due to Richie's favorite Plaza being constructed. Ok, so keep your eyes out for signs. Do not do what I do it? Just go blindly where I used to okay liquor, wine and beer licenses. New liquor license hilt place. Llc for six for Onderdonk ran a New York group, doing business as Joya Hall, 6:3, 108, Woodhaven, Boulevard, 83:38, Woodhaven, rest ai, not doing business as Don Tequila urban Cantina, 83:38, Woodhaven, Boulevard liquor license renewal excusing 5 times champ doing businesses, courtside, lounge, 6:9, 0,8, Myrtle, Avenue and I do realize they have an outdoor area. Okay, Abbey's bar 681, Seneca Avenue would even Boulevard rest doing business as Woodhaven house 6,398 would even Boulevard ai, not being Inc doing visitors, chasers, 6:0, 6, 3:2, 6,5, Flushing, Avenue Wyckoff. We have filled coop doing business as Trans- pecos 9:15 Wyckoff Avenue, new wine indoor beer licenses, El Buen, SAPOr, Restaurant, Corp, 1070, Cypress Avenue. Beyond the scope doing business is Las Tiendas six one zero, two Myrtle Avenue wine indoor beer license renewals, Angel, Fire, buffet Inc, KNK super buffet, three, four one: two: three: four: five st. Nicholas Avenue unit in the rear unit: okay, alterations and corporate changes, Daka Inc doing business as hush; seven zero, one: zero, Grand Ave! You provided an update to the notification. We received from them in 2019 to file for a new application to serve liquor, wine, beer and cider, from changing from a restaurant lounge to a bar lounge, adding disc Jockey and mixed tape. Music recorded music live music and patron dancing sure it sounds like a cabaret license to me. I think we have to question that one Alan domain doing business as 7-eleven 7201 Elliott notified our office to renew their they're going to renew their grocery beer license: Cahill Enterprises Inc doing business as Glen Patrick's pub five three seven, three six five place Maspeth will be filing an application for a corporate change due to the passing of the licensee Kathryn Hickey, her son, Phil, Aqui and daughter, will be the new licensees, Grove productions doing business nowadays. Five, six zero six Cooper Mu intensive, applying for an all- night permit on New Year's Eve from 7:00 p.m. we expect a lot of those this year, Charlie work, LLC, doing business as evil twin brewing. Sixteen twelve sixteen George Street making a minor change through the patron bar inside the brewery tasting room by converting it into a service bar for preparation of food and beverages. That's it's a nice location. If you interested in looking at them, okay, so Gary and Kathy, we have to look at hush because that sounds like a cabaret license all right. What else so I have demolition notices, Glendale, seven 111, seven one Street is a residential garage. None in Maspeth, none in Middle, Village, Ridgewood, 1818, Grove, Street, a one- story, vacant warehouse, 314, Woodward, Avenue, a residential garages, 460 Seneca a view, one story structure. That's that and we have minutes everyone can read the minutes motion to accept the minutes. Walter got the Massey seconded all in favor, any opposed abstentions. Okay, I think that should do it. Alright, Mr. Jordano, first I wish you and your loved ones your families, a very happy Thanksgiving with much to be thankful for all year long, and thank you for the good that you do in the community. I want to read you what my testimony was: it's not to Wendy so on the 7th of November, which was Thursday yeah. The mayor's Office of Contracts had a hearing with regard to the proposed contract for 7816 Cooper Avenue, for it to be a homeless, shelter, residence and on the dais for the mayor's Office of Contracts was one man and one woman I think the woman actually worked for the mayor's office of contract services, but not in any very high capacity. The man who was there I believe actually worked for the Human Resources administration or the Department of Social Services or for the department of homeless services, so he's actually chairing the meeting, not a nonpartisan person from the mayor's Office of contracts, but somebody actually from the agency that is looking to contract with West had to operate. This proposed homeless residents for 200 men, which I thought was quite unusual to say the least, and certainly not part of any kind of a reasonable democratic process. So after the hearing of my first opportunity to do it, I looked at the contract, which did not really tell me much. Although the draft of the contract and I did see in there, they were talking about 88 units instead of 200 and that sort of thing, but nothing in else in there you've talked about what kind of health services they're supposed to provide, but nothing else. That was really very specific as far as how much staffing West had would have, and in what capacity or any of that, while I made the Department of homeless services hoody the first person I see is the man who was chairing the meeting so he's there to get. Somebody to watch me so I do not take photos of the draft contract. It's the only person I saw at homeless services until I saw the lady who was going to mind me when I was looking at the contract, and this is the same guy who was chairing the meeting seemed like a real good guy, but on the opposite side of life, from where our opinion with regard to this matter, so you talk about the phox mind and the chicken coop or the equivalent thereof so anyway. So here's my testimony. This is in the matter of a proposed contract between the Department of homeless services, the city in New, York and West had to develop and operate a standalone transitional residents for homeless, single adults of 7816 Cooper Avenue in Glendale Queens New York. This proposed contract to operate a homeless, shelter. 200 single men is for the period from January 1 2020 to June 30 at 2025, with an option to renew I'm telling them attached. Please find the recommendations. The resolution aboard five Queens and opposition to establishing this homeless, shelter residents and I also attached a letter that I wrote to the mayor accompanying our resolution. I requested this proposed contract not be enacted, and this residents not be established for the part of for the following reasons. The site in question is in walking distance to at least four public schools to parochial schools. There's a gymnastic center and a dance studio for youth locate, directly acrosss the street on Cooper Avenue, an addition which I guess most of you know, there's a youth sports facility right next door to the proposed homeless, residence and a childcare center, that's being built at 7940, Cooper, Avenue. Less than what we would consider a block away, locating a homeless shelter residents at 7816 Cooper Avenue certainly pose a serious risk to children and teenagers in the nearby area. The site in question is in an m14 zone which did not permit residential uses until the hotel, motels and Boat L zoning text. Amendment was enacted late in 2018 the size of the proposed homeless, shelter residents for 200 men is much too large in the community of one and two family homes, the amount of the contract, 61 million eight hundred and eight thousand dollars for five and a half years. According to my math, translates into paying four thousand six hundred and eighty two dollars to house and provide services for each man per month. Four thousand and six hundred and eighty two dollars per person per month seems quite outlandish to me. For the foregoing reasons, and for other reasons stated in the recommendation resolutions attached, it would be irresponsible to establish a homeless shelter residence for two hundred men at the former factory location at seventy eight. Sixteen Cooper, Avenue and Glendale Queens. So I do not know how well they're going to listen. I know that there were one or more lawsuits that are being filed and I hope, they're, very successful, but I think we have to keep at this because for maybe what they consider to be reasonable economic reasons. They want shelters that are much larger than most communities can cope with at a single site and, as I think Demetriou pointed out in the recommendation last month. What we need is places that are twenty five people at most. So, okay, any questions. Thank you! Yes do you? Do you think they make? Okay, yes, Michael! Okay, do you think that maybe the DHS change in number to 88 in order to deceive, is not the thing here to be somewhat more tolerable than 200, not sure, and then the less I say about that. Maybe the better! You know, okay, not sure so again we're in snowplow season for the sanitation department and with the weather. Now you would think it could snow at any time. I think we're 20 degrees under normal at least put your garbage and recycling out the night before your collection day yeah some people could not yeah, but for 212 would be the next day then. So you do not need to do that. So you could be on the midnight shift, though, until you know differently, so they could be picking your garbage or your recycling I think it's usually recycling. You know it accorded a one and hopefully not too noisily so put your stuff out the night before your collection day, just to make sure sewer projects I probably talked about in virtually every month, they're going to finally install the rest of the sewer line in 74th Street between Pleasant View, Street and Juniper, Boulevard, South, I, think the contractor and the Department of Environmental Protection and the Department of design and construction have been working out, cost estimates or what they're willing to pay for the rest of that project, some of which was not in the original contract, and they want to be done by the end of the year. So Mr., Vinnie and I have a meeting with them soon. The contractor and the Department of design and construction I'm not sure, if do any DEP people are going to be there because now what they want to do to expedite the work being completed by the end of the year, probably except for the roadway resurfacing, is that they want to work Saturdays which they are working now, but the agreement we had with them that would it be not invasive work. It would be fairly reasonable work not to cause any kind of disturbance in the community and that's been fine, but now they want to do regular. Sewer were installing pipe excavation, not only on Saturday but I'm hearing Inklings of Sunday. So you know I always figured if you're in a neighborhood, that's more Jewish or Muslim. You want to avoid Saturday and if you're in a neighborhood, that's more Christian. He want to avoid Sunday so, but we do have a meeting with them coming up and soon, not that long after they are done. There's going to be another even larger sewer installed in Juniper Boulevard south, going into 71St Street Lutheran Avenue, going under the railroad a 96 inch in diameter sewer and going right down or up the block of Our Lady of Hope school, that dead- end block and go into the highway, so we are in for sewer projects for quite some time any questions. Okay, thank you. Thanks for all the good, you do Happy Thanksgiving! Thank you, Karen next committee reports. The first committee is education and youth services. Yes, No there you go, you could do it back there, okay, where'd, you go, but you go right here. The joint community meeting was held last Wednesday at the Community Board office. The first item we spoke about was the most recent enrollment numbers and capacity numbers at the public schools within the Community board five area. We noticed a trend in CB 5. There appears to be a decrease in enrollment in the schools in Ridgewood, for example, at is 77. The capacity is 1492 students and they're. Currently at 1012 students, PS 88 has a capacity of 1038 students and they're. Currently at 941 is 93 has a capacity of 1385 students and currently I. Could they have 1099 students on the other side of the community? We noticed there seems to be over capacity they're over their numbers at is PS 119. They have a capacity of nine hundred and fifty- seven students and they currently have 1277 students. Ps 229 has a capacity of 1,000 77 students. Currently they have approximate 1469 students. Ps 128 has a capacity of 546 students. Currently they have approximately 763 students. We have two members from the CEC that are part of our committee, but unfortunately they could not make the meeting. So we were not able to ask them for what were the reasons for this data? You know the decrease in the numbers, but we speculated that Ridgewood has a changing demographics and the rent has gone up. So it's not really that affordable for young families, so schools like PS, 88, PS, 81 and 68 are suffering from student enrollment, so teachers are excess and the funding is not the same as other schools in CB5 Grover Cleveland has a capacity of 2,000 105 students. It's currently operating at 1775 students, we're Maspeth high school, has a capacity of 905 students and currently has almost 1200 students, we're hoping at our next meeting in early next year that the members from CEC are there, as well as someone from the superintendent's office that can speak to the data. Our second item that we looked at were the state test scores in the cv5 area of the local public schools. We did not look at the private schools what we did notice a trend in the lower grades. The students scored there fairly a grade level. For example, 113 was 78% at grade level. 128 was 80% at grade level. He has 87 72% grade level, but then we noticed as they grades they increase in age. The scores decreased, for example, at 113. It dropped at 8th grade to 65%. 128 went from 80% to 70% and where's. The one 119 went from 82% in the third grade to 75% in the eighth grade, where schools like PS 68, were at 52% grade level and they decreased to 30% grade level. We did acknowledge. There are a number of Bulls. We did not have those variables made available to us, so we can't really speak to why the scores seemed to show decrease, but it is a pattern throughout the district, not just in the lower socioeconomic neighborhood. It's also in the middle- class neighborhoods, so we're hoping that someone from the superintendent's office can speak more clearly to the data. The second item that we talked about sorry, the third item- we talked about what the gifted and talented programs we know we have them in the district, one at 119, which is rather popular, but we do not have the numbers on how many students are actually in the gifted and talented, as well as what other programs are made available to kids in CB5 who do not get into the gifted and talented. We know the middle schools have honors programs where they're offered advanced courses, but we do not have these statistics on it. The last item that we talked about with the after- school program is within the district, and the two major providers in CB 5 are greater rich with Youth Council and the mass Baton Hall. Most of the schools offer an after- school program. They're quite popular with students, take homework, help music stem leadership program, you name it it's there. Most of them are free, but we did notice. There are some for fee based programs and they are in the local, the lower socioeconomic neighborhood, and we do not know why some programs are a fee based, while others are free well hope, being early next year. When we have our next meeting, we have the answers to those questions, because in the most needed neighborhoods they should really be made free and not fee based, but we do not really have updated information on that. Hopefully, next meeting we will. The last item was mentioned was an article. We received one of our board. Members Carmen had sent an article regarding the homeless students in the New York City public school system. The article mentioned that one in ten students were considered homeless, but it was made aware to us that homeless, for the do we, you means students in homeless, shelters, as well as living with extended care, family members and in district 24. 6.8 percent of our students are considered homeless, but that does not mean that six point eight percent are actually in homeless, shelters. They could be living with aunts, uncles or grandparents, and that that's it hopefully in early January, we'll have our next meeting and we'll have the answers to the questions we had at our meeting. Thank you. We had a presentation at the parole board from the school Construction. Authority Joel was it last month in a month before we had that presentation from SCA and they were supposed to send us to each of the boards. That presentation could you make sure we get it for our committee and yes, District 24 is no longer the most overcrowded district 25 is, which is basically over Elmhurst, come further over Elmer's and the it would appear to me that the problem with the drop- in scores is because of the large immigrant population from all over the world. We now have people from 205 countries living in Queens. You had something Bob yeah, it just got a question: did you get any input on the doing away with the gifted and talented program and I know? Parents want it, but there was some debate in the news and the radio about doing away with that. No, we did not have any information regarding it I fit me I forgot to answer the question regarding St. Pancras, that is the district 24 UPK mosaic program that is fully functioning at St., Pancras, that's what's their existing there. Currently, the diocese is currently in negotiations with the Department of Education, renovating and modifying the whole school building, which means removal of all symbols of religion, but that SCA presentation when they went over the figures and the schools, they have no idea of anything being located there, so they must be reducing population in other schools such as 91 to bring them in there, probably in the spring. Well, PS 191 right now is under capacity, but I do not know. Sca has no idea why there they would consider utilizing St. Pancras, yes, like everyone here, I think the numbers are alarming and disturbing about the grades. Could it be also the correct Liam? That's been instituted and plus, as you can see, when Bob mentioned about Maspeth high school, is there the lower grades where we do not want to leave them back? We want to do social promotion and, if they're not ready, keep moving them forward and it's just deteriorating as they go up from the lower grades to middle school to the high school level that it's causing this type of issue, where they're just being promoted. If they do not go to summer school, a lot of variables that ai, not that but I mean I, could realize that they just want to keep moving them, but the decline in a grade would that the you know, qualifications in a grade that wanting to drop 30? Was it down to 30%? That has nothing to do with social movement. It has to do with either they were not prepared to learn in our language or the teaching staff is not the proper staff for that particular school. My one granddaughter teaches in the charter school in Bushwick. She actually has students walking from Glendale and Ridgewood into Bushwick to go to that school because the teaching staff there is dedicated they learn and the parents want their kids in that school, so we're going to have to look into it real seriously. Thank you. Next committee is Park Service's. You have anything to show us or no okay, so on October 16th that we had a Park Service community meeting recommendation use of capital budget funding for the Ridgewood reservoir in Highland Park, the Park Service Committee met on Monday September 16th at 6:00 p.m. at the Ridgewood reservoir at Highland Park. This media included a tool around the Ridgid reservoir and along the Interior causeway between basin one and two. The tool was led by Matt Millan and founder of director New York City H2O. One of the main issues raised at this meeting related to the original reservoir was the fact that the New York City, Parks, Department and Recreation intends to spend 5.3 million dollars to stabilize the East and Gate House at the Ridgewood reservoir. This project is reportedly in final stage of design. The 5.3 million is part of the remaining funding of nine million for improvement at the Ridge Road reservoir made available after the reservoir was classified as a low has a dam from a high hazard dam and a nine million of funding to breach the walls of the Ridgid reservoir no longer had to be used to breach the basin walls. 3.2 million of the main funding is earmarked for the removal of invasive species in Basin one and three or the resident reservoir. At the September 16th meeting, several committee members questioned the use of such a large amount of funding, 5.3 million just to stabilize the gatehouse building and said that the funding would much better be used for improvement to the Ridgid reservoir property. That would benefit those who visit the reservoir, including hundreds of schoolchildren and others who have taken tours of this beautiful site. Many of the tools supported by New York City H2O, a nonprofit organization that has spearheaded the Ridgid reservoir being listed in the New York State historical registry class, one wetland, a designation and also a critical environmental area. It was agreed by committee members that the community we tried to meet again soon at the Seabee office to further discuss whether recommendations should be made to the New York City Parks, Department and Recreation, stating at the 5.3 million earmarked by the Parks Department for stabilization of the East Gate house at the Ridgid reservoir should be used for other purposes. The committee met again on Wednesday October 7 at the CV office. The committee discussed that to our knowledge and that of New York City H2O representative in attendance, the Eastern Gate House Building Gate House 27, has a 1,000 square foot footprint committee members unanimously voted in favor of a recommendation to request that Department of Parks and Recreation put the design stabilization of Gate House 27 on hold and work with the community, CB 5 and C B for the community and elected officials to consider using the 5.3 million earmarked for the building stabilization for the following recommendation. This is a common commonly a common brick building that is deteriorating and is likely not salvageable. The slate and the steel in this building is rotten. The building seems to have little historical value. Is an eyesore and a safety hazard? It might be more prudent and cost- effective to demolish the building, which has no use than spend more than 5 million just to stabilize the building. This is likely contaminated. There is likely contamination in this building because of lead pain and absorption. What we would also like to do is we would like them to hold the designs that they spent money on somewhere around I. Do not know a couple, a couple hundred thousand dollars of the design to stabilize the building and use this money to do the causeway between 1& 2, which would show the community that right away, we got something out of the money rather than stabilize a building for 5.3 million and we're not going to do nothing for it in another 10 years. We would also like to see the money that would be left over because New York, City H2O is basically cleared the basin 1& 2. So if it costs 3 million dollars a year ago, it cost a million dollars now because everything is cleared and also if money is left over or reallocated to actually pads or boardwalks, or access to 1& 3:4 tours in everybody to go down and see the basins at this point in time. I think that it is much better to show the community. How is spending on money, so we can get use out of the causeway rather than have a building 5.3 million that we're not even going to do anything to for another 10 years, because if it's 5.3 to stabilize it, what is it going to be to actually put a floor in it? Build it has no heat. It has no code, it does not have anything. So we would like to recommend that you vote for this and we would like to reallocate the money to between 1& 2 and the idea of the entrances there basin or either reducing the Phragmites in Basin 2, because right now the Parks Department is not doing anything to remove those Phragmites and they are just keep on growing in and in and in New York City H2O has taken up, removing them cutting down and removing them and they're in the process of doing it. But it is a very time- consuming process of cutting them and then I'm done any questions, because I did not translate enough. You understand it. Do not you Mr. Joe, Paul, it's not okay! I would be in favor of the second part of your recommendation, and that is using the funds to remove the remaining Phragmites. That makes the most sense, and that then restores the reservoir concept to the place, and that will then prevent the Phragmites from coming back again, because you will have removed them to a level where, if they can't regrow again, because it's too deep the way you've removed Phragmites, is you caught them below the waters? Right and you know water line stops and they do not come back right and that make sense to do that for the whole thing and be done with it. None of that money should be used any kind of planking or building anything in the natural resource area. So it really should because they're going to have to get a permit for that anyway, if they even dared to try to get it from Dec. So I would suggest that we use the money totally for the elimination of Phragmites and be done with it once and for all. This was not done. It's just going to come back and creep back again and you're going to be back at square one within a couple of years. You would not be in favor of finishing the causeway-. No, if I'm not mistaken at a workshop in Glendale on couple years ago, they actually talked about the different cost points within the reservoir and I believe the removal of Phragmites was somewhere in the realm of tens of thousands, thirteen million yeah I'm, sorry millions, tens of millions it was. It was way more than 5 million Paul in actually the folks from NYC H2O kind of pushed back on that and said that they would rather look at how to do it at a more cost effective way and where they're doing things in Prospect Park in Brooklyn and there's some tests going on there that they'd like to look at, and they did not want to see the expenditure of money in that regard. I would honestly say that I think that would be the least favorable buy for any of this I would be more in favor of the causeway okay. Well, we would like to see the designs put on hold okay and use the 5.3 first for the causeway, a second to look at entrances into the pathway if it can be entrances into the one and three basins if it can be done without disturbing the nature and if there's a balance of money to be allocated to help remove the Phragmites in Basin. Two, because just remember now, everything that happened in 16:17 and 18 would all of those prices. Everything is different. Okay, H2O has been in there doing a lot of work. A lot of volunteer work, I also went into Basin 2 and help them cut Phragmites. There are four entrances already in to cut in to Basin two so that when you go in and you start on the inside and cut it backwards, you have easy removal, so they are removed already. So that is what we were looking for. You understand everybody understand: okay, Mr. Roarke, hurry, Tony, Benanti, Bob, Chameli, Walter, Clayton or Pat Crowley Jerry, drink Steven feed line, rich sugar, Porco's, no Mary Ann, Lattanzi Oh, ed Lu, Tao, John, Mayer, Patricia, Martinez, Edgar, mantou, Kathy, Massey, Eileen, Maloney, Peggy, okhane, Michael, okhane, Don, Pat, Santino, Mike, Porcelli, Ken, ray burger, Tehran's Kelvin, Rodriguez, Luis, Rodriguez, Connie, Santos, Dennis, Stefan, Megan, Tati, Mr., Thapa, barbixas, Cano Michael mean bond region, Christel, wolf, Marianas, email, take it. Everybody thank you and, if you're interested there's a lot of literature on the side that I brought down and you can check out. Thank you next committee transportation services. John. You want to do that please, but from here the Transportation Services Committee met in board five office on Tuesday October 22nd. We discussed first transport transit services issues right now, we're looking at the work that does not seem to be getting done on the M train structure, the repainting, which was started this summer and was supposed to be through to the end of Fresh Pond Station. By the end of the summer. It still is somewhere mythically in between. Well, it's between this, the forest and Fresh Pond, there's patches of paint all over the place. There's nothing consistently being done. They were supposed to be by now working down into Brooklyn. That seems a far way off. We need to get an update from them. On the other hand, the l- train renovations that were supposed to go through next summer are looking right now at a April 2020. Maybe even earlier, they've recently opened the entranceway on First Avenue, actually yeah at Avenue A, the easternmost portion of that station. It now has accessibility to Avenue a so they are working on bits and pieces and opening up stuff as it becomes available. We also discussed the Fresh Pond Road dedicated bus lanes. There seems to be some issues with people, not recognizing the hours of operation, just an FYI. For folks the cameras are going to be going live next week right now, they're in a warning phase, people will, as of sometime next week, start getting actual camera enforcement tickets. We have asked for some more enforcement on certain blocks. People are seeing a little bit better flow of the northern portion of the street, but and once you get down past Woodbine palmetto area, there seems to be parking after the hours go into effect and people start moving into the lane by 6:30. So hopefully that can get addressed. We've asked for some enforcement I believe from the board office to the 104. Moving on, we talked about Capitol updates. The Kasich Usko bridge still has some ongoing work, much of it down on the ground on the queenside that will be wrapping up, hopefully by the early spring, okay, Grand Street Bridge project, which has been long overdue. We still might see some closures at certain times for emergency repairs. The Division of bridges looks like they've hired a designer to kind of move that forward, hopefully we'll be seeing something. Sooner than later, we are still seeking info from DoD about the status of the bridge right out here on Metro. That is underneath the roadway that allows the CSX to connect with the New York and Atlantic. That seems to have fallen off the radar. We were hearing about updates and then there's just been no forward motion and/or word for most of our traffic and pedestrian safety requests. Yet again, it was a litany of speed reduction, speed, reduction, speed reduction traffic stops traffic's, like signaling, stop signs to reduce traffic flow people asking for one- way, conversions because of the speeding in front of their House speed, Bump, Request, speed, bump requests and, if you'd like to get in a speed bump request have it in to the office before next Tuesday. When we have our next meeting the 19th of November at 7:30 in the board office like Wyckoff Avenue, reconstruction is still in design. It seems like no one other than Committee Board five wants that bike off. Have you reconstructed and did any other committees that I failed to recognize? Okay, any old business? Yes, Mr., Drake, okay, I was not aware that crystal Wolf would comment on the behavior of the people to speak at the public forum. I've been here 12 years and I noticed that it happens a lot the people have come here. Actually, what I wanted to talk about was the behavior of one of our members. I noticed the members not here you did not call her name on the road, so I do not know why. Whether I should postpone this until next meeting, but I watched the video of the last meeting we had October 16th I believe it was, and I was I was I, had a concern about the Carmen Santana speaking to our chairman and such a disrespectful way, and you can look at the video yourselves make your own choices, but certainly for the. If the public is expected, you know when we go out, go out in public, where it's expected there's some kind of societal norms that are expected of us and as a member of this board, we sign up for this and we are served on his board, even though we're volunteers at the pleasure of the borough president and so I wanted to speak about that under the old business. Take questions about that. If you want to put it off till the December meeting, but I watch the and I would ask you all. Do due diligence. Look at the video and I heard, even though the video did not show it, but the audio showed the Chairman security asking Carmen Santana- your time is up reminding us several times and then at the end she walked away from the microphone and Mr.. Curie's keep quiet, be quiet, he said sorry and she said I won't be quiet. You can go straight to hell, not even speaking to someone else. That's correct. I do not know, but that's it's a whole. The whole purpose of being on this board, especially to be civil to each other I, was watching a little bit of the impeachment hearings. Certainly the congressmen were civil to each other. You know, even though they've been saying of all kinds of things about the other party, but that was a concern of mine, so I've brought up under. So if you want to look at it again, the audio and video have been reconciled. So you'll hear the same thing on the video that you hear on the audio correct, I also wanted so one thing, I'm quite willing crystal suggested. My name I'm certainly willing to go along I, do not know if I can police the people come here or act as a sergeant arms. We have to look at the bylaws okay of the blood and we can't just make up things so I'll have to review it well, but I'm willing to do whatever you tell me to do. Thank you. Thank you anything else. Any new business, yes pick up the microphone with the renewal of the liquor license with the abbeys bar I would recommend that the board take a look at that place at 10:00 p.m. on Friday and 10:00 p.m. on Saturdays. They have the dancehall girls come there. The police mobile unit has been stationed by Seneca Revenue and also to kill the time on gates Avenue in Seneca. They have the Cantina and dancehall girls. There I just wanted you to take a look at that at 10:00 p.m. thank you 6:00, 81, Senate, okay, Kathy! Is that way we had problem. They had they just I think the police were there so they're looking into it. Yes, canteen John, help remind me. The place on gates was a problem before, and it had a different name is that was that no I think it was I. Just remember the horrible songs comics on Sarita font, okay. So the there was a two places that were on the gates, Avenue side of that corner. Abbie's is actually on Seneca around the corner. At one time it was a place called Vox, Vo, X and I. Believe it another time it was a place called Cascada. It's now called I believe time tequila or something of that nature or tequila time. Here you go all right, we'll look at the nose anything else, any other new business motion to adjourn Kathy Walter. All the favor have a good, Thanksgiving and watch out for the deer running acrosss the roads. If you traveling my thought of got one going back to Maryland, you.",
            "summary": "Welcome to the regularly scheduled meeting of community board five Queens, just a reminder and no one else will be permitted to sign it to speak under the public.\nA couple I added starts tonight, so we have Denise Esposito speaking to us on certain training from the New York City office of emergency management.\nEvery night is a different topic and we're trying to do it here in Queens, five community, board, five and also in the Bronx, but we're looking to get some signups tonight just to find out more information about the program.\nThe data can be used to inform funding for services like fire, stations, schools, clinics and representation that affect your community.\nIt's, also used by nonprofits to inform services by businesses to create jobs and even by students for school projects, understanding how the population changes helps us shape communities acrosss the country for the better.\nI will thank all the participants at the next month's meeting after I have a complete total of items collected community Ward 5 is kindly extending drop- offs to their office until this Friday November, 15th I.\nWaste is also an issue in New York City, because our garbage is carried out on diesel trucks and these trucks drive about seven point, eight million miles each year, which impacts air pollution in our city.\nFor the past, two years, I and a growing group of people have been advocating for our borough to be participating along with Manhattan and Brooklyn in a citywide effort, that's called a swab, their solid waste advisory, Boards, they're required in the Administrative Code and Queens used to have one and it fell out of favor at a certain point, when people retired and moved away.\nWe know that Melinda Katz is going to be leaving, and so we need everyone's support to ensure that the next borough president is on board with a swab as soon as possible.\nSome of you may know that last year, I worked with Ted runs from the Myrtle Avenue bid and Bob Monahan from the Greater Ridgewood Youth Council.\nWho'd like to see some money going to a local nonprofit to work on this issue of activating storefronts activating public spaces in collaboration with artists and community people to step up, raise your hand, talk to Bob Holden, make it known that that's an issue you care about And, again, I'm happy to talk with anyone about it, because it's something I still care about my life to be involved in Thanks.\nWe had 15 so for January, we're looking for interns and They can get hours which they flip for credits, but we're also taking high school kids, who need community service hours.\nSo, when you call they'll, know a lot about you already that they'll know that you're hard of hearing or you're deaf, or that you had some domestic violence issues or whatever And they'll, be able to not ask you a million questions which delays response, emergency response, so we're on that as the City Council, but certainly my committee.\nIf you heard, but It's, some whistleblowers came to me during the summer former teachers of Nance, with high school, telling us in my office that we have a number of individuals that they were actually teaches.\nThey should be ready for college and or ready for life, or both we're not seeing that most of the students that are graduating That's not fair to the taxpayers in order to the students or the parents, a couple of things which I-- and this was a pet peeve of mine as a civic member, and certainly a community board member or these cars that play this loud music in many neighborhoods and ours, included in the will of ours that we've seen them all over.\nIt's a good hit, and it looks like it's getting a lot of support in the City Council There's many other girls that I have going on animal rights and so forth, but and on the homeless, shelter, I challenge the DHHS proposed homeless, shelters, 7816, Cooper Was it November, 7th And Gary did a great job.\nThank that we had very good turnouts, not only at the public cv5 hearing, but also at my town, Hall meeting at 119, PS 119 and certainly with the demonstration So I want to thank the community for coming out in force and telling the mayor that we're serious about this and Smaller shelters are fine.\nIt is called Do Department of Information Technology, so they're in the process of converting us at the Community board, and anyone who is a faction ATO of weapons, try to renew your license or get a new one online, because you're not allowed to do it by paper.\nMost people nowadays are working on their smartphones and do not have all the technology that is required for that If you're interested in volunteering contact our office, we have some really amazing budget delegates and a lot of really interesting, ideas.\nThe first one we're having another Java with Joe on Saturday November 23rd from 10:00 a.m. to 11:30 at the Avenue diner at 90,106, should make Avenue in Woodhaven It's a good time for people who are normally working 9:00 to 5:00 to come.\nI know a lot of with the order and you could actually narrow down to when you want to deliver to when you're going to be home.\nMeeting on December 5th at 7 o'clock, 94, Hale Street at the church I will send out some more information to the community board into the Parks Committee, especially to make sure that's good.\nI want to read you what my testimony was: So on the 7th of November, which was Thursday The, mayor's Office of Contracts, had a hearing with regard to the proposed contract for 7816 Cooper Avenue, for it to be a homeless, shelter, residence and on the dais for the mayor's Office of Contracts was one man and one woman I think the woman actually worked for the mayor's office of contract.\nThe man who was there I, believe actually worked for the Human Resources administration or the Department of Social Services or for the department of homeless services, so he's actually chairing the meeting, not a nonpartisan person from the mayor's Office of contracts, but somebody actually from the agency that is looking to contract with West had to operate.\nThe first person I see is the man who was chairing the meeting It's, the only person I saw at homeless services until I saw the lady who was going to mind me when I was looking at the contract, and this is the same guy who was chairing the meeting Seemed like a real good guy, but on the opposite side of life, from where our opinion with regard to this matter.\nThis, is in the matter of a proposed contract between the Department of homeless services, the city in New, York and West had to develop and operate a standalone transitional residents for homeless, single adults of 7816 Cooper Avenue in Glendale Queens New York.\nAmendment was enacted late in 2018 the size of the proposed homeless, shelter residents for 200 men is much too large in the community of one and two family homes, the amount of the contract, 61 million eight hundred and eight thousand dollars for five and a half years.\nI probably talked about in virtually every month, they're going to finally install the rest of the sewer line in 74th Street between Pleasant View, Street and Juniper, Boulevard, South, I,, think the contractor and the Department of Environmental Protection and the Department of design and construction have been working, out, cost estimates or what they're willing to pay for the rest of that project, some of which was not in the original contract, and they want to be done by the end of the year.\nThe first item we spoke about was the most recent enrollment numbers and capacity numbers at the public schools within the Community board.\nIt's, currently operating at 1775 students, we're Maspeth high school, has a capacity of 905 students and currently has almost 1200 students , we're hoping at our next meeting in early next year that the members from CEC are there, as well as someone from the superintendent's office that can speak to the data.\nMembers Carmen had sent an article regarding the homeless students in the New York City public school system.\nOne of the main issues raised at this meeting related to the original reservoir The fact that the New York City, Parks, Department and Recreation intends to spend 5.3 million dollars to stabilize the East and Gate House at the Ridgewood reservoir.\nIt was agreed by committee members that the community we tried to meet again soon at the Seabee office to further discuss whether recommendations should be made to the New York City Parks, Department and Recreation, stating at the 5.3 million earmarked by the Parks Department for stabilization of the East Gate house at the Ridgid reservoir should be used for other purposes.\nThe committee discussed that to our knowledge and that of New York City H2O representative in attendance, the Eastern Gate House Building Gate House 27, has a 1,000 square foot footprint committee members unanimously voted in favor of a recommendation to request that Department of Parks and Recreation put the design stabilization of Gate House 27 on hold and work with the community, CB 5 and C B for the community and elected officials to consider using the 5.3 million earmarked for the building stabilization for the following recommendation.\nDo, not know a couple, a couple hundred thousand dollars of the design to stabilize the building and use this money to do the causeway between 1& 2, which would show the community that right away.\nWe would also like to see the money that would be left over because New York, City H2O is basically cleared the basin 1& 2.\nYou want to do that please, but from here the Transportation Services Committee met in board five office on Tuesday October 22nd.\nWe, discussed first transport transit services issues right now, we're looking at the work that does not seem to be getting done on the M train structure, the repainting, which was started this summer and was supposed to be through to the end of Fresh Pond Station.\nWe have our next meeting the 19th of November at 7:30 in the board office like Wyckoff Avenue."
        }
    }
}