{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB11",
            "channelId": "https://www.youtube.com/channel/UCO1XW1mhD9aDb7OwR3djY6g",
            "title": "Full Board Continued 9/2020",
            "publishDate": "2020-09-28",
            "shortDescription": "",
            "lengthSeconds": "0:21:05"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB11",
            "normalizedName": "Bronx Community Board 11",
            "twitterName": null,
            "youtubeChannelName": "Bronx Community Board 11",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "LImxtFu_4oM",
            "fillerWordCount": {
                "uh": 26,
                "um": 11
            },
            "readTimeFullTranscript": "8 min read",
            "readTimeSummary": "1 min read",
            "wordCountFullTranscript": {
                "equity": 10,
                "training": 9,
                "business": 7,
                "bylaws": 6,
                "gender": 6,
                "chairman": 5,
                "description": 5,
                "vote": 4,
                "motion": 4,
                "diversity": 4
            },
            "wordCountSummary": {
                "inequities": 3,
                "gender": 2,
                "overt": 2,
                "racism": 2,
                "boards": 1,
                "demographics": 1,
                "sexism": 1,
                "bylaws": 1,
                "website": 1,
                "comment": 1
            },
            "fullTranscript": "All right, I started to record yes start to record since my recording went down and maybe lost outside of facebook. Okay, let me try to unlock. How do you unlock now so the same way you restricted access, restore access? Okay, there you go okay, it's unlocked well before we really get into it. Let me email about press and let me email, Miss Delgado, I emailed her already. You did okay, thank you and I do not know if we want to give it a little time for them to get back in no, oh dude. No, yes, yeah some public minutes. Let's go! I got ta go and trick. Like I work in the morning, you know come on, y' all honey. I've been in the meeting since 5 P.M, so Miss Delgado's back in Mr Press. I do not know about and harriet. If you did not get the time that we went into the executive session, Jay's Lisa soto said it was 1003. I believe I know three and then for everybody, so yeah, okay, so we're back. We have to make the vote public. I'm calling for a motion to assign an online diversity course with the name of the EEO diversity awareness course to Community board 11 member reference, a complaint that was filed against them. Do I have a second, I second the discussion in an executive session, and we really can't discuss it any further at this point. Unless someone disagrees with me, anyone all in favor aye. This is Keith Ramsey, I'm against this one. Okay, we got Keith ramsey against him, I'm against it also and I'm against it. Who else I missed, I heard Andrea. Who else was against it? Yeah go for it Jeremy Chris. Can you mute? Everybody? Yes hold up hold on. Okay, everybody's muted go for it. I do not know who's still in the meeting, so remember alphabetical no order. My last name is how I'm doing this Al Jay Uti Amato, Amato John, for it Bab Bay coat. I do not know if he's able to wait a minute joe, are you for against the training all right? He says he's for the training. Okay, I heard him. Thank you. Blitzer Boahen Camp is Doral Suen Campbell Castro, I'm here I'm for the training, Casper Jeremy, you got me. Yes, I got you jerome. Would you say brock out of here again: okay, Pat charles training, yes or no? I did not. I did not hear it for the training. Yes, okay, four D'angelo, abstract, paula, query! Sorry, I'm for it d'angelo! Sorry! No! I'm staying Rabbi, Ken gailneck against Cowlick, Abstain love. It abstain, the silvio on all Sylvia Al he's on but Al. Can you see if what he's voting? Actually you dropped off? Well Yay. Do you want to explain to people what it is if they abstain, how their vote is counted? I think Jeremy can explain that better than I can. I mean so you're for training for the board member or you're. Not so yes or for is for training against your abstain against you're against it. I'm saying you do not have an opinion: okay, Natalie Medina, I'm for it Joseph Benta Abstain Hazelmura, but I do not know what the alternative would be if he does not get the training. I do not think we discussed that so, but we can worry about one step at a time: yeah straddle Swan against Jeremy, Okay Silvio's against okay, ramsay you're against it. You said right, yeah, I'm against this is Ellie still on Ellie Rodriguez. No! Yes, I see him he's wrong. Can he talk? Can you mute himself? Can you unmute him Chris I'll, try hold on he's in Munich, Ellie, four? Okay, thank you! Daisy all right and it'll be very disappointing. If something is not done, are you voting? For you said she says she's going for he said she's very disappointed, so I'm voting for it and if something does not get done, I would be very disappointed all right all right. So, let's we said get over man. Let's get keep commentary aside. Please just yes, no or abstain join every reason: rubino Joanne, stilling, Rubino, Selkridge stalker. I got you 80s seagull against the training. Tara Lunch. Did she here contrado she in she's, not she's, not in Germany all right, fine, Joe Thompson. I saw his name yeah, I'm against it: okay, Sandra, hunger, again against okay Walcott. What just happened Walcott. I think she said she was bored. Is she still here all right? Can everybody still hear me? Yes, frano is not here, that's it. So let me do the tally. This is kind of close. I think. Did you get Rabbi Fuchs? I do not see him. I did not hear from him. I just I just called his name and moved on he's there. Okay is he voting, though? Did he vote? Do you Chris? You want to mute him? Oh gosh. I am muted him on three. What if I sign four times it does not answer. So it's split. Even it's 13 13. wow, that's amazing! It matches in America. Today, that's a good one! Jeremy. Can you like show the tally that you kept because maybe there's a mistake, I do not know I can not, but I can read off everything because remember I'm using my phone now, because my Wi- fi went down so even though my Wi- fi sucks, I will probably try to upgrade it for the future and just be happy that I had a backup plan which is disappearing and Chris came through for us, so somebody's typing. I can't can everybody hear me? Yes, can you read the telly to the record again? Jeremy? Yes, so Albert D'angelo abstained. Deborah Kyleck abstained. David Levitt abstained, Joseph Menta abstained, Barack of Castro abstained. Ken Galnick was, I mean Veronica was against that's. So that's what five goes against Gail next wrestler against Galmick Mazzella, Purdum, Ramsey, Rubino, Siegel, Thompson hunger. So those were the against now the people that were for the motion: Amado Baycote, Bohen, Charles, Prairie, Medina, Miura, Obide, Rodriguez, Selkridge, shkreli and soto. Let's anybody that wanted to write that down. So what happened? What happens now or should fail on Hey Jeremy, Joe, Thompson, I've known Dominic for 40 years, he's never changed, he will never change and the only thing the classes will do is make us look better. Whatever you say Joe, I do not get that Joe, but okay, that's about it. I still do not get it all right. So, let's move on to new business man, I'm personally disappointed that we find it laughable that our board members can represent themselves. This way talking it's 11 o'clock. Let's just call the meeting and end. You are excusing a situation that it is responsible for us to, but we could be here excuse today, till tomorrow. Okay, I'm tired, Christian, it's it was based on 11 o'clock, just because you do not agree with that, or maybe I do not agree with. That does not mean that you or anyone else in this board determines the outcome. That's right! Absolutely incredible! Ladies and gentlemen, this is democracy. You voted a point of order. We are on to new business because this was the last of the old business, so anybody have any new business Jeremy. I have new business, yes Christian. The chairman mentioned the equity committee. Earlier, as of today, I have adhered to article nine of our bylaws, which states that any board member may propose an amendment to the bylaws. I've followed the article and provided the chairman a written submission, I'm under the impression that the chairman must now present it to the Community board. I'm to understand that no vote shall be taken at this meeting. This proposed amendment must now move to the bylaws Committee for Review. I believe that, after review, this can become an amendment upon its approval by a majority of the board's appointed members. The chairman mentioned, the committee would be moved for discussion in the Executive board. I believe that we must present the committee description in this meeting tonight and I'm prepared to share that description if you believe that's correct pal ahead. Go ahead, Christian. Thank you. Mr chairman, I'm going to share the description, and then we can move on from there. So a description of this committee is as follows. The equity committee is committed to addressing racial and gender- based disparities and improving equitable outcomes in the community. The responsibility of the equity committee will focus on identifying discrimination or harassment, raising awareness of implicit bias and eliminating or mitigating racial and gender inequity and its effects acrosss. Our district. The equity committee will make recommendations to the board on aspects related to racial and gender equity and the equity policy within all education programs of the board, a commitment to racial and gender Equi equity, social and environmental justice, diversity and inclusion, the ability to work collaboratively with people of diverse perspectives and experiences connections with local, historically marginalized communities and the ability to represent the geographic and demographic diversity of the region. The equity committee will be responsible for maintaining a reconciliation commission that is responsible for delivering a yearly assessment of the following budget parity. Ensuring that budget requests our board puts forward are balanced, seeking to establish even distribution of funds, equality and equity of our board, ensuring that the current board and future boards accurately represent the racial, gender and other demographics of our community by ensuring that overt or embedded racism, sexism and other inequities are not included in our bylaws website. Budget requests and unified or individual comments, posts and or statements to the public, bylaw and website review. Ensuring that codified racism and gender inequities are not inadvertently included in our bylaws our website and news social media. Another comment review ensuring that overt or embedded racism and gender inequities are not included in our comments, posts or statements to the public. I will share the description with Jeremy who can send it to the entire board. I appreciate the time and I look forward to discussing this in the next meeting. Okay I'll get that from I'm just curious was this from another community board, so CB8 has established a racial committee. I spoke to several board members and we felt as though a racial committee did not cover enough of the inequities that we may face in our community, and so we've decided to move with a more general overarching name, the equity committee, and this entire statement was written by me with nothing borrowed from anyone, okay, so new business. Maybe somebody can make a motion to before we move on. As chair of the Bylaws committee, I want to comment on what Christian just said. His statement putting forward the Bylaw amendment is proper and appropriate, and I want to clarify what the word review means when it comes before the bylaws committee. The Bylaws Committee will not be reviewing the violent change on for substance. We will be reviewing it for any conflicts with any other existing bylaw provisions and whether or not we make other recommendations for language. My point is that I expected to pass through the committee and come to the full board next month for a vote. Are there any questions about that? No, we just have to set up a date for the meeting and we will and that meeting will take place before the next full board meeting, so that the full board will be able to vote on this next month. Yes, that's all I wanted to say. Unless there are questions. Thank you. David you're welcome new business. Everyone want to make a motion to Adjourn request our journey meeting. That's even better! Yes, I second it. Oh, I stirred it 1104. The meeting ends right good night guys. Thank you good night. Everybody.",
            "summary": "Ensuring that the current board and future boards accurately represent the racial, gender and other demographics of our community by ensuring that overt or embedded racism, sexism and other inequities are not included in our bylaws website.\nAnother comment review ensuring that overt or embedded racism and gender inequities are not included in our comments, posts or statements to the public.\nThis from another community board, so CB8 has established a racial committee.\nI spoke to several board members and we felt as though a racial committee did not cover enough of the inequities that we may face in our community, and so we've decided to move with a more general overarching, name, the equity committee, and this entire statement was written by me with nothing borrowed from anyone, okay.\nMy point is that I expected to pass through the committee and come to the full board next month for a vote."
        }
    }
}