{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB6",
            "channelId": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "title": "Manhattan Community Board Six - Transportation & Public Safety Committee Meeting",
            "publishDate": "2020-12-08",
            "shortDescription": "",
            "lengthSeconds": "2:26:35"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB6",
            "normalizedName": "Manhattan Community Board 6",
            "twitterName": "Manhattan Community Board Six",
            "youtubeChannelName": "Manhattan Community Board Six",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "twitterHandle": "@cbsix",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "lk4mmwDOvWc",
            "fillerWordCount": {
                "uh": 254,
                "um": 402
            },
            "readTimeFullTranscript": "82 min read",
            "readTimeSummary": "13 min read",
            "wordCountFullTranscript": {
                "street": 83,
                "bike": 74,
                "station": 49,
                "project": 37,
                "parking": 32,
                "pedestrian": 31,
                "construction": 30,
                "lane": 30,
                "bus": 29,
                "space": 26
            },
            "wordCountSummary": {
                "street": 25,
                "bike": 21,
                "pedestrian": 11,
                "project": 10,
                "space": 9,
                "cyclists": 8,
                "construction": 8,
                "detour": 8,
                "stations": 6,
                "station": 6
            },
            "fullTranscript": "So are we set? Yes, we are now set, so you can start whenever you'd like okay, I'm assuming from the number of faces, and so we have a quorum so I'll get going. Okay! Welcome to the December 7th meeting of the CB6 transportation and Public Safety Committee. My name is Gene Santoro, I'm the chair of the committee. This meeting is called to order at 704 pm tonight we are joined by community, associate Brendan birth members of the public. You can raise any questions or comments that you have through the Q&A feature of zoom. If there's time following the committee's discussion, we will field questions from the public. Yusef Khaled is volunteered to take minutes tonight. Thank you, Yusuf and now it's time for that ever popular favorite attendance. Taking so Brandon. Take it away. Committee members I will call your name and you will unmute yourselves when your name is called. Please say present I will announce if there is Quorum Gene Santoro here, Matt Roberts hasn't made it yet. I'm gonna film Napolitano, yes, present, John Barrenbaum, President, B, Desmond, Present, Charles Fernandez present Andrew Gross Andrew is going to be late. Youth of Palette, Present, Sandy, Mckee, Cousin, Larry, Shire, Present and Soldman okay, I do see Ann on the screen, so I will count her as present. Are you guys not hearing I? Are you not here? I keep getting messages that my internet that my bandwidth is low in my right, I'm having an unstable connection, so I do see your name out that if I'm not here, that's why yeah I do see your name on screen, though so I did count you as present Brian, Van, Newen, Oven, present, Ronnie White, okay, I do not see Ronnie Bob, Cohen and James Wilson. Okay, we have quorum. Okay, the attendance for tonight's meeting was distributed ahead of time by the board's office and it's currently appearing on the screen before you. If there is no objection, we will adopt the agenda, as stated members of the committee. If you object to adopting the agenda, you may raise your hand through Zoom Charles, Fernandez presence. Okay, I'm taking that as no objection. So, let's assume the agenda for tonight's meeting is adopted. The minutes from the October 5th meeting were also distributed ahead of time by the board office. If there's no objection, we will adopt the minutes as drafted members of the committee. If you object to adopting the minutes, you may raise your hand through zoom, okay, seeing no objections. The minutes from the October 5th meeting are adopted. They will soon be available on the CB6 website. So, let's move along to the meetings ground rules as mandated in order to conduct an efficient meeting. Let's observe a few ground rules. No one may speak until granted the floor committee members. If you have a question about committee business or wish to make a motion, please raise your hand through zoom. If you click the participants icon, the participants panel should appear and you should find the raise hand function there. If you still have technical difficulty, you may click the chat, icon and relay your difficulty and Brenda will pick up on it. The chat function should not be used for committee business or questions about agenda topics. All such remarks should be made on the record. By raising your hand, through zoom chat should only be used to alert us to any technical difficulties you are having or to state in writing information like an email address that was already stated aloud on the record during the meeting when a committee member is given the floor to speak, I will identify you and you can unmute yourself so that you can speak and last but not least, we are required by executive order to create a verbatim transcript of this meeting. So please keep your questions and comments, succinct and germane to the discussion. Okay. So the first item on the agenda is in fact a presentation from the New York City D.O.T on CitiBike expansion in Cd6. So off we go Jennifer you're doing that. Thank you. Okay, hi excellent hi everyone good evening, I'm Jennifer Santenez, Dot's Manhattan deputy borough. Commissioner. First I wanted to thank Chair Santoro and Brendan and Community Board 6 for having us on tonight's agenda. D.O.T has a couple of items to present to committee tonight, so we have a handful of folks on and if I may, I'd like to introduce my colleagues, Brian Parrott, Caitlyn, toner and Janae Malloy are on from Dot's bike share program as well as Kimberly Rancourt and Colleen Chattergoon from the Manhattan borough commissioner's office, who many of you already have the pleasure of working with Nag Laku, Eileen, Body and Sean Macias are also on to present and speak to the following agenda items, but I will now turn it back to bike share, and so last year D.O.T embarked on our five-year phase. Three CitiBike expansion alongside our partner, lift and we're working to double the size of the bike, share system area and triple the number of available bikes. Since this program launched in 2013, New, Yorkers and visitors have turned time and again to CitiBike as a healthy, safe, fast and affordable transportation alternative and, as the city continues to reopen in a Covid-19 world. We believe that bike share will play a critical role in getting people around the city and back to work phase. 3 expansion in Manhattan started this past spring when we expanded into new neighborhoods uptown and, in addition to expanding into these new neighborhoods cot is also adding new stations and more dock capacity into the existing service area, including here in CB6, to help support the demands of a larger system, we'll be presenting our infill plans tonight, and so with that. I wanted to thank the board again for giving us the opportunity to present, and at this point, I'd like to hand it off to Janae from the bikeshare team to walk us through tonight's slides all right. Thank you, Jennifer I will go ahead and share my screen. Let me know if that looks good yeah. We can see it. Thank you all right. Thank you. So, as Jennifer mentioned, my name is Janae Maloy and I'm joined today by my colleague, Brian Barrett, and we're going to be presenting on CitiBike infill for Manhattan CB6. So I'm going to walk through the entire presentation and then we'll have time at the end for it. So then that'll get started so first we're going to start with an overview of the system. So what is CitiBike it's a network of shared bicycles. It serves as an additional transportation option for the city, it's available to users, 24 7, and it allows people to have all the benefits of having a bike in the city without having to worry about storage or maintenance issues. It's a part of a public private partnership, which means that's a public-private partnership between DOT and Lyft. So that means that D.O.T is responsible for all of the planning and outreach as part of the system and Lyft handles the day-to-day operations equipment. So, on this slide, what you see is the city by a map of the CitiBike service area that was rolled out in phases, so we launched in 2013 went phase one, which included lower Manhattan and a small portion of Brooklyn that was with 330 stations and 6,000 bikes, and that is in the light blue on the map there and next in phase two. We went further into Manhattan as well as further into Brooklyn and then added in a portion of western Queens that was between 2015 and 2017 and then phase three. The phase that we're in now, which is the dark blue on the map we went through the rest of Manhattan further into Brooklyn further into Queens and then added in a portion of Bronx, and the goal here is to add 16,000 bikes to the system over 35 square miles. So when we take a look at the ridership numbers, we have over 107 million trips to date, and that includes that's about five and a half trips per day per bite and in that there's over 170,000 annual members. So, of course, with the impact of it. 19 additional measures were taken to ensure rider and employee safety by lift that includes cleaning high contact areas on bikes when returned to the depot disinfecting bikes when docked at high use stations near hospitals, and we also provided a free membership for essential workers through the critical workforce membership program, which has been quite cool so in this next portion, we're going to discuss the expansion and infill strategies of phase 3 and the difference between the two. So with expansion. The goal is to bring bike share to new parts of the city and that's the portion that you'll see in the dark blue on the map here. So that's, adding 32,000, dots and 16 thousand bicycles, and so with infill. The infill work adds new capacity to the existing service area. So the gray portion that you see on the map, that's adding sixteen thousand dots and eight thousand bicycles in the system, and so the reason why we have infill as part of phase three is that it helps us keep up with the shifts and demand of bikes as we expand to new areas. So it'll help the larger system to function. It supports the increase in demand from phase 3 expansion, as well as help helping to meet existing unmet demand when riders can't find a bike or a dock, and as well as improving rebalancing and overall system operations, and so the info doc distribution will be based on rider demand for more capacity. So right now our infill focus area is in the light blue on the map here and it's based on areas of highest demand where they will receive the most stocks in those areas, and this is going to happen on a rolling basis. These installations will cover multiple community boards at a time and it'll, be an iterative planning process to address changes in demand, as the system expands. So we have several options for increasing station capacity. That's adding new stations, expanding existing stations and then also using creative design solutions like 3D bridging. So what 3D bridging is it's a tool that we will use to add docs to stations at locations where there might be an even surface or a lot of obstacles that we need to work around like utilities or tree pits. This will help us to be a bit more flexible in that area, and so, when we take a look at the planning process, we have we do start with outreach. We do that through an online feedback portal to get community feedback. This is a portal where members of the community can request where they would like to see a station in their neighborhood, as well as adding additional feedback or comments during station siting. We use ridership data and technical criteria to identify feasible locations and then, of course, community notification. So before a station is installed, we make sure to notify property owners, of course, the community board and any other key stakeholders. Then we move into installation phase and then there's also ongoing monitoring that occurs once a station is on the ground. So in this next part, we'll get into the new stations propose for Community board six. So here we have a list of six news stations proposed for the area, and these are highlighted in the dark blue dots on the map there. This includes a station at East, 27th, Street and Park Avenue, 2nd Avenue and East 29th Street, East 34th and first East 44th and Lennox 54th, Street and First Ave, and then 14th, East, 14th, Street and Avenue B. Take a closer look at these. The next couple of slides, so at East, 27th Street in Park Ave. This station is proposed for the southern portion of the road bed at 2nd, Avenue and East 29th street. This will be on the east side of the road bed at this intersection at East, 44th, Street and Lexington Avenue. It is proposed for the south side of the road bed there and East 34th Street and first Avenue. It will be on the south sidewalk at that intersection. Next we have East 54th street and First Ave, which is proposed for the south side of the road bed and then, lastly, we have East 14th, Street and Avenue B with which is proposed for the north sidewalk at that intersection, okay, so that was all we have for you guys today. Thank you so much for your time and now I think we can open it up for questions. Let me know if I need to go back to any particular slide. Okay, Janae did I say that right, yes, Janae! Thank you. So, let's see, if anyone on the committee has any questions, first I see that Larry has raised his hand. Actually, several committee members have raised their hands, but Larry's the first one that I saw okay. Well then, let's start with Larry Good evening Janae, yes, hello, I would like to first address attention to the southernmost bicycle share station at East, 14th, Street and Avenue B. You may or may not be aware that this was one of the original locations and not a new station. It was temporarily moved away to 11th and b during the construction of the L train project. That's been completed in this area and the surface was restored about a month or so ago. I've been in contact with Colleen and she had some very odd comments about needing to survey. The area when all that was needed was to simply bring the station back, because there is no difference in the topography from when the station was originally approved and installed back I guess in 2013. Colleen. So I've been in touch with my colleague Brian about that station and I did mention that we would have to survey the site to look at putting the station back. Brian can chime in if he wants, because I do recall, you had inquired about this yep hi. This is Brian. I'm operations manager with DOT bike share. Larry, yes, you're correct, not much has changed in the area, but it has been a few years since the station's been installed. So we do like to make sure that we're up to date on the most current ground conditions and actually I think if I'm correct there was at some point briefly a select bus service station on that island. So we just want to make sure those elements were captured and the station can go back. You are correct. That is the reason why the station was removed temporarily relocate the bus stop station, because the construction of the connect and MTA substation was where the bus stop was and now has returned to. So that's been back at its original spot for quite some time, and while the ground here is not universally paved concrete, part of it is cobblestone pavers. That is the exact condition that the original bike share station I believe with 39 bikes had when it operated until July of 2017. So my question: is there any reason under the sun why we could not get this station back within the next week? We're looking to see if we can add additional capacity at this location? Hence the survey and the final item to remind you of that. This was a valet station because as you're suggesting, maybe the need for additional capacity having the valets here was really appreciated by the community. I just want to let you know: okay, thank you. Larry. Let's move on, I'm not sure what order you people raised your hands in, so I'm just gonna go down the line here. If you don't mind and Seligman, please, okay, so my kind of broad question is about this: citing criteria. I know that one of our real frustrations- you know, prior to the initial installation- and this is coming from a place of love. I am a charter. You know annual member, but one of our frustrations on the board was that we, it was hard for us to suggest locations, because there was inadequate transparency about the citing criteria and so I think it would be really helpful if you could make those criteria pretty widely available, for you know both to the board and to the general public. So that's kind of the overall thing. The specific issue is that I spent way more time than I wanted to today on phone calls and emails about a specific issue where there is a restaurant, whose this curbside space that they would be using, that most restaurants would use for out outdoor dining is blocked by a CitiBike station, and I'm wondering how you are incorporating that conflict and what a particular restaurant can do to say. Like hey, can you move this station? You know across the street or down the block, or you know some like somewhere, where we can find a solution that suits both parties. So that's those are basically my two questions, my big and my little sure hi Ann good evening. It's Jennifer I will start to answer. I. Guess your second question related to the overlap of bike share and open restaurants. So when the open restaurants program first started, you know like the initial program when it was set to be a temporary recovery program. You know, DOT was not planning to move any transportation infrastructure which included bus, stops and CitiBike stations at that time. You know, as many folks are aware, the mayor has announced that the open restaurants program is now going to become permanent and is now year-round and so we're further developing what you know, a permanent open restaurant program will look like and how to kind of deal with all of these kind of conflicts, and you know need for curbside space over the next few months in terms of these new stations that Janae ran through in CB6, none of them conflict with existing open restaurant setup. So that was something that was taken into consideration during the planning. So will that be I? Guess that's all to say that the development of a permanent open restaurant program and how any potential you know existing conflicts with CitiBike stations and other transportation infrastructure? That's still, you know to be determined and we're look, we're going to kind of rely on and look for feedback from community boards and stakeholders as we further develop. The open restaurants program guidelines as a permanent program. Is there something that a restaurant can do now that if they would want to have you know if a bike station is blocking their location, you know blocking where they would be able to have an open restaurant. So that's one question and the second question, which was actually my first question, is about the transparency of the right criteria so that we can provide useful input. Sure so Brian can talk a little bit more about the sighting criteria and guidelines. But to answer your question about existing CitiBike stations in front of restaurants, no, you know we will not be moving or adjusting a bike share station in order for a restaurant to set up outdoor dining- and you know- let's say there is a road bed station if they are able to qualify for a sidewalk site. We also encourage restaurants to look at that opportunity as well or vice versa. Okay, thank you. Yusef. You have your hand up. Yeah I just actually had a question. If you go back to the slide wait, are we gonna hear about the criteria and how they will be shared? I thought Jennifer said those were up there on the site under guidelines. Did I misunderstand that so Brian can speak a little bit more about what those guidelines are, and then we can lay those out for the committee. You know when we respond to any other questions as well sure just real quick, the I mean the basic guidelines we're all fairly familiar with the sites have to be accessible 24 hours a day. There are certain engineering criteria that DOT evaluates on a case-by-case basis. Regarding your ability to provide comment and feedback on locations, we do have our feedback portal on the DOT bike share website. I can send that through the borough commissioner's office and have them circulate that against the board, and we can look into I'm blanking right now if we post the basic criteria on the DOT bike share website. If not, we can certainly look into posting our general guidelines on there to ease and providing feedback. Yeah I'd suggest that, especially in a light Evans question in light of some of the feedback we've gotten from residents in the community, that would be an excellent idea so that people do understand what it is that you folks are looking for and what to expect. Okay. Thank you. Okay, Yusuf, sorry, yeah I was just gonna. Ask about the numbers presented very early on back around phase one two and three, and just to confirm you can go back to the slides hello. I was in the sorry. I was muted, the first few slides yeah. You can go back to that. One wait yep! So in phase two are the 12,000 bikes additive, or is that cumulative and same with the stations yeah adding in 12,000 bikes? That's the cumulative count. That's cumulative, not additive! So through phase one and two is cumulative and then phase three will be attitude. Phase three is sixty got it. So, by the end of phase three, we should have twenty eight thousand bikes. Okay, that I was just I, saw the plus sign, but I wanted to confirm that was it. Thank you. Okay. Kyle has a question. Hi, thank you chair, just say two quick questions. I kind of build on what Ann was just speaking about what is the actual definition of ridership demand is that just based on where public writers ask for a doc to be situated, or is it based on customer use patterns or traffic patterns or anything else? And the second thing is with the some of the pictures that you showed for expanding the bike docks a lot of them seem to appear to impede on pedestrian space. So I was wondering how that figures into calculation as well with what essentially is privatization of pedestrian space. So, to answer your first question around demand, what we're measuring is kind of like an internal metric of just your ability to get a bike at peak hours and that's usually, what we're using to inform our size of stations also we're heavily relying on customer feedback. So if people are logging on to our feedback portal and commenting that they feel like additional bikes or capacity is warranted an area we'll take a look at that and weigh that. Similarly, against our writability metrics that we're determining station size with and sorry could you repeat your second question regarding privatization? It's about a pedestrian space, so some of the expansions that I've personally experienced and then just even in the picture that was included in this presentation, showed it you know, impeding onto the sidewalk itself rather than you know, being elongated on the street itself or expanded. How is that being taken into consideration? A big issue that we face in our district is, you know a lot of things impeding on pedestrian space. So how is that being taken into consideration? There are some bike docks already that are located in areas that you know already difficult for people who are old or have families to walk on, as is because of you know, restaurants, businesses, whatever the case might be. So how is that playing into any site selection? Sure I mean we're balancing, as many as there are multiple needs for some streets and sidewalks in New York we're trying to balance those as best we can. You know parking is certainly like a concern for a number of individuals. We do our best trying to minimize parking, and sometimes placing stations on sidewalks is a way to help do that. We definitely do want feedback to hear if folks would rather see things in the road bed, but obviously we try to play stations on sidewalks where we feel like they can be placed and you know not impede pedestrian flow. Okay, thank you. Phil. You have your hand up. Yes, I do. When will we know the size of the bike docks at the six or seven locations that are that will be installed in Cv6, we're finalizing those right now, as we survey these stations, I can say that the average size is going to be about 44 to 45 docks for each of these stations. Do. Does your website have dimensions? For you know a set number of bikes, for example, 20 bikes will encompass. You know 100 feet by 6 feet or you know 600 square feet something so that we can approximate how much area it will take up yeah, so a standard plate. So a four part station dock component- four bikes- is about ten feet, so each individual docking point is about two and a half feet wide or so. And lastly, just to follow up on and settlement segments comment. I, don't know if you're necessarily the channel to receive any pushback from a restaurant. But are you aware of many restaurants that have said they couldn't continue their business as they would prefer because they didn't have access to the streets because of the city vibration? This might be best addressed in Boston, but I'm interested, if you guys had heard any of that feedback. Sure we've heard from some restaurants that were unable to set up outdoor dining on the road bed or the sidewalk or participate in open restaurants, because there is some type of transportation infrastructure that exists immediately in front. You know like or in line rather with the restaurant's frontage, so that could be a hydrant that could be a bus, stop that could be a no standing or no stopping anytime, rather a parking regulation as well as a CitiBike station. So you know, we've heard some like questions and complaints from folks as one would guess, but not too many. Okay. Thank you again. Let me emphasize that, obviously, from the stream of questions, you're getting and I know, we've had more about this issue. It would really be very helpful to everybody, including folks, I, know you're juggling a lot of stuff if you could make those transparent criteria available widely and maybe trial extra harder to do some outreach to these places that are having feeling squeezed or pinched by this stuff, the type of businesses that are feeling pinched the stakeholders are feeling pinched. Please try to do better or more robust outreach to them in advance because we're getting pushback about this and it's I know you've got a lot of competing demands for a very small space. I know it's really rough to resolve, but we all have to try to live here together. So we really appreciate it if you get that done. Thank you. Okay, Sandy. You have your hand up. I just wanted to let everyone know that the criteria is on the DOB website and it's there's a pdf. It shows the diagram, it's actually pretty clear. So if you do want to know the criteria you can visit the website great, that's what I thought. Thank you, okay, Larry, do you still have your hand up, or did you just forget to take it down? Oh I have a compliment and an inquiry. Okay, the compliment is well accepted. Was the inquiry of Germaine to this? Yes, okay. The compliment specifically relates to the infill station at First, Avenue and 54th street, which serves a transit desert in the Sutton area community and with the new bridge going up and the Outboard Roadway Greenway extension being built at the end of the bike path there. This is an excellent location, I believe in my opinion. Now the inquiry relates to the area at 14th, street and Second, Avenue and 23rd street and third Avenue, which I also think are kind of like deserts at 14th and second there's a CitiBike station that ought to be there that serves the SBS station. There is a station at First, Avenue and 15th street. That is very well connected and there's also a subway station, but there should be a complimentary or station at Second Avenue that serves as a connection to southbound bus riders and then at 23rd Street and Third Avenue. It's just simply very hard to find a nearby station within a reasonable geographic radius. So I was wondering in your analysis, of where to put the new stations. Can you address these two locations or you know, as Janae mentioned earlier, infill is going to be an iterative process, we're going to be taking multiple cracks at this over the next. You know three or four years I'd be happy to kind of take a deeper dive into those locations and see what what's available. Thank you. We've raised these and brought them to your attention. Previously. Okay, I think that pretty much covers it. I, don't see anybody else's hands up on the committee Brandon. Is there any pressing questions from the public I know there is Helene Weiner Grad I apologize. If I'm not pronouncing that correctly saying, can you provide regular bike lock-ups near CitiBike spots, but that doesn't seem that sorry, that's actually off topic. It's an interesting question, but it's not what we're doing right here. Okay! Well, then, let's, since we have a very full agenda with some naughty items on it, let's move along to item number two. Thank you for the presentation and the question answers and please everybody avail yourself of the rules, criteria and whatnot that are up on the DOT website, especially and with the issue you have about the restaurants and other folks as well. Thank you not my issue, just passing it along yeah. Okay, thank you. I see that Brian has raised his hand. Do we need to write a supportive reso for this or no, we don't need to write a reso at all. Thank you, Brian, perfect, okay. So, let's get to item number two, which is Avenue C and I. Don't who's doing the presentation about this, I'm Kimberly from the Manhattan borough commissioner's office just to introduce it. This is a presentation for a proposal to add, protect or to upgrade existing bike lanes on Avenue C to protected bike lanes, and we have from our bike unit. Eileen Boddy is here and also Shawn Macias, but I believe Eileen will be doing a presentation, and this is something that we presented the majority of the project. The larger area of the project is within CB3. We presented that last month, so this is just really about the section from 14th street to 18th street okay. Thank you. Let's rock and roll! Thank you. So my name is Eileen body. I'm a project manager with the bicycle unit. Tonight's presentation, as Kim mentioned, is going to cover Avenue C between East 14th street, to East 18th street, we're going to share some of the background in terms of route selection. Why we chose this route to upgrade, how it will work with the closure of the East River park, some of the design details in terms of connection connecting up to the north, how it looks on the street and then we'll take questions at the end. So today's presentation again is that north South section in the dark blue arrow- that's larger in the upper right on Avenue C, between 18th street to 14th street and, as you can see in the other areas on the map, the larger network that can mentioned does continue down to East Houston Street on Avenue C, and also with that project, we're implementing or we're promoting protected lanes along East Houston from 2nd Avenue all the way to the waterfront. So this meets a number of goals. First, it helps to fill in gaps in the protected bike lane network in the East village. So if you look on the map, the next closest protected bike lanes that run north south are all the way over on first and second avenue, which is quite a distance from the waterfront they're, also heavily used at this time. The second benefit and goal is that this does establish a direct connection to the bike network. So Avenue C has the advantage of continuing all the way up to east 20th street, whereas some of the other streets don't make it all the way through skytown or they don't connect up past the waterfront and finally, with the East River park closure coming up, we have heard a number of requests from elected officials and community members during the public engagement process of the East side, coastal resiliency project really wanting to hear about what options cyclists could use during that closure for a north-south route in 2019, the city released a green wave plan for cycling, which shows, on a conceptual level a citywide protected bike lane network. So in this map you can see on the lower section there. It does include a north-south connection within the East village. So, overall, this plan is in response to the vast growth that we've seen in cycling in the city and we're here to make good on that commitment to include that protected lane upgrade here in the East Village. So the Avenue C Project route is located on a high crash corridor with a total of 13 people who were killed or severely injured during a five-year period. So the chart does break down those numbers based on street user, and what you can see from those numbers is that people who are walking biking and traveling in cars are being injured along this route, so redesigning the corridor would improve safety for everyone. We've seen that when streets are redesigned to include a protected bike lane and improve safety for everyone. Next to look at the East Houston Street crash numbers, because that's connected to this project, this is actually a vision, zero priority corridor, which means that the rate of crashes is even higher and so again looking at those numbers. There are a lot of people experiencing injuries on this route and this is another opportunity to really enhance and improve safety along these two corridors. Over the years, we've been looking at the data after installing protected bike lanes throughout the city, and what we've noticed is that, across the board, when we consider people driving people biking and people walking pedestrians, there's a 15 drop in crashes with injuries. So that's a really significant decrease in crashes with injuries just from these street redesigns, and when we look at the crash numbers for pedestrians, those actually decrease even more so protected bike lanes and street redesigns are a really important opportunity to really make the street safer for everyone, and so the department of design and construction, as you know, is managing the East side. Coastal resiliency project also known as ESCR, and this will close the East River Esplanade, which is a major cycling route on the east side. It will be closed for a few years and the timeline is projected as 2025 completion. However, it's worth noting that some of the delays due to Covid-19 around the city could impact this timeline and to speak to again that cycling rate, that's on the East River Esplanade, also known as the Manhattan waterfront greenway or the East River park. It's a really popular cycling, destination and commuting route on the weekend. There are more than 000 people daily writing each day and then on the weekdays. There are more than 1,600 cyclists riding on a weekday. So while the East River park will be closed, it is important to provide a reliable, dedicated space on the street that serves as an alternative, and so again our project meets the need of both building out that citywide protected bike lane network, but also assisting during this time. That requires a reroute. The area does have a number of bus routes. I'd just like to note that the M9 bus route does overlap with this project. We are not proposing any changes to those bus stops, so they will continue to be in operation at their current locations and the bike lane design does accommodate the existing buses, so they'll still be able to pull to the curb and I'll share a little bit more detail about that in a few slides, I'm still getting into the existing conditions and the proposal details currently Avenue C between East 14th street to East 18th street is unique in that it consists of both a service road and a main line. So with the service road on the West side, which is on the left side of that graphic, there's parking on both sides and a single travel lane, then there's a concrete median which is discontinuous at some points, there's some gaps in it and then on the main line. There's a traveling in each direction, parking on both sides and standard bicycle veins running in each direction and in this area we've noticed that the bike lanes can be obstructed by double parked vehicles. This is also, as I've said, that popular route connecting all the way up to 20th that will help serve as that reroute during ESCR, so any opportunity to make this a more comfortable cycling experience is what we're looking at. So the proposal proposes a protected bike lane in each direction, on both the East curb and the West curb right on that side of the median in the southbound direction. Cyclists along the West curb would be protected by a channelized buffer and vertical elements, and then in the northbound direction, cyclists would be separated from the moving travel lane by a floating parking lane. It's also called a parking protected bike lane, and so what the design does is it maintains parking on the east side and repurposes. The West, curb also to note, is that this design, where it is where it's feasible to install a floating pedestrian island those locations will allow for shortened crossing distances for pedestrians crossing Avenue C. Some of the benefits of this design, in addition to those short and pedestrian crossings, are reduced. Conflicts with vehicles, improved sight lines between moving vehicles and cyclists and, of course, making it a more comfortable route for people of varied ages and abilities and I do want to mention that in this locations, where the service road, where that median has breaks, we would be treating that with our typical driveway markings so that the cyclists can see where the vehicles are coming and so that the drivers can see that there's a bike lane there and again, there are currently bike lanes located here. This is simply upgrading them and moving them to the curb and improving conditions for all the road users. Finally, the design does require repurposing that parking on the West curb, which is approximately 15 parking spaces since there's already a lot of bus stops where there's no parking and then on the east side actually had more there's more parking along the east side, based on all of the different driveways and such so we've chosen to keep the parking along the East curb as a floating parking lane. Due to some of the intersection designs. There would be a total of eight spaces along the corridor. That would be repurposed to some of those pedestrian islands and channelized transition spaces. Finally, I do want to note that the service road we are not proposing any changes there, so the parking would remain on both sides where there is upwards of 50 spaces along that segment. There are a number of bus stops along this route. There are four m9 stops, there's also a temporary m9, stop north of 14th street, and so at these locations the bus stop would actually the bike lane design at the bus stops would look quite similar to what it looks like now, where the buses pull to the curb and cyclists have a wide lane to either travel around the bus or to wait behind the bus and then proceed, and so you can see in that graphic the cross section view and the aerial view that the bus can still pull to the curb. So there's really no change for bus riders in this configuration, and then cyclists also have a very similar condition to what's out there now on this particular project. The photo on the lower right is an example of what this looks like on. Another project this has been installed widely throughout the city along some of our one-way protected bike. Lane projects I wanted to mention that you know at 18th street the roadway changes significantly between 18th to 20th street, and that is with the traffic coming on and off of the FDR. So at this location, cyclists ride along the greenway off Street and that's going to be closed during the East River park, closure and all of the construction work, so we're currently working with DDC on a potential temporary connection that would be protected for that segment during the construction. We do not have the details finalized to share tonight, but we just wanted to note that this is something that we're working on. We hope to have more details soon, there's a lot of overlap with different construction phases and staging areas that need to be taken into consideration. So we hope to have an update on that soon, but that is how they would continue to 20th and just to summarize again, this project along Avenue C. Here in CB6, it really meets the goals of providing a protected connection that runs north south. That people can use while the East River Park, is closed, and it also helps us meet our goal of building out that city-wide by protected bike lane network, as called for in the green wave plan. These types of bike lane facilities are more comfortable for people of all ages and abilities, especially newer riders and we've certainly seen a lot of new riders. You know using cycling as a way to get around during the pandemic. So at this time we'd like to take some questions. Okay, thank you. Eileen I know. The committee has questions. I'd like to start with one of my own. At the meeting we had last week, Kimberly, you were asked specifically about the intersection at 18th and c, and the plans you had for the garbage garages and the trucks entering in and out of Stuyvesant town that are located there. Did you guys come up with this particular slide for that, because I didn't see it. If there was one there. Well, we didn't add a slide. We did discuss it internally and we are looking at what the potential the best potential design would be, and so we wanted to actually have a follow-up conversation I think with skytown about what makes the most sense for that location. So we haven't forgotten it, but we didn't have anything specifically new to share here. We did want to have more conversations about what the best choice would be. Okay, fair enough, let me see who's got their hands up, let's start with sandy. If you could just go back to between 20th and I guess it's is it 18th and I know. There's been a lot of discussion of trying to use the space under the FDR. Is that not a possibility in that zone? So that's, actually that's the area that we're reviewing with DDC is using something that's off street, hopefully underneath the elevated structure. That's what we're reviewing now, but again, it's not final, which is why you know we don't have a more detailed design view of that tonight in my apologies, I didn't catch that, but definitely that's our preferred option and it seems like a great place to point with the bike lane. So that would be great. Thank you. Yes, let me just second that, as Kimberly knows, we've been asking for this option for about two years and we'd really like it to be seriously considered, even though the I understand Ddc's contractor has already begun. Staging I see it on the northern end of this project, but nevertheless it's in order to avoid complications for bikers and pedestrians, and one of the issues raised was the fact that bikers and pedestrians were trying to navigate the detour during the construction are going to be using the Avenue Sea sidewalk very heavily, rather than going to first and second Avenue. So we really appreciate you guys going back and rethinking the stuff and renegotiating the possibility of doing this under the FDR drive, if at all conceivable. So, thank you we're on the same page, we'd like to say terrific Andrew, you have your hand up. Welcome back hi. Thank you. Oh hold on. You can see me now exciting, I, just very quickly. I know that I sound like a broken record when I say this and I'll be positive about it tonight. I really appreciate D.O.T and I know that I'm never gonna get my way at this point. The parking always just gets completely obliterated in every single project ever these days, but I do appreciate you not getting rid of all the parking in this case. I do appreciate you keeping some of the parking in that lane again. I know this. Is this very anti-parking atmosphere around, but I do really want to be the one voice here that actually says. Thank you for not getting rid of all of it, so otherwise it's very lovely. So, thank you well said Andrew. Thank you. Larry, you have your hand up. I do and I really appreciate, as others have said, the proposal to put the projection of the bike path from 18th to 20th street under the FDR drive, and I've also mentioned previous meetings and I'll mention it here, because it's relevant that the discussion should also include the possibility of continuing that up to 23rd 25th street, to reconnect with the Greenway north of here. Secondly, going back to the picture of Avenue C between 18th and 14th street and where you have proposed on the West side, creating a parking per no, not a parking protector, but a buffered bike. Lane I think that is very wise because it eliminates a problem both for cyclists and for motorists, which is limited visibility around those slip lanes which are very dangerous, and you might want to also consider on the service road, perhaps taking away one parking space at the beginning of the slip lane to further improve the visibility by daylighting this a potential hazard zone. That's it okay! Thank you! Ann, you have your hand up. I do and I am channeling Bob Cohen, so Andrew you're not going to be the only one talking about parking I just wanted to confirm this shows 23 parking spaces lost. Is that, like total for this entire project? That's all that would be lost because, like that's, that seems to me a very worthwhile trade-off. That's the number of this segment so between 14th street and 18th street south of 14th street there's additional parking loss, but, as was mentioned, even in that section, even more so I think we were able to do some tweaks to reduce the number of parking spaces lost. It's still very substantial, but we are working to maintain as much as we can, because we understand the importance of curb access for businesses, as well as just general parking and I. Think in that section, there's more parking available generally, so the loss of space is there is maybe less important, so yeah I think this seems good thanks. Thank you, Anne! I'm not sure that was a totally successful impersonation of Bob Cohen, but nevertheless, I appreciate having your voice. Okay, Phil your hands up, yeah, really quick. Where you have bicyclists and a bus crossing one over the other, does the bicyclists have to yield to the bus, or does the bus wait for a break in bicyclists? Sure that's a great question, so typically sorry, but what typically happens here is that you know both street users tend to slow down. The bus is slowing down as it's pulling to the curb and if a cyclist is in front of the bus, you know they continue on they're not really affected. If they're behind the bus, then they're generally yielding to the bus, maybe they can wait behind it, but many of them ride around it, because the lane is actually wide enough to ride around, and so then you know. Typically, what also happens is that as the bus is pulling away from the curb, which is the current case now of what the current conditions are like on Avenue C, you know, they'll look for cyclists and they'll pull out slowly, and so this is where you know in a location where we already have people riding, because it's an existing facility, they're aware to be looking out for them as well. Thank you, okay. It seems as if the we're done with the committee's questions. So, let's move on to the public again, please keep your aunt your questions or responses, succinct and on point and you'll have two minutes to make your point. So, let's start with our esteemed guest, Adam Hartke, chair of the land use committee here at CB6, okay, let me unmute Adam, okay, hi all can hear me. Yes, excellent thanks! Thank you very much saying hi from the land use millennium side of things very hopeful for your work underneath from 18th to 20th street as gene and everyone else has said, and I'm just going to echo again. You know this is a very big priority for this board and for all of the users of the current esplanade in the future and the future users as well. I'm really glad that you point out that there's high increased use of the esplanade. This is what we've been observing. You know all year, and so anything that can accommodate their uses is going to be incredibly useful for us and I'd like to echo Larry's point as well. If, when you're, considering this, please consider expansion past 20th street to connect up to waterside again, this is a whole complete network. You know, there's been a lot of stuff, that's not been great on the waterfront this year, sinkholes etc, but yet users are still flocking and they're still finding a way. So please consider creating a complete system, and with that you know, thank you very much. Looking forward to updates okay, thank you. Jason Gurz, your hands up, okay, let me unmute him as well. Hi there Jason Gurz. Do you hear me? Yes, we can great I am chair of transportation, alternatives, Manhattan, volunteer committee, so just calling to say thank you to DOT for coming with this proposal. This is a strong response to our you know: Bike Avenue B campaign, which has got over nearly a thousand signatures. Looking for a north-south alternative to the East side, Greenway, which we all know is going to be closed down. So thanks for coming with this and we're very supportive I have two questions. One I was wondering if D.O.T could elaborate on the 18th street intersection, which is quite complicated at the moment, and you know what might be done with this project to kind of simplify that where there's something like five different points getting on and off the FDR there and then another question that wasn't addressed at Cv3. But hopefully you can answer. Will 13th Street be marked for cyclists to cross from Avenue C over to the crosstown bike lane that begins at Avenue B, there's a pedestrian area there by Tanya towers, that's about a half a block, long and kind of wondering if the gap in the network is going to be closed there with markings for cyclists thanks so the 18th street. Thanks for your comments and questions at 18th street I, don't have a visual here as Kim mentioned before, but what I can say is that we did make some improvements two years ago, when the 20th street project was installed to add the new ramps to come on and off of the greenway. So there are currently the markings that are there in that intersection are what we will continue to ask. Cyclists to follow crossing out of the greenway crossing into the greenway, so you know there's this there's the Avenue Sea line and then there's also that loop road, then there's the on and off ramps for the FDR. So on the west side, as Kim mentioned before too, that there's that section near 18th, we still have to work out a few of those details, but we can accommodate those access points that are on the service road. You know continuing north at on the northbound section, there's a bus stop and that will remain there. So some of this is actually going to look quite similar to the existing condition, but there will be a transition in and out of the protected lanes, but we'll make sure to take a closer look and hopefully we'll have a visual to share back to clarify some of those other questions we'll be somewhat dependent on. You know. We want to make sure that we can get that through along FDR finalists, as we went through the final design, knowing exactly how that's going to work out we'll play a part. Okay, thank you. I'm sorry did somebody have more. Okay and then just on 13th street I asked okay. Well, that's actually out of our district, but okay, if you have a real quick answer for that, so this section on 13th street between, like the end of the cul-de-sac to Avenue C. Currently, that is a pedestrian area. It's not marked as a bike lane. We don't have a current plan to change that. We can look into it further to see what the options are, but essentially the reason it couldn't be marked yet. Is that it's a pedestrian area without the proper ramps? Yet, okay, thank you. Now, I see a couple. Other people have their hand up I suspect they also want to talk about Cd3 and not CB6. If the two people who currently have their hand up are speaking to something that's in CB6, which is north of 14th street, then I'll call on you. If not I'd, ask you to take your hands down. Okay, Tommy Loeb I do live in CB3 and I did attend. The last CB3 committee meeting and I do think. It would be important for CB6 to look at the resolution that CB3 passed in the interest of transparency, because there are a lot of issues in terms of continuity from the East side, Greenway below Montgomery Street, that are that CB3 had serious concerns about. So it should not be considered a contiguous pathway until those issues are resolved, including the fact that there are multiple crossings, including Delancey and Houston, which are very dangerous and require people to transverse those streets, then East or West to make connections with these other bike paths, and the other issue that was raised, which does come up in CB6, also is that the use of plastic posts is very concerning to people, particularly people with children, who might be using the bike lanes, because there are constant intrusions into the plastic posts by vehicles, either double parking or people just violating the plastic posts. In fact, there was a death in Brooklyn recently when a car killed a bicyclist when they went through the plastic posts. The other issue which was raised, which was a big concern that Cv3 sent it back, was I know there was a mention of parking spaces, but they're 135, approximately spaces that will be lost on Avenue, C and the restaurants. So there is significant issues. I understand that you're dealing with the ward 6 portion, but to consider it a con contiguous greenway, the part in board 3 has to be addressed. Otherwise it's basically a path from 14th street to 20th street. Thank you. But again the what you're discussing is actually not our responsibility or our area, and so I suggest that you take it back to CB3 again and work with them, especially about the objections that they raise. That you're in agreement with. So thank you for the comments and we'll certainly take the idea of the plastic posts under advisement. I, don't see any other hands-ups. There are some people who have typed questions and or comments in the Q&A okay box. I see that John Chamberlain has made some comments. Would you like me to unmute him? Are they Germaine to this particular discussion comments? It's a comment of support. It looks like well yeah. This is the one we. Why are we reserving street parking at all? It's a tiny minority of residents that benefit, but is it the best use of public space? Well, it's a good question, but I've just read it and it's something that we do consider on all the time, but it's not actually something that we're looking at in a general way right now we're looking at this particular problem. So thank you for that. What else do we have Helene Winograd and I apologize if I'm botching? How I'm pronouncing your name says, I'm thrilled to hear you have an avenue c plan. So basically a comment of support of the plan right, okay and yes well- keep going Bren! Thank you. Okay and Greenberg has looks like has expressed some concerns about the configuration on 20th street and a rearrangement not executed was worked out with the city. Issues were blocked, visibly due to the arrangement of the lanes and dangerous situation regarding 23rd street crosstown spots on 20th street, so I can speak to that. The rearrangement is planned for next year. It was delayed this year with some of our limited resources on the alternate side, parking restrictions, but we do plan to still install those updates along 20th street and just to clarify that's related to the pending system. Unlimited implementation as well. The number of things that are on hold still okay. Thank you. I've seen that so I understand what you're saying and we will be looking at actually early next year at that presentation for the rearrangement of 20th street. Let's skip down to Edward Dunn's question Bro Brendan! Please, yes, well, 18th to 20th, well, 18th to 20th West section be bikes only because runners will use the bike path and is there a chance to accommodate both on that section? So I can answer that this is Sean Macias. We are, you know we're working with DDC we're going to try to carve out as much space as we can. There I think the goal is to provide enough space for bikes and joggers, and anyone who wants to you know use the space recreationally during construction, okay and also Sean. It looks like you wanted to answer Andrea Peterson's question, but it's about Houston Street, so I'm not sure about CB3, but we have a. We do have a very contentious agenda here and we have to discuss this item because this you do need a resolution correct, so I'd rather not get off the street here it's. This is not the appropriate form for that. If you don't mind so I think the questions are done. So, let's actually Larry Shire has his handwriting Larry, please, okay, I'm going to bring back up a long-standing request for improved signage, along Avenue C from 14th street, directing people to the ferry stop which doesn't currently exist and with the construction. That's coming, I think it's even more important to let cyclists as well as pedestrians know that the ferry is going to still be in operation and D.O.T needs to work with DDC as the access way to the ferry changes during the course of the project to modify the signage and then to bring it back at the end. Is this something that is doable by D.O.T in connection with taking this project forward? I think two things. One is whenever we put in new bike lanes or upgrade bike things. We always look at the signage and so there's likely to be. You know upgrades to any of the existing bike guides. I'm instructing folks to the greenery or the waterfront or the ferry I know. We also have the next agenda item speaking to some of the detours for pedestrians and cyclists. We can speak more about that in the next item. Thank you. Okay, I see, other hands have gone up. So let's double back Sandy I'd like to propose that we do a resolution in support of this particular extension to the CB or to the Avenue C Bike Lane. Okay, second good deal so I. Guess we take a vote unless Brendan? Would you care to tally the vote by roll call? Yes, so I will call your name for a vote when I call your name, please say whether you're in favor against abstain or are or obtained for cause. Gene Santoro in favor Matt Roberts Favor fill Napolitano in favor John Barron in favor B Desmond, Charles Hernandez in favor, Andrew Gross in favor. You said: Khalid favor, Sandy Mckee. In Fair Larry Shire in favor and Solidman in favor, Brian, Van Newenhoven in favor, Ronnie, White, I, don't think Ronnie has showed up. Bob shut up and James Wilson I will check with James in a moment, but the resolution has passed right. Thank you. Okay. Now all we need is someone to write it. I can write it. Thank you sandy. Okay, much appreciated, okay, so good one mission accomplished. Thank you all. Thank you for the presentations and thank you committee for the trench in questions. Okay, rattling right along here we get to DDC and the presentation about cyclist and pedestrian mitigation related to the East side, coastal resiliency project, one of our favorite topics. I know we're only dealing with this on at least two committees for months and years, literally now, okay, who's doing this presentation: Desiree Gazzo, hi, Desiree hi. How are you I'm fine, so you're on perfect hi everyone I'm going to share my screen so bear with me: oh I'm disabled from sharing my screen. So if someone could please give me, let me do that right now. Thank you. Okay. Excuse me. While we're waiting, I did want to just ask Ddt before they left hope they haven't already. If we could see the further development of plans for the north of 18th street section as soon as possible and the additional stuff about 18th street's corner as well, preferably in January. That would be great. Thank you. Okay, Desiree. Sorry, nope no worries. Can you see my screen? Okay, perfect! Thank you! So thanks everybody for having us I know you have a long agenda. Our slideshow is pretty short. So again, I'm Desiree Gazzo Community engagement, Hntb Libero, with the Esker project, I'm joined by John Lynch, who is the construction manager for Pa2 and several of our colleagues from DDC. A lot of this presentation has been put together in coordination with DOT we've been coordinating with them first. Well, we've we coordinate with them quite frequently, but specifically on this for a couple of weeks now. So the highlights for today we're going to go over the project area 2 overview and then we're going to break into pedestrian access, bicycle access and then communications and signage. So I'm sure everyone is familiar with this map, but we kind of start off our presentations with this again, the Pa2 area up to the north, which has recently started, and then the Pa1 area to the south, with the parallel conveyance in between again just the Pa2 area here and then the Aster Levy, Playground and solar one area where we are starting work. Now so can? Oh sorry, okay, there we go so the Pa2 construction area. Just a quick reminder: I, don't know if everyone attends the land use committee presentations, but phase two will be phased in three different phases, so ask for Levy Park had started on November 16th. We received notice to proceed. 2020 Stey, Cove Park will begin fall, 2021 that will be completed in two phases and then the area around Murphy brothers in 2022, so just a reminder that the pa2 is a phase construction and again right now we're in the mobilization and site preparation phase of project area 2. So there has been again the contractor. Just came on board, you know about two or so weeks ago and they are submitting plans. We've been coordinating with them daily to have these plans approved, and that includes kind of the detour for the pedestrians and the bicyclists. So pedestrian access right now for ass or levy handball and track access is on East 25th street. The work adjacent to solar 1 will not inhibit pedestrian circulation along the waterfront, so we will keep that open. Pedestrian circulation will be detoured, starting next fall when we start steicove park. So we will come back with more updates on that as we get closer to the Seikov Park phasing again, the contractor just came on board, so their phasing for Psychopark has not been finalized yet, but we will say that the pedestrian access, while we're doing the flood wall work at solar, one, will remain open and again, pedestrian detours will be communicated in advance of closures for bicycle access until the Avenue C Bike Lane comes on board right now. This is the detour for project area two, so it's Houston Street and then first and second avenue. We are about to send out an advisory with this map. Again, we just had to finalize this with DOT in the past two weeks, so the advisory should come out tomorrow with this map, so you're getting kind of the first look at it before we announce it tomorrow and then again the detours are subject to change in coordination with DOT and then once the project area, one begins we'll provide an updated detour map depending on the phasing of that project. So the signage that's slated, for that is the standard DOT signage that shows the detours. It's there's I think a sign on almost every intersection of the detour and then we're working on some custom signage for the East River bikeway closure and that's primarily, the three locations are at the northbound start of the detour at the southbound side of the detour and then signage at the ferry landing areas along 34th street, we'll also add pedestrian scale signage as needed, and we're looking at other areas where signage may be appropriate for this detour. So please bear with us, as we coordinate the signage with the contractor and with DOT again. The contractor just came on board two weeks ago, so the detours again will be communicated in advance of the closures. And again you know everything is subject to modifications. So I think everyone is familiar with the communications here, but the construction bulletins are distributed fridays or, if not, then on mondays, the advisories are distributed as needed. So again we're looking to put out an advisory tomorrow, looking at the bike weight detour, which should which may take effect as early as next week. So we will have our community construction liaison on site tomorrow. I'm posting the advisories again we'll send it out through the email blast, we'll post it on the website and we will post it around the bikeway area and again so the last one is the website here that has the construction notice. So again the bike lane detour, the bikeway detour, will go into effect as early as next week. However, we still are coordinating with the contractor, so we did want to send out the advisory in advance notice in case he is ready to start that work next week and we should have more information as the week continues and that's what that is what we have now and then just piggybacking on Eileen's presentation and the DOT presentation regarding the 18th to 20th street. We are working closely with DOT, as they said to you know to make that happen. So please stay tuned for more information which we will share. As you know, as the coordination continues. Okay, thank you. Desiree I see that there are hands up sandy. Please begin you say you're advising bicyclists to go along Houston Street. Does that mean you assume? Houston Street is a safer route than Avenue C for bicyclists sure and Ddot. I'm gonna, I'm hoping you're still on, because I think we anticipated getting bicycling questions. I mean, as we just noted. There is no protected bike. Lane I, don't think, there's any well. There may be partial bike lanes on Houston Street, but unfortunately, now that does become germane to this discussion. If we expose bicycle stations Sean, this is Sean from D.O.T, so Houston has conventional lanes currently so I think as Fc comes on you know. Maybe we can transition this detour, but as the anticipating volumes and the type of facilities that's most analogous to the greenway, we wanted to put people on the protected lanes of first and second. So that's why we chose first and second and then housed in the those conventional lanes to get you back to the greenway as soon as possible, but Houston House didn't present on it here, but it is part of the proposal in Cv3 is to convert those upgrade those conventional links to protect it. Yes, thank you. So this is the direct route, but of course, if Avenue C moves forward, it will provide another option and we can look again at how we're routing books and how soon would you expect Avenue C to go forward in terms of installation implementation? Yes, so we still have to go back to CB3, but our goal is to have it in you know or start next spring next summer. It's still, you know. That is certainly our goal and we'll aim to do that. It's challenging for us to say at this point we are still. We still do have some projects from this year, as was mentioned earlier, that are waiting to go in and then it's hard to know exactly what our resources will be moving forward this year or into next year rather and I just might note as a lifestyle I would so much prefer to ride on Avenue C than Houston I do ride on Houston, but only in duress and I mean we haven't. We don't it's kind of ironic that we just said that this doesn't affect us, but it really does because if that's the route that we're supposed to take- and it's not a protected bike lane, we really should be getting that up and running right away. Let me ask the follow-up question, then Sandy because they did say they're converting that to a protected bike lane. When is that on schedule, four to convert the bike lane on Houston to protect the bike lane Sean can speak to if he has more details, but I think the idea would also be early in the season. But again you know we can't we typically don't start our markings until April or even beginning of May, and then just it's really hard for us to say at this moment what our resources will be, but I believe that is also something we'd like to get in. Sooner than later in the season next year, yeah I'd echo that comment we it would be on the same timeline as Fc, but again with the caveat of not being completely clear on what resources d2 will have available in 2021 I understand that, but at the same time you know we're talking about shuttling literally thousands of cyclists across this corridor or up Avenue C one way or the other, and this has been coming for a long time. We've been working on it for a long time. I assume that you guys didn't start on just last week. I know you didn't so. Can we please accelerate? This is kind of a meaningful project, we're talking about by your own numbers, at least a couple of thousand bikers a day who are going to be having to use this car to or else find their own ways, which is something that none of us particularly wants. So any way that you can accelerate this any way that you can get this done. It hasn't started to snow, yet I understand your problems about temperatures and thermoplastic all that stuff, but we actually do need to get this done in order to protect the people that are being displaced by this very large and necessary ESCR project. I can't urge you enough to do that and I think you understand that the entire board pretty much feels that way. Okay, so, and what can we do to help accelerate this? It's a huge issue. I mean much of the same thing we can do at this point, since our marketing season is over for this year and of course it is temperature related, but it's also contractor related and so I think if this is definitely on the top of our list for next year and hopefully in the early spring, we'll be able to give you an update on what our resources look like and how early we'll be able to get it in, but we certainly understand the need for it and the desire to have it as soon as possible. Okay sandy, if you don't have any follow-ups, I'll move along Andrew, so I have another question, but just following that, like I, don't even ride a bike and I'm a hundred percent in favor of every single thing. Gene that you and Sandy just said, and you know I just got I'm sorry, but you know, I've complained before about I actually have a complaint. Now I do that. You know these projects, these dft projects go up and there's just like a lack of coordination. I'm sorry like this. Like I'm referencing, you know like the Midtown tunnel like this work is being done, but like it's not synced up with like bike lanes, and it's just it's bedlam, and this is another example where I get the contractor wants to go to work now, you're, basically sending people like Sandy and gene who ride bikes and a lot of people on this board into a situation. They don't feel comfortable in and you know, I just think. That's wasn't my initial comment. I think it's unfair and I just feel this is New. York, City and there's just got to be like there's just got to be a way to make it happen. There's just got to be a way to think creatively here or not and not send thousands of people. You know into a situation like that. Can I say that as somebody that doesn't ride a bike I just objectively I'm hearing this and it's just kind of crazy. My actual question feel free to comment on that, but whatever my actual questions, I actually run a lot and I run a lot in this spot. I run there like three or four times a week. Can you just somebody walk me through, like what am I going to experience? I'm heading southbound, I'm like I'm heading down. You know, I'm passing like the marina there's like a gas station I think that's 18 14th street. What am I going to experience running with thousands? Actually, thousands of runners, you probably go there a week. What does that look like what does that feel like? As I'm heading south, you know toward the East, River, Park, sure, Andrew and I. Don't have the specific visual for you, because that is still being worked out with the contractor. Otherwise we would have provided a zoomed in version of what that would look like, but we have been. It has been confirmed that there will be pedestrian access, so it will look something you know similar to. There will be. You know, a construction, fencing of some sort. The exact width of the kind of travel lanes again is still under consideration and coordination with the contractor, John Lynch I think you're on the call I don't know if you have any more to say about that, but I think right now we're coordinating with the contractor to work out those details right now. However, we know that there will be pedestrian access, I, just sorry to decide to jump back in, but just to make it clear yeah. Just you know, because I, I'm again, I'm very used to running like I know that space pretty well I would just stress that I think. What's going to be important here and again, I'm sure the contractor has an amazing flawless plan and it's going to be beautiful. But what I'm hoping is that there's enough space so that we're not jamming people into like a tiny area with like lots of barricades and fencing because, hey I'm sure the people are not going to respect your bike rules anyway, because people ride their bikes and don't dismount over there. So I'm expecting people to recklessly ride, bicycles and just run over people anyway, and I'm curious to know if there's, if you guys, are going to mitigate that somehow, because, like there's no way New Yorkers going to follow your rules and b, you know, especially with Covid-19 right. It's just not a great time to be like jamming lots of people who are exercising into like teeny spaces. I'm not accusing or saying that you guys are gonna. Do that, but just knowing how construction often goes I just want to throw that out there early on sure and I think we have had conversations around Covid-19 as well and kind of taken a look at what other parks and pedestrian areas you know are doing. So we have been considering that I will say that you know the area that is being sectioned off for the solar one is, you know relatively small to what some of the other parts of the construction will be like moving forward, but we will take all of these concerns into consideration, as we are working with the contractor right now to determine what that space will look like, and we will come back with an update for you amazing. Thank you. Okay, thank you. Let's go to Larry hi, I'm a little confused about what's happening, adjacent to solar one and the area where the flood wall is going to be in the short term. Can you clarify your previous comment, so the area around solar, one and again John Lynch you're, more than welcome to jump in, but the flood wall construction is happening adjacent to solar one and that we presented on that at the land use presentation. So that is the construction. That's happening at solar one. So it's just north of psycho park where the solar one area is. We will be in there constructing the flood wall around solar one. So that way, we can finish up that work so that solar one can work on the construction that they have planned for that area right in Desiree. This is John. The corridor would be between the solar one building and the water right, so that'll be the pedestrian flow, which is what's there now right for pedestrians. Are you saying that would be there during much of the construction or until when correct, while we construct the flood wall? Okay, could that not also be an area for bicyclists? Well, the bicyclists are to use the bicycle detour again, like Andrew said it's, you know, people are people and they don't always follow the rules. So there is a bicycle detour for this project. However, we you know we will put up signage or we'll try to put up signage or we'll look to put up signage. However, we can't physically stop people from using the pedestrian area. You know as they want to so again. The detour will be set for bicyclists, but we can't control every person so again, we'll do our best to try to accommodate them. Well, I'm really sorry, I'm becoming more confused. Based upon Andrew's inquiry about being a runner and trying to come down past the gas station, how far will he be able to proceed and before having to detour away from the river's edge will remain open? He will be able to continue along the river's edge. It's the greenway that the bikeway that will be detoured, so the pedestrian do I. Have the pedestrian access will continue along the water's edge around the solar one building and how far south will you be able to proceed before you have to exit the park and there's a Murphy's brothers playground? Is that where you have to exit over by Avenue, C and 18th street, or for how long can you know continue down to 10th street? No, the pedestrian? The construction right now for this year is only after levy, playground and solar one. So the construction until next fall is only the solar adjacent to solar, 1 and Aster Levy Playground, and then the Sky Cove Park construction will begin next fall and Murphy Brothers playground. Construction will begin the fall after that, so it's phased. So that way, the entire Pa2 area is not under construction. At once to minimize the impacts to the community, pedestrians and bicyclists as much as possible right- and you mentioned that, there's going to be some special signage at the 34th Street Ferry landing. What signage will be at the Stuyvesant cove landing that was omitted, so we're looking right now we're looking at where we're going to need the specialty signage so, depending on how the detours work that will determine where that specialty signage is needed. Those are three areas that have been pointed out kind of from the start and then we're looking at where additional signage is needed. Yeah. Obviously, if somebody arrives on bicycle aboard the ferry they're going to need to know where to go, and vice versa, if somebody is, as I mentioned in the previous segment looking to get to the ferry via bicycle, they need excellent guidance here. Yes, okay, thank you. Let me just before I call in the next question. Let me just in support of Larry's point and Andrew's point to expand it. Deity's best designs come from understanding the instincts of New Yorkers, on their feet or on bicycles, and they try to design things that conform to the instinctive moves that people take when they're confronted with situations. So this is why the pedestrian detour makes more sense than the bike detour, I, think to the entire board of CB6, and so again, I'd like to urge you to reconsider what it is you're doing as quickly as you can, because what is going to happen, as Andrew said, is that people are not going to take the route to first and second avenues. They'll find alternate routes, whether it's along the waterfront or whether it's down the sidewalks along Avenue C, which are already clogged with pedestrians from Stuyvesant town, have a bus, stop on the corner of 20th and Avenue C. That's a standing bus stop which begins the line there. So there are people as well as buses waiting. So we need to address this issue in a holistic way as soon as possible in order to keep people safe and I, really appreciate you guys, I know you're working hard on this I know it's complicated. We've been working on it for four years, so I really appreciate you, accelerating whatever plans you have between DDC DOT, to get this done quickly, whether or not withstanding other things notwithstanding, because we have literally thousands of lives at stake and I guess. I'd appreciate that movement. Thank you. Okay, gene. There was one other thing that I want Jean Gene, there's one other thing apropos of your first comment, and that is at the beginning of the pandemic. There were some extraordinary measures taken to create temporary bike routes and protected bike paths, including the use of traffic, cones crash barriers, and perhaps that can be used along Avenue C, Houston Street before the winter season, to create some semblance of a routing that cyclists can more safely traverse. Thank you. Larry, okay, Sandy, you've had your hand up for a while and I just wondered what design criteria you are asking of the contractors like. Are you I mean you as you negotiate with them? You must say: oh, we need 50 feet for pedestrian access or 25 feet, or we will give you know. Can you help us to understand what it is? You're asking the contractors to actually do sure sandy thanks for the comment, I think around the solar one building there only there is a limited amount of space there, so we're trying to look at what that, how we can work within that space to accommodate pedestrians. So you know again. The conversations are ongoing, however, we're looking at the space restraints and the space that they need and then trying to coordinate with them on what we can allow for and I guess. My only point is: if you go to them with the criteria, it's much easier to meet the criteria. Thank you know, and so I'm assuming you do have some specifics- that you're asking them that it can't be two feet, can't be three feet right and I. Think it's we're trying to get the maximum space and might be able to tell me what the max, what what's a minimum there aren't there isn't a specific minimum we're just trying to if the minimum is the space the maximum is the space between the solar one building and the water's edge. So we are trying to look at what that and I'm sorry. I, don't have that dimension right now with me, but we're looking of how to make that a safe area for pedestrians and bicyclists and I could again I could take another look at that and we'll as we're coordinating come back with what that area could look like I think that would be really helpful for us to understand what it's going to be like. Thank you, yep, excellent! Yes, thank you sandy and now Andrew. You have your hand up again, I'll be very quick. I know, I, don't normally like to take up more than one shot, I just gene procedurally I, don't know! If we're voting on this tonight, we're not okay yeah, because I was just gonna say, there's respectfully as much as I love everybody at D.O.T, there's just not enough here and you know: I think that I'll go further because I saw there was a comment in the chat piggybacking thought that I had that you know as this stands. You know this is not something that I could support. I just could not vote in favor of this, because it's just it's lacking so much that you know it's screaming. For not only the suggestions that we've raised here, I think every as you said, everyone seems to be on the same page, but it's just is lacking so much color that it really needs a lot more for I could ever support what I'm seeing and I. Don't think it's the fault, I'm speculating on DOT I think the contractor needs to come back and be very clear. You yes, I agree with you. I do believe that we're all pretty much on the same page without that and I think. One of the reasons for this meeting tonight was to make sure that DDC and D.O.T both understood just exactly how strongly we feel about this and have felt for the years that we've been working on it, and so please request again that we mitigate this and make it better as soon as possible. Okay, we're done with committee questions and we have the esteemed Adam Harkey's hand up what yet once again. So thank you, Bravo, Gene and committee couldn't have said it better, excellent points. So basically I just wanted to say it's if you guys have not signed up for the email alerts. I highly encourage you to do that. These are a weekly alerts, either Monday or Friday they're, very helpful, they're very informative. Yet they go on the ESCR website or we can forge the link or whatever it's. It really does a great job in terms of keeping you up to date. However, on the flip side, though, on the website and I think this leads to my ultimate question. Here is still the mapping interface still not good. It still links to a very unhelpful Gis website, it's not great, and it doesn't do anything to help broedcast useful information to the lay public. However, though, what is great are the maps that you showed this evening. You know, though they were clear, they were concise, colorful and they broedcast a lot of information. So I would highly implore you to just ditch that link and to broedcast, whatever closures that you do have in the format that you showed us tonight. I think that would go a long way in terms of ask asking you know repetitive, questions and I think it would really broedcast the right information that people are looking for on that site and so with all with the monologue being over. You were talking about closures, so you're talking about putting up signs for the detours this week in the past week. So when do the actual closures start? Okay, thank you Adam. So I'm gonna just hit on the first dialogue that you stated and then I will jump into the second. So the first I did take the comment back about the Gis link, and so the Gis link is for the street closures. So most definitely when there are street closures for the project in this phase and others, we will not be able to provide a easy to read colorful map for every street closure, because some may only last a day or two. So the link to the street closures map is really, for. You know the street closures associated with the project we did reach out to DOT and we are now coordinating with the Gdc Doit system, who manages the website to see if there is a way, a helpful way to either when you click on that link to open up right to the website, or is there a searchable term like? Can we put in like if you just type in Esker, will you zoom into a private area, so I can not make any promises on that. However, we have been coordinating since that comment was lasting. Yeah, that's I, understand yeah, it's been for bringing that yeah, but still and then I. What you present tonight is really good. I think it's really helpful. You know. So if you can provide it, you know in that format. I think it would go a long way, sure great, that's, fantastic and right. It will be up when we announced the first bulletin, but also having it. You know, on a full screen would be helpful as well. So we will take that back and again just a second kind of the bulletin. Once there is more construction happening, there will be more information on the construction bulletins. I know, we've gotten several comments on how the bulletins are not necessarily saying a lot. However, there has been minimal work happening so once there is more work happening there will be. You know, more information on the bulletins. But yes, if you haven't signed up, please do sign up and if there are any, you know from CB6. If there are any lists of folks who you want us to kind of add all together, we can certainly accommodate that as well and then for the greenway closure. So that can happen as early as next week. So the coordination is still ongoing, with solar, one and EDC. As I'm sure lots of people are aware. So we need to coordinate that area adjacent to solar one with EDC prior to actually closing down the greenway. So we did want to put out an advisory with a kind of as starting could start. You know it's not going to say could start as early as but it'll say you know effective next week. There could be that detour there. So again, it's still under coordination, and we do want to try now that the detour as it is now has been reviewed and is finalized to go out to be made public. We do want to get that up as soon as possible, again with the knowledge that it may start as soon as next week. So we're looking to have that out on the streets tomorrow morning, excellent great looking for the email, thanks, okay, just to build on that and a couple of other points that were made. We would like to see more detail about the upcoming changes that you're proposing and to the bike and pedestrian stuff in more detail, because this was sketchy as people have noted. So we really appreciate seeing you here next month with something that's more fleshed out along, as well as the Avenue C thing, because this is a very important piece of our district. We have very little open space. We have very little access to the river. This is part of both of those things and the thousands of people who use them every day. Despite all of our outreach, your outreach I have a feeling that at least a large number of them are going to be showing up that first day that you're closed this down and they're going to be standing there scratching their heads going what just happened, and we need to avoid that too. Some of these, the very short deadlines that you you're, giving us I understand about the difficulty of the project, but the very short deadlines that we're getting for close downs and move arounds and stuff like that is going to just exacerbate that problem and not solve it so really going forward. It would be much more helpful for all of us, you and the contractor included to get us timelines about, what's going to happen more than a week in advance. We really appreciate that and gene. I'm sorry if I can add to that. I'm so delighted that Adam is here, because so many of these issues are issues that you know. We have asked for answers on at land use and you know it's being treated like it's an entirely new thing, so Adam. Thank you for speaking up and gene. Thank you, for you know promoting that crossover, but you know to ESCR, like you guys need to make that crossover too and sorry just to comment on that. Are you saying just that? We didn't present this at the previous CB6 meeting. I am saying that there are issues that have been consistently asked in different committees that are kind of still not being addressed with substantive answers. Okay and then so just thank you for that comment. We are preparing a response from the CB6 land use from the last meeting to address some of the questions that were brought up. We did address a few at the Cag meeting last week, so we are putting a written response together to send over to you I think we had said by Mid-December to late December, since there wasn't going to be another Cv6 land use Committee, so that is in preparation and then just for the information that we're preparing tonight, we literally just did- you know, have the final approvals on it and that's why the advisory is going out tomorrow. But please, if there are any other comments on how we can better prepare for you. That would be great. You know we'll take everything down and bring it back. So thank you, okay. So here's a like a concrete suggestion and I do appreciate how hard you guys are working and I do understand what a difficult project this is, but you know assume that the questions that were raised in the land use committee are going to be this sick kind of at least overlapping, with the concerns in this committee, and so, as you are preparing a presentation for one committee or the other think about the questions that the other committee has asked. You is that helpful I do try and be constructive sure, yeah I think you know. We specifically didn't address some of the other questions from the land use tonight, because we did want to focus it on transportation, but yes, 100 we will, you know, try and piggyback on them a bit more okay. Thank you, Ann. Thank you, Desiree. I'm looking forward to seeing you looking forward to seeing you next month with the updated versions of all this stuff, so that we can try to get ahead of it instead of running behind and missing the bus. All the time like that's the sound of frustration, I think you're hearing from the committee and stuff like that and gene honestly I think will probably and I don't want to make any promises, but I would imagine we would have an update for you on the pedestrian area before or next month. So when we do we'll shoot that over to you in advance, that would be excellent. Thank you. I see some questions and comments that have been coming in to our Q&A feature. Okay, one of the questions you know, I guess in certain ways might be more relevant to the previous presentation, but Scott Baker was asking was saying: First Avenue is in a distant territory and up Houston at that which has no bike lane. Why can't we get a guarantee avenue so you'll be ready before the esplanade is closed down, I'm going to punt that to Sean or someone at D.O.T I think you've already answered. Yes, we don't need to recap. Thank you, I think so agreed. Okay, let me see what else Shireen well Jalabi I apologize. If I'm not pronouncing that correctly, ask me please clarify: will bike lanes, closure and or detour at or near east 34th, beginning next week, yeah, so the bike lane detour that is shown here will begin as early as next week. Yes, I think the issue is, how are people going to get from the ferry to where they have to go so you're directing them down 34th street now, oh sure, so the only so the greenway closure will only the closed. The actual closed part of the greenway will only be- and I'm going to switch back to here, because I neglected to put solar one on the other map, but the greenway closure will only be around the solar one area, so the greenway will still be open up around the ferry area by 34th Street, so the detour would the greenway is still open there, so it will be kind of as normal connection to first and Second Avenue. Well, that brings up the question: why don't you detour on 20th and actually Ben Jacobs, who I think you know? Ben Jacobs from Councilmember Para's office asked a similar question when the crosstown protected lanes on 12th and 13th and 20th also serve as alternatives to Houston here, but then asked a similar question to what Sandy is asking sure and I'm going to again defer to Sean from D.O.T or someone else from the DOT team sure. So in terms of the reroute, you know we can look at this again and figure out if 12th and 13th are a better option, but I think the question, maybe that some folks are trying to get at is, will there be access north of 23rd? Is that the question like will the greenway and the pedestrian area be contiguous from 23rd south? What actual part of the greenway will be closed that you can't use right? So the only part of the greenway that will be closed is around east between kind of east 23rd and East 20th and John. That's correct, John Lynch! If you could just concur. Yes, that's right! This is John Hey Desiree yeah, so it would be the green, the greenway meaning the bicyclists past the gas station go to the right heading south, that's where the flood wall is being constructed, so pedestrian flow along the waterfront between the solar one building and the water there will be maintained and we're to maintain access to the ferry 24 7 during construction. Why detour from Houston, then so I think so just to piggyback on what John said so right so technically that small area is the only part of the greenway that will be closed. So if you have a preferred route as opposed to East Houston Street, you know the greenway will be open and we can update this. We could update this image to show the actual location of the greenway closure before we post it tomorrow. So that way you could see a little bit more clearer. What part of the greenway will remain open. So this is the kind of project approved detour. However, the only part of the greenway that will be closed is, as we said, between kind of east 20th and east 23rd. Well, let me make a suggestion, Desiree again, based on what everybody in the committee has been saying, one more time, Sean as well. This may be your suggested detour, but let's face it, people are going to find ways to get there and they're not necessarily going to find this way to get there. So, let's try to prepare for the other alternatives, as Ben suggested. Ben Jacobs from Keith Power's office suggested 12th and 13th street branching off Avenue C get people to first and second avenue. If that's where they want to go. 20Th street gets people from Avenue C to 1st and 2nd avenue from where they want to go. Those things have protected bike lanes on them all the way. So there may be some way that you should rejigger what this map looks like to suggest the routes that bikers are going to have to fumble around and find for themselves. It would be probably a little better given the number of bikers we're talking about if we gave them better guidance about what we suggest that they use to avoid difficulties and dangers. We will take that back and consult with D.O.T on that. Thank you, okay, Brendan I think we can we're going to be dealing with the 145 East 15th street issue later under old business. So let's is there anything else relevant to this particular issue in the questions Scott Baker asked. So what is closed next week, just solar one area all right. That's the seeking clarification: okay, otherwise Scott Baker also asked whether the service road can be kept partially or open. In the meantime, we can take that request back I, don't believe, I have an answer for you right now. Unless John Lynch, you have an answer for that. No Desiree. This is John, I'm not sure which service road are. We talking about the FDR drive service. Road I believe, is that south of the Bp Gas station or north by waterside, I'm not entirely clear what I'm not either Brendan I, don't know what the service road FDR drive means in this particular area, because there's Avenue, C, there's the FDR drive and then there's stykov park and there's the parking lot underneath, which Scott also mentions, which we've already discussed at length. So unless he can clarify that for us, I, don't know what he's asking okay and then just a general comment from Edmund Dunn saying just an FYI I currently run on the Cybers in town, Peter, Cooper, Village, side sidewalk between 18th and 23rd street. Due to my Covid-19 concerns on the cove area, this area will get slammed by the East river project just be aware of this. Nothing to answer to, but just something to keep in mind as a concern that has been expressed. Okay, well, thank you. Desiree Sean, all the other members of D.O.T and Dvc really appreciate John Lynch, looking forward to seeing you next month and we've certainly I hope, given you some stuff to think about and chew on so looking forward to seeing the results of that. Absolutely. Thank you. Okay! So now we have the ever wonderful report from D.O.T that would be Colleen Hey, Gene, Hey, Committee members. How are you it's Colleen Chatterhood from City Department of Transportation, so gene you had submitted to me some inquiries and I wanted to get back to you on that. The first thing was the resolution that the community board had sent us back in 2018 regarding Glick Park and I'm actually in the process of confirming the lighting, and that is if DOT maintains the lighting and what next steps will be in terms of paving the area that I'm also looking at, but even if we are able to pave and if that's under our jurisdiction, that's not going to be done this year because our paving season has completed just so. You know, but I will confirm that and I'll get back to you on that. Okay I appreciate that, because yes, that's something that's outstanding and we were told that it was that was D.O.T turf, so I appreciate you confirming it and moving forward as whenever we can, if it's spring, but it's been, the park has been done and it's an outstanding piece of that whole project. That started, however, many decades ago. So if we could finish up that one little piece that would really be swell and people would have at least the northern end of our part of the greenway- that part of the greenway would be in much better shape. While we have this part ripped up, and so that's right and we will we'll coordinate with parks, we'll work with parks. On that. The other thing that you inquired was the 15th street bike Corral. Is it the bike corral or is it the CitiBike station? It's the CitiBike station. There are people, I know have come to this meeting at least three of them who want to speak to that particular issue. So if we're going to do that under old business, if you can stick around for a little bit after this report, no problem, so the you had sent me a photo regarding work that was done at 23rd street, the Southwest Corner 23rd, Street and First Avenue, it was the northwest corner. I'm sorry, yeah, okay, well, yeah all right! Well, we were able to you figured that out. Yes yeah. We were able to figure that out. So there was a contractor who was out there and did some work, and apparently they did not restore the sidewalk flag back in kind, and our inspectors is in the process of notifying the contractor to get them back to restore that particular area in kind. However, I don't think it's gonna be done soon or you know within the next few months, because we still have our holiday construction embargo, which ends in the first week in January. So it's possible they'll come back out there in spring and make the repairs, but this is on my radar and we'll make sure that it gets done just so. You know the restoration does look sloppy, so we'll get restored. Okay! Well, thank you yeah. Now the twofold concern is basically, not only is it sloppy, it's an uneven splatchatar, it's basically a cold tar patch, but the protective bit of sidewalk and raised curb that pedestrians are standing behind when they're waiting to cross. That street is now gone, and so cars can cut that corner a little more closely and not pay price of rolling over the curb stuff like that. So it's as soon as you can do, it I understand the seasonal problem, but as soon as you could do it, that would also be helpful because it's right by the hospital. So there are a lot of people who will you help to get across First avenue, yeah totally get it. So that's on my radar I'll keep you posted on that. Okay. Thank you. You're welcome. Gene shares report. We're gonna, keep this real brief. Oh wait! Sorry to interrupt Eugene, it looks like Larry's raised his hand. Oh okay. This is just very briefly it's along the lines of something I've been working with Brendan on for a long time, since the completion of the work on the 14th street lights are many of them. Not working and Brennan has asked me for 311 reports and the like, but Colleen do you know anything about this Brendan I'm I mean Larry, I'm not familiar with this. If the street lights are not working, please call it into 311, because that's our tracking system and then you'll be able to get a 311 number yeah. It's been open for months. A couple of months, at least, have you called it into 311 Larry? Yes, Brendan's got our numbers: okay, Brendan! If you can send me that information tomorrow, that will be great yep we'll do. Thank you, terrific! Thank you, Larry. Thank you, Brendan, okay, back to the chairs report, which is going to be even briefer. I hope the sinkhole is moving along. It's on schedule to be finished by the end of the year, hopefully a little before, but definitely by the end of the year. I've been up there pretty much two to five times a week and they're rolling I spoke to the contractor foreman he's confident. So let's just hope that it continues. Meantime the bypass that they developed is really working quite well, and so the buses are back to running in front of waterside, so they're happy, and so the disaster has at least been mitigated, even if it's not fully repaired yet so another few weeks, and that should be taken care of, and that's really all I've got. So, let's move along to old business, where we can take up the issue of the CitiBike corral dock. What a station in front of 100,145 I believe East 15th street, where we have people who want to speak to that? Brendan, yes, I know one of the people who wants to speak to that is Florence Friedman, so I will actually I. Think Florence has left the meeting, but I can read off some of the concerns that she expressed in the Q&A feature earlier. She said: CitiBike installed, 81 bikes in front of 145 East 15th street. We had about 50 and we're okay with that, but then Lyft added more so we now have 81. D.O.T yeah, I'm just you know. Given the short version, the ot never responded to our complaints. However, council member Reverend Senator Krueger helped any adjustment was made, but the adjustment took out four bikes that left the elevated station. This left us with a gap between the station and the sidewalk a photo sent to Cody who's. An another member of CB6 staff, plus the station, is higher than the street, so somehow coming from a car has to step up from the roadway to the station down from the station bottom line. This is dangerous, so that was something that Florence Friedman said when she was here earlier. It looks like a couple of other individuals want to speak to that are still here, including Marcia Goldstein, who I see, has her hand raised and has something in the Q&A feature. Okay, just I will remind them before they start Bren, please keep the whatever you have to say, succinct and on target, and also there will be a. There will be a two minute time limit on this, because we're running really late and whatever you have to say, please try to compress it into the two minutes. Thank you. Okay, so Marcia Goldstein I will now allow you to speak. There are five people in my building who use wheelchairs and there are three of us who use mobility devices I use a cane and it I can not cross I can not get from the street onto the sidewalk except at the corner, and this is going to be very dangerous. During snowy weather, I have a picture of the cable cover. Is there any way that I could show it because it's even dangerous for normal people? Did you hear me? Yes, okay can I show the picture. Let me see if I can give you an ability to share your screen just a quick moment. Yeah just a moment: okay Marcia. You should be able to share your screen now. There's a share screen button at the bottom. Marcie are still there. I will she's there, but muted yeah I promoted her so that she can be able to share her screen since she wanted to share an image but looks like she's having I guess technical difficulties right now. I will work on that, but there was one other individual who also expressed some concerns mark Clinton. Let me see if he is still on I, don't think he is still on, but I will read what he wrote in the question and answer section he said: I live on 145, East, 15th, Street, sorry about that I forgot to oh the timer caught you, it didn't catch anybody else. It's kind of ironic the driver caught me, but anyway, so Mark Fenton, said: I live on 145, East 15th street between third and Irving, and use a wheelchair CitiBikes blocking entrance to building even with bikes removed. This is an enormous inconvenience and anti-disability, and just anecdotally I spoke with Mark Fenton on the phone earlier today about his concerns. He is a wheelchair user and is affected by the current layout by that building. Okay. Well, we get to just. There are a couple of people in that building who are upset about the city by corral. It seemed to have issues with it. The super of the building has been spoken to and he didn't seem to have any issues with it, but Carly Colleen. Do you have any responses? You know, prior to the Citibank station being there, you had parked cars that were there and we did, you know, receive the complaints from residents and we mitigated by putting a blank plate, which you know you can clearly access through if you're being picked up and dropped off. No, it is not. You can not do that because it's the regular cable cover, which is not straight for people to stand on also Marcia. You should be able to share your screen now. I apologize for the title. What do I do? There should be a share screen button at the bottom onslaught video yeah. It's right next to chat. There is a share screen button. Okay, it's green! It's a big green button! That's it! So, once you press it, you should have a number of options for which screen you want to share. Just select the one that has the image, I'm not getting anything well I'll see if I can maybe dig up an image instead, so gene I'm I, know Marcy mentioned that they have not received a response from D.O.T. So I'm checking with my colleagues to find out if we ever sent a letter to the resume and I'll copy you on that gene yeah, you should put in a ramps for handicapped individuals. Okay I mean. Let me I, don't think we're gonna resolve this tonight, especially not right. Now. This sounds like an ongoing conversation between the these residents and D.O.T. Regarding the building, whether they got the response they needed, whether D.O.T is there's something else. D.O.T can do, there's not really much that we can do about this, except have we've. Let folks have their voice and dots heard it, and we want those conversations to go forward for sure so Colleen I appreciate it. I would like to say one more thing. Yes, I think that this is an issue which is a which is, it falls underneath the American Disabilities act. They are handy, they are preventing people from crossing the street, and this is against the American Disabilities act. Okay, well, we'll take that under advisement I mean, if that's true, then they'll be forced by the law to rearrange their thing. But let us let DOT- and you folks, work this out in some way. That's equitable and works for everyone, because we don't want people being feeling like they're dependent at the same time. You know we're we don't want to. We don't want to impede what it is that D.O.T is trying to do with CitiBike. There's got to be a place in the middle, where everybody is happy about this particular setup. And yes, let's please, let's get to that Colleen we're happy to work with the building. I mean I know we installed the blank plate to allow for access, so I can see what else you can not. Well, you did not it's. The cable cover is still there. It's not blank! That's where I have a picture of the cable cover? Yes, okay, you know: what can you send that picture to Brendan, try to send it to him and Brendan will email it to me? Yeah, oh gosh yeah, just to clarify, though I think the issue is that, because is that, while the a few bike racks were taken away, there is still that step up and step down and step up again to the curb that makes access difficult to impossible for people with canes and with wheelchairs, and that's from my understanding, yeah, you are correct. Okay! Well again, this is a. This is really more of a service issue Brendan and let us the office and Colleen, and these folks in the building need to work on that. This is not something that the committee needs to put more time into, especially not after a two and a half hour, long, really intense meeting about all the stuff that we've just gone to. It's just not appropriate, so appreciate it. If you would go forward with that and certainly mitigate what it is that Miss, Goldstein and the others are worried about, because we don't want them feeling like they're trapped in their own buildings or in danger in any way. So thank you for that. Thank you. Okay can I just say one thing who who's that baron, oh sure, Joan, sorry I'll see you there for a minute. I live in the building and if there's anything, I can do to help facilitate this issue. I am you know, I was the one originally got Carlina involved and whatever. So if there's anything that you need me to do, I'm fine that would be great talk to talk with Brendan yeah, please and see what you guys can put together going forward, really appreciate it. Thank you for stepping up. Okay under new business I, don't really have any new business unless somebody else has any new business. If I had any new business, it flew out of my head about an hour ago. Let's put it that way. I see that Brian has raised his hand. I don't know if it was about yeah. It was about the last thing. I just said: I was I saw it yesterday. It was the standard issue gap between the docks that they added recently when they added new docks. D.O.T doesn't have like a bridge plate thing that they put in for this kind of thing or CitiBike, but that's probably the solution that a bridge plate to just cover the gap between the curb and the thing, but the curb is there anyway. So this is still going to be status quo, improvement over what the original condition of the street, where it was blocked by cars. Okay, Brian thanks we'll get you out there with your toolkit very soon. Okay do I anybody else, have any older new business that they want to raise their hands about. Please say: no, okay! Is there a motion to adjourn? Thank you. If there are no objections, we will adjourn the meeting. Thank you all. This was a long meeting very intense, a lot of difficult and naughty problems. A lot of things that are still up in the air I understand that some of us have been pursuing this ESCR stuff. For now it's pushing five years, I hate to think about it. I mean it's five years of my life, not to mention the lives of many other people, but here we are still pushing the stone and you guys did a great job tonight. The questions were on point we've. Given them a lot to think about. Hopefully they will come back in January with something better than a line on our sidewalk along Avenue C telling us that.",
            "summary": "And if I may, I'd like to introduce my colleagues, Brian Parrott, Caitlyn, toner and Janae Malloy are on from Dot's bike share program as well as Kimberly Rancourt and Colleen Chattergoon from the Manhattan borough commissioner's office, who many of you already have the pleasure of working with Nag Laku, Eileen, Body and Sean Macias.\nWe believe that bike share will play a critical role in getting people around the city and back to work.\nIn addition to expanding into these new neighborhoods cot is also adding new stations and more dock capacity into the existing service area, including here in CB6, to help support the demands of a larger system, we'll be presenting our infill plans, tonight, and so with.\nI wanted to thank the board again for giving us the opportunity to present, and at this point, I'd like to hand it off to Janae from the bikeshare team to walk us through tonight's slides all right.\nWhat 3D bridging is it's a tool that we will use to add docs to stations at locations where there might be an even surface or a lot of obstacles that we need to work around like utilities or tree pits.\nThe next couple of slides, so at East, 27th Street in Park Ave. This station is proposed for the southern portion of the road bed at 2nd, Avenue and East 29th street.\nJanae, yes, hello, I, would like to first address attention to the southernmost bicycle share station at East, 14th, Street and Avenue B.\nSo I think it would be really helpful if you could make those criteria pretty widely available, for you know both to the board and to the general public.\nYou know, DOT was not planning to move any transportation infrastructure which included bus, stops and CitiBike stations at that time.\nA permanent, open restaurant program will look like and how to kind of deal with all of these kind of conflicts, and you know, need for curbside space over the next few months in terms of these new stations that Janae ran through in CB6, None of them conflict with existing open restaurant setup.\nTo answer your question about existing CitiBike stations in front of restaurants, no, You know we will not be moving or adjusting a bike share station in order for a restaurant to set up outdoor dining.\nThe second thing is, with the some of the pictures that you showed for expanding the bike docks a lot of them seem to appear to impede on pedestrian space.\nIf people are logging on to our feedback portal and commenting that they feel like additional bikes or capacity is warranted an area we'll take a look at that and weigh that.\nIt's about a pedestrian space, so some of the expansions that I've personally experienced and then just even in the picture that was included in this presentation, showed it you know, impeding onto the sidewalk itself, rather than you know, being elongated on the street itself or expanded.\nA big issue that we face in our district is, You know a lot of things impeding on pedestrian space.\nSure I mean we're balancing, as many as there are multiple needs for some streets and sidewalks in New York we're trying to balance those as best we can.\nWe definitely do want feedback to hear if folks would rather see things in the road bed, but obviously we try to play stations on sidewalks where we feel like they can be placed, and you know not impede pedestrian flow.\nThe compliment specifically relates to the infill station at First, Avenue and 54th street, which serves a transit desert in the Sutton area community and with the new bridge going up and the Outboard Roadway Greenway extension being built at the end of the bike path.\nThe inquiry relates to the area at 14th, street and Second, Avenue and 23rd street and third Avenue, which I also think are kind of like deserts at 14th and second there's a CitiBike station that ought to be there that serves the SBS station.\nI know there is Helene Weiner Grad, I, apologize, If I'm, not pronouncing that correctly saying, Can you provide regular bike lock-ups near CitiBike spots, but that doesn't seem that sorry.\nWe chose this route to upgrade, how it will work with the closure of the East River park, some of the design details in terms of connection connecting up to the north, how it looks on the street.\nAnd, As you can see in the other areas on the map, the larger network that can mentioned does continue down to East Houston Street on Avenue C, and also with that project, we're implementing.\nIf you look on the map, the next closest protected bike lanes that run north south are all the way over on first and second avenue, which is quite a distance from the waterfront they're, Also heavily used at this time.\nSo Avenue C has the advantage of continuing all the way up to east 20th street, whereas some of the other streets don't make it all the way through skytown or they don't connect up past the waterfront and finally, With the East River park closure coming up, we have heard a number of requests from elected officials and community members during the public engagement process of the East side, coastal resiliency project, really wanting to hear about what options cyclists could use during that closure for a north-south route in 2019, the city released a green wave plan for cycling, which shows, on a conceptual level a citywide protected bike lane network.\nNext to look at the East Houston Street crash numbers, because that's connected to this project, This is actually a vision, zero priority corridor, which means that the rate of crashes is even higher and so again.\nOver, the years, we've been looking at the data after installing protected bike lanes throughout the city, and what we've noticed is that, across the board, when we consider people driving people, biking and people walking, pedestrians, there's a 15 drop in crashes with injuries.\nThat's a really significant decrease in crashes with injuries just from these street redesigns, and when we look at the crash numbers for pedestrians, those actually decrease even more so protected bike lanes and street redesigns are a really important opportunity to really make the street safer for everyone, and so the department of design and construction, as you know, is managing the East side.\nWhile the East River park will be closed, it is important to provide a reliable, dedicated space on the street that serves as an alternative, and so again our project meets the need of both building out that citywide protected bike.\nWe are not proposing any changes to those bus stops, so they will continue to be in operation at their current locations and the bike lane design does accommodate the existing buses, so they'll still be able to pull to the curb.\nAnd I'll share a little bit more detail about that in a few slides, I'm still getting into the existing conditions, and the proposal details currently Avenue C between East 14th street to East 18th street is unique in that it consists of both a service road and a main line.\nThe bus stop would actually the bike lane design at the bus stops would look quite similar to what it looks like now, where the buses pull to the curb and cyclists.\nSo at this location, cyclists ride along the greenway off Street and that's going to be closed during the East, River, park, closure and all of the construction work, So we're currently working with DDC on a potential temporary connection that would be protected for that segment during the construction.\nThat people can use while the East River Park, is closed, and it also helps us meet our goal of building out that city-wide by protected bike.\nWe did discuss it internally and we are looking at what the potential the best potential design would be, and so we wanted to actually have a follow-up conversation I think with skytown about what makes the most sense for that location.\nI, see it on the northern end of this project, but nevertheless it's in order to avoid complications for bikers and pedestrians, and one of the issues raised was the fact that bikers and pedestrians were trying to navigate the detour during the construction are going to be using the Avenue Sea sidewalk very heavily, rather than going to first and second Avenue.\nAnd I, really appreciate, as others have said, the proposal to put the projection of the bike path from 18th to 20th street under the FDR drive, and I've also mentioned previous meetings.\nSecondly, going back to the picture of Avenue C between 18th and 14th street and where you have proposed on the West side, creating a parking per no, not a parking protector, but a buffered, bike, Lane I, think that is very wise because it eliminates a problem both for cyclists and for motorists, which is limited visibility around those slip lanes which are very dangerous, and you might want to also consider on the service road, perhaps taking away one parking space at the beginning of the slip lane to further improve the visibility by daylighting.\nTypically, What also happens is that as the bus is pulling away from the curb, which is the current case now of what the current conditions are like on Avenue C, you know, they'll, look for cyclists and they'll pull out slowly, and so this is where you know in a location where we already have people riding, because it's an existing facility, they're aware to be looking out for them, as well.\nYou very much saying hi from the land use millennium side of things very hopeful for your work underneath from 18th to 20th street as gene and everyone else has said, and I'm just going to echo again.\nLooking for a north-south alternative to the East side, Greenway, which we all know is going to be closed.\nStreet be marked for cyclists to cross from Avenue C over to the crosstown bike lane that begins at Avenue.\nBut what I can say is that we did make some improvements two years ago, when the 20th street project was installed to add the new ramps to come on and off of the greenway.\nWe want to make sure that we can get that through along FDR finalists, as we went through the final design, knowing exactly how that's going to work out we'll play a part.\nBut okay, If you have a real quick answer for that, so this section on 13th street between, like the end of the cul-de-sac to Avenue C.\nThere are a lot of issues in terms of continuity from the East side, Greenway below Montgomery Street, that are that CB3 had serious concerns.\nIt should not be considered a contiguous pathway until those issues are resolved, including the fact that there are multiple crossings, including Delancey and Houston, which are very dangerous and require people to transverse those streets, then East or West to make connections with these other bike.\nAnd Greenberg has looks like has expressed some concerns about the configuration on 20th street and a rearrangement not executed was worked out with the city.\nI've seen that so I understand what you're saying and we will be looking at actually early next year at that presentation for the rearrangement of 20th street.\nWe're going to try to carve out as much space as we can, There I think the goal is to provide enough space for bikes and joggers, and anyone who wants to you know use the space recreationally during construction, okay and also Sean.\nIt looks like you wanted to answer: Andrea Peterson's question, but it's about Houston Street, so I'm not sure about CB3, but we have a.\nLarry, please, okay, I'm, going to bring back up a long-standing request for improved signage, along Avenue C from 14th street, directing people to the ferry stop which doesn't currently exist and with the construction.\nI. Think it's even more important to let cyclists as well as pedestrians know that the ferry is going to still be in operation and D.O.T needs to work with DDC as the access way to the ferry changes during the course of the project to modify the signage and then to bring it back at the end.\nI'd like to propose that we do a resolution in support of this particular extension to the CB or to the Avenue C Bike Lane.\nThen the Aster Levy, Playground and solar one area where we are starting work, The, Pa2 construction, area, Just, a quick reminder: I, don't know if everyone attends the land use committee presentations, but phase two will be phased in three different phases, so ask for Levy Park had started on November 16th.\nStey, Cove Park will begin fall, 2021 that will be completed in two phases and then the area around Murphy brothers in 2022, so just a reminder that the pa2 is a phase construction and again right now, we're in the mobilization and site preparation, phase of project area, 2, So, pedestrian access right now for ass or levy handball and track access is on East 25th, street.\nAs we get closer to the Seikov Park phasing again, the contractor just came on board, so their phasing for Psychopark has not been finalized yet, but we will say that the pedestrian access, while we're doing the flood wall work at solar, one, will remain open and again, pedestrian detours will be communicated in advance of closures for bicycle access until the Avenue C Bike Lane comes on board right.\nThis is the detour for project area two, so it's Houston, Street and then first and second avenue.\nThe three locations are at the northbound start of the detour at the southbound side of the detour and then signage at the ferry landing areas along 34th street, we'll also add pedestrian scale signage as needed, and we're looking at other areas where signage may be appropriate for this detour.\nWe are working closely with DOT, as they said to you know to make that happen.\nI understand that, but at the same time you know we're talking about shuttling literally thousands of cyclists across this corridor or up Avenue C one way or the other, and this has been coming for a long.\nThis is kind of a meaningful project, we're talking about by your own numbers, at least a couple of thousand bikers a day who are going to be having to use this car to or else find their own ways, which is something that none of us, particularly wants.\nSo I think if this is definitely on the top of our list for next year and hopefully in the early spring, we'll be able to give you an update on what our resources look like and how early we'll be able to get it in, but we certainly understand the need for it and the desire to have it as soon as possible.\nSorry like this, Like, I'm referencing, You know like the Midtown tunnel like this work is being done, but like it's not synced up with like bike lanes, and it's just it's bedlam, and this is another example where I get the contractor wants to go to work.\nAs I'm heading south, You know toward the East, River, Park, sure, Andrew and I.\nIf there's, If you guys, are going to mitigate that somehow, because, like there's, no way New Yorkers going to follow your rules and b, you know, especially with Covid-19 right.\nAnd I think we have had conversations around Covid-19 as well and kind of taken a look at what other parks and pedestrian areas you know are doing.\nThe bicyclists are to use the bicycle detour again, like Andrew, said it's, you know.\nThis is why the pedestrian detour makes more sense than the bike detour, I, think to the entire board of CB6, and so again, I'd like to urge you to reconsider what it is you're doing as quickly as you can, because what is going to happen, as Andrew said, is that people are not going to take the route to first and second avenues.\nYou're, asking the contractors to actually do sure sandy thanks for the comment, I think around the solar one building there.\nCome back with what that area could look like I think that would be really helpful for us to understand what it's going to be.\nI, think that would go a long way in terms of ask asking you know: repetitive, questions, And I think it would really broedcast the right information that people are looking for on that site and so with all with the monologue being over.\nBut you know to ESCR, like you guys need to make that crossover too and sorry just to comment on that.\nYou know assume that the questions that were raised in the land use committee are going to be this sick kind of at least overlapping, with the concerns in this committee, and so, As you are preparing a presentation for one committee or the other think about the questions that the other committee has asked.\nOkay, One of the questions you know, I guess in certain ways might be more relevant to the previous presentation, but Scott Baker was asking was saying: First Avenue is in a distant territory and up Houston at that which has no bike.\nWell, That brings up the question: Why don't you detour on 20th and actually Ben Jacobs, who I think you know.\nSo in terms of the reroute, You know we can look at this again and figure out if 12th and 13th are a better option, but I think the question, maybe that some folks are trying to get at is, Will there be access north of 23rd.\nIs that the question like will the greenway and the pedestrian area be contiguous from 23rd south.\nIf you have a preferred route as opposed to East Houston Street, you know the greenway will be open and we can update this.\nI think we can we're going to be dealing with the 145 East 15th street issue later under old business.\nI, don't know what the service road FDR drive means in this particular area, because there's Avenue, C, there's the FDR drive.\nThat is if DOT maintains the lighting and what next steps will be in terms of paving the area that I'm also looking at, but even if we are able to pave and if that's under our jurisdiction, that's not going to be done this year, because our paving season has completed just so, You know, but I will confirm.\nThere are people, I know have come to this meeting at least three of them, who want to speak to that particular issue.\nNot working and Brennan has asked me for 311 reports and the like, but Colleen do you know anything about this Brendan.\nShe, said, CitiBike, installed, 81, bikes in front of 145 East 15th, street."
        }
    }
}