{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCLUUVuEvQ0z1RD588CAiHpw",
            "title": "2020.09.01 - CB2 Economic Development \\u0026 Employment Committee",
            "publishDate": "2020-09-04",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nEconomic Development \\u0026 Employment (ED\\u0026E) Committee\\nTuesday, September 01, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Welcome \\u0026 Process\\n00:02:00 - Roll Call\\n00:04:30 - Approval: Agenda\\n\\n00:04:45 - Discussion: FY22 District Statement of Needs \\u0026 Budget Priorities\\n00:08:10 - Discussion: ED\\u0026E Statement of Needs Working Group \\n\\n00:48:45 - Approval: June 2020 Committee Minutes\\n00:49:30 - Chairperson's Report\\n00:50:21 - Community Forum\\n00:59:20 - Motion to Adjourn",
            "lengthSeconds": "1:00:11"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "lOPPNtPmc6M",
            "fillerWordCount": {
                "uh": 119,
                "um": 124
            },
            "readTimeFullTranscript": "31 min read",
            "readTimeSummary": "4 min read",
            "wordCountFullTranscript": {
                "business": 21,
                "businesses": 20,
                "program": 19,
                "member": 11,
                "list": 11,
                "grants": 11,
                "housing": 10,
                "outreach": 10,
                "grant": 10,
                "budget": 9
            },
            "wordCountSummary": {
                "business": 7,
                "grants": 6,
                "budget": 5,
                "businesses": 5,
                "work": 4,
                "neighborhood": 3,
                "term": 3,
                "program": 3,
                "spaces": 3,
                "artists": 3
            },
            "fullTranscript": "Okay, are we good okay, excellent, okay, hello everyone? This is. My name is Bill Flenoy, I'm the chair of economic development and employment committee. Today we're going to start the meeting at 6:11. I believe we have quorum before we get started. I want to do two things. One I want to introduce our New Board office liaison Talia Miller. Is that correct financial name correctly? Taiya Miller hi, everybody? Okay. Could you just want to introduce yourself to you? Oh sure, I started with the district office in March. I was have only been able to attend one live meeting so far. I invite you all to bring your faces to the meetings. I'd love to meet you in person. We've had, I think, 20 online meetings at this point and they're going just great so feel free to reach out. If you have any questions. Okay. Thank you. Okay. Now, as far as the online meeting protocols for right now, the only individuals who are will be speaking at these meetings will be committee members or board members. Okay, the public. Unless I ask you will not be speaking, I'm going to mute everyone and keep you muted. Okay, until I ask for discussions at that point, committee, members and board members will only be able to discuss or talk. If you have any questions, you can submit them in the chat, okay and I'll be notified. If there's anything that I need to refer to or actually take any action on. Okay with that, I will now go to the committee members, okay, and I will ask committee members to now introduce themselves. Okay, if you want to let them introduce themselves, okay, starting with my vice chair and going down the line from there Denise Peterson culture, economic development and employment Committee. I hope everyone is doing well and staying safe yourselves as well as your families, catherine hey. This is Catherine Gilman acting secretary for the committee happy to be here and to see and hear all of you, okay, the other committee members just step in Ron, okay, Kate! You would you want to introduce yourself hi, the other one's faces, who I can see. I'm Kate Young, I'm a committee member and General Board member and I hope everyone's had sorry for the background noise once had a as nice of a summer as possible and hey it's great to meet you sorry. It has to be over zoom, okay, let's see now Jessica Karechi Committee, member and General Board member, okay, Latrell, okay, I think she's having problems Committee, member and board member okay, Lindsey hi. This is Lizzie Einhorn, Committee, member and board member okay, you showing what I'm missing hi I'm Maisha, Morales Committee member and General Board member nice to meet you taya and hello. Everyone, hello, okay! Is there anyone else that not called on okay, excellent? Okay with that tonight we're going to be discussing the state? Sorry, first, I need approval of the agenda. I may have a motion. Okay. I have a second okay, all in favor, aye, okay, perfect! Thank you! We'll go with that tonight. We're going to be discussing the statement of community district needs and the Committee Board budget requests for fiscal year 2022. Hopefully, everyone got a chance to look over the information that was sent out to what we're going to be doing right now is we're going to be going through the different items? First off we're going to make some suggestions of the things that we might want to remove from the statement of needs and budget. Okay, when we first looked at, there were only four items that we wanted to remove: okay, either because they were funded or because they were not funded, and we want to go from there if you want to be able to pull up the. Thank you. Okay, as you can see here, these are the most important issues related to what we're looking at right now, youth education, but we want to look at ours, taking you to our section, okay, just to explain why this looks a little bit different. The categories in the district statement of needs that the city produces are a little bit different from the titles of the committees in our district, so you'll see that land use housing and economic development are all clumped together for the purpose of this report and that's the city's choice. Yes, I've seen that also, and I reached out to Rob and asked them about that, how we're going to submit our individual requests and we can do it on individual basis, even though the city may actually help them together. Okay, we're looking at here right now, as you can read the significant economic activity in Brooklyn. The county are listed here. One of the things we're looking at right now is based on what's going on throughout the district and throughout the country as we're seeing a lot of change going on. As far as a lot of people are unemployed, a lot of people are not working. A lot of people are currently working from home or basically facing a situation where they're not these are unemployment or your unemployment has now been cut off. We're seeing a lot of small businesses that are closed and we're not seeing a lot of businesses that are going, who no longer be able to work. Okay, we're actually closing for good. So with that in mind, we're going to be focused on what we can do for the district based on that information, we're going to be focusing on things along the lines that we can actually do without a lot of working capital and basically something that we can do as far as doing outreach to those individuals who need it most right now during these stressful times. So with that in mind, okay, I'm going to continue to go for it. Is there another item here? Okay, are you asking for input on what the overarching statements should be? Is that yeah I'm going to be asking for that? Also I'll tell you what, since we had a working group and that Working group was working on this for a little while I'm going to ask Lindsay to start off with this, lindsey want to give some input here on what we've discussed so far sure also Taina, I'm wondering if we can share the documents that we've created to date with you during this meeting, so that you could share your screen with everyone and everyone could follow along you mind just putting your email in the Chat box. I actually do not have any other documents other than this. For this meeting. No, I know we would like to share additional documents that we've created in preparation for this meeting. Absolutely no problem drop my hand Lindsay I'll, I'm pulling out down off the cloud and I'll send it over. So I think just to reinforce what what bill was discussing is that we've been talking about short and long- term recovery from Covid-19, as well as the pre- existing needs that existed prior to Covid-19, but have only become exacerbated by this disaster, and so within that we'd really like to think about unemployment. Support. Small business support attracting new business to the district, and we also would like to talk about housing, and although we share that with land use, it's come to our attention that land use might not be drafting as many budget priorities. Capital needs as well as need statements as we are, and so we'd like to contribute along that line of effort, and so, in addition to talking to you guys about some ideas that we had. We also want to solicit your feedback as members of this community. We're all really invested in this, and so, while we've spent a lot of time and research and thinking through some of these ideas, it's really important to us that we come to a consensus, because it's going to be on us to advocate for these to be prioritized at the General Board Meeting and with our general board members- and I think we know from previous years that unless we really get that critical mass and get people on board with these ideas, some of them may not move forward. And so it's just really important to keep that in mind that we want to get as many forward as we can so that we put economic development as one of the as having like a large, the largest block of priorities and budget priorities, because it's such a huge issue right now as part of this Covid-19 recovery, did you receive by any chance the email with the with the items that we wanted to put up on the screen? I have not received any email, okay, Lindsey just go with. If you actually, if you have the document, I can make anybody on this call the presenter which might be faster. Oh okay, catherine, I'm saying I'm sending it to you right now. It should. It should be here in your inbox in like 10 seconds, did you get it lizzy in the meantime, begin your discussion and when she has it she'll post it okay. So I do want to mention that a lot of the items that we voted on last year and approved for inclusion did not make their way into the document, and so we've re- included them this year and we'd like to have a discussion about if some of these are still high priorities or if some of them have moved down the the list a little bit so one of the ones that was included last year, that did not make it on was a buy. I love your local campaign, buy local hire local, and this was one that was ranked right at the top when we voted last year on priorities, and so we thought it was good to include it again. This year there were also three budget requests for the 360 commercial district needs assessment and the grants and fellow program that was combined with that needs assessment. So you may recall that SBS came to the committee last year and presented on the needs assessments that they were conducting. It was to also provide opportunities for local neighborhood, revitalization, with recommendations for merchant, organizing public programming, district marketing and branding, and the grants specifically supported that, so the grant provided a consultancy for anyone who wanted to create online merchant, organizing and considering how important an online presence is in response to Covid-19. I think that this budget priority could be really beneficial to a lot of our local merchants. In addition to that, if you were awarded a grant, you also got a fellow, and so the fellows are there to support building this marketing campaign the revitalization projects and to have that additional staffing support, coupled with the grant it makes for a really well-, rounded program. In addition to that, we like to look at small business repair and reopening grants and loans, as part of both the short- term and long- term recovery from Covid-19. We know that we're going to lose local businesses, but we would like to stem that bleeding as much as possible. We'd also like the city to continue to consider funding business, incubator programs, specifically one for downtown Brooklyn. As small businesses share resources, it can become more affordable to stay in the district, and so if we provide a space for shared resources, affordable workspace options, it's going to foster innovation and creativity as well as ensure that some businesses that can no longer make it on their own have a place to go if they can downsize and continue their business. We'd. Also like an a small business incubator program, that's bisector and focuses on mwbes, as well as a small business, digital expansioning and marketing grant outside of the community district. The grants that I was describing before, mostly because those grants are very area specific and would not be for the entire district, but would be by neighborhood, and we would not expect the entire district to be granted a grant. We also would like to consider having local, small business, recovery, toolkit and virtual learning program. So a lot of the resources and basically the tutorials that have been given, have not been turned into or transitioned into a long- term teaching tool, and so we think it would be really great if some of these tutorials were saved for longevity, because this is, as we know, they're going to be many waves. We also think it might be good to do a marketing campaign for Brooklyn workforce one career center, especially to with their increased online presence. We want to make sure that they have increased visibility in the community, not only for those who are unemployed, but also for local businesses. As we know, this is a critical resource. At this moment there was also one for providing funding for employment programs aimed at reducing recidivism and then also reopening the Franklin Avenue C train entrance on Clausen. We know that in 2015 MTA released a report that the Ac line that reopening this entrance would have significant consumer benefits and also support local business. I know that this might not be the top of our list at the moment, considering the status of transportation, but it is worth mentioning and considering if we want to prioritize it again this year and finally, from my end, catherine, I'm going to turn it over to you in a second we'd like to expand eligibility for local payroll grants to cover companies with five or more employees. A lot of these grants are focusing on larger businesses that have 10 to 15 employees, whereas some of these smaller businesses are still the lifeblood of our community and so ensuring that they're folded in to these programs and are eligible could be huge in ensuring their longevity and Catherine Gilman. You have a couple that you'd like to present on as well. I do I can. I can take it up from here, so the last few, for you guys to consider and lend your feedback on one, it's a voucher program that can help try to alleviate the housing and eviction crisis in the borough, both in residential and commercial spaces. For example, this kind of programming might mean the voucher goes to close the gap between total rent and a percentage of a household's adjusted income or goes to reducing and waiving late fees in commercial spaces. It might be a voucher program to help maintain small business businesses, in particular in their existing commercial spaces, and another option we were looking at in our budget is funding a Brooklyn makers, design competition aimed at putting local artists and Brooklyn local makers to work within urban renewal and creative place making on our streets. So this means a way that we can spotlight local neighborhood culture, local small businesses and community heroes with the work of local artists, and this kind of competition would allow funding for the artists supplies to create things like murals partnering, up with maybe vacant retail spaces as a way to lift the neighborhood, and that would be in partnership with existing organizations like the bids and New York. City DOT programming, allowing for things like a public voting option so that the designs and the themes are chosen by the neighborhoods themselves. So the art is always buying for the people. Another potential project would be funding a Brooklyn, maker's street craft Fair and basically using a public space or a private outdoor space like a Brooklyn, pier for something like sales of local makers, goods in a Covid-19, safe way, so saying you know once a week or once a month, those spaces are designated so that these people can actually sell their products and they do not need a retail space to do so. The last item on our list is another voucher incentive for small landlords with empty retail spaces, who are going to allow flexible short- term leases for local mwbes as a way to try to help attract entrepreneurship within our community, especially by those persons. In the wake of all this retail vacancy during and post pandemic, and to also help small local landlords try to stay afloat in partnership with that effort, and that is the full list. I think what we wanted to do was ask first for feedback, and then we had created a small agenda for a facilitated discussion to solicit additional ideas. Okay, thank you lindsay, okay for right now for the committee, as it's just been suggested, we want feedback about the suggestions made and any suggestions that we did not make. I would like to hear from you if you can signify okay, if you're interested who's that Miss Peterson- oh hi, Miss Peterson, please, oh hi, good, to see all of your faces. Oh my god, I miss you guys so much. I hear the babies in the background and all of that, and so it's great for us to get together. But what I wanted to ask is a couple of things one I am. I support small business initiatives I think, is, I think it's great they're going to need a lot of help and and we should seek to try to help them the best way that we can through making some of these things mentioned. You know a priority, but I want to add on another priority and that has to do with the tenets that are in these NYCHA developments within community Board. Two that I'm not hearing too much about in terms of how do they link into all that was said. I'm always concerned about them, because there is a need there that we must to keep a focus on, because they too are a part of this district, and so, if anybody could answer that that that's sort of my first response and and question all mixed in there together can for the great team that put the items together. Can anybody speak to that Well Peterson makes a suggestion. Do you have any ideas yourself? How we can do the outreach? Well, it's well. One of the things is about the there was something mentioned. I read about an outreach, but I'm just trying to figure out. So what is it? That's a priority for those residents and one of the thoughts that I had when I read the material earlier was. Maybe we perhaps want to consider, including something when you talk about grants, that there could be some grant provided for those tenants to have the opportunity to be sort of like OSHA trained, so the grant would come because we know that based on what happened in the city council, however many months or a year or more, it's a very costly undertaking. Now to be OSHA certified so that if there was some grant money available to organizations that are in a position to certify and have these courses and certify these individuals, I think that can be helpful to public housing. A tenant, most public housing tenants are seemingly not entrepreneurs and or small business owners. So we, you know, perhaps want to see how we can you know, do, make it a little easier or sort of in a co-, op kind of way that they too will feel like they have been pretty, as it relates to what we are seeking to push. So that's one thing. The second thing is so that so that's one example. Maybe that can be considered the C train foundation. To me, I can't really say that it's a it's a priority and, in light of all the other things, that's probably a priority. So probably when I got to that point I mean I would hope that some other committees would think that that's a that's a good thing to have. My last question for now is that when we talk about the items generally that were removed or that have been fun, how do we know exactly if it was funded and completed or if it was just funded, but nothing has happened. How we go about finding out the status of some of the okay. We are actually given a form. Okay in the information that actually lists which different items were actually funded, completed or have not been funded yet so there will be a list. There actually is a list and it was actually in the packet that was sent out. I do not, I do not. I do not. I do not recall, saying it, but okay, so I like to hear what others have to say: okay, denise, this has some really good ideas and I appreciate the one about reaching out for OSHA training. That was very important. We forgot about that. Thank you. Thank you. Is there anyone else who has any thing any yeah bill? I wanted to add something kind of on the same lines of what denise was talking about. This is Jessica. Can you guys hear me? Okay, so yeah no. I was thinking that and I totally echo everything that Denise said. I think that all of the work that the committee did between Katherine and Kate and Lindsay, and especially the focus on the small business and entrepreneur ship within the community, I think that's great, and I think that the way that you have those items worded in here definitely reflects that, and I was just thinking. Maybe we could be more specific about delineating an item specifically that would focus on retraining or providing these OSHA trainings or and even maybe, emphasizing a re- skilling so to say of the general Workforce population in response to Covid-19 and identifying, like what kind of programs are even needed right now to help people find these new jobs. I think I mean ocean makes sense, but maybe that's maybe that does not make the most sense now, because there's also we're likely to see a decline in construction. So I think there's things like that need to be evaluated, but maybe if we can just be specific and have a line item specifically that looks at retraining, reskilling of the Nysha population, slash low income population within our district and determining what skill sets are now needed in this changing environment. I agree, hey bill. Do you mind if I make a recommendation when you say recommendation, this is pretty informal, no totally, but a recommendation to capture Denise's and Jessica's statements. I have a recommendation for how to include them in the budget priorities we're making yeah, you can do it now or we can do it in the working group. But if you wish to do it right now by all means. Well, I want to make sure that you guys know like that or get additional feedback. So maybe I think it's two different budget items- maybe I think, and a way to get more bang for our buck might be to provide the grants to local non- profits, who are already doing this work and to expand their current programming. And so maybe we do one for the OSHA, 10:30 and 40 that prioritizes low- income and vulnerable communities and provide grants to non- profits who are willing to administer the training program, and then we can do another one that is a more general training program for those who have been unemployed due to Covid-19 and be specific about the Covid-19 layoffs as that being, as that being the way to enter the program. Does that make sense to you both? That sounds great to me that captures it for sure that sounds good. I hi, I'm sorry, I I think that's on point as well the retraining and the re skilling. I like that concept. I do think, though, that I'm, assuming that, with the construction industry, there are some construction projects that have sort of been in the works already and they're sort of moving forward throughout the city throughout Brooklyn, and, as I see it as I move around, people are definitely out there and I'm just saying if there's a if a, if ten individuals from NYCHA development go to a work site and say well, can I work and so of course the answer is, unless you have the OSHA certification that you can't so, and I know that, maybe by the time these things are validated or or funded. Who knows who knows what anything will be like by then? And so yes, I'm okay with that, as long as it covers something that is to the benefit of the NYCHA residents in some way, okay, and then I just want to add too that Lindsay, I like the idea two of the not- for- profits, but someone has to begin to show us what that looks like. So, if a not- for- profit, you know sort of like oversight if the not- for- profits get a million dollars. Hypothetically and I would want to sort of follow in some way and I'm not sure exactly how that would be, I would want to follow if that is designated for Say OSHA 40. Well, what was your outrage? What were the responses based on your outreach and who was exactly sitting in these in these training sessions, because I think that's important to know because we can, you know, support money going to certain organizations and institutions, but if the people who I'm specifically talking about, if there has not been any very effective and on the ground, outreach they once again do not know about it, then it gets. Then it gets a little shaky. So then we'll have the grants then would have been given to the benefit would have been gone to people who could maybe afford it depending on what that means in this, in this pandemic, are we in so I think that part is important, that we have to know that there's some oversight to know who's been included, and why and when and how? Okay that's in that's important, too. I agree: Mr Peterson, one of the biggest problems we've always had is how to do the outreach we've been trying to figure out ways to do outreach since I've been on this committee and it's been a problematic since day, one and I like to figure out a way to actually get this information out to the people. He need to have it one day, we'll figure it out, so that the information is out there efficiently and basically comprehensively to all the individuals who need it. Is there anyone else who has any suggestions from the committee? It's Kate. I was just going to echo the feedback on Nysha specific support. I think that's a really vital piece that we're putting in here and whether that's through OSHA training or what we can identify as the most seamless way to get people reskilled and back to work. I think that'll be up at the top of the list, at least in my in my mind, believe so we just want to add to that, though. Let's remember like how long the list is the waiting list to get into a nature development, and I think if we make our strategies a little bit broader, we might be more impactful, even because we'll be expanding the pool not just to NYCHA but to the vulnerable people who really qualify for NYCHA housing, but due to the lack of availability, have been unable to get it yeah lindsay. That makes that makes for something. I'm sorry no go ahead. Denise! That's a great! That's a that's a good point, but I'm not sure. I know that at Farragut houses there are 1400 doors and those and those out of those 10 buildings, and so I'm not I'm not too clear on the people who are on the list waiting to get into nature, you can have categories. If there's enough grant you can you can open it up, but there ought to be a priority for the people who get oftentimes left behind and excluded or not included in the way that they should be in terms of whatever marketing outreach. Whatever all of those elements are, but it's it gets said over and over again about how it just oftentimes do not seem to touch touchdown in those in those places between Inglesol, Whitman and Farragut are the other developments. So, as is atlantic terminal, and so we do appreciate that Mr Fennoy talk over and over and over and over and over. But I can only add that I think the way that you really do outreach is to hit the ground in those places or you link up and partner with people who are already on the ground. I.E Tenant, Association, other tenants and the and I'm saying so so it's you know all the points. All the points are good points, but I'd like to see a real focus there and if, in fact people seemingly are not interested, then if you do the, if the outreach is done very effectively very strategically, then you can say well. We spent five saturdays in the street and only five people signed up, but if you do not send no, if you do not spend any time there, not you personally, if there's no time spent on the ground on the ground on the ground is key to the success of a lot of things. If there's no one on the ground to make sure that the people are so notified as to what is going on and encouraged to participate, is it does not really yield, does not necessarily yield much, and I think the organizations, for example, who may be eligible and be willing and excited about receiving some just such a grant. Should that be so that they too, the fact that they would get this hypothetical one million dollars or whatever 20 or whatever it might be, that they too would need to be a part of a conversation about. How do you now get the people inside of this program? You know what I'm saying so anyway. So, let's so, I just wanted to say that thanks no promise, Peterson, oh the things you're talking about are action, items that if, in fact this is approved, we would then take a look at and it's definitely something we did look at irregardless actually yeah, that's not a word. Okay, anything from the board members any input again any input, any board. Members do. I do have something to add, but I was on mutant. I could not figure out how to unmute it. Can you hear me now we can hear you John, okay. I would like to address a couple of the issues that have been raised, but before I get into that, I have to first submit that you and Miss Peterson have done a phenomenal job and in this very brief period of time, I've learned a lot more about what goes on in your committee than I have in the previous two years. Thank you for that. That speaks to that issue of communication. You know I'm overall, and those of you who are on my email list know that I believe in communication and getting people at least on the same page, all the same information. So a lot of what I've heard discussed here, I would like to bring back to the transportation and public Safety committee, particularly as it relates to those specific issues, class and Avenue, we've never discussed. We need to have a format bill that includes all of the committees in a much more meaningful way, so that we are working together towards the same goal, pretty much trying to be on the same page and from my perspective, that does not happen enough now. So in order to improve our success rate, we all have to be on the same page. If I could just say a few words as chair of the myrtle Avenue business improvement district. We are dealing very intensively with all of those issues surrounding businesses and the closures and the openings and the funding and the whole like. We have set up a program of donations where we give up to three thousand dollars to any small business that fits the criteria that we have established. Most of the businesses on Myrtle Avenue are small businesses. We have only a couple of the national chains and minority owned businesses, so we need to share that bill with you and denise and the entire committee, because we have had some degree of success at this point. We are upwards of 90 percent of our businesses reopening in since the pandemic began. We were down to slightly under 50 percent. We worked in conjunction with the Brooklyn chamber of commerce and we came up with a program to fund those small businesses, so that works. So we got something that works. We can get that detail and see how we can be expanding it in the district and my other question was, as you talk about small businesses, we have these bids in the downtown Brooklyn area. Are you talking about those businesses also, or is this just the businesses that are outside of a district, because the district would pretty much be taking responsibility for all of the businesses within the district, and certainly the partnership does all of the downtown Brooklyn small business component in terms of communication for the public housing developments, the myrtle bid also sponsors a food pantry program that covers all of the developments that Miss Peterson mentioned earlier. So I'm not going to mention that I'm not as versed as calling their names as Miss Peterson is. However, we have contacts and we are talking about other programs to expand services to those for developments. In fact, yesterday we were having a conversation about how we reach in our food pantry program, the folks to get them to vote and to do a whole host of other things that you like to think everybody knows, and everybody does not know, and even if they do know they need to be reminded, and if they need to be reminded, then they need to get back to you to let you know what they've done. So we have to actually really work in that development and it's not enough to do it once you have to constantly go back. You have to demonstrate the success to get more buy- in so bill. If we could work with you and denise, and maybe I could have our district manager meet with you just to give you a sense of what we have done for the small business program on Myrtle Avenue, which has been pretty successful John. Yes, I would definitely like to have that discussion with you. As a matter of fact, I'm currently also looking to talk to the Brooklyn chamber of commerce and also the bids throughout the district, basically follow the same path that you currently are doing right now, if you can send me that information of what you've done at Myrtle Avenue, I would definitely appreciate it because I want to basically take that same program or that same model and then reach out to all the other bids. I appreciate it. I won't send you a program, but I'm going to send you the minutes and that'll. Pretty much give you an overview of what the program was designed to do we're having a meeting in September at which we'll have more detail, and certainly once we finish that meeting I'll share that with you also. So you could see specifically what is discussed in terms of how we feel that program has been successful, we're actually very happy with it. We include Pratt and St Joe's college in it, because their student base is very important to the avenue and that's it's just worked as far as the other item that you mentioned, which is basically getting together with all the different committees and basically trying to get a complete working together to get a overview that we can work with as a unit. I have discussed that also with the board office, you discussed it with the board office. What is the feedback? I discussed it with the board office well, and it may or may not be something we can move forward with, but I have mentioned it also do not know what we're going to do from there. Okay, so any other suggestions from any board members. Okay hearing another discussion: what we're going to do is take it to advisement all the suggestions that have been made right now. I have not heard anyone mention anything other than the C train. As far as objections are there any other objections to any of the recommendations that are made good, I'm sure, in addition to that, what about working training just I love anything else, yeah anything else. Okay might be helpful to mention that we plan to vote on these to prioritize them. Yes, let's go to get to that. Okay. First, I wanted to see if there's anything else from the committee or board. Okay. What's going to happen now is myself Lizzie, Einhorn, Kate, Year and also catherine, okay, we're all to get together and work on. This catherine has is new to this, so she has a lot of new ideas and I want to basically hear from her also but Miss Ihorn and Miss Yearwood young have been doing this for quite some time. That's why I wanted them to take the lead on this and just explain what they've been doing for the last two years. Okay, so what we're going to do now is over between now and the next meeting, we're going to basically work on suggestions and then come to the next meeting in November we're going to vote. Okay, basically priority of the suggestions and basically, whether or not the committee feels a suggestion should be still included with that. We'll next go to the next item on the agenda. Okay, I need approval of the minutes from June, 2nd 2020. everyone. Hopefully everybody got a chance to read it. You may have a motion. Actually I do not need emotion. I just need someone to say. Yes, I moved with that. We'll just accept that we're written okay- and I want to thank our secretary for preparing them- did a very good job with them. Okay, as far as a chairperson's report, currently right now, the exec committee has been addressing any sorry, it's very it's very, not here. Okay, as far as far as going forward as far as Exec committee we've been handling anything that's come up as far as any action reports or anything that has to be taken care of we're actually voting on those things and going forward. I do not know how we're going to work going forward from here whether it's still have a board meeting or not, but that's something we're looking at going forward: Community forum, okay, of course, other business. Is there any other business that any of the committee members would like to bring up? Well I'd like to thank, however, the Community Board Office Canada can assist. So I was at an event: oh public housing. They had a really big event on Sunday the Taj Gibson Foundation had some basketball tournaments Taj Gibson had the basketball court, he did the basketball court, it's a beautiful basketball court and it was a whole day of activities there in terms of tournaments and the likes, and it culminated and I believe the police were playing one another. It was an excellent community event, but in the in the there was different discussions and one of the things that was said was that you see all of the work that is going on down there. I I'm assuming between both Ingersoll and Walt Whitman. I know for the english oil side because it was said, is that apparently, when they put up this netting and all these different things and prep to do what needs to be done, I planned well apparently did not think about all the surveillance cameras, Dennis you're, breaking up. Yes, we lost you, camera's health development. That's requiring this that we can sort of relay to the Community Board office to sort of get a conversation started as one of the places, because I think it's so critical in light of many of the issues that they're having down there now and there's a security issue, if there's no surveillance cameras, if they've been blocked and or I do not know that they've been taken now so much that it may just be blocked and there there's no use for them at this time that they're under that they're in a very bad place without minimally having working surveillance cameras. So I just wanted to sort of put that out there. It was very concerning for me to hear that and that, if they did not consider that during the course of the planning, then that's a problem, because people deserve to feel as though they're safe to some degree. But you know there's no cameras there, so people are wondering like. So how does this work? You know, but it's safety, and so I just wanted to put that out. There denise have you said anything in writing to the board office. No, I have not I just Sunday. Just two days ago I heard about it. Okay, I'm going to show you I can I can. I would address that because that is an item of safety, and a lot of that is very important. Right now, currently in the district denise I'll make sure that Carol Anne church administers the transportation and public Safety committee gets that note. Thank you, okay, denise you're breaking up a lot. We can't really hear you if I could just comment that there that's what I'm trying to do. It should go to the council, member and also the state representative, so that everybody's making telephone calls to the respective public housing security division of NYCHA to get movement. They need to get inundated from all people possible because that's how we get priority and get things happen very true and suffice to say Mr Flannoy Local news. Let them do a report on New York, one that has pictures of the public housing projects cameras covered because we had a shooting on Myrtle Avenue, as you are all aware of. So that means automatically there's a focus. Let's take advantage of this focal period as unfortunate as it is and get all of our folks who are responsible to weigh in with NYCHA, and I have not been down there at night so or to even see, or today it was it was, it was a fairly relaxed. It was a good, reliable source who just happened to be having a conversation with me, and that is what was said. So I'm just relaying information. I can't tell you that it's a fact, so I think the question. Is it a fact and if it is, then of course all of those people need to be put on notice if they have not already been put on notice, so that I do not, I do not know the part b to it. Okay, thank you, denise, okay, another two, more items here that I'm going to bring to the attention of the committee and all the board and any of the individuals who are currently still here at the meeting. Brooklyn Navy yard has two items that I want to report. They have current opportunities that are available between August 26 and September 9th. Currently, they have a cabinet maker, physician driver, fabricator, director of partnerships, security network and administrator marketing and communication manager, electronics, Technician Wiring Technician and a technical writer assistant okay to reach out to them. That's the Brooklyn Navy yard. That's the at the employment center. The number for the employment center is 718- 907- 5996 into the addition to that. The Brooklyn Navy heart has a virtual information session. That's every Tuesday at 10 am contact a recruit at Bnydc.Org, or you can also call 718- 907- 5996. Again, that's every Tuesday at 10, A.M. Okay, with that we have no other business. I had one other thing for other business: apologies. So about a year and a half ago we started discussing social media protocols and I think considering some of the conversations we've had about how difficult communication is and considering that we're not all going to be together in person with general meetings where we're usually sharing flyers and announcements. I think a lot of that is about to change. I think it's an incredibly timely proposal to take up again and I wanted to raise it to the committee and I plan to raise it to Mr Singletary as well as at the general meeting, but I do not think we've there's a more important time that we could take up that issue again agreed community forum. This is for non- committee members. Only is there anyone in the community that would like to speak for two minutes. Okay, I see nothing in the chat. Okay with that I'll now go to ask for a motion to Adjourn, hello, okay, second, okay, just wave and okay, excellent. Okay with that meeting is adjourned, it's 7-eleven, hi everybody good night. I want to thank everyone that did work for the committee of Working Group, and I also want to thank our host for hosting us into this meeting. Thank you without you. We could not have done this thanks. Everyone. Thank you. Thanks, Paul and hey bye-, bye.",
            "summary": "I have a second okay, all in favor, aye, Okay, We're, going to be discussing the statement of community district needs and the Committee Board budget requests for fiscal year.\nWe're going to be focused on what we can do for the district based on that information, we're going to be focusing on things along the lines that we can actually do without a lot of working capital and basically something that we can do as far as doing outreach to those individuals who need it most right now.\nSmall business support attracting new business to the district, and we also would like to talk about housing, and although we share that with land use, it's come to our attention that land use might not be drafting as many budget.\nSo it's just really important to keep that in mind that we want to get as many forward as we can so that we put economic development as one of the as having like a large, the largest block of priorities and budget priorities, It's such a huge issue right now, as part of this Covid-19 recovery, did you receive by any chance the email with the with the items that we wanted to put up on the screen?\nIt was to also provide opportunities for local neighborhood, revitalization, with recommendations for merchant, organizing public programming, district marketing and branding, and the grants specifically supported that.\nWe like to look at small business repair and reopening grants and loans, as part of both the short- term and long- term recovery from Covid-19.\nI know that this might not be the top of our list at the moment, considering the status of transportation, but it is worth mentioning and considering if we want to prioritize it again this year and finally, from my end, catherine, I'm, going to turn it over to you in a second We'd like to expand eligibility for local payroll grants to cover companies with five or more employees.\nIt might be a voucher program to help maintain small business businesses, in particular in their existing commercial spaces, and another option we were looking at in our budget is funding a Brooklyn makers, Design, competition aimed at putting local artists and Brooklyn local makers to work within urban renewal and creative place making on our streets.\nThis means a way that we can spotlight local neighborhood, culture, local, small businesses and community heroes with the work of local artists, and this kind of competition would allow funding for the artists supplies to create things like murals partnering, up with maybe vacant retail spaces as a way to lift the neighborhood, and that would be in partnership with existing organizations like the bids and New York.\nThe last item on our list is another voucher incentive for small landlords with empty retail spaces, who are going to allow flexible short- term leases for local mwbes as a way to try to help attract entrepreneurship within our community, especially by those persons.\nI support, small business initiatives, You know a priority, but I want to add on another priority, and that has to do with the tenets that are in these NYCHA developments within community Board.\nWe perhaps want to consider, including something when you talk about grants, that there could be some grant provided for those tenants to have the opportunity to be sort of like OSHA trained.\nI think that all of the work that the committee did between Katherine and Kate and Lindsay, and especially the focus on the small business and entrepreneur ship within the community, I, think that's great, and I think that the way that you have those items worded in here definitely reflects that, and I was just thinking.\nWe could be more specific about delineating an item specifically that would focus on retraining or providing these OSHA trainings or and even maybe, emphasizing a re- skilling so to say of the general Workforce population in response to Covid-19 and identifying, like what kind of programs are even needed right now to help people find these new jobs.\nMaybe I think it's two different budget, Maybe, I, think, and a way to get more bang for our buck might be to provide the grants to local non- profits, who are already doing this work and to expand their current programming.\nSo maybe we do one for the OSHA, 10:30 and 40 that prioritizes low- income and vulnerable communities and provide grants to non- profits who are willing to administer the training program, and then we can do another one.\nAre you talking about those businesses also, or is this just the businesses that are outside of a district, because the district would pretty much be taking responsibility for all of the businesses within the district, and certainly the partnership does all of the downtown Brooklyn small business component in terms of communication for the public housing developments, the myrtle bid also sponsors a food pantry program that covers all of the developments that Miss Peterson mentioned: earlier.\nIt was an excellent community event, but in the in the there was different discussions and one of the things that was said Was that you see all of the work that is going on down there.\nIs it a fact and if it is, then, of course all of those people need to be put on notice if they have not already been put on notice, so that I do not Okay, thank you, denise, okay, another two, more items here that I'm going to bring to the attention of the committee and all the board and any of the individuals who are currently still here at the meeting."
        }
    }
}