{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB14",
            "channelId": "https://www.youtube.com/channel/UCOkywXyXAPDP3E_aykq0XFQ",
            "title": "Brooklyn Community Board 14 October Meeting",
            "publishDate": "2020-10-13",
            "shortDescription": "Tuesday, October 13, 2020",
            "lengthSeconds": "1:01:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB14",
            "normalizedName": "Brooklyn Community Board 14",
            "twitterName": "Brooklyn Community Board 14",
            "youtubeChannelName": "Brooklyn Community Board 14",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_BAkpXTYFoKdHVRvswVgtg",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "lp3_mW97GdU",
            "fillerWordCount": {
                "uh": 236,
                "um": 183
            },
            "readTimeFullTranscript": "32 min read",
            "readTimeSummary": "5 min read",
            "wordCountFullTranscript": {
                "report": 12,
                "school": 12,
                "evening": 11,
                "link": 10,
                "bit": 9,
                "project": 9,
                "students": 9,
                "captain": 8,
                "event": 8,
                "projects": 8
            },
            "wordCountSummary": {
                "numbers": 3,
                "report": 3,
                "bit": 3,
                "education": 3,
                "libraries": 3,
                "budget": 2,
                "training": 2,
                "section": 2,
                "portion": 2,
                "zoning": 2
            },
            "fullTranscript": "The approval of the minutes remain silent and those who are opposed, please raise your hand virtually or unmute yourself and say no hearing a no-, no's or hands- raised. The minutes are approved district manager, Sean Campbell. Thank you, Ed and good evening. Everybody and thanks for your continued patience with this this format and thank you to anya Hoyer who's. Actually, the one keep in attendance and who sets this all up and I do not know it seems to present a different kind of headache every time. So thank you, anya for your patience and perseverance. With this. With this webex forum, we we've been busy, so I've got a few things to report on tonight. I'll try to talk fast to get through it quickly but finished with budget consultations. We met with 17 agencies and now in the process of considering the information that came out of those consultations, working to include them with our agency priorities and comparing them to our district needs for the budget meeting that we'll be holding on October 27th and for updating the district statement and I'm working to reframe that so that we're looking at our district needs in the context of the current pandemic and the urgency of our economic recovery. So it's you know everything. We've asked for in the past years. I may have said this before I'm sorry, but everything we asked for in past years. I would say you know nearly all of it comes into even greater relief when we have a crisis. So I'm trying to underscore that if these needs had been met previously, they would not be as dire and urgent as they are now and speaking of urgent. You know the governor has issued an executive order that creates zones within and many of them are within our community. So we're working to make sure that the zone information is updated on the website and the corresponding restrictions for each zone are up there as well. Community members are being advised to call 3- 1- 1 if they have an a concern, because there is a special enforcement task force that will address the concern. Consider depending on what specifically it is so I know a lot of times when we say call 3- 1- 1. It sounds like we're telling you it feels non- urgent, but in this case the 311 system has been set up to respond to these community reports. This also had an impact on some community events that were supposed to move forward, and so I'm sorry that some of those smaller events were cancelled, even though we had said I think on Tuesday that they were fine and then by Wednesday last week they were canceled again. There are exceptions, of course, for food emergency events, for food pantries and for farmers markets. But again, if you have any questions about things that are going on the street and you want us that- and you want help- please give us a call and if we do not know which we might not, because it changes so frequently we'll work to find out for you. I owe the board a couple of updates one. Is that check it back with borough hall regarding the borough president's proposal to include community input in the selection of commanding officers for local police precincts? It's. I was told that conversation really has not moved forward since we last spoke, but you know, but the request, actually, you know pushed it along, and so hopefully there was movement on that and I did attend a an introductory training for the Youth Council through NYC service and I sent the board a copy of the training and then the link to apply to participate in that no idea that anybody would use the link to apply. But just so you could see what that looked like. It looks very promising and I look forward to continuing the discussion. I guess at our next budget consultation and then offline. If anybody wants to reach out about particulars of that, I also do the Civic Engagement Council is organizing a conflict resolution training in November that they announced today and we'll send that along to the board. I know some of you took part in their training on parliamentary procedure, which means you know how to know how to stop me from talking so I'll leave it here for now, but I do encourage you to take advantage of those trainings and let me know if you have any questions with any of the above or any questions whatsoever. Thanks. Thank you, Sean! Just before the chairs report, it's my understanding that at the 70th precinct we have a new Exo, a new executive officer and that he will be or has joined us tonight, he's on the call. Now. Yes, I'm here good captain, I won't. I won't take a chance on butchering your last name, so I'm going to ask you to introduce yourself sure. Thank you very much yeah good evening, ladies and gentlemen, my name is Stamp Feldstein. It sounds easier than it spells. I'm newly assigned here I've been I've, been here since last Tuesday I took captain Zelikov spot. He moved on to to bigger and better things, so I'm here, hopefully I can work with all of you guys and I live in Brooklyn. Just a couple of things about myself. I live in Brooklyn. I grew up here, I'm around 14 years with the department and I always worked in Brooklyn I started in Crown heights. Then I moved on as a sergeant to fort Greene and as a lieutenant. I came back to Canarsie and as a captain. My first stop was in Bay Ridge, and this is my second stop. So I'm happy to be here, I'm happy to work with the community. My family lives in Brooklyn, so I'm invested in Brooklyn. I grew up here and hopefully we can make it better than it is now. If you have any questions for me whatever I can tell you I can answer, but if I can't we'll take it and we'll get back to you later well, thank you. Captain. You welcome, first of all to Community Board, district, 14 and, of course, welcome to the 70th precinct at board. 14. You will only find friends here. We love the 7- 0 and we love the NYPD so welcome and look forward to spending many productive days with you. Thank you hi captain. This is Gail Smith. I just want to also echo the chairs comments welcome and we look forward to working and partnering with you. Thank you, okay comments from any other board members. It's the questions. It's Joe dweck. I was privileged to meet captain feldstein at the six eight. I we brought lunch over there about three four five weeks ago and it was a delight. Thank you. So much welcome captain. Thank you. Joe okay, say something of course yeah. I would just you know. I know that the police have a lot of things to keep them busy, but this area between, like the corner, the South, I think it's the southwest and northwest, but that section of Coney, Island, Avenue, Foster Avenue H, is just a nightmare. In the late afternoon early evening, cars double and even triple park. You do not know who's coming in who's coming out. If you have to make that turn onto foster. It's really scary because of you're trying to see around double parked vehicle and pedestrians may be trying to cross at the same time, and then you have double parked cars on foster, forcing cars to actually come at each other from opposite directions like a big game of chicken. You know I do not know what to tell you, but it's just it's so dangerous and so scary and someone who lives right there and has to deal with regularly. It's like my biggest nightmare, so just putting out the word there that clearing out the double parking, I think a big issue: okay, yeah, we'll look into it, looks like that area is a is a mask and a food pantry between Damascus is off to one side. It's not right at that corner and that's really has not been an issue. It's where there's a carvel that corner where there's a carvel you've got the now. The bus is trying to turn to head east on foster and and there's that there's a couple of stores and there's a carvel and so forth, and it just gets crazy, yeah well I'll. Have my traffic guys take right over there and we'll see what the issue is see if we can improve any parking positions over there like if the people are waiting to pick up, I think maybe we can direct them to park somewhere else, even if they double park somewhere else, but if they double park somewhere in the area, that's not as as dangerous like Coney island over there there's a lot of traffic. They will do that so yeah, so I'll set him over there just to check it out see if there's any improvements can be made. Thank you for your suggestions. Thank you yep. Once again, thank you. Captain no problem, so the chairs report, I almost said the captain's report. The chairs report will consist of a couple of things. First of all, committee assignments. By now all board members should have received your committee assignment and if you know, if you've not received, please let the board. Let call the board office and make that known or if you know you, your assignment is not exactly what you would hope for. If you know are displeased with your assignment, we try to be flexible. So again let the board office know about that as well, and we'll see what we can do about it. There's been a lot of discussion about revision of the bylaws and you know we we're trying to form a bylaws committee at this time. I it's my understanding that we only have one person on that committee. So if you have real genuine sincere interest in working on the bylaws, please submit your name to the board office and you know we will consider assignment and finally, on September 30th, a public hearing was held online regarding a special permit application that file assurance to section 73- 621 at and 73- 622 of the zoning resolution of the city of New York has amended to request two special permits to enlarge an existing single- family residence, one for the portion located in a residential R2 zoning district and one of the portion located in a residential, R, 3- 2 zoning district. The address is 2328 Olean Street between Avenue N and Avenue, o block six pardon me, seven, six, seven lot: seven, eight psa calendar number, 2020-, 50-b, z and, as I recall, the consensus of the board members attending was to approve and before we take a vote on that, is there any discussion by board members, okay, hearing none? I will we'll use the abbreviated voting technique where so I I'm just going to ask that anyone who is opposed to approval or anyone who well first of all anyone to who is opposed, please let it be known by raising your hand virtually if you know how to do that, if not just unmute yourself and say no. If there's anyone wishing to abstain, please follow that same procedure. If there is anyone wishing to declare himself or herself ineligible to vote on this, please follow that same procedure. Ed for the record. I just want to say that there were no hands on any of those options. Thank you sean, which means that that the vote the board, then is voting to approve, and that ends the chairs report and moves us to well. First of all, before we move on to topical committee reports, are there any elected officials or representatives present good evening? Oh forgive me. Is that nancy? Yes hi? How are you I'm well Nancy? Thank you for joining us as always welcome. Thank you. So should I start off or wait, but nancy we'll have the representatives of elected officials usually give their announcements during the public session after the topical committee reports I'll defer to ed? If he wants to change that, that's yeah, that's the normal procedure. So let's go with that and nancy. We'll look forward to hearing it from you during the public speaking period. Okay, are there good evening? Everyone, my connection is a bit spotty. Can you hear me is that Pharah yeah? Yes, we can council, member Welcome Council member good evening, everyone! Thank you so much chair, Powell and District manager, Campbell and the entire board for hosting today's meeting. I'm just trying to fix the volume here I'll be quick. I wanted to introduce everyone to a new employee. I have his name. Is David Allahan he's having connection issues as well, so once he jumps on I'll introduce him later, but I just wanted to let wanted to let everyone know that we've been tackling the uptick of Covid-19 in the 1121011230 sections of my district that fall right. Dead center in the red zone. We've been working directly with the mayor's office and the governor's office to address it, and we got two location. Two rapid testing cover locations open seven days a week that started as of this week. We made the request a week ago, so 1223 Coney Island Avenue, which is the Midwood pre- k. They have a testing site there. This is a little bit outside of CB14, but scars filled, playground on Avenue, M and East. 38Th is the second location. They have told us that they would be providing another Covid-19 site, but would love to work with CB14 regarding providing PPE in the area so I'll contact you sean to see how we can work on that together. But we all know that cover 19 is still a public health crisis and we want to be able to work with the community collectively to ensure that we could get the numbers down and keep everyone safe. We know that 400 000, rapid testings were provided throughout the whole city, so we we're just happy to know that they've considered us a location where they want to provide additional testing. So I just wanted to share those two locations and let everyone know that we're working diligently to receive more PPE to give out to the community, and we did receive a lot from the governor's office as of Friday and we're trying to get more testing sites and our office is working on domestic violence, breast cancer awareness virtual events this month- that's all I have for now, but I just want to thank everyone for their time and partnership and look forward to working with everyone as we tackle the Covid-19 issue in our community. Thank you. Thank you for joining Us council member. Are there any additional elected officials- or I should say public officials or representatives with us tonight? If so, please unmute yourself and introduce yourself okay hearing nothing. We do have pinkus hiking from the comptroller's office on the line just to acknowledge him. Thank us welcome, I hope, you'll be saying a few words on behalf of Scott Stringer in the public comment session. Okay, to move on to topical committees. The first committee is human services. Is their report from human services? Hello, chair, hi, everyone, Joanne Brown, here, there's no report from the Human Services Committee, but I do have a brief report from the CB14 census: 2020 Complete, Count, Committee Task force. Look how good I am at that now. So I wanted to give you this really great news that, on the seventh, the Ninth Circuit court maintained that we would have an October 31st deadline for self- response and narfu activities. But now I'm here to give you the bad news that Scotus has overturned that and so we're not sure what exactly the end date is going to be. But it's going to be very rapid and it is not going to be to the end of October, okay, so the numbers I'm about to give you could possibly be the final numbers for Brooklyn and some of the tracks in community board, 14.. So I'll. Just very briefly say. As of the 13th, which is today kings County has a has a total self- response and narfu collection count of 59 percent. I have some really great news about one of the tracks in community board 14, which is 508- 04. That's woodruff and Crook Avenue still taken into the lead, 75 response compared to only 64 response in 2010., and then we have another tract which is 512: that's albemarle, around East 16Th, Street and East 18Th Street, also 74 percent versus 64 in 2010.. So in total there are 12 tracks in kings, county that have over somewhere between 74 and 84 of a response rate and community Board 14 has one of them, and that is that Woodruff Crook Avenue, so I'm so very proud of our district. I'm so very proud of the board for supporting this initiative, I'm sad to say that it's coming to a complete halt, but we'll just keep our fingers crossed lovely to see you thanks so much for everything that you do and we're so very proud of you Joanne for all the hard work that you've put into this joanne. Thank you and it's a pleasure working on that task force with you did a great job thanks for stepping up to the plate. I believe Basir Ruhi also has a committee- related announcement. Baza, yes, hi good evening, everyone nice to see you that you guys are healthy and happy. Yes, we're going to have a day of dignity with the partnership of islamic relief of USA, on October, 24th, Saturday 12 to 5 P.M, but the real event we're going to start 1 pm the best time to come. 1 pm and day of dignity will create an opportunity for caring individuals from diverse communities and especially, we are going to arrange for the homeless people and on this occasion a cmw provide the fresh cookie, fresh, cooked lunch and blankets, clothing, Socks, Hygiene kits and free medical care like blood pressure, blood sugar, and we are trying to get some help from any hospital from any clinic for the flu shots or cover testing, and I'm going to advertise yeah and I'm going to advertise this event and shelters, especially in Avenue, H, Shelter and there's two other shelters. So please join us. I would love to see you all. Thank you bother. Is there a website or any place that people can go to get information? Are there flyers or anything? Yes, flyer, I'm going to upload tonight and tomorrow I will also send on the CB14 website. I will give it to you, so you can post on the website and please advise me any shelter in our area in our neighborhood. So definitely yes, I will send you the link. Thank you. So much you're welcome community environment no report at this time, but I've been to prospect parkway, but it's being heavily used by people trying to get some fresh air and open space. This is the botanic garden sounds good. Okay! Thank you, Donald Transportation hi, on September 23rd. We had a joint meeting with the library and Education committee and I guess you'll hear more about that. But one part of the meeting was devoted to a bike lane the around Prospect park, particularly from park on Parkside Avenue from Ocean Avenue to the circle by Coney, Island, Avenue, so th. That is a project that is happening. I think- and there were quite a number of people at the meeting I guess bicyclists and who are generally happy with this proposal and it's they're going to have lanes going in both directions along parkside Avenue and we're going to Sean can tell you we're going to we're going to support this we're asking for more lighting along Parkside Avenue, but the people at the meeting. Viewed this as a positive development right. Thank you, Joel Ed. Can I and Joel. Could I could I jump in a little bit, though sure just to put a finer point on it? The there's a letter has been drafted for the the transportation committee to submit, and it was pointed out at the meeting that so DOT and just so. The members of the public know this, because we did get some comments during that meeting and an email regarding this CB14 was not being asked to approve the bike lane because it was a plan and they were moving forward with it. Whether the response had been positive or not, and in this case at the meeting, as Joel said it generally was but asking for a letter of support when they were going to do it with or without the support seemed a little bit. I'm just shady, but so in that letter, though, there were some points that were brought up like the old bike lane that we had opposition to because it terminates in the truck route and does not have a rationalized exit strategy from Rugby or to argyle from the parade grounds, so that Carson are on the truck route and then on the sidewalk. So DOT did say that they would sort of review the exit strategy and see if they can rationalize a connection through the parade ground to this parkside avenue one and then, as Joel mentioned, the lighting, I took a ride down: Prospect Park South, oh Prospect, Park West, compared to Parkside and Prospect Park West has about double the lights per block segment, even though their block segments are much shorter. So we'll we're going to use this the it's not a support letter so much as it's not an objection letter just try to gain some leverage in those points and if I can stay on this commit topical report for a second too. There was also today a meeting with D.O.T and they invited a few community boards because they now expanding their CitiBike stations into our district, but we're really in phase they're on phase three. Now CB14 is really in phase four, except this one, tiny little sliver along the parade ground. So we're going to post that project up on our website and DOT is asking for community input as to where community members think good stations would be. But we're going to put some language in there just to help manage the community members expectations in terms of timing. The parade ground installations will happen, probably within the year starting in early 2021 and the rest of the project won't move forward until after that year. So thanks for letting me high check the transportation committee port report for a little bit, I just wanted to make sure those updates were in the record. That's thank you. I just like to say for to the board that Sean let it be known that that they should let us know before the fact before they come to us. Looking for approval. You know oh right. Yes, it's what they used to do well, thank you both education, libraries and cultural affairs. Thank you, Mr Chair. This is Steve Calvin. With the report so Joel mentioned, there was a joint meeting on Wednesday September 23rd, with the education, libraries and cultural Affairs Committee with the transportation committee. So Joel already discussed the main transportation item. So in terms of the education related items. First, we had a bet knight from the school construction authority. So basically, what she told us was that, because of Covid-19, basically more than a dozen projects within our borders, our community board borders are unfortunately paused or on hold. The pause projects are constantly under review. She said they're waiting for approval of Office of Management and budget. Once funding has been identified, those projects can hopefully move forward for those projects that are on pause. There's not a target start date because of the city's budget. The current budget crisis and any SCA projects that have been restarted have been reset. They had to put some new safety protocols in place, so there's no completion dates in place for current projects. She also mentioned that ventilation and air conditioning projects have been given priority, given the Covid-19 times in terms of projects that she did have updates for Ps 152 and 315 and Midwood high school. The new Playground school yard and community garden recently opened to the community for Ps 109, there's a replacement of a water heater. That's been restarted, Ps 193, there's a library project, that's been restarted. Ps217 exterior modification has been restarted and ps249. The air conditioning project has recently restarted and his knight clarified, in response to a question that Ps 139 yard work, has not progressed beyond the design phase. That was the first item from SCA. The second item was regarding DOE and we had Devonte Graham who's, the borough manager for Community Affairs Department of Education. This was all before the red, Orange and yellow coding and school closings in our district. So apologies if some of the information feels a bit dated, but we're going back a few weeks. So he told us that he's the board's liaison to the DOE it was. This schools had just reopened, so he and he so pretty candidly acknowledged the school reopening has been a challenge for the DOE, thus far acknowledged. Some things should have been handled earlier and differently mentioned multiple times that getting students, devices has been difficult and making sure students have internet, and the students without internet do not get penalized, has been a priority. They've been massaging attendance policy, given the circumstances he also discussed busing for busing prioritizing special needs. Students has been has taken place. You see that bus drivers are ensuring social distancing. Grading policies are being modified to take into account student situations. He also said if a student or teacher tests positive, the DOE will shut down the school or portion of the school and conduct extensive cleaning and parents will be notified and given an option to switch to remote in the event of a closure like that or in the event that someone tested positive. With regard to a teacher who had tested positive at Ps, 139, Mr Graham said the teacher would be kept out for two weeks and then they'd follow up as to whether they wanted to return in person or do remote instruction. He also told us the DOE has a community roundtable. Every Friday, which Sean said we'd include in the link on our website going forward some additional information provided by community members there's also random cova testing and random temperature checks that are being conducted. There's also, I do not know if this is consistent: acrosss, all DOE schools or acrosss the district, but there's an isolation room for folks who have any covert- like symptoms that occur throughout the school day. So that was the does report. We also had a third item that was kind of a combination of education and transportation, which was about schools, utilizing street space for instruction or play. That was a program introduced by the mayor over the summer and for that actually sean was able to update us community boards do not have a role in the process. It's really a process where schools apply through the mayor and DOT Sean had asked the DOT update us because we want to know about potentially any effects on traffic patterns. We have not heard back from DOT or the mayor's office, but sergeant rios told Sean that he'd notify her. If any other schools applied. As of September 23rd, only two schools in our district had applied. One was ps 134, which later withdrew its application. Yeshiva Flatbush got approved for a closure e16 between avenues I and J a community member told us that ps217 parents had asked the ps217 principle to make use of outdoor space, but basically there was not sufficient staff to justify it. So basically, we decided that the board would try to work with schools on a case- by- case basis to the extent appropriate going forward. Finally, we mentioned this during the committee meeting our peta here, given all that's going on locally, especially with regards to education. I just wanted to extend and my co-, chair, Carl Henry Cesar, wanted to extend an open invitation for non- board members who wish to join the education, libraries and Cultural Affairs committee based on the membership. It looks like we can welcome up to two non- board members to join our committee. So if anyone out there is interested, please contact the board office and we can, you know, get that process going. That's it from our committee. Thank you. Thank you. Steve. Thank you. Youth services. Well, just before. Excuse me just before your youth services we're going to be coming up on our public session shortly. So, if there's anyone who wishes to speak, please put your name and organization into the chat or or email Sean at the board office, so that you can be acknowledged. Youth services, hi, Mr, Chairman. First of all, greetings. Everyone hope. Everyone's doing well and the fall of this crazy year that we're living in just a quick reminder, everyone be sure to vote this coming November 3rd vote early. You do not have to wait till November 3rd just want to put that as a public service announcement. We have no specific report for anything right now and I'll defer to our co-, chair, Dwayne Joseph, if he wants to add anything to this front, but we are going to continue working with with Sean in the office on the Youth Council front, that we were looking at spearheading with the rest of the committees and we're going to you know, look to follow up a little bit more closely with what's going on with DYCD in terms of Internships Syep, Summer, Youth employment program and you know, start having some conversations to get a head start on any modifications that might be coming down. The pike given just where everything is in relation to the pandemic and and then funding acrosss the board because, of course, that's going to be impacted. You know very significantly, depending on the outcome of the election, probably so Dwayne. I do not know if there's anything else, you want to add to that. No, that was perfect Jonathan all right, then I shall yield it's back to the chair. Thank you, John. Thank you. Duane about public safety are either of the public safety chairs with us tonight, and I do see that Steve Ploutzker is here. I'm not sure. If he's able to oh looks like he's on I'm sorry Ed, it's Joe dweck. If I could just interject for a moment that we had at the 7- 0 precinct on Friday a anti- graffiti morning at dorchester any 16th and they cleaned it so much amazing they painted in about three seconds. I'm now hiring Scott Nuzzy from my house. Also. We had a cops and with and coffee on, Flatbush avenue. Last Tuesday. I think it was, and it was a really wonderful event where the cops and community folks just showed up to get to know each other and it was wonderfully intimate and wonderfully informative for both sides. That's it sounds wonderful! Thank you! Joe as v, are you able to get on Sv? We still can't hear you so I'll. Just announce that you and I and Brian Cunningham are working together to try to set up a public safety committee meeting date in November and so we'll announce that, if you can do not hesitate to, let me barge in and then I'll just stall for time, a little bit by reiterating what Steve Cohen said about inviting people public members to the education, libraries and cultural Affairs committee. That invitation is actually an open invitation that pertains to all committees as per our bylaws. So if members of the public would be interested in joining those committees, you should just make that interest known. Thank you Sean. Actually, this brings us to our public comment period board. Members are expected to remain on the call during the public comment period, matters of civic interests and announcements of public events are invited. No partisan political appeals or advertising of for- profit enterprises are permitted. Each speaker will be permitted to speak for up to three minutes and may not receive additional time from another speaker. Speakers are directed to well. I can. I can forgo that the board has an obligation to conduct this business in an orderly manner. Any person preventing the meeting from continuing would ordinarily be asked to leave or and if necessary, escorted from the room by the police. However, I'll just mute, you things have changed. The intent of the public comment period is to permit the board and the community a chance to hear diverse perspectives on public issues. Accordingly, we ask that groups be represented by a single speaker. It is now 7:21 pm and I'm asking sean to please announce the first speaker, okay, I'm going to just give the order of speakers just so that those of you who are waiting know that you're on my list and if you're not on my list, you know to let us know you want to speak. We have Nancy lulu, followed by Aaron Solomon, followed by Lisa Derrick and then Joanne Brown, so go ahead. Nancy. Thank you for your patience good evening. Everyone hope everyone is doing. Well, I bring you this evening. Greetings on behalf of D.A Gonzalez to each and every one of you. I would like to start off by saying in times where almost everything has been changed by the pandemic. Our core obligation at the Brooklyn district attorney's office have not. We continue to work and we continue to hear and prosecute cases to make sure that Brooklyn communities stay safe. Just a couple of quick announcements on Friday October 9th the Brooklyn Da's office celebrated hispanic heritage month. This year's theme was community champion where we virtually showcased the contributions of members of the hispanic community by honoring them for their community service. Three of the Honorees were Dr Francis, Lucerna Co-, founder and executive director of Albuente. We also honored sister Anna Martinez, De, Luca, founder and executive director of sure we can, and we also honored police officer, Edgar Santano from Psa one. If you have not seen the virtual event, you could view it on our social media platform via twitter or facebook. Also, since October is national domestic violence awareness month and there has been an uptick in domestic violence during those difficult times. If you know someone who may be vulnerable during those crisis, I urge you to reach out to them and just let them know that help remains available. At the Brooklyn Da's office. We offer a wide array of supportive services for those experiencing domestic violence in their homes. The phone number to the domestic violence bureau at the Da's office is 718- 250- 3300 on October 15 2020. We will be having a food distribution event in Crown, Heights, we'll be providing groceries and other resources to individuals in need. The distribution will start at 11 and will be held at Saint Mark's day school at 1346, President, Street, Brooklyn, New, York, first come first serve face coverings will be required as well as social distancing, of course, and lastly, I would like to conclude by giving out the Brooklyn Da's action center's phone number. If any individual would like to address a matter or file a complaint. Please reach out to the Brooklyn Da's action center and I look forward to working with them and I would like to thank CB14 for all their great work. I enjoy working with them one of my favorite community boards and thank you for everyone's partnership and be well and stay safe. Thank you. Well, thank you. Nancy Shawn who's. Next nancy you're, one of my favorites too. It's Aaron Solomon from Urban dove Hi 14.. My name is Evan Solomon. It's funny. You say that my brother is actually Aaron no worries at all. It's wonderful to see everyone! Thank you so much for giving the opportunity to speak tonight. As I said, my name is Evan Solomon, I'm on the community affairs Team at Urban dove. I know our executive director, Jay Nanda, has spoken before the Community board before so we're very excited to be in your district and to be in Midwood, and I'm here tonight one to introduce myself on the community affairs team. I will be liaising with the committee, so if you have any concerns or anything that you need from urban dove, I'm a point person to talk to and second to get the message out that we are still enrolling students. We still have spots in our school for those of you who may not know we are a transfer high school for students who have fallen behind academically, typically 14 to 16 years old and have completed like their first or second year of high school and are like a year behind. In credits, we have a trimester schedule that gives students ample opportunities to catch up on their requirements, for credits and for regions. We have a sports- based youth development, pedagogy lots of support from a coach, multiple teachers in the classroom when classes happening in person. We have a college readiness and a workforce development program for our students to prepare them before life beyond urban dove. So we are looking for any students who may be able to benefit from our model. If you know anyone or know any organizations and may have students that could benefit from Urbanduff's model, I would love to be in touch with them. My email is E Solomon, E-, S-, O-, l-, O-, M-, O- n urbandov.org. So please any questions about requirements or anything. Please send them my way and again it was very nice to meet all of you. Thank you so much and I hope everyone stays safe and healthy. Thank you. Thank you. Mr Solomon, the next Speaker Sean is Lisa. Derek Lisa, you might be muted. You might want to unmute yourself anya. Are you still seeing Lisa on the on the meeting list, because I do not have her name yeah. I do not see her either. I think that she has. She may have had to jump off to go somewhere else. So then we will move on to Joanne Brown hi everyone, I'm back, so I'm just here to make an announcement. You know the reason why I serve on the Human Services Committee is because I'm a healthcare worker. I work as a registered dietitian at Kingsborough jewish medical center, so as part of vital Brooklyn Kensburg. Jewish medical center is part of a legal merger with Dale University, Hospital, Center and interfaith medical center to create one Brooklyn health. In order to complete the merger, Kingsborough will be closing their acute care hospital beds, and, while this is outside of the district, we have only 2.2 beds per 1000 in Brooklyn compared to Manhattan, where we have six hospital beds per 1000, and so it is important. Every single bed- and in this case it's 163 acute care beds- is important. So what the staff has decided to do to sort of celebrate our celebrate and connect with how we responded to the Covid-19 surge? The first surge was we're going to be holding an oral history period on Thursday October 15th at 8:30 pm, and we invite you to come and listen to staff. Tell a five minute story about their participation, their perhaps their reaction with a patient, something that was really memorable for them bringing tissues because I'm pretty sure it's going to be. You know a little bit of a cry fest. So I do not have a public link right now for youtube, but I'm going to put my email in the chat if you're interested in joining in, to listen to our poignant stories and to help us celebrate how we contributed to the community by providing care to the residents. Yeah just shoot me an email, and I once I have the Youtube link I'll, send it to you. Thanks for letting me talk, I hope you'll join us. Thank you. Joanne next Speaker Lisa Derek has made her way back to Us Lisa. Are you on now excellent Lisa? I see your name, but I do not hear you Lisa's video is on as well Lisa. Can you hear us hi Lisa? We can see you I'll, try her in the chat, real, quick! Sorry! No, you can hear me. Let me start speaking yeah go ahead. We can hear you okay. Can you hear me yeah? Yes, oh okay! Thank you. My apologies that I was having problems with my computer. I heard you calling for me and I just could not get in because it was still processing good evening- everyone good evening. It's the Powell Miss Campbell to the board. Thank you for allowing me to speak, I'm here on behalf of Assemblymember Rodney's beshot, as many of you know just wanted to make a few quick, a few quick announcements we will, since this month, October is domestic violence. Awareness Month, Assembly, Member Bashar's office will be hosting domestic violence, awareness virtual event. It's going to be on Thursday October 22nd, and we will be having panel speakers from the district attorney's office. We will have a representative from safe horizon from the Ywca and we'll have an interactive session with participants of the meeting with third route. So this is going to be again Thursday October 22nd. It's going to be from 6:30 to 8 30. I'll, be more than happy to share that with community board 14, so they can share it with the rest of the community and we look forward to having you all. Please do share with anyone that you think may be able to take advantage of this forum. We also will continue posting our mass distributions. We've been doing a number of them. As of recent, we had a mass distribution on October, 2nd now with the congregation the class yahushua of monastery. If I pronounce that correctly, and also we partnered with Councilmember Farah Lewis's office on October 5th to host another mass distribution at the junction, we'll be looking to do a lot more of these in the communities that are heavily concentrated and also those communities that are experiencing an uptick, I'm so sorry to hear about the census. I know that was reported recently, although we do not have a date yet I just would advise everybody to use every last day to inform all the people that you know to get the census completed until we are actually shut down. I'd like to welcome Captain, Feldstein, Assembly Rod needs to be shot. I'm sure we'll be happy to meet with you. Welcome. Thank you all! That's all! I have I'm done with my report. Thank you. I did not I'll just go ahead and move it along then to David Cronin is with us who would also like to make an announcement from his organization. Sorry about that by all means. Oh thank you! Oh, I guess you can see the top of my head, but that might not be as entertaining sorry about that. My name is David croning I was originally. I was originally going to attend this group for my involvement with the Kew Gardens Club, which I'm I was happy to receive. The report of the updates and the process in the in this organ in this district, which I really appreciate. Did I volunteer for another organization, called itdrc, we're active in a homeless outreach project earlier this year in February and you're, supporting I.T for the homeless outreach thing project in Manhattan, they've developed, another project called project connect and it's actually been pretty well funded by a lot of our donors, and the basic idea is to provide it infrastructure for organizations that already have Wi- fi, but the ability to extend it to a farther reach. One of the examples that we use, particularly like libraries, for example, that already have internet access, but maybe it's just limited to within the building. This provides equipment to extend the wireless capability beyond to a larger area. We've had churches make use of it, so people outside the parking lot can get access to the internet. If they do not have you know if, even if they can't get into the building, the idea is you know one of the hardest things to deal with in the current Covid-19 situation? Is people not having access to the internet a lot of jobs require a lot of as well as just keeping in touch personally, so I'm going to put a link up if that is a situation that that may be applicable, feel free to fill out the the form that's on there and yeah. Let me know if you, if you have any questions I'll put the link up. If that's okay Sean, should I send it to you could put it in the chat and it would be useful to have if you would email it to us, we can take a look and post it if possible. Also thanks for the work at Kew gardens, you guys are doing a great job over there too. Thank you, I'm new to them, so I credit them for the work. Oh, they get busy. Yes, ma'am and that's our last speaker for this evening. As far as I can see, okay, then I will entertain them the only time. I'm sorry before you entertain that motion. I just want to remind you. I do not think anybody made an announcement about the upcoming police, Precinct Community Council meeting this month. Oh it will be as usual on the last Wednesday and what date is that sean that is October 28th October 28th at 7:30. We will do a virtual meeting. Please join us. The Community Board will have the link so I'll, see that the board has the link and please join us and get you'll have an opportunity to to talk more at length with our new Exo, the captain, okay. So at this time I will entertain a motion to adjourn my motion to adjourn. Second, it's been moved and seconded that we adjourn at 7:38. All those who are opposed and mute yourself and say no meeting is adjourned all right thanks, Santa Thanks Sean. Thank you good night. Everybody have a good one good night. You.",
            "summary": "We met with 17 agencies and now in the process of considering the information that came out of those consultations, working to include them with our agency priorities and comparing them to our district needs for the budget meeting that we'll be holding on October 27th and for updating the district statement.\nIf you have any questions about things that are going on the street, and you want us that- And, if we do not know which we might not, because it changes so frequently we'll work to find out for you.\nI was told that conversation really has not moved forward since we last spoke, but you know, but the request, actually, you know pushed it along, and so hopefully there was movement on that And I did attend a an introductory training for the Youth Council through NYC service And I sent the board a copy of the training , I guess at our next budget consultation and then offline.\nI know that the police have a lot of things to keep them busy, but this area between, like the corner, the South, I, think it's the southwest and northwest, but that section of Coney, Island, Avenue, Foster Avenue H, is just a nightmare.\nIf you have real genuine sincere interest in working on the bylaws, please submit your name to the board office and you know we will consider assignment and finally, on September 30th, a public hearing was held online regarding a special permit application that file assurance to section 73- 621 at and 73- 622 of the zoning resolution of the city of New York has amended to request two special permits to enlarge an existing single- family residence, one for the portion located in a residential R2 zoning district and one of the portion located in a residential, R, 3- 2 zoning district.\nThank, you sean, which means that that the vote, the board, then is voting to approve, and that ends the chairs report and moves us to well.\nSo should I start off or wait, but nancy we'll have the representatives of elected officials usually give their announcements during the public session after the topical committee reports, I'll defer to ed?\nWe all know that cover 19 is still a public health crisis We want to be able to work with the community collectively to ensure that we could get the numbers down and keep everyone.\nSo I just wanted to share those two locations and let everyone know that we're working diligently to receive more PPE to give out to the community, and we did receive a lot from the governor's office as of Friday And, we're trying to get more testing sites and our office is working on domestic violence.\nBreast cancer awareness, virtual events , That's all I have for now, but I just want to thank everyone for their time and partnership and look forward to working with everyone.\nIt is not going to be to the end of October, okay, So, the numbers I'm about to give you could possibly be the final numbers for Brooklyn and some of the tracks in community board, 14.\nWe are going to arrange for the homeless people and on this occasion a cmw provide the fresh cookie, fresh, cooked lunch and blankets, clothing, Socks, Hygiene kits and free medical care like blood, pressure, blood sugar, and we are trying to get some help from any hospital from any clinic for the flu shots or cover testing, and I'm, going to advertise And I'm going to advertise this event and shelters, especially in Avenue, H, Shelter, And, there's two other shelters.\nSo much you're welcome community environment No report at this time, But I've been to prospect parkway, but it's being heavily used by people trying to get some fresh air and open space.\nThe members of the public know this, because we did get some comments during that meeting and an email regarding this CB14 was not being asked to approve the bike lane because it was a plan The response had been positive or not, and in this case, at the meeting, as Joel said it generally was but asking for a letter of support when they were going to do it with or without the support seemed a little bit.\nSo we're going to post that project up on our website and DOT is asking for community input as to where community members think good stations would be.\nBut we're going to put some language in there just to help manage the community members expectations in terms of timing.\nWith the report so Joel mentioned, there was a joint meeting on Wednesday September 23rd, with the education, libraries and cultural Affairs Committee with the transportation committee.\nThat was a program introduced by the mayor over the summer and for that actually, sean was able to update us community boards do not have a role in the process.\nWe decided that the board would try to work with schools on a case- by- case basis to the extent appropriate going forward.\nI, just wanted to extend and my co, chair, Carl Henry Cesar, wanted to extend an open invitation for non- board members who wish to join the education, libraries and Cultural Affairs committee, based on the membership.\nIt, looks like we can welcome up to two non- board members to join our committee.\nWe have no specific report for anything right now If he wants to add anything to this front, but we are going to continue working with with Sean in the office on the Youth Council front, that we were looking at spearheading with the rest of the committees and, look to follow up a little bit more closely with what's going on with DYCD in terms of Internships Syep, Summer, Youth employment program, The pike, given just where everything is in relation to the pandemic and and then funding acrosss the board because, of course, that's going to be impacted.\nJust, announce that you and I and Brian Cunningham are working together to try to set up a public safety committee meeting date in November If you can do not hesitate, to, let me barge in And, then I'll just stall for time, a little bit by reiterating what Steve Cohen said about inviting people public members to the education, libraries and cultural Affairs.\nWe continue to work, and we continue to hear and prosecute cases to make sure that Brooklyn communities stay safe.\nI know our executive director, Jay Nanda, has spoken before the Community board before so we're very excited to be in your district and to be in Midwood, and I'm here tonight."
        }
    }
}