{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UCHip-wiEtSSRtJtA2OoChOA",
            "title": "CB 3 Manhattan - Parks Committee Meeting - 10/15/2020",
            "publishDate": "2020-10-16",
            "shortDescription": "Agenda\\n1.    Approval of previous month's minutes\\n2.    Parks Manager Update\\n3.    NYC Ferry: Discussion of Ridership at Corlears Hook Park\\n4.    DDC: East Side Coastal Resiliency update\\n5.    Lower East Side Preservation Initiative: presentation /request for support of preservation and adaptive reuse of ERP Track House \\u0026 Tennis House in light of SHPO's Determination of Eligibility for these buildings\\n6.    Request for Support for the LES Ecology Center's Compost Yard Temporary Relocation\\n7.    FY'2022 District Needs Statement and Capital \\u0026 Expense Priorities\\n8.    Vote to adjourn",
            "lengthSeconds": "3:36:49"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "lq86NslS-74",
            "fillerWordCount": {
                "uh": 438,
                "um": 427
            },
            "readTimeFullTranscript": "120 min read",
            "readTimeSummary": "13 min read",
            "wordCountFullTranscript": {
                "park": 73,
                "buildings": 60,
                "parks": 55,
                "construction": 47,
                "project": 43,
                "list": 36,
                "ferry": 34,
                "building": 32,
                "language": 32,
                "month": 22
            },
            "wordCountSummary": {
                "construction": 12,
                "buildings": 11,
                "park": 10,
                "parks": 9,
                "outreach": 9,
                "language": 8,
                "ferry": 6,
                "route": 5,
                "agenda": 4,
                "service": 4
            },
            "fullTranscript": "Over how we're going to run the meeting yeah again folks, if you were just joining us, I'm just admitting nine more people from the waiting room, also, if you're just joining us, please, if you're a member of the public type, your name and any organizational affiliation into the chat box. This is how we keep attendance for these meetings. If you can't find the chat and just scroll down to the bottom, so the toolbar appears and you'll see the chat there. You will also see something that says: participants, that's what you will need to click on later on when we get to questions and answers. That's where the raised hand feature is under the participants. If you are on a phone, it's star six to mute and unmute yourself, and it is Star nine to raise your hand. So keep that in mind when we get to the question and answer session from the public and as always, the chat is only coming to myself and trevor as the host of the meeting we're only using it for attendance purposes, as well as, if somebody's having technical issues and wants to reach out- and maybe I can help you with that- any information that is shared by one of the presenters they can put that in the chat. And then I will send it out to everybody in the meeting so that you have access to it. So that's the way we're going to be running the technical side of the meeting and trevor as our chair will run the verbal side of our meeting. Thank you Michael, and welcome to the October parks, recreation, Waterfront and Resiliency Committee meeting we're going to try and be as efficient as we can. Last month's meeting was a marathon at four hours, so I'm really not going to try and cut people off we're just going to try and be a little more efficient. If you want to speak on a topic which is on the agenda, I'm going to ask for you to wait for that agenda item to come up unless you really want to speak beforehand. If you have a topic that you want to speak up about, that's not on the agenda. We do urge that you wait for it to be an agenda, but if you really want to speak, please put that in the Chat box and we'll let you speak now. If it's not an item on the agenda, do you see anyone Michael hooves hold on? I just let a whole bunch of people, including board members. I just posted the agenda in the chat as well for everyone to see. I do not see any messages from anybody thanks so that we're going to continue so for committee members we're going to take a roll call, which will also approve the minutes, and I'm going to ask Ryan to do that. Who's. Taking minutes for tonight's meeting trevor Holland Yes, David Adams. Here yes, Euron Altman, yes, Carolyn Chan, yes, Brian, yes, Valentina Jones, yes, Michael, Moreno, Yes, Carolyn, Ratcliffe, Carolyn Ratcliffe, yes, Robin, Chatel, Robin Chatel! Yes, can you hear me? Yes, Josephine villas? Yes, Toy Villas, Troy Velez. I do not see him on unless he's one of the unidentified phone numbers? Okay, that's it all right! Thanks is the parks manager available for an update? Yes, he is. I just do not know what number he is so Jamil just does hey good evening. Everybody. The first part of my report is we've been receiving increased noise complaints regarding lionsgate and steelwood park. We've involved pep with addressing some of the issues, especially at lionsgate. We had a group doing a morning exercise class using sound equipment which was against some of the rules we have. So they would. They were issued tickets. The second part we've had an increase in Graffiti at Seward Park, and we had the amphitheater. This past Saturday was destroyed, which I guess a community group which has issues with the work getting done at East River. The third part is, unfortunately, we have some serious staffing concerns right now, we're at 30 of staffing, where we were in comparison where we were last year. At this point on and on a positive, though, I want to thank everyone who came out to tompkins park who helped out in the volunteer project. We had over 75 people come out clean out the flower beds clean up graffiti and help clean up the park, we're looking at doing it at also suet saradee and also East River in the coming months. So Mike I'll, probably forward you flyers, that we have, if you can give them out to the public, we'll be highly appreciative, no problem, I just want to piggyback on that. Jamal said: there's a number of it's. My parks Parks cleanup going on around the city, including in the park near me, which is pier 35, but there's also ones around the city. So that's another opportunity for people to volunteer to help clean the parks, yeah we're having also something very big this saturday at the Mufungo garden with Kate, so the news will be out there. Also. They also have a cleanup project there. Thank you. Jamal Lionsgate, I believe, is an S Sarah, roosevelt just no line yeah the reason I brought up lionsgate. That was one of the issues with a noise complaint coming out of lions gate. That was one of the issues. It was one of the rising issues I we had in the last couple weeks with a class very loud in the morning and afternoon during our legal class yeah. Thank you emil. I have a question from the last session. You said that there was illegal basketball playing. What exactly is that and where is it being done? Well, happy that happened at the new Jackson has happened at dry dock. It has happened at Sarah, D or off the Houston courts, they're basketball tournaments. They do not have a permit. They come with sound they're, not adhering to the Kovic guidelines of gathering pep has been involved. Pd has been involved. I've even met with the seventh priesthood regarding it also so way man, you said what is pet parts: police, oh okay and so they're monitoring that, yes, okay, all right! Thank you, you're all welcome. Thank you jamal all right, you're, welcome, appreciate it just one other question jamel. So if somebody sees people in these tournaments, they call what 311 call 3- 0- 1 a lot of people reach out to the present. Typically, it happens usually on Saturday and Sunday, I'm seeing it more than anything else, they're very sporadic where they go, but they've been they've been there's been a spike in activity. I've had groups that even nation Strauss also is one of the problematic areas that they were looking to do a tournament for the weekend. Okay, a lot of them are not adhering to the guidelines at all for Covid-19. Okay, all right! Thank you, you're welcome! Thank you all right. Next up is New York, City, ferry there's been an issue and all those things have changed since Covid-19 we're going to go into a discussion about the reduced number or the reduced data to reduce the service that the Corlears Hook stopped hi, I'm Megan Quirk from NYC EDC. Oh, we run the ferry system is ratty also on the line. Yes, I let somebody in with that. I am hello hi. This is Braddy Hi. Folks, good to see some of you that I have not seen in such a long time hi and we had a short deck just to go over some of the facts. I'm trying to share my screen, but it's been disabled. Am I able to share any content yeah hold on Megan. You guys run a good and tight ship. You have to give control to people we're only in the first 20 minutes, all right megan. You should have permission all right, great roddy. Can you just introduce yourself because you've already spoken, so I want people know who you are absolutely. My name is Maddie Miranda, I'm with the government relations team here at EDC, particularly, I know you all typically probably work with will fisher on my team who oversees the Manhattan portion of the portfolio, but I cover transportation initiatives, so NYC ferry hi and yeah Megan Quirk, I'm one of the planners on the transportation team at EDC. Whoever see the ferry system great, so I'm going to just get started and I do apologize. I am outside just keep it just keep in mind, you're, fading in and out roddy. So the volume is not consistent. Okay, so I'll turn off the videos as well. Okay, great so I'll, just get started I'll. Give a quick background for those of you that are not familiar with the system. Nyc ferry has six and six same routes being, of course, the East River, the rockaways south Brooklyn Astoria Soundview, and we operate seven days a week, year- round service, typically 6:30 to about 10 P.M. This is for the price of a subway system. You can't use your metrocard on batteries, but you can transfer with a computer system. So once you get on a ferry, you can just hop on another ferry for free so, and there are some onboarding of concessions nature, so just to give you a background and a map of where the ferry system is so for those of you that may not thank you just because I know that a lot of times I get questions on where we are with the ferry as we head, we are expanding to two different routes: three different routes. Actually, the Saint George row, which is going from staten island to Madrid City up to West 39th street. We are going to call the island as well, which is going starting kunian and going to Bay, Ridge and then ending in in Wall Street and then the zombie extension, which is just the sound view route, and this is important for you all, because you are able to transfer along the ferry system. So if you take a very nice Wall Street, you can now work on the island and get to Tony Island. We finished the environmental review phase and now we're looking to start permitting and construction to be able to launch St George by next summer and Coney island before the end of the year next year, and then now we're going to get into some where we are today. Just so, you all know if you have not been taking the ferries, we have, of course implemented a bunch of code policies to make sure that everyone's safe, including keeping the distance not only online but also on the ferry system, masks, have to be worn on ferries. Then tickets should be shown before boarding on their purchase just to avoid you know, crowding and things of that nature, and we have been frequently cleaning our ferries since the beginning of March. You know much more frequent basis, transplantation and with that I want to get into what we are here to discuss today. I know, speaking of Susan and trevor, you all wanted to make sure that we discussed some of the changes. That happened a lot of deficits and budgets and budget issues. So we have looked at everything within EDC to figure out how we can be helpful and properly. We can make sure we are running a cost effect effective system. One of the things that we looked at was different route configurations and things that we can do, which resulted in what we're here to discuss with you, which is the changes to the mortgage side round as we originally launched it and how we have configured it to be to make sure that we saved the city, millions dollars just to make sure that we're good and also serve riders in the best way we were seeing of all the landings. Courtyard specifically was but sure- and I hope you can hear I know- Brady- was fading in and out a little bit so just to reiterate, sort of a little bit of what he was saying is that, while NYC fair has seen sort of many, you know, we've celebrated many milestones and seen more and more riders every year, you know pandemic aside, forgive the terrible pond. It's not always been completely smooth sailing, and so, despite the high expectations after we launched the lower East side route, we just were not seeing the ridership pickup that we were had been expecting and that we'd seen on other routes, and so clearly something was not working. Quite right- and we as the planners you know, had started to look at like what are some other route configurations. We could look at that would still serve the lower East side landings but perhaps fold them into the others to a system that would then save the overall system costs with having a very minimal impact on overall ridership and the other routes as well, and then, when the pandemic hit and the city was sort of in a free- for-. All in terms of you know, fiscal budget crisis we were asked, I mean all the agencies were asked to make to make serious cuts, and so this was one that we sort of had we'd already analyzed. We knew we could do while again still making sure that Corlears Hook and the other routes along or the other landings along the lower side route continued to have service, and in fact what we've noticed is that people use the ferry, often to get across literally acrosss the river to other boroughs. And so I think one of the issues that the lower side route had is that a lot of the stops were just within Manhattan, and that was not ultimately very appealing for people in terms of comparison to other modes that they were taking. And so, while I know that change may have been disappointing to some who had become, you know used to taking the lower East side route as it existed before. We thought that you know the south Brooklyn quarterly hook being added to the south. Brooklyn route really opened up a lot of then new connections between the lower East side and areas of Brooklyn, including Brooklyn bridge park, Et cetera, and so what we've seen. We've continued to monitor, ridership since then, and while with the pandemic- and you know a lot of people working from home and not sort of traveling in the usual patterns. Ridership last spring, really dipped down to you know at some points: 30 percent of their usual levels, they've now, since kind of come back up and stabilized about 60 to 70 percent of pre- coveted levels and what we're seeing this summer compared to last summer. On the different routes is that ridership's, almost back up to where it was before again, even at that lower overall ridership? In fact, the in the chart at the bottom of the screen the weekend rider ships up quite a bit which is again nice to see and that's and that's the case acrosss the board people are, you know, venturing out a little bit more on the weekends and the weekdays just I think, to get out of apartments to explore. New York to travel while the weather is nice, and so we'll continue monitoring how coiler stroke landing specifically is doing. But we are encouraged to see that people are taking it on the new on the new route configuration. So I do not know. I think that is it ready for our slides on NYC ferry. I'm happy we're happy to put your questions on sort of the change or just general, very questions yeah. I think yeah thank you and I'll turn it over to trevor, because I know you all wanted to really see some of that information and talk about that specifically. But I'll turn it back over to you. Michael's already put in the chat that we're ever going to handle the questions as we have handled every previous meeting, and that is that committee members will go first and then we'll if we, depending on the time that we have left, we'll, go with those who raise their hand, who are part of the public, and I have a question just for clarification, those numbers that you have or that you showed and if you could put that back up, I think it would be helpful Michael, because I think we're going to focus on that that one particular shot of the ridership numbers. How does that compare to the city, in other words, had the lowest ridership landing per day? Let's say summer, 2019 of an average of a hundred and 143 what are other stock? What do other stocks look like? Because if it's hard to compare, if the high stop is 105., that's a good one. So I do include that link below the ferry.nyc right. So all our quarterly ridership reports are on the website and are publicly available so just, for instance, pulling up a pre- pandemic last summer's number. So, while Curler's hook saw about a hundred riders per day on a weekday, Long, Island City saw almost a thousand or stycovs almost 300 and styko was. I will point also one of our lower ridership landings versus, say sound view, which had also launched around the same time as the lower East side saw again, almost a thousand riders per day and the last one is that you're seeing an increase from the weekend and this for this summer of 221. But how are people getting back home if they're all going southbound from that stop? How are they getting back home if there's no northbound service or is there or does the northbound stop at the correlation? So we, when we report on ridership it it's based on ons, so I this number would double. If I talk about ons and offs, but people very well could be getting on going southbound and then taking it back northbound that would just be captured, in the say, the red hook or the the Brooklyn bridge park numbers. Thank you all right. Committee members. I have a smaller screen. I think we can. I think we can sorry. Okay, I that that's who I see- okay, yeah hi. Thank you for the presentation. I guess you may not be able to answer this, but it's it just you know the taxpayers. Public is subsidizing the ferries so like the tune of 11 bucks per ride. I believe- and I'm just wondering you know it seems to me that the key people that we need to have transportation these days are people. We call essential workers. I think about poll workers who have to get here at five in the morning. So what is the ferry service? Doing? That really speaks to that particular constituency. Less so folks who are just do not want to take the subway sure yeah, I'm sorry go ahead and speak yeah I'll start in the megan. You can maybe just add to it. I think I think one of the things that we were able to do is one have a consistent flow of service throughout even the beginnings of Goldman Ray. I think people that really relied on the service were able to do it, and I, like personally anecdotally, know some folks that are nurses in the rockaways that were like this is great, because I can still get to work right or folks that work in in the Upper East side that were able to actually still utilize. The ferries, I think one of one of the main things is that we've been able to address, is just transit, equity and making sure that folks, that are living near the waterfront and working at waterfront that are able to get to and from work because, as we know throughout the city, the edges of the water are really the ones being served by transit right, so just being able to serve a consistent service throughout this time has proven to be extremely helpful for those that are essential workers yeah, it's just very expensive, but I that's. What I wanted to know is essential workers cashiers people like that. But thank you. That was great. Are there any other questions from committee members again for the committee members that are on your telephones? It's star nine, to raise your hand star six to unmute and mute yourself robin I see you unmuted yourself. Does that mean you have a question zoom? I have one more question the purpose of wire we wanted to discuss. This is because there's been a cut to service where we had northbound surface from Corlears Hook. So we'd like to focus on that a little bit more you that service was cut because you did a reconfiguration because of low ridership numbers. Will you look at this again now at the ridership numbers are up and there's still no northbound service from Corlears Hook? I think I'll answer them. Two parts I mean one yeah. I think we saw it less of a cut and more is it just a reconfiguration, but recognizing that to go north, you do have to now take a you know: go South to pier 11, where you can switch to any other route for free, but that is not exactly the same as the service you had before. That said, think of a ferry system more like a bus system, you know where this is not we're not laying track. This is not as complicated as the subway things can always change in the future, and I imagine things will yeah. There's always you know reimaginings as we see how the system grows as we get more information about how people travel that I and you know no one knows what the future holds, but I do not yeah nothing is sentenced down here. Yeah. I think that I think that's right, megan I'd just also say just trevor. You know, I think one of the things that we do hope to see is that folks are using it more because they feel like this. Reconfiguration actually speaks to their travel needs right and where they actually want to go, but certainly, as Megan said, we that's the that's the beauty of having a flexible ferry where we can readjust based on the needs. Obviously Trevor. Can I ask you a question sure some megan or roddy I'm curious. I kind of doubt you have this, but I'm going to ask the question anyway. So we have three bus routes that basically terminate almost right at Corlier Park, the M14A, the m21, the m22 are all within walking distance to correlation park. Is there any do you have any data or anything that shows how many people are transferring from the bus to the to the ferry and or vice versa, at the granular level, not off the top of my head, I mean in general, we have stats from past surveys about how many people transfer from bus or subway I'll be honest. It's very small compared I mean most people access fairy landings by foot. If not then bike, and then I think subway bus is usually around 10 percent versus, say, 70 accessing the ferry landings by foot. So on the whole people I think, are it's just not as convenient like once you're on the subway bus, you're, generally sort of on a better path to where you're going versus both recognizing that there are two separate fares right now and that it's just generally not as a convenient connection to switch from bus to ferry to subway to something else. Okay and one last technical thing I have emailed- I think, shireen about this before but, as you may or may not know, I run the Corleoscope Park friends group most of your signage in that park, directing people to the dock has fallen or been taken down or whatever over the past nine months. So there's practically no signage in the park anymore. Directing people where the dock is the ones that we have been able to salvage are in our shed, so I'm happy to give them to whoever wants them, but yeah you might want to take a look at the signage. Oh, I very much appreciate that. I would love to just connect with your vine and figure that part out. I know that, like that specific area, you know we worked really closely with glt to get some of that kind of job. So it'd be a shame if it's not, you know replacing the backup, so I would love to work with that and one last one before we, I see two people who have raised their hands and we're going to call on those two people, but one last question in that link for the stats: does it break down the by how many people went northbound? In other words, last year there was no northbound service. Do you have a daily report of how many people were going northbound? No, so it does not again get to that level. Just talks about route ridership, so you did not get like what the old, lower East side route would carry on an average day versus what the Corlears Hook landings saw, but it does not break down north down south okay, all right, so the first person I saw to raise your hand was tommy, keep in mind that we're going to do two minutes and we're going to try and keep that for both the question and the answer. So it's up to the responder to make sure it's fit. You answer the question as quick as you can. So tommy yep, I was a frequent rider of the ferry from Corlier's uptown to 34th Street. So I consider this a big cut in service because I no longer use it. It's incredibly inconvenient and I'm wondering why what's the technical reason, the sound view ferry stops still stops now at Stuyvesant, cove and we've been cut out and if the sound view ferry would stop at coraliers, we would have northbound service. So could you please explain it would not take a great deal of time to stop the coral ears and then give us we have we're in a transportation desert related to east side, northbound servers. We have no bus service, we have no ferry service anymore. So can you please explain why that decision was made to keep coral ears to eliminate coral ears and keep Stuyvesant cove sure, so it was part of the overall route configuration. So we needed to look at. You know where it best made sense to put Stuyvesant cove on a new route where it made sense to put coiler's hook on a new route and honest is partially just like where we saw ridership patterns going anyway and then also where other routes were coming by and I get that sort of it's a very. It seems like a very simple like sound. You should just make one more stop and then and then everything's the same, but you know every additional. Stop that we have to sound view, means that someone from traveling from the Bronx then adds more time to their trip and that becomes onerous on them. So we had sort of looked at it again in a system- wide looking at making the minimum number of impacts to any writer. So we lose service because somebody from Soundview needs has another five minutes added to their trip right I mean I would also look at it as unlocking now the ability to get to Brooklyn in like four minutes right. So it's a reconfiguration that now gets you acrosss the river in ways that just have not been done before. So I mean I understand that, specifically, if you personally ride used to ride this route, I can see how that makes you know. Now your life certainly more inconvenient. I would just you know caveat it was you know, we're looking at ways to connect different parts of the city to each other and make it in a way that is meaningful, and you know so far since we're seeing uptick in ridership, so it seems like folks, are at least more enticed to use the ferry in a way that they have not before right. So I think that's part of the flexibility of the ferry system is being able to adapt and be responsive to what has worked and has not worked. Okay. Thank you. Next up is Ellen garvey, yeah hi. I'm excited to hear about this roof change. I had not known anything about it, but I'll have to look more closely at how it might actually get me anywhere. My question is, you know, as the last speaker noted, that we live in a this area. Is a transport desert and articulating the ferry with other modes of transport seems tremendously important, and yet there is no CitiBike station any very near that ferry. There is one up on you know. Maybe a quarter mile away up at the top of the of the bridge to the fairy landing you know in Courlier's hook park, but would not it make more sense to have one right there. The way there is one at Wall Street, for example, you are speaking to Megan's soul right now, please Megan go take it. I want bikes everywhere we talked to. Obviously the Citibank's system is run by DOT, so we can only ask nicely rather than insist, but we certainly come back to them all the time with you know, here's a landing that you know. Maybe we can move a station a little closer. What do you think? I know right now? They are working rapidly on doing a lot of what they're calling infill, because they have seen cedar CitiBike ridership boom this summer. So we can certainly you know again flag this flag, this landing for them for hopefully a closer station, because the landing just seems to be off in the middle of nowhere. In some ways you know it's not something somebody getting off the bus notices that it's not like. I mean it's true, it's not that far from the bus and the end of the bus lines, but it's also not something the bus riders are aware of. So I do not see you think you see any movement between the bus and the ferry for the. For the most part, most people getting on the ferry are getting probably getting on it. For fun I mean yeah, I mean in normal times, people are taking it for work as well, but yeah I mean the tricky thing with building on the water front is depths and where landing could physically be sighted, and it's not always as ideal as you know, you might wish. But I hear your point all right. Sorry trevor, I do not mean to keep cutting you off, there's a in the chat, there's somebody who wants to speak, Susan, Morris and then David Adams also has his hand up all right and then we're going to stop right there. But I want to ask you Michael about that CitiBike location, because I know that's in defensive group. The closest one is, as ellen mentioned, that far away, that is the closest one and we worked for two years to get them to double its size, which they finally did. But that is the closest one to the ferry landing. Okay, because right now, I'm going to obviously let the questions that are waiting right now be we asked, but I think in a future resolution, because I think we really have to think about the covenant environment we're in so we do want to bring the ferry back to talk about ridership in the coming months, but that might have to that might be something we want to put in our resolution to DOT, because it's sort of a weird mix of parks, EDC and DOT, with the CitiBike and the ferry and the park. Michael, who did you say, had raised her or put a message in there: Susan Morris, Hi, Susan, hi and hi, Megan and ronnie, because we did speak in June and, as you know, I too really feel strongly about the fact that we do not have a northbound service, because it's also a transfer point to a lot of other lines. But- and you know that I have proposed a variety of different options from either extending the south Brooklyn stop one more to 34th street or else being part of the Astoria line or a variety of other things that are possible, because these ferries practically kiss the Corleos hook ferry as they go by and do not stop. But the other thing I think, is really critical. Is that your point now is that we can transfer either at Dumbo or at pier 11 Wall Street, but that's virtually impossible. If you actually look at the schedules, you just miss the connection ferries by one to five minutes almost every single time. The schedules are completely the antithesis of what you need to actually be able to go northbound, and so I really do not think that the schedules have basically been allocated with that in mind, and I would really suggest that you strongly look at those and rejigger the schedules ever so slightly, so we could make that transfer. The other thing is that I do not know that you actually are calculating about where people were getting off at those stops. So again, I really wonder about how the decision was made to actually put us on this route because it just feels like it was relatively arbitrary because, as far as I know, there was no community input. We were never really even asked about. You know how, where people used it where they went to, and basically, as I understand it, you only really know where people get on the boats. You do not know where you they get off the boats, so in terms of really calculating what the effective routes are. The other thing just in terms of what your presentation was making about people wanting to be able to get acrosss the river Stuyvesant cove does not get acrosss the river. They only go on sound view of going north and south and that's it so the fact that we can get acrosss the river is great, but frankly it would be great if we could get acrosss the river to the Navy yard or other places, as well as just getting acrosss to Dumbo, but that's less critical than being able to get to north and south to get to the various different transfer points that I think are critical. Thank you, Susan, youth, all the time, but I do want an answer on the adjusting the schedules for transfers. We do do on our usual year. This year we have like eight schedule changes. We usually have at least four. So definitely have you know, Susan heard all your points and we can try and keep that in mind we're doing the schedules. It's when we're when we are doing scheduling. Part of it is just as we come into hubs trying to make sure the boats are not coming in on top of each other, so it is a bit of a delicate art in terms of scheduling things where every you know possible. Transfer that is desired to be made can be done seamlessly within five minutes. That's almost impossible, but I've heard your points about, especially since you've lost sort of the northbound service. If we could do something to make sure that there's at least a boat within 10 minutes, that's the northbound coming after I can send you. I've done a spreadsheet. That just shows you can see. I love spreadsheets to the other. Yes, I can show you this, where, basically, you can see how we just are constantly just missing the boat right. Thank you. Susan. Do you still have my contact information? I know you've spoken to me. Yeah. I do okay. I appreciate it great. Yes, all right. So our last question is from David Adams all right trev. You actually picked up my point, I'm saying they're making travel decisions during Covid-19 when we're on a lockdown. That's could skew the statistics and not give us the ability to get what we really need. So actually you brought up that point already, so I guess we'll have it in the resolution. Well, we're not going to do a resolution today, although we are going to bring the fairway whenever you do it right whenever you do it, whenever you do it, but that was the point I was going to make about the this is unusual times. They should not make a permanent change in unusual times correct and I agree with you so we're going to bring them back. Who knows what's going to happen three months from now, but we're going to bring them back, but I do want to emphasize the point and that maybe this could be done sooner than later and then as adjusting the schedules for transfer, because if we lost northbound service, the lease that we could have right now is a schedule that fits so people can go south and then get on a boat and transfer to other points. So if we could emphasize that to EDC and the ferry, that would be extremely helpful. That is a very good point all right. Thank you all right. So thank you all. I appreciate you having you taken the time to meet with us today, Trevor and Susan and others come around. If you need anything, you know that we can okay. Thank you we're going to move on. Hopefully we can continue this pace. The next topic is Ddc will do their monthly update about the Scr Michael? Are they sharing screens or they they've? Given you the presentation, nobody has given me their presentations at the exception of Lesbian, so I need to know who needs to share their screen. Michael Hi HQ from Ddc. I can share my screen. Okay, if you can enable that please, while he's doing while he's doing that, just keep in mind, we we've had this monthly update for quite some time. We've spent hours talking about different issues. This is just a very brief update. They will be back next month and the month after. We also have some other items on the agenda. So I'm going to ask folks to be brief with their questions and let's look at the presentation and also understand that there's a community advisory group which will also go over a large portion of the construction issues which are going to be touched upon tonight. All right, can you see my screen? Yes, great hi, everyone, Kia and Miri, with Dvc Cultural resiliency unit. This is a hopefully quick update. We do not have too many major progress updates to share tonight, but we created a few slides to better clarify some questions and concerns that have come up in the past few weeks. This is also the majority of these slides correlate to the presentation that we had last month at Cv3 parks meeting, which was pretty in- depth with a lot of reference slides- and I have the link in here later that anybody can take this and read through on their own time, so very quickly, a couple of quick updates on the pre- construction phase that we're in right now and where we are with the contract, registration phase and what's coming next and a couple of reminders coming after that. This is just for reference in case we have new members in the community or anybody who has not been following the project so far. The orange piece on the right side is project area two in community Board, sixth district, the green area, the two thirds on the left side is project area. One that's in this district in community world three district and the red areas that are sort of randomly placed throughout this site plan is the parallel conveyance, the underground sewer, upgrades and drainage upgrades for the project. That's the third component of this project and the blue area that you see sort of in the middle between the orange and green is the sort of pin the infamous pinch points of the fiber bridge. That's another project coming after this. So a couple of updates, I'm going to start with project area two very quickly, just in case. If, for those that have been following this, the bigger story of the project outside of this district but project area, 2 under community board 6 districts, we got our approval from the comptroller's office for the funding of this project about a week or so ago, and now this is moving to the next step internally at Bdc, to eventually get to the point of issuing a notice to proceed to the contractor and what that means is by Mid- November sometime within the next few weeks we will have an official go- ahead green light to the contractor that they've been approved, of the scope that they applied for, and they can start their sort of preliminary construction process and prep work for that specific scope and specific area that you see here in that Orange Area project area too- and this is a standard processing procedure that applies to all of our projects, and we had a lot of slides last month. That explained the step- by- step process of this sort of preliminary construction phase. So you can refer to that and read through that there's a lot of information there. That will be helpful to understand what comes next project area, one. It comes after project area two, so we're going to start with project area, 2 and again CB6 district within the next month or so and after that comes this area for approval and starting the project and leg work and then construction. So what it means we're where we are right now for this particular area of project area, one we're currently in the advertisement phase we're waiting for the contractors out there to review and put in their bids and once the bids come in, the lowest bidder is selected and they get informed of their selection. We go into a bid, analysis and bid review step, and that's where sort of the contract registration phase and the lighter green bubble is the next step. That's when that and it gets initiated and right now we're estimating that sometime in the most likely mid November, but sometime in the Mid to Mid to late November time frame, the contract registration phase is going to start. That's when that clock starts and that's going to take some time to get through it. And then it follows the next steps that you see on the top are those top bubbles of controller approval and then moving into notice to proceed and everything that I just explained with project area two, so just want to clarify also that this does not mean contract registration or comptroller approval or notice to proceed. None of these steps mean shovel Underground, Mobilization, Street cultures or any impacts of the day- to- day operations and life of the community that all comes after the contractor has gone through their sort of preliminary prep work. There's some leg work that they need to do with surveys, issuing a report to us issuing their project scheduled to us for our final review and approval of the environmental plans that we've all been talking about for a very long time. Now that's there's a package of items that needs to be done and completed in the first couple of months, two to three months of their approval in order for them to finally reach the point of being able to put up the construction fences and start the closures and start bringing in their machinery and equipment and get the work started, and I want to reassure everybody that before we reached any of those points down the road of any street closures, any construction fence going up anything like that. You will definitely have two to four weeks of advanced notice as far out as we can. If it could be more, we could definitely provide more advanced notice, but none of that is in the near future within the next few weeks. So one to clarify that, and on that note, we've also came to conclusion that we are able to keep the park open for the rest of this year, and that means our projects are its construction. Sorry, our pre- construction and sort of procurement and registration schedule will still continue the steps that we had planned with reviewing the bids, selecting the lowest bidder going into construction going to the contract, registration and the steps after that. So all of that is still on track, but we'll we're estimating that the contractor's work essentially won't be won't begin until early 2021.. So this is a high- level timeline right now. I do not have details more than this to share just yet, but this is one piece of big update and news that we wanted to share that. We're very excited that we're able to accommodate the request and the considering the unfortunate Covid-19 crisis right now and the open space access and everything in the neighborhood and the community that the park itself East River Park will be. It will be open for the rest of this year until the end of this year, and I have a little note there that first closures of the East River Park will begin early 2021 that again consider that a bird's eye view sort of tentative note there, and so we can come back and provide more details of exactly what that time frame is and what that means. So the construction phasing plan that we presented last month and all the details of the step by step in the process. All of that still is still in draft mode and all that still applies. But again until the contractor reaches this final step. On this slide of notice to proceed, we will not be able to confirm or finalize any dates or time frames or any commitments of that nature. That has to be coordinated with the contractor between the Ddc and our program manager, construction manager, folks, Hmtv Libra. So those are the updates and happy to take questions after this. Oh, my screen just froze there you go. Everything from this point on is just reminders. We presented this slide last month. This is just one piece of that: bigger slideshow that we had last time, but I wanted to remind everybody that this is our sort of umbrella process of community outreach during construction. This is specifically for the construction operations of how we, what the steps we take of publicly notifying everybody. That's involved in this project, one way or another impacted, starting with the elected officials, offices and the community boards and the community Advisory group public notifications go out to everybody who's on our mailing list. Anybody that can access the website and social media you'll be able to access those public notifications, community board presentations and the Cag presentations. Ongoing will continue for the remainder of this project. We will have printed flyers that will get posted throughout the community and, of course, just like any other dbc project. We have the standard community construction liaisons, the Ccl's that are our boots on the grounds, door- to- door, canvassing available to the community members and bridging the community with the construction team and my team and everybody else behind us to make sure that everybody's being notified on time so and the two sort of the third and fourth bubble here is that for any down to any level of detail and granular level on the on the street level, any I'm sorry any intersection and any street Bridge park portion of the park, anything that has any closure associated to it or any impacts of the day- to- day operations and day- to- day life of the community will have its own specific notification of advanced notification of when it's commencing and also a follow- up notification afterwards of when it will be when it's completed with updates in between. Obviously, this is just a quick link to last month's presentation. You can find it on our website, a quick reminder. We just updated the website not too long ago, and it has a lot more information about the project. Multiple new sections were added and we expanded a lot of different background areas and added more sections for construction updates. So please keep an eye on the website as we move forward and also, as promised, we'll continue to notify and provide various different resources that relate to Nwv and section 3.. Our consultants hmtv have a webinar coming up at the end of this month on October 27th wanted to share this with everybody who's interested, and you can see here there's it's part three of this series that it's about creating a compelling RFP narrative. It seems pretty interesting. So if you have any questions or can access the website or the zoom registration feel free to reach out to any of us, we'll be able to connect you with the right folks- and this is finally again another reminder. This is the overall snapshot of our community Engagement Timeline of what are the sort of community engagement tasks and strategies that we have lined up that we're working on each of them have a timeline associated with them on a separate track. Color coded you can see that, and I just wanted to point out that the top bar with that little red dashed box. It's a reminder that that's the overall construction timeline that again, is not completely fine like the details of the kickoff dates and time frames of each one of those areas. Those are all estimated right now and will not be finalized or confirmed until we can square that away with the contractors when they come on and that's it. Finally, that's our website link. If you have any questions, please feel free to. We have inquiry platform tool built into the website that we're collecting it seems like it's been pretty successful. So far, we've been this. We've been receiving a steady stream of inquiries through the website through that tool that we're very happy about. It's help really helping us organize everything in one place and centralize it, and we can push it out to our partner agencies and anybody else involved that we need to coordinate with to get accurate responses all together in a timely manner. So please feel free again. Any of us were all if a lot of you folks have our direct contact information. Please continue to reach out if you'd like to, but I do want to encourage everybody to document your questions and your inquiries through this website inquiry tool that we have on the website. So we can have everything documented and we'll be able to export any number of topics or types of questions and inquiries for future reporting purposes and follow- up purposes, and that's all I had Mike Trevor all right. Thank you and I'm going to emphasize that website that you mentioned, and the format that people can submit questions that could be recorded and answered. How do people get feedback from their questions? Is it answered directly or is it just put into a some type of form? So we also presented this last month. Another reminder there's a lot of slides in last month's presentation. I could pull up if we want to, but it's essentially the public facing part of it is a form that you fill out and there are different options that you can choose that are relevant to the subject that you're asking about and that gets submitted comes to us and immediately the person receives a notification that your inquiry has been received, and somebody will be following up with you that somebody is behind the scenes. A live human being no robot is here that comes through a process tree of a lot of us. Many of us are on a call right now that we go through a coordination process for every single inquiry and pull in the right people and every inquiry. Every response gets drafted, approved and reviewed, and it goes backwards again gets pushed out to that same individual who put the inquiry in the beginning, and they will receive an email notification that there was a response through inquiry. I think the paragraph the response itself, I think, shows up in the email, but there's a you, can log back into the inquiry tool and it would show the entire chain of the back and forth questions. So if the person has one question and it ends up being a back and forth sort of conversation for a while that history is documented there, when you log in you'll, see everything step by step lined up there all right, that's extremely useful. Thank you. I just wanted to re- emphasize that I know it was in last month's presentation, but that was there are quite a few slides in that deck, but I think it's important that people know there's another way to ask questions. That being said, we're going to go to committee members and I see val's hand raised, but I'm up for the community time, so I can wait, I'm out for the Fcr Michael. You want to put the clock up. You can go now if you want to okay. There's no other committee members. Oh okay, my question is on behalf of the lower East Side Power partnership, and we had asked about a community liaison speaking to the people that lived near Ps42, and so we wrote a letter because we did not know who is responsible for Ps42, whether it was you or EDC. So that's my question. What's with the peer any update on the community construction liaison for Ps42? Not yet, we've had multiple conversations and coordination calls between Ddc and EDC and our consultants, but we do not have ccls on board just yet there. All of that is in the pipeline right now for the escrow project and for the Pr42 projects as soon as the individuals get approved, we'll definitely introduce them, they'll be joining the community boards, we'll have them up on the website and we'll definitely make sure everybody's notified, and I guess the issue was that we have a lot of senior citizens, and so the website is nice. But you have a lot of senior citizens that do not have access, and so what we were asking is that you said before that a lot of the materials and whatnot are going to come down. Montgomery Street, so we just wanted somebody to come, speak or bring flyers or not speak, but come bring flyers or something to be posted in laguardia and governor gardens, because those are the two that are on Montgomery Street. So is that going to happen absolutely trucks coming down the block? Well, yeah! So definitely so that would be the primary role of the Ccl's one of their primary roles. But there's a network of us that we will. We will be we'll make sure that that's happening, and I also wanted to reiterate that all of our materials will be translated and the ccls will be bilingual. So we can make sure that we're covering every group in the community, okay- and this will happen before the truck start coming down- Montgomery Street far before they come in yes, you'll know, you're, probably going to find that before I do. Okay, because previously it was said that it was going to happen next month. That's why people were nervous. Thank you sure, thank you and that's a good point val thanks for bringing that up. I also wanted to clarify Sorry trevor, there's a little thing that I need to clarify here and that's part of my job that multiple different groups have different technical languages, a construction group, a design group. You know the elected officials us at Ddc and the city agencies you folks, the community members. Every one of these entities speak a different language that here myself, faye Ophelia from Ddc and a group of other our team members. Our job is to sort of bridge everybody together and make sure the information is being interpreted and translated into the right terms. So everybody is clear and understands that. So please, let me know if there's any misunderstandings, missing understandings or communications that are not clear. So when you hear from construction folks that construction is starting, this fall or construction. Let's just use project area 2 for an example that construction is starting in November. That does not mean shoveling the ground, rolling up with trucks and equipment. That means the contractors approve to get started with the work that they need to start doing before they put up the construction fence, and that includes they have to get their permits from D.O.T permits from the Ep. They need to do surveys. They need tuition to issue a report to us. They have to issue a lot of documents to us, so all of that is sort of captured under the big umbrella of construction, and it's my job and my team's jobs, sort of break that down into a step- by- step process that everybody else out there in the community and the world can understand what that really means. Thank you. I just want to clarify that. Thank you. Michael I see one hand and hopefully that's the only one I see so it says Ellen Garvey and Joyce Yo hi, I you know I live near the park and I'm you know I've been to a number of hearings about it. I know my neighbors are very unhappy about the golf instruction. All right. That's already so it sounds like that's. A done deal that we're going to lose the park for quite a long stretch, but here's another question, and that has to do with whether the the specs in any way call for some consciousness of how much noise and just let me just focus on noise, how much noise this is going to be imposing on the neighborhood. The new plan for the park already ignored the earlier plan that had a berm that would have contained the noise and made the park a quieter place in general afterwards, but I'm thinking about the construction burden and how much that pain will be shared. We're hearing about trucks coming down Montgomery Street! Well, there are ways to make those quieter trucks, but I suspect those are not that's not part of the bid, and I wanted to know if the bids in any way, if the specs for this will in any way reflect making this a less burdensome process for the neighborhood. So do the bids control have any ideas about controlling noise? I mean not. Specs is the word. I want not the bids. Absolutely thanks. Alan, that's a valid concern. It's been I'm going to say a hot topic for a lot of us from for a very long time, and just like any other of people, any of us that live in different neighborhoods. We all share the same concern if this was the same thing was happening in my neighborhood too. So, yes, those restrictions and criteria are built into the specs and to the bids. The contractors who are bidding on this project are well aware of a the regulatory at the city and state level. Requirements that they have to follow with regards to noise control and mitigation, and also number b and d is also we added additional requirements, like you, pointed out a quieter equipment where possible, and they also have to share well, they have to draft and prepare their noise control and those mitigation plans once they come on board. That's part of the first submissions of their package to us, along with the schedule and everything else, so once we go through that process of reviewing their environmental plans for noise mitigation, noise control, air Quality dust and all that that gets sort of reviewed and finalized and confirmed by Ddc and we'll be able to share those details of what exactly that means for the day- to- day operations. We've all seen. Construction companies run rampant and not follow any of the rules that they've been bound to. Who will actually supervise this and make sure not every check the decibel level, for example, or even focus on. Thank you. We get names. Thank you ellen we're going to. Let him answer that question and go to the next topic. Go ahead, yeah, but no good point, so who's going to supervise that, so the contractor is responsible for that with yeah. First, though, just going up the ranks is it's our agency. It's our consultants for program managers that are that are on this project agency liro. We are all there's a very large group of us that were responsible for managing and monitoring. All of that, with the decibels with their operations, day- to- day to make sure they're in compliance with the plans that they submitted to us and the other regulations and local laws that are out there and another layer on top of that is DEP and we keep going upwards. We have our partners, elected officials, offices that we coordinate with, and so there's a number of layers over that. Typically, yes, maybe your typical construction out. There has some violations, or maybe they're a little more relaxed, but because of the sensitivity and unprecedent level of this project, it would be very unfair to compare it to other typical projects out there, especially that we have not started yet. So I would request everybody's patients to let us just get through the standard process, get these plans and documents finalized. So we can share more details and once we go into construction, we'll be able to implement everything that we've been talking about and requiring of the bids and contractors. Thank you and with that we're going to say, see you next month. If we have any outstanding or any questions, I will forward them to you for next month, but thank you for coming and giving us that presentation great. Thank you all thanks. Next on the agenda is a presentation by the lower East side, preservation initiative, requesting support for the adaptive reuse of the Erp Track House and Tennis House in light of SHPO's determination of eligibility of these buildings. This may be new for some folks, and I do have some questions on this, because I think there might be some impacts, and I hope I do not know if Ddc is still on, but I hope Ddc is still on and parks is still on. So they can answer some of these questions, but we're going to let the presentation begin. Michael. Do you have a document to share? Okay, actually, Deborah is going to share her screen, she's all set up sure endeavor, while you're getting set up. I just want to say there was a comment in the chat that came in folks, while the meeting is in screen share mode. If you just go to the top of your screen, you'll see, there's a thing that says view options: you can change your options there. So if you do not want to see the presentation take over your whole screen, that's where you would go to change it and on some computers you can just use a slider bar to move it over and get see more people or see more of the presentation. Okay, so I think we'll get going sure thanks. Thank you trevor good evening. Everyone, I'm Richard Moses President of the lower East side, Preservation initiative, also known as lesbi last February lesbi came to this committee to let you know that we had applied to the state office of historic preservation, known as SHPO, to have them review the East River Park Track House and Tennis Center Comfort Station. I'm happy to report that we received a determination of eligibility for their inclusion on the state and national registers of historic places. Today we will show you some of the features of the buildings that led SHPO to that determination. Unfortunately, with the current East side, coastal resiliency plans, the track house and Tennis Center comfort station are scheduled to be completely demolished. Lesbian has publicly spoken on the merits of these buildings through the draft environmental Impact statement comment period and the Escr team has acknowledged these communications and been involved in SHPO's review of the buildings. Yet they have not altered their course under the circumstances. We would like to request a resolution from this committee in support of preservation and renovation of these unique architectural resources. First, I want to acknowledge the many other local preservation organizations that support our efforts. Their endorsement underscores the significance of these buildings not only to community Board three district in the lower East side, but also to New York City as a whole. I'll now introduce Deborah Wyde, my fellow Lesbi Board member, who will take us through the presentation. As a reminder, the East River Park Track House, is located near 6th Street and the Tennis Center comfort station is roughly between Rivington and delancey. The buildings were completed in 1938 for the opening of the park in 1939.. This is a site plan of the park as it is today, and this is a view of the park when it first opened. It was part of the project that built the East River Drive. Now the Fdr drive that project supported by the new deal was transformative for the lower East side. At the time, Parks Commissioner Robert Moses insisted on a waterfront amenity for the neighborhood, even though it required extensive landfill here is the Tennis Center comfort station, see my cursor here and the dance circle with its bandstand. Further back is the track house and way in the distance. Is the 10th Street, the original 10Th Street comfort station, which was replaced by the current building? We are not considering that current building for preservation, since it was not part of the historic plan for the park. I'd now like to focus on aspects of our buildings that were emphasized by SHPO in their determination of eligibility. Here is a view of the track house in 1939. The only difference is seen in the background, as tenements were still on the west side of the highway. The track house is a three- part building with two chimneys and an unusual cupola articulating hipped roofs, and here is a close- up of the cupola. Today, among the unique characteristics of the building are designed motifs linked to its waterfront location. There are four terraco terracotta spandrels under the windows on the river- facing side. You see two here, my cursor here and here and here's a close- up. The design includes fish, vegetation and water in a stylized pattern, typical of the art deco style of the period. In a survey I conducted of CB3 district park architecture, I found no other example of building ornamentation, linked specifically to the area in which a park is located. Here's another distinguishing design motif surrounding the doors of the building is an unusual repeating pattern in Terra Cotta. The motif relates to the maritime past of the lower East side. Here's a close- up of the pattern. It derives from something used in shipping called a marine anchor bow shackle. Seen here, SHPO also acknowledged the track house as an excellent example of the modern, classical style known also as WPA modern in reference to funding from the new deal. Here you see the plasters that appear on the corners of this three- part building. They suggest columns on classical greek architecture, particularly with the freeze just above here with the configuration known as a greek key. You can see my cursor here. That's the greek key in surveying architecture in CB3 parks. I found no other use of the very distinctive greek key freeze design now to the tennis, Center comfort station. You see the building here in 1939 and how it looks today. Nothing significant has changed, except that it's become quite dirty. A simple cleaning would make a dramatic improvement. You notice the same door surround we saw in the track house, but the freeze is different here. It is a blue terracotta, sprinkled with stars that may reference nighttime navigation at sea. It is important to note that the Terra Cotta ornamentation on both these buildings was custom fabricated, locally in long island city in all, SHPO's evaluation of the Track House Antenna Center Comfort station emphasized not only the historic links to the transformative period of the new deal, but also the connection to the earlier maritime history of the lower East side and SHPO also focused on their excellence as architectural resources. These buildings are a singular importance in the CB3 district. We very much hope they can be protected from demolition, which has regrettably happened to a considerable amount of significant park architecture in this district. I want to show you what has been demolished and lost just in East River Park. In the early years there were three other buildings that resembled the track: House Antenna Center, Comfort Station. I was able to get pictures of two of them. These are highly significant structures by the same architect, Aymar Embry Ii, who is the lead architect for the Parks Department in the new deal era, when I zoomed into the door on the top building you'd see with my cursor around the door. Here I noticed the same door surround that I showed you on the track house and on the Tennessee Center Comfort station, and you can also see the greek key design in the freeze here again right here. Here's the greek key and the same cupola that was on the track house that is on the track house. While the stars in the freeze below are something we saw on the tennis Center comfort station, the demolition of these outstanding buildings, clearly designed as part of an architectural group in East River Park, is very sad indeed and represents a substantial loss to the community. Now here again, is the tennis center comfort station with the dance circle and bandstand just north of it, and here's a close- up of the bandstand, with its striking decoration on the top and bottom that is also now demolished. And finally, we have the building that was once part of the amphitheater, but it is not just East River park that has lost noteworthy buildings. In my survey of 37 parks and playgrounds in CB3, I found 17 that had been demolished. Here are two very handsome buildings that are gone. The very early Coleus hook park pavilion and the remarkable octagon- shaped structure that once was in Joseph C Sauer Park on East 12Th Street. I want to turn now to the east side. Coastal resiliency plans for the Track House Antenna Center Comfort station at the top, is a drawing of the planned replacement for the track house. The Tennis Center comfort station replacement is here at the lower right here. You can see that the contemporary design in these plans is close to that of the new Luther Golic Park comfort station right here. While this is a nicely designed building, it follows a standardized pattern that the Parks Department has developed for new architecture. I found four other such buildings, varying only in color that are planned for other parks. We feel very strongly that the historic and distinctive track- House Antenna, Center Comfort station, specifically designed for the lower East side, should not be replaced with buildings that would closely resemble others all around New York City. We are pleased to have worked with davies toes architecture, a local firm, to explore ways that these historic buildings can be adapted to fulfill the programmatic requirements of the new planned buildings, and this includes all areas for bathrooms: offices, changing rooms, storage and concessions. Here are some architectural drawings that show how these exceptional buildings can be saved at the top is the current track house, which has a container lightly drawn here on the side because they ran out of room in the building and in the center is the planned escr Track house you can see it's bigger. Our architect has suggested a possible plan, something like that at the bottom, which would put additions at either end in a light or transparent material. That would not distract from the historic structure and, of course, the interior of the building would be updated in whatever way necessary. Our own measurements confirm that the buildings can meet ADA requirements here is the rendering of a restored track house here is the Tennis Center comfort station, with the current building at the top, the escr planned building in the middle and a restored building at the bottom. Again, our architect has suggested additions at either end in materials that would allow the original building to receive primary attention. Here is a rendering of a restored tennis center comfort station. It is important to acknowledge the fact that these two buildings have lasted over 80 years, which is a testament to the quality and durability of the limestone and Terra Cotta materials used in their construction. Lifting the buildings, as would be necessary when the park is raised and eight to ten feet, is something that is done regularly. As seen in the examples here, if you see on the right side, you can see one of the broadway theaters actually located on 42Nd street being moved on tracks. This was a massive theater, but again these are ordinary undertakings in the world of preservation and reuse. In addition, an engineer with an initial assessment of the buildings has said that the process of lifting them should not be a problem still further. It can be noted that it is always the greenest solution in construction to save an existing building rather than to tear it down and build a new one. Here's how the current buildings would appear with restoration. This is what we are hoping to achieve with community board 3 support. Thank you and we'd be happy to take any questions we'll also be joined by Laurel Laura Sewell, a fellow board member from Lesbi. Thank you for that presentation. I know it was a little different than what we normally see at parks and you also have presented to our the other. What's committee, you did not present the land use right. You presented to landmarks just before we take any questions and I'm looking quickly in the thing there's a couple of things that that's going to make this a little more challenging is that we already have passed a resolution for escr and we've also passed a resolution on the environmental impact statement so trying to figure out how we can look at this a different way. But, more importantly, is there someone from parks on who can answer a few questions or Ddc queue? Are you still on? I see, Alda is still in the participant list, all the Chan yeah. Yes, I'm on. I can't really speak to this particular issue, but I think Aram Kadri, who from OMB may be on she's, been, I think, please hi hello, hi. Yes, this is Aaron Kadri from New York, City OMB. I hope I can answer your questions yeah, I'm just curious that has this been brought to your attention and what has been the response, or what is yours so this hat? So you know just to give a little bit more background to this. The environmental impact statement for this project, as you're aware have, has been going on since 2016., so these buildings were not previously on eligible on the register and we've been working with SHPO on the environmental review analysis. So when we issued the final environmental impact statement right around that time, this issue came to our attention through lesbi in one of our final conversations with chippewa lesbi and others, we recognized that lespie was interested in making these structures eligible and wanted to reach out to SHPO. However, Shippu had not made that determination at that time. We went ahead and issued the final eis now in June of 2020, when we are all in pandemic mode, we did get a you know, determination from Chippewa when they are while they're calling these structures independently eligible on the registers. I just want to also call out this. They are not included in the register. They are eligible to the register, so there's a little bit difference there. So we are working with Shibu to figure out how we can mitigate this, because we, this is a federally funded project and there is a section 106 dark section, one. The section 106 is a federal environmental review sort of process which which takes into account historic and archaeological impacts, Et cetera. So if you have a programmatic agreement which takes into account these kind of impacts or you know, and how to mitigate them, so we are working with Chippewa at this time to figure out mitigation for these structures. While we know that these structures and the current plans are going to be demolished, so Shippu's recommendation is to do our best. We can they recommended. Initially that we do a Habs, which is historic, American building survey level, documentation for these structures. I understand lesbi and others are interested in saving these structures. We are as Q described earlier. You know there are these construction plans and you know there's a lot going on behind the scenes to really go back to the drawing board. I really can not speak to that, but they we are trying our best. We can have level mitigation. We already have completed some kind of habs. We can see what we can salvage for these structures, and I do not know if that is even doable at this time, but we are looking into other options for for these structures for now. So that's really where we are, but the programmatic agreement is where we're going to address this. Okay, so I mean: are there any questions from kinematic members? I'm going to have to do some thinking, but or I do not see anyone who has their hand raised. We did get some comments from via email from residents and they've asked about resident outreach, and the concern is that they won't get new bathrooms, as other parks have gotten in other neighborhoods. So I guess the questions are for the presenters as of an outreach to like a lot of the NYCHA housing and answering the question of folks who want a new bathroom or want new bathrooms and a new field, a tennis house. Well, we have not done direct outreach on this, however, and we're happy to meet with anybody who is interested to you know speak more about our plans. However, I do want to say very clearly that the idea is for the track houses to be adaptively reused in the interior, so that the interior finishes and fixtures can be completely new and nice and shiny, and just as the exteriors of the restored buildings will look nice and shiny they're not going to look shabby any longer the way they have due to the lack of maintenance over the years. I do want to say that the changing years here in the in the scope of this project is to me. I've worked on many government projects and change, orders and changing years on something at this level should not be a big deal in terms of taking what is a standard two standard parts department, designs and switching it out for just lifting and moving the buildings should not be not be a big issue. We understand that the city and SHPO are talking about mitigation, which Jazeeram said now consists of drawing the buildings and photographing them, but we feel that having the buildings photographed and drawn- and you know the photographs tucked away somewhere in a library or maybe in the corner of a building or something is not the same thing as people being able to experience and enjoy the buildings every day. Thank you. I saw Lisa's well, I'm sorry Robin's hand First robin. If you're on the phone you have to hit Star 6 hi. Can you can you hear me? Yes, that's a beautiful presentation. Thank you so much. I guess my question is: what happens? What what's going to be happening to these buildings during the construction period, and are you also thinking about monitoring that that's a little bit beyond our purview as a preservation organization, but we certainly think that they can be moved to an area that is safe during the period of construction and then and then shifted again back to where they need to ultimately be which is fairly close to where they are now. So it should not. You know not be a very large issue. May I ask about the amphitheater who's speaking diane we're going to take questions from the public after we do the board members, so we have a few board members first and then we'll see you thanks Michael. I think there's something to be said to consider having something that's distinctive, that ties into the history of the park rather than something that's generic and modular and replicated in so many other places. One of the things that's always been about our neighborhood is that it's been distinctive and these buildings are amazing, considering the shape that they're in the length of time that they've been there. I do not know if you've ever been inside those buildings withstood Sandy. They are in really amazing shape and it's something to be said about the way that they were constructed and that they were built to last. I can't say that about all new construction from what I've seen. So I think it's something that we should take into consideration and continue to press for the preservation of these buildings. Can I just speak to that point for a minute trevor to add to what Carolyn's saying the facades of these buildings are made of Indiana limestone, which you know has lasted almost 100 years and placed where they are now, is very finely crafted and there's no reason why they can't last another 100 or 200 years the slate roof up there. It can last another 30:40 50 years and then put another roof on the building. We do not see any. You know any problems without minor restoration of building elements, to keep these buildings working and in good shape for many decades. Okay, yeah. Thank you for the presentation, it's so great to learn the new things. I think to the point that I would agree that you know losing this park there's something that you know would be really great to have. The community see these very unique buildings restored and kept for use as long as the interiors were modernized, because I think that's a fair point and it sounds like that's what you're saying is that the interiors could be completely modernized while keeping the you know you just you, do not make buildings like this anymore. You know when I was in construction. You know you just you just do not see things like this, so I really think it's a win- win. You know being able to restore the buildings. We've waited a long time. This there's been so much back and forth about this park. I feel like it's. You know to preserve these as a gift, and I think the community deserves to have a buildings from that era. That are, you know so wonderfully built. That's awesome, okay. I do not see any more committee members, I'm sorry. There is one he did not raise his hand because he can't so Michael yeah, no just to basically follow up on what Kay is saying. I mean, I think you know, for the committee members just look at the comfort station that's being put in at corliers Hook park. It's the same exact building of what we're looking at. I do not know if it's limestone or not, but I you know we are getting a new comfort station at cruelers Park parked with an exterior that is similar to these two buildings and they're just modernizing the inside. So it can be done granted they're not moving the building which would be required for escr, but it definitely can be done of keeping the exterior and modernizing the inside, and we want to point out also just very quickly that the Coil Airs Hook building does not have the level of detail that these buildings have that these buildings are really very special in that way. But it's very nice Michael, but your comfort zone is very nice. I did not mean to detract from that yeah, but I just do not have the details. Thank you, but it was. It was designed in relationship to the buildings at East, River Park, because that's what Moses had in mind when he made Corlears Hook park smaller because of the Fdr drive, he had a special intention of linking Corlears Hook park with East River Park. So that's why the building is so similar. It was really meant to be experienced like the buildings in the park, but just a more modest version of it. Thank you. We have another committee member Ryan yeah. I just wanted to add that you know given how much loss we're experiencing both of East River Park and in many ways of the lower East side, as you know as a whole over many decades, that being able to preserve something, that's specifically tied to our own history and our sense of place feels very important. I understand the complications it raises that at this time, but I just want to say I think it's really worth it and I appreciate so much the the work went into this presentation. Okay, can I clarify one point trevor, please sure, so I just wanted to just explain that you know that the environmental impact process has been going on for a long time. It was only two years ago in 2018, when the community became aware that demolition of the park was part of the plan and that's the point at which we started looking at the architectural resources. So they had been considered the buildings as part of the overall park and the overall park had experienced so much alteration that it was deemed not eligible by the SHPO, but those buildings were overlooked and not individually considered until lesbi petitioned the SHPO to do so. I just if there's any confusion about a flip- flop or anything like that. They just were not looked at as individual on their individual merit until very recently, and the timing is certainly inconvenient, but their merit outshines it in our opinion. Thank you just to let everyone know that after we let the committee members ask questions if there are any board members in the who are who want to ask a question: we go to them first and then we reach out to the rest of the public, and I see these the captain's Sandra's. She is a board member. Thank you, yeah. Well, several people said essentially what I was going to say. I've always admired these buildings and I really regret that we did not make more of an issue of this early on, and I want to tip my hat to lesbi for really bringing this up to us now better late than never. I guess I just want to say this. You know I've been on community board three for a very long time. It certainly would not be the first time we've been aware of additional information and modified a resolution that we've taken in the past, and I really feel very strongly that we should take a clear stand to save these buildings. It would be just unimaginable loss. Looking at these pictures now and really absorbing this carefully, I really encourage the committee and the full board ultimately to to make a statement in support of these buildings. Thank you, Linda. I just see your handwriting Linda Jones yeah. I had to unmute myself. Just briefly, I mean you all know that I chair the Landmarks Committee and although we did not choose to pass a resolution because we deferred to parks, we certainly feel very strongly that these are wonderful buildings, they're modest, the cost of re you know doing. The restoration is not very great and we would have this treasure for the next century at least, have a little reminder of our historic park. Thank you for any more questions or comments. Are we going to the public now trevor? There's sorry, all right! Diane! Do you want to ask your question now? Diane? Are you still there? Oh hi the construction. I have not heard that there was a contractor yet hired. Who is going forth? My question is the amphitheater the noise from the amphitheater in the neighborhood? What is happening with that? Also, how it's going forth over a three- year period, starting lower East river, starting upper Lease, East River? Where are we Dan? I think your question was probably for the previous topic. I do not know if you were waiting that long a little bit, so she had her hand raised from the previous topic Michael. No, she has not had her hand raised. It was just she bounced in from the public. Sorry, that's right! She just she just unmuted herself to ask the question initially during this presentation: okay, here's what we're going to do! Diane, because that presentation was before this one, but they are coming back next month. I can put in the notes that we're going to ask about the amphitheater and the noise, but the present the folks who are presenting right now, certainly can't answer that question, because they're talking about the preservation of two buildings, but escr team comes every single month to this committee and if you raise your hand or put a comment in the chat, you can make sure you get your answer. Your question answered. Okay, thank you. Anyone else all right! Here's what I'm going to recommend that we do and I'm going to get some feedback from the committee, since we do not have a resolution for this and it is, there are some things that makes this a little more complicated. We can bullet point some elements of a resolution right now or we can get more information from parks and ddc about the process. I have not. I have us, I'm sorry, we I'm just going to continue, but that does not mean we would not write a resolution. I'm basically saying we can write a stronger one once we get some more information or we can, depending on how the committee feels write, some bullet points for a resolution. Right now I do have a con. I do have a concern, and that is that I just do not know if this has enough outreach to especially the local community, because I do not think anyone is aware of this preservation effort and I particularly like it, but I want to make sure everyone is aware. So I'd like to see some outreach, especially to the NYCHA household, to natural residents who live in that area, who do not may not know anything about this effort. I think it'd be nice to see their support on this and not just NYCHA, but anyone who lives along that a particular waterfront. So I'm going to ask you what you think I mean we could revisit this with some support next month or we can see how the committee feels and start something now laura. I know you were about to speak and now you're unneeded. No, we did have a draft resolution if that's at all helpful for you, Richard can share it sure if you can send that to. If you can Richard want to email that to me and I'll try to bring it up on the screen. Okay and just to just to know- and I know Lisa Kaplan have brought up we've done this before I did not checked our previous resolution. I know it's a pretty strong resolution and this was not in it. I think we can probably work with it or what your you have drafted, but I really want to make sure that we stay consistent with our resolutions, because what I'm probably going to add is the some form of that community outreach needs to be done in the resolution or we can come later and say you've done the resolution and you've reached out. I Richard, do you have this? As a word document, you send me a pdf sure I'll send it as a word document. Thank you no problem. I think considering the timeline that we're under it would be most helpful to have a resolution with encouragement that community outreach does need to be done, and we should certainly consider that, but in turn the timeline is tight. So to wait to know that we have the committee support for this, for another month is even more challenging than it already is. Okay, it's just that writing it without community support becomes a bit more of a challenge because then it becomes well folks saying we did not know anything about this and you know understood, and perhaps we can, if it could be meant to encourage, suggest, support and encourage further exploration, and that would be perfectly helpful for us at this point and we'd be happy. You know we'd be happy to look into the best way to reach out to the community, and you know organize a meeting. We do have on November 10th, another, a presentation that lesbia is doing for our general meeting, which we could make an extra effort to reach out to niger yeah. We I do understand the challenges there. We pretty, we pretty much need to go to them, but that's totally doable so and we do have we should mention. If anyone wants to learn even more than they've learned this evening, we will go into more detail in our in our November 10th lesbian meeting trevor. Do you want me to try to read this? Can you send me, can you send me and ryan a copy? Yes, you can cancel your screen share while you do that or sorry while he's doing that, and I do not like to jump topics but I'd rather feel some dead time. The next item is request for support for the lefcy college and it's complex art I'm just going to. Let everyone know that unless the committee feels different, that there is overwhelming support for this, so we could spend a lot of time talking about our support or we can go over resolution and sort of get to the point of support, because we this has been on our agenda for quite some time. I do not think there's any. I think we kind of much pretty much all agree unless there's some committee members who do not. I do not like to tell people how to think, but I think it's been pretty consistent over the last few months now, the while I'm waiting Michael did you send it yet yeah all right. Can you put back the other one be on there yeah? Do you not see it? You have the ecology center, it's pretty. I know I put it in your brain in it. I was just trying to let people know that we should move through that topic pretty quickly. There we go okay, I'm scrolling it like. I can actually scroll it down, install it. Yeah, okay, go to the next page, Mike all right. There are some formatting issues with the therefore be resolved, because some of that language should probably be in, whereas I go to the first page Michael, I'm going to ask the committee for comments and what I'm looking for some language that says that there needs to be some community outreach and changing the their force to be more direct and taking out some of the language there. I see. K has their hand raised Trevor. I had a question also. Could we could we do something like what SLA does and approve this with conditions, I'm reluctant to go down that path, primarily because a lot of resolutions would go that way. I hear what you're saying, but I'm just trying to figure out a way to put language in there, but I'm going to cake, as she has her hand, raised. Okay. Well, I'm sure that some of the, whereas and the therefore edits you could do as long as, but I think the two things that I would want to add are, whereas we understand that, whereas we understand that many community members want to see completely renovated, interiors new bathrooms, that goes into one of the whereases and that the second piece is that that there will be significant outreach by lesbi in the next period of time and maybe even some shot for people to come to this committee to if they have questions for disagreement. Okay, I'm going to ask you to send that potential draft language to Ryan. First, before we talk about it, Susan has a hand raised yeah. This is a technical thing. So who are you sending this to you're asking me yeah? The committee is voting on a resolution. I do not mean what person I mean. What agency? What who is this targeted for is this going to the Parks Department, I believe so or Ddc or both. I just wanted to point out that some of the things that you want to include, I forget what it was that Kay. Just mentioned and the outreach is not, for you know: you're telling parks Department what you want to have there, but as far as like the conditions for outreach or the other thing, I do not remember what it was. Those are not for parks Department, so maybe it could be included in a way such as you know where, as lesbi has, you know has promised to do this outreach because you do not want to say you have to do the outreach, because it's not going to the people that are doing the outreach, so maybe included that this group has promised that they would do it. So the language would read pretty much like what you said, whereas Lesbian has promised to do outreach to the local community since and that's a good point can't send something to parks and then be telling another group to do something correct. Although we do want to say that, according from what I heard from you trevor that you have heard community members asking for new interiors- and I think that would be important to say- because that is right- and I'm asking you okay- to send that language to Ryan- that's okay, because it was eloquent and it's perfectly written val, has her hand raised. I just wanted to add Kay that can you add on there that, in terms of community outreach today include NYCHA, which is baruch Lillian, Wall and Jacob Reese, which is right acrosss from all of this? Absolutely thanks any more comments. Now, I'm going to talk, I mean this is for Laura and the team. My question is: do we would you like to see a something that says that if the buildings can not be preserved, that you would like to restore elements of the building, I'm going to say that since Iran has already suggested, that's an option. They're looking into we'd rather go for the home run, and we can come back if it's determined that this is a total fail, which I hope it won't be. Okay, going to the therefore be resolved. Does anyone see any issues with the language not understand, because this is the first time I'm seeing this that we're going to clean this up a bit says: Susan has her hand raised yeah, maybe instead of man- made human- made oh yeah. Thank you Susan. Yes, thank you yeah the statement down here. Michael can you oh, and that the building should be lifted, restored and adequately reused? What are we doing with that, because that's what I wanted about with this whole thing that they plan to like lift everything now. That would be a good place to put in the part about the new bathrooms that the line that right that Ryan mentioned so where so, where is this going and that the building should be lifted restored and adequately reused? I do not understand your question you're asking me: where is it going? You mean under what under what paragraph right? Is this a? Whereas is this? I'm sorry, yeah Michael Scroll up a bit right now, it's a theraport, but it was it's part of it. Therefore, okay, it's just on the next page, okay, but I do agree that needs to be cleaned up, because it's a very long, therefore be resolved when we're trying to go to a point where some of that language might be long in the whereas and we would add the need for new interior not only just bathrooms, but a new interior okay, I just want to say I have not received anything, I'm just getting wrong, just that. Oh yeah gummy words, my thing, the famous words. If I heard you so you know what so let me just ask so we're assuming that the building can be lifted restored with no problem. Yes, we did you know you can't you can't be sure until you actually get in there, but an original sir, a survey from a structural engineer. Okay indicates they do not see anything obvious. It's like a crack or okay. So we know the fireboat House is built on pilings and that can't be moved. So we do not see those issues here we have done all we can do without you know, really get you know getting in there. Okay, all right! I just would you know my thinking was just. I know that they say that they that you know they're going to lift everything eight feet so you're saying that they can lift this to eight feet and then still be fine. Okay, I do not know if this is important, but in terms of new bathrooms and the interiors in addition to new bathrooms. The program calls for new offices, new, changing rooms, new storage and new concessions, so there's a whole program of new things that would go in these buildings correct. Maybe we should fill that out. No, and I understood that's part of what we're going to add just understand that looking at this, for the first time, I when we say new, interiors we're, including all that programming okay yeah, I'm just trying to get as many comments from the committee as we can, because we have not adopted this. So we can make comments, but I without having to adapt every single paragraph for every line, the val. I hear your point about that and if about raising the building and like where is it going going to go while they're lifting the park eight feet? What if it breaks, you know those types of issues, but if the, if this team is fine with that particular language, then I do not see a problem but Carolyn yeah that that's what you know. I'm like saying with that language there lifted it seems like it takes care of it: okay, carolyn, you're, muted, Carolyn. All right, I had suggested that you use the word committed instead of promised. Where are you at Carolyn? What paragraph talking about that Lesbian would promise to do outreach to the community. I typed it into the chat. I'm sorry, I see it how about agreed yeah, because I think commitment is stronger. Did you see it in the chat? What I wrote yeah, I think, okay, I do not lesbian has committed to doing extensive outreach to the community, including NYCHA housing. Can I can read what Kay has given me and I've done a little bit of editing too sure, whereas the lower East side, Preservation initiative has promised to do outreach to the local community, which will include residents of NYCHA developments, specifically those at Baruch Lillian, Walden, Jacob, Reese. Okay, are there any other comments from committee members, since this is a bit of a hybrid type of resolution, which I know we're going to have to change in some format? Michael? Can you you're going to have to bring up that page again? Sorry, it's coming hold on. Okay, sorry. I stopped sharing, because I thought Ryan might want to share it since she was editing. I only worked on the new warehouses. You all were working on changing the air force and I did not get all that and then they're there for us Ryan. You said you only had the outreach to the buildings I have the other, whereas the it's other, whereas community residents have requested that the interiors of the comfort stations be renovated with all new fixtures and interiors with all new fixtures is enough. I'm going to add. I changed that a little ryan in the chat to you emails. I know to include other. You know, office space, the interiors of the office, spaces, comfort stations and other interior spaces be renovated with all new fixtures and interiors. Do you want to repeat interiors or just say that the office spaces conference stations we're saying interiors three times in that sense? So may I suggest fixtures and finishes yeah. It currently reads: whereas many community members have requested that the interiors of the office, spaces, comfort stations and other interior spaces be renovated with all new fixtures and finishes. Alternatively, it would read, whereas many community members have requested that the office spaces comfort stations and other interior spaces, we renovated with all new fixtures and finishes you can say inside spaces if you want, if you want another synonym Ryan, I do not think we need to stress about that. I think it's close enough. I think it's good and it's close enough we'll clean up as we always do the language a bit later for the purposes of the Zoom meeting and the timing, I'm going to ask for Michael to scroll up to the top and it's been up for a while. So I'm going to assume all of our committee members have read this thoroughly. I know that Susan had a comment about manmade and changing that to human made and Michael I'm assuming everyone's reading at a certain speed. So we can scroll up just a little bit more and I know it's a little quiet, but everyone's reading so I'll scroll up a little bit more and to the last page now keeping in mind the additions that Ryan has stated. Does anyone else have any further comments? Would someone like to move to adopt this resolution? I would like to move to a doc. I like to add something to my hand. Marlon is a lot of background noise, where you're at we should leave out of here where the building is in sorry, Carl repeat that yeah, whereas the building appears to be in excellent condition or you just scroll back down a little bit which we're asked. Okay, hold it right there right here this one right here: yeah, yes, whereas the buildings appear to be in good condition. We should leave out up here where the buildings are in very good condition for the exteriors at least, but I understand that using a peer because I do not think has there been any other inspection other than visual. Oh, it's really only been a visual inspection and that's why we that's why we set up here, but it's a pretty confident appear and we feel that it's kind of a language- that's used a lot in terms of assessing conditions, because you know the more you look at it under a microscope. You might find this issue or that issue, but this is based on the inspections we've done today. Okay, Carl, you come you're comfortable, just leaving appear there, because I understand what happened: yeah, David yeah. I just got like it's very blurry in my computer, so it took me to now to see it, but you have something that should be easy to be a whereas, but I do not think longest was therefore where it talks about man- made stuff causing global warming. It's I think that would be as whereas not as therefore- and I agree- and I said that when we first started that some of the therefore is the language and therefore probably belongs in the no David, do you have language I would just. I do not think it's necessary to mention personally, we want to save the buildings and they're going to make the construction. So that's all we have to say we have to give the reason why they're doing the construction okay. So what are you suggesting? I can just take it. You can just take the line out. I do not think it's that relevant to what we're asking for or what the president is there for it's just. You want to figure out, therefore, whereas it's possible, but it does not belong with the, whereas and it's not necessary for the, whereas so you're suggesting taking the entire paragraph out. Not that line I do not see. I can't read it that clearly, but that line seems to be out of place. No David, I would agree, but what I, what I try and do is you say that line seems to be out of place? Are you talking about the reason why the construction is being done? The construction is being done on the other resolutions. They want to save the buildings. No, I agree with you, but Ryan is sitting there trying to get how to figure out how to edit this. So well, just it's in parentheses. It's in comments. They got the comments. Take out the space between the commas yeah, that's what he's saying just between was made necessary due to human- made pollution and the resulting global warming yeah. I'm sorry! I was not understanding of what the whether he's talking about a sentence or a paragraph or a line. That's that line. Okay, it does not belong there. Your own player is aware, as if as a whereas fine, but it does not belong to, therefore got you understand gone. Anyone have any issues with that. Yeah I'd like to clarify yes, so about these. There first of all, is my understanding trevor that you're going to move them into the warehouses for some of them. Yes, they can they're, not okay, so horrible, where they are. That's cool I'll work on that, okay and then did. I just understand that what we do want to do is cut. The phrase was made necessary due to human- made pollution and resulting global warming correct. Unless someone on the committee has an issue with that removal, all right. Thank you. It would have it's gone. David, yeah! Okay, thank you all right, I see a board member Lisa has a hand up. I'm sorry! I was just going to clarify what he was talking about. Okay, thank you. We did not adopt this resolution so that language we can change it. So I'm now going to ask again if we have a motion to adopt this resolution, you have lots of people without second all right Ryan. Can you take attendance, as I ask, does everyone approve you? Wanna Ryan, you Wanna go through the attention the committee list. Yes, Roll call Trevor Holland, yes, Kathleen Webster, yes, David Adams, Yes, Ron, Altman, Euron, Altman, Carlin Chan, yes, Ryan Gillum, yes, Valentina Jones, yes, Michael, Mourinho, Yes, Carolyn, Ratcliffe, yes, Robin, Chatel, Robin, Chatel, Robin, Unmute yourself, you're on your phone start, six Josephine, Velez, Josh, Joy, Villas, yes, we're there and the lease was up among the landlord the apartment. It was a one bedroom in bobbin. Yes, turn off, Hdtv, I'm in a public space and I'm running out of battery okay. Thank you. Thank you. We'll obviously do some edits to this resolution. It will have to go to full board. I do not think there's going to be a problem there, but thank you for that presentation. It was really informative. Thank you very much. Thank you trevor and everybody. Thank you really great. All right! Next up low East side, Ecology Center couple chart, I know christine has been patiently waiting. We've been here before so I'm hoping this was not does not take too long, but I'm going to let you do your presentation, so yeah I'll make this pretty short short 10 weeks out of the onset of the esker construction in East, River Park and the ecology center is looking at a very uncertain future. A 30 year old composting program which delivers access to composting educates and engages the public, creates green jobs and job training. Opportunities provides finished, compost for community gardens and street tree cares. In short, a national model of the sustainability and resiliency is threatened with extinction, while all of us are staring at an ever escalating climate crisis. Sorry to be so traumatic, but that's just how it is to this part. To this date we have not been able to get straight answers from parks about incorporating a fully funded and approved design for the compost yard, located in a one acre lot, just south of the amphitheater in East River Park into the esker construction. Under the Eska plan, the compost yard is scheduled to move into a temporary location to allow the current site to be turned into passive recreational lawn. The contractor hired to do this work has been in touch to offer his assistance for the move. It seems. The city, however, has not been able to secure the use of the planned temporary location under the Triboro bridge since Mid- august. All progress has come to a halt on the site, preparation moving forward. Is there an alternative plan to guarantee the under uninterrupted country continuation of the composting program? We have solicited support from thousands of residents that signed our petition in the spring in support of the campus program. We have also reached out to our neighbors right acrosss, the Fdr, to support us in staying in East River Park and received a support letter from the lower East Side East River Resident Committee, as well as from our local public elected officials. We are asking CB3 tonight to join the broad-, based support expressed for the continuation of this essential program and environmental organization in the lower East side, with a resolution of support, a written guarantee from parks for all of our programs to that we offer in East River Park, Environmental, Education stewardship and composting to return once esca is completed and a viable location for uninterrupted continuation of composting programs during Esco construction. Thank you. Thank you. Christine, and I know there are some members of the public who had asked to speak, but first I'm going to go to committee members. If they have any questions or comments Michael, I do not see any comments or questions from kidding me members. Are there any board members? Okay, just real quickly christine? I understand that the triborough site is in question now. Could you just say one or two lines about that yeah sure so the department of sanitation was supposed to break ground in Mid- August to prepare this site and the tribal Bridge Authority had then come back to them and had asked some operational questions about the site and that were answered and since then the sanitation has not heard anything from the tribal British Authority about. You know, basically a green light to go ahead with this project, so it is very disconcerting for us to at one at one end being pressured by a contractor and you're running out of time to relocate some place and then the other hand really not having that relocation scheme going any place. David Adams. Thank you, Michael yeah. If why can't we just try to pressure the tribal authority to give an answer before we have to go and or do approach while we go down this road, because if no response does not mean a no well the mayor's office, the Department of Sanitation Parks Department every party involved in this has really tried to elect Ansa out of the Tribal Bridge Park Authority. And you know it's an authority, it's not. You know they appointed by the state, I think by the governor, so by the governors. Yes, we are famously Robert. Moses was also the head of the Mt and not really accountable to anybody. So it's not like the government can really ask so you have not gotten even have you okay, so you have you've tried with the approach. You have not gotten the response yeah. Well, we send this to the governors of New, York and New Jersey and see if that, if maybe that'll make a difference, I think that's beyond the purview of our committee, but I'm just wondering if anybody's on line now from parks who could help with this if aldous here, in other words, you're being you're being moved and you have nowhere to move too, it sounds like I'll. Do Stuart Solano's as his cue all the yeah before you start Aldo, because I do not want to get into it too long. A discussion and we've discussed this. There are specific questions about the relocation which I do not know. If you can answer and the triborough location and any other comments you can make yeah. My quick response is that I know that sanitation has been working very closely on this. I do not have more specifics on that, but I know my colleagues Ben Ireland, who is here for last month's meeting, might be able to speak a little more to it, but I do not think he's on tonight. Well, I get in touch with Ben and he said, since he does not have any updates he's not going to attend this meeting, so he has no updates. There is no you know and as alda as you know, the mayor's office has also tried to put pressure on the tribal workers, all right, very good. Okay, thanks. Thank you. I mean you've been trying, okay, all right, aldo, any or alda from parks or ddc any further comments or clarifications hi everyone, it's Q was there anything specific to dvc that I can respond to there. I can try. I mean I think, the relocation piece. That is something that we have. We know that the mayor's office and sanitation have been leading on and are certainly in support of, making sure that there's a timely identification of relocation site, as I know christine, has been in many conversations with sanitation on. I do not have much of an update on on the broader questions that I know the Community, Board and Christine have brought asking specifically about that exact language that I think is being requested in the resolution. I'm going to reiterate what has been in the license renewal, language that I've mentioned previously, which is that the parts Department is committed to good faith negotiations to lori's side, ecology's center's return to East, River Park as part of future licensed negotiations, but not having gone through that process. I do not have much more to say in terms of specifics beyond that. Thank you, alder just one question you referenced a some language in one of the warehouses and I did not catch that. Oh I'm not. I do not have the resolution in front of me, but I think christine had mentioned a specific language asking for a written guarantee from parks for compost like different programming. Composting education to return to East River park when Asker is complete and on the park side we are committed to the good faith negotiations for Lurie Side, Ecology Center's, return to Eastern Park. We have a pretty standard process that we go through with all park partners when there is some sort of license agreement, that's a negotiation that involves lawyers. I can't at this moment in front of Cv3 parks state what the outcomes of that may look like, because we do have a standardized process for all our partners. Thank you. I think that you answered my question. I was just making sure that there was not any conflicting language. I see. Kay has her hand up again. Well, we have a pretty dense resolution that may at least address what the community board can, but it is getting hard to get a straight answer from. Is it the mayor I mean who parks is taking over the park? Lori's side Ecology center is supposed to move, so I'm not sure what we do to make this go better, that there does not seem to be anybody who has the final authority to say I mean I do not know where how they can't move out of here. If there's nowhere to move too so it seems like at the very least parks could say you stay until we find a home for you. I mean I do not. I do not know. I do not. I feel like there's just an awful lot of chefs and I and nobody who has who can you know some one straight answer agency that says we're in charge and this will happen and you may not be able to answer it, but I would just resolution unless there's an answer from somebody I trevor. I could provide some response to that. If that's okay sure go ahead so, okay, I absolutely agree with you it's. This is a broader, a bigger effort with multiple of our city agencies that we're continuing to sort of make this happen all together and there's a lot of coordination. That's happening between DSNY park. Cdc City hall, multiple units within the city, Hall family. So you are right that there's no one person to provide a sort of a yes or no black and white answer, because this is something that a lot of a lot of us are coordinating together and back to the timeline point that you just brought up. As I mentioned earlier this evening, the with the park is going to remain open for the rest of this year. So with on that note, we have a little more time to figure out as a team as a whole, all together to what can be done here- and I know like I'll just mention. Dsny- is hard at work with tbk with other entities and colleagues that they're trying to figure this out and until leicester has a place to be relocated to we're not able to break ground in this particular area. So just want to clarify a little bit of that and, unfortunately again we're sorry that we do not have a straight up yes or no answer right now, but we're just we're trying there's a lot of moving parts with all this. That a lot of folks are trying to figure out yeah. We understood and thank you Q&And. The mayor can stop by anytime if you'd like I'll relay the message. What I would like to say to that is that, yes, sanitation is tasked with preparing the site, but I do not think it should be viewed as their problem to find a location for us. We've been in East, River Park for 22 years. We have a very strong license agreement with parks that is running out, November 4th, so I also want to- and nobody has been in touch with me, to figure out how we're going to quote- unquote, remove this again for another month or whatever piecemeal. We want to that parks is offering to us, and I would really like to have better more comprehensive answers to questions, because as an organization we need to, we have contracts with the city that won't allow us to perform certain work if we do not have other things in place. So you know it's not like that. Easy there's a lot of things involved and all we're getting is living in limbo for the last year, and I just would really like to everybody aware of that is very distressing and as an organization we need answers, and I think foremost, parks is not ready to answer our questions and we are basically all surrounding composting on parkland. There seems to be a whole other agenda, where other groups are also impacted by the same policy decisions that are not talked about in public by parks. Nobody knows how they arrived at it as a public. We do not know why parks arrived at this fabulous idea to turn the compost yard into a passive recreational lawn. It was announced publicly once that process was in place and going forward. It was no transparency whatsoever about this program, so seeing good fit effort that Parks is named is making. What they have showed us for. The last two years is nothing that I would characterize as a foot faith effort to really engage with a partner. That's been a partner for two decades. Let me do this because I know there might, although we have a draft resolution already, it's a very long draft resolution very long, but I want to see if there's anyone who has made it through this point in the meeting who wants to speak from the public? Okay, I would, can I be unmuted. You are unmuted. This is this. Is Mary Jo before you go Mary, jo? If anyone else wants to speak, can you please use the raise hand feature sorry? I could not find it trevor yeah, I know Michael. Can you go over the sort of requirements for raising your hand? Sorry, I did not realize I was muted, so you just need to go down to the toolbar on your screen. It usually disappears when you're just watching. So you just need to move your cursor down the bottom and the toolbar will appear and you'll see a thing that has two little heads that says: participants if you click on that it opens the participants tab and that's where you will see the raise hand feature. Alternatively, if you, if you can't figure that out we're going to ask you to send a message to the Community Board or the host and say you'd like to speak Harrod, I see you raising your hand physically. So we're going to cue you in somewhere along the speakers, just please keep in mind that we do have a draft resolution and I know everyone likes to speak, but Mary jo, I think you're the first one to burst through so go ahead and speak okay. I just have a question for the mayor. Comes on the wnyc every Friday at 10. Has anyone tried to call and put him on the spot on this hello yeah? We just, I do not know who's going to answer that? Hey christine. I just wonder you know, because would this help or does it have you tried or do you think it's just well, it's very hard to get through because a lot of times the these phone calls are screened and I have certainly tried, but I could not even get through to a screen through the screener, and I do not know whether putting him on the spot will necessarily give the best answer or the most you know we want right. Sometimes he says: okay, give your you know, information to Blah and we'll follow up, so I'm just trying to get more ears on it and more attention to it. So that's all! Well, you know. I know that during esker negotiations he made statements both to Carlina Rivera and to gail Brewer, assuring both politicians that the ecology center will get what it needs. I know mayor de Plazio personally, I worked with him on e- waste and you know so he he's certainly not a stranger to but he's also. You know a politician. I think we are just really caught in a lot of cross currents here, got it okay. Thank you. I'm just going to go to Lisa Kaplan yeah. I just want to very briefly ask the representative from Ddc. I'm sorry if your name is Queue Mary. Do I have that right? I thought he said, but I'd like it confirmed that absolutely the lower East Side Ecology center would not be asked to move until a relocate, suitable relocation site had been identified. Is that a commitment that is that is our goal again we have a project. Can I can I answer that is. That is our goal. That's what all of our colleagues at city, Hall, DSNY, Parks and Bbc. Everybody is working very hard at with a coordination with christine and her team as well, and we're trying very hard to figure this out. We have a. We have a much larger project at hand that has a schedule and time frame that we need to. We need to try to stick to be able to deliver this protection project on time for this neighborhood and this community so, like I said, there's a lot of moving pieces and there's a lot of areas and entities that are working on all of this. Okay- and I misunderstood you- I thought I heard you say that, but now I'm hearing no, I did not commit to having lori's side ecology center to stay there until it gets figured out. That was not my commitment. Oh all right! Thank you. Next is, and I'm just going by who I see wendy or you know, wendy, please hi there. You know Michael Stark, the timer. Please compost is an important physical action. It people they're 500 families in our community that compost weekly. We just heard that there's a hundred people a day using the ferry and it seems like the whole design of that end of the park and pier 42- is to accommodate those 100 people a day. This is to me is a form of eco- Gentrification and it does not serve the vulnerable community that we have nor address the core reason why Esker exists I've already written in and suggested that in the when the new park is done, there's way too much space being given over to regulation- sized tennis courts? It's what now it's covering? What's now the dance oval, as well as the tennis courts, and if you check on the city's website, you see tennis courts are closed from thanksgiving to sometime in April. So that's a third of the year that the whole center of the park will not be able to be used by the public. So I'm suggesting reduce the number of tennis courts to six and put composting right in the middle of the park, where it will be a lesson for all of us and appreciated very much by the many people who steward the park, as well as the other parks, community, gardens, Schoolyards and street trees in our community. Greening. Our community is really important right now and I'd like to see that it be prioritized the compost, yards location throughout construction and return to the park be prioritized because they are productive and create so much positive activity by the community that we really need to have if we want to become more resilient. Thank you. Thank you. Wendy Mary Loftus, I'm sorry! If I pronounce your name wrong hello, this is Mary. I'm John's center, I'm Mary's husband and I'm speaking for both of us. We were both longtime residents of Cv3 about 40 years worth I've known christine personally for more than 20 years, and she is a very smart woman. She's worked with city agencies over many administrations and frankly, I've been impressed with how she's been able to do it. In fact, I've been astounded by what she's been able to accomplish over many years, and I would just urge this committee and full CB3 to support her and the lower East Side Ecology center, for which my wife and I have been participating in the compost program for probably close to 20 years. It's a valuable public service. It serves a lot of people. There are a lot of volunteers. There are a lot of people involved, it's a public good. It diverts resources from usable, organic materials from landfills, and please just do whatever you can to help them survive and get a little bit of stability and that's pretty much it they're worth it and they've proven themselves over 20 years, they're, not just starting out. She knows what she's doing. Thank you very much. All right, thank you, Rocky Chen, so I do not have a prepared statement. I'm really glad the community board, as you seem to indicate trevor, is familiar with this issue and has indicated support for this resolution, which I urge you to do after such a long meeting. But I do want to point out two things. One is when we had the whole issue regarding basketball city. Remember they started out as a license and they finally said you know we're going to be there for a long time we're going to put in all this effort and the city. Eventually, the EDC gave them a lease. You know the city can do it when they want to, and here you have a ecology center non- profit. It seems to me that the problem is the former person who spoke from Ddc is kind of saying. Well, you know there's many different parts. I wonder how this project is being managed, because when you manage a project like this somebody, it has to be some internal management. So I would recommend, in addition to this resolution, that we work with the elected officials or even the mayor. I mean there needs to be somebody inside that management that has this front and center, because I do not feel that Christina's voice is being heard in the nitty- gritty day and day kind of decision making. So at the end of the day, we may just end up people saying: oh well, we tried to do it, but you know whatever. That is not. That is not satisfactory. It seems to me. I do think calling the mayor might help if some people want to do that, but I think in addition sometimes showing up at people's doorstep or whatever. But ultimately it seems to me that you know our colleagues in parks and Ddc and EDC. Whoever is working on this have to be working on this almost daily, and we need to have somebody in that internal management operation advocating for this, and I think, there's a failure here of communication because, like as much as I'm sure, there's good faith people here we're just getting frustrated. I think thank you, Rocky Harriet Cohen. You need to unmute yourself, Harriet, I'm a longtime community resident I'll. Be brief. I won't even do everything. That's in my statement, but I just want to say that the compost yard on composting is a really important community institution. It's important to all the users, the people along there from public housing, the co-, ops, the Mitchell Llamas and the tenement buildings and the gardeners who get soil from there and it provides green jobs, five green jobs, three permanent ones and two part- time ones. So since it seems that there are no definite plans to relocate and bring it back. Even though there's a lot of talk and a lot of people involved, I think that community board three needs to be more strategic in its position and demand, and it should strongly support the yard remaining where it is until a suitable alternative site is identified and a, and we need a commitment by the city for its temporary home and its return to the renovated park. No verbal promises, commitment signed on the dotted line. Our community knows the pain of broken promises and city commitments, with no teeth, as exemplified by the 2000 families that were displaced by the Sued Park Urban Renewal area in the mid 60s, and were promised relocation housing that never materialized until over 50 years ago. When not everyone is alive here or even can be accommodated. So, let's make sure we get the relocation and return of the yard right and in writing, and we want the community board to work diligently to make this happen and we'll work with them. Thank you, Harriet before I go to the last two speakers just to queue yourselves up, that would be ellen Garvey and Joyce and Amy Burkhoff, but before we go to them, I'm going to I sent the draft resolution to all committee members because it is very lengthy. I imagine we're going to do some editing, but if you could take a look at it now, I it might michael you're going to put it up on the screen after we finish these last two speakers, so Ellen and Joyce you're. Next, oh there we go. I want to add a very small point, which is well not small at all. Actually, it's that the yard is an educational facility and in a time when our, when children are so cut off from physical activity and learning in those zoom boxes at school, to learn something about the cycle of life and how waste turns into organic matter and turns into soil and turns into food and to see it and feel it and how experience it is just so vital and we have to keep that we have to keep it and have a commitment from the city for many different parts of the city to hold on to it, and now I turn over to Joyce hi. Thank you start the clock again. Are you going to start the clock again, we'll let it run we can okay, we can start the clock too. Okay. Thank you. I agree with everything that ellen said. I agreed with everything that Harriet said and all the other speakers. Actually, we want CB3 to pass this resolution to relocate and bring back the composting yard to our park, and I understand the current plans do not have anything about the composting yard in it. So why is this important? It's not just that. We like it sure nobody likes to waste what we have and we do not like to waste what we used, but there are real reasons not just that we like it. There are many reasons. I'm only going to review a few. Why the most important for all the electeds, I believe, would be that composting will save New York city money, how by composting you do not have to buy fertilizer chemical fertilizers by composting. The will keep the moisture in the soil longer so you'll use less water and also composting reduces the waste collection fuel cost. My two favorites are that co2 from co2 emissions from waste transport vehicles will be reduced by composting and also one of the things I learned while thinking about this and researching this is that when organics are put in landfills, they break down without oxygen. This produces a methane gas, a greenhouse gas 21 times more harmful than co2. So let's keep our composting in the park and, let's make sure they have a home to live in while the park is being rai, is raised. It's raised, it saves money, saves resources, better soil and reduces our impact on the environment. Thanks. Thank you, Joyce and our last speaker, Amy Burkhoff. Thank you, and I want to thank the Community Board Parks Committee for supporting the ecology center, so I'm Amy Burkhoff 40 year resident of the East village and long- term friend of the Ecology center. I want to just read the notes that I took when Q was doing his presentation and my notes say no closure this year will not break ground without place to relocate compost yard. So that may not be what Q intended to say, but that is what at least two of us and probably more of us sitting out here in our zoom audience heard, and I just want to point out that this is really like a crystal clear example of the lack of transparency and the bad communication that we've had about escr from the city and if we can't even get the story straight on a simple statement like that within one Community board meeting, it's no wonder that you know things are going askew. Thank you. What happened? I'm not is the meeting continuing yeah, I'm just bringing up the resolution. I think trevor does not realize he's muted you're. Absolutely right. I was muted val had her hand raised at least it looks like her hand race. I was asking if she had a question. Oh you know I'm looking at the draft you sent and I think it's the second to the last. Therefore CB3 strongly supports the continued occupancy of the compost jar in its current location. Until such time as a temporary location, site is definitely available at the tri- barrel bridge infants, or preferably at a location, closer and more accessible for CB3, that such location only happen when and if it is absolutely necessary whatever. Anyway, you know the other thing to all. It is, let me just say I grew up in the projects down here on the lower East, Side, Ruckus and Laguardia. So my concern almost always is the people in affordable housing in New, York, City, Housing Authority, and I know that at one meeting I went to one of the big concerns that I heard from people in New, York City, Housing Authority was the fact that there's a deadline on the money, and so I do not know what I exactly. Let me just say this. I think that one of the things and while I it's somewhat sad to me that I think some of this stuff gets pitted one for the other, and so really all I want to say here is to me. I have family and friends that live in NYCHA and I want to see them protected and I do not want to see something. That's non- people be the reason they're not protected. That's all I want to say- and I've said this at every single meeting- that I want my family and friends protected, and I just think that somewhere in all of this, we seem to be losing that this is about protection of people at a point whether we like the way the city is doing it or not, that the bottom line to me is protecting the people, and I just want us to be mindful that a lot of times for poor people suddenly there's not enough money to do that. But you can do something else, but you can't protect them anyway. That that's my point right. There is, let's not forget that this is about protecting people, their children in Baruch, Lillian, Wall, Jacob, Reef, all right val, and I hear you- and I understand that for that particular sentence or that particular therefore I'm going to go to k who's going, who has her hand raised? But if you can, if you have suggestions for either additional language or to modify that, can you think about it and I'll go the k and okay, as you think about it, go ahead. Kay, yeah, hi, Valentina, absolutely agree. I do not think anybody here thinks that the compost yard, Trumps anybody's health or safety period end of sentence, I think par. What this paragraph intends to say- and I may not have said it well enough- is that if there's no place to relocate to that, it simply remains there. So it does not affect anything going forward. Things can move forward to the degree that this whole project can move forward, but you know, then we would be asking parks to renovate it half and half as they can, but that absolutely no way does this, and nor should this slow down the progress of this project everybody. I do not think anybody would disagree with that and it's a really good point and maybe there's a way to say it better, yeah that you know. I appreciate you saying that this will in no way interfere with protecting the residents and maybe that's all that needs to be said. There just add that you know at the end of that. You know the last sentence there that this will in no way affect protecting the residents of baruch, Lillian, Wall and Jacob Reef, and I'm fine with that yeah. I do not. I do not know if we can say that, but what we can say is that as a community board that, if there's no place to move it to, it simply remains there and the project moves forward that it like. I like the language of- and you know that this in no way impacts the protection of the residents of Baruch, Lillian, Wall and Jacob Reese, because those are the three New York City Housing Authority developments that are acrosss the street, so you're saying that this in no way does that's all. I want to see there if that's like the last sentence there that this in no way impacts the protection of the residents of Baruch, Lillian, Wall and Jacob Reese, I'm fine, because that's all I'm fine. I would I would I hear he's saying, but that therefore clause it makes it difficult to add that statement unless the word or a similar word of unless or as long as it does not affect. Okay, that's fine, as long as it does not affect protecting the residents of Lillian, Wall, Jacob, Rick and Beru. That's fine, and I would also change that because there might be other nitric projects that could be affected to just say: NYCHA, housing and other housing, because there are, there is other housing there, other housing, but just state Baruch, Lillian, Wall and Jacob Reese, because they're right, acrosss the street and that's fine, that's fine! Unless, because truthfully speaking, I do not have a way other than to come out of this to go, write, something I'm not that tech savvy senior citizen here Ryan. I know that you did not capture that that's fine, because I did not capture either half but just simply saying it. No, I know I I'm just in terms of how it should be. Let me try and try why we're doing that. David has a question: David Adams yeah, I'm trying to make sense of the air force and that really does not flow. Are we up to that point yet or we should get back to it later? No, oh there's a lot of whereas- and I I'm assuming- I may have read through it, but it does cover everything we may subtract, I'm talking about the Air Force right and I'm getting to that point. If you see, if you want to talk about, therefore we can talk about it. Okay, my I think the first. Therefore it's fine, but this last one should be the second one, and then we there, therefore being further resolving what they do in the interim that which you have there, which you pick and that's. I think that the first, therefore, that we want to speak to someone to what's happening be a further resolve that they immediately put it into the plans and then in the interim, until they could be reinstated to find another place or to be and the conditions of the relocation so you're saying move the last therefore put it as a second one. That's the most important one if we happen to lose it during the reconstruction, there's not much, we can do, but we want to make sure it comes back when it's reconstructed. Okay, so we can move that to number two. Unless someone you know, I that's the way, I'm looking that's, why I'm you know and then, while we in the interim you like to have a place to use in the meantime, you know and be doing uranus job and that, but that's all okay Trevor anybody here say again, Ryan sorry. I think that makes sense. Actually I see what you know: it's like here's, what we want? Okay and then here's what this is. This is our bottom line, but in the rinse room we'll be good to see the accommodations, but the bottom line is we want it back, gotcha? Okay, do you have that language? Yet no I'm doing the other language Ryan. Did you get that language? No, the language that you're working on? Oh! No! Let me just okay committee members, any other comments about this draft resolution. So you know comments. This is a very long resolution and I'm hesitant to say that we need to read it our committee members comfortable with the way it's written with the addition of the language that K is going to work on and we'll get that language before we take a vote on it and with David Adams suggestion that we move the that one of the therefore to therefore strongly supports the continued occupancy paragraph to number two, I'm fine with that. Okay, thank you. Michael for responding, I'm also happy to read it. I did not want to make you read it because you had warned us of the long meetings and the need we might have to split, so I'm really trying to be efficient here. It's just that it's every meaning! We got something that's controversial, and I did not think this would be that much since we all sort of agree with this resolution trevor. I think there's a lot of support behind this resolution, so I think I find that it's very lengthy, okay, okay, we're going to move we're going to. I think we have enough information from what val had said to offer that as a therefore be resolved, where we are asking to make sure that this particular resolution or the efforts or the support for the Ecology center and its composure does not prevent or delay the flood protection for the residents of NYCHA, including the ones mentioned, and for the other surrounding buildings. That's excellent, Trevor! Excellent. Thank you. I'm going to ask for a motion to approve this resolution. I'm going to ask for Ryan to take attendance, I'm sorry to take the roll call vote. Okay, Trevor Holland; yes, hey Webster, yes, David, Adams, David Adams! We lost him. We might have no he's here. David, Star, six! Hello! Are you converting on the resolution for the okay? Yes trevor made with no delay whatever? Thank you mute yourself, okay, mute yourself. I got it. I did it Michael Moreno! Yes, and did you hear Carlin, you did say yes: okay, Good Carolyn Ratcliffe, yes, Robin Chatel, yes, Josephine Velez, yes, Troy Velez, Troy villas he's still on Troy there Troy, let's move on! That's it he's the last okay! Thank you. Everybody. The resolution passes the committee obviously go to full board, but we appreciate your support for this resolution and the time you've taken to come out and speak for this agenda item next up- and this is more of a more committee work. We have to go over the district statement and capital expense priorities. I previously sent the committee members a draft of these expense priorities. I do not know if Susan is still on yes Susan. If you want to give a brief introduction to what we're going to do next, you want well. Do you want to do the district needs? First, because I was only going to speak to the priorities. Okay, Michael. Do you have the latest district needs? No, I only have what you sent me, which was this yeah susan, we're going to go in backwards because I'm going to have to send it to Michael, okay, so there's actually and before I give my little Spiel Michael there's this plus. You have a word document list. Also. No, I was only sent a pdf, but but is: does a pdf include a regular list? That's not an excel list! No just these two pages- oh wait: maybe it does yeah it does. I'm sorry, okay, good! Thank you. It's going to be complicated, so I'll just go over briefly what these budget priorities are for every year we vote on a ranked list of 25 priorities, expense priorities and 40 capital priorities for city agencies, expense priorities are items like programming like recreational staff for parks or well programming such I should take that back. That would be an example of staff. It could be programming like for the Ecology Center capital are generally items that last at least five years and cost at least thirty five thousand dollars and parks always has the most capital items. The goal of voting on these priorities is to bring more services and money to community Board three for needs that we decide are the most important. Therefore, for programs already well funded and not in danger, we would not waste a priority on it. We would want to advocate for something that we do not have yet, because these are agency priorities. They do not include funding from City Council funds or state or federal funds that may be administered by agencies. All of these, I won't go into how we research them, but they're all very researched before they come to the committee that includes meetings with agencies at the committee chair and office, go to and question an interview of the agencies. All this information is on our website also, and if anyone has other more detailed questions, or they want to know more about how it's research you can, you can ask me, later after the committee's rank and vote their on their priorities, the lists are collated from all the committees to create one list for the board. The committee rankings are very important since there's a limited number of priorities, particularly for expense. The bottom ones may fall off the final list. Capital priorities since we have 40 and most of them are parks. Most of the capital priorities, I would say, would be on the list and that's it if there's any. If there's no questions all right before we go on to that Michael, do you have the district needs? Well, if I have to stop sharing or else you're going to okay, good yeah go ahead and stop sharing and pull it up and ryan, you should also have it now too, but it's in its final format. I just want to go over it before we go into ranking our yeah. I have it now sure. Oh actually, I have a blank email from you that says: Park District needs, but there's nothing attached yeah. That would probably be what I do at 9:33 on a Thursday. Sorry, that's right! While you're doing that, can I ask you a question about the budget priorities. So are the green marks and stuff? Is that new stuff, or is this an old document, or is that like stuff? No, those marks, all the marks mean something and when you put it on the screen, I'll tell you what it is. Okay, awesome! Thank you all right, Michael I just sent it so it should get there it used to be. I could just pass it down the table got it. So am I putting this up now or are we going back to the budget list? No district needs. Okay, it's just opening up hold on Susan why he pulls that up. Did you have any comments about this about what the district needs? Yeah? No, okay, just to note, we short we shorten your couples, paragraph to make it more concise and to fit still keeps the essence of what you're trying to say. It's just that for district needs. You really need to focus on. Oh, that's a small screen. Do I want to make the font size bigger? No, I it's fine. Where was that trevor? I did not see. I just did not see it. It's fine! If it's short and I'm not, I do not do anything sure, yeah Ryan. I heard that guffaw all right. Actually, the library section was also shortened. The library section was shortened and there were some grammatical changes. Go ahead. Susan! Sorry, I was going to say the changes that were made were basically the district needs statement is to say these are unmet needs and it was kind of changed to address and be very specific. This is what we need, and we've gone over this for the last few months. So I'm going to quickly go over this, and if anyone has any questions, do not ask no go ahead and ask him but Michael Scroll down again and we've gone over this for the last few months. So it's nothing is: let's go back to the top. You mean no, I'm sorry keep going keep going. Some of the things that were filled in is where we said we would not know until October, for example, the Laguardia Bass House Turf Field was not complete, it is now complete. The RFP was issued for baruch and some other things like that, which we were waiting for confirmation for parks, everyone, okay, I'm going to take that as a yes. Is this still a track change here? That needs to be impressed or we have not finished going through. No, that should have just been. We changed the we reworded the pier 42 put in more information. Okay, here's your coaching paragraph yeah, that's great! Thank you and Michael. Some of them have not been accepted because I said this is the version that was sent to the community board. What I've also learned is that, if you're working with the Google version of Docs and the Microsoft word version, it does all kinds of weird things: it's terrible, yes, and so what's happened is because we're not in the office it's very difficult for us to access our shared drive, so we're using Google drive a lot where we never did before and that's why you're seeing these problems so you're going to see some extra spaces some formatting issues, but we'll take care of all that we'll fix that any questions seeing none. We do not need to vote on this, we adopt it and but you can vote with it at the same time as a budget priority. We shall do that Michael. Let's pull this off and put the other one up. Please am I staying at the list, or am I going up so let me tell you this list. What I did is I went into last year's list and removed everything that was not a parks item and everything that has a check on it. We have confirmed it's on the Excel sheet. Everything that has a check on it is still on the parts list that it needs to be funded. The things with the stars. Those are community board three items from last year that are not on the parks list, they're things that we want to add or that we wanted to add last year. So I do have information now the community garden funding. I do have information that this that they have been for the first time that they're baseline and that the expense funding for the community gardens. You can actually take that off. We will need one on the cap, I'm sorry. This is the capital we, this community garden capital funding, can be changed for water installations and fencing and and take out the electricity and soil replenishment. So it will come, it would come off the expense line. Then I'm sorry, I was mistaken. It's on both expense and capital. This is capital leave it here and when we get to kappa expense, we'll talk about it. This should stay here. It should just be rewarded. So you'll see number eight dry dock that's coming off because it was done so you'll see my asterisk means it's a community board three, something we added it's not on the parts list. Everything else is the order that we had last year and still needs to be done now when you get to the Excel list and let's not talk about the priorities now so at the bottom of the capital. If you go to the bottom Michael, I'm sorry, there was one thing that was added from the public hearing and that was the bathroom for pier 35. So that's another new one, that's on the Community Board list, but not on the parks list. Does that all make sense? Yes, okay! So much! I do not know how much of it okay! So now Michael if you want to go to the Excel list. So this is the list parts provided to us of what they feel is needed. The numbers you see on the right hand, 3:19 that just indicates to us what our position is on our list and you'll see that I've marked, I think, four or five things are brand new. That parks is saying this needs to be done and we do not have money yeah. So it's one, two, three four one, two three four five so they're asking us to add that onto our list, so the committee needs to with the first list you need to see. Do you want to keep that same order or not? And for these five new ones, do you want to add them, and where do you want to add them? Susan we had 19 on the list before was there. I do not remember if there was a reason why we had 19 or is there? Is it? Can we go to 25 for the capital? You can go as high as you want. Did we just okay? They had last year gotcha? Yes, so you could put everything on that you that you want there. It is when it comes to capital. It's not true for expense when it comes to capital. Put on everything you want right and, as we've done every in previous years, we tend to stick with what we decided on the year before unless something changes. Otherwise it becomes a bit unwieldy because we have to examine every single item and where it should go, and I do not remember Michael. Do you remember the system we used last year as far as moving things yeah, we basically just looked down the line and asked people if they had opinions as to whether or not they felt it needed to be moved up or down the list. The only thing I would add is that considering the Covid-19 environment, that we focus on issues of space, children's playgrounds and any bathrooms or open space that have not been renovated or if a space needs it Carla's got his hand up Carlin go ahead, can barely hear you carlin. We just hear you fumbling with the microphone. We do not hear you speaking. We hear some humming, but I mean some electronic background, but no, we can't hear you no colin. Let me do this as you fix your mic. We're going to meet yourself and I'll see if we can figure it out. If not, if you can type it into chat boxes, we can't fix it. Let's go to val, I'm not sure. Are we saying that public bathrooms are a priority? I'm not saying it's a priority, I'm just saying considering our new environment, we need to think about what's important as we rank these priorities. I'm not saying it's number one, but I do think it's important that parks have bathrooms to prevent people from using bushes and walkways and other areas to either urinate or defecate, so in a covered environment or in any environment. I do think it's important that parks have fasteners well see. I guess my issue with the bathrooms in a Covid-19 environment. Is that exactly that you do not want people sharing bathrooms one of the things they say right now as to why you have high spread in certain areas is because, if somebody gets infected, you know like and they're all living together, they're using that same bathroom and that's a problem, and none of this work is going to get done for at least a year. If not more longer, people using a bathroom together is not what you want to do. I mean, I think, that one of the big issues right now in the city is exactly that as to why they're doing certain things as they want to make sure that people are not using bathrooms together to be specific about Michael's point. None of this is, for the current time we're voting on priorities for the next fiscal budget, which starts in July 2021. So what we're saying is this would become the budget in July 2021 and then they would start planning and building from there. Okay. Well, let me just go back to something the governor said today that I was like yeah, I think you're absolutely right. Covid-19 is here now we had Ebola, we had Sars and something else is coming too so. But that's all I have to say is that public bathrooms is not what you want: Covid-19 saws, Ebola, something contagious wow. I hear you, I hear you we're going to move on because we got a long list. It's already 9 48. you. I was just making a comment about public bathrooms, but if you do not, I was just making a comment about public health done. Thank you. So you have a total of six new things. To add that you may want to add to last year's list all right so to Susan's point the six new things, we're going to add them all to make this easier. It's just a matter. Do we think we need to put some in front or in back and the new things are in yellow, which I've also been highlighted for written in Green Marker, Nathan, Strauss, Kim, Law of Stewart Park Coleman Oval in Columbus park, plus the bathroom for pier 35 plus the bathroom for pier 35. Although I do not know where people are going to go, if they do not have a bathroom in any case, go ahead, Carlin Carlin's still trying to speak Carl, and we can not hear you. I think if you could write it in the chat. We can't hear you carla. If you can try and tap type it into chat, it might be a little more efficient. So those does anyone object to adding those five items: six items: no okay, the current list that we had not thinking about the new six items. Let's start with the first one, which we've had as a priority and will continue to be a priority, is funding for pier 42 brand new park. The Allen Street malls, which have I do not know when they're going to get done. That might require a new political push happening soon. Sdr Park to reconstruct the riveting playground parks. Susan, has mentioned community gardens that the it should change to capital funding for new fencing and installation of on- site water, correct right. Anyone think that should move SDR park, funding degree construct the first floor of the Staten Street park building and create a community space and bathroom a bathroom accessible to the public, storehouse parks, the Hamilton Fish Recreation Center, Roof parks, Roof, Terry, Clinton playground and there's one. That's now removed dry dock playground. At this point, I'm going to ask: does anyone think any of the new ones should be put at this new spot just to make it easier and carlin? If you have something I'm going to ask you to type it in, I still do not see anything if you have, unless Michael saw something no yeah, I think I think it's easier just to move something to this empty spot, like you suggested, I'm just trying to think. If it should be the bathroom at pier 35, I would actually like to see the Coleman Oval Playground be moved into that spot. Can you hear me? Yes, we can now, oh okay, all right, so I did we lost you again. Carlin can't hear you Carla Carl, I'm going to ask you to type it in. If you can Michael. Did you see it? I think he said he did type it in no carlin when you typed it in it. That was a sent to Mountain Community Board. As for the chat feature privately, all we hear is really heavy static at this point, probably what you can try, because it's really just static. You can try calling in and using the your phone as the microphone. So if you use the call- in number we're going to continue, does anyone I'm going to recommend that the Coleman Oval Playground be moved to that spot? That's fine! It's fine is somebody capturing these changes. Ryan. Are you doing it? Do you want me to do it? Oh I. This is a whole pdf. I have no way to like access and mark it up, Michael I'll. Do it by hand? Okay, all right, so that becomes number eight on this list. I just realized. Number nine is missing: it's just a number: it's just a numbering thing all right, so we can add another one number, nine and I'm actually going to while you're go check the website to make sure okay, so we'll out of this number nine and then reason. One reason why Susan? Okay, what I said is I'm going to check on the website to make sure, but there is not a number nine correct right. So what we're going to add for number nine- and this is what I'm asking for there there's absolutely no bathroom facilities along the entire waterfront and it's a place. That's become heavily used, there's nowhere to go so what people do is they go anywhere? They can so. I know it is a parks thing because it is now managed and operated by parks that we get a bathroom of some sort, even if it's temporary parks can do that along the waterfront somewhere. Okay, there's nothing missing from the list, so you can make that number nine. Any objections, carlin still has his hand up. I do not know he just he just rejoined so like we can test it again. Carlin. You want to try to speak yeah hello. Can you hear me now? Okay, I'm on my cell phone all right. I added I edited a text about Columbus park. No, I sent it into the group chat, but you do not see it. No there's nothing in the chat. Maybe you did not hit send or maybe what did? What do you want to say? Okay, we need new perimeter fencing on both sides of the park along the athletic field. Right you have it on one side, only on the more virtually side, it's also only the chicken wire there. So you might want it and then, where it says new Columbus park, it says new permanent fencing on Bachelor street between hogan place to the children's playground. You're saying add something to that yeah: we need it on the opposite side of that play field. Also right for this language. Can you give me language because I do not want to say opposite side? Is it the West side? This would be the east side. Okay, maybe that's the best way to do it, each side of the playground, okay and the you're saying and or I think, the best way to put the east side of the the East eastside along Mulberry Street from the children's playground to the end of the soccer field and Carlin. Can you just send me an email with that language? I'm writing it down, but I want to make sure I get it right. East side along Mulberry Street from the children's playground to from the children's playground too, to the soccer field, soccer field and just email that to me. Okay, all right- and I recommend that we do the thing you said please do not do, which is in Seward park. They just had a huge renovation, and I see that number 13 is the ship fountain, which is incredibly expensive, and I think that something should happen for Columbus park before that park, because Columbus is really anyway. It seems more structural things that need to happen there. Okay, so one minute, the reason there are less things for Columbus park this year is because, as part of the mitigation for closing Rikers, everything else that was on our list from last year is now funded yeah, I'm not disagreeing with what you're saying no, but I, but I also know that I assume some of that funding will be a little stuck because the jail is. You may be right yeah, so I would just you know: Seward Park had a huge renovation. I think the shift fountain is gorgeous and I think it's probably going to require more of a private donation kind of thing because it's you know we're in we're in a tough economic climate, and I think we have to go for things that are more structurally important. Okay, I hear you and I'm going to read the next one and you tell me where you think it should go tompkins square park in ground, mini pool anyone think that should move or Sydney Hillman. I only think that seward park should go to the maybe even the bottom. I do not know. I just would no. I know I said when we get there so Sydney Hillman, Playground, Affinity, Smith, Rec, Center Kay is suggesting that the restoration of the historic shift fountain be moved. So let's hold that. Let's move that off the list for now and hold it until we can find an appropriate space and you're suggesting move the Columbus park permanent fencing in that spot, yeah. Okay, so that would become number 12. number 14 little flower playground, parks, Baruch Playground, I'm going to stop here. We still have three new ones: Kim Law, Nathan Strout from Seward Park, the renovation of the playground for Stewart Park, I'd like to add them somewhere. If we were going to rank the remaining new ones. Where would folks suggest that just between those three park came on in construction? I do not think I've ever I've ever seen, Kim law on this list and it's new. It's new. I mean I've, never seen anything fork in law come up in the four years that I've been doing this. So I would not mind them. You know, and I and I was going to say that corleos number 16, we can probably move that down. A couple I mean parks is never going to do it they're just never going to do it all right. So I got ta make sure I keep this right because this is now becoming. I also think Kim Lao could go before number 19 SDR park, because that also is never going to happen until there's a whole lot of money. The Quinoa Square is now moved to 16. yeah, I'm going to move up, Montgomery East Broadway to 17. Yay yeah ABC playground at 18.. I know, okay, you do not want those sidewalks replaced, but we're going to keep that at 19.. No, I do. I just think it's I no! I understand yeah, but it's at night. We're at 19 at this point. Keep that at 19. Corlissa Park now becomes 20.. You could put the other 20 ones before us, but they're never going to be. What we were told is that they're never going to do that, they're not considered doing it until after escr is over. Okay, all right, so you want. Let's move that to the bottom right. We have Nathan Strauss, which would become 21. Seward Park, which would become 22 the fountain which would become 23.. I think we capture them all. Okay, then we can go to expense. Yes, okay, so number three for the community gardens. I'm told that there is now baseline funding. That is adequate, so you could actually decide to take that off all right, so we're going to take it off and the tree pruning. I that has an asterisk by it, because parks did not include that on their list. Although the funds have been drastically cut, they've been cut every year and they're further cut, so I left it up. Keeping on yes, okay and the last one will be parks, enforcement, police parks, yeah. I mean they're all there to be honest, they're all really important. Okay number 20 at the end, just a weird leftover from something else: that's the bathroom for pier 35. I think you put it in someplace else. No, I mean at the end of expense priorities. After parks enforcement police, it says number 20 increased funding, so the neighborhood branch libraries. Oh I'm sorry thank you Michael. That should be there. That was ad. That's I took that from the library list, so that should be well number six, but it's really number five. Yes, correct! Okay, any other comments. Do I make a motion to vote for these budget priorities and the district needs and the district needs once a second matt hi Second Ryan. I hope you captured all that movement with the Mr Michael. Please make sure you send me the tape of this, because I think I got it, but I'm not sure 10 o'clock, you did a really good job trevor. You say that every time it's 10 o'clock or 10 30. yeah, I did a really good job. You did. You did roll call. I mean I'm sorry. This is a motion to approve the district needs and the budget priorities I vote. Yes, can we I'm sorry, can we can we combine that motion with emotions? Does that need to be a separate motion? We can combine it right, so I will amend my motion to include an motion to adjourn. Yes, I'm ready, I'm ready, k, Webster, yes, David Adams yeah, even on the motion to Adjourn yeah you're on Altman Carlin Chan, yes, Ryan Gillum, yes, Valentina, Jones No on the one with the public bathrooms, whichever that was I'm a no yes everything else, but no public bathrooms. Okay, thanks, okay, so value either. So does that mean you're voting, no on the district needs and the budget priorities? But yes to adjourn? Oh, yes, to adjourn no to the to yeah, no to the bathrooms! Nurse here, okay, before we move on Ryan, I'm going to interpret that as she's voting no for district needs and priorities. Yeah, that's right! You can say no to both of those and yes to adjourn. Okay, Michael Marino, yes, Carolyn Ratcliffe, yes, Robin Chatel, yes, Josephine Velez! Yes, troy bellas! That's it! Yes, troy! Thank you surgery, guys, I'm in surgery! Sorry you're done! Thank you troy all right. That's it good night, everybody good night trevor! Thank you, Michael! Thank you! Ryan.",
            "summary": "Thank you Michael, and welcome to the October parks, Last month's meeting was a marathon at four hours, so I'm really not going to try and cut people off You want to speak on a topic which is on the agenda, I'm, going to ask for you to wait for that agenda item to come up.\nA lot of them are not adhering to the guidelines at all for Covid-19., ferry, there's been an issue and All those things have changed since Covid-19 we're going to go into a discussion about the reduced number or the reduced data to reduce the service that the Corlears Hook stopped.\nSo, just to give you a background and a map of where the ferry system is so for those of you that may not thank you just because I know that a lot of times I get questions on where we are with the ferry as we head Actually, the Saint George row, which is going from staten island to Madrid City up to West 39th street.\nWe finished the environmental review phase and now we're looking to start permitting and construction to be able to launch St George by next summer and Coney island before the end of the year next year, and then now we're going to get into some where we are today.\nWe knew we could do while again still making sure that Corlears Hook and the other routes along or the other landings along the lower side route continued to have service, and in fact what we've noticed is that people use the ferry, often to get across literally acrosss the river to other boroughs.\nSo I think one of the issues that the lower side route had is that a lot of the stops were just within Manhattan, and that was not ultimately very appealing for people in terms of comparison to other modes that they were taking.\nBrooklyn route really opened up a lot of then new connections between the lower East side and areas of Brooklyn, including Brooklyn, bridge park, Et cetera, and so what we've seen.\nWe've continued to monitor, ridership since then, and while with the pandemic- And, you know a lot of people working from home and not sort of traveling in the usual patterns.\nAnd then we'll, if we, depending on the time that we have left, we'll, go with those who raise their hand, who are part of the public, and I, have a question just for clarification, those numbers that you have or that you showed If you could put that back, up, I think it would be helpful Michael, because I think we're going to focus on that that one particular shot of the ridership numbers.\nIf I talk about ons and offs, but people very well could be getting on going southbound and then taking it back northbound that would just be captured, in the say, the red hook or the the Brooklyn bridge park.\nAs we know throughout the city, the edges of the water are really the ones being served by transit, right, so just being able to serve a consistent service throughout this time.\nJust talks about route ridership, so you did not get like what the old, lower East side route would carry on an average day versus what the Corlears Hook landings saw, but it does not break down north down south All right.\nI mean in normal times, people are taking it for work as well, I mean the tricky thing with building on the water front is depths and where landing could physically be sighted, and it's not always as ideal as you know, you might wish.\nOkay, because right now, I'm going to obviously let the questions that are waiting right now, be we asked, but I, think in a future resolution, because I think we really have to think about the covenant environment we're in We do want to bring the ferry back to talk about ridership in the coming months, but that might have to that Might be something we want to put in our resolution to DOT, because it's sort of a weird mix of parks, EDC and DOT, with the CitiBike and the ferry and the park.\nWho knows what's going to happen three months from now, but we're going to bring them back, but I do want to emphasize the point and that maybe this could be done sooner than later and then as adjusting the schedules for transfer, because if we lost northbound service, the lease that we could have right now is a schedule that fits So. People can go south and then get on a boat and transfer to other points.\nSo I'm, going to ask folks to be brief with their questions and let's look at the presentation and also understand that there's a community advisory group, which will also go over a large portion of the construction issues which are going to be touched upon, tonight.\nSome leg work that they need to do with surveys, issuing a report to us issuing their project scheduled to us for our final review and approval of the environmental plans that we've all been talking about for a very long, time.\nThat's there's a package of items that needs to be done and completed in the first couple of months, two to three months of their approval in order for them to finally reach the point of being able to put up the construction fences and start the closures and start bringing in their machinery and equipment and get the work.\nStarted, and I want to reassure everybody that before we reached any of those points down the road of any street closures, any construction fence going up anything like that.\nWe've also came to conclusion that we are able to keep the park open for the rest of this year, and that means our projects are its construction.\nWe're, very excited that we're able to accommodate the request and the considering the unfortunate Covid-19 crisis right now and the open space access and everything in the neighborhood and the community that the park itself East River Park will be.\nUntil the end of this year, and I have a little note there, that first closures of the East River Park will begin early 2021 that again consider that a bird's eye view sort of tentative note, there, So, the construction phasing plan that we presented last month and all the details of the step by step in the process.\nThis is just one piece of that, bigger slideshow that we had last time, but I wanted to remind everybody that this is our sort of umbrella process of community outreach during construction.\nIf you have any questions or can access the website or the zoom registration feel free to reach out to any of us, we'll be able to connect you with the right folks- This is the overall snapshot of our community Engagement Timeline of what are the sort of community engagement tasks and strategies that we have lined up that we're working on each of them Have a timeline associated with them on a separate track.\nIf the person has one question and it ends up being a back and forth sort of conversation for a while that history is documented there, when you log in you'll, see everything step by step lined up there, all right But I think it's important that people know there's another way to ask questions.\nMy question is on behalf of the lower East Side Power partnership, and we had asked about a community liaison speaking to the people that lived near Ps42, and so we wrote a letter because we did not know who is responsible for Ps42, whether it was you or EDC.\nIt's been I'm going to say a hot topic for a lot of us from for a very long time, and just like any other of people.\nNext on the agenda is a presentation by the lower East side, preservation, initiative, requesting support for the adaptive reuse of the Erp Track House and Tennis House in light of SHPO's determination of eligibility of these buildings.\nLast February lesbi came to this committee to let you know that we had applied to the state office of historic preservation, known as SHPO, to have them review the East River Park Track House and Tennis Center Comfort Station.\nTheir endorsement underscores the significance of these buildings not only to community Board three district in the lower East side, but also to New York City.\nAs, a reminder, the East River Park Track House, is located near 6th Street and the Tennis Center comfort station is roughly between Rivington and delancey.\nIt is important to note that the Terra Cotta ornamentation on both these buildings was custom fabricated, locally in long island city in all, SHPO's, evaluation of the Track House Antenna Center Comfort station emphasized not only the historic links to the transformative period of the new deal, but also the connection to the earlier maritime history of the lower East side and SHPO also focused on their excellence as architectural resources.\nThe demolition of these outstanding buildings, clearly designed as part of an architectural group in East River Park, is very sad indeed and represents a substantial loss to the community.\nWe feel very strongly that the historic and distinctive track- House Antenna, Center Comfort station, specifically designed for the lower East side, should not be replaced with buildings.\nWe are pleased to have worked with davies toes architecture, a local firm, to explore ways that these historic buildings can be adapted to fulfill the programmatic requirements of the new planned buildings, and this includes all areas for bathrooms: offices, changing rooms, storage and concessions.\nWhat what's going to be happening to these buildings during the construction period, and are you also thinking about monitoring that that's a little bit beyond our purview as a preservation organization?\nThe community see these very unique buildings restored and kept for use as long as the interiors were modernized, because I think that's a fair point and it sounds like You know when I was in construction.\nWe have another committee, member Ryan Given how much loss we're experiencing both of East River Park and in many ways of the lower East side, as you know as a whole over many decades, that being able to preserve something, that's specifically tied to our own history and our sense of place feels very important.\nOkay, can I clarify one point: trevor, please sure, so I just wanted to just explain that you know that the environmental impact process has been going on for a long time.\nIt was only two years ago in 2018, when the community became aware that demolition of the park was part of the plan and that's the point at which we started looking at the architectural resources.\nJust briefly, I mean you all know that I chair the Landmarks Committee and although we did not choose to pass a resolution because we deferred to parks, we certainly feel very strongly that these are wonderful buildings , they're modest, the cost of re.\nI think we can probably work with it or what your you have drafted, but I really want to make sure that we stay consistent with our resolutions, because what I'm, probably going to add, is the some form of that community outreach needs to be done in the resolution We can come later and say: you've done the resolution and you've reached out.\nI. Think considering the timeline that we're under it would be most helpful to have a resolution with encouragement that community outreach does need to be done, and we should certainly consider that, but in turn the timeline is tight.\nThe next item is request for support for the lefcy college and it's complex art, Everyone know that unless the committee feels different, that there is overwhelming support for this, so we could spend a lot of time talking about our support or we can go over resolution and sort of get to the point of support, because we this has been on our agenda for quite some time.\nThere are some formatting issues with the therefore be resolved, because some of that language should probably be in, whereas I go to the first page, Michael, I'm, going to ask the committee for comments and what I'm looking for some language that says that there needs to be some community outreach and changing the their force to be more direct and taking out some of the language there.\nWhereas we understand that many community members want to see completely renovated, interiors new bathrooms, that goes into one of the whereases and that the second piece is that that there will be significant outreach by lesbi in the next period of time and maybe even some shot for people to come to this committee to if they have questions for disagreement.\nYou know has promised to do this outreach because you do not want to say you have to do the outreach, because it's not going to the people that are doing the outreach, so maybe included that this group has promised that they would do it.\nThe language would read pretty much like what you said, whereas Lesbian has promised to do outreach to the local community since and that's a good point, can't send something to parks and then be telling another group to do something: correct.\nAccording from what I heard from you trevor that you have heard community members asking for new interiors, And I, think that would be important to say, because that is right-.\nThat's part of what we're going to add just understand that looking at this, for the first time, I when we say new, interiors we're, including all that programming I'm, just trying to get as many comments from the committee as we can, because we have not adopted this.\nAre there any other comments from committee members, since this is a bit of a hybrid type of resolution, which I know we're going to have to change in some format?\nAlternatively, it would read, whereas many community members have requested that the office spaces comfort stations and other interior spaces, we renovated with all new fixtures and finishes you can say inside spaces if you want, And, it's close enough we'll clean up as we always do the language a bit later for the purposes of the Zoom meeting and the timing, I'm going to ask for Michael to scroll up to the top So I'm going to assume all of our committee members have read this thoroughly.\nI'll make this pretty short short 10 weeks out of the onset of the esker construction in East, River Park and the ecology center A 30 year old composting program which delivers access to composting educates and engages the public, creates green jobs and job training.\nWe have not been able to get straight answers from parks about incorporating a fully funded and approved design for the compost yard, located in a one acre, lot, just south of the amphitheater in East River Park into the esker construction.\nAnd I know there are some members of the public who had asked to speak, but first I'm going to go to committee.\nYou know, basically a green light to go ahead with this project Why can't we just try to pressure the tribal authority to give an answer before we have to go and or do approach while we go down this road, because if no response does not mean a no well, the mayor's office, the Department of Sanitation Parks Department.\nI do not have the resolution in front of me, but I think christine had mentioned a specific language asking for a written guarantee from parks for compost like different programming.\nWe want to that parks is offering to us, and I would really like to have better more comprehensive answers to questions, because as an organization we need to, we have contracts with the city that won't allow us to perform certain work.\nWe need to try to stick to be able to deliver this protection project on time for this neighborhood and this community So, like I said, there's a lot of moving pieces and there's a lot of areas and entities that are working on all of this.\nOur community is really important right now, And I'd like to see that it be prioritized the compost, yards location throughout construction and return to the park, be prioritized because they are productive and create so much positive activity by the community that we really need to have.\nInvolved, I think that community board three needs to be more strategic in its position and demand, and it should strongly support the yard remaining where it is until a suitable alternative site is identified and a, and we need a commitment by the city for its temporary home and its return to the renovated park.\nLet's make sure we get the relocation and return of the yard right and in writing, and we want the community board to work diligently to make this happen.\nWe want CB3 to pass this resolution to relocate and bring back the composting yard to our park, and I understand.\nThank you, and I want to thank the Community Board Parks Committee for supporting the ecology, center, so I'm Amy, Burkhoff 40 year resident of the East village and long- term friend of the Ecology center.\nI, do not know if we can say that, but what we can say is that as a community board that, if there's no place to move it to, it simply remains there and the project moves forward that it like.\nOur committee members comfortable with the way it's written with the addition of the language that K is going to work on And we'll get that language before we take a vote on it and with David Adams suggestion that we move the that one of the therefore to therefore strongly supports the continued occupancy paragraph to number two Michael for responding, I'm, also happy to read.\nI think we have enough information from what val had said to offer that as a therefore be resolved, where we are asking to make sure that this particular resolution or the efforts or the support for the Ecology center and its composure does not prevent or delay the flood protection for the residents of NYCHA, including the ones mentioned, and for the other surrounding buildings.\nThe goal of voting on these priorities is to bring more services and money to community Board three for needs that we decide are the most important.\nThis information is on our website also, and if anyone has other more detailed questions, or they want to know more about how it's research, you can, you can ask me, later after the committee's rank and vote their on their priorities, the lists are collated from all the committees to create one list for the board.\nThose are community board three items from last year that are not on the parks, list, they're things that we want to add or that we wanted to add.\nI'm, not saying it's number one, but I do think it's important that parks have bathrooms to prevent people from using bushes and walkways and other areas to either urinate or defecate.\nThat one of the big issues right now in the city is exactly that as to why they're doing certain things as they want to make sure that people are not using bathrooms together to be specific, about Michael's point.\nI also think Kim Lao could go before number 19 SDR park, because that also is never going to happen until there's a whole lot of money."
        }
    }
}