{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB6",
            "channelId": "https://www.youtube.com/channel/UCnuHHh1V4fubDUY_8YN8ysA",
            "title": "Manhattan Community Board Six Health \\u0026 Education Committee - 09/22/20",
            "publishDate": "2020-09-22",
            "shortDescription": "",
            "lengthSeconds": "1:02:27"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB6",
            "normalizedName": "Manhattan Community Board 6",
            "twitterName": "Manhattan Community Board Six",
            "youtubeChannelName": "Manhattan Community Board Six",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "twitterHandle": "@cbsix",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "lQfa_hxrNSc",
            "fillerWordCount": {
                "uh": 193,
                "um": 151
            },
            "readTimeFullTranscript": "36 min read",
            "readTimeSummary": "5 min read",
            "wordCountFullTranscript": {
                "kids": 57,
                "schools": 40,
                "school": 33,
                "health": 15,
                "week": 13,
                "member": 12,
                "link": 12,
                "staff": 12,
                "teachers": 11,
                "business": 10
            },
            "wordCountSummary": {
                "schools": 11,
                "kids": 10,
                "school": 8,
                "feature": 4,
                "o'clock": 4,
                "families": 4,
                "staff": 4,
                "week": 3,
                "mom": 3,
                "dad": 3
            },
            "fullTranscript": "Yes, what's the difference? What's the difference between the Q&A and the chat function, so the chat function? That's I mean it could be person to person or person to the whole room, yeah the Q&And, a feature, it's something that is on display for everyone to see both panelists and attendees. The chat feature is something where it can be set so that you just send it to other panelists or just send it to a specific person. So the big difference, I think is in terms of who can see it also for functionality purposes. The way we use things is that the chat feature is more for like technology support, while the Q&A feature is for any case that that a member of the public has any questions, they can ask questions to the Q&A feature and actually, speaking of the Q&A feature, I see. Matt Bondi has an update for John regarding Ps59. I do not know if that's something you'd like to discuss during old and new business, but that would be appropriate for all to do business by quick answer. Is it's not a surprise that they've passed the buck but yeah? I thought I'd flag that so I guess Brendan. Why do not we? Why do not we start since people have gone to the trouble of being here, and hopefully we have a few more people join us this week. Yep we're all ready the youtube stream is up and running. Can we tell if we have many people watching on youtube or is that it's one of those things it when a video when a youtube video is live? It shows how many people are watching the video itself so like 28 watching now, but so there is there is that if you're so inclined or so curious, okay- and I see according to the participants- we have 19 participants. So all right so Brendan, I guess, are we ready? Should I get things going or how do you want to do this ready whenever you are okay? So I'm calling the meeting to order at 6:35 pm, and this is the September 22nd 2020 meeting of the Community Board 6 health and Education Committee. My name is John Keller and I'm chair of the committee and joined by my co- chair vice Chair Abigail Krusmark, and the meeting is called to order at, as I just said, 6:35 and we are joined by the indispensable community associate Brendon birth. I added indispensable to the script. I hope that's okay, members of the public. You can raise any questions or comments that you have through the Q&A future of zoom. If there is time following the committee's discussion, we'll field questions from the public and I'm aware that we have some new members of the committee with us tonight so we'll certainly be speaking with them during older new business. Unfortunately, no one volunteered to take minutes in advance of tonight's meeting and is there a committee member who would volunteer to take minutes if you could raise your hand through zoom or just say, hey I'll, do it. That would be much appreciated. Hey thanks, Phil. I really appreciate it. Philip Napolitano has generously volunteered to to take minutes. Thank you, and so now we'll take attendance by roll call. Brendan. Could you conduct the the roll call committee members? I will call your name and you will unmute yourselves when your name is called please say present. I will announce if there is Quorum John Keller, President, Abigail, Cruzmark, President, Dan, divine, rich mints, rich Phil, Napolitano, okay, Sean sermon, present, madeleine sims, madeleine sims, Andrew, Ceratch and Neil Barclay present. Okay, there is Quorum okay, the agenda for tonight's meeting was distributed ahead of time by the board office and appears on the screen ahead of you. If there is no objection we'll adopt the agenda, as stated members of the committee, if you object to adopting the agenda, you may raise your hand through zoom, and I'm aware there are some things that will be raised in old and new business. Seeing no objection, the agenda for tonight's meeting is adopted in order to conduct an efficient meeting, we're going to have a few ground rules, as we have in all of our Community Board six committee meetings. No one can speak until granted the floor, we're a relatively small group. So hopefully that will not be too complex. Committee members, if you have a question about committee business or wish to make a motion, raise your hand through zoom. If you click the participants icon, the participant panel should appear and you should find the raise your hand function there. If you still have a technical difficulty, you may click the chat, icon and relay your difficulty. The chat function should not be used for committee business or questions about agenda topics. All such remarks should be made on the record. By raising your hand, through zoom chat should only be used to alert us to any technical difficulties you are having or to state in writing information like an email address that was already stated aloud on the record during the meeting when the committee member is given the floor to speak, I will identify you and you can unmute yourself so that you can speak and I'll certainly pay attention to waving hands too. Since we have a relatively small number of people here, we are required by executive order to create a verbatim transcript of the meeting. So please keep your questions and comments. It's succinct and you're made to the discussion any anything that needs to be clarified there, okay, good. So the first item on the agenda is an update on school reopenings, which is a major topic around the city right now, and I actually will be totally candid and say that I reached out to try to get someone here from central or the family in community empowerment and did not succeed in doing that which, but what I do have is the presentation that was made this afternoon by the Office of family and community empowerment and which I will Brendan. I sent you a deck that if we could start getting slides on this up, I do not think all of this was meant to be. This was this was distributed to many people, and so therefore you know it is the deck itself. The face deck is certainly not a confidential document. What I'd like to do so? I would like to start with the which is important upcoming dates and announcements. Okay, and if you want to on the the ultimate responsibility for everything that's been going on, you know resides in the on the lap the desks the buck stops at the desk of the mayor and the chancellor on all of this, and the chancellor is having town halls with each Community Education Council, and there is one coming up for district two in December. If you want to go to an earlier attendant earlier. One of them you could find you could go to the district 4 town hall, which is November 5th, that's district 4 is up, is in Harlem and there's one tomorrow at district 30 in Queens with the chancellor, but the one that would be most relevant to people on this call and in our district would be with the Community Education Council for District 2, which is why I've circled it and I've also provided there a link to the the cecd2 website, where you can get more information on that. Next that we do the the next, the next opportunity to exp for people to express their opinions and views on the how the reopening of schools has been handled would be at the panel for educational policy, which is actually meeting a week from tomorrow night on September 30th at six o'clock and I've included here at Brendan. If we make this deck available for people, these links all work. But you could go to this meeting. Sign up comment publicly to the leaders of the panel for educational policy. The chancellor will be there and express your opinions and just a little bit of a hit on these meetings, how they work you that you can go in and you can sign up. You know from 5:30 to 6:15, then there's a lot of bureaucratic stuff that pep does for the next 45 minutes or so you could, you know, make family dinner or something and then come back and still have a chance to speak. Just of your you go to it. You are allowed two minutes to speak during the public comment periods, and I know that there's a lot of interest in attending these meetings. They've gotten actually pretty good at running these meetings online. So I would strongly encourage especially people who are listening in on youtube to attend this and we will post this deck after after the meeting at the on our website, and you can follow these links to get to this meeting. Ben Kaylos, our council member for Cd5 Council district five has taken a lot of leadership on school related issues, and he has a petition that he has put out that I personally just signed this afternoon on reopening schools and encouraging the mayor to safely reopen our schools, and there is a very long link down there that you can find if you wish to click on it and sign the petition. You know: full disclosure. Ben is also running for Manhattan borough president, so we're not endorsing or unendorsing that run by publishing this document. The very the important message is that you know that the uft's pressure on the mayor be reinforced and that we get around to really safely reopening schools, which is what we'll be talking about, and I encourage you to support then Councilmember Kaylos's petition. The rest of this deck is taken from a presentation that was literally made this afternoon by the Department of Education's department of family and community empowerment. So I I'm just good. This is exactly this is what they're saying as of today about about the school reopening, so we go to the they're. They really are aware of the issues of you know that many people, especially homeless kids and people in temporary housing, are having with technology so they're. The first thing they point out is that they are trying their best to provide technical supports they're. They are, they shared a sneak preview of the school reopening family guide this afternoon, and I thought, since they did not see fit to attend our meeting, that I would share that sneak preview with all of you. So if you can follow the link to this, it's quite an extensive guide to reopening of the schools that the DOE is providing and what they regard as helpful tips to families and so you're, getting a preview of it a couple of weeks before it's actually made public there's, also a new online parent, organizing resource called inside schools, plus it's designed by a team at inside schools for New York, City families. It's a it's free to join, it's friendly, tailored to families, and you can find discussion groups around shared interests and once again there there's a real live link down there. When you get the document to actually going and seeing what what is there, we can go to the there's been a lot of concern, and I know this is something on council member Kayla's, mind and others about child care and child enrichment. You know one of the things if I'm saying something, that's obvious to everyone, but those of us involved in this know that once they decided to go to the blended model, they quickly discovered that not that having some students in and other students, not in meant that you could only have about you- know most kids in school one or two days a week in some cases. So that leads to the question of how do you provide enrichment activities and child care on days when a kid is scheduled for remote learning, but mom and dad are you know, mom and mom or dad and dad still have to have to go to work? And so they're trying to address this, especially for children of essential workers and teachers and program staff, and there is a here- is a link where, once again, this is a live link that when this is distributed, you can find this is one of the biggest issues that we're finding in as they try to reopen schools that not every one. I think there was a thought you know. Oh, we could, you know, have kids come in. You know open the buildings, but they soon realized that if you have to have 65 square feet of space for each kid that the number of kids that you could actually have in the building is extremely limited. So that's one of this is one of the things they're trying to address here. If we go to the they're really I guess you know one of the things I'll say here. Having spoken with a lot of people involved in this in the last week, is that the people you know on the ground, a principal of the school or a guidance counselor in a school is deeply engaged deeply concerned about doing this right, and it's also, I think, fair to say, though they won't be quoted on this know, for the reasons that people perhaps are aware, you know that they are very disappointed in the lack of leadership and the lack of support that they have received. So one of the things I want us to do as a committee is follow up on a suggestion that was made by Ben Kaylos during our full board meeting last week, our last full board meeting I've got the distributive kids. I've got them in the background here. Excuse me, and that is once schools open, actually open. I want to do a survey among principals of schools in our zone and try to get as much feedback as we can as to how the reopening went and what their views on it are and share that as broadly as we can, but since the schools are not yet open, you know and won't be open until at least next week, there's really no point they're all working these people are working 14-hour days just trying to get their schools open and ready for ready for kids. I've never seen a group of people. You know at the on the ground level more committed to trying to make something work. You know against all odds when they have not received the necessary support to do so. They're going to have what's called a situation, room which is, and I'm going to have, to mute myself here, two teenagers, so they're going to have a live room available for principals to contact and speak with health professionals and DOE leadership related to you know, student absences due to Covid-19 kids get sent home during the day and because they have they're running a temperature or not feeling well when a staff or faculty member is absent and they think Covid-19 might be involved or if it's just set home during the day, do the illness self- reported to the school, so this will be available to all schools and all programs that are located in DOE buildings, including charter schools, early childhood schools, d75 programs. So you know the concern the level of concern at the principal level and at the staff level and at the assisted principal level to make this work is really quite you know, you know impressive. Okay, let's go on to the next one, and then this is the revised opening schedule and just as of today, pre- k and 3-K will be open on Monday. All grades of district 75, which is special education, will be open on Monday and kids enrolled in elementary schools K to five and k to eight, including kids, that are in six to eight and k to eight schools. They won't open until a week from next well, two weeks from the day, I guess a week from today. Actually the 29th and students enrolled in middle schools and high schools and secondary schools for in- person. Learning will be next week on the first of October and then everybody else with different types of grade configurations. There are some schools that overlap different grades will all be done next Tuesday, so you know we'll just have to wait and see how this all goes next week. Hopefully, we'll have had a good experience today with the 3-K and pre- k and district 75 kids who started back started back today on the they are ready to go with the buses. This was a big concern, as you probably know that they would not have the buses ready and bus drivers and the people who look out for the kids. I do not like the term matrons so, but the people who look out for the kids on the buses and once again they're going to instruct parents to go into your child's New York City schools, Account, and I have that on the next page, how someone can open that if they get a copy of this presentation and there's a direct link here to how you would contact any one, if you any parent who is considered guardian, who is concerned about busing or other transportation, related issues, there's a link here and also a phone number that presumably will get answered. Meals in schools. When I was in the Community Education Council, the most difficult meeting we had emotionally for me and excuse me every year was when we would have the people from school nutrition come, and you became aware of how many kids in this in our city, the only hot meal they get a day. The only real meal they get a day. Is the meal they get at school and when you, when you think about it, and you come from a fortunate background, such as those of us on this screen, do it brings tears to your eyes when you realize the kids rely on on the schools for food? So that's where we're definitely going to be continuing that and one of the great things that happened in the last couple of years when I was on the cec, though many other cecs were involved in making this happen, was that breakfast is involved is available for kids to bring into the classroom when they're there and and we've removed the stigma of having to say you're. I'm here for free lunch, everybody just goes and gets a meal under the same conditions and we can even find the menu for September and October. If you wish and then there's an app all of which is available here and once again, the people who are actually doing this actually making this happen in the schools are extraordinarily concerned about the well- being of the kids that are coming into their buildings every day. There's a lot of reason to be mad about how this was done at a senior level at the central level, but there's no reason browns to be mad at how from what I can see. The people who actually are running our schools are handling this and one more slide health screening. First of all, how do you set your and my school's account? If parents are any parents and guardians listening to this they're, not aware of it? They will be able to go to this link here and set up your own set up their account and my c schools account and health screenings and Covid-19 testing they're still working on the details of this will be an important element of the health and safety protocols implemented to protect schools, students, since they keep state staff safe and there's a schedule, and I have a link here for it of the daily health screening that schools will begin to implement this week and and then I also have the link for further information about DOE health and safety protocols for blended learning that will be in place. So what I've just shown you is. This is the most recent this was literally presented this afternoon by the Office of family and community empowerment to all Cecs Acrosss, the city- and this is the most up- to- date- information that we have on school openings and any questions that do not shoot the messenger. Any questions that I can answer- and I know claude, has a lot of experience with this, so you know any questions that any of us can answer or would like me to raise to people. We can move it. I'm very I'd just like to open the floor. First of all to members of the committee yeah hi Ozzie hi, thanks John, that was really thorough. I appreciate sort of going through all the different aspects of it. I just wanted to mention my daughter. We chose hybrid option, but the model her school chose had it that we're doing remote academic learning 8:30 to 12:30 in the morning and given that and then going in once a week for a couple hours in the afternoon for the in- person aspect. So this delay in in- person learning did not delay them starting the school, and I think there are other models I mean Lv. I think tag is doing the same thing right yeah. Let's have an open discussion here, we're a small group. So I'm happy to just let people speak elvie. Do you want to talk to Azia's question? Yeah Tug is doing the same thing yeah my kids have already I mean they're already in class, I mean they're already taking you know, calculus that I can't understand. So you know so I mean, if you're so, the remote part, and I think that some of the remote we're going to I want this is where I want to get feedback from the principals, but I think they learned a lot of lessons last year on how to do and not do remote without identifying the schools. I think one of my kids schools did a much better job of the remote learning than the other, but any other comments or questions or thoughts that we from people who are here. Well, I'm going to I'm just based on your volunteer me yeah. Your years of experience, I mean yeah, but that's old experience. That's not this stuff! That's not this! Okay, fair enough! Man! One gets the impression, though, that people with your kind of good old experience might well have been consulted over the last few months and we might have ended up in a better place. You can ask it if I can answer I'll answer, but it's an old experience. It's not anything! That's current! That's going on in the schools now yeah, but my impression is that this would be something I'd ask I mean the principals of the assistant, principals and the teachers. You know feel this responsibility deeply and you know well absolutely because they're aware of the school conditions without any pandemic and so they're concerned about the board of Ed, actually correcting some of these situations. I mean we're not even talking about the water and the fountains and all of those other things. Some schools have very narrow hallways you know. So even movement about the schools is difficult. Yeah one of my kids schools, the fact they're going to have each floor is going to have one way. The hallways are so narrow that you know. If you want to go from north to South, you have to go down a floor. You know together right and so with the with the social distancing, we're not even talking about elementary school. Some schools have bathrooms in the in the classroom, but we're not even talking about kids going to the bathroom, etc thing so yeah there's a myriad of concerns that the people in the schools would have absolutely yeah, and that's why I'm so I hear I you know. I do not always agree with the uft on everything it says, but the uft really stepped to the plate here and took the heat and pushed you know pushed this with the with central and with the mayor, and I think Mr mulgrew deserves a lot of credit for for what he's done, but yeah you have to give them credit, because there's simple things like which we do not think of very much, but just the windows and the airflow in the buildings. A lot of the old buildings the windows are nailed, shut. You know those little cords that come down that move the windows up and down. Some of them do not go more than six inches when you try to open them and then they're buildings like a hunter, I worked in Hunter, I open hunter and it's built in out like a fortress yeah that has these turrets with these little narrow windows on the perimeter classrooms, but the inside classrooms have no windows whatsoever and the whole time that we were there. You could go acrosss that building and one room would be 30 degrees and the other bill would be 70.. So you know they're all those kind of problems that the staff has to face and deal with, no matter what the Central Board is saying, yeah and that's why it was the staff through the uft that you know raised us and why I did not want to bring a principal in here, put them on the spot and have them have to complain. You know they've done it. They've done this through. You know the right, the right channels, any other comments or questions. I mean hey John, hey. Maybe I do not know if you said this, but I'm curious. Are there any sort of metrics set out for when they're going to take a pause or something like that, even if it's not at a particular school like metrics on citywide upticks or something like that? That's a very good question. As far as I know there are not. It was not addressed in the face presentation today, but I will. I will ask that question tomorrow, because you know how do you at what point do you say we got ta we got ta reconsider whether the school could stay open. Is it this number of kids sick or this number of staff members that you know that's one of the many things that they do not seem to have at least publicly thought to know. Maybe they have a you know a super secret. You know plan somewhere where these things are, you know planned for, but it has not been made public. That's a great! That's a really good question that I will ask that tomorrow. Great thanks appreciate it any other comments or questions. I mean how many, how many folks I know, Asia Adele, has a kid in school and elvie is, you know close to kids at school, and I know I've got two actually doing it, who how many others on our on the committee here have kids in school right now I have grandchildren in school that counts, one in middle school and one at Hunter Elementary, oh wow, a lifer at Hunter. That's pretty good hunter is in a lot of disarray. Yeah, that's a subject. We could it's probably an offline subject but yeah. I agree. Anyone else want to speak to their experience as a parent or guardian or what they've you know. I mean I'm very open to you, know John. It appears that some of the attendees look like they're from one of our local. Like I see somebody from Ps116, I'm curious. If you want to yes, let's do it yeah Brendan. How do we engage some of our veterans? Thank you ozzie and thank you. How do we? How do we engage some of our participants unless there are committee members who want to make further comments? How do we engage directly some of our participants friend, and how can we do that yeah, so yeah? It looks like Erica Rand Silverman said want to let you know. I am on co-, president from P.S in case you had any questions about school opening experience, so I do not know if yeah sure what is your I mean, how is it going so far or what is your you know, experience of how you've been communicated with anything at all a mute. Well, that'd be great. Thank you. That way. You know she has anything to say no we'd love to hear it. Hey Erica! I can see you now there you go. Thank you for joining us. Sorry, it's nice to see you all! So it's been. You know. I know that the Ps 116 staff has been working really hard to improve on the experience from last school year and they've done a great job. I think so you know having access to the zooms is really the most important asset of school working and the DOE has what they call the teach hub and everything flows through their teach hub, and so for many students. You need to go into their system to access the zooms, and so if their system is down like it was yesterday, it's a complete disaster total disaster. But when it's working and the links work then- and we can access the teachers, it's glorious, that's the word I use with the principle and the vice principle: it's absolutely glorious when your kid can get in when your child, you know their link is not working. It's very stressful because they're afraid of what they're missing and it's really hard to see that you know as and as working parents you just you need to get back to your own work. You know, I'm sorry, I have a question. Does ps 116 need additional teachers? I have been told that the principal has requested additional teachers and has not yet heard back and when they bring them on who's, doing the training and yeah breaking them up. That's the worry: they were really hesitant to bring on new teachers, because who are these new teachers and they can't vet them at all, and then there was some question about superiority once a new once a teacher is brought in, will that displace I mean we actually lost teachers, they access teachers and then you have to apply for more teachers. So it's absurd really, but yes, we're low staff. We lost our reading specialists, our reading intervention, we lost our science teacher. We had already lost our art teacher the year before it's really hard to program with community- based organizations like we have in the past, because there just is not enough time in the day to figure out how to fit them in the teachers are multitasking live and remote, they're multitasking multiple schedules at a time. Is it any possibility of you bringing back someone like your science teacher, so our science teacher is still on so we, our science teacher for the upper grades, is still working as a science teacher. Our science teacher for the lower grades is working as a main classroom teacher and so hopefully in the future. She would be able to go back to her role as a lower grade science. Teacher yeah, that's so important. I know one of my kids was inspired by his. You know, science teacher. In elementary school I mean it was a lifelong impact. You know and you lose people like, that, it's yeah all right we'll go ahead and how's your face. Curious. Can you do you have a sense for how many families showed chose hybrid versus remote yeah? It was less than half for full remote when we first started talking with the school about a month or three weeks before school started, but then that number started increasing so with more remote staying home and I'm not sure what the current numbers are. They really do change Daily. I know we lost hundreds and hundreds of kids. Yes, that's what I heard today either moving out of the city or moving over to G t programs, because spots opened up because families moved out or going into Pri a lot to private schools, because people when they kept moving the school start. People were like forget it, especially kids, who need extra support. They were so late to talk about how they were going to handle kids with ieps yeah. This I mean this news like the Big News is very frustrating if you're supportive of public schools and that's something that's important to you, it's devastating, but if you're looking at the microcosm of the kids who have stayed in the system who have access to the internet at 1:16, there's a lot of warm exciting things happening on a daily basis. But I can't speak. You know what I'm trying to find out is how many of our kids do not even have. My son said that there are two kids who he did not get to see in the spring and he thought in he's seven. He thought it was because they might not have had access and they he was. He told me today. He it was so sweet that they were on the calls. Today they were on a phone and they had a phone number next to their name, and he could not see them, but they were in the quote-, unquote room, and he was really happy about that. So I'm curious to hear from the principal vice principal we look at kids yeah and I was curious you I know you have a significant homeless population, a homeless student population. So you know at the community board we do put requests in for the both your school as well as the homeless population. So if there's anything we can add in or help and support, we'd really appreciate hearing yeah, you know what I should have done is I should have. I should have thought to tell the principal that we were having this, that you guys were having your meeting today and tried to gather information, but you know it's a miracle, I'm here at your convenience. It's fine of us are really deeply involved in schools. So just let us know is there anyone else? First of all, thank you. Eric keep in touch, please keep in touch and feel free to keep in touch with us as well, and thank you for all your support. Thanks for watching hi Erica go ahead, deal no hi Erica, it's Neil Barkley you and I we had a chance to chat a few times and exchange a couple emails. If there is anything that comes up with the 116 I'd be happy to, you know, be the contact person to help out yeah. Thank you. Thank you for reaching out last year about fundraising for the homeless population. I know we all got lost there in the spring. So yeah we're happy to reconnect about that brother for the families in transitional housing. I should say yeah more appropriately. Is there anyone else who from the public? Who is trying to speak? Because that's why we're here yeah? I do not see anyone else who had any questions or issues in the Q&A okay, so I have several. You know, takeaways that I took notes there and we will you know anybody else on. The committee want to speak, who I might have cut off rudely okay. I mean this is obviously not going away and we'll be on our agenda in some form next time. I do know that our council members were very fortunate with Keith with council member powers and council member Kalos and Council member rivera. You know and their offices are very responsive, so you so you know I've spoken to keith a couple times and been in touch with Ben a couple times actually as well, so we're and I'm just I'm regularly in contact with katie and the Council member Rivera's office. Okay. So obviously this is a work in progress, and so I think accidentally we planned this meeting just right, so we will just continue to stay on top of it. If there's no objection I'll move on very quickly to a very quick second item on the agenda: everyone's okay, with that, what we're going to do in relation to the preparedness of hospitals in the community district, six for covent 19 is, I have had a very good conversation with Council member Rivera's office. As you know, Carlina is responsible for the City Council Committee on hospitals, and everyone rightly is focusing very heavily on the physical health impact of Cognitive. That's what it does, but one topic that I know Councilmember Rivera has been interested in and I'm personally interested in is the mental health impact of Kovitz, so we're working with Councilmember Rivera's office to get an elvie any thinking you have on this as someone so familiar in nazi with our hospitals, I'd appreciate and seema, but we would like to do. I would really like to do some a roundtable of some sort with people, mental health professionals who are very who are close to the impact that this has had on people and we're going to do that in our October meeting, and I welcome any ideas or suggestions from any members of the the committee or public as we move ahead with that we can do a focus group meeting, oh okay, yeah. Well, I would like to have some parents who are willing that guardians who are willing to talk, because this is sensitive stuff, usually personally, but certainly have some mental health professionals from one of our hospitals talk about this because it's the hidden effect and the more you read about it. You know- and someone gave me a statistic- the other day that you know like 10 of mortgage people are not paying their mortgages, you know and if 10 of people are not paying their mortgages, that suggests that 20 of people are not paying their rent and 30 or 40 percent are not paying for credit cards. I mean this has got to be so stressful for people, okay, all right, so I think unless so there seems to be a consensus. That would be a good topic and I'll move ahead and invite and I'll contact, elvie and Aussie and others as we move ahead on that, and I think I've spoken enough tonight on things that are on my mind that I've, the chairs report is moot here other than that. As I said, I think we just accidentally locked into doing this, the right way tonight and then under old and new business ozzie. Did you want to talk briefly about acs in this sure and if you do not mind John, I can go over a little bit of history of Acn why it comes out of our committee. So for those of you who are not as familiar or relatively new to the board just for background, I'm Vice Chair, second, vice chair of the board and prior to being second in vice chair when I was elected three years ago, I was chair of Health of Health and education, this committee for five years- and in that time we be- we became aware of and developed a relationship with the acs's children center, which is at first Avenue between Nyu and Bellevue. It is a 24-hour intake center for children that are being removed from their parents, homes that the decision has been made, but usually the caseworker makes sure, when they're removing children from their homes that they have a foster parent or kin folk who can take that child because they feel that that's the best way to go. But there are times when the removal happens so quickly. They have not been able to identify Kin or a foster parent. So the kids come to what is supposed to be a temporary place. Majority of them come for only one to three days, some stay a week, and then there are some that stay quite long for several weeks up to 30 days or more and the children that come there are from newborns all the way to age 21 because they are under acs's realm. At that point, what happens is that these children obviously have not only come, are coming from difficult situation. They come from situations where there's generational sort of trauma and acs has done a really great job, working with the families, reducing the number of kids that have to be removed from them, because they work with the families to help support them, so they can be with their. The children can be with their parents, which is the best answer, but in a better way, so the number of children that are being removed has decreased significantly over time. So there's a smaller portion that you come to the acs center about 2,500 a year. 875 of them are over 14, so about a third and of that 875,50 of them are 18 and over so just for perspective, and many of these kids come from a situation where they they're given a lot of freedom in their own home. So when they do come to the Ac Acs center, they are not they're, not in jail they're, not the ones who did something wrong and the center does allow them to go out. What happened, though, and Claude I do not remember it was like six seven years ago. This all happened six years ago, yeah. So what happened? There was an incident where kids were going out late at night, eleven o'clock, twelve o'clock, one o'clock, and they were mugging folks on First Avenue, especially mugging, both patients and visitors, to the hospitals as well as staff, and so that instigated us actually building a relationship with the center and having them come to the health and Education Committee on a quarterly basis, so that we had a relationship. We could hear from them what they were doing and get a better sense of sort of their programs and their procedures as well as provide support. Just like we do. The district needs statement and budget requests. We can incorporate that into it, but we can also inform our elected officials more thoroughly about the needs for the center and make sure funding was not taken away or that there's just sort of keeping an eye on them over time. They did get funding and sometimes it went away. There were sort of sort of ebbs and flows, and we just we really from the center, and I would say, like from us, we really pushed and were able successfully to have them get a separate community advisory board because we felt that they need to have their own cab. That represents a community not only just the board CB6, but also the hospitals that are there, the tenants associations and people living there so that they do inform the public about what's going on in the center and it's a way for the community to actually give feedback on what they're doing and express any concerns. So that was implemented about three years ago and since then somebody from CB6 does go. Rich mints has agreed from the health committee to be attending on our behalf in the future. I do think it would be great if somebody else from the committee could join. It is now zoom, so we can make sure brendan could send out the invite the date once the dates picked. You can just pop in and see it's very informative, and, most recently I went to the acs meeting what they do is they do a lot of programs that are looking to build empathy with the kids and get a sense of sort of understanding what they do and how that impacts the community and they really work on restorative justice. Programming they've brought in some really great experts in along with that they do. Some great programming, like I mean Claude, actually is helping them, enrich their library, they're, doing programs, something called Freedom School, and all these things, that's all written up in the slides that were sent out by Brendan earlier this afternoon. So it's really amazing what kind of programming is available and they really are trying their best, because you know the kids may be there only for a few days, but they really want to help support these kids return to their homes, as well as be able to be in a better space and a productive member of society. So so, which is great. But I do think that having the community board keep an eye on it and be there both as a partner as well as a voice for them, so that we can make sure they do get. The funding and support they need is really important. The cab actually sits outside of our community advising board. We go there and it is actually co- chaired by both the Center director Rebecca Chu, as well as the Manhattan borough president's northern Manhattan director. So you know we were able to get a cab that was highly visible. That shows that the borough of Manhattan really cares about these kids and it means that the city can make sure that they are supporting those kids in the way they should be supported, and then I think the other pieces. I would just say to you. You know we only hear about six to eight kids still about every year. There is an incident they do go out. There are kids, they are getting kids that are really you know struggling and they are often getting kids that are more complicated than they were prepared. They had were skilled or had the capacity to take care of and they're working on that they also sometimes get kids that the parents have actually given them over to acs because they can't control them so they're getting really complex kids and though I will say to you, we only hear about six to ten of them a year, so out of that are over 15:14 and over that there is an incident. I think, overall, if we look at the big number of 875 kids, and we only hear about 10. they're, doing really great, with 99.5 percent of the kids that they're doing it is the less than one percent that that we hear about. So it was important for us as a board to make sure we hear about all the 99.5 hi rich great and then one last thing I would just mention just as inform information, and you can see it in the slides. They have not had another Covid-19 case since June, which is really great. The kids that are coming in do get tested, they're testing, more of them, because many of them are coming in with sniffles or coming from outside traveling. So that's been really great. They are fully ready to help these kids learn remotely if they need to go in for hybrid, they go in. They have plenty of plenty of technology chromebooks to help support them, as well as staff to help, and through the summer they did some. They used DOE curriculum to help support the kids so that there was not that much of a slide which I thought was great claude. Would you like to add anything else? No, you were very good. Thank you. So I'm happy to answer questions. I would like to say that I think this is you know our role as the board is to support them, but also we need to make sure the information that they're giving us goes out to the rest of just not only health and education but full board. So, like John, I did report at executive. I would would love it if you could at next full board just mention some of those numbers, because I think people do not understand like how much they're doing and we need to help build that kind of awareness. I would mention the precinct works really well with them to the point. They actually have a police radio. So if there are kids that they're concerned about they're able to radio the precinct to say these kids are going out and because the precinct already sort of comes for basketball games or does activities there, I'm less so now because of Covid-19, they know the kids by sight. They know who the kids are so they're able to be a partner with the precinct, which I think is great too yeah. I think what I'd like to do. First of all, thank you that was thorough, and it also makes me realize that I should I would like to try to attend. I mean these meetings. Are you know, am I I'm pretty sure, I'm on the distribution list, and I just probably miss it. So if you are I'm inviting you to nudge me the next time you're, okay, all right rich has been involved. Rich is here and let the record show that Richmond says in attendance rich. Do you want to comment on this? Because I know that Ozzie was mentioning you've been I mean I have not been. I have not been as close to it as she has so. I do not think I have anything to add to the report. Anybody else have comments or questions we're coming up on an hour which is pretty, which is our traditional time here as a committee, but I this is an important issue and one that I will frankly admit I have not given the attention to. I should have okay anybody apologize for that. Okay, okay, if there's no, is there any further older new business that people would like to put forward John. Just to remind you, I saw Matt Bondi wrote something in the Q&A. Thank you yes situation. I do not know if you yeah. I appreciate the reminder and I had a note. Matt Bondi wrote a note earlier in the evening that that Ps59 still has not been approved to close the street under either of its applications. So it looks like the DOE has passed it off to the D.O.T. I guess my first reaction to that is, I'm not surprised, but let me follow up with claire and see if we can push this a little bit more, which street is that which block 56 between second and third right, oh probably because of the bridge. Well, that's always been in the case of the Pa in the past. That's been their argument. Their argument has been that 56th street is a major feeder. We've been turned down for this, not 7:31. Well, we did not start till 6:35, so we have four minutes, but in the past they always insisted that 56th street was a main feeder and but now they have 50:60 blocked. You know for fifth avenue between fifth and you know Madison. I guess- and you know so you mean blocked oh yeah, but for the president yeah. So it's no longer I mean you can't keep that argument up anymore, that it's a critical place so, and I and I said I we had a representative we had from the DOT here you know before, and you know I did not want to be too hard on them, but because they obviously are victims of the system as well. But drop pickup and drop off at Ps59 is a tragedy waiting to happen. I mean it's. The buses pull up on the south on the south side of the street and you know drop off these district 75 kids, many of whom need assistance just to get it just to get acrosss for older new business yeah. So, on a related note, Erica yeah over at Ps116 also noted that we requested that 33rd be closed during drop off and pick up, but we have not heard back from our paperwork request. Is it possible John, like maybe we can have the office staff look into both 59 and 116's request with got yeah? That's something we can do. One thing I will say is at September's joint meeting between the transportation and the health and Education Committee. The indication that I had gotten you know people who attended that meeting can correct me if I'm wrong. The indication that I had gotten is that just has a backlog of applications and that things are slow to process because of the backlog that they have, but I can still check with Eot it's the start of the school year. The in- person school year already wait for all the finger, pointing if God forbid, there's an accident. You know and someone's hurt you know so, let's, let's make sure we're pushing our side on this. You know so any other old. Thank you Brendan for that observation. Thank you rich and ozia. Thanks for that report, that's helpful and that I really like that putting it in perspective. You know six to 10 out of 875 kids. That's that's good! That's good data and we asked them for that data because I they did not realize how important and how helpful that would be for the community to understand it kind of just hits you in the face. Okay, anybody else with older new business, okay, so I'm going to declare the meeting adjourned at 7:34 p.m and we had a 59-minute meeting. Thank you very much good night. Everybody. Thank you guys, bye good night. Thank you. Thank you.",
            "summary": "Is that the chat feature is more for like technology support, While the Q&A feature is for any case that that a member of the public has any questions, they can ask questions to the Q&A feature and actually, speaking of the Q&A feature, I see.\nYou could find you could go to the district 4 town hall, which is November 5th, that's district 4 is up, is in Harlem and there's one tomorrow at district 30 in Queens with the chancellor, but the one that would be most relevant to people on this call and in our district would be with the Community Education Council for District 2, which is why I've circled it Next that we do the the next, the next opportunity to exp for people to express their opinions and views on the how the reopening of schools has been handled would be at the panel for educational policy, which is actually meeting a week from tomorrow night on September 30th at six o'clock.\nIf you can follow the link to this, it's quite an extensive guide to reopening of the schools that the DOE is providing and what they regard as helpful tips to families And so you're, getting a preview of it a couple of weeks before it's actually made public Also, a new online parent, organizing resource called inside schools, plus it's designed by a team at inside schools for New York, City, families.\nThat leads to the question of how do you provide enrichment activities and child care on days when a kid is scheduled for remote learning, but mom and dad are you know, mom and mom or dad, and dad still have to have to go to work?\nThey're all working These people are working 14-hour days just trying to get their schools open and ready for ready for kids.\nKnow, student absences due to Covid-19 kids Get sent home during the day and because they have they're running a temperature or not feeling well, when a staff or faculty member is absent, And they think Covid-19 might be involved or if it's just set home during the day, do the illness self- reported to the school.\nThey won't open until a week from next Learning will be next week on the first of October This was a big concern, as you probably know that they would not have the buses ready and bus drivers and the people who look out for the kids.\nI do not like the term matrons so, but the people who look out for the kids on the buses and once again they're going to instruct parents to go into your child's New York City, schools, Account, and I have that on the next page.\nThe most difficult meeting we had emotionally for me and excuse me every year was when we would have the people from school nutrition come, and you became aware of how many kids in this in our city, the only hot meal they get a day.\nThis was literally presented this afternoon by the Office of family and community empowerment to all Cecs Acrosss, This is the most up- to- date- information that we have on school openings and any questions that do not shoot the messenger.\nClaude, has a lot of experience with this, so you know any questions that any of us can answer or would like me to raise to people.\nI. Think one of my kids schools did a much better job of the remote learning than the other, but any other comments or questions or thoughts that we from people who are here.\nSome schools have bathrooms in the in the classroom, but we're not even talking about kids going to the bathroom A myriad of concerns that the people in the schools would have I do not always agree with the uft on everything it says, but the uft really stepped to the plate here and took the heat and pushed you know pushed this with the with central and with the mayor, and I think.\nI know that the Ps 116 staff has been working really hard to improve on the experience from last school year and they've done a great job.\nI think so you know having access to the zooms is really the most important asset of school working and the DOE has what they call the teach hub and everything flows through their teach, hub, and so for many students.\nYou know and you lose people like, Can You have a sense for how many families showed chose hybrid versus remote It was less than half for full remote when we first started talking with the school about a month or three weeks before school started, but then that number started increasing so with more remote staying home That's what I heard today either moving out of the city or moving over to G t programs, because spots opened up because families moved out or going into Pri a lot to private schools, because people when they kept moving the school start.\nI mean this news like the Big News is very frustrating if you're supportive of public schools and that's something that's important to you, it's devastating, but if you're looking at the microcosm of the kids who have stayed in the system who have access to the internet at 1:16, there's a lot of warm exciting things happening on a daily basis.\nThere was an incident where kids were going out late at night, eleven o'clock, twelve o'clock, one o'clock, and they were mugging folks on First Avenue, especially mugging, both patients and visitors, to the hospitals as well as staff, and so that instigated us actually building a relationship with the center and having them come to the health and Education Committee on a quarterly basis, so that we had a relationship.\nI would like to say that I think this is you know our role as the board is to support them, but also we need to make sure the information that they're giving us goes out to the rest of just not only health and education, but full board.\nI would would love it if you could at next full board just mention some of those numbers, because I think people do not understand like how much they're doing and we need to help build that kind of awareness.\nThe buses, pull up on the south on the south side of the street, and you know drop off these district 75 kids, many of whom need assistance just to get it just to get acrosss for older new business Is it possible John, like maybe we can have the office staff look into both 59 and 116's request with got One thing I will say, is at September's joint meeting between the transportation and the health and Education Committee."
        }
    }
}