{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UC4mwa0sdm78_xO9lGv8bofg",
            "title": "Aging Committee Meeting",
            "publishDate": "2020-11-05",
            "shortDescription": "",
            "lengthSeconds": "1:25:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "LSmNsjd8OCk",
            "fillerWordCount": {
                "uh": 159,
                "um": 113
            },
            "readTimeFullTranscript": "43 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "seniors": 24,
                "centers": 21,
                "budget": 15,
                "program": 13,
                "today": 12,
                "health": 12,
                "programs": 12,
                "information": 12,
                "services": 11,
                "email": 11
            },
            "wordCountSummary": {
                "centers": 11,
                "seniors": 6,
                "budget": 4,
                "services": 4,
                "center": 4,
                "system": 3,
                "access": 3,
                "workers": 2,
                "street": 2,
                "result": 2
            },
            "fullTranscript": "So Julie you there hi yes good morning. How are you good morning, I'm okay? How are you I'm well? Thank you. Thank you for the invitation good morning. Marcy you there need to unmute yourself, hi mercy, sorry about that! That's okay, welcome aboard and you are just trying to print something out. Give me one. Second I need to print something out. You have time, for you know we're still not live yet all right. How are you all I'm hanging in there exactly right, the post-election waiting the waiting is terrible right. Oh, it is crazy. Yeah! Oh, this printer is just driving me nuts, okay, a friend just told me that there may be counting going on for another three or four days or longer, yeah or longer yeah the absentee ballots. You know, I pick up the paper and I read some of the stuff that comes out of Washington and like I, just can't believe what I'm reading it's just too, like you can't make it up. I know just bizarre how many people are expected for today's meeting. Well, I have not heard from anybody that was not coming so I wish. The committee should all be there Julie's already on you're on and it looks like she was on yeah. The only one I heard from was Joseph and he's just running a little bit late. There's Glennis hi Glenn, I'm Mary. How are you, okay, how you doing I'm doing well, I hope everyone's doing well as well seems so all going through the same issues. You know waiting for results, I hear you, apparently the president has tons of lawsuits pending now there. It goes crazy, just crazy, he'll, probably end up suing the 70 million that voted for biden he's going, I hate. All of us I mean just the like the blatancy of it. I do not know. If that's even a word, you know well stop the counting, because it's going to make them win or keep the counting going, because it's going to, let me win I mean you're right outrageous. It's completely outrageous. Scary thing, though, is just what actually happened, because I feel by ramming this last Supreme Court nomination through we're sort of screwed for you for decades now, in a way, but maybe not and also what's scary, is that it's? This close, you know who would have thought that we'd be three days later still at this still at it right. Exactly yeah I was reading some of the things I was reading in the times where they, you know, talked about. Elections like in the past, like I, think I was reading that when it was Reagan, vs, Carter and Reagan won something like 489 electoral votes and carter won like 50 votes, I mean, like the disparity, was so great and also I. Think even one of them, one of the roosevelt elections, I think, was also where there was another election somewhere along the line. That was also where the difference between the two was just so such a huge difference. Yeah, oh fern, will not be here today. That's the other person, it's her birthday as well. She should not be here, therefore she's taking off today and tomorrow. So, let's hope she's partying. Well, right, I feel, like I still have a few days, maybe to get about my little bottle of champagne. I was going to get the other ones, actually I'll be back in a second I'm just going to take a look at the times website and see what's going on, let's just see what they show they're behind, though I think oh, it looks like the Senate. Now is even oh: okay, 48 to 48 and the dems are leading in the House. Yes, Richard, hello, you're, muted, Mariah, hello, Maria, you're, muted, darling, how's, everybody good! Thank you all right! So I'm in all right richard. How are you okay, I know what vern is not going to be here today, not the victory, yet right, friends celebrating the birthday: is it today yeah? Yes, is it really today or is it another day today? I'm sorry it was today right, yes, okay, yeah Mary, do you want us muted or do you want us unmuted or does not matter? It does not matter as long as we do not hear a whole lot of background noise. You know if your phone is going to ring and you need to take a call, then you know mute yourself right, okay, so that we do not have that. Okay, all right so I think we can go ahead and get started. We have Quorum, we have Julie and Marcy on Board Marielle, welcome hello, I'm driving so I'll just be listening. Sorry I said I'm driving, so I'll just be listening, good or anything from carol weeks. I do not see her no huh. No, I'm I have not heard any communication that she will not be able to make it today. I'm sorry, I have not heard any communication from her. I have not seen anything from her she's, not making it okay, all right, so she's, probably she's, probably trying to get on anyway. Let's call this meeting to order at 10:40, A.M I expect that Joseph will be joining us shortly. That's the communication. I got from him. So welcome everybody. I! Think everybody knows everybody at this point. Yes, no everybody knows Marielle De, La Cruz. Everybody knows Maria I thought so, but we all have to say good morning. Marielle, that's true! So I think we're all in you know, as we were saying earlier, when we were chatting just before the meeting, we're all in wait and pray mode. So we'll see what happens as the days continue and the votes get counted. I do not know if anybody else wants to say anything else about the elections. At this point. Personally, I'm happy that the local electeds all got reelected. Well, I'm happy that we did not have any disturbances up here that everybody really cooperated. I went around to the early voters places very little. You know problems some people that have not did not have the patience to wait online, but I think this is something new for. If you know for us here in New York, then we have to get used to do you know to do that. I think it's convenient for a lot of people. The last day of the election I mean the general election day. I should say there was less people because of people took advantage of the early voters. So I think that was good yeah. Well, let's see what happens the many of the situations about the the and the early voters places that we have three up here. We did not see too many problems with the ADA compliance. The butterfly same monitors together to make sure that the people who were working the lines outside you know were really doing what they were supposed to do to expedite, so that people did not have to wait too long online, but anyway, I think it went. You know it went well. This next time would be better. I could probably saw with that. If you could not tell who the workers were, because their badges were so small and there were thousands of people in line that could not tell you could not find anybody right, but that was that's a last-minute jobs that they came up with, because they usually have like a door clerk, which is the person who you know but outside on the street. This was the first time that, and it was cold. It was raining some days, but I do not know. I. Think marcy was going to say something. I just I mean I, agree. I! Think from you know, just what went on earlier this year after George Floyd that we're where we are here is sort of a good area, I, just sort of feel that once the final you know result comes in there's going to be a lot of unrest. Now it may be more downtown and in Midtown and other parts of the city I was in Midtown the other day. I had a couple of medical appointments, and you know places were starting to board up there. Their stores and stuff, like that, I'm worried as to I kind of feel that, regardless of the outcome, there's going to be some pretty major unrest, it may not come up to the heights and Inwood because we're so peaceful up here but I think there's going to be I just think elsewhere in the city and even in the other. You know when I say the city I mean other boroughs as well. I'm just I'm just kind of not fearful, but just like I think I think stuff is going to hit the fan. That's just my feeling. I voted early, I went the first day and I was very fortunate because I brought along I had not completed my absentee ballot, but I just brought it along with me and that saved me having to have like a two or three hour: wait because I filled it out right then, and there they said. If you have an absentee ballot, we can bring you in without waiting on the whole line, because it easily would have been a two or three hour. Wait for me. So I was able to put my ballot in the you know in the dropbox I had to wait on a shorter line and then I went in so for me the voting was, you know, was okay, it was okay, I voted at the armory yeah, okay, yeah well. I I also noticed that the the armory and the Columbia University were really hospitable. They are, they brought a refreshment for the to the workers and they tried to make sure that everybody was comfortable, so I think that you know they deserve. You know our thanks for that, and you say something about this. You know, disturbances, I, think, there's going to be some in some areas. I think it's most of these things are organized by outsiders, yeah, the local people. You know we have demonstration, but not a of the sin that are happening in Brooklyn and exactly yeah. So you know part of the three police prisons. I could report that there were some problems within the George Washington Bridge, but that was a caravan that came from New Jersey. They blocked their plates. They you can, they could not identify who this the vehicles were from, but yeah he was taking. You know under control very early from the beginning of the you know when they realized that what was happening but I, think that's is the sign of the time that there is. You know the communication people can reach out to everybody by you know by zoom by telephone by you know, the news media is also they love. They love to Agitate I, think the new media is giving them. You know time to some people who you know they love to do this type of thing. So we have to. You know, I, think that you know the result of this election is, is going to make us a little more conscious about the things that we are doing and since that we should be doing and things that we have not done and we need to communicate with each other. We need to talk to each other I think. The other thing is also that the numb, the sheer numbers of people who came out and people I heard you know like interviews with people who never voted before. When you have you know in the past, it seemed that if you that they would, people would be amazed like if you had a 50 turnout that was considered good and that's really pretty horrible. If you have only half the electorate turning out but millions, hundreds of millions of people so I think you know, people were really feeling regard regardless of what side people were feeling energized and maybe there's some way to make sure that this there should be this kind of participation. Always we need to take advantage. We need to take advantage of this opportunity now to get the people you know to stay involved and to you know to air. You know this. These conditions that everybody's going through and to see how we can better. You know the country, because this is a fantastic country, upset that if you see how you know some of the states handle certain situations, it's painful, but I think that we need right now we need to get you know to heal and, to you know, try to move forward, especially the younger people, because they expect a lot and they do not have the patience that we, you know over 35, half anyway, Maddie I think we're taking a meeting. That's okay! I'm you know happy to hear all this discussion and I think it's you know really important. You know and I was really impressed by the numbers of very I have to say old people. 100,102 106 year old people going out getting out to vote. That's amazing! You know the three people who were you know you're serving on Channel, seven Channel, four and sister they're from my area. People two of them are from my church. One of them is the ants of George tingling, which is this. You know city clock now right. It means that I live down the block from here. You know my the building now next to ours, the lady 107 years old, it's from the corner of Broadway 157. Also she is a catholic agenda. She comes to Alcatel Detroit does not miss one day, one Sunday she's. She lost a leg she due to diabetes years ago, but still she does everything in her house that she can in the home attend actually tell the home attendant. You know when you know what to do and what not to do very you know I'm really involved and she wanted to go in person to vote because I said to her, you know it's the absentee ballot. You can chill it out and you know take it in just forget it and going in, and so that was later on. Psr 28 also she's been she's, been boating forever. Also in person she's forget about you know getting this paper. Ballot thing is for some other people, but one thing that I wanted to say to I miss one Lady Mrs Miss, Schwartz W-a-t-T-S that lives on Nicolas Avenue, for you know a long time when she turned 103 years old. She she was very more frail than before, but what she did is that she, when she they wheel her to the entrance of the school right, he will get off from her wheelchair he's an african-american lady and she wanted to walk from the hall to the table to her table which she would have to sign in because she says she wanted to show the young people the struggle of the african-american people trying to get the rights to vote. So she did not want to show that she was I mean they would just wield her and it was very easy. She said she wanted to do, and this year I miss her I have to find out if she's still around or whatever, but here every elation she will walk to the table again, sign in and then go and vote because she, you know she says the people on her. You know you know, years and years they worked so hard to for the right to vote. Why could not she just walk to the you know to the the new scandal, because before it used to be like those label machine, remember which I know I used to love this machine, but anyway, but I miss her this year. I have to find out what happened. You know if she's, okay or whatever anyway so I took I, took guys for your time. Mary, that's! Okay, actually, I want to talk a little bit about the budget results, the capital expense budget results. Did everybody get copies, I sent out to the public members and also to marcy Julie I had to apologize because I do not know how many of you I did not want to say too much about it, but I have surgery on both sides, because I have a problem in one of my eyes, so I could not read and I was driving crazy. Trying to help me so I really did not respond to the budget, which is you know first time in many years that I have done something like that. So I'm not too familiar with the results Mary. So I'm sorry well. The committee made out very well on the capital budget with the board voting votes, system-wide upgrade of CB12 area to improve access to connectivity and Wi-fi. The board voted as number two right. Okay number one was under house housing and Human services. So that was number two and the next item that we had vote. We had voted as number two renovate existing or build replacement. Senior centers as necessary to comply with ADA and Diff der regulations is not. It was voted number eight by the board. That's wonderful because, as you know, the the city usually consider the the ranking the highest ranking by the full bore. You know, you know, I, think you did a good job Mary and to have all three. We have a third one on the capital budget, too, provide funding to construct, affordable, accessible senior housing. The board ranked number three. So all three of those of the capital budget items for our committee were ranked. You know in the top eight really I can't even say the top ten, the top eight so I think. That's you know an excellent show for our committee and you know the things that we want for the seniors in the community. So well. Let's hope this city comes up with the money now because you know it takes like his sons. You know it takes a push by our by the City Council member. You know to make sure that they do not. You know pull this in for the following year and things like that on the expense budget. We did not do as well, but I can tell you that the one item that we left for excuse me, health and Environment Committee- is the mental health issue, thanks to Marcy's wording that the health and Environment Committee adopted our suggestion for including the seniors in that and I'll read it expand mental health services in the community, especially for seniors and others, whose mental health and Social engagement have been adversely impacted by Covid-19. was ranked number one by the board. So that's wow, it does not. You know, okay, so that's on the expense budget. The items for our committee I will give you the rankings again, but I'll increase funding to expand services at senior centers in city 12 m to include hired hiring additional social workers and program coordinators to create culturally competent programs, adding meals, extending hours increasing per male per meal reimbursement rates. That was ranked number 10 by the board, which you know it's not bad. That's within the top 10. The other items did not do so well. Increase access and outreach to healthy, culturally appropriate food for seniors with medical needs, ranked number 19 by the board increased funding to expand services. Oh no I did that one increase the expansion in the program expanded in home services for elderly persons, funding to provide affordable home care, including sliding skill reimbursement ranked number fifty ranked 15 by the board increase funding for transportation for seniors by restoring prior City Council funding and expanding access to access and outreach, ranked 25 by the board increased funding for naturally occurring retirement communities to support, currently unfunded mandate for nursing hours, ranked 29 by the board increase other than personal expense, personal services, funding for replacement, furnishings, non-capital and senior centers that as needed, ranked number 44 by the board. Mary was there anything about I can't remember: did we put in anything about technology and access to technology under the in the capital system, system-wide upgrade of Cb12 M area, because we wanted to make it more in discussion with the full board wanted to make it more inclusive than just the senior centers? And you know one whole area of CB12, which would include because youth and Education Committee wanted it to include the schools kind of thing. What makes sense I mean to get the connectivity for everybody, system-wide, upgraded, Cb12, M area to improve access to connectivity and Wi-fi the board ranked number two, oh okay, so that was, after the mental health on the expense budget, but yeah. So we'll see what happens with that. You know, as I said, and as Maria said, we do these ratings rankings for committee and then we do it. Then the whole board does the rankings it's all compiled into how you know how it comes up. Joseph, hi, hello. How are you okay, good? We were just talking about the budget results and I'm sure you have that the results. No, we got the results you should have got. It was sent out to all board members. Okay, I did not look at it. Yes, how did we fare the capital budget? The three items ranked number two number eight and number three right: the expense budgets. We did not do so great on, but the one item on the expense budget that fell under health and environment because they had already had it on theirs. Under the mental health issue ranked number one by the board, so you know that that's really good and they took our wording to include them in that item, and we were just talking about the fact that just because we ranked it and sent it in- and you know it's number one number two etc does not mean that the funding is going to be available for those things. But we will keep pushing and hoping the connectivity for and Wi-fi for. The entire CB12 area was made more global because youth education wanted to have it also in the schools, and you know that sort of thing, so we made it very global and so it came, it was ranked number two by the whole board. So that's a good thing. Any other comments about the budget. Okay, oh really, I think we did fantastic Mary. Thank you. Thank you for your. You know commitment also and to make sure that you have the link with all the other committees, because I mean it's a it's a joint effort and it's something that should be done by the entire community or membership that they should be looking at the issues on all the committees in order to push to make sure to make us stronger as opposed to just living committees. You know work by themselves. I think that you know especially the issue the needs. Most of the things that we put in our budget should be mandatory in any city in any place that you know that have the type of economy that New York have, and we are always begging for things that we you know. That is really. That should not be bad. That's the process and we have to follow, but I think we are. As a committee, we should be proud, agreed accomplishment, I, agree, and you know a big shout out and thank you to all of the committee members, for you know their input and also the guests on the committee, because you know marcy was able to come up with the wording for the for the mental health issue, and you know that's really appreciated. Thank you, yeah, so everybody's really putting in a lot of effort into this committee, and you know that makes me feel good that I'm working with such a great team, okay, I, have other old business. One of the things I saw this morning on the patch and I do not know if anybody else saw it. It's the increase in Covid-19 infected people during the last four weeks in the Washington Heights area, the three zip codes, 1032, 33 and 3 4, have all shown a big increase. 3-2, which is mine, is way up and I tell you the numbers. What they showed was the increase over the last four weeks compared to the previous four weeks, and then the three two was one of 104 cases in this past four weeks to 41 in the prior four weeks. That's a huge increase. Did they say why they feel? That is the increases that maybe people who are a little not that much concern I mean I, saw a lot of people. I have seen people without masks sitting on an outside restaurant and I. Just do not know if they are enforcing or where are those cases coming from it's on the you know younger population or the older population? Well, when you, when you go to a restaurant, you do not have to have your mask on when you're sitting down no right. I understand that, but most of, if you see the restaurant and they have this plastic wrapped around or the canvas things I mean somehow it does not make me feel too secure about. You know protection, but that's my personal feeling. Let me just let me just tell you the other two zips they're, you know they're less impressive, but you know still there's an increase. 33 98 in the past four weeks, 52 the prior four weeks and the three four 55 compared to 30 in the prior four weeks, Marie I agree with you about the outdoor dining I mean I, can't see, and also now they're building sort of. Almost you know more enclosed, not just plastic wraps but they're. Putting actually you know heavy stuff and building up the walls. I do not really like those outdoors in those outdoor dining areas, I was going to say, I, do not I do not see what the real, because I've been noticing that too some of the places. Let me just let me just finish my thought before I lose it the reason. I'm saying that there's going to be more of a problem there I think is because now, okay, everybody inside there has their masks off whether it's social, distancing or not, and most of it's not because the tables are on top of each other and the outdoor dining. But all those droplets that are being let out of everybody- that's sitting out there in those dining areas now is enclosed and confined there's no way out for that stuff. There's! No, you know, ventilation of any kind. I can't see how it's not going to increase I, really can't see how it's not going to get worse and as far as the area goes, I think you know out in the street, I mean I passed six people the other day and not one of those six yeah. Some of them had masks on, but they had them under their chin or they had them over their mouth and not their nose. You know that kind of thing I was going to say: I, do not I'm seeing these places. You know with the outdoor dining and I understand that the restaurants want to be able to provide a venue or keep providing a venue, but honestly to me, with the with the way they're building these I'll call them sheds. Now you know more than just say like, for example, kismat up on Fort Washington, the indian restaurant I went there during the summer and they had their sidewalk part. You know they had like a tarp kind of thing over it, but just over it now it sort of extends. It does not seem like there's a real difference to me. If you build the shed out on the sidewalk and you enclose it in a more structured way, you know to keep out the cold. What's the difference between that and indoor dining I mean it's essentially the same. It's not like you've got a tarp over the seeds that can keep out the rain, but then you know that the air can come in. So what's really the difference and I think they're probably figuring that unless they do something they're not going to be able to serve anybody who wants to sit out in 35 I certainly am not going to sit out in 40 degree weather. Even if there's heaters in there, you know to me that's not feeling so comfortable, so I do not know, I'm not surprised in a way. I'm not surprised I do not think that the numbers are increasing because of the restaurant I think that most of the owners are doing everything they can to get the business going. I think it's more than the implication when someone knocks on my door, I have a little math. You know by the you know. I did not know the doorknob and I. Do not let anybody in here unless they have a mess, I mean my sister and I live alone, and we have no babies anymore. So I'm not going to take a chance even with the liberty, so even neighbors from around I think that the people should be doing something similar not to let anybody just walking from the street, because you do not know what you're carrying and things like that and try to you know to wash everything that they purchased. On the you know, restaurants I mean the supermarkets and you know bodegas and everything else, because and now we are which you know the new wave that they talk about. You know I hope it does not hit us. You know, because for the winter it's going to be very difficult to control, that type of illness. I do not know I just do not know how to maybe pass it away to the senior centers to inform people to be careful not to allow people to even home attendant. They should be. You know when they come to the you know, to provide services. They should be careful about. You know health security for the people who are they going to be taken care of so what we've been doing for the for, because we it's not technically part of the senior center, but we have a program called safe at home. That works with you know seniors in the community, and one of the services that it offers is, what do you call it housekeeping and for any of the seniors who want to have the housekeeping services who may have had them before, and then they were, you know, suspended and out. They have to sign a waiver and unless we have a waiver on file, you know for that person we're not going to send the housekeeper in they have to take I mean I have a copy of the waiver. Here, you know all kinds of precautions if they're going to go in, but I think also a lot of stuff. These days is so driven by what people hear on the media, whether it's the radio, the newspapers, the social media. You know when I think between all the stuff. That's just been going on, and you hear one side saying up we're turning the corner on this, and then you hear the saner mind, saying nope we're not turning the corner on this. It's going to get worse before it gets better I think people are getting a lot of conflicting information and they're, also so tired of having to live in kind of a semi lockdown. For you know months that people are getting antsy and they're and they're kind of you know. Many people are kind of loosening their. You know letting down their guard. Let's say in a way: I think you know, despite the what the governor I mean, I think New York is probably doing a lot better than a lot of the other states from what I read, but it's still starting to starting to change in here we're getting another spike yeah about the elderly. You know there are people who will you know if we guess this situation, nothing will save them. Young people, you hear I mean from the fool that is sitting on the White House that he's parading all over the country. Thinking that he's so cute, you know sending the wrong message, but I think that we need to be local for our local people just to urgent to be a little more careful and that we, you know we need to protect and protect each other. Is there some way that maybe I mean? Is there some effort that the committee could make? You know like a like tabling or something I mean I do not know. You know to kind of get out the word or just kind of or reinforce the word. Perhaps you know or have some sort of like again I do not know. You know like a have something in some of the part. You know like an information table or some I, I'm not really I'm just kind of thinking off the top of my head. Some sort of you know or have some places where people can go where they know that they can get sound covered information you know, and maybe, if people feel like they need either someone to talk to or want a referral to some sort of services that might be able to you know, provide some sort of support and I do not mean like we're going to be taking care of everybody's finances or anything, but just you know some sort of community effort to kind of now that we're you know seven, eight, almost nine months or eight months into this pandemic. You know something like a community event, perhaps I'm just going to throw that idea out. You know that sounds like a good idea, and you know perhaps the health and Environment Committee would want to do. You know join in something like this. I have an idea- maybe you know how about true alcohol and some type of communication to all these senior centers within community world 12 asking them what type? What type of security measures are they are following and see if they need, you know any they need additional. You know help that we could, you know, get to them and as far as communicating with their membership, but no not all the senior centers are open. Of course we're not open. No! Actually! No, let me let me let me interrupt here for a moment we have Julie on the committee and Julie is the chair of the directors of the senior centers Julie, we're not we're not open. Right now, they sent out a communication to us asking us to answer a survey as to what our reopening plan might look like and asking us to provide a tentative date for, at which point we might feel willing to reopen, and they would they wanted that date from us, because they were not requiring all the senior centers to say that they were willing to reopen, and if only some were, they wanted to know whether they could pick up some of the slack for those that were not ready. The original date they gave us that was the earliest we could put in for was November 9th last Friday. We all responded to this survey. Everybody responded differently last week on Friday, they sent out a follow-up communication. That said, that is off the table due to what they're looking at right now and the new numbers and the new you know new updates on the situation. They are putting a hold again on our tentative reopening date and when I should clarify when I say reopening date, they're talking about walking backwards, not reopening, congregate, doing the same way. We went forward into Covid-19 to backing ourselves back out, they're looking at grab-and-go and possibly home delivered meals, the problem with the home delivered meals, although that is very attractive to many of us. If it was not in our original budgets, there would not be extra money for that, so we were advised by I know. I was advised by my nutritionist and my program officer not to commit anything that I can't squeeze into my regular budget which, by the way Defta said, is going to be caught. So, although it's very attractive, I'm not going to put in for home delivered if they're not going to help me fund that I did put in for grab and go, and we would have been willing and very eager to start on the 9th. It's not happening last Friday, they said no and they did not give us a new tentative date. I can tell you that, as far as Mariah is concerned, marcy can speak to the why, as far as Mariah is concerned, as soon as they give us the next tentative date we're going to put in for it, our seniors really need it. Even not just do they really need the meal which we have the double complication of our seniors being kosher only and the kosher meal option coming from the city not only being unpalatable, not only being inc inconsistent, they do not produce enough of them. So a lot of our seniors, who are on the kosher option, find that if they run out, they just do not send. This is a problem. So that's just a separate problem. Just for us, some of our clients have asked for kosher option. Even if, though, they're not kosher only because they're used to eating at our center and they think that they might be getting similar type food and they have gone off it, then because they do not require it and they're finding that their meals are not always coming so we're very eager to start up again and it's not just for the food piece I think grab and go for the seniors if they do it properly with proper PPE, there's some social contact for them and they are missing that so terribly we have a robust, zoom programming. But again, not all our seniors have the equipment, the internet, the tablets I mean everything that was discussed here. We have some that do, but we have many that do not and we call them and we talk to them, but they really miss. Even if it's just seeing our face for 10 seconds when we hand off a meal, they want that and I want that for them. So we're going to open as soon as we can and we're going to try to do it as safely as we can. But right now the department put the big red stop sign up for us sure. That's my favorite idea. I had another idea that maybe because maybe cause some money, is it possible that we could organize a little postcard type of drive to influence or to bring to each to each client anyone that's receiving. You know the you know the food says you know. Covid-19 is still around remember to stay safe by following certain. You know we do regular wellness checks with all our clients. We call them all on a rotating basis, so they are being reached out to you know if we everyone they can put like at the refrigerator that they can remember that they cover an email came a different thing came this morning. First of all, should we I do not even remember getting that email from gift about the eleven nine date being off the table? Maybe I know they just say they did. They did not say specifically eleven nine. They just said it's off the table right now, we're not looking into reopening again I. Do not even remember getting that. Can you forward it to Friday right, Friday I think it was Friday? Oh, my gosh I want to just give a shout out to Mariah, because I saw you guys were featured in the an email came this morning about a new initiative called friendly voices that did organizing where they are they're doing their matching. Let's say volunteers up with older adults who want to have social engagement, so it could be- or you know not just necessarily members of senior centers, where it's kind of like friendly visiting by phone, so it's called friendly voices and a newsletter or a sort of a you know. Email came today from the commissioner which had that as well as some other things, but in the in that email also, they highlighted a couple of senior centers that were doing some really interesting programs, one of which was Mariah and the zoom program. I did not read it yet. I see it now all right so yeah we we've been doing a lot of fun stuff, but the thing that they highlighted was our craft class we've been delivering to their homes, the kits for the crafts and then doing them together virtually and we made tie-dye masks with them right next week, yeah, oh, that was the floral Napkin rings. Oh sorry, they highlighted an old one. We did floral Napkin rings before the springtime, but no recently we'd actually do tie-dye masks with them and we're very excited music. Next week on Monday yeah World Music, oh Darius, Kaufman he's amazing. We've had it before in person, we're also very excited. Our book club has been continuing virtually too and we had a little bit of a stop when the libraries were closed, because we could not get the books out of the library, no matter how hard we tried, but the libraries are slowly reopening and we have now a few of our upcoming selections in-house. Here and again. We deliver them to our clients, homes and we're super excited, because our next book club selection, we're going to have the author join us on zoom. So that's always a lot of fun. So that's going to be on December 7th and hopefully a lot of people will read the book and come and enjoy they like they need that social interaction. In any way we can tell marxism October 30th is the email one from the associate commissioner from in Switzerland right. So you have svetland the associate commissioner sent out an email on the 30th about the cancellation of the reopen date and then, to be honest, you have svetlana as a program officer. She then copied it. She forwarded the exact same email about an hour later, all right, I'm going to look right now, I'm going to take a look right now because I for some reason, I do not maybe I just did not I got it three times, I got it twice from difta and then so that's what this might be, the one in the third paragraph, it's in the third paragraph until further notice. You want to move on sorry. Okay, that's okay, good discussion and it's you know interesting how much the senior centers are actually doing in terms of reaching out to the clients and providing well. We have we send out a weekly I know. Marcy does too we send out a weekly email and it has lots of pertinent information and also our entire zoom program for the week, and we also met with the police department with the seniors also. So they could. You know, hear about scams during Covid-19 we had crime prevention officer with us and on zoom, so we're trying to keep them engaged in a lot of different ways. Also, it's only as good as the number of people that okay new business I just wanted to. Well, actually that going to say something there that should really come under announcements, but I think it belongs under new business. Just because it's going to end up being a little bit of a discussion. Maybe the borough president, along with whoever downtown I, can't remember exactly how it's, but anyway, CB12 won the pay. They had a paper challenge for which community boards could do the most paper, recycling and community Board 12 won first prize, which is a good amount of money. The money is not going to be used for the Community Board, but for sorry, I'm looking for my notes somewhere, oh for a Community board organization for organizations, community-based organizations in the community and board offices asked for suggestions for about those community-based organizations and who people think that the money should be going to so. If anybody has any suggestions, please let the Community Board office know if anybody has any ideas at this point you can. Let me know well, I hope that the money goes to the small, this small organization, the smaller organization, as opposed to the large. You know cvo's I, you know they have the staff to you know to put together proposals and things like that and most of our senior centers do not have that ability to to apply for money. Maybe some of the people who are listening today should take advantage of that before the money disappears into lawyers hands. Does anybody have anything else that might fall under new business? Anything is going on for the sounds giving you know. The holidays are coming hanukkah and things like that. Anyone is doing any extraordinary, simple seniors in our areas, especially you know, you know we're doing virtual parties and we're trying to have different wearing a virtual craft, we're going to do candle making for hanukkah and we're having a virtual party. Fear featuring live music and we might have some other video special event on the Wednesday, because it's eight days we're trying to. But it's hard it's hard to, do it virtually, but we're trying to and again only if you only reach a certain level right. We can only ask Connie and Connie's. In the background telling me these programs are all fantastic but they're only as good as the numbers that we can get in on zoom and who can join. You know and if we show a dreidel collection, video people can't phone into that they can phone in to hear the music right yeah and they can't phone in to do the craft I mean they can. But the social aspect is missing: okay, so hold on a second okay. I wanted to spend some time talking about ideas for presentations at the meetings. Now, hopefully, we can try to begin to reach out to seniors who have the means to get into these zoom meetings. You know people from the senior centers and Julie I think you could be helpful in spreading the word so that you know these presentations can be the knowledge of these presentations can be. You know, put out there in the community. We had a couple of suggestions from board members. One person I had thought about because we've been having her do. Presentations at the agent committee is values from the Alzheimer's association. She does a terrific presentation on Alzheimer's, Wayne Benjamin who lives down in Maria's area, talked about. You know the seniors down there, not necessarily you know, residents who are even in place at home and but people who are able to get out and you know, enjoy life and that kind of thing there may be some topics that would be of interest to them. Wayne suggested things like staying active and healthy health insurance considerations, employment considerations for seniors estate, planning well, I, think that sounds good maddy. That sounds good and Richard. Allman suggested possibility too, that perhaps carmen did Larosa talk about bills that are currently on board for that she's. The sponsor on that particularly affect the aging community. One has to do with elder parole and elder release from prisons. The other I know less about, but I'll tell you what Mary are we on for five? More minutes? Oh yeah, let me pull up the bill and see if I can get more a little more information on that I'll be right. Back! Okay, no I was going to answer well he's looking for that very is Brian a wayne talking about the young elderly, the younger elderly or the older elder I mean the social active people. What is he talking about? I mean what is the age range? That is, you know, because we're lighting our community there's a lot of seniors that are well off. Okay, let me let me let me read. Let me read his the part of this email here. Like me, these are people who, while over 60, are not focused on priority access to stores are not associated with senior centers and are among the many city, res city residents, who are aging in place at home. I wonder how the aging committee might cover agenda items for these seniors. Those are the things that I quoted before so you know seniors who are active in the community, still not senior centers, but he's considering himself a syrian now or close to via senior Israel. Wait like me, okay, like me, yeah I, guess I think he did say that at one point at one executive meeting, so any other thoughts, but I think that it would bring a br I loved. You know a lot to talk, there's been a problem, for you know some people in our community to be part of a senior center. Unless now with the cub, it's a situation, it's very hard until everything goes back to normal we're trying to get programs and try together and be engaged a lot of people like music and how many of us in the center have a lot of music programs that they can come and enjoy or movies, and things like that I do not have to go downtown to meet town or, to you know the to the village for entertainment. Things like that, but I think that the once we open up these senior centers they may be because of experience that people have had during this this hard time. They would like to join the senior center and they come out and participate, and things like that, but that's going to be, you know, work that we all have to do. Mary, Marielle, De, La, Cruz, put in the question and answer she wrote rights of tenants during coded I think we do. We did as a committee. We did well when our ranking, for you know seniors, are housing and things like that. A protection, you know, I, think we're doing. You know real well as a committee within the community we're twelve and the the groups that are participating in the Waikoloa Senior Center group. Also, you know very active. Everybody is really you know, working very hard to provide services to and not to leave the seniors alone. You know during this high time, so yourself, yeah I, was going to say. Would it make sense? Because everyone in every industry now has to like recreate things and figure out how to cope during Covid-19? So what if we had? You know people who ran senior centers almost present to each other, what they're doing what they've innovated, what they've added and they can kind of learn from each other? Is that something that we would want to convene together or even again today, because things are on zoom, you can have one senior sense like Mariah could be doing something great, but they could open it up perhaps to people who do not only come to Mariah normally and having more cross-pollination learning from each other and participating with each other. Well, I know that that's something, for instance, that rosemary cortez has been doing with her program the health outreach program, because I've been actually every Wednesday at one o'clock tuning in to like a presentation that her ot students have been doing. Also marcy I got a I, got a invite from marcy from for the for programs that are happening at the y, so I think reaching out into the community. In that way, is you know you know we have a lot of and there's a lot of overlap. You know, for example, a whole bunch of well not a whole bunch, but some of shuli's clients may I know that some of them attend have attended programs here and by the same token, some of our members also attend Mariah programs, and you know we're doing it virtually now. So, amongst the senior centers, you know we get together and we, you know kind of, let each other know what each other is doing. I mean there's nothing that says that if you're a senior in the community, whether you're a member or not- or even you know, if you're living in staten, island or Brooklyn, you could go on to have programs. The issue becomes, though, that if some, if an older adult who fits the diff to guidelines for you, know being a senior center member, if the person is not registered as a member, we can't count that person as participating. But, for example, let's say you lived, let's say you lived in park slope and you wanted to participate. So you just you know someone sent you a link to the programs. You go on the program you register and then what we would do is we would try to encourage you to register as a member now granted yeah I'm not getting into the details of registrations and people are we. My point is again: I'm just curious whether us as the committee of aging for CB12, do we try to plea, play a role of bridging you know, I'm sure there are other organizations doing it as well, but bridging between the our partners in the in the centers. That's all well, maybe there's a way you know if there were, you know to list all of the different websites or places where seniors in the community could go right. Is there? Is there a comprehensive calendar for CB12, because again now that things are on zoom, you've really opened up so many opportunities for people who I always go to this center and they do not think beyond that. But there's no reason to think that way anymore as you're saying yeah. Of course they could go. They could do something in staten island as well, but at least let's try to see what's going on within our community Julie Shirley. Are you there yeah, I'm here? What I'm sorry? Oh, do you have anything that might answer his question? I'm sorry I missed the last question. I was listening to the discussion, but then marcy was answering so I did not that's the same question just wondering whether this committee, I'm happy that, should I put it together to facilitate a conversation between people who are running the centers to have more conversations, it could be happening already. Oh it's happening already, I'm the head of the subcommittee of Waikoloa Senior Center. That is the community program directors that involves not just senior center directors, but it does involve all senior center directors in this area and also self-help and Al and all other community programs and we meet. We were meeting every two months we now meet every month over zoom, because we feel that right now, there's a lot more to talk about and we do meet and we do share with each other and I'm happy to send our newsletter out to anyone registered or not, and in fact we do. We, there are even organizations in New, Jersey who've been sending I mean I get participants from all over. They send. We tell the local religious institutions to send out invitations to join our mailing list, of course again, if they, if they want to register afterwards, I'm happy to register them, but we do as much outreach as we can, because we want as many seniors as we can to, but I do think there is that structure already there, where we are. The directors of the different organizations are certainly sharing an outreach. I mean that's part of what we do is outreach, so would it be helpful if us, the community board, would also have that information I do not know how you envision doing that, what and sharing it and sharing it, whether it's at the general meeting or sharing it with our email list. Well I mean I'm a member of Waikoloa Senior Center, also because I represent community board 12, because I'm on the it, because I'm the chair of the aging committee, so you know, if it's something already I, then disregard what I'm saying what I was thinking the way I interpreted. What you were saying was, for example, you have a calendar for November 2020 and then on each day. You know, even if we you did it as like a sheet like that, you know so Shulie's doing xyz on that one day and we're doing something and just maybe even list the programs for that day with links or something so that people could know is that kind of what you were talking about well, this was supposed to be on the Waikoloa Senior Center website, but it's just not being updated and we had some issues with regard to that which we did discuss at the Waikoloa Senior Center meeting and the fact that Waikoloa Senior Center has a page where, on that page are the links to all the senior center newsletters. Who else I can only speak to myself my own, it's still from June up there and I send them. You know I added them to my mailing list and they're not getting updated. So it's not. So it's a lot of work, obviously to update weekly. You know for people who are sending out weekly things who's going to do that and how you envision it. That's what I did not understand Yosef, so maybe even to have a conversation about that. You know how to how again where my I view our role in the community board is as convenient. Maybe and maybe surely you and I can talk about that sorry, yeah I mean I at the Wacom meeting. I had offered I can't I can not commit the time to updating everybody's okay, so links on the website, but we had there was some discussion about giving access to the individual organizations to each update their own information, at least right. So that no problem, but that you know I made that offer I put that out there and I did not hear back I'm happy to send anyone who wants at the link to you know our either a weekly email or a pdf of our program or a link to the pdf of our pro of our program each week, I'm happy to do the updating for my own organization. I really wish I could tell you that I had time to do updates for every organization. I can't commit to that and I do not like I, do not like to over promise I'd rather just say what I can do and I'm happy to share our information and I'm happy to update our information on other people's sites if they would like me to and if they find a way to give me permission to do so, I'm trying to get the information out there as best I can okay, I guess what I have to say: I can bring it up in waikala and then report back to the committee to see how we can bridge this gap and get all the information so that the committee, the Agent Committee, will be aware of what's going on and can spread. The word make sense. Yes, no! That's fine with me. Okay, all right all right, so we have not come up with definitive plans for presentations. Let me finish that information. Now, that's right! Richard! I'm sorry! You're back! Okay go ahead! There are two bills pending which may be of interest to the committee. One establishes one generally operates under the title elder parole. The substance of the bill establishes a new process for additional evaluation of people over age 55 who are incarcerated, moving towards parole wherever possible. There is a second bill that I've looked at less, but the general direction of it increases penalties for offense any criminal offenses committed against people over age. I'm glad to try to learn more about that I. Depending on the committee schedule. It might be worth a presentation of one sort or another richard, I'm sorry, the second, the second bill you're talking about increased penalty for criminal offenses committed against someone, age, 60 or older, wow, okay, so that you're talking about elderly abuse or criminals. You know from reading the memo on top of the bill and not having read the full text of the bill. It seems to me that that's targeted towards a street mugging, a robbery and the kinds of things you talk about it's. It looks to me to be a pretty wide sweep of a bill. That's because so many elderly people have been pushed on the subway thing or you know, hit on the street. You know just by their elites and people with mental problems. Things like that. Okay, it's nothing terribly new. It is a vulnerable population, we're just seeing new examples of it that fit this moment in time. So maybe medic. Do you think we could adding that to our next yeah the agenda to see you? Do you think we could get somebody from either carmen or somebody from the office to do that in December at our December meeting? Or is that too soon? I'm glad to do the ask if you want me to and then just get back to me and then that would be December 3rd I. Just I noticed that we are just joined by the beauty. Cutie thinks here Rabbi is that one of the little ones or the oldest one just she's one, that's kind of growing before our eyes, she's, so cute, she's, very cute, I figured it's a better background than picture of me. You're right, you're right, that's very refreshing that you did that love! It I love that picture anything else that anybody would like to talk about or discuss or report Mary I just want to. Let you know Carol weeks she's on the call she's was able to connect via the telephone, okay, perfect, going once going twice all right, so our next meeting will be December 3rd at 10:30 A.M, and we will call this meeting will adjourn this meeting motion to Adjourn seconded okay. Thank you. Thank you. So much Joseph. Can you stay on for a minute? Thank you. Okay! I will see you all soon somewhere. Thank you. Okay, I, just wanted to you took the minutes. Yes from when you jumped in I did not know that I was supposed to do that, but I can try to recreate now.",
            "summary": "You could not tell who the workers were, because their badges were so small and there were thousands of people in line that could not tell you could not find anybody right, but that was that's a last-minute jobs that they came up with, because they usually have like a door clerk, which is the person who you know but outside on the street.\nThink from you know, just what went on earlier this year after George Floyd that we're where we are here is sort of a good area, I, just sort of feel that once the final you know result comes in there's going to be a lot of unrest.\nYou know, disturbances, I, think, there's going to be some in some areas.\nThink that you know the result of this election is, is going to make us a little more conscious about the things that we are doing and since that we should be doing and things that we have not done, and we need to communicate with each other.\nOther thing is also that the numb, the sheer numbers of people who came out and people I heard you know like interviews with people who never voted.\nSo I, think you know, people were really feeling regard regardless of what side people were feeling energized and maybe there's some way to make sure that this there should be.\nI have to find out if she's still around or whatever, but here every elation she will walk to the table, again, sign in and then go and vote because she, you know she says the people on her.\nOkay, actually, I want to talk a little bit about the budget, results.\nSo I really did not respond to the budget, which is you know first time in many years that I have done something like that.\nThe committee made out very well on the capital budget, with the board voting votes, system-wide, upgrade of CB12 area to improve access to connectivity and Wi-fi.\nYou know the things that we want for the seniors in the community.\nLet's hope this city comes up with the money now because you know it takes like his sons.\nYou know pull this in for the following year and things like that on the expense budget.\nI will give you the rankings again, but I'll increase funding to expand services at senior centers in city 12 m to include hired hiring additional social workers and program coordinators to create culturally competent programs, adding meals, extending hours increasing per male per meal reimbursement, rates.\nIncrease access and outreach to healthy, culturally appropriate food for seniors, with medical needs, ranked number 19 by the board.\nIncreased funding for naturally occurring retirement communities to support, currently, unfunded mandate for nursing, hours, ranked 29 by the board increase other than personal expense, personal services, funding for replacement, furnishings, non-capital and senior centers that as needed, ranked number 44 by the board.\nDid we put in anything about technology and access to technology under the in the capital, system, system-wide upgrade of Cb12 M area, because we wanted to make it more in discussion with the full board wanted to make it more inclusive than just the senior centers.\nAnd. You know one whole area of CB12, which would include because youth and Education Committee wanted it to include the schools kind of thing.\nYou, know commitment, also and to make sure that you have the link with all the other committees, because I mean it's a.\nYeah, so everybody's really putting in a lot of effort into this committee, and you know that makes me feel good that I'm working with such a great team.\nYou know that kind of thing I was going to say: I, do not I'm seeing these places.\nI think that the people should be doing something similar not to let anybody just walking from the street, because you do not know what you're carrying and things like that and try to.\nI just do not know how to maybe pass it away to the senior centers to inform people to be careful not to allow people to even home.\nYou know health security for the people, who are they going to be taken care of so what we've been doing for the for, because we it's not technically part of the senior center, but we have a program called safe at home.\nThat works with you know, seniors in the community, and one of the services that it offers is.\nYou know all kinds of precautions if they're going to go in, but I think also a lot of stuff.\nYou know sending the wrong message, but I think that we need to be local for our local people just to urgent to be a little more careful and that we.\nKnow, provide some sort of support and I do not mean like we're going to be taking care of everybody's finances or anything, but just you know some sort of community effort to kind of now that we're.\nYou know something like a community event, perhaps I'm just going to throw that idea.\nYou know that sounds like a good idea, and you know perhaps the health and Environment Committee would want to do.\nYou know, get to them and as far as communicating with their membership, but no not all the senior centers are open.\nThey sent out a communication to us asking us to answer a survey as to what our reopening plan might look like and asking us to provide a tentative date for, at which point we might feel willing to reopen, and they would they wanted that date from us, because they were not requiring all the senior centers to say that they were willing to reopen, and if only some were, they wanted to know whether they could pick up some of the slack for those that were not ready.\nYou know not just necessarily members of senior centers, where it's kind of like friendly visiting by phone.\nA lot of people will read the book and come and enjoy they like they need that social interaction.\nIt's you know interesting how much the senior centers are actually doing in terms of reaching out to the clients and providing well.\nOh for a Community board organization for organizations, community-based organizations in the community and board offices asked for suggestions for about those community-based organizations and who people think that the money should be going to so.\nYou know people from the senior centers and Julie.\nThere's been a problem, for you know some people in our community to be part of a senior center.\nBut I think that the once we open up these senior centers they may be because of experience that people have had during this.\nThey would like to join the senior center and they come out and participate, and things like that, but that's going to be.\nWe did well when our ranking, for you know, seniors, are housing and things like that.\nYou know real well, as a committee within the community.\nEverybody is really you know, working very hard to provide services to and not to leave the seniors.\nYou know, people who ran senior centers almost present to each other.\nI mean there's nothing that says that if you're a senior in the community, whether you're a member or not, or even you know, if you're living in staten, island or Brooklyn, you could go on to have programs.\nIf there were, you know to list all of the different websites or places where seniors in the community could go.\nIs there a comprehensive calendar for CB12, because again now that things are on zoom, you've really opened up so many opportunities for people who I always go to this center and they do not think beyond.\nWell I mean I'm a member of Waikoloa Senior Center, also because I represent community board 12, because I'm on the it, because I'm the chair of the aging committee, so you know."
        }
    }
}