{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "title": "August 24th",
            "publishDate": "2020-08-24",
            "shortDescription": "",
            "lengthSeconds": "2:10:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "m70HxjpLWXQ",
            "fillerWordCount": {
                "uh": 336,
                "um": 472
            },
            "readTimeFullTranscript": "71 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "street": 74,
                "bus": 72,
                "bike": 54,
                "traffic": 51,
                "lane": 47,
                "cab": 39,
                "streets": 38,
                "thanks": 37,
                "space": 34,
                "restaurants": 34
            },
            "wordCountSummary": {
                "street": 20,
                "bus": 18,
                "bike": 13,
                "avenue": 12,
                "lane": 11,
                "corridor": 9,
                "traffic": 9,
                "space": 8,
                "cab": 7,
                "proposal": 7
            },
            "fullTranscript": "Luke pj needs the link: okay, I'll resend, it thank you, and so we will go ahead and get started thanks. Everyone for joining us tonight, if you're not otherwise, aware you're at the August meeting of the transportation and environment committee for Manhattan Community board five, where we hear issues related to the transportation environment in the space that affect our district. This is our first meeting after coming back from our from our summer. Hiatus we've got our mc for the evening, and zoom wrangler will be our colleague Luke Zaza Zabados from the community right five office. He will assist with any technical issues as well as at points later in the meeting, help to organize and report on questions that come in through the Q&A feature, for when we open it up for any for any questions. Luke do you have other technical issues to address before we get started? No we'll kind of outline how the public session will occur. We will be using question and answer feature at the bottom of the screen to help with that, because we expect a lot of people to attend tonight, but we'll go over that at a later point, thanks luke. So like I said this is our August meeting of the transportation environment Committee. We have three items in our agenda tonight: they're all updates from the department of Transportation who has who's joining us here tonight, we'll be hearing updates on a couple different topics, including the status of the open streets and restaurants program, which of course, is ongoing, we'll be hearing updates and some follow- up information that we asked DOT to come back to us with regarding data and observations about the 14th street Busway, which of course has been underway for many months at this point and we'll hear an update on the ongoing fifth Avenue improvements, design process. So without further ado, we'll we'll get started with the the first of those items on the agenda, which is an update on Fifth Avenue and the design process, which I will I'll introduce briefly to provide some context for the members of the committee and and then I'll send it over to Ed Pinkar and the team from DOT to to present what they brought tonight. Just to provide a little bit of background. There are several elements of improving fifth avenue that we've heard about over the years, including a long- standing desire to continue to add to the city's interconnected bike lane network, to improve cyclist and pedestrian safety and to provide a little history. Community board is that commuter five is actually already on the record supporting the addition of a protected bike lane on Fifth Avenue. It's a position that I believe we adopted in by resolution in 2017., another component, obviously relative to Fifth Avenue. What you might have heard about is the is the busway which the mayor announced earlier this summer to be installed at some point soon that has been the subject of ongoing community advisory board meetings or cab meetings being run by DOT in communication with the community to discuss and design whatever the rules and structure of a bus way would be in dialogue with the community. There have been two of those meetings so far at this point and there are still more to be had so. For that reason, for all those reasons, what I believe that we're going to see tonight from DOT- and I do not want to speak for them- but I believe what we're going to see is essentially a an in- progress draft design by DOT, as it attempts to address these multiple changes to Fifth Avenue, but in a in an eventually comprehensive way, but for for reasons related to the fact that the busway design and conversations are still underway, which will be what we're going to see, I believe, is very much a work in progress. So, for that reason, and to kind of set expectations for the for the committee, because the design we're seeing is not final, because the bus way is actually still under discussion and the rules and goals of it are not finalized yet and because Community Board five is frankly already on the record relative to the concept of a protected bike. Lane and, of course, does not need to take a redundant position on that. I do not anticipate there being a vote or the taking of a position by the committee on this proposal this month, because it's still in development DOT will certainly come back to us after the final cab meeting relative to the busway after continuing to design and discuss the rest of the Fifth Avenue development and continuing to iterate on the kind of complete street design. So we expect DOT to return to us in the coming months, and- and I do not expect us to take a final position on this tonight, so I just wanted to set expectations for any action by the committee tonight, but we're looking forward to seeing the status update. You know asking questions from members of the committee and members of the district and I'm sure that DOT is interested to hear our feedback as the design process continues and is ongoing. So with that, I will turn things over to DOT for the for the first presentation of the evening. All right, thank you. Mr Chairman, hi Sam, it's nice to see you hi vicky members of the committee and the board. My name is Ed Pinkar and I'm Dot's Manhattan borough, commissioner, I'm just returning from paternity leave. I thought that Wally Rubin was a handful, but being the new father of twins, I assure you they are a lot more difficult to deal with, but we certainly miss wally already and we wish him well on retirement. I'm joined by some wonderful colleagues tonight assistant commissioner Janet jenkins from our transit development unit, Chelsea gill games from her team shawn Macias from our bike group. Of course, Deputy borough, Commissioner, Jennifer, Santinez, Kimberly, Rancourt, Colleen, Chattergoon and Jackie Lazaro from my office, as well as our great colleague Leah Flax, from New York City transit. We are really excited to present the committee with an update on the agency's thinking and plans for fifth Avenue, as Ej mentioned earlier. In the summer, the mayor announced a series of busways throughout the city to really try to improve our mass transit system at a time during this crisis, where more and more new yorkers, especially those new yorkers serving on the front lines, need greater access to transit and more reliable transit service. We were happy that Fifth Avenue was included in that plan and we convened two Community Advisory board meetings, thus far over the summer to start discussing what those improvements could look like. One of the things that we quickly heard from some of you from our elected officials and from other community stakeholders, is that Fifth Avenue serves a variety of interests and needs not only new yorkers who work there, who live nearby, who commute through it, but also millions upon millions of tourists who come to this most iconic avenue each and every year, and hopefully, they'll be back in mass pretty soon. We know that we need to improve how buses operate along fifth Avenue, but we also heard loud and clear that we need to improve how fifth avenue functions for cyclists and for pedestrians, particularly at the holiday seasons, as Ej mentioned. This is something that community board 5 has long called for a more complete street type treatment, four fifth avenue and has also been one of the requests from our elected officials. So at our second Community Advisory Board group meeting, we presented not only our initial ideas for how a bus way could operate, but also the bones of a complete street for Fifth Avenue, including both needed pedestrian space, as well as a protected bicycle lane, and we're excited tonight to run through that presentation to give you a sense of what we're thinking for the corridor as we look towards implementing a project later this fall. I think the key takeaways here are that we are trying again to balance all of the different needs for the corridor. We want to improve bus ridership, but also just transform how it operates for the millions of new Yorkers and tourists who use it. We are absolutely committed to hearing more feedback, which is why we're so happy to get on the agenda tonight. As the chair mentioned, we will reconvene the Community Advisory board in the coming weeks, as we continue our analysis of a lot of the wonderful feedback and great questions. Some of them pointed that we have heard thus far about how busway restrictions could work on fifth avenue. So we do not have any final decisions to share, but yes, stay tuned. Our hope is to reconvene that cab in the next two or three weeks and then return to your committee, ideally on September 21st, to give you an update. So as always, DOT is here, we never go away, we're with you every month and we look forward to the conversations getting some of your feedback tonight. Obviously I personally, I hope that we get some good feedback on the complete street design in 2017, along with a former member of Janet's team, we presented the double busway proposal and I remember getting some pretty strong criticism from this committee and from a lot of members that it failed to include any pedestrian or cyclist improvements. We promised at the time that would certainly be on our radar and I'm happy personally that we're going to be able to show you some really cool ideas tonight. So with that, I'm going to ask assistant, Commissioner Janet jenkins, to run us through the presentation and then, of course, we'll be happy to answer any questions you may have. Thank you thanks. Ed Chelsea, Gil James, who is our project manager for this project, is going to give the presentation interspersed with some of our colleagues from MTA and our bikes group, but I will be running the slideshow. So let me share my screen. Everyone see that okay, great so Chelsea to you Chelsea. I think you've been on mute. We have not heard what you've been saying. Thank you sorry about that yeah. I was just thanking ed for the introduction again, I'm glad that we can be here this afternoon to talk a bit more about this project on Fifth avenue great. So today's presentation will briefly review some background on the project. It will go over the complete street proposal for Fifth Avenue and conclude with next steps and a discussion. The better buses Restart plan was announced among highlighting the critical role that buses have played during the Covid-19 pandemic and as the city adapts and reopens, ridership numbers are still indicating that bus ridership has increased while subway ridership remains low and this furthers a need to provide reliable transit service that prioritizes the bus, especially as we can anticipate people have a greater desire for alternatives to the subway, which will include a shift to buses, bikes, walking war and private vehicles. Fifth Avenue is one of several better bus buses projects. That's in development throughout the city. The project area will extend from 57th street to 34th street, which is a major commercial corridor and tourist destination. It's a critical connection point for numerous routes and for commuters all acrosss from all acrosss the city. There are high pedestrian and cyclist volumes, and with this multi- modal use, there are accompanying safety needs and improvements that can be made. Additionally, this is an area where the community has many long- standing requests for transit improvement. There are 41 bus routes that currently run on fifth avenue. Coming from all five boroughs with so many routes, there can be 60 to 160 buses per hour throughout the day on fifth avenue, increasing the important importance that delays here have an impact on bus speed and reliability citywide and with a focus on transit service, reliability and better buses restart program, highlighting the critical roles that buses have played during the Kobe 19 pandemic. I think it's important that we think about all of the city residents, as you can see in the highlighted light blue blinds here on the map. There are numerous bus routes that connect at Fifth Avenue and extend acrosss the city serving people in various demographic groups. Some of these factors, like aging population or the number of people with disabilities, are just a few of the factors accounted for in the CDC social vulnerability index, and the Social Vulnerability index is referring to the resilience of communities when confronted by external stressors on human health or natural and human- caused disasters. Again, we just include this to emphasize the role improvements on Fifth Avenue has for the entire city and communities with limited options to talk more about the daily bus riders who use fifth Avenue, I'm going to hand it over to a colleague at the MTA laura who will share a few slides with you all hi Ola. Can you hear me there? Okay, great hi, I'm Laura azizing from New York, City Transit just want to elaborate a bit on the bus service on 5th avenue. As Chelsea pointed out, we have 41 of our bus routes coming from around the city and serving more than 100,000 customers a day. The breakdown in ridership is roughly half between riders on local Manhattan routes, such as the M1, M2 and M5, and the other half on express bus is traveling to and from other boroughs. Next Janna, please thanks in 2018, the single bus lane that existed was expands into a double bus lane. As you know, this led to an increase of up to 12 percent on local bus feeds and an increase of up to 20 for express buses, which is huge and really great. For our customers next, please thanks janet this past spring. During the height of the pandemic, the decreased traffic levels led to an increase in bus speeds on the Fifth Avenue Corridor speeds increasing 32 in the morning peak and up to 48 in the pm peak, which is really impressive and obviously helpful for our bus customers to get you know to complete their journeys more quickly and reliably. I'm happy to answer any more questions about bus service if they come up, but with that I think I can hand it back to Chelsea flora thanks and right now continuing. We want to again acknowledge that there have been requests. Double bus lane was implemented a little bit. Can you say that again? Maybe you should turn off your video if we have to yeah sure? Is this a little bit more clear? Yeah? Okay? Yes, yes, I was just saying that we wanted to acknowledge that there have been requests from the community as well. Ed and others have already acknowledged that this that there are, we have received support from the community previously, when the double bus lane was implemented in 2018 and that there have been longstanding requests for more of a complete street approach, including a protected bike lane in this Midtown portion of fifth avenue and all the time we're making sure accommodating the highest pedestrian volumes in this area, especially during the holiday season, and just to elaborate on the complete street approach. This approach provides safe and accessible options for all travel modes and people of all ages and abilities. There are multiple opportunities that present themselves on fifth avenue, as we consider how critical it is to improve bus speeds and reliability, create more pedestrian space, safer conditions, adding a protected bike lane and accommodating the vehicle, pickups and drop- offs that take place in such a busy corridor and also finding ways to incorporate beautification efforts with these opportunities. Ultimately, a complete streets approach also provides these safe and accessible options, while supporting the city's vision. Zero initiative, as the numerous opportunities for fifth Avenue, are considered on in a complete street approach. Looking at the data that we have on hand, we can start with pedestrian volumes where we see they're very high volumes on a typical weekday during peak am hours they can. There can be up to 3,000 pedestrians per hour in this section of Fifth Avenue, and these are significant numbers for even the amp, but even in the pmp we see these numbers go up to ten thousand pedestrians per hour and during major holidays. Pedestrian counts go up to over 30,000 pedestrians per hour. These numbers can't be ignored, especially in our current crisis and as the city adjusts to a new normal for the foreseeable future. Additional pedestrian space is useful now in the short term, for allowing people to safely socially distance, but also in the long term, in anticipation of the pedestrian surges that we see during the holiday season. Another important travel pattern: that's evident are the high bicycle volumes on Fifth Avenue. The number of cyclists on fifth Avenue can exceed 2500 cyclists on a nice weather day. However, there is currently not a bike lane on the corridor, despite it having the highest bike ridership on a Manhattan corridor. The current cobit 19 crisis also frames how many people are seeking transportation alternatives compared to the first half of last year to compare to the first half of last year to the first half of this year. During the pandemic bike crossings over the East River are up six percent again. A complete street approach will provide space to have a dedicated safe area for bikes during the city's recovery and when looking at the vehicle travel speeds, it's useful to think about what traffic typically would look like on fifth avenue and also looking at where we are in the middle of this token. 19 crisis as the city cautiously adapts and reopens the yellow oranges. Trendline represents the vehicular speeds using fall. 2019 travel speeds on fifth avenue from 72nd street to 34Th Street, the blue bars represent the blue bars represent travel speeds from early June of this year. The Orange Bars show speeds from July of this year, and the green bars show the speeds from just last week, and the comparison of these dates show that yes, overall, speeds increased significantly during the pandemic as traffic volumes dropped. But now we see, as recently as this is the most recent phase of the reopen the city's reopening and as more things return speeds are beginning to decline again, and if this trend continues, we are returning to what typical speeds were in October or in the fall of last year, which were as low as five miles per hour. And sorry, if you go back Janet and during critical morning, midday and evening heats, these numbers are continuing to decline and it just calls for adjusting how history is currently being used and preventing the less than ideal situation that we had before, but now for a variety of essential road uses. And, finally, while we consider all of these options, we have safety information for this project area. That shows recent data indicating high crash rates for all road users on this portion of fifth Avenue, and this emphasizes the need for safety improvements. So now we'd like to present to the board a complete street proposal for Fifth Avenue just to catch everyone up on where we are since the mayor's announcement, starting with Outreach and engagement, a community advisory board or a cab which is made up of the of elected officials, Cb members, representatives of local institutions, property owners, transit advocates and bus riders on 5Th Avenue. This cap has been meeting regularly as this project is developed, implemented and monitoring and monitored, and there have been two cab meetings to date and the plan for the next meeting to take place is early September. We also presented an initial proposal to the cab in July, which is what we are showing you today and also. There was a walk through on fifth avenue, with commercial chocolate in late July, so she is personally familiar with the corridor as well. The initial proposal limited Southbound through movement to buses, bikes and emergency vehicles, requiring all others to turn off before 57th street, but still allowed local access for pickup and drop offs just that cars would have to make the next available turn off. Fifth Avenue added Pedestrian space, a protected bike lane and a pickup and drop offs and pickup and drop off spaces were also features. The feedback that we received from the cab included concerns about business needs, especially during the city recovery, the ability to do direct, pickups and drop- offs or southbound through travel, and also the amount of signage that would be required. We are continuing to without evaluate this feedback and suggestions that we're receiving and we'll be meeting with the cab again next month, and even though we are still evaluating all of the possible traffic restrictions in this project area, we know we want to move forward with the safety elements, including the protected bike, Lane sanded, Pedestrian space and the pickup and drop off zones. We will be returning to the Cb in September, as well, with any updates on proposed Turner structure restrictions and a monitoring plan to make the avenue work as well as possible for buses, bikes and pedestrians. The following cross- sections show how a complete street approach for all road users prioritizes safety elements. This typical mid block cross section shows maintaining the double bus lanes here along the West Curb, a center travel lane for all vehicles, pick up and drop off space for taxis and for higher vehicles and a buffer between that pickup and drop- off space and a bike lane protected by in the bike lane, which makes it a particular bike lane. Also the East sidewalk will be expanded, and at this typical intersection cross section, the design is very, is pretty much the same. However, taxi pickup and drop- off zones would transition to a left turn lane where those left turns are permitted. The right turns can be made from the bus lane we're permitted as they are now. One of the proposed treatments that we just saw in the cross section is a sidewalk extension. These painted curb extensions would create more space for pedestrians, where volumes are high again looking back at the pedestrian volumes, we know that this space can allow this extra space can allow for better social, distancing, bollards or planters, and other elements can be used to provide separation and there are additional pedestrian safety benefits. At this point. In the presentation, I am going to hand it over to representative from Dmt's bike group to talk more about the protected bike lane as a treatment. Thank you. This is sean macias from Dot's bicycle unit. Our proposal tonight includes a parking protected bike lane along the corridor by providing dedicated space, we're able to boost safety and better organize the roadway to promote better interactions amongst all street users. This design also allows us to accommodate the increase in cycling associated with the expansion of CitiBike, as well as the boost in cycling. We've seen as new yorkers start using their bikes during cobit 19.. So it's a six foot bike lane and then adjacent to the bike. Lane is a three- foot buffer and then eight- foot parking lane. This design accommodates people getting it out of their cars to be able to open the door pause and cross the bike lane safely or if you're loading out of the back of your car. You know you're able to set things in the roadway pause and then and then find a gap acrosss the bike lane and make your way to the sidewalk or the pedestrian space. Please we did want to talk about interim designs tonight in the early phases of project rollout, temporary materials could be used to provide some physical separation between vehicles and cars. We want to get the benefits to the street users. You know quickly, so we may put out some barrels kind of like the photo here. You see on your slide to reclaim some of that space. You know right away. We are because of the local law 45 mandated to wait. Excuse me the local law, what we're mandated to wait 45 days before we can start with permanent materials. So in that interim we may put some barrels out there to try to reclaim some of this space and then also on the back end, because we have to wait the 45 days. You know we like it won't get started until October, so we'll do our best to get as much as we can in, if not all of it in by the end of the season, but any pieces that we do not finish. We will install temporary lanes to maintain that space over the winter until we can come back in the spring. Thanks sean, you got it great. The next proposed treatment is creating space for pickups and drop off drop- offs and what they're calling pickups and drop- off zones. We think these will be on almost every block and the point is to provide space for taxis and other free for higher vehicles to be able to pull over outside of the travel lane and maintain traffic flow. And, last but not least, we are still looking at strategies to improve bus speeds and reliability. We want to make the existing double bus lanes on fifth avenue work as well as possible way. Some of the strategies that we're considering cyclists that are currently using the bus lanes will be relocated to the new projected bike. Lane bus lane cameras can be used for enforcement and, of course, we'll continue to monitor the use of the new pickup and drop- off zones can also continue monitoring, seasonal traffic and if there needs to be any seasonal traffic restrictions on 5th avenue again, all traffic restrictions are continued to be evaluated and sharing the ways we plan on monitoring. This project got will continue to track bus speeds, traffic flow and travel time. We benefit from a monitoring system called Midtown emotion, which captures traffic congestion and travel times we'll continue to coordinate with colleagues at the MTA, reviewing bus speeds and reliability data and our plan is to provide more detail on monitoring thresholds when we meet again in September, as we begin to wrap up the presentation, I want to quickly summarize our next steps. Dot will discuss the details of the updated sign with the cab in early September and return to the Cb in late September. In the meantime, project information can be accessed at this website on New York City.Com, forward, slash bus projects and there's also a project feedback portal which can be accessed at this link. I'm not going to read it off, but when this presentation is posted on the previous website, you will have that link yeah and the project timeline currently consists of consists of ongoing outreach and stakeholder engagement, including meetings with you all and the cab throughout this year. In the next year, as mentioned, we continue to evaluate the various aspects we've presented and use this event, this ongoing evaluation and meetings with you all to move forward. Thank you again, everyone for your time. This concludes this presentation, thanks very much Chelsea and to the whole D.O.T team who participated. If you just flip back to the timeline slide that we just saw a second ago. I just wanted to follow up and check. So, as I understand it they'll you know they'll, of course, be at least one more cab meeting, while the design is still being developed and finalized, and the rules and goals of any eventual bus way. Two questions number one: how many more cab meetings do you anticipate before the finalization and installation of any new design? And then I can see that even after begin installing starts there's an intention to do ongoing cab meetings. Can you talk a little bit about what those what those follow- up meetings would consist of and and what sort of what sort of ongoing dialogue will be taking place with the community like after installation even begins? I can definitely take that we over the summer heard again excellent feedback from not only cab members, but our elected officials and property owners and other stakeholders, as some ask great questions, others put forward some suggestions related to the restrictions that we're currently analyzing. Our expectation is that we will be able to give a final update to the cab with what we're proposing at the next meeting in early September and then return to the this committee on September 21st. Obviously, you know, if that slips at all my office will keep CB5 and other cab members updated along the way and then, when we get to implementation, certainly depending on what goes in the ground, when we're always going to have some initial back and forth as we, you know, try to fight through that awkward construction period, and then we can discuss with the cab at the next meeting. What the most helpful schedule will be moving forward on providing updates, but my office attends the transportation committee meeting every month and we're happy to you know provide updates along the way if we need to do something more formal in terms of additional presentations. We're happy to do that too. Great thanks very much. So. Thank you. Thank you for the presentation with that. I we'll start by throwing it open to members of the committee to any ask any questions that may have come up during the presentation after that, we'll turn to members of the public who have been asking questions through the Q&A feature in zoom and we'll use that feature to compile those questions and kind of efficiently. Ask them to the DOT, but for the time being, Luke. What's the best way to do this with members of the committee by raising hand? Yes, please you'll find the raise hand button in your participants panel you're to have to click participants if you're having any challenge finding the raise hand, Button Board, member or committee members, feel free to just unmute yourself. So members of the committee, if you got any questions, feel free to raise hand Joel go ahead, just leading off what you were talking about before he jam timing. Will there be? What sort of time will there be for members of CB5 members of the cab and members of the public to give input between when the temporary improvements get installed and watching how they work up till the time that permanent improvements, which I think you said Ed- will be in October or around October? So there's not a lot of time. Will there be opportunity for input after we see how it works, so our preference, of course, would not be to install any interim materials. Obviously, this the city's operations dot's operations are really geared towards Covid-19 recovery. At the moment, it's a little bit of a different implementation season for us this fall at then in regular years. We would we would if we move forward with this design or a similar design. We of course want to go into paint and signage on the ground as quickly as possible. We just pointed out that, due to all of the challenges we're currently facing that, we may have to consider some interim materials fingers crossed. That would not be the case, but certainly you know every any feedback that you guys get as a committee or even as individual members. Please always send our way so that we can work with our colleagues to address them as best as we can thanks just planning ahead to the to the public member session would encourage members who I'm sorry, members of the public, who have a question to please review what has been asked in the Q&A and instead of asking a second time, a question. That's already been asked to use the thumbs up tool to plus up any question that you would like answered as well to upvote it as the kids say, continuing with members of the committee George. Yes, can you hear me all right? Yes, this is our most famous Avenue songs. The broadway shows have been written about it. It strikes me as a symbol of banality when you look at the pictures that can we do better. Have you looked at other cities around the world to see how they treat their busiest pedestrian street? A goodly number of them make the street completely car free and emphasize the pedestrian aspect of the of the street. Has that been off the table from the beginning and is absolutely not to be considered George thanks for your question. As always, first of all, we started off not only this presentation, but the original idea for the project, understanding that Fifth Avenue is an iconic corridor that serves many different uses, not only all of the pedestrians who walk through the area, both on the avenue and the cross streets. A hundred and ten thousand daily bus riders- and you know it also- is a central retail corridor, an office corridor for Midtown Manhattan. We've heard some really good questions from the local stakeholders who feel that restricting private vehicular traffic at this time could really jeopardize the recovery from Covid-19. We've heard good questions about what impacts on the overall grid. So you know all options are certainly on the table. As I mentioned, we are analyzing what those restrictions could be and what they will be, and we expect and look forward to presenting the proposal back to you guys next month. So to answer your question, I think we do not think we can just shut down fifth Avenue for pedestrians. It always needs to serve buses and emergency vehicles and local access as well, but we are seeing whether we're able to restrict more general traffic a little bit more stringently. Thank you. Needless to say, I do not agree complete at all. You rarely agree with me: George City wrong country. What the heck all right! Thanks for the question, George Noah, I believe we have the next question. Yes hi. So when the 14th Street Busway was implemented, one of the big concerns was that taxis and ubers and lyfts and other tlc cabs. They were pretty much like almost scared to go on to onto a 14th street because they were afraid of being fined or ticketed, and I guess you know, with the Covid-19 situation. Many people might be scared to take public transportation so kind of what steps would you take to kind of make clear that taxis? Can you know pick up and on this new on this new corridor, to kind of make it more clear you know so that they won't be scared to come and you know serve these. You know this stretch of Fifth Avenue sure. That's another great question and we learned a lot from our experience with 14th street in that respect, and certainly when we launched the 14th street Busway, it was not seamless in dealing with the taxi industry and some of the others, the trucking industry and other buses non- mta buses. We developed great relationships with waze and Google maps to try to help spread the word out on people's phones and on their navigation systems to better tell them what turns they could make, what they could not. We worked very closely with tlc to get information to drivers to explain what the restrictions were and what it meant for them that yes, 14th street was no longer a through street for taxis, but certainly along with Uber's. Unless another for higher vehicles they could make drop off and pickups Fifth Avenue is a little bit of a different. You know set up than 14th street. I would like to wait until we finalize what vehicle restrictions under our you know. We are pursuing before commenting on what steps we have to take to deal with tlc and others. But again we have really good experience now based off of 14th street, and I think we would be better prepared from day one and even before day, one to address that concern. Okay, thank you. I appreciate it. I'll also add if I could that some of those organizations are participating in the cab as well, so that's allowing us to get feedback from tlc and other organizations that are using the corridor in a variety of ways in a much more real- time basis. Hugo he's new in regards to the overall grid. I can't remember it was 50 something to 34th street. So would the traffic have to be directed, let's say at in regardless of buses to 7Th, Avenue and Park Avenue, and have you done any concrete or explicit studies in regards to how traffic times would be affected or how pedestrian density in those areas would be affected? Sure I'll let Janet and Chelsea speak to some of the traffic analysis for the overall network. Certainly, if we move forward with any restrictions at 57th street, we would have many signs to the north encouraging motorists to find an alternative mode in it. Well, in advance of 57th and 5th, we would get the word out to the mapping software. You know companies so that they would take drivers on a different route from earlier on and there are a lot of different ways depending on where people are coming from and where they're going that traffic would be able to find its way and still ensure local access janet Chelsea. Do you want to add to that? I'll just add. I think you hit most of it Ed, but, as Chelsea touched on the Midtown in motion system, we have the ability to kind of monitor traffic in real time, as well as working with MTA and all of the bus time data. So the whole part of the better buses restart program was to allow us to implement projects before all of the traffic came back so that we would be doing this monitoring instead of a lot of intense upfront studies like the kinds that we may have done on 14th street. So that's where this monitoring comes in and where, if we're, if we end up a bus way and those traffic restrictions, are a pilot where we could actually study how those things are working as it goes along and make adjustments as we needed to okay. Thank you, Bj. I think Hugo asks asked the question that I was going to ask so I'm covered. Thank you. It was about the traffic overflow because you know the cross streets. 57Th street is super busy, 42Nd, Street and 47th street with the diamond district and the 34th street crosstown, so that it's- and I remember last year during the holiday because of the number of no left turns, I mean the ubers and Lyfts had a horrendous time trying to pick up their customers or the delay because of the overflow traffic. So I am concerned about that as well, but Hugo already asked a question, so thank you. Okay, thanks for what it's worth. The second item on the agenda tonight is to get an update and learn a little bit more about some of the effects like that from 14th street. It was a little bit of a sophie's choice as to whether or not to do get those numbers before we dug into fifth avenue here, but it will, I think, be useful to see what we learned from 14th street and bring that I think to the next cab meeting final call for any questions from the committee. Okay, with that, we'll take a look at the questions that have been submitted by the public via the Q&A feature, there's of course, 108 people in attendance tonight and and we're all adapting our town, Hall format to zoom for the first time. So ask you to bear with us, but we're going to try to take advantage of the Q&A feature here and prioritize the questions that have been upvoted by the most members of the public to try and efficiently answer the the questions coming from the most individuals first and and we'll very much see how far we can get in what kind of efficient way. So if Luke does not object I'll just start heading down the the list of Q&A questions. Great first question: why does the bike lane not connect to central Park in the north and the protected bike lane on 25th street in the south? I could take that one. So we are aiming to create a connection north to the park as part of this plan extending the bike lane north to 59th, and I think because we wanted to keep this project digestible. It ended at 34th, but the bike team will undertake a plan in spring over the winter and have something to present to the public, hopefully for spring 2021, to close the gap on the south side, Downtown Madison, Square, Park and the other point here we are dealing with. You know some reduced capacity based off of Covid-19 the timing and the season is very late. We were in a we're doing some good work throughout Manhattan and the other boroughs now, but we certainly did not have our full implementation season over the spring and summer, which really limited our capacity. Unfortunately, but we hear from many stakeholders, including our elected officials, about that connection- and it's something we're working on thanks next question: DOT is expected to come back next month with a final design, was not the busway supposed to be installed this summer and should not something be implemented before traffic comes back? Do you just want to address timing on that and why it's happening when it is sure I mean we are all feeling the urgency to try to improve buses and provide alternative modes as quickly as possible. We also recognize that there are. You know, stakeholders throughout this corridor and beyond, who had legitimate questions and concerns, and it's certainly been beneficial to us and to our teams at DOT to be able to hear those questions, and you know try to work through them to make sure that we are implementing the best possible proposal for Fifth Avenue, and you know, I think the inclusion of a complete street plan is a worthy inclusion and it's certainly taken some time to do some of that engineering, but it's going to lead to a better overall project thanks. The next question- the temporary barrels on second avenue have not been effective. They keep being moved until activists put them back. What have you learned from that and how we'll make sure that does not happen here as well with? I assume the implication is any temporary treatment. That goes in sure, and again we certainly hope and pray not to have to use any interim materials here on fifth avenue or elsewhere for the other projects that we're considering in Manhattan. If we were to move forward, I think you would see a different type of treatment where the vertical delineation would be achieved through the flexible delineators, as opposed to a series of barrels, precisely because of the challenges that the question describes. So, yes, we've learned a lot since we put out the initial barrels over the summer and I think we would do a different treatment here if necessary. Okay, the next question protected by lanes and bus lanes, would increase the number of people going through the area who might stop into busi. Oh I'm sorry. This appears to have been some kind of discussion that was happening. They are not, as far as I can tell questions for the presenters. The bus speeds that were mentioned in the spring 2020 are impressive. Should not the city be doing more to prevent private car traffic into the Central business district? Are we going to be sure that congestion pricing gets implemented on schedule? I can't speak to the schedule for congestion pricing. Obviously I know the MTA and Tbta are working diligently on that and whatever happens with the federal government is going to happen. I do think that you know we we're absolutely looking at ways to improve bus service throughout the city. We have a series of proposals not only on 5Th Avenue, 181St Street, also in Manhattan, and we're working through that process. Next question is also about orange barrels. Orange barrels are not protection or easily moved or rammed by drivers. What is preventing D.O.T from dropping? I guess more solid barriers to provide real protection at dangerous intersections instead of orange barrels. So one of the big constraints that we have whenever we pursue street design treatments is, we need to make sure the streets themselves can be maintained, that they are not only so dot's crews can perform necessary work, utilities can work underground. The sanitation department can both sweep the streets of garbage as well as clear them of snow. So we are definitely as an agency exploring a variety of different treatments, but in general it's tough to just throw out, say you know larger barriers within the roadway if we do not have the space. So even here the Ped and the bike space would be large enough, a for sanitation vehicle as an example to continue to access the area. But we do think that the delineation and the inclusion of green paint will certainly make the area very visible as pedestrian and cyclists space. But yes, we understand that there's a desire for even greater protection for these types of treatments and it's something that, as an agency we're working on. I think the next question is also very similar to that one. Why use only a painted pedestrian space instead of planters or extending the sidewalk into the street relative to materials? So again, planters is something that we might be able to consider either, if not immediately over time in terms of building out the sidewalk. That's always the longer term preference, and it just requires a capital project in order to relocate utilities, catch basins, signal infrastructure, it's just much more involved and would not be able to happen at any speed. We also know that the Covid-19 has greatly impacted the city's budget, whereas you know we're able, through paint and signage and delineators, to move forward pretty quickly with tactical urbanism. That shows us how the changes will work before we pursue the longer term, more permanent capital improvements. Great thanks then, and I just want to say to members of the public thanks very much for for rolling with us as we you know, try this new system, as opposed to all being in a room together and going around the room, appreciate your cooperation as much as possible and we'll continue to prioritize the questions that seem to have the most up votes. That having been said, please try very hard not to repeat any questions that have already been asked. I'm going to try very hard to to make a judgment call to make sure we keep moving as efficiently as possible instead of repeating ourselves- and you know it goes without saying, Ed and DOT. Thank you for for answering all the questions from both the committee and the members of the public. It's much appreciated next question. If fifth Avenue is the most productive urban retail district in the Americas and many customers arrive and leave using private transportation to carry purchased items eliminating through traffic will have a negative impact on overall traffic to this critical piece of the economy. What consideration has gone into protecting the business district and keeping the heaviest pedestrian traffic retail district in the country safe? I believe it's a question relative to protecting businesses and the economic impact on the on the neighborhood, while at the same time protecting safety. Yes, I mean obviously for pedestrians. We feel that by providing additional painted space initially, that can only be a benefit for the millions of pedestrians who walk through the area. We will help just change the real the face of it as well as its function. One of the real concerns that we've heard from stakeholders thus far about a busway with private vehicle restrictions is its impact on retail, in particular during Covid-19 recovery, and that is something that is, you know, being looked at very carefully and we expect to be able to. You know, provide some responses to the cab and then, ultimately, the community board next month. Great thanks, ed. The next question is related to the cab. Does the cab only engage with community boards in the build area like CB5 or is it? Is it engaging with every community board that would have bus experiences improved by the change? So is every community board that has a bus that runs on 5th Avenue included in the cab? No, not every community board is included. We certainly are aware that many of the bus riders along fifth Avenue are coming from outside of Manhattan. Even and you know, I think, between our elected officials and some of the advocates who serve on the cab. Those bus riders are very well represented, but we're happy to take any question comment feedback complaint from different community boards or residents throughout the city thanks Ed Luke. I believe you had something to say about the process here, yeah. If, as you see, we have 28 open questions, if anybody, I think panelists should be able to answer these live. If anybody from DOT or MTA can identify questions that can be answered, feel free to type in answers, everybody will be able to see them thanks, Luke, that's very helpful and a great way to get more questions answered while being respectful everyone's time. The next question is asking for a numeric breakdown. How many cars passing through fifth Avenue are through traffic versus how much is destination traffic? That's a pretty good question. I'm curious about that janet Chelsea. Can you talk a little bit about some of the traffic volumes? Yeah I mean I will say this is going specifically how many vehicles are going through versus stopping we are. We are looking to see if we can figure out information about that. That's a really hard thing to understand. We do have a sense of where the most taxi, pickup and drop- offs happen, for example, which is really good information and we are analyzing. Some of the data from one of our data partners called street light about how vehicles move along the corridor and that's helping us inform some of the traffic restriction, ideas that we're evaluating so we're still working on that Ej. It said I'm going to have to just jump off. I'm not sure if you hear some of the symphony coming from the other room, but obviously Janet and Jennifer and Kimberly and others are going to remain online. To answer any of your questions, I just wanted to thank everybody for their time tonight and certainly commit to being in touch soon as we move forward with this very exciting proposal. Thank you, ed. Thanks for being here, you can go back to your three-, month- old constituencies, thanks guys good night, I'm going to paraphrase this next question, because it's a little bit long, the bike lane runs through one of the world's retail destinations. Surely you should widen sidewalks before allowing bike lanes down the avenue to cause more accidents between bikes, as shown in recent Side Street bike lanes and increased accidents there. This seems to not take into account the need to encourage the return of the avenue and its businesses to the retail flagship section of New York. Could you talk a little addressing this? Could you talk a little bit about whether or not sidewalks are widened as part of this plan and why the bike lane is going into fifth avenue and not the side avenues. Sean can elaborate on this if he has more to add, but essentially we are widening proposing to widen the sidewalk on the east side, where feasible adjacent to the bike lanes, so it is taking into account the needs of pedestrians, as well as cyclists, and as sean mentioned, or as Chelsea mentioned, we have thousands of cyclists using this corridor and we've had requests from elected officials and the community board to add space for cyclists. So that is a priority on this corridor. Okay, thanks, not sure if there. If there was more to the question you can ask again, the next question is as a cyclist, I'm concerned about the interim bike. Lane materials used and again this is about is about barrels being dangerous, and but the question is specific to why can't we use Yo docs, which are at once slim and a good impact attenuator or failing that Jersey barriers? Do you want to expand on the on the earlier answer of space, or is that true I mean I think in general. I think we do understand that the barrels have not been working out as well as we might have liked and that they're very challenging so, which is why we are looking to use delineators instead. I do not know if Sean is still on, but I think Ed kind of touched on the other reasons for not using other materials earlier, but we have learned from you know our experiences with the initial temporary bike lanes that the barrels really are a challenge to maintain and so we're looking at the delineators and stuff right- and I I'm still here Kim and the goal is to try to get this in this year. So I think the interim materials would be you know in case we did not finish everything, although that is the goal, and what we have learned is that we go to materials that do not shift around like those barrels currently do, and we share your frustration. The next question I think, is related to busway rules. Will people shopping along the corridor via private car be able to go to one store and then go to another block? This is not through traffic. Correct, I think it's related to driving from one block to the next block right. The initial proposal for the Busway would require everyone to make the next turn off of the corridor, so you can get to your destination, but you would then have to turn off the corridor, but, like we said we are considering, we are still really considering what the options are for traffic restrictions on the corridor, but that is what how it would work if those restrictions move forward. Okay, thank you. Will signal time will or is signal timing adjusted to 25 miles an hour. There is a fear of express buses going too fast. Are there other ways to monitor the speed of express buses? I do not know if anyone from MTA wants to take that question. I actually do not know the answer. Maybe Kim you do about signal timing, adjusted to 25 miles per hour. I know we are going through Manhattan and re- timing signals, but I will say I express buses. Normally, no bus typically moves at over 25 miles an hour because they are making stops. So it's really hard to achieve that on a long stretch of the corridor typically, so I do not think we, I do not think any of us on. The call right now have knowledge of plans for sickness having changes to for 25 miles per hour in this corridor, but we can certainly take that back and get back to okay. Thank you. Next question is related to secure bike parking. Do you have any current plans for secure bike parking on the quarter? Sean you're, muted, you're, muted, sean! Sorry, thank you. Everyone! I think that's something we can certainly look into. I think right now we are trying to get through a lot of the early planning stages meeting with the cab, making sure that the cross sections that we're working towards make sense- and I think some of those finer amenities can come. You know a little later in this process, but I think could be included in this plan and just to note that, generally, we have gotten a lot of requests for increased bike parking as buildings anticipate folks coming back to work on bike, so we are working on expanding our bike. Parking around my time ahead in general. The next question is related to the camera enforcement of the Busway. What form of camera and board enforcement will be implemented to ensure a private car does not block the buses. I think here the question would be: is there any meaningful distinction between the enforcement on this corridor and the type of enforcement being done on 14th street? I will say that we have added some camera enforcement on fifth avenue already and we will be looking to do more if we think that is a particular issue or concern, I mean, as you should know, pickups and drop- offs are allowed in the bus lane, so it is always possible for people to access the curb, and that is legal activity, but if people are parked there for longer than or making the incorrect turns off the corridor driving in the bus lane, we would issue violations for that. Okay, thank you. There are quite a few blockages in the existing bus lanes by NYPD and other groups. I guess this is related. Are there other ideas on how to deal with that issue and what can be implemented? We continue to work closely with NYPD and I do not know that. That's been a huge issue for us on fifth Avenue, but if there are specific locations, I'm always glad to hear what those are, and we can look into that and, of course, as we develop the plans for prosperity and on Fifth avenue we're having conversations with pd. So we can discuss that as well with them. Okay, thank you for the we're trying we're trying to go efficiently through these questions and we're down to the final 20 or so does the D.O.T weigh the concerns of a hundred thousand daily bus riders, everyday bus riders at the same level as community board members and or wealthy or private vehicle riders? Does not the data speak for itself that this should be done? I do not know if you want to speak to that, but I suspect DOT does not actually know whether or not community board members are in a vehicle when they're analyzing how fast the vehicle is going. I'll just add- and you know thanks for that question I'll- just add that we are really looking to how we can make this street work best for everyone and most fairly for everyone. 110,000 bus riders a day is a huge number of people that come to Fifth Avenue from all over the city, working in all kinds of jobs, and you know we are trying to make their commutes as easy as possible, encourage people to take public transportation, but we also know that people need to get to all of their businesses via Fhv. Cycling has increased tremendously. There is a huge pedestrian need along this corridor, so this complete street proposal is really trying to balance out all of the means of the corridor in the best way possible to make it work for everyone thanks. The next question is, I think it relates to something that's been addressed already, but why did Covid-19 cause delays in implementation rather than the reverse? I think it's been spoken to I'll. Let you speak to it again if you'd like to, but I think the question is: why not faster sure I mean the general answer. Is that we did not have our crews out working at the peak of Covid-19 for safety reasons as the primary reason, so, whereas normally we are able to kind of have our implementation season up and running in by may we really. We started a lot a lot later this year. Our staffing just has not been the same yep. Thank you. The next question is whether or not there's data on the demographics of current ridership is that is that demographic data available from D.O.T or MTA Chelsea. Do we have a I'm, not sure that we do not necessarily have a demographic makeup of writers? I do not know if anyone from MTA can speak to that. We do not collect that data. That data is not typically collected. Okay, you know how many people commute. You know city- wide based on just census data and how they commute, but yep. Okay, thank you. There are. There are some questions that do not seem specific enough are different enough from previous questions that I'm going to have to just bypass at this point next Quest next question is related to pedestrian barricades. Will the pedestrian barricades on the West side be removed from Christine Berta? I assume that means the west side of the Fifth Avenue Hi Christine hi everyone good evening. It's Jennifer Santinas from DOT. That's something that I think we're still taking a look at with our other pedestrian, a team as well as the bike team and the busway team. That's on now, so christine we can get back to you and confirm with folks once we speak with our colleagues on that. One christine also asks the West side. Sidewalk is the most congested by far. Why not install the sidewalk extension on that side I'll say, because the bus lanes are located there and in order to maintain ADA accessibility for bus customers, they need to be able to pull all the way to the curb. An actual curb David Caleb asks why, when safety is such an issue has not one word been said about enforcing existing bicycle laws as bicyclists get more out of control every day. Who is responsible for keeping bicyclists in line? Surely that's not a police job? Do you want to address whose job it is so we're hoping that this design will organize the street put cyclists in a space where pedestrians and cyclists expel excuse me and motorists expect them to be, and again, as I touched on earlier, improving the interaction between bikes and pedestrians, bikes and vehicles, bikes and buses. I think that's our overarching goal is to by organizing the street. You know creating a space for everyone and improving those interactions in terms of enforcement that does fall on NYPD. Just to reiterate, this is something that comes up every time. We present protected bike lane projects, but just as a reminder when we implement those kinds of projects, we see safety benefits for everyone on the street. So when we're talking about safety, implementing a project like this, we do see as a benefit for pedestrians and cyclists and even motorists you. The next question is: do you have any data on express bus speeds? I think this is relative again to in express bus ways. What are the speeds that the express buses are reaching? Does anyone from MTA want to address that question? We could try and get you that data we do not. I do not have it off hand for this presentation, but we can certainly report back on that. Okay, thank you, yeah that might be might be useful information to have when you folks return to us down the last dozen or so next question are pickup times factored into measuring the bus speed. If so, have we considered other reasons for the increased bus speed such as the fact that there are fewer riders? So not all stops are made and no time spent inserting metro cards upon boarding, plus no tourism. So most riders understand the bus system increasing hop on time. So I think it's. I think it's relative to reasons for bus speed increases and whether or not you're able to address bus speed, increases on bus ways to specific factors. Hi sorry, it sounds like we have a lot to report back to you on bus feeds at the next meeting, and certainly we can gather some all that data for you and then report back, but I do not want to speak to anything right now without the data in front of me. Okay, I will say that we do know that the question's gone now. So I can't remember all the details, but we do include stops in the bus feeds. There end to end, including all criteria- and you know we can come like Laura said we have addition, there's additional data. They can come back with, but of course, all of those things contribute to buses moving faster, certainly a whole lot less traffic on fifth Avenue has contributed to buses moving faster, and so that's all part of the equation and I'll just put a plug and say end of the month, we're going to start collecting fares on buses again so we'll if there is any impact from that, we will see that in the month the coming months, yeah great. Thank you a question on a smaller scale, comparing to when the plan was presented to limit traffic on Broadway between 26th and 27th many residents resisted. Since the change was made on Broadway, have there been have there been any complaints that DOT has received? I assume the question is related to residents. Do residents continue to contact you relative to Broadway between 26 and 27. sure happy to speak to that generally after the projects are implemented, you know, complaints from residents and other stakeholders typically die down. So I'm not sure if the question nur had a specific area in mind but feel free to contact the Manhattan office, and we can continue to discuss that great. Thank you. There have been no new questions added in the last 10 minutes, so we're just going to take these these final 10 and then wrap up this section of the meeting next question from Joseph Bauman. Your presentation says the pilot will run through spring summer. 2021 is a more permanent bus lane planned before then, not sure. I understand the question specifically. So the bus lanes are currently in place and the pilot would be the addition of restrictions on through traffic or turn movements and that sort of thing, and so it's so it's a pilot, there's no plan for permanent restrictions. At this point, I'm not sure if that answers the question yep, I'm not sure either or- and I'm not. The question may have also been. Obviously it's a pilot, but whether or not current plans are for making the busway permanent after next spring summer, when the pilot is planned to end, and I guess the implication is, as the 14th Street Busway was made permanent right. So at this point our plan is to do a pilot for 12 months yep. Thank you question related to the best way. If you have to pick up a cab, how do you cross the bike or no I'm sorry. I guess it's related to the bike lane. If you have to pick up a cab, how do you cross the bike lane and the pedestrian lane without fear of being knocked over, especially if you are elderly or disabled, and especially with the advent of electric bikes? So at the corners there will be painted pedestrian areas so at the corners you can just access the painted pedestrian area and catch a cab. It would be, you know, eight plus three, so you know 11 feet wide. If you were mid block, you would cross the six foot bike lane and there would be a three foot buffer and eight foot parking space. So then you'd be able to step out of the bike lane, wait in that three foot buffer area and wait for a livery cap to pull in, but just to clarify if you did not want to cross a potentially active bike lane you could cross at the at the crosswalk. While all traffic was stopped. Is that the correct there are there's crosswalks at both corners? Yes and again, just for the, as I announced, I think, we're going to cut it off at the at questions that were submitted before 7:15. As I announced a couple of minutes ago, just wondering why bikes and the pedestrian part of the plan has been severed from the entire plan and around the work that the cab is doing. It makes the cab members work irrelevant, since they have been a value since they have been evaluating this complete street plan in its entirety and not in sections, I'm not sure, I'm under oh and it disappeared, I'm not sure, I'm understanding it entirely. I think the question is: why is the? Why is the cab separated from the rest of the complete street proposal? Why is the what's? The cab is evaluating, separated from the rest of the complete street proposal, so I think one of the challenges here is that we're looking to install a bike lane, be it temporary or permanent and some pedestrian space. This fall. We do have timing challenges there. We can't put in paint after a certain temperature- and so I think in general, while we still are looking at the corridor holistically and we still are looking for cab input and we'll still have more cab meetings before the bike lane is fully installed. I think we're just trying to move forward with the requests of for the complete streets improvements at this point. While we work through some of the other concerns, we've heard and tried to just come up with the best plan for the bus as well feel free to add anything to that D.O.T. Okay, thanks next question is how will adding these painted lanes affect the black lives matter, Mural currently painted on 5th Avenue? Will the mural be repainted my understanding that the black lives matter mural will not be repainted after the project gets implemented? That was a one- time initiative from the mayor's office to have blm. You know street murals painted acrosss the city, so I'm not sure janet. If you have anything else to add, but just to answer that question I do not believe they'll be, it will be replaced. I guess I read, I read the question I heard it. A little differently is: will we be painting over it with the bike and pedestrian space and I'm we'll just have to? We have not looked at the detailed design yet for that block, but obviously we'll deal with that really sensitively and consider, but, like Jennifer said, the mural itself would not be repainted. That's our understanding! Okay, that's interesting! Thank you. The next question: can you reconfirm the measurements discussed for the bike treatments? I do not know if you want to go over them again or, if they're going to be in the presentation that we're going to make available on the website the presentation that we just saw, I think that would be sufficient for anyone who wants to revisit that there. It is on the screen, sure, and also just as always, our final our designs are always subject to. You know final engineering review as we move forward towards implementation. So just take that with you know, just recognizing that things can shift a little bit in the process. If I'm understanding the next credit question by christine correctly, if there's not parking protecting the protected bike lane, will there be any kind of vertical grade change to protect the bike lane from traffic in the spaces where the parking drops, we would likely add delineators. That would be the vertical element in that space. Okay, thank you next question: does it making every car turn at the first intersection create more of a safety hazard? Can you speak very briefly at a high level about the principle behind that the principle behind that would be that there would be many fewer vehicles on the corridor in general that only vehicles that actually had business on fifth avenue would typically come to fifth Avenue. So by having cars having to turn at the next intersection, we would expect that those numbers would still be lower than they were pre- coped. Thank you next to last question: where does the question of off hours through travel stand in terms of D.O.T plans or the cab discussion? At this point, the current bus lanes are in effect, 24 hours a day for any other traffic restrictions that we might employ here, we'll we're still examining that and that's part of what we'll bring back to the cab and to the Cb final question: if there will be polls and cameras and signage added all along Fifth avenue, what does that mean for the Community Board's established priority of clear visual corridors? I do not know. If I do not know. Dot wants to speak to visual corridors in general from a community board perspective. We certainly prioritize clear visual corridors, particularly on uptown avenues like fifth Avenue, but I do not sam. Maybe you can correct me if this is wrong, but I do not believe we have a specific finite criteria delineated for that. The way we do for some other things like like bus locations and other types of criteria, but DOT do you Wanna, speak to clear visual corridors like looking up avenue, so we're very familiar. Go ahead! Kendra! Oh! Go ahead! I was just going to add and say that you know ej we're very familiar with the board's preference and priorities for clear visual corridors. You know in terms of how many polls and signs- and you know equipment will be added to each block. That's something that we're still working on. I know fred. We can continue to you know, get you more clarification on that, not sure if my DOT colleagues wanted to add a bit more, but we'll certainly keep everybody posted yep. Thank you. I think the I think the hope there is that manhattanhenge does not get ruined by too many cameras getting added to to Fifth Avenue. Okay. Those are the questions that were submitted by the members of the public. I want to thank DOT for indulging all those questions, just as you would in a in a public meeting with members of the public. I want to thank members of public for rolling with this new process as we as we try it out and for deferring to our our attempts to do it efficiently and to combine questions and to go through them as efficiently as possible, and I apologize that you had to hear my voice a lot more frequently than normal, where you would have gotten to hear directly from members of the public will con. This is the first is the first time in the age of Covid-19 that we've had a a public committee meeting with. Quite so many attendees we'll continue to try to do better and improve on this process as well, but with that we'll we'll wrap up this agenda item talking about Fifth avenue, thanks again to DOT and thanks again to all the members of the public who participated in it with that we'll go to what I believe should be much briefer sections of our meeting. The next agenda item is updates on the 14th street Busway D.O.T. We sent we sent a couple questions along in advance, not sure if you want to speak at all to to those questions and whether or not you had any thoughts on addressing them and some of the data that we had talked about in the past. In terms of continuing to assess 14th street sure I think Janet was going to take us out at answering some of those questions on her team. I think there were just a few questions about the busway and so just to speak generally, as you may know, DOT through our through the consultant, Sam Schwartz Engineering released two monitoring ports monitoring reports about the busway, each, which showed really positive results for the Busway pilot. Those are available on Sam Schwartz's website publicly available and in June. The mayor subsequently declared the project permanent, but that does not change our commitment to making sure that we're identifying any other issues just like we do on all of our bus projects citywide and addressing and talking with community stakeholders about what is going on with the project. The first question we received was what kind of outreach to storefronts and residents have we conducted and are there any trends in the feedback? In our? In this second report, we worked with Sam Schwartz engineering to field a really comprehensive survey of businesses, residents and users of 14th street from last winter, which was featured in the second monitoring report. So if you look at that report, you can get some of the feedback that we saw come out of that a total of almost 1700 public responses were obtained with 183 business responses, which is really pretty high response rates. The trends can really be seen in that in the report, but it's important to note. The survey took place before the pandemic and the lockdown, which really changed traffic patterns since then, and you know obviously business conditions and residential occupancy along the corridor and all that, can you speak to what and I guess I might be asking you to think back to pre Covid-19 like February and March. Can you speak to whether or not you were you were seeing or learning of any business impacts on the businesses that were on the corridor and whether or not any initial fears of decreased foot traffic and decreased car traffic to businesses ended up being born out? I would have to read from the report I do not have. I do not know all that information off the top of my head, so I do not. I do not have that here. I mean, I think in the short answer is that we certainly heard some concerns raised about access to their stores for deliveries and other things, but we do not have hard data on the impacts of that on the on those businesses. Yes, yeah and by hard data you mean like receipts and income data, maybe but or survey data yeah businesses. I know that going door- to- door was some of the preliminary work that was done by DOT or Sam Schwartz contacted by DOT before the before the bus way was implemented, and I was wondering whether that kind of survey of businesses on the corridor was done yeah. It was, and that's what's reflected in the second report that came out in May and so it you know it shows it shows mixed opinions of how the corridor has worked for some people and not and not for others, and it's there's a lot of data in there about the public feedback. And you know we were. We asked questions like of businesses. I'm reading here. How familiar were you with the project? Some people were still not familiar with the project at all, and I know we did survey some businesses on side streets or on avenues who were just not, as did not even really know that something had happened on 14th street, which was interesting to us, and you know there are. There are questions about the number of customers visiting the businesses. It looks like the largest response was typically stayed the same, but it really. I do not want to just pick and choose data as I'm talking to you about it. It's really worth going through the survey and the presentation in detail and looking at all of the elements that are in there hi Jan, it's romney, I just in the chat I gave the link to the Sam Schwartz study and page 21 has the business feedback that we received. So if folks want to look at that, they can do so. If you have any questions, I think that's how that's helpful and we'll look forward to to digging in particularly into the to the May report, which I suspect, a lot of many members won't have gotten a chance to may have not may have not even known it existed and have not gotten a chance to review it yet. So that is helpful. You know knowing that the knowing that the other questions we sent along in advance were somewhat broad. I think I want at this point to open things up to the committee and see if there are any any particular questions again, knowing that we still have this. We have this may report from Sam shorts. The second report that can be that can be studied. Are there any sort of open or lingering questions for members of the committee that they'd like to direct to DOT at this point, perhaps relative to any questions that we might have brought up the last time we were discussing this with them feel free to raise your hand if you have a question: okay, not seeing any. Oh, we got one Chris, Clark, hi yeah. My question is specifically regarding something that came up when you last presented or when Sam shorts last presented about this just hearing some anecdotal evidence back then that certain residents were being ticketed when they're unloading groceries since it's a no standing zone. I just wanted to check in on that and see if, if that is continued, if there have been any changes to it, I recognize that enforcement on this stretch might have undergone some pretty significant changes. So please feel free to answer that question. You know specifically on the no stopping zone issue or more broadly, as it relates to enforcement. More generally, thanks for that question I will say I we have not heard. I have not heard in my group complaints about that recently. I do not know if Jennifer or kimberly you have we have not recently, and so we did. You know having get received that question in advance. We did reach out to pd to see if they had any sort of information on that. I think it's a difficult one for them to elaborate on or to like to have actual numbers on. So I think we can just share that at this point. We have not been receiving complaints along those lines at all. Recently, that's helpful. Thank you at this point in anticipation of going to questions from members of the public in a minute. If you do have a question, please feel free to if you're a member of the public- and you do have a question, please feel free to put it into the Q&A section of zoom right now. If there are any other questions from members of the committee, please feel free to raise your hand, so not seeing any more questions from members of the committee at this point, we'll take a look at questions from members of the public. Oh sorry, I I took down your hand, Chris you had a question. Yes, sorry, I thought I had done that on accident yeah. I did have another question. I know I sort of alluded to this earlier and it's okay. If you do not have any updates, but would it be possible to speak more broadly to how enforcement is being done on this block, and you mentioned that you would ask NYPD for the specific numbers regarding the the grocery unloading question. I know this is a time where enforcement is being sort of reimagined in a lot of different ways. Are you able to provide any updates as to how DOT is handling enforcement and whether NYPD will continue to be the sort of enforcement officers in all situations? Well, the 14th street best way we have the camera enforcement. That is, you know how we have been enforcing the restrictions specifically related to the busway so on through movements, and so that's pd is not at each intersection anymore. They they're still along the corridor and still you know surrounding streets issuing violations, but we do have the camera enforcement in this case, which is the primary means of enforcing the best way got it. That's helpful to know, may ask a quick follow- up question: is it possible to sort of predict into the future how dots, dot's enforcement collaboration with NYPD is going to change specifically regarding this project or more generally, or are you not at a place where you can make that kind of prediction? I do not think that's something that we can comment on at this point. You know I understand any other questions from members of the committee. All right with that we'll go to questions submitted by members of the public. Gail Fox asks when will a cab for 14th street ever meet or begin to meet many questions asked over the past three years are still unanswered what modifications are planned and how can local residents submit requested modifications? So I think there's a couple questions there, which I think are very valid, given what we've heard the intention of the Fifth Avenue Cab to continue operating in a in a feedback and iteration sort of way, even after it's theoretically implemented, is anything equivalent is an equivalent community, Advisory Board planned for 14Th street. Oh sorry, no yeah, I mean just some background on sort of like why we went with the cab structure for these projects is, you know we were trying to you know we had an aggressive timeline. It lined up with summer the ability to kind of meet on the board basis, which we normally would have been doing for projects like these was. It was unlikely that we'd be able to work within that structure, and we also felt like we needed a serious commitment to continue to work with folks, even after implementation, because we did not. You know accepting that. Maybe we get it down fast and it's not perfect, but we need to keep adjusting along the way I think for 14th street. You know we obviously had a long there's a lot of conversation before that project launched. It was through the boards in public meetings. You know the launch period, there was like two close to two years and then we've met after implementation with boards CB5 and the others were. You know, whenever requested on a fairly regular basis prior to sort of prior to Covid-19, at least, and we've done a number of walkthroughs so and we've been constantly responsive to elected officials and everything else, and then the Sam Schwartz report has provided a lot of the feedback that people were looking for and sort of monitoring people looking for. So we did not. I think we wanted we. The cabs were acknowledgement that we could not do that same thing for these projects that we have been doing for 14th street, and I think that the process that we've had for 14 through the boards and other means has been effective, and we can continue to take questions from the community through the board process, and I think that that's a good way to do it and obviously Kimberly and Jennifer, can talk about how they are accessible at all times in Manhattan office. To the second part of the question: are there based on the Sam Schwartz reports or any other questions or any other data or considerations? Are there any antici? Are there any like currently planned or just potentially anticipated changes to the busway to the 14th Street Busway coming in the foreseeable future? The answer is yes, we're still looking at those you know with the lower traffic volumes throughout the city, we have not been hearing as many complaints or concerns about the Side street traffic. There's a couple of things that we're looking to do, but we do not have immediate plans as of right now. Okay, thank you. The next question by Jason gers regarding the Busway report. Are we able to separate any impact of the busway from the simultaneous impact of the L train weekend shutdowns and it says for context thinking about business impacts yeah. We really are not able to separate that all right, unfortunately right their answer. That is all the questions that I see in the Q&A. Okay. Well, thanks very much. I would just reiterate what was said about for members of the public who still want to engage or still have questions. Did you say it was? It was Jennifer and Kimberly were the correct people to reach out to yeah, okay. I would simply encourage members of the public who who still have questions or are looking for engagement with dft with that we'll wrap up that item on the agenda. Thank you again to DOT for fielding our questions and members of the public for participating. Finally, and I suppose this may be a brief item as well, we had asked for a very general update on the status of the open streets and restaurant streets program. Can you let us know how that's going absolutely hi good evening? Everyone, it's Jennifer sonthines again, I'm happy to speak to updates for open streets and open restaurants. I just checked the public portal for our open restaurants program. That's at NYC open restaurants, DOT info. Currently there are 9912 participating restaurants in the program, as you know, it launched at the end of June when phase two open for outdoor dining. It has been widely successful since then, and you know, over half of those almost 10,000 restaurants are participating in Manhattan. I know that we've heard from a lot of the different community boards. Acrosss the whole borough about questions and issues in terms of enforcement and citing criteria in the Manhattan borough commissioner's office is always happy to field those questions. But I'd say it's going well. So far, we've had inspectors go out to all of the participating restaurants that have road bed setups to ensure that all of those outdoor dining seating areas are meeting our current criteria. So I'm also happy to answer any other questions that the committee or the public may have tonight. So inspectors have literally visited every restaurant in the program that put seating on the on the street. Is that what you're saying okay you've been doing over the last few weeks, too, is just reaching out to any new restaurant that you know qualifies and self- certifies for the program to ensure that they're aware of the citing criteria? All of that information can be found on the DOT open restaurants website, which is Nyc.Gov open restaurants, if any folks still need that information and they're there to check generally all the siting criteria, whether they're not going out into the road too far, whether or not the tables are appropriately spaced. Is that is that, generally, what their, what their task is when they visit that's correct, so ensuring that the barriers exist on all three sides of the sidewalk, or rather on the road bed set up adjacent to the sidewalk, ensuring that there's reflective tape on all three sides of those barriers and just making sure that it meets all of our safety criteria. Thank you I'll ask a couple of initial questions based on some notes that members of the committee have pulled together already and then I'll. Let members of the public ask any questions that I'm sorry. First members of the committee ask any questions that they might have, and then members of the public can put questions in the Q&A as well. Are there at this point your knowledge any or lots of reports of damage to the installations that are being put in the street or cars interacting with or hitting any of the installations that are being put in the street? So I had mentioned that our inspectors had gone out to visit all participating restaurants with street seating, and you know for the locations that do not meet those safety requirements. We either issue notices of violation and we have inspectors that are talking to all of the restaurants and establishments about what exactly which part of their setup does not meet a requirement. So hopefully they could fix it. Let's say the retroflective tape is not in the right place or the barriers are not wide enough or there is not a ramp for ADA accessibility. You know all of the safety criteria was actually refined over the first couple of weeks since the program launched to make sure that there are not. You know to ensure that safety of all of the patrons and all of the new yorkers that are either you know using the establishment or passing by the establishment, remain safe. So luckily we, you know we also have not had many instances of collisions, but I think you know there are a few. You know circumstances and instances that have made the news, but there have been very rare. Okay. Thank you. This might be difficult to assess given seasonality and given Covid-19, but have you seen any impacts on traffic or increased traffic in areas with with closed streets or restaurant streets? We do not have specific data on that Ej, but you know generally, traffic volumes right now are lower due to the pandemic, but if there are any questions about certain congested areas, we could take a look. Perhaps the setups are. You know increasing congestion in very specific areas, but, generally speaking now, can you characterize forests at this point? Obviously covets started everything shut down. Traffic plummeted. Traffic has come back somewhat since then, can you characterize those sort of just dots on the graph for us like how much of pre- covered traffic has returned in a in a top line? Oh, are you getting kicked out of the office motion sensor yeah? Can you can you characterize for us? You know, maybe just you know at top line numbers. What percentage of pre- coveted traffic has or traffic congestion has returned to the central business district, Manhattan sure that's a great question and that's something that I do not have off the top of my head. We've received that question from other folks as well. So I'd like to check in with my colleagues to make sure that we're getting you the right facts and the right details. That would be great. I would be very interested to get that number. Thank you with that. I'd like to invite members of the committee to ask questions if you've got them and I'd like to start with Luke in the board office hi. So one thing that we get complaints about from residents is how scaffolding interacts with sidewalk seating. Can you talk about? You know what are the requirements for sidewalk, seating and scaffolding? Sure thanks Luke. Generally speaking, our main concern is to ensure that there is an eight foot, pedestrian clearance around outdoor dining setups that are on the sidewalk. You know if I'm not quite sure what the exact situation is for the for the person that was asking the question, but if that does not exist, then, unfortunately, you know that specific location does not meet our criteria. Okay, thanks, Bj has your hand raised. I have a quick question regarding the open streets for the permit to have the through traffic, be, I guess, prohibited from Friday to Sunday nights some streets. Apparently I know that you have to have eight feet available space for emergency cars, but if you do not have that the restaurant or can make provisions and with the working with the fire department or the police department, is that true, so that you do not need to have eight foot of space all the time there does have to be an emergency lane maintained at all times for all of the open streets, open restaurants and the open streets. Restaurants, program bj, I think you're speaking specifically about the open streets. Restaurants initiative that actually fully closes that street from Friday 5 pm to Sunday at 11 pm. But you know, generally speaking, it has to be. You know like a 12 to 15 foot emergency lane, I'm not quite sure what the specific example is here. But if there are questions or if there's a restaurant owner or a restaurant group, that's asking you can connect them with myself and kimberly and we can take a closer look great. Thank you Jennifer. Just before I go to the next question, can you clarify obviously there's a couple different types of streets at this point? There are the open streets that were you know, selected by DOT and announced by the mayor. There are now restaurant streets that have a sponsor. Essentially, can you clarify who's responsible for setting up and taking down the barricades for each of those two different types of seats and streets, and you know for the former for the open streets? Are they are they all handled by the same same type of people or does it or does it really depend at this point on the neighborhood and on local community groups and and other situations sure, so each location is kind of unique in its own sense for the open streets program. Those are you know. Street closures to through traffic, unless there's local vehicle access or local vehicle access is still permitted on open streets. That street closure is typically from eight, am to 8 pm. Sometimes the hours are different. If there is a community partner that is managing, you know different hours. If there is not a community partner, the local precinct is setting up those barriers to close that street, and so that's our open streets program. The open restaurants program, if I'm remembering it correctly right or the open streets restaurants program, there is a leading entity for that restaurant group. You know. Typically, there has to be at least three or more restaurants for a block to apply for the open streets restaurants program and that leading entity in that leading restaurant itself or location has to coordinate for those barriers to be set up for those extended weekend hours. Did I hit all of your questions? I think you did do the do. The open restaurant streets have fixed hours or are they per site? Do they vary so open streets? Restaurants blocks just have expanded weekend hours, so on Friday they can operate from 5, P.M, 5 P.M to 11 P.M and then on Saturdays and sundays. They can operate from 10 to 11 pm and open restaurants. As you know, they're kind of you know it's that larger group of participating restaurants for outdoor dining, they can run up to 11 P.M as well right. Thank you. Okay, thank you for indulging me there's a question from zach thanks ej. While this does not affect the majority of restaurants, there are some restaurants that are unfortunately located directly in front of fire hydrants, which prevents them from having any sort of outdoor dining. Is there anything being done to help those establishments? So when we launched the open restaurants program a couple of months ago, we really wanted to create a process that was nimble and quick. You know it kind of happened within a couple of weeks. We were hoping to just help as many new yorkers and as many restaurants kind of recover as quickly as possible, and, as you know, that means that we really can't help everyone. So there are, you know, circumstances where establishments have short frontages that also align with bus stops or moving lanes or fire hydrants, and at the moment we do not have a mechanism to allow those restaurants to do outdoor dining setup and hopefully in some situations they have wide enough sidewalks where they can apply for sidewalk seating and if not all, right, thanks Bj has a question. I have a specific, and I do not know if this is the forum here for that question. But you know they're streets like 32nd street in Koreatown, it's a vertical growth. So there's restaurants on the second floor on the third floor, so only the first ground level. Restaurant has that opportunity to do that. Open dining outside. So the second and the third restaurants can't operate. So. Do you know if there's any? I do not know if you know the answer to this, but is there any kind of provision or something to help those restaurants? At the moment, Bj only restaurants that are on the ground floor and that qualify for our signing criteria are allowed to participate in the open restaurants and open streets. Restaurants program thanks any other questions from members of the committee. All right with that, we will take a look at questions submitted by members of the public. There are six currently question. The first will DOT push forward with the open broadway proposal that was presented on January 27th Broadway, like Fifth Avenue, is a significant business thoroughfare that will only become more strained with the return of workers and shoppers. Could plans be discussed for open street sections to be lengthened and preserved throughout the winter, to support local businesses, restaurants and safe bike and foot travel. I can jump in here. We have, we hope to come back to you guys really soon, with an update on our plans for Broadway and the bigger the bigger broadway vision and the segments that we want to prioritize for improvements. So we should be. We should be in touch about that very soon. Okay, thank you. Catherine Nessl also asks have there been discussions for DOT to allow bids to facilitate community events, for example yoga, along with retail setups, on open streets, particularly along major streets like Broadway, so I know at the moment we do not have a mechanism to allow outdoor retail, but all of our bids have been wonderful community partners and we certainly are open to just you know having these discussions and figuring out what other next steps we can take as the city moves towards. You know full recovery. Okay, thank you. Craig slutskin asks well, I realize this is more likely in the purview of the Department of sanitation. Have you seen or do you know, of an uptick in reported complaints of vermin or pests around streets that have opened dining and if so, what would be the plan to deal with pest control, giving cuts by the city? That's an interesting question, as you would guess, the borough commissioner's office has received a lot of questions and comments about the open restaurants program, but this one I do not believe, we've fielded this question, at least in Manhattan. I can check in with my colleagues to see, but I really do think the department of sanitation would be your better bet all right. Thank you next question by Janet Liff is there a chance that open streets will be extended beyond October 31st? At the moment, the mayor has, you know, said that the program will end on October 31st and has mentioned that he is interested in seeing something you know a little bit smaller scale return next year, but Janet no at the moment. There's no discussion about extending it past that date this year, craig asks on the application process. If there are three small restaurants on the block and the rest is all residential and the three get together and apply, what outreach to residents is done or do the residents get no say or even notification? If, essentially, these three restaurants apply for the for the street to be open. So during our open streets, restaurants, application process, you know we do encourage any applying entities to do that extra outreach to their neighbors. You know that does not really fall on us, nor does it fall on the community board, but we do encourage folks to really think about who else is on the block. What other needs are needed? I'm not sure if Kim or other folks would like to jump in with more details, but I can also just to add that they have to submit an outreach plan as part of their application and so typically they are reaching out to residents and to the Community board through that process. Okay, that's helpful. Last two questions: Larry Aronson asks what actions are being taken to curb the worst abuses of the open restaurants program, for example, world famous julian Club in the Limelight church, courtyard on 20Th Street and Sixth Avenue Larry. If you can email, Jackie, Lazaro and colleen chatterboon from our office, we'll take a closer look at this specific site. Jackie I see you, can you add your email to the group chat? I'm also happy to do the same, because I can't speak to that specific site. Just confirming is that on street or off street on the street larry sent us photos today. Okay, yeah: I can forward you, though Larry's email as well great thanks. Thank you thanks and the final question that we have from Jake Johnson. My understanding is that restaurants are given a 24 hour notice, followed by a cease and desist. I guess, presumably, if they're not an appliance in compliance, what is the appeal process and if you receive a cease and desist, can you reapply for the program process? If you receive a cnd, can you reapply so if the cnd was received for a violation in terms of setup, let's say that the barriers were not wide enough. I keep on going back to that, because I do want to stress that you know the wide barriers increase safety for outdoor seating on the street. Restaurants should be able to rectify that situation. Take a photo, send it to us and reapply for the program if it's something where they received a cnd if they were operating in the bus lane and they try to reapply to the program they're not able to there's no appeal process for that specific location. All right, thanks very much and with that I believe that brings a close to our meeting tonight. Thank you very much once again, members of the public who came out and asked questions and to members of the DOT for indulging us. I know this was a this was this was particularly because we had not gotten a chance to see you in a couple months. This was a very heavy opportunity for you to provide updates to us, and we appreciate you very much engaging with us and the larger community tonight on all these all these different all these different topics and this time of craziness. So thanks again to everybody, really appreciate it. Everyone. Thank you. So much talk to you all soon. Thank you. That ends our meeting thanks very much. Everybody have a good evening. Thank you.",
            "summary": "Everyone for joining us tonight, if you're, not otherwise, aware you're at the August meeting of the transportation and environment committee for Manhattan Community board five, where we hear issues related to the transportation environment in the space that affect our district.\nWe have three items in our agenda: tonight: they're, all updates from the department of Transportation who has who's joining us here, tonight, we'll be hearing updates on a couple different topics, including the status of the open streets and restaurants, program, which of course, is ongoing, we'll be hearing updates and some follow- up information that we asked DOT to come back to us with regarding data and observations about the 14th street Busway, which of course has been underway for many months.\nSo without further ado, we'll we'll get started with the the first of those items on the agenda, which is an update on Fifth Avenue and the design process, which I will I'll introduce briefly to provide some context for the members of the committee and Then I'll send it over to Ed Pinkar and the team from DOT to to present what they brought.\nThere are several elements of improving fifth avenue that we've heard about over the years, including a long- standing desire to continue to add to the city's interconnected bike.\nCommunity board is that commuter five is actually already on the record supporting the addition of a protected bike lane on Fifth Avenue.\nSo, for that reason, and to kind of set expectations for the for the committee, because the design we're seeing is not final, because the bus way is actually still under discussion and the rules and goals of it are not finalized yet and because Community Board five is frankly already on the record relative to the concept of a protected bike.\nThis month, because it's still in development DOT, will certainly come back to us after the final cab meeting relative to the busway after continuing to design and discuss the rest of the Fifth Avenue development and continuing to iterate on the kind of complete street design.\nWe expect DOT to return to us in the coming months, And I do not expect us to take a final position on this tonight, so I just wanted to set expectations for any action by the committee tonight, but we're looking forward to seeing the status update.\nYou know asking questions from members of the committee and members of the district And I'm sure that DOT is interested to hear our feedback as the design process continues and is.\nWe were happy that Fifth Avenue was included in that plan and we convened two Community Advisory board meetings, thus far over the summer to start discussing what those improvements could look.\nOne of the things that we quickly heard from some of you from our elected officials and from other community stakeholders, is that Fifth Avenue serves a variety of interests and needs not only new yorkers who work there, who live nearby, who commute through it, but also millions upon millions of tourists who come to this most iconic avenue each and every year, and hopefully, they'll be back in mass.\nThis is something that community board 5 has long called for a more complete street type, treatment, four fifth avenue and has also been one of the requests from our elected officials.\nWe presented not only our initial ideas for how a bus way could operate, but also the bones of a complete street for Fifth Avenue, including both needed pedestrian space, as well as a protected bicycle lane, and we're excited tonight to run through that presentation to give you a sense of what we're thinking for the corridor as we look towards implementing a project later.\nObviously I personally, I hope that we get some good feedback on the complete street design in 2017, along with a former member of Janet's team, we presented the double busway proposal and I.\nRestart plan was announced among highlighting the critical role that buses have played during the Covid-19 pandemic and as the city adapts and reopens, ridership numbers are still indicating that bus ridership has increased while subway ridership remains low and This furthers a need to provide reliable transit service that prioritizes the bus, especially as we can anticipate people have a greater desire for alternatives to the subway, which will include a shift to buses, bikes, walking war and private vehicles.\nWe just include this to emphasize the role improvements on Fifth Avenue has for the entire city and communities with limited options to talk more about the daily bus riders who use fifth Avenue, I'm, going to hand it over to a colleague at the MTA laura who will share a few slides with you all hi Ola. City Transit just want to elaborate a bit on the bus service on 5th avenue.\nI'm happy to answer any more questions about bus service if they come up, but with that I think I can hand it back to Chelsea flora thanks and right now, continuing.\nEd and others have already acknowledged that this that there are, we have received support from the community previously, when the double bus lane was implemented in 2018 and that there have been longstanding requests for more of a complete street approach, including a protected bike lane in this Midtown portion of fifth avenue and all the time we're making sure accommodating the highest pedestrian volumes in this area, especially during the holiday season, and just to elaborate on the complete street approach.\nThere are multiple opportunities that present themselves on fifth avenue, as we consider how critical it is to improve bus speeds and reliability, create more pedestrian.\nSpace, safer conditions, adding a protected bike lane and accommodating the vehicle, pickups and drop- offs that take place in such a busy corridor and also finding ways to incorporate beautification efforts with these opportunities.\nA. Complete street approach will provide space to have a dedicated safe area for bikes during the city's recovery and when looking at the vehicle travel speeds, it's useful to think about what traffic typically would look like on fifth avenue and also looking at where we are in the middle of this token.\nSo now we'd like to present to the board a complete street proposal for Fifth Avenue just to catch everyone up on where we are, since the mayor's announcement, starting with Outreach and engagement, a community advisory board or a cab which is made up of the of elected officials, Cb members, representatives of local institutions, property, owners, transit advocates and bus riders on 5Th Avenue.\nThe initial proposal, limited Southbound through movement to buses, bikes and emergency vehicles, requiring all others to turn off before 57th street, but still allowed local access for pickup and drop offs.\nWe are continuing to without evaluate this feedback and suggestions that we're receiving and we'll be meeting with the cab again next month, and even though we are still evaluating all of the possible traffic restrictions in this project area, we know we want to move forward with the safety elements, including the protected bike, Lane sanded, Pedestrian space and the pickup and drop off zones.\nWe will be returning to the Cb in September, as well, with any updates on proposed Turner structure restrictions and a monitoring plan to make the avenue work as well as possible for buses, bikes and pedestrians.\nOur proposal tonight includes a parking protected bike lane along the corridor by providing dedicated, space, we're able to boost safety and better organize the roadway to promote better interactions amongst all street users.\nYou, know you're able to set things in the roadway pause and then and then find a gap acrosss the bike lane and make your way to the sidewalk or the pedestrian space.\nWe think these will be on almost every block and the point is to provide space for taxis and other free for higher vehicles to be able to pull over outside of the travel lane and maintain traffic flow.\nWe want to make the existing double bus lanes on fifth avenue work as well as possible.\nObviously, you know, if that slips at all my office, will keep CB5 and other cab members updated along the way and then, when we get to implementation, certainly depending on what goes in the ground.\nThe most helpful schedule will be moving forward on providing updates, but my office attends the transportation committee meeting every month and we're happy to you know provide updates along the way if we need to do something more formal in terms of additional presentations.\nI, we'll start by throwing it open to members of the committee to any ask any questions that may have come up during the presentation after that, we'll turn to members of the public who have been asking questions through the Q&A feature in zoom Ask them to the DOT, but for the time being, Luke.\nFirst of all, we started off not only this presentation, but the original idea for the project, understanding that Fifth Avenue is an iconic corridor that serves many different uses, not only all of the pedestrians who walk through the area, both on the avenue and the cross streets.\nYou know pick up and on this new on this new corridor, to kind of make it more clear , That's another great question, and we learned a lot from our experience with 14th street in that respect, and certainly when we launched the 14th street Busway, it was not seamless in dealing with the taxi industry and some of the others, the trucking industry and other buses.\nYou know companies so that they would take drivers on a different route from earlier on and there are a lot of different ways depending on where people are coming from and where they're going that traffic would be able to find its way and still ensure local access.\nThe whole part of the better buses restart program was to allow us to implement projects before all of the traffic came back so that we would be doing this monitoring instead of a lot of intense upfront studies like the kinds that we may have done on 14th street.\nSo, that's where this monitoring comes in and where, if we're, if we end up a bus way and those traffic restrictions, are a pilot where we could actually study how those things are working as it goes along and make adjustments as we needed to okay.\nIt's something we're working on thanks next question: DOT is expected to come back next month with a final design, was not the busway supposed to be installed this summer and should not something be implemented before traffic comes back?\nYou, know, stakeholders throughout this corridor and beyond, who had legitimate questions and concerns, and it's certainly been beneficial to us and to our teams at DOT to be able to hear those questions, and you know, try to work through them to make sure that we are implementing the best possible proposal for Fifth Avenue, And, you know, I, think the inclusion of a complete street plan is a worthy inclusion and it's certainly taken some time to do some of that engineering.\nWe've learned a lot since we put out the initial barrels over the summer The next question, protected by lanes and bus lanes, would increase the number of people going through the area who might stop into busi.\nI. Do think that you know we we're absolutely looking at ways to improve bus service throughout the city.\nThose bus riders are very well represented, but we're happy to take any question comment feedback complaint from different community boards or residents throughout the city.\nSome of the data from one of our data partners called street light about how vehicles move along the corridor and that's helping us inform some of the traffic restriction, ideas that we're evaluating So we're still working on that I'm, not sure if you hear some of the symphony coming from the other room, but obviously Janet and Jennifer and Kimberly and others are going to remain online.\nRight now we are trying to get through a lot of the early planning stages meeting with the cab, making sure that the cross sections that we're working towards make sense- You know a little later in this process, but I think could be included in this plan and just to note that, generally, we have gotten a lot of requests for increased bike parking as buildings anticipate folks coming back to work on bike, so we are working on expanding our bike.\nI will say that we have added some camera enforcement on fifth avenue already and we will be looking to do more if we think that is a particular issue or concern, I mean, as you should know, pickups and drop- offs, are allowed in the bus lane.\n110,000 bus riders a day is a huge number of people that come to Fifth Avenue from all over the city, working in all kinds of jobs, and you know we are trying to make their commutes as easy as possible, encourage people to take public transportation.\nSo this complete street proposal is really trying to balance out all of the means of the corridor in the best way possible to make it work for everyone, thanks.\nWe present protected bike, lane projects, but just as a reminder when we implement those kinds of projects, we see safety benefits for everyone on the street.\nThe cab is evaluating, separated from the rest of the complete street proposal, so I think one of the challenges here is that we're looking to install a bike, lane, Be it temporary or permanent, and some pedestrian, space.\nWe work through some of the other concerns, we've heard and tried to just come up with the best plan for the bus as well feel free to add anything to that D.O.T. Okay, thanks next question is how will adding these painted lanes affect the black lives matter, Mural, currently painted on 5th Avenue?\nThat's part of what we'll bring back to the cab and to the Cb final question: If there will be polls and cameras and signage added all along Fifth, avenue, Dot wants to speak to visual corridors in general from a community board perspective.\nWe'll continue to try to do better and improve on this process as well, but with that we'll we'll wrap up this agenda item talking about Fifth avenue, thanks again to DOT and thanks again to all the members of the public who participated in it with that we'll go to what I believe should be much briefer sections of our meeting.\nIt was, and that's what's reflected in the second report that came out in May You know it shows it shows mixed opinions of how the corridor has worked for some people and not and not for others, and it's there's a lot of data in there about the public feedback.\nAre there, any sort of open or lingering questions for members of the committee that they'd like to direct to DOT at this point, perhaps relative to any questions that we might have brought up the last time we were discussing this with them feel free to raise your hand if you have a question: okay, not seeing any.\nThe cabs were acknowledgement that we could not do that same thing for these projects that we have been doing for 14th, street, and I think that the process that we've had for 14 through the boards and other means has been effective, and we can continue to take questions from the community through the board.\nWe do not have specific data on that Ej, but you know generally, traffic volumes right now are lower due to the pandemic, but if there are any questions about certain congested areas, we could take a look.\nRestaurants, program, bj, I, think you're speaking specifically about the open, streets."
        }
    }
}