{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB8",
            "channelId": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "title": "SLAC Committee Meeting 9.14.20",
            "publishDate": "2020-09-17",
            "shortDescription": "",
            "lengthSeconds": "0:47:42"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB8",
            "normalizedName": "Brooklyn Community Board 8",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 8",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "mbLNj58n5vo",
            "fillerWordCount": {
                "uh": 51,
                "um": 77
            },
            "readTimeFullTranscript": "21 min read",
            "readTimeSummary": "2 min read",
            "wordCountFullTranscript": {
                "motion": 24,
                "renewal": 21,
                "saunders": 16,
                "license": 13,
                "hours": 13,
                "vote": 10,
                "liquor": 10,
                "service": 10,
                "days": 9,
                "second": 8
            },
            "wordCountSummary": {
                "renewal": 7,
                "hours": 4,
                "service": 3,
                "motion": 3,
                "pm": 3,
                "license": 2,
                "clay": 2,
                "operating": 2,
                "bar": 2
            },
            "fullTranscript": "Committee that can help us keep notes. I believe that Mr weatherwax will be joining us late due to a family obligation. Could someone just track some notes and give me a heads up, so I can manage the meeting and document any outcomes. Mr saunders. Can you jump in? Do you have that opportunity? Sorry, you're muted, what position I'm doing I'm trying to get some paper. One second say that again, Mr saunders give me one second to get some paper all right. Thank you. Mr sanders for our non- vote for our committee members and our guests. First of all, let me just announce. I'm James, I'm the chair of the community board a liquor license inside Cafe, Review Committee, I'm joined by other members of our committee as well as a representative from our district office, and I believe there are a few applicants also on this teleconference call. I do believe this call is being this. Teleconference is being recorded for posterity purposes. We will also be taking hand notes with the support of Mr saunders in order to get started and to verify the forum. I just want to run through our new roster of members and just take a quick attendance. I'm going to be calling everybody's name for the sake of record keeping, but I can tell that many of them are not here yet but we'll start with Mr Cremoni Alice Er with Cameronia Allison Wayne Bailey, yeah, Gail, Branch, Muhammad, Miss Muhammad. I see her on the screen. Can you acknowledge your presence circle back to Miss Muhammad Miss Brown Sheryl Brown, Miss, Janet, Collins Miss Diane took just someone who's walking calling user 3:4. Can you mute your phone? Please? Okay! Thank you! Oh better! Yet you can just evict them from the meeting all right continuing on with the mom diane Duke diane Duke. I'm here thank you. Mr James Mr, James, Mr, Frazier, Mr, Oliver, Hart Yep. Thank you, Mr Robert, Roger, Myers, Robert, Puka, Mr, Brian saunders. Thank you, Meredith Staton, Mark Thurton! Thank you! Robert Witherwax Deborah Young. Yes, here James I'm here this is Gail and I'm here, oh great hi Gail with 11 member presents, I determined that we have a quorum all right so moving along we're competing tonight to discuss a few new sorry to discuss a few renewal applications as well as a new application for 628 nostrada. If I can just take a quick head count to see who's here on a call for applicants, I will call by the address 100 Kingston Avenue from 300K hi. Thank you. I keep losing my other page. Apologies. 535 Carlton, I know, is here. Thank you, 625 vanderbilt or sorry, 624, vanderbilt, 1011, Dean, Street, hi, studio you're, here still really tedious. Yes, sorry thank you and finally, 667 franklin and the new applicant being 628 nostrils. All right looks like we have a couple applicants here, so we're going to get started. I will start with with Brooklyn clay with our friends. It's Miss Jennifer Owebrick and Laura Vogel. Thank you. We won the lotto thanks for joining us for the sake of record, I'm going to read your renewal application in for the benefit of those that are not viewing it. I will also let me just go ahead and forward this to the rest of my committee. My favorite one, I think Cbh all right, all right, so Miss, Weberick and Miss Vogel are here for the application of renewal. Brooklyn play llc doing business with Brooklyn clay at 535, Carlton Avenue operating hours, our team attempting operating as an art center with a vet space, inclusive of a restaurant bar two tables with five seats. Again hours of Operatio Maximum pack capacity is 100. Again. Hours of operation are 10 to 10:7 days a week. No current outdoor service on the application, no sounds and music programming, two service employees and cameras and automated door locks on the establishment. 275 residents in the building, no operational changes implemented. No operational changes planned right. Is there? Are there any questions about this application from committee member or from any? I do not see any community members. Oh, I do see a couple. Hi Mr atkins any questions from any community members on the renewal application proposed from Brooklyn clay, any questions or comments from any committee members on this episode. Jennifer is also present. Hi, miss collins, hi. All right, if you can mute yourself and not talk, that would be great. Thank you any other questions or comments. I'm trying to track the hand raising as well as in the since I'm flying solo on this right now for posting, I'm sorry for a renewal. Yes, hey Mr Myers! I just saw you pop in and we did do the posting two weeks ago and it's still up. I make a motion that we accept the applications renewal. I have a motion. I have a motion for Mr Bailey, a second from Mr saunders, any questions or comments on the motion right, so Mr saunders, I'm going to call these names from the roster. If you can just keep tabs on their votes, so we can have a record of it. I'd appreciate your help. All right so ceremony, Allison Clay Bailey, yes, Gail branch, Muhammad! Thank you! Cheryl Brown, Cheryl, Brown, yeah, Miss, Collins, miss collins. Yes, can you hear me now? Can you hear me now? Yes, ma'am? Yes, thank you. Thank you giant! Diane! Yes, can I ask that Miss? Listen, that's good! Miss collins! Yeah! Can you beat yourself it's helping with the echo oh James Ellis I'll vote? Yes, Fred frazier, Oliver Hart, yes, Roger Myers, yes, Robert, Puka, Brian, Saunders, Meredith, Staton, Mark Thurton! Thank you, ethel Tyus! Yes, thank you! Mr Gibb Faconi! Yes, here's the weatherspoon! Yes, Robert wither wax every young Miss young, I'm coming! Yes, I'm sorry! Thank you. Motion passes unanimous unanimously. This application and suggestion for support will be pushed forward to the full board and at the at the September, full board monthly meeting the option for the board to ratify the committee's decision will stand. Miss George. Can you share with us the information at least the date and time of the full community board meeting. That's next scheduled. Give me one second, give me one. Second, thank you thanks. So much guys yeah, I just hold tight and we'll get you the next date. The next meeting is October 8th. All right, that'll, be most likely by telezoom, yes, via web app by 6:15 is usually the start time on this yeah, all right, all right, Miss, Jennifer and Laura. Thank you guys for joining us by zoom. You're welcome to continue listening in, but obviously I know running a business takes place. Yeah. Thank you. So much have a wonderful evening, good night. All right. Thank you. Next item on the agenda is the renewal for 100 Kingston Avenue Kingston Public House hi, there Mr Bill, yes, hi there, I'm going to take one second and try to pull up the information gotcha all right. So I'm going to read out this, but in order for me to do so, I need to make sure miss build there. You go you muted. It helps yeah for some reason. If there's another Mic live Mic when talking, it seems to echo. So I'm just going to out of respect for the facility of this call. Let's just keep asking everybody to stay muted until they need to speed, but I'm going to try to run through Mr Bill and I'm looking at the name. Is it prejud his application for Kingston Public House Llc at 100, Kingston Avenue time operating is 21 months as a sorry, are you considered a restaurant bar boiling water yeah with a liquor wine? Beer cider license four tables four seats. One bar with eight seats, and now I got ta figure out the order of this application because it came in pieces. All right so looks like our patron capacity is 50 to 60 hours of operation or Sunday, 3 P.M to midnight, Monday, Tuesday, Wednesday, 3, P.M to 2 A.M, Thursday, Friday, Saturday, 3, P.M to 4 A.M, no outdoor service area. No, no outdoor service area number two: three service employees, zero security, but alarm system and closed caption television, two residents in the building two on each side, no operation changes planned no operation, changes made all right looks like that's the application. Is there anything? Does any community members have any questions or comments about this application? One second, I'm checking hands raised as well as anybody, I'm muting any questions. I can't see my hand down. What's that I can't get my hand down. I do not see your hands. Do you have a comment? Miss Tyus, I'm just wondering if our renewals are taking advantage of the opportunity to have tables outside that's right tables outside Mr of Pritchett Curbside set up, which was approved by the city. All right, my curbside in the parking lane yeah sidewalk in the front of the sidewalk, is just a small space in front of the lounge, but then right on the street yeah. We have the right in front of the venue all right, yeah any questions or comments from our committee members. What's your dress again, please 100 kingston, oven under Kingston Avenue, any other questions. Any other questions this dude. Can you meet yourself? I do not think it is. Thank you all right. Seeing our hearing, no questions or comments, may I get a motion please. I make a motion that we accept the application for renewal I'll second by it, Bailey second, by Mr saunders. Any questions on the motion. Check of the chat check in for hand raised all right. I will call the vote your money, I'm going to go. If I, if I overlook you on the roster, let me know I'm just going to try to eliminate some of the non- present names. Wayne, Bailey and Bailey yeah, she's, muted. All right! No vote, no vote. That's yes! Miss Dude! Yes, Great James Ellis! Yes, Fred frase, your Oliver heart, yes, Roger Myers! Thank you! Brian sanders! Mr saunders. Can you remember please thank you mark certain? Yes, I did not hear you called Janet Collins. I'm sorry, Ms Collins I'll record your vote now. Yes, thank you. Apologies for the oversight give Viconi. Yes, here's the weatherspoon, yes Deborah young! Yes, all right Adam passes unanimously. Thank you. Mr Bill, Pritchett and October 8th will be the full board meeting I'll ratify this committee's vote for support. So much. Thank you. Ladies and gentlemen. I appreciate it. Thank you next item. I do not have any other paperwork except for Kai studio. So let's jump to 1011 Dean Street, it's Miss Kimmy Murphy's on the phone. Can you hear me hi? Yes, thank you, okay and please identify yourself again hold on one moment. I'm sorry. Can you hear me now? Yes, okay, what was the question? I'm sorry, I'm just. Can you identify your first and last name just for our record Kimmy Murphy, all right! We just do not have any visuals, so we just want to confirm that you're representing this establishment. So, as I read this application, excuse me: Miss, Kimmy Murphy is here for vision. 2 reality designs incorporated doing businesses kai studio at 1011, Dean Street. How long have you been operation here? Miss Murphy, going on 13 years, 13 years, all right, the application, the application was just. It was an incorrect er. The response was not great. Is it a catering haul and your license for your license? That you've been serving off of? Is a beer and wine or a liquor? Beer, Wine, Liquor beer wine, all right! That was not indicated on your application. 14 tables 12 seats, one bar yeah, this I'm sorry, Ms Murphy. This application does not have a lot indicated, there's a lot of blanks. What are your hours of operation on what days of the week so we do not have any set hours per se. We are only open when we are booked right, but according to your SLA application and your license that you have for the last 13 years, you're permitted to be operating under what days and what hours right. So previously, every two years we seem to be going through the same thing. It's really hard. The application does not apply too much to event space spaces. So it's really hard. We made an error two years ago by putting, I think it was seven pm to two A.M and we really put ourselves in like this box and which was incorrect. Technically we if, when we are booked, we are generally open. It could be anywhere from a day event or it could be from 12 P.M to a five- hour, booking or and or 10 p.m, to 4:00 A.M. So it varies. So it's really hard to say what our hours are. We are not a restaurant, miss Murphy, let me just interject here, but what is what your application that you have with the state liquor authority on your application on your license? It indicates what your service hours and days are okay document on your license. I just wanted to know to indicate that what do you have listed there I do not your application is blank. Okay, no, I mean on the liquor license from two years ago. I do not have that liquor license physical visual of that. So on the application, I indicated a rough range of the hours that we would be in operations if we were booked catch it and is that the 12- 4 that I see indicated correct all right and that's seven days a week correct and are you currently legal? Are you currently allowed by the SLA to operate under those hours? Yes, thank you. That's what I was just trying to determine what was it what's been happening in the past versus what we're seeing today, all right so for clarity for the rest of our committee. They are permitted by the SLA for twelve to four seven days a week, twelve pm to four am seven days a week. They have a capacity of 287 people. Four speakers, two thousand watts on the main floor live and entertainment, is offered on occasion, four service employees, two security personnel, zero residences in the building. Three to the right three to the left: zero Sorry, three to the right, zero to the left, zero to the rear. No operational changes have been implemented. No operational changes are planned. Are there any questions or comments on the renewal of 1011 Dean Street from any of our community members that are on this call with us today, hi Mr Weatherwise, I'm happy that you joined us. Thank you. I do not see really any community members, except for Mr Atkins, all right any questions or comments from our community committee members hearing or seeing no question quick question: are they set up right now for events in terms of social distancing at their studios? At the moment, if people want to rent it out right now, miss Murphy, as per as her governor Cuomo, we are not permitted to do so. We can not right now. Currently we are closed. We've been closed from since March until possibly the end of this month with 25. Maybe that's right, possibly, yes, okay, I mean we're lost enough to accommodate 25. Yes, okay, because I was asking because I know groups who are looking for space and I wanted to at least recommend that at least your location could be an option, so they'll probably call depending on what time frame their event is possibly post the end of this month. So thank you for that answer. My pleasure. Thank you. Thank you. Mr Myers, thank you. Miss Murphy, any other questions from our committee members, they're saying yes, remote, oh hi, Mr, thirteen, sorry, Mr, Thurman, you're really breaking up. I do not know if you can try again or you want to put any attacks. Oh great, thank you! We do not. They are not. They are not operating with any outdoor space. James! All right! Yes, no question comment: it's a lovely venue, good management and I think that again, she's done a lot of things for the community, so I highly recommend Kai studios. Is this the motion you'd like to make Mr Muhammad? Yes, it is. I make a motion to accept the application as presented. Thank you miss muhammad. I have a motion. Is there a second? Yes I'll all right for the record? I'll accept Miss Debra Young as a second first by Ms Mohammed. Any questions on the motion. All right well been called the brawl here. I need Miss Diane Duke to meet Diane dude to me. Thank you. Go ahead, Mr Wax! Can you hear me? Yes, Sir? Okay, yes, not knowing who's there! So forgive me Mr Allison, Mr, Bailey, yes, Thomas, Branch mohamed, given a call Mr, Miss, Brown, Miss collins, no, miss duke yes, duke, yes, Mr Ellis, yes, Mr Frazier, Mr Hart, yes, Mr Myers, Miss Collins! Can you meet Excel, please Mr Puka? Yes, okay, Mr saunders! Yes, I heard Mr Poca. I have Mr saunders, Mr, Stark, sorry, Mr Witherwax! I do not think Mr Puke is on the call so that might have been okay, so you started with Mr Myers. You got his. You recorded his vote, yep all right and then Mr Puka just to confirm. I had mister and there was no Mr pogba. Then I have Mr saunders who said yes and then Mr Staton Mr Thurton. That was a yes thank you, Mr! Verconi! Sorry, you forgot Ms Tyus Ethel highest! Thank you Mr Viconi! Yes, that's what we spoon- yes, Mr wither abstain, just because I was late. Miss young, yes, motion passes 11 in favor. One opposed one abstention. Thank you Mr Wax and thank you miss Murphy. I appreciate you being on this call with us. Thank you all right now continuing on. According to our agenda, we're also supposed to be hearing from 6627 franklin. What we do not have any application materials for, and that is saint ends, which I believe is down by Saint Mark's and also 624 vanderbilt for Amarino Kagina Aristotle, but I have no paperwork for either of those applications. Does the committee have any suggestions for recommendations? Mr, Ellis, I'd like to bring in information I gathered at this afternoon's borough. Consultation for the community boards was that route give Ms Taya, so one second is that in reference to either of these applications, no okay, one! Second! Let me we'll circle back to your new announcements. Mr Myers. Can you unshare your screen a high dentist, Miss George? Can you take away that content? I do not know if you have that ability. I am working on it. I do not know what just happened. I can't see it nice photo yeah. Are there any recommendations for the two renewals that are on our agenda that we do not have participants or applications for? If there are no prior records of problems, I suggest we consider supporting them locations. Sorry, I thought I heard you say James that they're new applications there's one new one, but we also do not have their paperwork either. I would second miss Tyus's motion to approve a marina and Saint ends, since neither have had any prior problems. All right looks like all right. It looks like Mr. Whitman are the dates the times the opening days? Is it okay, the dates the time that they are before opening miss dude? We do not have any people. We do not have any paperwork- okay, sorry, okay, yeah! We can't make that. I do not know. I do not know the answer, but renewals are contingent upon renewing. At the same, they can't change things up on a renewal, Mr Myers. Can you stop sharing content? Evidently, you ended up sharing content on the screen and you're back in the screen. Thank you all right, thank you, for that makes it so much easier to go. Navigate sit in the room now, all right. I have a motion by Mr Witherwax support the renewal for St Ends and the renewal for Amarino. Is there a second to this motion, a second by Mr Bailey? Any questions on this motion being made double checking any hands raised all right. Please call the vote. Mr Weatherwax! I will, but just to answer Miss Duke's question. I do not have the hours for Amarina, but I do have the hours for saint ends. They close at 2 am every day they have 70 seats. They have a rear yard that closes at 10 p.m for usual requirements, but we do not know how many outdoor seats they have all right. I have. I have unfounded information that there you're serving in the rear yard until 4 am well. That certainly is beyond the scope of what we approved all right. We want to amend the motion to be explicit. I would feel more comfortable in doing so until we have clarity on their use of their rear yard. All right, let's, I will accept a friendly amendment to the motion that renewal is approval, content upon the rear yard hours of operation, where service ceases by 10 pm Sunday through Thursday, 11, pm, Friday and Saturday, and then I'll. Let Mr saunders. Ask this question. I believe it's who it was go ahead: Mr saunders! What time is the outside sidewalk supposed to close, so open streets and open dining are limited till 11 P.M daily, but there is some. There is some uncertainty or there is some about private property being used to the extent of their liquor, license application and permit. So there are some establishments that I believe can operate in rear yards past the 11 o'clock hour. As long as it's been permitted on their liquor license the sidewalk. That's why I work there. So sidewalk in public space would be 11 pm. It would cease all service according to the executive order by the state. Is that does that satisfy your question? Mr saunders? Okay, thank you. Any other questions on the motion, all right hearing or seeing no indications of questions or comments. I'll ask Mr Whetherworks to call the vote. Please, with me seem to have lost my hold on here. It is yeah. The motion was to support the renewal arena support the renewal for St ends with an explicit contingent that its rear yard service stops at 10 pm Sunday through Thursday and 11 pm, Friday and Saturday all right carry on this woodworks Kermony Allison Wayne Bailey, yes, Mohammed! No! Thank you! Miss Carl! Thank you. Yes, thank you. Miss Duke, Mr Ellis. Yes, thank you. Mr Ellis, Mr, Frazier, Mr Hart. Yes, thank you. Mr heart Mr Reiners, Mr, Myers, Mr Myers! Yes, can you hear me? Thank you. Thank you. Mr Myers Mr Saunders, Mr saunders. Yes, thank you. Mr saunders, Miss Tyus welcome back to Miss Diaz Mr Thurton. Yes, thank you. Mr Thurton, Miss Tyus! Yes, thank you. Miss Tyus, Mr Bocconi! Yes, thank you. Mr Verconi, Miss Weatherspoon! Yes, thank you. Miss Weatherspoon, Mr Winterwax! Yes, thank you. Mr wither! Yes, how the motion passes 12 in favor, one opposed. Thank you. Mr weatherwax for the roll call that moves on to our other go ahead. I'm just going to have to hop off in two minutes. So all right! Well, I'm going to wrap this here and then we'll let miss ties make her announcement, I'm going to make a motion to table the item: training, credit girl, West, indian cuisine at 628, Nostrada avenue due to the lack failure here and the lack of paperwork. You get a second on that motion I'll. Second it thank you. Thank you, Mr weatherwax. Do we need to take a full roll vote, not on a table? Thank you all right. So that clears our agenda. I appreciate everybody's patience in dealing with the technology gaps and confusion, as well as the paperwork and applications that seem to. We only got in part, I guess due to lack of applicants submitting and miss pious if you'd like to share with us some new knowledge that you wanted to share I'll, give you the floor. Thank you very much this afternoon, a borough consultation on citywide wide budget. They revisited the concept of a virtual rat academy, given that the sanitation commissioner has retired, resigned and tends to run for mayor. I want everyone to know, especially if you're in business that should be looking at the fact that they will not be picking up commercial strips the way sanitation will not be picking up on regular schedule. So, in order to prevent the rats from taking over, we should be paying attention to ways that can be managed. That's it any other new business or old business that any of the committee members would like to present tonight. Yes James. This is Gail Michael, Hi, Crown, Heights, North Association, and with the help also of Mark Thurton we're working with some of the businesses on Northern Avenue, the bars and restaurants, and we've planned an event for a taste of nostran on October, 10th and 11th, and we're reading we're meeting with them again. Tomorrow we have four businesses that have committed to take part in the event, and the businesses are starting, a organization of working on an organization called invar which no stream bar and that will be taking place on the 10th and the 11th of October. That's great, miss Muhammad! Thank you for sharing that information. As soon as you have any marketing materials we'll. If you want to distribute that to our listserv as well as to the board office, I'm sure we'll be able to distribute that more widely. Once it's there. Okay, I appreciate it yeah Mr Ellis. I had just one item. Okay, as I came in late, maybe this was covered, but there are a couple other renewals that are up at the end of September that I do not know if they were not on the agenda for tonight. So I just wanted to address that. Please yeah, please enter those names, so we know what they're in their record, cheryl's global soul, food mayfield. What was the third one? Sweet, 704, no okay, this one gotcha all right! Well, interestingly enough cheryl, so you said: Cheryl's, global soul, mayfield and suite 704 according to our records, are up for renewal but did not present today. James. Can I add to that suite 704 is one of the businesses that was cited for violations because of serving inside as well as no face masks on employees. Thank you for sharing that. So I'm not sure what has happened. You know if they've been able to go to the SLA to deal with that issue, but I do know that they were one of the organizations that are restaurant bars that have been cited yeah. They were in operations as a Friday when I was on Nostrand Avenue, just as a side, so it seems like they might have gotten most everything cleared since that enforcement issue. Okay, okay! Well, I do not know unless mister I think Mr Williams has stepped back, because you know I have to continue some family obligations, but the knowledge that those three that are up for renewal we'll just maybe we can request the board office to communicate with them and remind them that they were up for renewal. I do not know if that's what the general process is there. They did not show all right any other business hearing or seeing Noah hi go ahead. Can I ask a quick question: was trinity girl supposed to renew and did not present any paperwork? Trinity girl is a new application to us new application. Okay, that's what I was trying to figure out, because I know- or I thought they had filed or attempted to file last year, but the address and them opening up recently and I saw that they promoted liquor on their side, had me question when they either filed or were they filing now yeah? It appears, according to our understanding, this would have been a new application and that's why they were put on the agenda for a new one, but we did not receive any paperwork and obviously they're not here today with us on this call. So as it stands it's been tabled and when they show up, they can have us review their application. Okay, should they will they be tabled until next month? In essence, or I mean I think, that's up that's entirely up to them, communicating with the board office if they're prepared or not to be on that okay understood. Thank you. That's correct, Mr Ellis. They sent the 30-day notice, but never submitted any paperwork. Okay, and can I get it? What can you explain me what the protocol might be for those three establishments that we have? According to our database that we're up for renewal for this, we do not. We do not typically reach out to establishments that are up for renewal, because one we do not know their situation, they normally reach out to us. So we wait for them, because we have businesses open and closed all the time. So we do not reach out to those businesses, so we it's usually up to them to reach out to us prior 30 days prior to applying for their liquor license. So what SLA does two months before the license expires? The SLA sends out the notice of renewal, so they get ample time all right. Thank you thanks for that. All right last call for any questions or comments. New business or old, all right hearing or seeing none at 701 I'd make a motion to join this meeting. Thank you all. I appreciate your patience again today. Thanks for joining us on this and helping us create and maintain a quorum to do our business, I will we'll move all these action items over to the full board meeting on October. I believe it's eight because George shared with us and until I see you all or talk to you all again have a great day. Thank you. James.",
            "summary": "I'm James, I'm, the chair of the community board, a liquor license inside Cafe, Review, Committee , I'm joined by other members of our committee, as well as a representative from our district, office, and I.\nWe won the lotto thanks for joining us for the sake of record, I'm, going to read your renewal application in for the benefit of those that are not viewing it.\nBrooklyn play llc doing business with Brooklyn clay at 535, Carlton Avenue operating hours, our team attempting operating as an art center with a vet space, inclusive of a restaurant bar two tables with five seats.\nHi Mr atkins any questions from any community members on the renewal application proposed from Brooklyn clay, any questions or comments from any committee members on this episode.\nThis application and suggestion for support will be pushed forward to the full board and at the at the September, full board monthly meeting the option for the board to ratify the committee's decision will stand.\nNext item on the agenda is the renewal for 100 Kingston Avenue Kingston Public House Hi there, I'm, going to take one second and try to pull up the information.\nIt prejud his application for Kingston Public House Llc at 100, Kingston Avenue time operating is 21 months as a sorry.\nAll right so looks like our patron capacity is 50 to 60 hours of operation or Sunday, 3 P.M to midnight, Monday, Tuesday, Wednesday, 3, P.M to 2 A.M, Thursday, Friday, Saturday, 3, P.M to 4 A.M, no outdoor service, area.\nDoes any community members have any questions or comments about this application?\nI make a motion that we accept the application for renewal I'll second by it, Bailey second, by Mr, saunders.\n12 seats, one bar This application does not have a lot indicated We are only open when we are booked right, but according to your SLA application and your license that you have for the last 13 years, you're permitted to be operating under what days and what hours right.\nAre there any questions or comments on the renewal of 1011 Dean Street from any of our community members that are on this call with us.\nAll, right, let's, I will accept a friendly amendment to the motion that renewal is approval, content upon the rear yard hours of operation, where service ceases by 10 pm.\nSupport the renewal for St ends with an explicit contingent that its rear yard service stops at 10 pm Sunday through Thursday and 11 pm, Friday and Saturday And, then we'll let miss ties, make her announcement, I'm going to make a motion to table the item: training, credit, girl, West, indian cuisine at 628, Nostrada avenue due to the lack failure here and the lack of paperwork."
        }
    }
}