{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CB 3 Manhattan - Parks",
            "publishDate": "2020-04-14",
            "shortDescription": "Agenda\\n\\n1.    Approval of previous month's minutes\\n2.    Parks presentation:  proposed plan for the renovation of the Tompkins Square Park field house, including restrooms\\n3.    Vote to adjourn"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 9,
            "um": 8
        },
        "wordCountFullTranscript": {
            "room": 58,
            "space": 54,
            "building": 54,
            "people": 41,
            "slide": 36,
            "area": 36,
            "parks": 30,
            "community": 28,
            "question": 24,
            "project": 21
        },
        "wordCountSummary": {
            "space": 15,
            "community": 12,
            "room": 11,
            "building": 10,
            "parks": 9,
            "area": 7,
            "fact": 5,
            "park": 5,
            "members": 4,
            "edge": 4
        },
        "fullTranscript": "And unmute and star nine to raise your hand so I'm now star six to unmute and mute okay. So am I muted right now I'm talking right, okay, the folks that are online. If you're, not a community board member, we're gonna, ask you just to type your name into the chat field so that we can have attendance that way we are recording this meeting and the video and the chat box gets recorded. So those of you who are not community board members- just please type your name into the chat field: hello, hey your how's! It going guys. Okay, you're gonna, give a few minutes. This is a new format to get everybody to sign in via this zoom meeting again for anyone who might have just joined us. If you are not a community board member, we're asking that you just type your name into the chat box, that's how we're going to be taking attendance for non community board members. Also, we are recording this meeting so just be aware of that Ryan are you on wine is on I? Believe you know, I'm just trying to get hurt can I ask the person with the three four seven phone number that ends in eight to nine. Just to let us know who you are so that we can know if it's a board member or a community member Jamel Phillips, a district three manager for parks he's doing good. Hello am I on here good morning. Everyone I think so we're just going to ask everyone to keep themselves muted until it's your time to talk so that we can decrease on the amount of background noise and again just a reminder. We are recording this meeting and if you've just joined us, if you're, not a member of the community board, if you can just type your name into the chat box, that's how we're taking attendance in lieu of you signing in the sign-in sheet, which we would do at an in-person meeting, can I ask the person with the 3 for 7 phone number that ends in 798 just to identify yourself so that we know who you are. Thank you for those of. You are joining us on the telephone, using the telephone for your audio, it's star, six, to mute or unmute yourself and it's star nine. To raise your hand all right. We're gonna start in a couple of minutes, I sort of verify that I'm just looking at the list of folks. It's here Brian can you meet yourself? That's appreciate the fact that you're gonna take minutes during this I know it's gonna be a bit of a challenge. Luckily, we only have one agenda item we have denies, but one agenda item note-taking as you Michael. It said the temples or non-compete members is taken by the message feature. So there's no need to worry about that. But can you can you see everyone? That's I'm, seeing everybody's name except for no I know. I have everybody's name and I've done attendance. The only person I'm missing, I haven't seen yet is Kay, that's right, Kay, so she could not make it alright. So before we get into the agenda items, I just want to go over a couple of things and just to make this move meeting as efficient as we possibly can understand, the cameras live. So if you are have your camera on, we can see you so everything that you do. You can do that you do. We can also see some just be aware of that includes a you're gonna get up and leave, or, if you're going to do something we can see you if you need to do something, but please turn off your camera. Just like a regular meeting we'd like your attention, we're going to try and keep this as brief as possible. This is format for most of us, so we're not going to spend a lot of time a lot of issues, but you know we'd, like your attention for the full term of the meeting. We understand anyone's home and his issues and we have pets and children and family, but we should be able to get to this fairly quickly. I, like to thank Michael he's on production, he'll be handling most of the technical aspects of this. So if you need or have a question answered about the technical portion, Michaels running production and also to Ryan who's, taking notes for this meeting, our first parks and waterfront meeting some members of the public we're going to use the raise hand, feature to ask questions, and that will happen after the community board. Members have asked the questions. I, don't see that many folks from that are not community board members, so I anticipate we'll be able to get through all your questions. That being said, Ryan do you want to go ahead? I'm going to have you take attendance? This is a vote on. It would be February's minutes because we do not meet in March I know everyone read them and memorized them, so we're gonna go ahead and vote on approval of those minutes and Michael said best way to do. This, I would suggest, since we're a relatively small committee, that we possibly do it as a roll call vote, so the person's name can be called, and then they can just unmute themselves, say yay or nay, and then we can sell us again: okay, Brian! You want to go ahead and do that: Trevor Holland, yes, okay, Webster, David, Adams, yes, you're on Altman, hey, yay, Carlin Chan, yes, Ryan Gilliam, yes, palutena Jones, yes, Michael Moreno, yes, Carolyn Ratcliffe, yes, Robin, Chatel, yes, Josephine, Aviles, Josephina I, know she's wrong. You're on now we hear you, okay, I'm gonna, unmute myself, now I'm here great and you vote YES on the minutes. You're talking to me. Yes, great all right. The next thing I just want to read something that arc sets, are actually from wolves from parks and DDC. Just a statement as to what's going on with the eser project, and it's going to be directly from what they sent to us. Ddc does not have major updates to report on eser this month. Despite the corona virus crisis, DC has been able to keep up the ESC our program on schedule and is currently on time and moving towards procurement and contract specification review phase. Since the city committed to deferring the relatively small early works package and compressor relocation to the fall, no major construction activities will be taking place is spring. We will keep you posted in the near term as conditions or project developments arise. We appreciate your understanding during these unprecedented times. I look forward to continuing our working relationship. That's all we have for ESC our there's, no more updates. We will probably get a more robust update next month, but that's where we stand with the ESC our program. There shouldn't be any questions about that cuz! That's all we really have next is a presentation from parks and I, see a couple of RC Raymond from I. Think Raymond from parks. Jorge is giving the presentation, I guess get presentation yeah. He has poor cohost ability now right. Michael are we gonna share the screen after he began, so let's give him a chance to introduce himself hi everybody, I'm Jorge Prado, the director of architecture at Parks, Raymond young, is also present. He's manager for this particular project it will be presenting tonight doing tonight is the Hopkins Square, Park, Fieldhouse or comfort station. It's a reconstruction and I. Don't know if a certain that I'm showing you my screen or are you going to put the presentation up on your school? We can do either way if you, if you have it on your screen already, you can share your screen or I can share mine. Whatever is easier for you, I'm not a master of this. So if I just put my screen up and then click on the green button do my screen, you can just tell me when they scroll down for the next slide, hi Michael. This is David, Adams I! Think if you go onto you with on the what Trevor sent us there's a you, can we can get this papers and from the that they sent into the community board from the email you, following on your own computer, on the separate screen with something yeah? We did link the presentation to the meeting information on the community board website. So if my screen is Beshear announced or everybody should be able to see the presentation, but if you want to open it yourself or look at it later, it is linked on our website. Okay, I'm shooting well for that bye. So this is the presentation. I guess: I'll get started. A spare park pass reconstruction. Everybody knows where it's located in Arkansas, the northern edge of the drive through the budget is 6 million from the mayor's office, and the project is roughly 2,300 square feet next slide, please I'm, sorry yeah, so the goals of the project are to upgrade the existing restrooms to bring them up to Toronto such great parks, maintenance of operation, space at the first day left card, locker room spaces to the building reconstructing interiors, which in this case, are for back and space to clean and partially report the exterior brick to do new windows and door as required and utilities, including an oil to gas conversion. Next slide, please. We know where we're located we're in Manhattan we're in Tompkins Square Park we're on the northern edge of the drive for you as I said next slide. Please, we are not in a flood hazard zone next slide, please we're surrounded by a rather tight mixed-use and residential buildings. Next slide, please, we are within I'll attend me at walking distance from a number of other facilities around sarony, Roosevelt, Park and then so on. Some of these parks have facilities most of the parks. Don't have the expensive facilities that confiscate Park has therefore we're happy to be taking this project on at this point next slide, please. This is an aerial shot, giving you a sense of where the field house is. The field house is obviously the collimated building, that is the entryway to the to the spray showers and the court. You are beyond next slide, please. This is the current tree to Moodle plan you'll notice, there's one tree removal due to design considerations and when the tree removal, due to a poor condition, a few trees be removed, both of which are in bad condition. One of them is into the left edge of the building in the slide next slide, please, these are just some general elevation views to the building trying to capture the entire front elevation on both photographs next slide- and these are all this is still the front elevation of the building just for the two bays on either side of Volusia next slide, please. This is the enclosed fenced-in area on the East Road building. This will be removed, I've cleaned up considerably during this project. Next slide, please. These are views inside the loggia. We will be doing some work in here to clean up the facility, and these are the reveal the rear views of the loggia and the access with the slopes of memorial, fountain behind or I should say in front of us and the link. Is there please more just to context photographs showing the boys and girls rooms next slide? Please, and this is a basic roof of the building as it exists now we're pointing out the thing a ramp is not a BA compliant. Currently, it's too short, it doesn't have a good intermediate landing and it doesn't have necessarily curbs next slide please. So this is the roof plan. With some of the proposed work we'll be putting some existing antenna will be remaining we'll, be putting some penetrations for new events as required to achieve the reconfiguration inside we'll be doing a new ABA app, which will see closer later at the rear of the. This will be a they switchback ramp to allow for the full ad, a compliant slope requirements and for the intermediate landings next slide please. So this is the existing ground floor plan. Two bathrooms on the left, the women's bathrooms on the right: okay, maybe it's backwards, you'll also notice. There is office space and locker room space on the left or western leave of the building and the eastern building there's an office space and there's also a mechanical space with the stair wrapping around it and in the center of course, is the loggia, and this is the existing concrete ramp that we are addressing in this project as well. Next slide, please! So this is the proposed plan and we've both plans on one slide, so you can see them side-by-side, but we were asked to make the plans larger, so we've had to put each slide on individual slides. It's not as easy for you to see in the differences we might flip back and forth a couple of times to show you but I'll just tell you what some of the obvious differences are. If you notice on this plan, the new men's entrance on the left to the furthest western edge of the building and the new women's entries on the right is the furthest eastern end of the eastern wing of the building. These two instances are essentially being relocated if you flip back the slide one more time, you'll notice that the current configuration show is the man's edge it's tucked in next to the office space and the women's actions based on the eastern wing. We're sliding those entrance just out to allow us to reach phase 2 program inside the building slide forward. Please so now you where the many entry door was and where the woman's that's the door were. Originally. These are now interior spaces on the west wing of the building. This will be now the reconfigured locker room for the MMO staff that operate out of this facility and also that operate within the area of the facility. There will be a bathroom. There is currently a reconfiguration every existing bath, turning the door towards the locker room, the men's room will be the same number of stalls. Last synced switch back to the previous, so this one has three toilets and three and four stinks. If you switch forward, we are compressing it a little bit, so we now have one hard baby, a stall which is compliant. We still have two sinks, not four. We have two urinals and three toilets and the man is persons who are losing two sinks but we're gaining an 88 compliant bathroom, which is the goal of the project. The same condition is exactly the duplicated of the women's wing to the right. You'll see that the doorway has been shifted. There is now additional space in there for the lifeguard locker room, you'll notice that I used to be mechanical room, which is just adjacent to the new ad, a ramp that interior space is no longer mechanical space to be a first name office first name room the office below that would be more or less than the same configuration whose value is smaller and the boys and girls rooms. If you switch back to the previous slide, you'll see the in the boys room, you have two stalls, two urinals two sinks and in the girls room you have three stalls and to stink, I mean four stalls and two sinks switch forward. Now, even those that these numbers stay the same to a very measure. I think we use one stall, one stall in each bathroom, but we gain an 88 stall and you'll also notice. If you go back to the previous slide, where there used to be an adjoining stair between the boys room and that intermediate utility room and between the girls room and that intermediate utility room we have now eliminated the stair, we've tried to infect a level this area. So if you go forward, you'll notice that there is now a janitor's closet within each bathroom, and so those janitors closets will be used by staff to maintain them. In fact, each bathroom room now has its own janitor's closet will allow for to avoid having to move mops and move things around the building perimeter as we're washing other spaces. This way staff can sort of walk into the bathroom. The bathroom leave their materials, their door, the next one and so on, and so on, without seriously impacting the public's use of the building. You'll also notice that in the western wing of the building, the half room space is now for open space, which is sort of a larger sort of open, muster space that allows for parts of staff. You know and other people to come in and to essentially muster in the morning and to have meetings as required to maintain the property and its rightful place. You'll notice, the same assisters space on the East Wing again is the first aid station and the rural office space and the down stair to the mechanical room in the basement. You'll also notice that the loggia remains mostly the same, except to make it compliant. We introduced the switchback stair, which will obviously impact some of the still of the steps that used to go up. If you go back, one slide, you'll notice here that the existing concrete ramp only took one day of the loggia, and you had the continuous steps that ran across the back of the loader you'll notice that if you move forward, one will lose those steps and we'll put the switchbacks clear that area so we'll essentially occupy three Bay's of the loggia space. On the unoccupied area, where the steps will remain in, we have to introduce handrails so we'll put in handrails in place there. This configuration may or may not change slightly depending on whether we can get away with just using one handrail per day as it were, but the distance is ability, but essentially that's the major change here that wrapping their back now it's compliant. We had to go to this switchbacks there as a way to impeding circulation between the slopes of memorial, fountain and the ramp itself. If you go back, one slide, you'll see here that the area between the ramp blow to Memorial is actually quite tight, and so we didn't really feel that was an appropriate use of space and it was, it was cutting off circulation, east and west across the back of the building. Go forward. One slide, please so we're able to recapture some of that circulation space and that's going to be important for us, because, as we get further into the presentation, you'll see how we modify and the fencing on the eastern edge of the building to allow for more circulation. And so we wanted to make sure that we were so reestablishing that the circulation corridor back here we can move forward one slide, so this is kind of a larger version of the plan. It's just compressed me cut the load budget out. So here you can see more clearly the conditions and mediation things we were discussing a moment ago. I'll just go through them briefly again left to right: West Wing. We have the men's room with the door on the western edge of the building. There is a slight loss of fixtures here, with the loss of fixtures were gaining an ADA compliant restroom and we're allowing the main entry that used to go into that empty vestibule space to become a usable space for lockers for the M&O staff at opera. Out of this facility, the boys room in the back you'll notice, we've eliminated the stair when we captured that space as a janitor's closet. Again, we've provided an ad a which is pretty much what we have now a stall and nothing else has changed. Obviously these will be all new conditions. If you look at the office space and the M&O wall storage area, this is now one open space, and this will allow for mustering of staff in mornings and during meeting hours, and also for the volunteer staff and seasonal staff, as required to the right of that you'll notice. The first aid room that we were talking about before that currently is a mechanical room. It has a lot of type suit that we're relocating to the cellar we were able to recapture this. At the request of the Life Guards to service the pool needs in season and you'll notice. The lifeguard locker room is just beneath that and there's also a lifeguard additional locker room storage to the right, where the old best of used to be usually you'll, see it's just a more flexible use of space. You created two locking areas for the light parts store their stuff and that's very critical. For them. The women's room is a mirror of the men's room, except here we have three toilet fixtures. You don't have any urinals. We have two sinks. This is our standard complement for most of our standard comfort stations. We have a janitor's closet, oh the girls rooms, again three and two, which is our standard, and we have a janitor's closet there as well for maintaining those spaces next slide, please. This is a slide whilst when we start to discuss some of those changes to the fenced in area, east of the building, which is quite an eyesore, has always been something we wanted to address. This is the perfect project to do stone, so the fences as they exist currently are in the top slide. You'll see that dotted line is a chain-link fence currently from the pool which is just off the top of the screen down to the building with a chain-link fence that turns a corner and closes off that entry to that rear garden area frogging the eastern portion of the park. All of that will be gone, there's also an 80-foot chain-link fence that runs between that changing fence and the front of the building and it sort of closes off the tree there. It's a nice length between its own little space with existing four-foot high steel fence around it not easily seeing here is, there's also an eight-foot tailing thanks at the southern edge of that enclosure, which is just behind a four-foot stings for my steel Spence that will be cleaned up as well, we'll be removing both of those and if you look below we'll be removing all the chain-link and all the 4-foot fences will miss the only one clean, 7-foot fence leaving access to that yard. Exactly as it currently is, with a small single man north from the western edge of the entry to the double flip garage doors, don't allow for vehicular access as a service part you'll notice that we are now taking the tree inside the 7-foot fence. We will protect the tree. Obviously the tree will remain, but that yard now is increasing slightly to the east, but it's decreasing from the north. So we're reestablishing the circulation corridor behind the building and the pool which is just north portions. They have just north of this plan. Fencing will remain the same, and the tourist set up every season of setting a table up there for security will be done in the same way in future. So we don't need to spend any changes there. It's a look! If you think we can come back to this as soon as we get through the presentation. Let's go to the next slide, please. So these are some elevations and we'll start to see here. So the elevation you're looking at the top is an elevation of that chain-linked fence, enclosure area, you'll notice that the chain-link is there and it's almost of the four-foot steel fence, which I mentioned all of that's being removed and it'll, be replaced by a single 7-foot standard steel fence painted black to match the rest of the park, you'll notice, also in the elevation immediately to the left of X. That's the bathroom day. That area will change. We will add a door for this east. That door will be the main entrance to the women's room and you'll notice that a window will replace the existing door on the left side of that bay, and then that will be a window that flexible or lockers face for the lifeguards. In addition, they'll be new windows throughout she Louis the window to the left, there's also a new window to replace the existing windows. These windows were trying them to take them to the same sill height as were original to the building, so you'll notice that the existing window is a lot smaller than the proposed window, and this is something that we like to do to bring our buildings back to their original condition, so we're clearly taking that attitude here next slide, please and in those similar condition on the western wing. That's an existing seven-foot steel fence on the left side, and that remains so now the building will be flanked by these seven foot. Steel fences, you'll notice that the bathroom day same condition were simply essentially replicating the elevation here. That was the women's side. The main entry to the men's store is that door to the left of the wing. It will be surrounded as the women's with a noose around to match the existing detailing of the building. The current door is being converted to allow natural light to filter into that space. Those three windows that you currently see were not original to the building. Those three windows were built at some point, so we are going back to trying to mimic the original building and we're putting in larger windows to lower the sill height as a reason, those are narrow. Okay, again this we will mirror the wing to the right with the obvious differences that here we have three windows in the in the office area of the building, whereas previous climbing, so one window and those against our to match the existing condition of the building next slide, please. This is in the rear now and we're looking at this thing facing south. So this is the West Lotus here similar conditions. This shows the existing. It will remain in the new design. This shows that the current, a great tile condition in that niche will be replaced and the louver will be removed, and we will introduce new anti graffiti tile here as well to match the current tile as best we can and to give us maximum ability to maintain that niche, which is a very attractive for feeding target for you know, and so we're trying to maintain the flexibility. You'll also notice that we're removing a metal loop or a metal loop, Russia's say just to the left of that niche between the bathroom bay and the main there is necessary. Most of the other louvers are going out of the roof. You'll also notice that the window here is being enlarged, similar to the enlargement on the front of the building. In this case, it's one windows or replacing one larger window next slide. Please- and this is the East Wing, also showing the APA ramp. So if you start here left to right, pink mint, fencing as we've talked about before is gone. The seven-foot steel fence is in place and by the way we haven't mentioned the fact that all of the sheds that were back there had been removed. So those should come back. The there is an eastern edge of the building, a moveable storage container that Louisville storage will be pulled away from the building across the wall, and that may end up being is permanent location on the other side or it may move somewhere else. We would have to negotiate the final location whenever it will remain away from the building to prevent people from climbing on the building. So back to this elevation, click percent of the ceramic tiles, with graffiti resistant or anti graffiti tiles within the niche at the bench. The same louver added here to allow for relation of the interiors and the same larger window as before the ramp. You'll notice is a little more as a conspicuous as though it's a larger ramp. It is, unfortunately, what is required to meet the compliance of the ABA. We will have our standard Piper, ll handrails and our standard concrete ramp with curbs and everything will be done according to code and compliance, and it will allow for, as I said before, that, larger area of circulation between the ramp and the memorial next slide. Please- and here we are in Volusia, on the right and at the western end of the building on the left, so you'll notice at the existing West elevation. This is in the west wing of the building that 7 steel fence is existing. That prevents them ease to the multi-purpose plane area. Those windows will be replaced and they will be matching windows to the new ones. We're putting on the front and back elevations you'll notice to the right is the loggia, so the logic door will be replaced. It'll match the new doors going into the other areas of the building, as will the entry to the girls room immediately to the left. There you'll see that the door is also going to be replaced to match all other new doors as well, and this is sort of a cut section through the ramps over to see the ramp. Very much, but it's there, you'll notice the difference. If you look at the existing section that you can see the steps going down, so we even cut it through the ramp. So obviously those steps Miller will exist in those three bays, so that was the best solution. You'll notice that the new ramp actually stays within the line of the building beyond, and that was our stated goal to sort of maintain that sort of circulation corridor as it was original intended as best we could next happens. This is now the loggia of facing east and the eastern Volusia facing east and the existing East elevation. This is again, this is the elevation where we currently have that chain-link enclosure, a chain-link enclosure which is only visible right hand right hand screen along the left edge well that chain labeled. Oh, that's the seven foot, high steel fence, that's the gate! There you'll also notice that there's a gas meter here is during the oil to gas conversion we'll be removing the existing tank from the Buried area, we'll be putting the gas meter in it will be always behind the enclosed area. So it will be secured from public for temporary you'll, also notice that to provide some cooling of the building, we are putting some outdoor condenser units in that's worth yard, as we're calling it and we're putting them below the replaced windows which will allow for greater light into the bathrooms and again on the left. The lower elevation shows that we doors both inside the loggia and at the boys room to replace the existing doors there next slide, please. This is kind of a cut plan section of the loggia. Just to give you a close-up of what we're talking about so left to right, well notice. Some security lighting is going both at the back of the building at the front of the building. You'll notice that there's a new brick pavers will be put into place in the loggia itself to replace the chopped-up patchwork floor. That's currently, there you'll notice the handrails that I mentioned earlier. We can make any adjustments to these. Maybe we've reduced it to one, but we think this is probably the minimum we have to provide, but we're going to look at that and we'll get no worse than this. It might improve from this typically manage to a couple of these handrails and then the ramp, of course, is here. You'll start you'll go into a flat landing you'll go down. The slope you'll arrive at the turn landing, and then you go down the last leg to the actual Plaza, where the memorial is located next slide. Please- and these are the materials that we're talking about stainless steel for EDA signage and kick plates for custom pool and lock boxes painted glass some of these things. So we won't have a lot of stainless steel to lock boxes that we painted black with every stainless steel, red brick, pavers, condensing units anti-graffiti ceramic tile for those niches in the rear of the building and the light which will be a industrial grade. The arts, constant, the breakage ABA signage and the concrete for the for the ramp itself and we'll be putting in our standard deep and real at the ramp, will be putting in double hung windows with the divided lights to mimic the multi light windows, DP, art, standard steel, fencing, seven feet to match the western edge of the building will be printed replanting a tree, and that would be the promised economy and that's pretty much the project I know it's a lot. Sorry I rushed through that. Thank you. I know it's a lot, but we've seen many presentations, so you're used to quite extensive reviews of everything that parks does for renovations and replacements. Okay, Trevor, can you hear me I can hear you I can't see you no can't see me. No I can see it to hell. Do I press just so you can see me the media icon well, but is that there's a video I video like? I, don't you see I'm using my iPhone, you using your phone? Did you call in or did you join good as you map there's the zoom, the online thing? Okay, so yeah there should be an icon to start your video, or you might see a three dots that say more. You might need to go in there and couldn't click start video. Otherwise you can still join us by voice. You don't Steve, okay, why say? I just want to make three quick points. Well, first of all, I want to say that I think, as you can see, from the presentation, Jorge and his team have put a lot of thought and care into this project and a book and have considered every single detail virtually I believe but number one I'm pretty sure that the renovation of this building has been a long-standing community board, 3 a budget priority. So it's you know it's probably long overdue, that we got a chance to renovate this building and obviously it took a while I want to be able to get a substantial amount of funding in order to do it. The second point I want to make is that, obviously, this project provides a dual benefit to the public, which will have a much more pleasant to surrounding and better conditions in the bathrooms and to the Parks. Department employees will have better working conditions, and a third point I want to make is that it is that this design allows for much better use of the space that's available in the building and by moving the mechanical room and giving us space for a first aid room and the locker rooms for the lifeguards. It also gives us you know essential backup for the pool which actually I hope the renovation of the pool is. Maybe the next thing we do in this part, but we need to have appropriate space, can support the pool, operation and I think the first time we will now have that. So those are the points I want to be able to make. Ok. Thank you Steve for those comments. We are going to do this for those for our committee. Members are follow this a little bit of different a little differently. If you have a question Michael, do you think asbestos just have people raise their hand, because I think that can be challenging for those who are in a phone or well? This there's two ways that we can do this I. Think probably the easiest way is the raise hand feature, and then we can call up people on the phone you just hit star nine. To raise your hand, the other thing people can do Trevor, if you want is they can just type their question into the chat field and just repeat it to a horray. If you want to do it that way, it's up to you we're gonna, do all three. So if you, if you ask committee to any board members first, if you have a question I'd like to see you raise your hand and Michael can take a note Michael. How do you raise your hand? What is that you're on, if you're on the phone you hit star nine? If you are on the zoom up you just hover over your picture and click raise hand or go to the bottom menu bar and click raise hand. I don't see. Raisin I have invite participants, share, screen, chat, record and reactions. Is there a more option there? No all right. Let's do this, it's Manas participants, foul I, think would work for you and then you click it. And then you raise your hand based on the participants box, dissipate, okay and then I'll go to yourself underneath that it'll say raise your hand, but if you can't do any of those, we don't have a large committee. So we can also just hear your out, but I'm gonna go I, see raising Robyn. Are you going to ask you a question? Hi Jorge. Thank you for that presentation. It is incredibly detailed and I think the building said: I look beautiful, Steve, Simon I want to reiterate what you've said. I think the sweet points are all there as you're saying more usable workspace for the staff and for the lifeguards, the cleaner bathrooms and a more beautiful building. Something I wanted, which I brought up before with these similar buildings is again thinking forward. Thinking you know, I see four rooms dedicated to bathrooms and I see if it's an opportunity here, a lost opportunity to have some kind of indoor public space for community usage, for you know any parks, programming that might happen or and or any possible for the Friends of the park now or the concern any Conservancy that might come to the future, and so given that I want to know why we need four bathrooms and can't we just again go for a gender-neutral bathroom. We could eliminate two of these rooms and create a public indoor public space that the community can use for events question for you more than for me: okay, very good, well, I'm, just an interesting question and you know I think what we have here is is unusual circumstance where we have separate bathrooms available for boys and girls, basically to serve daycare centers and others who prefer to have their or our kids come into a separate bathroom and not be not get mixed in with others. That who frequent the park, let's say so I think we have firm. I mean these are both important points. I mean you're, making a good point, but there's also a certain value in being a being able to preserve these separate bathrooms for kids. Was that a request then from the community Steve I might have missed that them? Is that a request from these daycare centers it doesn't have that? Is that something that the community put forth and because I know, there's also been a lot of talk in with all these Park buildings and in normal locations in our in three that there's no community space available indoors in any of these parks? Well, I mean it. I mean it's. Basically, it's a the frequency of the use and the continued use by the daycare centers who will utilize that area of the park. But basically you know foretells the fact that there's a demand for it- and you know we- you know we determined I, guess that you know there was no reason to believe that demand would suddenly disappear and that we did have a certain ability to serve that need which we don't otherwise have in almost any other building. I'm. Sorry, Trevor I understand that again, I'm just gonna put the gender-neutral bathroom concept out there, that many public institutions are putting forth. Libraries, colleges, universities and again the parks department and the city is not doing that and I'm putting that out there again when we're thinking about the future use and user of our public spaces. We can certainly take that point back. Okay, I, don't see any other hand raised, although I see do see a comment from I believe that's élisa. Did you want to ask a question or comment says who Michael Lewis CBT chair? That's Alicia, she's unmuted. Now she could talk: okay, Alicia, she's, unmuted, yeah, okay, I see her Alicia. Now you can hear me okay, so good evening. Everyone I just wanted to just follow up a little bit and give some comment so yeah I when I ran after school in summer camp. We actually appreciated the fact that there was a separate inside bathroom for the children to utilize when they, you know when they went to the sprinklers and the swimming pool area, to say to Robin and I do understand what you mean about having genders fest non gender specified restrooms, but I think that would be an additional bathroom for that particular part, because that park is a haven for people that are transient and people that utilize different areas of the park like the dog, walkers and so forth, and so on. I think that maybe down the line, we can look into maybe another space where there another restroom could be built. But as of right now, I think as a parent I come to appreciate the fact that Thompson's we're always had those four restrooms. There was always the ones on the inside, where I felt it was more secure for the children too, that were using the sprinklers and swimming pool that it was a little safer for us to be on the inside than to be on the outside of those of the restroom area. I always considered it. That's the children's restroom and the other one is the adult restroom. So I, don't I'm not going against what you're saying Robin but I'm, just saying, like a caregiver, have really appreciated the fact that there are those inside restrooms for the children to utilize. Okay, thank you. Lisa I also see Carlin is joined by either those who've raised her hand or those it's a comment. As a next person I see Carlin did you want to comment, or did you just putting it in the cat for just Chad? Oh, did you want to make a copy I just his restrooms are traded, it shields them from the homeless population. It was just a short comment. I just want to get two comments and first we're going to come back to you. Ryan I just wanted to ask as a as a point of reference. Do we have other children's bathrooms in cb3 and many other parks yeah I I'm, not I'm, not nothing comes to mind. I have to go back next time. I'm in the office I'd have to check my files. Nothing that I can recall. Also see that's deep. Well, that's why I think this is a unique circumstance where you know we can provide a service I think as Alicia mentioned, which you know otherwise is impossible. So you know we it's. We would be I, guess we're locked into -. No - no longer be able to do this. Okay, I see, okay, Tompkins Square has a whole populate. It has several different populations of people that use it. We are inundated in the warm weather with the travelers aka pumpkin grunge, okay, a lot of them a heroin users I think that one of the reasons why Tompkins Square has maintained that specific area for the children with the sprinkler and with the separate bathrooms, has a lot to do with that. There's two playground areas in the park and then there's the sprinkler area in the park. There's little missionaries, which is on st. Mark's and between 1st and 8th at uses that there's the little preschool across the street and there's like how many different schools in the neighborhood I mean. There's PS 119, that's on First, Avenue and 12, but there's st. bridge or what was st. Bridgette's through this year and then there's PS 64, PS, 63, the earth school they're, all these different schools. They bring the children to this area and there's a real need for those bathrooms to remain the way they are because of the. We also have I think how many soup kitchens that feed in the park I think I've counted. Seven but Susan told me there were more, so you attract a large number of people at different times that there the park ends up serving and not everybody wants their preschool or toddlers dealing with some of those issues. Thank you and the last one I see I'm. Not all right, you know never will be. This balance is so gross I'm, never taking my kids with them at all, but I'm glad they'll be fixed, so I'm not arguing about against the need that everyone is saying about boys, room for kids and the daycares, but again I'm going back to parks to say you know. Please look at your planning when it comes to public restrooms and you know an example. I give if anyone's ever been to Venice Beach California there are. There are toilet stalls that anyone can use at any given time whenever they're, available and I think we went into these problems here. First of all, I guess you know we have rooms, which is a it was create hiding places for the drug addicts that you're talking about Caroline but again I'm. Just going back to that, you know thinking forward. Thinking about you know, toilets versus a room for men and a room for women I'm, just gonna. Add that again, that's all I have to say thanks. Thank you. Thank You, Ryan I'm, just gonna ask some quick questions before we see if we can get a couple questions from those who are also on soon, but not community board members, the budget and I know that's a big question for a lot of city projects. What's it what's the situation with the funding here, I know this was a budget priority for CD three for quite some time and also from our council member. What do we look? Going forward am I on yes, okay! Well, the project is fully funded, and you know, God knows what's going to happen in the future, were with the Covid-19 da 19 a situation, but we have every expectation that dis funding, since this project is a fully advanced and frankly, this is one reason why we were anxious to bring it before the board as quickly as we could, because we want to see it advance and so that we can lock it in, and so we have every expectation that this funding will remain in the budget and we'll be able to do this project and the proposed schedule. Well. First of all, you know with the this is a situation right now basically effects projects of ours that are either currently in construction or were about to begin construction. This project- you know it still needs a probably at least another six months of design work. The still has to go through PDC or a and his team Rhea young, and will still have to do all the contract documents so before it can go out for bid. Then we have a. You know maybe a nine-month process, including the bidding and us and the review of the bids and water, the contract and a registration, so we're maybe two years away from actual cause. Let me say a year and a half, maybe from away from start of construction. So you know, hopefully things will be back to normal by then okay, thank you, I'm, looking to see Michael, do you see anyone who has joined and not a community board member who's once asked a question or comment? Well, we should tell them so now is the opportunity for members of the community. If you have questions about this presentation before the community board votes on it, use the same, raise hands function if you're on your computer or tablet or phone, you just go to the participants tab and go to your name and raise your hand if you're on a telephone only just hit star nine. You also can type it into the chat box. If you'd rather do that, but so I see one so far, nine one seven, we don't know who you are, but if you can just tell us who you are wouldn't before you ask your question, that would be great I've just done the interview whoeverís bone ends in 288. You did raise your hand. Did you want to make a comment or ask a question? I have a comment, so my name is Cristina Depp's Romero hi, everyone I'm just on my phone, but I have been watching on soom and now just on the phone and my comment or my question really is the flood soon as it is right now in our community, it goes to Avenue B, and this building is half a block away from the current floodplain and putting all the utilities into the basement. Just wondering whether we're going to move on. We do not have tonight and we're going to work on it. Based on the comments and the notes have taken to form some sort of resolution based on bullet points and we go over. Some of things include some of things. Robin mentioned is an existing restaurant to code, upgrade parks, maintenance and operation space at a first date, lifeguard locker room spaces in the building, reconstruct the interiors to clean, partially repoint, exterior brick new windows and doors, and these include a gas conversion also I mentioned this- is a budget priority for cd3, a better use of space, better use of overall space for these this particular building? Okay, Trevor. Yes, if I may you may also that we're providing a da accessibility I'm just going to repeat what Steve said to provide a da accessibility which is crucial, ah and I'm, trying to figure out a way to incorporate some of Robins concerns, including that parks consider to use some of this space for to a lot some of the space for community use or for community programming, and those are all the things Steve. Was there anything else, because we're really just doing this drafting this right now well, I think you I think you basically covered the main points that I had I seen wrong, but I tell you what I would like to what I would like to suggest to Robin is that I will look into the possibility of using the lifeguard locker room for some community space. It would have to be you know outside the summer, but maybe there's a potential to make that a dual-purpose space. Okay, so I'm gonna, add that since it came from Steve Thank You Robin I really go to Val. First I think one of the things I didn't hear was that people or parents and daycare centers like the idea of children's restrooms in terms of one of the, whereas is I, think that should be one that is highly desired, that there's a boys and the girls restroom, and so I didn't hear that so I think where that should be one of the, whereas is okay, I'm gonna figure out a way to rephrase it, but I think that's important and we're gonna put and, as Steve has mentioned, to repurpose the lifeguard locker room into the community space. Well, I'm, not repurpose, it I see whether or not it can be a shared use during the outside the summer shared use space in the offseason very good, yes, new space Robin has her hand up as well. Robin I would even go one step further Steve. Oh here we are I would say you could take the women's side or the men's side and still have a boy's room and a girl's room. You could divide that in half you could divide up the men's or women's room and just make that into a bathroom and an entire way become a whole community room, but you know that that's even one step further I, that's even one step further, but that's. What's me, okay? Well, it's a step that I'm not yet prepared to take so I will go back and talk to people and talk to Jorge as to what the feasibility is of doing something like that. But that's a that's a decision which I certainly couldn't make on my own yeah and I. Think we need to also consider the fact that many of the community members who use it and have family or children in the area really appreciate the fact to do this. Separate poison cross room but I also see Brian and raised I want to give Ryan a chance right. Sure I wasn't saying not to do it. I'm, saying I think there's plenty of room to have all those needs met where there's an amount of space that is given up for boil. It's understood, Ryan I just wanted to add so we're putting in that the lifeguard locker room area could possibly be used. Offseason I'm wondering if the first aid room is also a seasonal use and anyway, that would open up more space if they were offseason usage for that entire section. Well, I'm, foreseeing that there's going to be stuff in the first-aid room, which is which we probably don't want to expose or have open to the public at any time. So I'm thinking that the if with if this is possible at all and I, certainly cannot assure you that it is, it would be more likely to be possible with the lifeguards locker room. Okay, I see some more questions and I go to Susan. First okay, can you hear me now? Yes, okay, thank you. So I've used the playgrounds there and still doing my you know: I raise a son there, and now my granddaughter's are just about growing out of it. As far as the community space use inside I've never heard, anyone in the area suggest that there is a library across the street. There are a lot of schools as been mentioned, that use it of the schools all have their own space and then I'm, not sure who would be using it for what like I said, it's you know as far as the people that actually use the playground. I've never heard it mentioned, and it's unfortunate that they're, probably not at the meeting or participating in the meeting, but I, would want to get feedback from. You know, people that would be using it and find out who they are no and I agree with you Susan, and we don't have the normal participation in this meeting. So I think what Steve is suggesting is he'll. Take a look at it. There's probably gonna have to come back to us at some point, even though it's going to be DC now, but I think they just want to take a look at it. But you're right, there's not a lot of people just because of this format. There are people who use the park other than and committee members on. This particularly definitely need to be something we revisit. Yeah I think you know do all fit could be used for more than one purpose. That certainly makes sense, but I would think twice before just taking it out for that purpose. Okay, I'm gonna, go back to Val, I, think this prioritizes, who Rosanna France but value. You have another commoner question just when you went to the thing about the first aid room, I'm like I, just kind of think. We have to think about the safety of people and maintaining and providing safety. So I'm, just kind of not I kind of think you want to maintain the first because I think playgrounds and kids is like a usual for you know. First, aid needs so I, just kind of think. Please think about not changing the size of the first aid room. I, think that should actually be one and aware asses about the fact that children do have a tendency, the run, fall, etc. So I think that should be wanted aware, as is that they did allocate space for a first aid room. Okay and I. Do that have I do have that in the goals, but I think we should probably expand that language a bit because we just have add first aid but Ryan. Are you you're, taking notes in this correct? Yes, I am, can I just respond quickly, I thought I heard Steve say that it was first aid just during for the lifeguards and so I thought it was a first aid room that was only being used when the pool was open. Is it a first aid room? That's able to be used all year round, no I, don't believe so. I think you're right, I think it's only used during the pool season, but I, don't I, don't see this as being a room that would be available the rest of the year to the general public. There were things I assumed that are in that room that we don't. We want to make sure not being tampered with. So I think it would remain locked when it's not being used during the summers. I think, okay, two more and then we're going to try and get this resolution together or at least add some bullet points. Carolyn and then Susan, it's my understanding from what I've seen in the past is that the entranceway into the pavilion area there's a sign that says. Basically it's the area where the sprinkler is reserved for children with an adult. That's the only way an adult can go back there and usually the pavilion area is used by the staff. So it's not like there's great public access going through the pavilion area into the children's play area and that's something that you need to think about as well. So unless Parks is going to change that the suggestion about the tennis of the locker room for the lifeguard that has access to the outside to the public area and it doesn't infringe on having people go into an area, that's reserved for children, Thank, You Carolyn for that particular lass, I think Steve's going to take it back and take a look at it. Since we have some time on this, but I do think there needs to be a little bit more public input on that particular request. But I'm gonna go to Susan Carlin has said disregard, so I'm gonna go to Susan again, okay, I just wanted to say as far as first aid for the kids, you know, there's often not staff there. It's often all locked up, so that just wouldn't be available. You know it's not something like any adult can just walk in and use it. Okay. Thank you. So I'm gonna read over to the extent that I can Oh Ryan. You want to read over what you have so that I know that we match, because I can always add if you didn't catch everything. Sorry to put you on the spot or do you want me to read it? You need to read it: okay, upgrade existing restrooms to code, upgrade parks, maintenance and operation space at first aid and now I know we need to change that language, but as first aid, Locker lifeguard locker room spaces in the building. We construct the interiors, clean and partially repoint exterior brick new windows and doors new utilities, including or the gas conversion, and a better overall space, better overall use of the space keeping in mind. This is a cd3 budget. Priority Steve, you told me something: I forgot where I wrote it a DA, accessibility and said I can't read my own handwriting 88 accessibility, Brian Gillis did I leave out anything other than our parks, we'll take a look at the possibility of using between life guard locker room, dual purpose area during the offseason, and it will involve getting some community input as to whether this is a request or whether this is something that neighbor that was Josie. She said what about what Val said: I believe it's about the first date thing that's already addressed I'm just saying I got that in there I just need better language on it. We're just drafting this right now. These are the bullet points that we're gonna vote. All in a couple seconds and I mentioned to Val that I just had asked for a stapler we're gonna expand on that language. Someone, okay, Val! Do you have a question? Are you or do you have your hand is raised? Yeah I was just going to say that I think what they said was that the lifeguard we use that space, because what I thought about you know I was I was thinking that, in terms of staff, the staff would use the space to address issues and I know that most lifeguards I think have to take CPR and First Aid. So they would know what to do whatever the equipment was in the room. So I'm not sure how you want to write it. But you know I think somewhat the issue that we do want a first-day space, but somebody who's trained to use it with staff is trained to use it because you know, like I, said I think lifeguards have to take first aid CPR and you want trained staff to have access, correct and I think Justine's point that would be used. That would be designated as the first date place and be locked during off during the off-season, primarily because of the items that would be located at rubber. Also made the point of saying that there seem to be a lot of community support for retaining the feature of the children's bathrooms. Perfect I'm glad you type that in all right, so any other okay, so I think I. Think one of the points, though, with the lifeguard, is the fact that you have staff that can utilize the equipment in the first-aid room. You know okay and we're gonna expand on that language and I agree with you, I just I'm just trying to get the bullet points of what we talked about. So we don't forget it, but I think we need to expand on the lifeguard. That being said, was those bullet points and I'm gonna go show of hands. Michael was the best way to do this. I think we are voting on a resolution to do again like 10 minutes that'll be the easiest and most accurate land the Ryan's going to do about roll call, we're voting on what we need a motion to prove. So does anyone want to I, don't quite understand what is like the beginning statement, I'm trying to we're writing this resolution on the fly and we're voting to approve that you're actually right willing to approve the Thompson Square Park, the post-renovation field house, recollection Steve! Would you which would that be the correct title, yeah we're referring to it as the field house? Yes, so it's the you would be hopefully voting to approve the proposed plan for the for the renovation of the Tompkins Square Park field house. Okay. This is a motion to approve to feel okay motion to approve what the what the bullet points are just mentioned. I'll. Second, it carlins seconds it Ryan. Can you do a roll call? Yes, Trevor? Yes, okay, David Adams, yes, you're on Altman, yes, Carlin Chan, yes, Ryan Gilliam, yes, valentina Jones, valentina, Jones Michael! Can you add me there I can't now you have to unmute yourself: I come back Michael Moreno, yes, Carolyn Ratcliffe, yes, Robin Chatel! Was there absurd that I missed? Was there something in there about look? That's not part of this. That was just an aside. Oh yes, Josephine pardalis! Okay, good continue. Jones are you there? Do you vote? Yes, okay, we're gonna! Okay, because we need to just need to say you proved it Val. If you're there or phone, can you type in a response? I guess we just don't see her response anywhere all right. Let's do this. That was the only I. Don't know what I did so. My vote is yet yes all right. So the motion passes with that vote. We do have and I don't know, trying to see who's left on the phone, because I thought we might give able to get a tox report before we close the meeting Steve. Are you still on? Yes, if you want to give us a brief update in as far as projects in our area and I know, everything is going to change, but you know well, actually, I should be prepared for this and I'm sorry that I'm not but basically but most of our capital projects that we're in construction have been suspended. So I think that's true for the sour Park project, for instance, and I can't recall off the top of my head. What else we have right now it board three, but with few exceptions most of our projects were deemed to be non-essential and construction has been suspended during this current period and projects that were due to begin construction have basically been delayed, but others that were in the pipeline, such as this Tompkins Square Fieldhouse, well, have not been so affected. So you know, we've closed, we've, closed playgrounds, we've closed down, tennis courts, we've removed the rims from basketball courts and basically our athletic fields are still open and our multi-purpose play areas are still open and we're trying to monitor them to make sure that people are observing the social distancing guidelines. But you know a lot of our spaces unfortunately have closed and I guess a concern that they were people were not following the social distancing guidelines. Okay, thank you. I see a question from Susan: no ignore it! Sorry, okay, well I! Actually I should mention that McKinley playground, which was about to begin construction, has been. We were going to start it on. We were going to start it today and it's been delayed, and so may the fourth at this point, but who's to say that it may not be delayed again, but to so the official start date right now for McKinley playground is May. The fourth but I, don't know whether that's a whether that's gonna be a true date. Steve is I park, is parks, consider essential construction or nuclear structure, which one is parks. These projects that ones okay. Well, no I mean a very few of our parks were deemed to be essential. Most of them were put into the non-essential category, and that's why construction has been suspended are those that were already underway so when I get back to the office in which I hope to do in the next couple of days, all I'll check the current list and I'll I'll send something off to you. If there's any variance with what I've just said to you, okay appreciate I, know, I, see, Lisa has a question about two questions. Actually, one is, have you heard anything about possible closure of like exercise, equipment areas in parks, especially East River Park, like I noted one by Houston Street when I was in East River Park. Last week there was probably like 25 guys in there working out together, and none of them were practicing social distancing and then the other question I have, and this one might be a little bit harder for you to answer is because we don't know sort of when this will end and when things will well when construction will start again. But when that does happen, is there it's parks planning on communicating what the new timelines are on projects that were small to your first question, the fitness equipment situation is dead, a concern of ours, and it's something that is that is under discussion and I would not be surprised if we ended up closing down those areas as well, but I think we're looking at that right now, so there may be a decision on that. You know things are in flux to a greater degree to a great degree. In you know, decisions are coming down day by day, so I would surprise me if something occurred in that in that vein very shortly. On the second point: yes, as soon as soon as projects are back up and running it, we will let you know what the amended revised schedules are certainly for projects that have yet to begin. Let's say: McKinley begins, May the 4th, that's a 12-month project. You know it'll, presumably be completed by the May of 2021. The comfort station project, which is which also, admittedly, was not going to take I think we were convinced we could do it within six months so and that that's also been delayed. Hopefully that'll start up. At the same time, the overall playground project starts up. Thank you, I, see three more and then we're gonna wrap this up. I'm gonna name him it's Susan, Carlin and then Robin and Ann I just have one question so Susan. Okay, thank you as far as McKinley. If it could start, it would be really good to do it. While the schools closed, because Steve is aware of all the difficulties it was, it was causing for the school, so I just wanted to mention that the same thing with the comfort station with Tompkins Square Park I, want to thank parks for continually closing more and more areas. It's a shame that people were really upset even writing in the blogs about the lack of social distancing in all the courts. Have you closed up the skateboard court now Steve? Well, we have closed. We have closed a for skate parks in the borough, specifically in Tompkins Square, because there are a lot of complaints about the use of that quarter. Well, you know: that's not that's a good point. You know that wasn't on the list, because it's not considered an official skate park, but I will bring that back. Yeah. It's really a shame. I, don't know why that Park is so misused, but even I will tell you that call zip code of one triple. Oh nine, actually is more complaints than anywhere else in Manhattan about people not complying with social distancing, so I think the park is just part of that. Thank you all right. Thank you. Calling yeah, hi, Steve I'll be keeping safe over. Everybody else is keeping safe. This is this is not a new construction project or capital improvement, but you know I'm talking about a safety concern down at Columbus, Park, Foley, Square, Park, Thomas, Paine, Park, and also the fountain area, a folly of Thomas Paine Park, the lighting is non-existent. We have the lighting. 85% of the lights in Columbus are out 70% of the lights in Foley Square Park around, and there are no lights at all Thomas Paine or that fountain area I, don't know if VLT is sending out the winning in repairs during this time, but you're not kicking you. Can you think I'm not a look into that? It's been a year almost. Thank you. Absolutely you're, saying that for a whole year, lights have been out in all three of those. Yes, basically they've been going out. You know one after another, but it's been a good six. Seven months where there have been no lighting. Okay, all right. Well, we were, we certainly talked to do T about that and if Susan could also take it up with do T, that would be helpful. We will pursue it we'll do that tomorrow. Okay, I I, don't know that you know I can't tell you whether or not the DLT contractors are working right now. I would hope that this is considered as an essential service. Yeah, especially you know when it gets a little dark here. The part isn't locked up until roughly 9:30 a ton of fog and we have a lot of people released from the MDC here that are hanging around in this park right now right. Thank you, okay! Well, let's stay in touch on this calling that sounds like a plan. I'll say an email I spoke to Kash show when he was down here a few months ago, but okay, what keep me in the loop on this and that's yeah, send me an e-mail I'll shoot me an email on it. Thanks: okay, one last one from Robin, hi I, hope that, like over 90 nights and hit the parks community too hard, and on that note, I'm wondering if the parks is still going to continue to bring on its seasonal employees at the same numbers or what the plan is for that day. I don't know, I mean everything seems to be up in the air right now and I. Don't think we have an answer to that question. I appreciate that question and I say: I appreciate that thought, because the seasonal employees are are critical to the to our operations and during the summer of those our busiest season. We need those seasonal employees, but the overall budget picture right now is very much in limbo and I. Don't know that we've been given any clear direction. I will check on that and, if I find out anything I'll, certainly let the Trevor- and you know, Thanks, just one last question and follow up on what Robin said: we've heard numbers from the Transit Authority, the fire department and other city agencies as one if you, if you had any indication of how the parks staff, including the frontline workers, are being affected. Iiiiii do have those statistics, but I can't get to them while I'm on the phone with you, but we certainly have had a. We certainly have a reduced work force. We some in Manhattan I think we may have hmm I, don't know we may have as many as fifteen or twenty percent who have called out sick. We do have. We do get reports every now and then of some of our employees who have been deaf, who have the illness and a you know who are now in clue who is now been quarantined, so I think I think we may have suffered a death of one of our employees so again, I'll I'm, sorry, I am I prepared tonight, but I'll get you that information. Okay! Thank you. Okay, I was going to end it, but I see. Val has one question in that you have employees that go out to the parks and I guess disassemble people. If they see people they go monitor they go in yeah we have. As of last week, at the beginning of last week, we gave masks to all of our employees all of our field- employees when you say I'm, just looking over this okay, it looks like Val. Did you want to finish real quick? You know what do you mean by mass, because some of what I've heard from people to me sounds very inappropriate with how they're doing mass? Because if you look at how the CDC says you should deal with mass, you shouldn't be wearing one. Then you went and you talk to somebody or they talk to you, then that man should come off. So no, we should not come off you. I I have worn this mask and I can talk to people through the mask that you should not. We have told our people who I'm pretty sure we told our people. You did not take off the mask when you're talking to people, because that's talked to you things that I've heard from people is the fact that they don't have enough protective equipment for the things that they're doing I'm not saying they take them off. While they're talking, although I'm sorry, I, misunderstood bag, we're disposable mass more than one time right, yeah I, you know I, don't so your question is how many baths have we given to people right? Is it people going out monitoring people which I'm not exactly sure what they do to monitor them? But if they're monitoring is that they go up and they some kind of way approach, people or people approach them. You know, I, don't quite get what it is I'm just saying. Is it appropriate because a lot of people are talking about the fact that the PPE is not so I would just hope that you look at appropriateness. That's all right! Well, that's a very good point and I'll check on that. A valid point, certainly we're not as vulnerable. That say, is the people working in the hospitals or at EMS who would in daily contact with people who have the virus, but this is a consumer concern and I'll certainly look into it. I, don't I know we gave out thousands of masks, I, don't know how many each employee was given. Okay, but I also think that's a citywide issue was all government agencies. You know. I would just like to say that we have redeployed I forget how many people- maybe it's 90 people in the agency to serve, who are not otherwise working. Let's say people in the recreation centers that are now closed. Others who were whose jobs are you know have basically been curtailed because of this crisis. So we've reassigned them to be what we call ambassadors, and so they are going out in addition to our parks enforcement Patrol. They are going out to areas where there is a some concern about whether social distancing guidelines are being observed, and they are talking to people who to explain to them why they have to adhere to the guidelines. So that's a first-line measure that we're taking on that note we're gonna close this out. Steve. Thank you and we're gonna all follow your advice to stay safe and use. Masks. We go out need to can I just thank the committee for its support of another one of our projects, which I believe is going to be a substantial benefit to both you and the agency. So I. We appreciate your support. We appreciate your support awesome because we're sending you a how do you zoom? You just got the link, so you can how to use the video. So we can see you when you're talking. You should have that now, a very quick guide, it's about two minutes long I mean probably you're, probably better off. Not seeing me I need a motion to adjourn motion and don't leave the meeting yet committee members, because right and I think we're probably on this roll right. If you want to do a roll call, all right, I'll see you guys: yep Trevor Mullen, yes, okay, Webster, David, Adams, yes, their own Altman, yes, Carlin chan, yes, Ryan Gilliam, yes, Valentina Jones, yes, Michael Moreno, yes, Carolyn Ratcliffe, yes, Robin Chatel, yes, Josephine, Aviles, Josefina, Phyllis, Josie, unmute yourself. We know you. There are six Josie. What I'm doing anymore yeah you got yep! That's it! Alright! Folks, I, don't know what this next month looks like, but just be very check the website. Why I can't always the website will be the most up to date as to what's going on with our meetings, everyone stays where I'm asked. If you go outdoors thanks recognize good night.",
        "summary": "Just to let us know who you are so that we can know if it's a board member or a community member Jamel Phillips, a district three manager for parks , Everyone I, think so we're just going to ask everyone to keep themselves muted until it's your time to talk so that we can decrease on the amount of background noise and again just a reminder.\nTaking notes for this meeting, our first parks and waterfront meeting some members of the public we're going to use the raise hand, feature to ask questions, and that will happen after the community board.\nEverybody knows where it's located in Arkansas, the northern edge of the drive through the budget is 6 million from the mayor's office, and the project is roughly 2,300 square feet.\nThe goals of the project are to upgrade the existing restrooms to bring them up to Toronto such great parks, maintenance of operation, space at the first day left card, locker room spaces to the building reconstructing interiors, which, in this case, are for back and space to clean and partially report.\nYou notice on this plan, the new men's entrance on the left to the furthest western edge of the building and the new women's entries on the right is the furthest eastern end of the eastern wing of the building.\nYou flip back the slide one more time, you'll notice that the current configuration show is the man's edge it's tucked in next to the office space and the women's actions based on the eastern wing.\nYou, know and other people to come in and to essentially muster in the morning and to have meetings as required to maintain the property and its rightful place.\nThis configuration may or may not change slightly, depending on whether we can get away with just using one handrail per day as it were, but the distance is ability, but essentially that's the major change here that wrapping their back now One slide, you'll see here that the area between the ramp blow to Memorial is actually quite tight, and so we didn't really feel that was an appropriate use of space.\nOne slide, please so we're able to recapture some of that circulation space And that's going to be important for us, because, as we get further into the presentation, you'll see how we modify and the fencing on the eastern edge of the building to allow for more circulation.\nWhilst when we start to discuss some of those changes to the fenced in area, east of the building, which is quite an eyesore, has always been something we wanted to address.\nWill be the main entrance to the women's room and you'll notice that a window will replace the existing door on the left side of that bay, and then that will be a window that flexible or lockers face for the lifeguards.\nOkay, again this we will mirror the wing to the right with the obvious differences that here we have three windows in the in the office area of the building, whereas previous climbing, so one window and those against our to match the existing condition of the building.\nThis shows that the current, a great tile condition in that niche will be replaced and the louver will be removed, and we will introduce new anti graffiti tile here as well to match the current tile as best we can and to give us maximum ability to maintain that niche, which is a very attractive for feeding target for you, know, The seven-foot steel fence is in place and by the way we haven't mentioned the fact that all of the sheds that were back there had been removed.\nDepartment employees will have better working conditions, and a third point I want to make is that it is that this design allows for much better use of the space that's available in the building and by moving the mechanical room and giving us space for a first aid room and the locker rooms for the lifeguards.\nAnd I see if it's an opportunity, here, a lost opportunity to have some kind of indoor public space for community usage, for you know any parks, programming that might happen or and or any possible for the Friends of the park now or the concern any Conservancy that might come to the future, and so given that I want to know why we need four bathrooms and can't we just again go for a gender-neutral, bathroom.\nWe could eliminate two of these rooms and create a public indoor public space that the community can use for events, question for you more than for me: , well, I'm, just an interesting question and That who frequent the park.\nWas, that a request then from the community, Steve Is that something that the community put forth and because I know, there's also been a lot of talk in with all these Park buildings and in normal locations in our in three that there's no community space available indoors in any of these parks?\nWe actually appreciated the fact that there was a separate inside bathroom for the children to utilize when they, you know when they went to the sprinklers and the swimming pool area, to say to Robin And I do understand what you mean about having genders fest non gender specified restrooms, but I think that would be an additional bathroom for that particular part, because that park is a haven for people that are transient and people that utilize different areas of the park like the dog, walkers and so forth, and so on.\nI. Think that one of the reasons why Tompkins Square has maintained that specific area for the children, with the sprinkler and with the separate bathrooms, has a lot to do with that.\nLook at your planning when it comes to public restrooms, First of all, I guess you know we have rooms, which is a it, was create hiding places for the drug addicts that you're talking about Caroline Thinking about you, know, toilets versus a room for men and A room for women I'm, just gonna ask some quick questions before we see if we can get a couple questions from those who are also on soon, but not community board members, the budget What's the situation with the funding here , I know this was a budget priority for CD three for quite some time, and also from our council member.\nRobin mentioned- is an existing restaurant to code, upgrade parks, maintenance and operation space at a first date, lifeguard locker room spaces in the building, reconstruct the interiors to clean, partially repoint, exterior brick, new windows and doors, and these include a gas conversion.\nIf I may you may also that we're providing a da accessibility And I'm, trying to figure out a way to incorporate some of Robins concerns, including that parks consider to use some of this space for to a lot some of the space for community use or for community programming, and Is. That I will look into the possibility of using the lifeguard locker room for some community space.\nWe need to also consider the fact that many of the community members who use it and have family or children in the area really appreciate the fact to do.\nIt's, understood, Ryan I just wanted to add so we're putting in that the lifeguard locker room area could possibly be used.\nThere are people who use the park other than and committee members on.\nYou need to read: Okay, upgrade existing restrooms to code, upgrade parks, maintenance and operation space at first aid and now I know.\nWe need to change that language, but as first aid, Locker lifeguard locker room spaces in the building.\nThink, one of the points, though, with the lifeguard, is the fact that you have staff that can utilize the equipment in the first-aid room.\nMost of them were put into the non-essential category, and that's why construction has been suspended are those that were already underway so when I get back to the office in which I hope to do in the next couple of days Last week there was probably like 25 guys in there working out together, and none of them were practicing social, distancing and It's parks planning on communicating what the new timelines are on projects that were small to your first question."
    }
}