{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "title": "Top chat replay",
            "publishDate": "2020-09-22",
            "shortDescription": "",
            "lengthSeconds": "3:40:24"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "mcuu4VrwZto",
            "fillerWordCount": {
                "uh": 637,
                "um": 408
            },
            "readTimeFullTranscript": "125 min read",
            "readTimeSummary": "15 min read",
            "wordCountFullTranscript": {
                "information": 55,
                "minutes": 39,
                "agenda": 35,
                "report": 35,
                "work": 31,
                "person": 31,
                "month": 26,
                "seniors": 23,
                "school": 22,
                "chair": 20
            },
            "wordCountSummary": {
                "report": 7,
                "information": 6,
                "work": 6,
                "conversation": 5,
                "businesses": 5,
                "person": 5,
                "technology": 5,
                "agenda": 4,
                "licensing": 4,
                "minutes": 4
            },
            "fullTranscript": "I could not be in a better place today at 6:30 when I went out on a beautiful day outside, so I'm just happy to be here, so I'm going to call the meeting to order. It's 6 35. us, our wonderful secretary who, given the circumstances we can not do a party say of for her services. Liz has modeled the position pretty much based on a lot of the work that she's put in is a really a model that is going to be in shoes that is going to be hard to fail, but like again, under the circumstances, all I can say is thank you wish that we could have a getaway party and we've had our differences. We will continue to have our differences, but we have to give due to what's due and the work you do is second to none. So I'd like to start the meeting with that on. The second item is the adoptions of the September's agenda. Anybody wants to put a motion. I would move that we adopt the September agenda with the addition of the minutes items as noted previously. Okay, second is Darryl Crocker. Since we have adapted the minutes of our agenda, we need to vote on it. Nice background Wayne. Thank you beautiful. Yes, you have to say the magic words. Is there? Any objection is there any objections is. Does anyone have any answers? Then you listen for two seconds and then you say the next, then I say the next one go ahead and the motion passes. Then the motion passes minutes adopted another minutes. The September's agenda is adopted. Did we vote? We just that's it. He asked for objections. There were none. We do that all the time. Yes, now we are going to adopt the minutes of as mentioned June minutes. You said to do it separately or just do it all at once, which one do you guys suggest separately, so we're going to start with June 2020. The adoption of Romania is going to get a motion to about the minutes of June 2020. I would move, we accept the minutes as submitted. Does anyone have any objections? No motion passes moving forward to July minutes the minute of the hall. Can we get on the adoption of those minutes as well? I did not. I did not get those they were supposed to go out earlier today. Are there other people who did not get them? I do not believe I got them either. No one got them because I have not sent them out. Oh in that case, I think that we should not vote on them and we can vote at the next meeting, but we should vote on May, so we're going to just do may and that'll be the last one right. Yes, so can we get emotions of that minutes? The minutes for May 2020, I move as we that we adopt the minutes as submitted in May for May, as submitted for any objections. Any objections, no motion passes, minutes adapted and now moving forward to my chat report, I'm going to make it as brief and pointlessly as possible we're going to a support, we're going to start two initiatives. This oncoming fall, one of them being in partnership with the Manhattan, the bid that presides of Cedro Medina with the graffiti removal of not just the area that encompasses the bait, but also in other areas that are just terribly filled with Graffiti, we're in the process of getting some funds from City Council in order to hire a company that can help us at least beautify the area and make it less a bit less 80s or a bit less Bronx is burning like so we're trying to start that initiative. The second note I like, I also like to motivate the newer members of the New board members, the newer board members. I would like to say, based on my experience, that we should engage not just in conversation, but we should also try out our hardest to be part of our committee meetings, especially at the subcommittee level. I think that we should motivate our chairs, not a not just. Let them do all of the work. We should also try and get people that can make presentations. I think that is critical, that the newer members understand that you have the pulse of the community that you guys are. The committees are as good as at the contribution of its members. We should never allow or put in our minds any thoughts of of real life, of thinking that you know the committee belongs to the chair. It does not. It belongs to all of us and our contributions. This is something that I like to do during my tenure here is to have that inclusivity. Have people understand that all the weight of the work should not just lie on the chairs? If you feel that there's a presentation in particular that you feel is important, you should bring it up, because not all the chairs have cover all bases. This is something that is relative to each and every one of us. I've had some interactions with some of the newer members and I'm impressed with the quality of work, with the resumes with the will. The intentions, the heart that they want to put in this and it'll be a disservice to our community. To for Us chairs the subcommittee chairs not to motivate our newer members and make them more inclusive in the discussions there's so much talent, we would hate to lose one. Just one of the newer members it'll be a tremendous loss to our community. I think that we should take an extra step to assure that the new members are part of part of the committee and they make them and improve them and make them so much better, and I also to finish like to acknowledge an email that was sent out to to the majority of the bond members in reference to some allegations of different things, the right around this time. Last year we had an article that came out with the same the same sense with the same intentions. The last committee of the last community board 12 chair. He really did not end up in a positive note, so there seems to be some sort of intention might be political or may not be, but those who know me on a personal level would testify as to the kind of person that I am. I am much more than just a board member. I'm a community member who's, putting a lot of time and a lot of effort into making sure that we all have a timely space that is fair and equal to each and every one of you. I have nothing to add to that other than if the person that is making all these allegations has any proof I'll be more than happy to hear them. Hear myself on video or tape whatever it is that they they allege, especially on a on a situation in which that resolution was not even going to be presented tonight, and that makes it even more worth the while. So with that I'll like to move forward and move on to my district manager, my good friend Ebenezer Smith, you have a couple hands raised point of information as a point of information. The item in about which the materials were distributed in question is on the agenda. It is on the agenda as a negative resolution, but it is on the agenda, which one is it? It's a license: number 15 resolution of objection to the SLA new premises, a new on- premises liquor license, so it would not be appropriate. Now, to get into a discussion about that item- and that's not my intention of my comment, I merely wish to point out as a point of information that it is on the agenda and it is on the agenda as a resolution of objection per the licensing committee which you could have watched the meeting on youtube or read the minutes and you'll see, there's a negative resolution objecting to the application and we can discuss it when we get to that point. I stand corrected. I'm sure, you'll know about know a lot much more about this issue than I do so. I stand corrected Mr care. If I could interject with a parliamentary comment, although Elizabeth's announcement was very helpful technically it was not a point of information because those are questions, and so, if you have a mentoring, point of information is a point of information to clarify something that has been said. A point of information is where you give information not requested. Okay, I suggest you look at Robert's rules again. That is completely incorrect. Okay, Jim, okay. So a couple disgraced in response to your report. Yeah Kathy. Can you just give me those names? Can you please name them? I keep stack yeah. I have the stack. I just wanted to announce because I'm getting a few messages. If you are attending tonight and would like to sign up for the public session, please enter your name in the Q&A chat. If you can't access the Q&A chat for some reason, just use the raised hand, function and we'll list them in the order that we see them and that they come in and so in terms of hand stacks. First, you have Wayne, there's four wayne, Sally Tanya and Anisha. So La's are concerning your comments on the graffiti removal. Could you elaborate on the geographic area that will be served and who are some of the other Cbo's involved me, for example, are you working with the with cloth, which would cover lower heights right, we're in the process of just doing the canvassing I've had about? I have about 18 pictures, beginning from 157Th street by the I do not know the name of the park. All the way to 218th street by yeah, exactly yeah, so I am going to reach out to jacqueline, is not longer there, so I do not know where her replacement is, but I'll. If you give me the way I'll reach out to yvonne herself yeah reach out to Ivan all right appreciate, Darwin. Thank you. Paradise Sally's, Max, Sally yeah, just a little bit more detail on the Graffiti task force. What's the source of funding and how is the decision made to do this partnership and then my second question, which is more important and time sensitive, is what's the status of the Inwood task force? We passed a resolution last month. They would be established, there'd be representations from each of the Community board committees, and I just wondered where that is. I mean it seems to me that, as when I introduced the resolution, we were already years behind. Setting that up, it seems like hearing about a new initiative for Graffiti seems much less important, at least to me than finally setting up this inward task force. So I just want to make sure it's not lost in the shuffle. Could you just update us on the status so on both questions? The number one question on the Graffato removal initiative: it's not a tax for is just an initiative, we're trying to get the funds from City Council from the discretionary funds, and it's just something that was born out of the preoccupation of looking at our city or our community. Look the way that it looks as though it's being vandalized. So that's what it came from and the number and the questions to you number two or question the answer to that question. Is the tax force I've been in conversations with the Mahan Boris Office Land, Use, Committee or land use department in which they are going to help us with the process of selecting the member the tax for members and also as to the technicalities of how is it going to be laid out at the minute that I get more information? I will transparently share with each other which each and every one of you I know that Natalie spin has been part of that conversation as well, so I'm assuming that she's also going to could give a report on that even more informative than I can so. Thank you Sarah for those questions. I have a third person yeah last time. I guess Aisha lowered her hand yeah hi. Can people hear me? Thank you. Thank you, catherine. I wanted to just say in response to your report, chair that the clarify a few things I did receive that email. I have a lot of questions. Lots of lots of questions, but one of the things that I wanted to clarify is that there for the previous chair. There was an investigation done by the Mattenborough President's office, Gail Brewer's office, that spans seven whole months, and they determined that the previous chair had engaged in behavior. That was discriminatory towards women, biased against women on this board. So it was not a smear campaign, it was actually something that was investigated thoroughly and they made that conclusion. So I just want to be clear about that. That is actually what happened. I there was no agenda on anybody's part. These things actually occurred and it was thoroughly investigated. Second, I have a question I do not I just you know when things like this are thrown out there. It just becomes very discombobulating, seeing an email like that and not. I would like to get some clarification, especially and he's correct that other item that item that that's being referred to, Emma is not was an objection on it, but I had a question about the part where this per the previous board members said that there was a recordings of people of someone saying that wanting to prevent a negro from becoming chair of Community, Board 12. and the thesis was recorded and told the different people. I you know I heard rumors about that last year, that people did not that there were actions to prevent black people from getting elected to certain positions, and I really just need to. I need some clarification on that and who that was told to what this recording is. Who said that who it was said to, because I think that needs to be investigated. That's discrimination, and I, and that should not be acceptable. I do not care you know at all, so you know that disturbs me, because it sets the tone for everybody on this board in terms of equity and that's just not cool. So if somebody is saying that they're trying to prevent black people from you know getting positions, I know that I have gone through that on this board and continue to and so to hear this in this form, it's extremely disturbing, and I just feel like, instead of living these allegations, just to you know kind of flow to the air, I think something. So why would? Why? Would your question be tanya directly? My statement is that I would like to be in yeah to be invested. You know that part to be investigated to find out. What is there proof? Is there just go away? Just the answer to that. So we can move on to the next right. Next is to reach out to the person that's making the allegations have them provide the report have them. I think the board should do that. The board as a whole. I do not have the book yeah it's an advisory, that's an advisory institution, which is what we truly are, should really just be the vehicle between that information that is being alleged and the institutions that can supervise it and oversee it, which is Nbo. The same one, that supervised and oversaw the investigation about our deceased, our friend Richard same concept, same kind of logistics. So that's what that's what so we're saying we're committed to investigating this and what we're saying? No, what you're saying is, if you and you answer you want the clear answer, you should really go to the person. That's sending out the email. I think the board should want a clear answer to discriminate. This is that's discrimination and I it's so serious right, and so I'm saying that this board should want a clear answer, not tonya, but the board itself and Anderson. We get it, you get you we get, we get and we passed the resolution about inclusion and diversity issues, and so we should be upholding that by investigating this. That's all I'm saying precisely. Okay, no matter what happens! Thank you. Thank you. So much aisha, yes, so, first of all, I'm not aware of what email is being referenced. I think that it should be part of our practice to not refer to things in generalities when there are specific things that are happening. Everything that was spoken of was spoken on in general right, so I have no idea what the substance of this is. I I'm the reason why I'm not aware is because my grandfather passed just a few days ago, so I have not really been in touch with my email things like that. However, I wanted to speak to pretty much. First of all, what tanya said is completely accurate. My experience is the same as hers in regards to what happened last year, and you know just dynamics on the board. Myself personally have been a part of some of that, and I know that those of you who are new, as well as people who are old members on this board, have heard me speak to that you can go to some of the housing and human services recordings to see me speak to some of those exact types of issues that are consistent with what's happening on this board. It has not been resolved. The new administration has not resolved that and in fact, since the changing of the guards, I have brought to the forefront many of the ways in which dynamics within this board have been problematic. I do not feel that the response to it has been sufficient or appropriate, and it has not helped to resolve my part in what took place last year, which I was one of the named people who was part of exactly what happened with the borough. Presidents reviewing the issue, and so I want to reiterate what tanya has stated that we have dropped the board as dropped the ball as a board in regards to what our work should have been in that regard. There are outstanding resolutions and actions that were to be taken and, for instance, in regards to a retreat to discuss what these dynamics are, which, ironically, are the same dynamics that were discussed 10 years ago in something very much the same that took place and yet most of the people who have the opportunity to make these changes act as if this is something that's not happening. So that's pretty much. What I want to say. Thank you. Thank you, aisha. You know sorry about your grandfather. I really do okay, catherine, do we have anyone else before we move on to, I see Isidro, I believe Cafe. So I can not. I do not see an option here so that I can raise my hand. I know that I do not have it. Can you please check contacts? I was trying to raise my hand and somehow I do not have the option. So I really agree with what Tania was saying. It's critical that we do a full investigation if need be bring the Da's office. Do a thorough investigation as to what's going on this type of behavior should not be acceptable and anyone that is bringing those charges should be also be held accountable. I believe that those charges are brought to this community board to be there to be to divide the community to make sure that we do not move the agenda forward and if that's the case, I fully requested that the ease office make a full investigation on these allegations and also who is doing this, who is brought in this? You know these problems. I think that we know the export member has brought up a lot of allegations without any substance to make sure that we're clear on everything, then, let's have a full investigation of everyone on the board and that way there'll be no question, because this is like the dividing of our members, and this type of finality should not be taking place at this point, but investigation should be taking place. Thank you. Thank you guys. So much cath, oh ebenezer, can you please add Philip from Germaine Williams's office. Thank you so much. Oh ebenezer Philip. I think he's going to take care of that now. Thank you for joining our meeting. Phillip Ebenezer, you report good evening, Mr Chairman Good, Evening board members. It always is a pleasure being here as your district manager and give my monthly report first. I want to say thank you. Thank you. Thank you, Liz for the good work. As a secretary during my tenure as a district manager, you have been the secretary many times and always you do an excellent work and you put everybody. You know aware- and you know doing a good job we're going to miss you, and I hope that the next secretary you know can do the work in be better saying that we are an excellent saying that I just want to start with my report. As you know, we had a very busy summer with the coffee 19 pandemic. You know, keep us busy really. We did not have a summer reset. We met in July and August. Many committees did that you know I keep you abreast of what I have been doing, but one thing that I need to remind you know for me, as a district manager, this summer has been a very frustrating summer because a lot of complaints, especially a noise complaint that I received from the community. I tried to resolve with the city agency to know avail. So, like one of my reports that I said before, you know noise frustration that happened. Thank God, you know the autumn, you know fall start today. It's a little chilly outside and the noise complaint going to go down and we should learn from the experience we had this summer to prevent that from happening next year, when we had the summit again so now the 207 bridge is on the repair. I mentioned that in my report in June, I believe, but the work of radio started, the 207 bridge going to be refurbished, going to be painted and the contractor is looking to have communication with the small businesses with all the business owners on the Manhattan side nearby, the 207 bridge. We have been in communication with them. I said that in the general meeting in case you know, board members know a lot of people here and there please let the people having businesses around 207 bridge nearby, the 207 bridge, that there is a reconstruction and the contractor want to get in touch with them to give notifications on the repairs etc. Last week we received a notification from the department of homeless services. They are planning to build and a new homeless shelter on 10th avenue by the corner of 213Th Street and they approach us because they want to start the conversation. He said it's a lot there that are used to be at repair shops and they will build a new building to house a new homeless shelter for mental mentally ill males. And this is time we need to start talking to the people to the provider, because we need to request many services and ensure that they have like an indoor yard or a rooftop yard where people can go outside the residents can go outside and smoke a cigarette and you know be an area for them to hang out outside outdoors but inside the premises. So I will keep you posted elias already told me that he wants to have a conversation immediately with the provider and we will keep you informed and when it's time to bring it to one of the committee, we will do that as well. I just want to remind every board members that the board bought tablets to loan to board members to that do not have computers to join our meeting via zoom. Those tablets are available. If anyone who needs a tablet more than happy to, please call us call the office more than happy to share with you. The statement of district need we're working with that. The estimate of district need is due on October 30th and we have our budget consultation, public heating on October 21st, so we're going to be working and sending you the information for the esteemed industry need, and I would like that each committee chairs help us providing and creating the statement of district needs for fiscal year 2022. Now I received a lot of complaints regarding the CitiBike station installed around the district, especially those stations that had been taking away parking. I already mentioned these complaints to the department of Transportation and they asked me to provide a list of all these CitiBikes stations that have been installed. Taking away parking. Please board members send me the locations I have a few already, but please send me the locations that you see in the district, that they are CitiBike stations taking away parking, and we would like to request the department of Transportation to reconsider it and move them to a sidewalk or another location without taking city parking, the calendar for the October calendar. It went out already, please for America City Chairs committee chairs, check the calendar and make sure that the committee, your committee, is on the right date that you want and also make sure that the agenda items that we put in the back of the calendar is the correct one. Some committee chair have not submitted any agenda item. Please submit it as soon as possible because we're going to be publishing and sending out this calendar as soon as possible by the end of this week. And finally, I want to inform everyone- probably you already know about it- that the community board 12 has a new web page with all the information improve web page, and I want to say thank you thank you to paola Chanel and also to Eli Azad and to Jonathan from Ita that help us and we work together to bring this new website. We promise for many years are going to happen. We said it going to happen, and that was the project that we dedicate our time during the summer. So it's out there with all the information up today, please review it. I know going to be a lot of suggestion. We welcome to the suggestion. If there is anything that needs to be rectified or correct, please let us know we are. I am very proud of the product that we are presenting to everyone at this time and also do not forget that we have the social media. We have the our youtube channels where all this meeting has been recorded and stories, and also we have our facebook page where this meeting also is being transmitted. Now this is the end of my report. Is there any question? I see a lot of hands. I do not know yeah, you, mother, that you're very popular tonight, so first up is I'll, just run them in threes, Danielle, Francisco and Wayne. So Danielle go ahead. I just saw this too. If you want at her. I just saw her right: okay, Danielle. I think you first yeah thanks so much quick question about the 207 street bridge project, I'm just wondering if that was presented at the traffic and transportation committee and then also, if not, I had a question about whether I could make a comment about an idea that I have for that project. Sure I do not think this had been presented. It was informed it was discussed. I brought this information before it's just every pair is painting they do not going to close the traffic. Do you have any idea more than happy to take it and bring it to the contractor yeah? I guess I take that bridge most days and there's a light right before you turn onto the 87 south and usually there's some traffic there, because cars are not able to it's, not a flashing light. It's a hard stop, and so you can. You can't turn while the light is red, so I just wondered if there could be some modification to that which would allow cars turning right onto the 87 to go ahead even when the light is reduced. It used to be like that, like you said Danielle, it used to be right, turned on red right turn on red, but it was suspended after many accidents. We can bring that request again, but it used to be like that, but now it's not like that, and that is not part of the of the reconstruction you know of the painting of the bridge. Okay, yeah, I mean if it's a hazard I understand, but I guess I just thought that it could help with the flow of traffic. Yes, more than happy just send me this request and I will send it to the department of Transportation next question: Francisco God. You need to unmute your San Francisco. Can you guys hear me? Yes now? Yes, okay, happy Tuesday! Everyone! Thank you. So you mentioned. Thank you for the report. You mentioned a shelter. Yes, it's coming to 213 is 10th avenue at the corner of 213.. Yes, okay, how many shelters does the heights and inward already have? I do not know the exact number, but we have quite some yes, okay, what I, what my? What I'm trying to understand is why do we? Why are we like the designated community for shelters, because I'm trying to understand why we have another shelter and this one is you saying this is specific for those with they have a mental illness? Yes, so is that a discussion or is happening? No it going to be brought to the committee to the to the board to the Community board. I just got the preliminary information is not happening now, but as soon as I got it, I send a I sharing with you, because the Department of Homeland services want to engage the conversation as soon as possible to prevent what happened with the shelter on Autobahn Avenue. Our shared person is aware about it, we're going to start preliminary conversation and when it's right to bring it to the community Board to one of the committees we're going to bring it. It's just like a heads up information, I'm giving to you now you're, going to have more than ample time to bring your comment and your concerns in the in the forthcoming discussions. Yeah, because you know we just saw the upper West side, get rid of a temporary shelter and kick a whole bunch of people out, because the community wanted that and I'm just trying to understand why we keep getting shelters to come to Inwood in Washington Heights. While I know that we need it, you know that also brings in a different element to the community that you know. I do not know if we are equipped to handle. I just need the shelter thing to be like shared acrosss, this entire Manhattan, because it just seems like every time I turn around. There's another shelter, that's coming into the community. Yeah like right and mentally ill is a different type of show like yes, you are 100 right francisco. We will have the time to make to have these discussions later when it comes to the meeting. Okay. Next question: please thank you Francisco for your points. Yes, let's move a little yeah wayne, so ebeneze I just I want to follow up on what Francisco was discussing, but you know from my perspective, when we've talked about shelters in the past, it's always been a little too late and you know. Typically, there are questions about whether it should be a shelter or transitional housing who are the service providers? What is their reputation? How well do they serve? You know the clientele, so I think we want to have those discussions in detail. You know up front so that it's clear you know are we, you know warehousing people or are we providing a setting? That is supposed to be therapeutic, and I mean I understand that is a committee discussion, but my point is: I want to make sure questions of that nature, get discussed and get discussed in detail. Sure thank you. Like I said you know our chairperson lsr want to speak one to the provider, the I have a name and we're going to be in touch and we're going to be providing you updated executive committee, General meetings and when it comes to the committee discussion you know we will have ample time with to do to have all those questions. Thank you, Debbie. Thank you. Wayne next question. Please debbie deb, sorry slow on the unmute. I just to address what ebenezer you said about the CitiBike stations I mean. I would, though, highlight- and I know you know this- that the process of placement of CitiBike stations in the network is a process that does involve the public, did, involve and certainly involve the committee and and has been presented to the full board as well and it they will always include a mix of street stations and sidewalk stations. Clearly we have, we have a preference for sidewalk, because we have a preference to preserve the parking that we have, however, to say directly to DOT. You know, that's not I mean the committee has weighed in on this and then the and the board has been presented this and given you know, opportunity to respond to the station. So I just think we need to be a little bit careful, be on sort of. Then you stepping out and saying we can't have any of these. You need to look into all of them because that's not really kind of what the process is and this as a reminder, we will have a process again in early 2021 and we're going to do this all again for the north of 184Th and all these things are important that we all be engaged on. Thank you debbie. I some point of recommendation. If you are a committee chair and someone has a question, we have ample time not infinite time, but ample time in your reports to address them. So that way, we do not circle back to same issues over and over again right, but this was I'm just saying for Ebenezer he's, not it's not direct to. You know it's just as a point of reference. That's this love saying thanks the next person. Thank you, David Next question Aussie, yes, Ebenezer. What is the update about integrating the facebooks the pages? The two pages? Well we're more than happy to do that. We requested that the old page information before water to Jonathan and we're more than happy to do that, but we're talking about it for a few months. So I wonder if there is an update, something was done. No, nothing has been done. We have not received the information from the all facebook account once we have it. Jonathan already has a plan. How to do that. All right question next is Sally yeah, I just Wanna. Can you hear me? I hope so I just Wanna emphasize we've been talking about the integration, the facebook pages for three months at least the public still thinks that our old facebook page, which is not the office facebook page, is where things are posted, and so, when information does not appear on that page, they think that community board 12 is not providing that information. Some of the Youtube tapes and stuff are not making it. You know like when one is on Webex one is on youtube: it's not making it anywhere on social media, so those are immediate problems that have to be addressed because from the community standpoint it looks like communication is being limited. I also want to emphasize or re- emphasize what Wayne said. We now know that something might happen. I think it's important for the committees that are involved, which would include in our case health and environment, because mental health needs are. You know our top needs in this community and those conversations begin immediately and that's it. Yeah Ebenezer I'd like to respond to that one. Before we move on to the next question sally, it will be extremely useful. Almost critical life support like to have you send to ebenezer exactly those platforms that you feel are not in fully integrated that should be upgraded or renovated, or whatever it is so that we can get to the bottom of it at times. During these meetings we lose direction and we lose track, but it's good that it would like take that that initiative yourself and just send them everything that you need all right. I really appreciate that happy too. Okay, next up is Liz and we're wrapping this up with aisha, hi thanks Ebenezer. With regard to the statement of district needs, can you just make sure that you send to each of the committee chairs last year's statement of district needs and then this year's instructions for how the format that OMB wants the statement of district needs, because I know that the format has changed somewhat over time, and you know they keep on keeping us on our toes by mixing up how they want the information packaged. So I think all of the chairs will be in a better position to help you get the whole document together. If you help us by letting us know what was sent last year and what is the desired format and with respect to the earlier conversation on shelters, I certainly hope that nobody upholds decides to favorably, compare us to the upper West side and the racist nimbious that happened down there last month. Thank you, liz. A good news is that we have the estimated district need the last two years up to last year in our new website. Everyone can look at on that. I already sent the link for the training for the new for the this year. Statement of District need, I believe, is another training coming up, and this afternoon I received a phone call from city planning and, yes, you know I'm going to present all the information I'm going to be in touch with every chair regarding that. So thank you next question last night, so I wanted to speak to a couple of things that were said. This situation gives me great anxiety and it just it's ongoing and to hear what is being said as if people are not aware of. What's going on when we have recordings, we have minutes, we have agreed on these things. We have voted on these things right. So, first of all, in regards to the facebook in a previous meeting, I do not remember what month it was. It was either May or June. I brought up the fact that a new facebook page was created without consulting the people who were handling the facebook. Before that I created the Facebook. I put a lot of work into building the audience from our community and engaging people in supporting that Facebook page right oc have been maintaining it in regards to uploading all of the data about any calendar, dates or information onto that page. I also work to integrate it with other things as well. On Facebook now. That being said, we had a discussion where this board decided that the old facebook page should be used and not a new one. The reason why a new one has been created is because of the same toxicity that we have talked about earlier in this meeting. In that meeting, we agreed that the old one should be what is used, because there are thousands of people on it, birth of the 40 people that were on the new one that was created because people refused to communicate the way that they should oc has continued to people have a problem with me, specifically because of positions that I have taken, and I'm fine with that. I will stand on that right, but oc has not been that type of person on the board right. There was no problem communicating with her she's, been working with the office for a long time with no problem. So why did? Why? Could not anyone say, hey oc? Let's continue to do what you've been doing. Here's the information that needs to be provided, because there's all these sinister dynamics that are happening on this board. So, let's not act like we do not know what's happening here. What happened is that we should be using the old facebook because there's nothing wrong with it now. That being said, in regards to the shelter situation, in a meeting that I sat in with the department of homeless services before being wrongfully removed as chair of housing and human services, one of the things that was discussed is that the dynamic within the city is that contractors who are providing their buildings for the purpose of being vetted to be a shelter they buy those buildings. They build them out to spec before the city even buys into it. So it leaves us really. No, it leaves the city in a position where they feel like how can they ask for what they want when the contractor's already built it out to what the contractor wants it to be, and that's to me is happening in reverse. I believe that Robert Jackson was in that meeting, I'm pretty sure that carmen De, La Rosa was in that meeting. So that's something that you can also circle back to them to gain that understanding, but I also bring this up to show the that, with the changing of the guards, there's no attempt that is being made to make sure that the work that has been a lot of a lot of stress and effort and sweat has been put into making sure that we stand in the gap for our community. The ball gets completely dropped because of people's personal vendettas, and it is ridiculous in regards in regards to the bike. We also had a conversation where we discussed not having CitiBikes on the block of 169Th street outside of the plaza they ended up there anyway. So that also is something where the ball has been dropped. That's my that's what I had to say! Thank you. Thank you for your comments. Ivan Isr, since we it's been a little while it's been four or five months since we sent out city, chatters rules and regulations on social media. If you please can resent them, and let's please be conscious of our time when we when we use it. So, just as a point of information when the most recent round of conflicts of interest training hosted by the borough president's office, I raised this very issue and you know Natalie can help us by going back to that source. It was. It was clear that the and I did not specifically refer to CB12, but the website for the Community, Board or any city agency should be set up by that agency. There are some representations. The agency needs to make to do it in setting that up and the Community Board did not vote to keep the old one. What we did vote to that say that all of the contacts should be transitioned to the official CB12. You know page. I was looking for back to it. I know, but my point is my point is, and I did not interrupt anyone when they were speaking. Thank you. My point is the board needs to be careful to check with what the conflicts of Interest Board has said that we or any other city agency needs to do. Vis-, a- vis, setting up those sites and to follow those rules we did. There is nothing wrong with transitioning the contacts from one side to the other, but there is, from a technological standpoint, comply with what the conflicts of interest boards said. We need to do. Okay, thank you, Wayne. So do we have any more questions? Catherine, I mean questions. Anyone that raised their hand, no all right. So it's moving forward to the public session wants to say something. I thought was all your old hand from earlier Sir, it's liz again. You've already had a turn, two very quick things. One is. I was wrong, you're going to want to write this down. I was wrong. Jim was right. That's not so unusual. A point of information is actually according to Robert's rules. A point of information is when someone has a clarifying question. A point of information is to get information not to give it. So I was wrong when I made that point of information before that was me just saying something. The other thing is there was a small mistake on the committee of the whole minutes, which is why Paola did not send them out. I corrected them. She has just sent them if people feel like multitasking and reading it. We can vote on it later in the agenda. If not, it can wait till next month and third thing is: were you going to have an election on the assistant Chair assistant secretary? If there was anybody who wanted to be assistant secretary, I think I think I already said that we're going to get circle back to that. So you, this is the second time you bring it up all right. Yes, tonight, okay, great thanks! Thank you! The public's public session, catherine. I'm going to keep the two minutes, I'm going to enforce it strictly. So those of you who go further than two minutes: great okay. So for public session we have five speakers and we're going to start and, like I mentioned in the Q&A, we'll unmute, you and I'll say your name. If, for some reason you get disconnected or you do not hear, I might be able to edge before we wrap up so first up is cynthia. Actually I can't unmute folks, so if Jonathan or Ebenezer, if you can unmute them great, can you hear me cynthia? How are you Yay great okay, tell me when the timer starts. All righty time is now hi everyone. Well, first of all, thank you so much so my name is Cynthia carrion and I am speaking on behalf of school in the square. Our new school dos Amigos on 108 cooper street is open just to let everybody know that we do have our kindergartens in school four days a week, Monday through Thursday, starting with breakfast and optional drop off at 7:30 and after school, we're keeping them in small pods. Also just wanted to share that. We've also been approved. An outdoor learning streets permit from Monday to Friday from 7:00, am to 4 pm before we start that we definitely wanted to reach out to the community and work with them. We really see ourselves only using the street during lunch so that our kids have more space between the hours of 11 and one, and so just wanted to firstly, say thank you so much for all the support and also wanting to work with folks, especially in that area around the street closure for us to start using the outdoor learning streets. Oh and we do have two spots open in case you hear of any kindergartner interested in dual language and that's yeah. That's it open to question I'll, be calling you so yeah. If there's anybody who lives specifically in Inwood around Cooper Street and wants to kind of work with us or think with us on how best to start operating the outdoor learning streets. We welcome that and we just did not want to just you know, put up the signs without making sure we talk to the community. First, all right, thank you, Cynthia and under the two minute mark all right. So next up we have Gary Alpheim Dr Gary. Can you unmute him? Please he's not on the list anymore. Okay, we'll move on to Temple, and if I butcher this, I'm sorry but Temple Kamisi's commences temple, you should be able to say something there. You go guys. Tell me it's right now there you go all righty okay, so I guess, while you figure that out we'll move on to the next, we can always circle back to your temple. She emailed me something I can read her announcement at the end. If okay, would you allow her to move on and then we can get back to Tim yeah exactly so? Next up is Sharon with bike NYC Darren, Pop, Marshall, Pope Marshall. Excuse me hi, everybody. First of all, thank you, catherine and cheer person Bueno good evening. Everyone. My name is Sharon Pope Marshall. I am the director of outreach and membership program at Bike, New York, I'm happy to be here. Bike New York has cycled the streets of the big apple since 1977. Most of you might be familiar with us through the five borough bike tour that we have annually in May, which of course, was canceled this year having biked the city since 1977. We see that our beloved city continues to be terribly impacted by the Covid-19 pandemic. We appreciate all of the work that you're doing and what you have to grapple with as well. Cycling forward is what we do and with that in mind we are doing a twist and pivot as you are, and it is with no small amount of pride that bike New York is excited to announce our very first virtual cycling event called Spoke S- P- o- K- E Tober spoke Tober, which is happening in October, we're inviting everyone to ride, and I will leave my contact information as well as information about pulse spoke, October, try saying that quickly in the chat space and I'm always nervous around timers, but I'm wrapping this up right now. Thank you very much. I appreciate the time given for me to participate in the public session. Thank you so much Sharon. Thank you. I'm sorry! Steve! Do you have a question for Sharon? Can you just raise your hand Steve you're, my mute. Can you hear me now yeah? I can hear you Steve. Yes, is Bike New York going to run a some kind of a special program in Fort Washington Park at 158Th Street sometime soon, I'm not sure about that Steve. Is it possible that I could send I'll reconfirm that and send the information to the board office to communicate that to you yeah it's the location yeah at 158Th Street in Fort, Washington, Park, you're you're, installing a trailer? Yes in Riverside park you mean at Riverside park. Well, okay, you can call it Riverside, yeah, okay, what should I call it whatever you'd like it? It's it's on the border between the two yeah, oh okay. Yes, so the answer to that is: yes, I'm you I'm sorry. I'm used to calling it Riverside park. Yes, that is true. We are hoping we were invited there by the Riverside park conservancy and we're hoping once the Covid-19 pandemic is a little bit more managed. If you will we're hoping to begin to have some in- person bike education classes, there teaching people the rules of the road how to ride a bike properly confidently within an urban environment and how to navigate our city streets safely again, knowing the rules of the road all right. So at this point there is no date for it. I will get that information to the board office. I do not have a specific date with me right now: okay, very good. Thank you Steve. What was that next question? Next up is Joyce collins yourself, sorry, the fourth person Joyce. Can you hear us? That's a shame. We have a big report. I guess I'll circle back to Temple who was able to come back on while Joyce breaks her Mic and if Temple did right, that they were having issues with their mic and if anything, yeah, probably her mic is not working because she's actually admitted she attacks. Yeah. Do you have their report? I do yeah. She said. There's something about the privacy settings or something anyway, hello, community leaders and higher ground friends is with great excitement. I get to share with you that we will be hosting a 2020 higher ground festival. This will be a virtual season of live. Performances, live streamed from a rooftop terrace via arts on air. Each performance will be one hg premiere. Collaboration presented at 5:30 pm on a Saturday or Wednesday starting October 3rd live streamed over various social platforms, so October 3rd is going to be howl, double take dance and Sarah Lowler October, 7th communication in limbo. Spaces of waiting space is entangled, October 10th is ignition. October 14th is something called. Are you carrying more than you need and October 17th once for the one for the ages? For those of you who do not know the higher ground festival is a collaborative arts platform where artists from at least two disciplines perform live. It's great stuff check it out I'll forward the flyer to the board to share with you. Okay, thank you thank you, and we have thanks for that. We have Joyce, oh finally, good hi good evening, thanks for allowing me to address you this evening and it's good to see so many familiar faces, Liz Wayne, Maria, etc. I do not know if you know are not. I am the chief for division, four for a community emergency response team. This month is preparedness month for cert, so we, you know like to beat the drums and let you know that we do exist and we're the civilian group that helps the police and the fire department and also any activities major activities that are helped that are going on in our neighborhood in Wood, Washington Heights, we're always looking for people as members. Now, I'm always looking for new members, and we've done quite a few things since the beginning of the year regarding Covid-19, of course, so you know we're always looking for folks. If you're interested in joining you can type NYC cert in your browser and you'll, see where you can take courses which there are plenty and as a result of taking courses, you might find yourself in a new employment. So all of these things are available to you and I hope that you decide to join. Thank you. Thank you for your important presentation and I encourage you to reach out to our public safety. Chair, Curtis Young is also on the line. I think your presentation requires a bit more of a of a time length so that we can. Those of us will have the time joining and participate and contributing whichever way we can. So. Thank you for your time. Hopefully you guys can connect or even user can. Please have make that connection between the lady, which I forget her name. Sorry and Curtis. Do we have anyone else? No, okay! No! It's Joyce! Holland she's! A long time friend is not that what you just read off of yeah. She just spoke yeah Joyce Holland is the one. Oh you're there exactly I'm going to miss you, man anyways not going anyplace, but I know I need you to keep. I need you to keep a thai lead on me at times resolutions we're going to move on to have our one of the hardest. Working committee chairs, Cedric Medina, go over the new 18, I think actually 14 or 15 resolutions that we should consider. Thank you, chair for giving an opportunity to a report on the findings of the community. Before I do that, I'd like to share some links with you about the New York City, Hospitality and alliance report, saying that you know June, July and August. There was a percentage of 80:83 and 87 of restaurants that could not pay up the rent. It's very alarming and I think that we should be careful as to how we proceed as a community board and moving forward with all these licenses. Also, I'm going to share report provided by the business insider what they speculate, that about 90 of all local independent restaurants might not be able to stay open until December very alarming. I also share with you a link about dining the dining policies and regulations are set for by the state and the city. So I will share that in case that you do have someone that need to have some need. Some assistance feel free to share the link with our local operators. So in essence, going back to our committee report, we had 18 licenses as it was reported, seven of which were renewed. They all passed. There was one class change and one corporate change. There were three licenses that were withdrawn on the new licenses. There were six two passed, one was withdrawn and three did not pass because they show up to committee. That includes agenda item number 14:15 and 17.. So the agenda item in question number 15 that was rejected by committee, because once again no one showed up I'm going to open up the floor now for questions and I'll share the links. Once I have an opportunity, so you can like take a look at the report. I see that elise has a question. Steve had his hand. First sorry go ahead. Catherine you wanted to do that. Yes, it's Steve, Liz Aussie, Steve, yeah, hi Sidro on the numbers, 12 and 13 we're approving their request to have djs and live music. Is it clear that this would only apply once indoor dining is allowed that they can only do this indoors? This would not apply to the to the current outdoor setup. Would it all right, Steve and that will only apply when we go back to dining inside and having music outside of speakers is actually illegal. So if there is music outside on a speaker, that will be a violation by the SLA. So indeed, that refers to when we go back to our inside dynamics, take phase September 30th and is that clear to these two applicants? Do they understand that? Yes, completely? Okay? Next one, please? Yes, yeah! I'm just curious! I'm! You know mindful of the situation that just happened earlier with a public speaker who wanted to say something and they were having like some technology issues. You know I love this zoom format. It really is helpful in so many ways, but when somebody is having a connectivity issue and they've been in a zoom for the duration of the meeting and then all of a sudden, their computer, craps out or the battery dies or whatever their you know, their spectrum farts or something and then they're off, and then they get called up. Such has happened with the folks representing crack and peel item 14. They were actually at the meeting, but by the time they got to your their turn. They were not at the meeting, so you know not unreasonably. You were not able to do anything with them because they were not in the meeting at that point, but there was no mechanism to you, know, reach out to them and to call them back and say: hey what happened. You know you were here for two and a half hours or however long it was. You know to invite back, so I'm just wondering if they I do not really know what to do about that, like I do not feel like, I can vote for them, given that I have no idea what they would have presented had they been able to come back, but I feel kind of bad that because of the technology, they were not given the opportunity to dial back in right. Thank you, Liz and that's a very really uncomfortable situation, because I understand that the lady was waiting for a long time very unfortunate. The problem was that the committee had already voted on the matter and the votes could not have been undone. Procedurally speaking, of course, no, that my understanding is that, once the vote takes place, we have discussed two agenda items after that, so to go back on the agenda and redo the vote. It was something that, from what I understand in Jim correct me from wrong. Once the world takes place, you can not undo that. Let Jim respond that because it's a positive question so stand a problem. Explain the details again. So it's very clear! So the licensing committee there was one applicant that we called we called once twice. The applicant was not there. We voted to reject a passed as a rejection. Then we moved to the next agenda two agenda items after that, after two agenda items, the applicant came back saying that they needed to be on the on the floor and for us to entertain the applications. At that point, I indicated that it was procedurally not possible to undo the vote that already taking place off of the applicant. Unfortunately, that does not quite sound like a very reasonable way to assuming again and which you did not mention, but I sort of picked it up earlier. If the person had been at the meeting and then because of technology disappeared- and you could not get a hold of them, but then they came back then in some sense they're there again, and you know they should be treated as though there was this. You know time lapse now. If they never came back, then you know what the committee did is perfectly appropriate, but since they came back, I think it's you know far more, just among other things that they be heard. It's something that we were willing to to do, but we have many experiences where folks come in and out and they and again I'm not saying that this was the case for the listeners musical in the Youtube gallery for the duration of the meet. You know in the little Hollywood squares tiles for the duration of the meeting until just prior to the meeting, when you know quite unfortunate, and I I'm not blaming the committee at all- you know it's like you can't control people's crappy technology and it's a really unfortunate fluke of timing that right like right before her turn is when her technology decided to give up, but it just it just seems like there are some weird accommodations that we all as chairs and as board members have to make based on you know this quirk of technology that enables access in so many ways, but offers a whole extra set of problems. So you know if I could reinforce something. If you do not mind, if I could add something to that or you know look at it in a slightly different perspective. To begin with, the timing, of course, is Murphy's law. When else is the thing kind of cut out, except when you need it, but the issue is if this behavior happened at a let's call it a brick and mortar meeting, an in- person meeting some group was on the agenda. They decided to waltz out, you know were not there when they were called then decided to Waltz back in and decided. Now we are back now. We want to be on the agenda, that's a whole other story. This is not a cabinet. Let me just let me just finish and you so that you know that's how it would be in a normal meeting. But here again, if it's a technological glitch, I think we have to bend over backwards. You know to again make our procedures as fair and just as possible. I I'm going to see how we're going to perhaps put a process in place in the future, because when they come into the meeting it does not say who they are. So I can see many phone numbers and it's hard to identify who's who, so I actually have a suggestion that might work for that at the beginning of the meeting. If you take like a quick attendance to see what are the names, because it might be the name of the person on the application, in which case you know that what they're there for, but if it winds up being like their lawyer or somebody who's different from the name on your paperwork or a phone number where they're dialing in at the beginning, if you just make a quick check of who do, I have for items one through whatever and then, if someone drops off the call, you can have another of your committee, members call them back and say: hey. Are you having a technology point well taken and I'll? Take that as a positive step? Thank you so much liz. Thank you. Next episode, okay, I'm just going to say one more thing about that Isitro. I think you can tell the applicant that they can come back next month anyway, because they can. Yes, we do that yeah, so they can just come back in terms of the I've tried to find myself in minutes and I have to say it's lacking so much information. So I went to the resolutions. There is no indication why you approve or disapprove any of the applicants and one of the things that really was really interesting. Is the resolution number 14:15 and 18.? It's not clear if you're going to reject them, but what you said here and I'm assuming this is what's going to the SLA. The last line applicant did not show up at the meeting. Therefore, the licensing committee objects to the new on- premise: liquor license for blah, whichever they are number 14:15 and 18.. Is this a final resolution that going to the SLA? This is a recommendation to the board. The board will decide whether or not it's going to be checked or not. This is an opinion sent to the General Board which we're discussing now, but there is no resolve. There is no. Where is nothing there is just they were not there. Therefore, we do not know so I'll. Take that as a friendly amendment. Also, I'm not trying to amend anything, I'm all, I'm saying is, that seems like an either incomplete or maybe the revision that was sent out was not the final one. When we do not have anyone present. Other committee votes are usually against it and it will come in a formal resolution saying that be resolved, that you know. For that particular reason we would not recommend a set applicant to receive said license right. So it's. What I'm saying is the wording. The language is not there and I'm saying that I would like to add that as an amendment okay and are you ready to vote on so we have Gerard and Steve. So Steve spoke at the beginning. It's going to be Gerard, Mariela Steve, so Gerard go ahead. Okay, gerard! Well! You figured your mural Mariella about resolution, 16 the hours of operations. It says 4 pm to 2 pm. So that was one question and the second question was just following up on what OSI said: are we supposed to make our decisions based on this limited information that is presented to us, or is there more information that we could have or should have before we vote? So those are members that did not show up to committee, there's no way to have any substance to report back to the General Board because they were not there. So we can only based on the fact that the merchant was not. There therefore recommending to vote against this resolution because there's no conversation with them, so there's nothing to report. So that's the amendment you're doing right now right for those okay. So it's a negative resolution is that what you're saying correct Maria my question is they have a choice of coming back? Who present to the ball in the future right? This is not. We are not rejecting the application as it was presented to the committee. It shows that since they did not show up for whatever reason they do have a choice of coming back and then they know the rules. This applicant was recommended to come back for next month and from what I see in the gym that they are already on the agenda for next month. Thank you, Gerard is your mic working? Can you hear? Can you just answer that other question about the hours of operation because it's there seems to be a typo? It says 4 pm to 2 pm. I got ta check my realtor minutes. It must be. I can back you up there. You see that I remember. Oh, yes, please Leo yeah. This is the they wanted to have live music. Remember so it's it should be. It should be up until 2. A.M is what it is. Thank you. Can you hear me yeah go ahead, oh you can hear me. Yes, we can. Oh I'm sorry great yeah, so I just want to tell you because I know there's going to be future meetings to date. Zoom meetings on license committee. I think the applicant who said she was she was not able to be on or not I'm not so sure she was off the Zoom meeting. I do not remember so, I'm going to say I'm not sure, but I can say this is the first time this happened and in a in a brick-, and- mortar meeting like Jim says we it's not it's not been. It has happened infrequently where people come to the meeting and they just choose and get up and walk out. They do not want to spend their whole time at the meeting and we had people come in after they left and we you know if we had voted and they were gone, we would vote how we voted. So it's consistent now with the way it has been in the past and one of the other things since it's under normally it's the only one. That's happened so far. It's likely she probably was on people kind of fall asleep in their zoom when they go on their mutes, sometimes they're there they're taking care of their business. We have 18:20 25,30. Sometimes if we're going to have a number of people who are doing other business who have muted themselves, get lost in their work and then are going to actually make us work longer and harder because they did not pay attention. I think we should probably have some process to actually not make our night longer, because people are not paying attention so we'll have to find some balance there. I do not think, let's make us work longer, though. Okay, so we have three more hands for this section and that is Steve Angel and Debbie and Wayne. Am I up nasty, okay? Well, I feel really, I still feel really bad about crack and peel and it- and it does look as though we're going to be punishing them by voting on a resolution objecting to their liquor license, even though there appears to be some some question as to whether or not there was a technical, technological glitch or some other reason why they could not be at the meeting now, if we're inviting them back next month. Can't we just table this resolution, so we do not have to vote to punish them now we have traditionally killed, as you say, all resolutions that are that do not show up. This is considered no show. The applicant was informed clearly to come back next month. She's already on the agenda, there'll be no punitive action taken by SLA when she comes back next month. She qualifies to get that full life, because so why should we? Why should we vote tonight? Can we just table this steve? We have done this many times. If you want to go a different route, it's okay, but we I just want to be consistent. Well, I you know, I mean if we're going to end up voting on another resolution next month, it seems motion to table. Is there a second? Now we vote on whether we table the motion? Is there any objection, because we do not ask a roll call if there's an object? Yes, there is an objection. Okay, so we have to do a roll call oc. You asked me to do the roll call. So yes, you do not mind. I will do the role Liz. Let her do the roll call since you no longer, but I no wait if you resigned, you as a secretary should take the wrong call. It's that simple. It's not that complicated! I'm sorry! I still have it because this is my first time. I'm asking oh you mean! Oh, I see. Okay! Thank you. This is not going to be a regular gig, but it's not edition. I offered okay yeah. So this is a roll call on just this one item on whether to table just tabling this one item. Marielle is there discussion, people have hands up. No, I can not. You can not discuss emotions at the table. The hands are up or wait point of order. A table. A motion to table can not be discussed. It's not discussable. It does not matter whether hands are up or not. Okay, we can't make clear what we're voting on the normal procedure in the committee is. If you are not there, when your name is called you get, the thing voted against you and then you can come back next month. The alternate view as I understand it, is that, because this was a technological glitch, we do not really need to do that, especially since they're coming back next month so tabling it. Would we just would not vote on it tonight and let whatever happens next month happen or we can. You know not table it and then go on with what the committee normally does so the table in its gym. So we can start with the roll call is that we are bringing this back to agenda next month and that we're not going to object to the resolution. That's what we table in order all right so to be clear on our new nowhere folks do any of the newer members have any issues or any questions. I do not want anyone to be left behind on an issue that you know. Usually the people that have the more knowledge of issues usually dominate conversation, so those of you who are not familiar with the process. This is a good time to ask any questions. The newer members, no, yes hi! I I'm confused. Thank you. Could you please just explain? I do not know. What's going on Jim I'll, essentially reiterate what I said normally, if, when people want a liquor license, they are put on the agenda of the licensing committee and when we get to that part of the agenda, if they do not happen to be there, they walked out or never came or whatever we automatically reject the application. That's the normal way that the licensing committee works. Now in this particular instance, things were different. There was a person who had been on the Zoom meeting, but then right before it was their turn. Apparently we lost them. They disappeared through. No fault of their own- and you know the committees treated that as though they had left the meeting and they did their normal thing. They voted to reject the application, but a few minutes later the person was back and the problem was not that they walked out. You know not being there when they were supposed to be, there was no fault of their own. Now the committee continued with its procedure because that's the way the vote was done thing, but the discussion we had just recently the last 15 minutes or so many board members feel seemed to feel that, because it was a technical glitch, the committee should not have followed that procedure and let the people talk once they, you know, reestablish their connection and therefore it would be unfair to do the automatic thing and reject them, because they were not there because it was not their fault. So the way we avoid rejecting them. If that's, what we want to do is we table the motion and we do not vote on that tonight. But if you feel that what the committee does did, which is consistent with normal meetings, you know the re that then you vote not to table the motion. I hope that was helpful. Yes, thank you. I appreciate it. I have a question. Thank you, Christina for bringing that up. I have a question forward: angel yeah. I have a question so again. This is my first go around at this. If we reject an application tonight does that person- and I know that that's punitive in the sense that we've submitted a written statement, saying that there has been a rejection by the board. Does that person then not have the opportunity to show up next month and apply regardless they've already been invited to next month and they're already coming next month, but it may be superfluous because of the technical glitch to actually reject them. See that's the more the finer point. How does this change? I guess my question is: how does it change the ultimate result for this person? Oh, it does not change the ultimate result, but it's much prettier. I think if we do not reject them because of a technical glitch at least that's the view of some people and it's my view as well. We do not know if it changes things we have no way of knowing. If the SLA is going to look at the thing and say: oh, but you had this rejection before, but an acceptance now we do not know okay and then. My second question is what is considered a technical glitch as somebody who participated in the meeting there were about 15 to 20 minutes that went by between when the person was called and when the person showed back up. So what is a technical glitch? I think that's a judgment we as a board have to make. If we, you know, feel that it was a technical glitch and you know we want to treat technical glitches in this other way. Then we can vote one way and if in our minds it was not a technical glitch, you know it was the same old thing. Then just vote not to table the motion and we will vote on it tonight and again, as you pointed out, and the questions people are asking are really excellent and, as Eli pointed out very helpful, you know in the big picture since they'll be back next month, they're not going to be hurt by this particularly badly, but on the other hand, as Liz pointed out, who knows what the SLA is going to do, but if we do not send them a resolution at all they're not going to do well, then they'll do something too because they'll go. Oh, we did not get a resolution, so you know it was about five minutes all right so before we get around and running around. So let's just move on rock call. Let's just get this going. Mariella Lee! I just had a point information. But anyway can I just ask one more thing to Jim Please Dr Eli? Could I say something two seconds two seconds: let Francisco ask this question and then we'll get to you. Okay, I just advising the legal license. You know our opposition and they have a right to deny or approve a legal license over our decisions. I mean that has to be clear to the members of the board our decision not a final decision unless they are committing a crime or anything like that. All right, Francisco, you had a quick question. Yeah quick question is a no vote or an abstain. Vote help with that process, or it's just like voting no as far as abstention is basically and just to take an extra two seconds votes passed by the number or issues passed by the number of votes for them. So votes against them do not help matters and abstentions are not for the resolution. So in terms of the tally, they count exactly like no votes. Okay, so List Mariella, Lee, no Richard Allman is Richard Allman on the call he was and he was muted. How do you vote on the motion to table? Yes? Francisco Alvarez is Francisco Alvarez on the call Mary Anderson; yes, Glennis, Aquino Gill, yes, Wayne Benjamin, yes, Jim Berlin, yes, Tanya Bonner, yes, Daryl Cochrane; it's dane nobles Crawford, yes, Robin Cruz, no waldie's cruise. Not on I'm sorry! I did not see him. I do not think he is in at the meeting: okay Gerard Dangle, no catherine diaz, yes, Natia Diaz, yes, Domingo Estedaz. I hope with this president. Everybody got the same benefit of the doubt. Yes, gabriella estrella, yes, Ashley Fernandez, yes, Sally Fisher, yes, Faye Floremon, no Barbara frazier, yes, Mariela Graham, yes, Juan Guzman is Juan Guzman on the call. I do not think so. He's not. Thank you mayor. Excuse me Danielle Jetu, yes, Leopoldo Jimenez, oh Yosef Kalinski, yes, oc Caminar, no Betty, Lehmann, Francisco Lopez. Yes, I vote yes, Maria Luna, yes, Cindy Matos is not on a call Jay Mazur, not on call Cathedral Medina, no Ariel Miranda excused Debbie Nababian; yes, Jonathan Nunez for Meta Abstain, Aisha, Ogilvy, Yes, Rosie Perez. Yes, thank you! Paradise Phoenix! I vote yes, Christina! Richie! Yes, did I pronounce your last name right? Riches? I'm! So sorry, it's okay! Thank you! Bruce Robertson, yes, era, Santiago, yes, Steve Simon, yes, Omar Tejada! Is he on the call? He should be, I'm not seeing him. Oh yeah, he is Omar. I see you, I can't hear you omar. Can you throw your comment into the chat and on you? Can you unmute omar? If you vote yes raise your hand, I think he's not he's there. Probably he stepped away from the computer. Can you guys get go back to him yeah? I can circle back to him. He's actually just raised his hand. He just raised his hand. Okay, if you can hear me knock twice on the ceiling. Excuse me board. The votes have to be audible, so, if omar can, please call somebody ebenezer or eliezar and speak into their phones that vote okay. Thank you. Angela vasquez, no Chris Ventura is Chris Ventura on the call he said he was not going to be able to make the meeting okay. Is he absent or is he excused he said he had to work late? That's absent! Curtis, young! Yes, okay! I do not have an exam. Oh elias, Sarbueno, Abstain, okay! Well, this is not here. One does my variant, james, absolutely absent excused, so we're just waiting to hear on Omar Tejada. I do not have an exact vote, but it's overwhelmingly. Yes, it's more than a quorum, so the motion carries, but I'm going to wait on an exact tally until we hear from Omar to Haddad and waiting for the one that you're waiting, there's eight no's 31, yes, okay! Well, I can give you an exact tally when we're done, but the reality is there's more than with more than 30 yeses, regardless of how omar votes right, it will still carry. So I will wait for the final tally until we hear, while this is going on I'd like to make a constructive recommendation to ebenezer in the office as it relates to this issue. We noted during this vote that there is a number of people that are on mute and some of them may have a technical difficulty or may sometimes people walk away from their computers. It's not it's not unheard of in the land of zoom meetings so because we have anywhere from 20:25 30 people. I think the office should put that it's very important that licensed applicants that are coming to our meetings must do their very best to stay engaged from the beginning of the meeting to the end, because we have a lot of applicants every at every meeting, and this was an anomaly and we spent a lot of time on it. But people should know it's their business to stay on the meeting and not go mute and go do other things they got to stay on it because we'll have a lot of this happening. Can you hear me now? Yes there we go. I vote. Yes! Is this omar? Yes, it's omar! Thank you. Sorry about that. To be fair, what just happened with Omar has happened at past meetings with board members trying to vote where you know, for whatever reason, their audio connection is gone, and I will say that the first two community board Zoom meetings, the first one I could hear and see everyone. There was absolutely nothing I could do for anyone to see and hear me and the second one. I could not maintain a stable connection. So this is not really an anomaly and you know, depending on your wi- fi connection, other things you can drop and if I were to drop on my Microsoft surface, it takes a long time to reboot so much so, let's just kind of like move forward. We're going to now move on to the Mary Anderson's resolutions to give priority to seniors and disabled intern vices Mary. Excuse me: we did not vote on the licensing committee resolves. There are more residents, there's three more there's three more there's three more rezzos and we'll do a full roll call on all of them. Oh, I say: oh okay, very good. Okay, Sarah Committee has a resolution to give priorities to seniors and disabled entering businesses. We've been talking for a few months now about the difficulties that seniors and disabled have been able to have had with long lines at a variety of businesses and having to wait their turn along with everybody else, because nobody wants to make any waves. But the point is that seniors and disabled. You know the little old ladies and the disabled. People have a really hard time waiting in those lines, even if they're able to sit on a roll later or in a wheelchair. The idea of waiting those that length of time is just impossible for a lot of people, so we wanted to come up with a resolution thanks to Sidros and Domingo's input after I, you know, spoke at length with them about how we should approach this. We came up with a resolution and I'm assuming I'm hoping that everybody got it and read it or do I need to go through it received. What do you think we are? We all got it okay resolved. I can read the result yes resolved. We have actually to resolve the result that seniors and disabled be given priority to enter the necessary businesses, to be able to complete banking mailing and buy items necessary for survival, such as food, medicines and other necessities, and be it further resolved that this resolution be communicated to Washington Heights, Bid, Washington, Heights, Chamber of Commerce Washington, Heights and wood merchants associations, local merchants, restaurant associations and is there anything else Mary? Is there anything else that you'd like to add to your resolution that anyone that wants a friendly amendment or something to add at least I have something to add? That's why I raise money. Catherine, please take this tax, please yeah! I have this stock access. Okay, I'm going to go away, but because I can't raise my hand as a co- host. I have my hand first, okay, so who's this. Oh, I just me and then it's Tanya Wayne Barbara Jim, so we have five but really quickly. Mary. I just wanted to like publicly give you a shout out to you and to the committee for the first resolution coming out of the aging committee oftentimes aging. The committee of the aging tends to get cast aside as less important, and we know that in this time frame it it's the most important. You know on the same threshold as everyone else, so I just wanted to give you that shout out and I think it's a great step forward, a round of applause people. Thank you. Thank you. Everybody now go ahead. Tanya, oh yeah, sorry, catherine! I did not realize yeah Mary yeah. Thank you. I just had one question: do you want to add what times you think they should have priority? Is there a Pacific hour like seven to eight and A.M like what I do not know? If you want to add something, add that, in terms of the specific hours you want them to have priority access? The answer to that is no, because some of the businesses do have hours for seniors and they're like eight to nine in the morning, and you know, there's a lot of seniors. You know some of them have helped have home attendance. Some do not and trying to get ready to get out to a business. To do you know yeah. I guess you know some seniors do get up and out that early, but not many that I know of and to come to. You know with a specific hour. Just does not work for everybody, you know. So what we you know, what we're trying to do is to you know, have people be able to be allowed to come to the front of the line and enter I got to God. Thank you, yeah. I got you. Thank you. Sorry, I should have read the I should have read the read out the read out the, whereas before that, okay, whereas before that, before those resolved priority for entry and entry into these, businesses needs to be given to seniors and disabled. So accept that answer that question you know Gotcha. Thank you. Okay, thank you. Tanya yeah, just a quick question Mary with the result for seniors and disabled. How are you I guess defined or how are seniors defined? And you know how is that identification to me made? And I say that, because you know I had a doctor's appointment last Friday and the doctor was, you know telling me all about. You know old agent, I'm three years older than my doctor, and you know he did not believe it. He thought I was you know 10:12 years younger than I am so. How do I get priority access because no one's going to believe it so you're right, d- wing? Well, you know, that's my question. Put it this way: okay, I'm a senior and I'm sort of disabled in the fact that I used to have to use a rollator and I also just had sold shoulder replacement, but I'm disabled. Are we saying the frail elderly? What are we saying about seniors? That's my question! Well, age, 62 by the department of aging, you know seniors! I mean I do not know you know I mean I'm hoping. My hope is that you know that seniors. Who were you know 65 and running around the city, all the time and working still and all that will not be asking to get in front of the line, but be that as it may, you know it may happen. Okay, catherine, we will happen. You know we'll cross that bridge when we come to it. I do not know if we can get so specific that you know I mean because some seniors do not look like this they're older. Okay, as you indicated, and it is what it is. You know. Okay, next up, you have Barbara and there are people that have a disability that you can't tell that they have a disability too. I want to pick up on what time you said. I think that we should request that there'll be signage in stores, let's say no priority access for seniors and disabled, because otherwise that leads to arguments so that should be part of the be it resolved. That's the stores post that priority access or some wounding, like that priority access and header line for seniors and disabled as to what constitutes a senior, I believe, the department of aging says seniors, are age, 62 and older. So I mean that again, as we say that our shades of gray, my grandmother at 90 hardly constituted a senior. But you know there are those 50 who are so let common sense prevail, but I think that speaking, who is the legal definition of senior in New York state? But I also think that the button you made the important pointer ask you the important point Mary about the time frame. There are in other areas of the state where they have special senior hours. You know seven to eight in the morning. Well, you know come on, that's not reasonable and that's why the I think the resolution, whereas it should clearly state that it's during all operating hours, to add that I'm sorry repeat that for that during I should say during all operating hours, okay be given priority. I accept that as a friendly amendment, all right, so we're going to take four next question. Yes, yeah! Well, that's yeah! If you're next cat, they will say so I'm just saying that we're going to take at least four more questions, so we can move on to the next presentations from transportation committee. So the next four are Jim Aisha. I just wanted to make sure when my colleague spoke of the little old lady. She also meant the little old men, absolutely nope. You are cute, especially if their name is Jim. Berlin, never said that the next question, aisha, I think you said yeah. It was my experience at two different bank branches that they were operating by appointment. Only so I believe, that's for all customers, but definitely if you wanted to establish a new relationship. So, even though this would not benefit me, I think it should be also included that if a senior goes to a branch for any type of service that they should be allowed to enter at the times that I went, there was actually nobody in the branch, except for maybe one customer in one instance. So you know, I think that seniors should be afforded the opportunity to be serviced when they, when they, you know, go to the bank. Okay, and what did I say: Sorry Marianne, Hi Mary. Thanks for this. I just wanted to make a suggestion. I think not just for this particular resolution, but I guess to the board as a whole that when we refer to disabilities, that we use people first language so instead of saying disabled, say people with disabilities, their people first before their disabilities. So there are three references of disabled in this current resolution, so I would recommend, instead of saying, for instance, whereas seniors and disabled that it should read, whereas seniors and people with disabilities. Thank you. I accept that as friendly resolution, Domingo yeah Mary, so congrats for pulling off the resolution. I was talking to one of my artist friends, so what we could potentially try to do is create the posters and I'll sit down with you, so we could like prioritize our elder posters and we could like send it out to businesses and they can put it outside if that's cool with you and as far as, hopefully that could be an expenditure that could be taken up by the board and I'll get some of the youth. I work with to do it as community service to distribute it throughout the community cool. Thank you. Do we have anyone else, cath, Daniel hi. I just want to echo what was said earlier about how not all disabilities are visible. I think that's really important and also even though Wayne was sort of joking. I think it is important that we have some language about how you do not have to you just sort of have to self-, identify or express that you have some disability or handicap that requires you to enter so ensuring that they're not required to present any sort of document, I think, would be important. You know. I think this came about too, when you know we had the that only the disabled and the seniors could get on in the front of the bus. There were people that got in the front of the bus that did not look like they had anything wrong with them, but obviously they had a disability of some sort, and you know it became evident as you rode along on the bus with them, but you know so you know you just I mean I had surgery yeah, I can barely walk, so I definitely can't stand, and so I think that's just to the point that less abilities are. Thank you. Thank you guys. I think it's been great points, Marielle extremely great point on really the difference between disabled and a person with disabilities and everyone else whose contribution made this. Who has made this resolution a great resolution. Thank you guys, all of you and now we're going to move on to the bernabeu in our transportation, chair with her resolution hi all I just. We had a very long meeting, so I just want to make a few points about that, just mostly just to say check the minutes, because we did have a long meeting and my update was really long and it included things about summer events, including the 181 bus way and the CitiBike stations on the agenda. That month, we also had DOT coming back on the project around 158Th Street between Riverside and then going up to broadway. That would, and they were coming back on the part that would have converted what was a two- way lower roadway running north from with 158th to one way southbound. That matter was tabled. There's been no vote was taken by the committee. You can refer to the minutes about that or people can ask me questions about that at another time or after as well. The rebel CEO and Community affairs person came to the meeting to present sort of their re, their reopening and what changed and how it's been going so far again more information in the minutes or feel free to ask the resolution to get to the resolution there. This is a resolution calling upon DOT to take immediate steps to address the dangerous conditions on the uppermost section of Amsterdam avenue in early September. There was a letter from yeshiva University, the principals and heads of all the public, all the schools around the area in the high 180s around Amsterdam, numerous small businesses in that area the whole all the local, the electeds who represent the area and including our Manhattan borough president, and in that letter they asked DOT to address the dangerous conditions with urgency. So this resolution simply does the same on behalf of the Community board. I would remark- and I imagine anybody who's sort of followed along on facebook or what have you knows that there have been some very severe accidents. Thankfully no one has been killed, but there was data supplied that over I mean when you look at strips of streets and dangerous conditions, it's hard to match the numbers that this stretch has, and so that's a resolution and just a little preview next month on the Tnt agenda. Amongst other things, Daryl Cochrane has taken the lead on a street co- naming and that will be on our October agenda. With that anybody has any questions. I was just curious. I was looking at the agenda. None of these resolutions, other than the licensing are listed on the agenda. Is there an updated agenda? There was Aisha. I had the same issue and paula resented to me because I was like my resolution is not here. So there is an updated one and I can send it if paula is not still on too. They are it's that they're at the end, they were not. They were not on a prior version. It's okay, but it's been updated. Thank you yeah, oh, but I'm sorry, you did get the attachment, though, even if you had not seen the actual resolution is there and if anybody would like me to read out the resolved, I'd be happy to okay. I have the result, I think, but I do not. I do not have the agenda. Thank you. Sorry to cut you off. Are you finished, because I have a question about the resolution. Yeah I'm done. Okay. So when you say the 182Nd 185Th 197Th 189Th, is this saint nicholas or avenue at Amsterdam? So those were I mean it's. The resolution goes to the entire. The like nine block stretch from you know going north of 181St and it's the they were just highlighting that those intersections have particularly heavy pedestrian traffic because of the presence of the various schools that people are accessing, etc. So, but again we're just what this resolution is trying to do is it asks DOT to sort of act with urgency about whatever sort of set of tools makes the most sense to get the achieved result, which is less crashes and less injuries good. Thank you. We had our last hand from Steve Simon Debbie. Was there any discussion about whether to include the area further north, the north of 190Th Street, in order to cut down on the drag racing and other illegal activities going on at that end of Amsterdam? Not in the context of this resolution, although I will say that like we have the committee has touched upon- and I imagine it will come up again- this issue of drag racing as it because it's it. Obviously it's popping up in different spots and different people are, you know, different areas. This is not the only area. That's had vulnerability. I sort of this, but this resolution was tracking the letter that came from again schools, businesses and representatives of the area, and it was done this way, but that's not to preclude the fact that it's sort of we have discussed as a committee that this sort of these issues of safety writ large or things that are clearly going to be on our docket this year. Well, my point would be that if we're asking D.O.T to take a look at such a long stretch of Amsterdam, that we should go all the way and and have them address what is also a pretty severe problem at the very northern end of Amsterdam. If they're going to they're going to take a look at these, what is it eight blocks? They should they should look at the whole stretch. Nine blocks, that's a, I think, and then I mean is not that where I mean Amsterdam ends like I mean they're sort of they're, just saying the northernmost section of Amsterdam, I'm not sure. Well, the northernmost section of Amsterdam is north of 190Th Street as it bends into Fort George Avenue. You know a few blocks further north. Well I mean this contemplates all of Amsterdam till it's northern terminus. So if it and that's the way that they wrote, I mean I mean I guess what I'll say is. If I'm not, I do not want to pull in Fort George Hill like this is what it is, but I, but I'm not saying I do not want to pull it in. I mean that's not what this contemplated, but if that's an issue, then we need to deal with that. But I do not. I do not. You know that's sort of a more substantive okay. If I could jump in because I was born here, wait there's a hand before you there's a hand before you right jump, I'm sorry yeah! You did not exactly go ahead and then we'll go to gym. Okay, all right, yeah cause. What's important to note there is that there's a lot of kids that participate in programming there. All year out, you have a very well attended baseball with the Michael Music back there. You have basketball courts back there that are utilized and there's a lot that goes on. That could really put these kids lives, that's in harm, so it should be prioritized the same way that there's a school because right up the block from there is Ps 189 and I'm sure they're impacted by people, speeding all the way down from Fort George. You know, so that's something to consider because, like if you talk about spaces that are probably year- round right at risk, that's one of them and thank you for raising it. Steve Jim go ahead. 189 is the school. My boy scout troop was in. I know it well, there was no traffic light on that street in front of the school. Until my friend David got killed, then they suddenly put one in so I know about this and basically we should change the resolution to say all of Amsterdam north of 181St Street. This and the other thing is technically. There is a school up there, the back of George Washington, High School. Nobody walks there from Gw, but it's there so and that whole long stretch is the drag racing area. They started the very north and they had south of vice versa, and so I think we definitely should that should be a friendly amendment and I would hope it would be accepted. So maybe we should just add. I mean because map wise it's referred to as Fort George Avenue up there right or we can. No, it is not accepted until it goes around the bend. It's Amsterdam avenue and again do not rely on what Google Maps says. I mean they call this Hudson heights, which did not used to exist. Okay, rely on what the city maps say might be, I think, probably the best thing to do to make sure that we capture the ball fields, issues you know and all the places that people are trying to cross, because I imagine there's not. Why are we increasing Fort George Avenue since you go? No, I'm saying, maybe just to say the northern okay accepted? How about that soaking great. So thank you all right so and thank you, everyone! Thank you all righty. So debbie is that. Do we have any more questions because I'd like to move on to curtis that we get to have him back to back both on his resolution, presentation his resolution and then on his report. So no more questions curtis all right! Thank you very much. Mr chairman. I want to just start off by saying that you know this has been a very challenging year, obviously taking over the public Safety committee at such a turbulent time in our country, where we see racial injustices occurring and police brutality happening, I've tried my best to lead a democratic committee that was filled with equity and voice and reason. So today, obviously, there's been an elephant in the room and there was an email that was sent around that referred to me. It referred to me in a very hurtful way and I want to just acknowledge that it was not very easy to read to being referred to as a negro and someone who was whose opportunity to leave this board was diminished, because I am a person of color. So I want to say that was a very hurtful email. If, even if it's not true, it's allegation, it definitely stung me a little bit and it just kind of made me feel like everything that I've been doing has been discredited. So you know, I know that it is allegation right now. We do not know who said what and where the recording is if there is a recording, but I do want to echo the sentiment of Vasidro, Tanya and Aisha, and I do think that we need to take this seriously because once again, I've done nothing but try to do the best I can for this community and for the board, and I think it does this all justice to demand answers as to who said what and why it was said and why me of all people was just credited for the work I've done in this community. So my resolution is once again taking a step towards justice and making sure we have accountability and transparency in our justice system. So there was a NYPD discipline matrix that was released. I believe the first week of September it reached my inbox after the committee meeting, so unfortunately it calls for the public to weigh in on the discipline kind of practices of the NYPD, because it came after our meeting. We were not able to take it up at our committee level. I brought it to the Exact Committee and the Exec committee felt that we needed more time. It's a very serious matter, so we decided to write a resolution at the executive committee level to request additional time for our board to review the document and to provide a more rational, inclusive way of sharing our feedback. So that's what the resolution is. There's nothing controversial. It's only simply asking for additional time to review the discipline matrix and I believe the office sent that to you all this week. If I'm not mistaken, so that's my report. Are there any questions, comments or concerns? Wayne? Is that your report on the resolution, or are you anything in my report? Please refer to the minutes for the for the actual meeting reports- yeah, okay, so Curtis, but also Ebenezer and Eleazar. The purpose of the executive committee passing the resolution asking for more time was for that exec Comm Meeting met Rezo to go out to the 34th and 33rd Precinct. You know asking for more time, not for it to come to the board first to be ratified so has that exec committee reso been issued? Excuse me: can I speak on this? Well, I asked whether the office sent out the executive committee reza yes, Steve, chime in and then I'll turn. Well, I, as the person who made the recommendation at the executive committee number one. This is not an issue that would be within the domain of either one of the precincts to to weigh in on or determine, and it was my impression that it would be voted on by the full board tonight and then sent to to the police. Commissioner, directly I mean you can send copies to the precincts that would be in order, but the precincts are going to be able to grant us additional time. This is a in fact. This resolution should probably be sent to the mayor as well as to the police commissioner. So so that point notwithstanding, I thought the purpose of the exec committee acting on that was to get out our request to say that giving you know the public 30 days to comment on a very important matter was insufficient, and you know it's not clear to me why we waited to make that opinion known because, like any other committee, the executive committee does not speak for the board only, but the executive committee can speak for the board if it's time sensitive well, I do not, you know wait. I do not think we made that point clear at the at the meeting yeah. I do not think so. The answer to my question is: it has not been sent down. Thank you. Yes, that was the only curtis. By the way there are additional questions. Okay, all right! Thank you all righty! So we're going to vote or do we have, I think, before we do the wrong call, we'll make the votes and the resolutions all right. Can I just say something: hang on a second daniel before you is mark, leaving a presenter before I have Danielle asks a question. Mari is also raising your hand, okay, so I'm going to have Danielle Mariel and then I'm going to have. I think I have phillip from Romani Williams Natalie and I also have a mark levine, those three. We usually we usually vote on the roll call, and that says that we usually do the roll call vote after the after the presentation of all of them. I think that's what I think I said if I might have said it. I think I want to have those two questions, then the presentations and then roll call. We usually do the roll call before those presentations. Okay. So can I ask my question yeah? Okay, so I just, I think, it's important to clarify what we are defining as time sensitive, because, actually I recall it seems like this is sort of the second time that a public safety reso was sort of held until the General Board meeting, because we actually drafted a rezzo. I helped we, our committee drafted a reso against the hiring of the transit cops and by the time that it went to the board. It had already been approved by the mayor and so or sorry by Cuomo by the governor, and I recall, a parks or a health and health and environment reso being approved. I do not remember which one it was Steve, but I remember there being a result that was approved, and so I just assumed that same thing would happen with the resolution against the hiring of the transit cops, but it did not. So I guess my point in question is: can we clarify please what we are considering to be time sensitive, because this is now the second one related to public safety that got held? That is a question for the chair. Okay, but yeah I was. I was just unmuted myself, oh curious. I think I understand that she was referring to me. I think the time sensitive issue was time enough sensitive time enough, so that all the facts were gathered so that the resolution represented all of those facts. I think in one of the parts in the original resolution, I think there was a number I think the number was 500 or so cases. So we needed to redefine exactly the kind of cases gather that information from each president, which I personally did by calling the 33rd precinct and also putting a call to the 34th so that we can gather- and I also emailed curtis some of the information that I had gathered and also a link to the Ccrb in which we can directly get that information from and substantiate and make the resolution even hotter, so that we can have more information. That's what time sensitive meant. Having that time to gather as much information as we could. If I could add what I mean curtis, what you presented to the executive committee and there was a longer document but Danielle. The critical issue was the request for public comment, came to public safety after the Public Safety committee already met, and so the deadline. The 30-day deadline would not allow for public safety to comment on it, which is why he referred to the exec committee. But even that we're saying for something that is so important after the amount of time it's taken to produce the study and the matrix to say: okay public, you only have 30 days to comment on. This is ridiculous. So we're saying give us another 30 days and that would allow the committee to consider it in the normal course of a committee meeting and to draft a result. As opposed and the last thing- and I you know, I do think we can. I mean, there's a lot of a lot of different moving pieces here, and I do think that you know if we had to be pressed and move forward. We could have moved forward, but we did not do that. But I do think that in as an aftermath of this action, if they decide not to give us additional time, then we are down to six days in which the chairper, the Chairman Eleazar and I would just draft feedback. So we do encourage you all to still review the document and send that to the board office. If you have a feedback to add to the document and in the event that they can not the last result is the chair has the right to speak for the board and he would draft a memo, and I would I would collaborate with him on that memo yeah. I just want to also say that I think there are two scenarios wayne. One is where this the committee has already met by the time the Exec committee's meeting, and then the second one is. The committee has met and there's some pressing rezo that needs to get out before the General Board meets. So I think that's why I'm saying it's important to clarify what time sensitive is because you, in both of those scenarios, you'd, want to make sure you'd want to have the opportunity to get out right, pressing rezo and in this particular case, and it's happened for land use as well. The application is sent after the committee met and the deadline to comment is before the next committee meeting right. Okay, so we'll like to have our next yeah, but I think, as I said, one thing that was important too. To note was that we all agreed upon not rushing a resolution that to some board members when we speak about the NYPD and a lot of it what it implies. It's like. We can't just put something out there. That's just going to get shut down. You know Liz. Thank you. I also want to point out that whether we get an extra 30 days or not whether we go with something that curtis sends through that elias, as the chair sends with Curtis's assistance, we all as individuals. Anyone who is a resident of New York City, is free to send their thoughts and suggestions and comments on this plan. The 50 of us can not identify ourselves as board members and speaking for the board, because we do not speak for the board, but as individuals. I encourage you all to read this report and to share your thoughts on it as an individual as a new yorker with the NYPD. Thank you so without further catherine, because I'd like to move to raw calling yeah just for folks who are representatives of elected officials, if you can, please raise your hand, so we know that you are interested. In speaking, I have some of you already. Thank you. So, ladies we're doing roll call first, so we are doing presentations first, we're doing roll call first, okay! So let's so there are licensing committee resolutions 1 through 18.. Please keep in mind that items 10:11 and 18 and 17 were withdrawn. So we are not voting on those at all and you do not need to tell me what you think of them, because we are not voting on them. We are also not voting on item number 14 because that has been tabled so we'll be voting on 1:2 3, 4:5, 6, 7:8, 9, 12:13, 15,16 and 18 for licensing and then lettered resolutions. A through c a is aging b is traffic and transportation and C is the executive committee resolution regarding public safety that we just discussed. Please tell me how you're voting if it's yes to all just say yes to all, if it's, if you're voting something other than yes to all, please tell me the ones that you are voting no on and then or abstaining on and say yes to the rest, except for Maria, who should probably just tell me which of the ones she wants about yes on and then no to the Rest Mariella Lee, yes to all, except licensing committee resolutions, 15 and 18., yes to all, except licensing, 15 and 18, on which you vote no yeah, and if you're going to vote that way, people just say you know yes to whatever, except whatever on which I vote. However, it is you're voting Liz, I'm sorry I really would never cut in, but I just wanted to make sure that the new people understand that it says objection so when they say no. What is that? What the word that's all! I really would not do that Liz and I'm sorry. I appreciate it. That is something thank you. That is something that I usually say. I just want to point out that there are two of the resolutions that we're voting on number 15 and number 18 are actually negative resolutions, so the resolution itself is a no. What that means is, if you agree with opposing the resolution, you would actually vote yes on that resolution. If you want to support that business and you think they should get their license request approved, then you would vote no, because you oppose the resolution liz. May I change my vote because I misread I think you have to do that at the end. No, she does not because she's the first person that I called- and I did not give a complete instruction- and she is a new member voting for the first time. So with that explanation and thank you tanya for bringing that up, I misread so that changes my vote to yes to all got it thanks. Richard Allman, yes to all, thank you and if everybody could do me a favor and if you know that your name is coming up soon, based on where you are in the alphabet, just go ahead and unmute yourself and try not to make a lot of Noise. Francisco Alvarez is absent. Mary Anderson, Mary, Anderson I'll come back to her Glenis Aquino Gill, yes to Wayne Benjamin, yes to all, except for licensing committee resolutions, 12 and 13, on which I abstain. Okay, all abstain, 12 and 13.. That is correct. Thank you. Jim Berlin, yes to all, except for the following, for which I vote no 8 and 12:13 15 and 16. yes to all except 8:12, 13,15 and 16. Yes to the rest. Thank you know. 15 is a negative resolution. Right, oh 15 is not it so 15 and 18 are negative resolutions. I do not know if that changes yeah. I know I think I missed that was not negative yeah. I changed my vote on 15 to yes, thank you, okay, so you are even happens to me: 8:12 13,16, yes to the rest, tanya bonner, no to 13 and 16, and yes to the rest. Thank you. Daryl Cochran, yes to all nobles Crawford, yes to all Robin Cruz, yes to all effect. Let us see yes to the rest. Yes Wally's cruise, not in all right, I'm sorry our dangle yes tool, Catherine Diaz, yes, Saul, Neisha, Diaz, yes to all domingo Estevez; yes, so gabriella estrella, yes to all Ashley Fernandez, yes, Paul, sally fisher, yes to 15:18 a b and c and abstain on the rest abstain all except yes to I'm sorry. You said 15:18 a b and C and okay vote. Yes, thank you, florimon, yes to all and abstain on 18. frasier. Yes to all. Thank you! Mariella Graham! Yes to all! Thank you! Juan Guzman, not here Marion James, not here, Danielle Jetu. Yes to all! Thank you! Leo Jimenez! That's true! Thank you! Yosef Kalinski! Yes to all love! The smiles. Oh see abstain to on all the licensing resolution. Guys. Can you mute yourself please for a minute. Thank you, abstain on all the licensing resolutions and yes to the letter resolution, a b and c: okay, yes to a b and c abstaining to the rest, correct, Billy, Lehmann, yes to all Francisco Lopez, yes Sir! I am abstaining on, look watch. This look watch participants, there's panelists! You should mute yourself Yossi, I'm abstaining on 12 and 16, yes to the Rest Hey Mary Maria Luna voting, yes on ABC, 15 and 18, and not to the rest. Yes on ABC 15:18! No to the rest! Thank you. Cindy Matos is absent. Jay Mazer is absent. Isidro Medina and forward on agenda item number one because of conflict that merchant's part of my on my bed. Yes to the rest of us, not voting due to conflict on number one. Yes to the rest. Thank you. Ariel Miranda, not here, Debbie, Nababian, Debbie, you're, muted, sorry, yes to all right, Jonathan Nunez from Meta, yes to all, except for 18:15 and 14, on which I abstain. 14 we're not voting on and 15 and 18 are negative resolutions, so you're abstaining on those. I'm aware. Yes, thank you. Abstaining on 15 and 18. Yes to the Rest Rosie Perez, yes to all. Thank you, Paradise Phoenix! Yes to all! Thank you Christina riches! Yes to all! Thank you bruce Robertson! Yes to all. Thank you Ed, santiago! Yes to all, thank you, Steve Simon, yes to all except 12:15 and 18, on which I abstain, abstaining on 12:15 and 18, yes to the rest, Omar Tejada, abstaining on 15, yes to the rest, I'm standing on 15, yes to the rest, Angela vasquez! Yes to all! Thank you! Chris Ventura, not here curtis young curtis. I'm sorry! Yes to all yes to all Elia Sar! Yes to all! Is there anyone whose name I did not call? Did you call Mary Anderson, because she just called me to say that yeah, I think you're going back to her go back to her no she's here, she's here on the speaker? Okay, hang on a second, I could hear her Mary. How do you vote Mary? How do you vote? Did you hear her? No, she said yes to all just now. We need to hear her. Can you turn your volume of the phone up? Can you repeat it again? This is gayle. I heard her. I can hear her okay, so she said what she said. Yes to all. Yes, it's good enough for the borough president, it's good enough for me. Okay, is there anybody whose name? I did not call all right I'll, give you the exact disconnect, because I've got it on my other phone. Okay, I'll, give you the exact tally later in the meeting, but you could do that as you do with others at its proper time. Thank you, at least, for such a wonderful job. You'll be more than missed to my elected officials and representatives. It's crashing my head, because I do not know how to say this. I have about. Oh, we have about seven of you guys, so it's nine o'clock, so if you maybe except for scale or if you guys want to keep it as short as you can it'll be a bigger ask so Gail I will be very sorry I'll, go really short and I just want to say a couple things regarding the open streets and restaurants. First of all, it's you've done a great job in terms of what you're doing both on Dickman and elsewhere. Isidro was kindly at a meeting this morning with other bids and even though we've written a letter about what's going on with the city regulations that are confusing, what's going on with outdoor dining, is it going to be extended? Could you make a decision? What kind of heating apparatus are we supposed to have how many agencies about etc SLA, to the DOB, to the D.O.T to the DOH? I just think we need we're going to do another sort of follow-. Up to that. You know the small business is hurting. You know that, but it's really challenging to get an administration to make a decision, so we're going to keep working on that. Second, your website is fabulous. That's not for me, everybody's. Sending me emails about how great your website is. So that's a big deal. Congratulations! Mr! Chair! I also want to say the cleaning has been great. You've been out. I've been out with you, but congratulations. I think 412 has been doing it more than anybody else. The 857 Riverside drive is an outrageous usage of you know, et cetera. We need to have we're working on it with Maria and Wayne, and everybody else just so. You know we're on it and I do not want to take any more time except it's an outrageous owner, etc. I hope it's a skinny little street, so he can't do what he wants to do. The other thing is just in terms of the census. I know we're sick of it, but we got eight days to go the biggest problem. Now we have sent a letter to everybody who had an absentee ballot in the June election. They got it for the league, women voters. It has had some impact. 35,000 people got that email. We also a letter. Second, we sent out 280,000 to the lowest performing census, tracts. Now guess what our problem is. We have so many buildings downtown where the management will not let the census people in so we're going to find it for the next eight days. It's not east in terms of the schools, oh, so we are going to on Tuesday. We are going to cover almost all Manhattan schools, certainly in district six in terms of the cec and the csd to say here's some material about census, even though you have this day to go and here's some PPE etc. We are going to try to get back to school day of action. I think that your audio's gone okay, gail, your sound is out. I want to say those are some of the issues that we're working on and we look forward to working with board 12.. Thank you. I'd say a quick shout out to the borough president for her leadership in the daily emails and everything that we're that she's doing for us. Thank you. Thank you. Catherine who's, our next elected official, all right, so we're going to go down the list as we had him: Mariel De La, Cruz, okay, Marielle, De, La, Cruz, hello, everybody. This is marielle from the New York City Controller's office. Thank you for having me here today and I'm sorry. My computer was about to die, so I'm glad that I was able to charge before it went just a few announcements from the comptroller's office he's been doing a lot of work throughout Covid-19 within his purview regarding reports and things that we observe as an office that need improvement, I'm not going to go over every single thing that he did over the summer or that our office did over the summer, but a few things are important to note one. The controller has a 20:21 back to school guide, so it's a whole bunch of information that we have compiled as an office to provide resources for DOE parents and students in one location. I know a lot of information is changing. The guide for now is in English Spanish and chinese Mandarin. I believe so. If you have questions about that, I will put my. I think I put my information where the questions are and I'm not sure what people can see. Also more recently, the comptroller has been pushing for an audit of city animal care. Centers we've seen a lot of animals, be sick and pass in those spaces, and we want to make sure they're safe spaces for them as well, especially during the pandemic. People have to give up pets or may not have the money to to maintain a pet. So I know that that's something that shelter, I guess the animals in the shelter has increased. Also when it comes to school, the comptroller has wants to make sure that there are plans for a lot of the homeless students that are in the DOE, so they're students that live in shelters. What kind of plans do they have to ensure that they are able to learn and that it is an equitable work environment? Excuse me, I'm almost done, but also too, if you all have any questions for me. We a lot of what we've been doing past like September late August are school related, but the comptroller takes care of all sorts of issues and concerns with audits of city agencies and some that are not necessarily city agencies. Reports, signing city contracts as well. So all of the information that I get here, I'm able to share with our office and then the comptroller has also done a lot of work on criminal justice when it became when they talked about defunding the police. Once people read the report, people were like. Oh that makes sense. I know that there was concerns about what that means and what that looks like or how communities feel about that piece, and also to the fact that small businesses need support from the federal government. A lot of people have been struggling so throughout the summer I feel like a few of you were on. We also had workshops for small businesses to share resources, ideas and ways that they can get funding. So, thank you. Sorry. Thank you. So much everyone for listening to me here today. Again Marien De, La Cruz. I am the upper mana in Washington Heights and Inwood representative for New York City Comptroller's got stringer have a beautiful evening. Thank you. Great great timing. Mario Kathy yeah next up is Mark Levine, Mark Levine. Thank you, Mr, Chair and good evening. Everybody to those who are observing wishing you happy new year and Leshanatova. I was not here for the earlier portion of the meeting when that disgusting email was discussed, but as someone who has run and lost a few elections, I can say that it reflects nothing about the character or the quality of the candidate and so to Chair young Curtis young. Who is a person I know to be of ex the highest integrity and who has made outstanding leadership contributions to the board and to the broader community. I am deeply upset that you have been subjected to that absolutely disgusting language and I am glad to hear an investigation is underway. I just want to quickly mention two bills that we passed, I'm very proud to have led sponsorship. Of that. I think you want to know about. First, we have prohibited developers of affordable housing from banning applicants based on their credit history. This has been an all too common practice. People who maybe had a medical crisis or problems with student loans or, for other reasons, have had problems managing their credit are too often being excluded from the affordable housing. That should be available to people in need, so our bill now prohibits that we're very excited about that. Secondly, pleased to have passed a bill that will make strengthen and expand the free legal assistance available to low- income owners of small businesses when they face eviction when they face with the need to renegotiate a lease, for example, during this difficult times when rents need to come down and even can represent them in cases in housing, not housing court, but it would be civil court. So we'll drop the link in before we get off the zoom for entrepreneurs who need such assistance because it is provided now for free in an expanded way. Thanks to our legislation. Just briefly, on the Covid-19 front, I know you're all exhausted with this pandemic, but I have to say that there are real signs that that New, York City is not out of the woods. Yet, as the weather gets cooler and as some of the numbers we perhaps see moving in the wrong direction and as some neighborhoods continue to get harder than others CB12, unfortunately among them. So it's just critical that you all double down and as leaders set an example in taking the personal precautions you need of avoiding large indoor gatherings of wearing a mask when in public on of getting tested and of not treating a positive antibody test as some sort of license to drop. Your guard we're also very worried about the emergence of flu season. While we're battling this pandemic, it would really complicate the fight, and so it's critical that everyone get their flu shots. Last year in New York City, it was only a 48 percent rate amongst adults for getting their flu shots. We got to do better than that this year, folks, we are offering on Thursday in my District Office free flu shots from noon to three. We are asking that you pre- register, but we'll drop the link in the chat momentarily, but please get your shot with us at your pharmacy. With your doctor, it's arguably more important this year than ever. That's it from me and thank you. Everyone please stay safe mark again. I could not thank you enough for your support. You always have the right choice, awards and encouraging and usually emotional, so I could not thank you enough man. I really do not thank you. Thanks mark and our next guest cat, it's Philip Ellison from the public advocates office, Mr Phillip, Hey good afternoon. Everyone we want to take a few moments. I won't be long to keep this to keep this meeting moving, but I want to make a few, I think relevant notes and, first and foremost from the public advocate himself and our office. We do we did on Friday just the beginning of the celebration of Rosh Hashanah. We you know for our jewish brothers, sisters and gender non-, conforming and trans folks in the jewish community. We just wanted to wish you all well and celebrating Rosh Hashanah, also, I think, which was really well to you know. Curtis who's been doing a tremendous job as the public safety chair personally. Seeing some of his work and in conversation is, you know, as we've all been thinking about public safety or the words defund, the police, or these kind of these kind of really tense conversations that are actually necessary, that we launched a campaign. We've been talking about that you're going to see more of and we'll find ways to collaborate here is that our office and the public advocate launched a public information campaign around redefining public safety, and so I think, that's critical because, as you all have are struggling with these issues, like much of New York of the city is struggling with this. We think we can help, have a conversation or facilitate the conversation with what we'll be releasing right, and so there are a number I will share and post this. But there are a number of items that you will see, whether that's just how do we have alternatives to necessarily police involvement, right and accountability in different areas? Public safety means different areas of life, whether that's technology being used on the community in the community, whether that's policing, whether that's public health, mental health. We provide a framework for the Public Safety committee and for this board to really help guide, whatever additional conversations and work that you all are doing, and we know there's work being done by CB12, and so I will make sure I share the beginning of that. You'll see a number of gun violence in Schools, Homelessness mental health, transportation, you'll see a number of town halls, events and graphics and initiatives to help to help that right to break this down. So I'll share that last night I know you all talked about the matrix. Our office did participate in the police. You know in the public hearing around the NYPD matrix of discipline and then using really calling out that the police commissioner looks at the civil section code and really define that if there's conduct that that is still perceived, that might happen like, for example, when the police drove into the protesters in Times square right, and it is. There are bounds here to look at look at that and to understand that is, could be endangering, or that is endangering peace in the public right and that's a gap, an area that we still see and we're still talking about. Otherwise school reopening I'll close out by saying school reopenings. Have we, the public, advocate, Johnny Williams has been calling it out and had been putting a plan since July. If people remember about how to potentially reopen with Mark Traeger the City Council chair and by starting with smaller grades, making first and foremost sure that everything is checked out in terms of ventilators and spaces before we even get there right, that we use the science and that we open really smart and had pushed that back from October, except all the delays that we have seen. So we've been disappointed in that and we've continued to push the mayor and and envision something different than what we have now in school reopening. So with that, I would say just to the councilman's office and the other electeds, the president was there the public advocate- and I were with the chair at the celebration for immigrants on Dickman and the bill. You know trying to push the city council bill for green card holders to be able to vote in local elections as they pay taxes. So we were happy to be in the community recently other than that. I wish you well- and I wish you'll have a good night I'll share the public safety announcement around reimagining public safety, and I hope you have a good day. Phil always well always thankful of your presence, and you know all the good reports that you bring. Thank you once again Bro. I really enjoyed them. Catherine who's. The next person next up is Chris, then Keane and Laurie Chris Glass hi there folks. So I'm saying that as an office, we're pretty concerned about the allegations that were referenced earlier this evening about the use of the word negro to derogatorily refer to a member of CB12 leadership. Our elected public official, as some of you know, has had similar experiences, and so this resonates as a an all too familiar dynamic of racism in our community. We're taking these allegations pretty seriously and we support a thorough investigation and we admire Curtis's courage in speaking up we're aware of the efforts by other electeds, like the public advocates office, to have meaningful conversations around anti- blackness in the community, but those efforts can't possibly get off the ground if these kinds of things are indeed happening. Among the group of people that we'd look to lead those efforts, so I just wanted to share that. We've also been doing work on public safety. We held a great forum two weeks ago again about helping reimagine public safety in the positive frame rather than the sort of defunding police negative slogan that got all the headlines. We had some excellent panelists and that event is live forever on facebook. So you can view it. Whenever you'd like at Senator, R Jackson highly recommend it. We actually were joined by public Safety, Committee, Chair, Curtis and a few other members of CB12. I know Sally was there and it is. It is an event that I think will have a longer life. So if you're interested in hearing from any of the speakers that we have I'd, recommend you check it out, we also had a CUNY reopening for CUNY students who are interested in speaking to the administration about what their reopening policies are going to look like an important piece of legislation. The senators introduced is actually an idea that our chief of Staff, Joanna Garcia, originated it's a simple tweak to the paid family. Leave law that would allow working parents to use paid family leave for supporting their kids in remote learning, and that would apply whether the school is closed or in a hybrid model, and it would use the existing structure of paid family leave to pay for it. So there would not be any fiscal impact on the state, so we're excited to roll that law out. Joanna actually had enough vitamin d news that I'm happy to send. Along about that idea. We've been supporting restaurants and other small businesses in the community. We actually signed onto a letter with Council member Levine pushing for indoor dining. Among other changes. We're really happy to see the indoor dining start, but we know we have a ways to go to ensure that, as you see that oh said, we get the maximal survival rate of these businesses through December and beyond we're also watching school reopenings very closely. We are basically we're supporting a lot of the parent- based advocacy efforts in our district in district 6 up here, because there are grave concerns from school to school, that things are not ready, even for a Tuesday launch, and so we remain committed to lifting up the voices of parents and also of teachers and administrators in this process. That's everything for me I'll, be around till the end of the meeting in case anybody has questions. Okay, thank you, Chris! Thank you! So much catherine and next up is Kiana, I think from the office. I think that someone just texted me something that from Adriana's by yeah it's office, yeah Laura is here too okay, hello, everybody good evening, so I'll keep my report real short, real brief, because I know we all want to get back to our lives. So as as I mentioned earlier, the council member had introduced earlier this year. The municipal Voting rights bill that he's trying to push through at the City Council, and what this bill will do is it would allow for lawful permanent residents or people that hold green cards in New York City to vote. In municipal elections, so only in elections within New York City, so this a few weeks ago, we had a really big celebration on Dykma street. We had a breakfast in order to generate support for the bill we have. Our office has also been doing. We've been involved with the uptown cleanup that all the elected officials have come together to host we're kind of more focused in on the parks, we're still doing the streets, but we're focused more focused than on the parks and we're doing that every single saturday and we meet on the indictment and Broadway right, acrosss the street from irisoli. Also, I think that's all I have today, but yes, so that is it for my report as of right now, thank you and have a good night everybody. Thank you. Kenna Laurie! Am I with you. Can you hear me? Yes, perfect, okay, fantastic all right! Thank you! Okay. First of all, I just want to mention just following up to what Kiana said that congressman Espaiot took the lead in organizing the uptown cleanups and they have been going on and were very grateful both to the other electeds and to the community members who are you know, making taking their time to help beautify or at least help sanitize the community. I would strongly recommend for those of you that are interested in what's happening on a daily basis in terms of organized programming, zooms with different experts, officials, etc on public health, education, the economy, the environment. All of these things are available through the congressman's social media for the new members of the board. I just want to share a few things about the congressman. First of all, he's a member of the U.S House Foreign Affairs Committee, the House Committee on transportation and infrastructure and the House Select Committee on small business. These are, needless to say, critical concerns. His particular expertise and interest on foreign affairs is the caribbean basin and in terms of the caucuses that he's involved in congressional hispanic caucus, he is the chair of the hispanic Caucus's task force on transportation, infrastructure and housing again, a reflection of the very deep needs within his constituency, the new American Caucus, the Congressional Lgbtq Equality, Caucus, diabetes, pro- choice, foster care and so on and I'll just share with you, some of the new bills that are in the works because they're again very relevant SBA grants for efficiency. Upgrades solitary excuse me: confinement, ban, chokehold, ban pardoned immigrants, justice for legal status to enable former felons who have served their time to be able to be enfranchised and to vote, green roofs, energy efficiency for federal buildings and embassies, the caribbean climate disaster, resiliency strategy and more, please feel free at any time to reach out to any of us. We want to hear from the community we want. It means a great deal when people call in or email their opinions their concerns, and you can rest assured that they all do eventually get in front of the congressman. Thank you. Hello. Sorry really quickly, this is Diana again from Council member Adonis Rodriguez. I forgot to mention we're going to be having an old town hall on September 30th. So for those of you that do not that do not know. Oat is the office of administrative trials and hearings for the city of New York. So if you guys know anybody that has had received a summons or a ticket, they will be able to go to our town hall and contest it there. Thank you, that's it. Yes, hi catherine, do we have anyone else any of the elected officials I'd like to give another report, since it's in the 9:30 already. No, that covers it. That conversation covers it all. So we're going to move on as fast as we can to the excuse me. Do you want the roll call results? Nah, hello, excuse myself, sorry to interrupt. This is Orlando. I raised my hand earlier, but I guess I'm sorry Orlando did not see you. Can I go briefly? Yes. Okay, all right greetings from assam, remember: Dela Rosa! I just wanted to briefly say her. Some brief legislative updates. The assembly member has been working on a mark to market tax legislation along with Senator Ramos from Queens. This is a legislation, that's going to create a fund for excluded workers or people that have been traditionally excluded from financial nets, from federal financial nets, and essentially it would also help formerly incarcerated individuals to to be ha to be able to have access to this funding and also people that are pretty much three vendors and people that are from the informal economy or a good economy. And she has been also working with with with Senator SAPOl on a legislation that would that would actually allow undocumented individuals to receive conditional release and for those people that have that have been formally incarcerated. But they've. Not they have not committed A1 felony and they have been eligible and they could be eligible for early release. And we also, throughout the summit we went to a March organized by northern Manhattan, is now for sale, which is a local organization that you guys all know, and we were just pretty much denouncing and out asking the New York State legislation to pass comprehensive housing legislation that centers the needs of tenants and that's protect. Actually in would enable protections to prevent eviction from happening and for community engagement. We have partnered with the office of my Hamburg President Gail Brewer, to do a walkthrough of the district and to hand out PPES and hand sanitizer to our local small businesses. We've also partnered, with the New York woman Chamber of Commerce to visit some of the nail salons and the beauty salons in the district, and we also conduct conducted a walkthrough around Dikeman Corridor, in which we distribute information about noise pollution and hand sanitizer and some signage for them to adhere to the new social distancing guidelines. And we also have we've let the continuation of the Clinio Black initiative held by Congress members Payat, and we did it three times. I believe, and we partnered with local institutions, which I'm not going to name, but they were many of them and local merchants as well, and we look forward to probably continuing that effort, but we're going to do like environmental day of action so stay tuned for that, and we also did a school supply giveaway on the Raoul, Wallenberg, Park and 189Th in Amsterdam, and we supplied around 250 school supplies and some PPE to kids from the district, and we partnered with some of the parent coordinators from the different schools and also we partnered with nimick for food pantry, who have been there like several times. I believe we've done it like four times already, alongside other elected officials who have been really really adamant about the food security in our district and last but not least, we also have partnered with Naleo educational fund to do a census. 2020 outreach with partnering with local institutions. We did like a whole walk through Washington High School with a marble hill and we're going to do a census, Census Week day of action. This Friday, where we're going to have our all our staff members complete the sensors with well to six people to complete the census, because we can not do it for them, we're just going to assist people to do it and that's basically it and also one more thing upcoming event: we're going to have another back to school supply, giveaway on Sunday in Marvel Hill. So I do not have that many detail, but the flies should be coming out soon and I'm going to stick around throughout the rest of the of the meeting. Thank you. Thank you, orlando. I think that'll be the last of our reports from all of our elected officials. So thank you. Yes, I was able to clarify with one of our members and I need to state this for the record. We had one member robin Cruz. He voted no on the executive committee resolution of about the public safety and the time extension that should actually be recorded as not voting due to conflict because he works for the NYPD. So he can't vote on that. So it's not a no vote. It's a not voting due to conflict and while I have the floor, I just want to say everything passed the letter of resolutions all passed unanimously list. I want to get back to that. That's when I think of the reports Steve, please Steve! All right. Can you hear me yeah we're good okay. So as of today, this is a Covid-19 report taken from the health Department's website, which is updated every day, as of today in Washington Inwood, we have had 5,627 cases of Covid-19 people infected with with Covid-19 927 residents of our community have died during this pandemic. If there's any good news in that figure, it's it's that the figure has not gone up since the last time I checked before my committee meeting on September the 10th, which is highly unusual. Usually every time I go back and check the website. We have more deaths as well as more cases, and now today it's the same number as as 12 days ago, on September the 10th. So maybe things in our community are somewhat improving. People are not dying at the same, the same level that they have up to now. Maybe in terms of my committee report, we had a full report from the Ems Captain who runs the base station at Amsterdam avenue in 172Nd Street. You know that was a long fought battle to get our own base station in our community opened in 2012 back then it had 67 employees. Today it has 96. back. Then it had six ambulances. Today it has nine plus three spares during this Covid-19 these people. As far as I'm concerned, the members of the Ems, the paramedics, the emergency medical technicians, have been doing an unbelievable work and have probably not been getting proper recognition to me. They're the the front line of the front line they're the first people that often are seen by by Covid-19 nineteen patients who are qualified. I can only see your chin. Well, that's my best feature. Maybe so so is this better 30:34 of the employee of the Ems employees? In our you know, us from our station got sick. During this period they missed a total of 348 tours. As a result, the other employees had to make up the difference. Many of them had to work 16-hour tours some of them even worked five days in a row working 16-hour tours in order to cover for their their colleagues. Fortunately, I believe orbit. One of these employees is now recovered. One of them is still out sick and and none of them, none of them passed away, and the workload for Ems at this point appears to be returning somewhat to normal Ddc reported to us that the Inwood water main sewer installation project up in the Park Terrace area has finally been completed. The Ryan Health center, which is a an excellent non- profit health program which has been operating on the west side Chelsea in the lower East side, is now expanding to Washington, Heights and Inwood. Its new health center at on Watchful Avenue, just south of 181St Street, is attentively scheduled to open next week. At my meeting we also had a follow- up discussion. After our our public hearing on noise pollution issues in early August, we had a further presentation on noise pollution, a further discussion with representative of Fdny about fireworks, I'm hoping to work with curtis, so that both of our committees will pass a resolution in October dealing with the issue of controlling the proliferation of the fireworks and the problems that we faced. The extreme problems we face in our community this year from from unbelievable fireworks noise. And finally, I meant to mention this to you earlier debbie, but you had, I think, the best phrase I've seen in a resolution in a long time in at the in your final resolve clause, I just love pedestrians of all walks of life, very good. I love it. Thank you, Steve where's, yes good evening, everyone! Well yes on our report, so I just wanted to report that our recent meeting, I believe that we had a very fruitful discussion for the most part. I want to say that the objective of the meeting was to discuss the reopening of your schools and gather the parents view more than anything else, because we really want to know how parents feels and even their children as well so of this present, you know educational atmosphere. We know that uncertainty is continue growing, especially in regard to the learning model, whether is in person or whether it is a remote learning. So some of the things that we also learn is that when students and parents lack their technological knowledge to navigate the internet, which many parents, and even some students, they they're not really that savvy or they do not know much so, especially they if they're studying hard to put in only we can be more learning along. It put them in disadvantage because imagine and inside that they do not know how to navigate the internet system. Many parents they do not. They do not know or they do not. They do not know how to help them. You know with the homeowner, which is another issue, and of course it is a secure path to student failure. So this is. These. Are some of the other things that we learned within that you know during the meeting? So definitely we are convinced that is if parents are going through a great deal of uncertainty and many are very afraid and if not, I would say, highly concerned, so we're just waiting to see exactly what this reopening. Hopefully on the 20th I mean on October 1st and we are taking track and how the the DOE and the mayor are going to. You know stick to their gong, I will say, or to stick to the world through the products and see how this is going to you know get to unfold, but as a really speaking, you know we won't be surprised to have another disappointment. Hopefully you know things would be much better than what we've witnessed last week. I wanted to also to say I do not know if Maria has something to say, because one of the things that I really wanted to see the board to to take in consideration is that most of the reports are given by our chairs, but I think that this is a dynamic that we should also start considering. Giving the some of the members the way so they can express their view as well, because having just the the assistant jail having the chair, I think I would like to see more members also points you know or share their views as well. So I do not like Maria wanted to take one second to say anything else, but other than that this is. My report is more on the minutes and on that also, I wanted to say that it's just a draft. I have not edited the minutes, so I know there are some missing information, but this will not be the minutes that we have distributed. It's not our official meeting. I have to wait and see it so Maria do you have anything to say to add? Well, I just want to tell everybody you're doing a fantastic job, but one of the concerns that it keeps coming off from the parents is the lack of information about the patterns of minorities that are nor able to speak their language and the is like a secondhand information they're receiving. So it's really getting a little crazy. The education of our children, how they are being told what to do at the last minute, so I think that we have to put a lot of pressure on the department of education on being more transparent of the needs of our people in our community, especially the students in our community yeah. Well, thank you, Maria and although we did not discuss this, but I think that actually, I just want to say yes to, depending on the new hearing that is going to be in the community that actually is brought all that to our attention, although we did not disclose- or this is not part of our report- but I wanted to say that yes, on the 29th at 5 P.M we're going to have a success academy hearing. So where are they going to discuss their expansion in our community and other community such week? Three? Well, it's more to come! Thank you. Thank you. Thank you, domingo. I refer to the minutes to the minutes. Okay, Liz, this one yeah, I'm here, I'm just flipping the papers. I apologize. The minutes are late, you'll get them soon. We had a full and interesting meeting with a lot of back and forth about many issues in parks, enforcement and people with sanitation issues and some noise enforcement issues, so we've been working with with pd and with parks enforcement parks. Enforcement is also going to start attending our meetings regularly so that they can hear a little more about what some of the hot spots are with the big parties and deploy their staff accordingly, and I will say, shout out to parks, Cleanups crews, who are hitting all of the parks early in the morning. Every morning, seven days a week, six thirty seven o'clock to do trash pickups and that's been amazing. Your tax dollars hard at work. That said always help always helpful for people whose idea of a good time is walking around a park with a trash bag and trash picker. I can hook you up and I frequently go out on late night trash patrols, just because why not? I went last week to the opening ribbon, cutting of a new soccer field in Highbridge park, just north a little north of the of the Rec center. It's beautiful! Oh, my god, you could cry as Steve says it's amazing what you can do with. I do not know whatever. It was three million four million dollars, it's a beautiful facility, and it was just so incredible to see kids out there kicking a ball. It's turf just go check it out. It'll! Do your heart good! Two other things: we've had an ongoing issue with the Dorothy Mcgowan Community Garden on 158Th Street, there's been a lot of back and forth with emails and allegations about who is or is not doing what in there that may or may not be illegal, so curtis and I have been in touch with the precinct. I had a long conversation today with the folks at green thumb, so we're trying to work that out and hopefully we can get some people into mediation over their issues and, lastly, as most of you know, this sort of a joint public safety, traffic, transportation and parks thing related to the closing of margaret Corbin Drive in Fort Tryon Park over the summer for use as for physical exercise and bicycling and jogging and whatnot. Now, with the reopening of the cloisters Museum, the drive is now open so that buses can get up to the cloisters, but we are talking to the cloisters about the possibility of their security staff, maybe being able to close the park drive at night when the museum is closed. That's not really so necessary at this time of the year. Now that it's dark early, but perhaps in the spring and next summer that we'll be able to have that as a recreational facility in the early evenings, so that people can repre a little more safely and minutes of last month's meeting when you get them and next month we got a bunch of things going on, including some report from domingo about some improvements that his group, Uplift New York, are looking to do in the ball fields. Next to northern high bridge park and of course, like every other committee, we will be working on our expense and capital priorities. Thank you. Thank you. I forgot almost forgot to say: give Steve. Thank you in front of each and every one of you to thank you for inviting me to the opening of the beautiful park. Thank you Steve. I just want to provide one update and let's say I'm sorry. I refer to the minutes. It's just I'll, be coordinating with I'm going to be in communications with the hospital over the concerns over the they're, going to be doing a presentation, I'm going to be requesting a presentation next month of them for the yeah I'll, send out the email, okay good. So I realized I real. I think Ozzy's going to make just refer to the minutes. Okay, thank you figure and Mr Benjamin the best for last and then Natalie like you make. I would refer you to the minutes, but I think for the first time in 10 or 12 years, the land Use committee minutes are not ready in time for the general meeting, so they will be circulated. I will say that the committee discussed two items: equity and inclusion in planning and zoning, and the proposed development at 857, Riverside drive the equity and inclusion. Discussion came out of the email that I think every community board member got from the Department of City planning in late June, stating you know their support for black lives matter, and you know against you know. The violence against people have called throughout. But my question was: what does that really mean? So we invited the representatives Department of City planning and eventually also the planning reps from the borough president's office and the executive director of the bond center at City College, to talk with us about the ways in which planning and zoning has been used to work against equity inclusion and, of course redlining. Is you know one of the? You know things that comes to mind, but we can also think in New York City, the extent to which many of the down zonings in some of the boroughs have been done with the intent of not allowing some of the you know: affordable housing development that is of a higher density. So what we are you know looking to do is to explore in more detail. This was the beginning, not the end of the conversation, but to explore the ways in which planning and zoning has been used against planning and in equity, and what can be done to more proactively make sure that actions, particularly actions taken by city agencies for planning. You know, initiatives have equity inclusion. You know in mind relative to the 857 Riverside drive project that existing building actually dates back to the 1800s. I believe it was one of the audubon's guest houses. So it's a you know a two- story, single- family house, although it has been unfortunately altered in its exterior, it's proposed to be demolished and replaced with a 13-story, 46 unit development, and you know the dramatic change in size not withstanding. That's not something that in theory is not permitted as of right under zoning, but there are a lot of questions relative to how the zoning calculation is done. The borough president touched on one of them. The width of the street impacts certain things from Dot's perspective. That's a narrow street. The way the zoning calculation is done, it's being considered a wide street. That does not make sense. There are a number of issues that need to be considered, but I would also say that you know this particular project notwithstanding. It points to an issue that the Community board has passed resolutions in the past 10 or 12 years that have asked city planning to do things or have asked landmarks to do things and in this particular case it overlaps, because we did a soft side analysis when Scott String was born president that identified areas such as this that are zoned r8 as being potentially vulnerable because R8, you know, zoning density would allow bigger buildings that are currently there, and it's not that it does anything illegal about it. It's just when the 1960 zone was put in place that overlay really created a situation where the existing buildings and new buildings are mismatched. This is an extreme example of that in the 10 years that has passed. City planning has not done a thing to act on the resolution passed by CB12 when the in 2008, when landmarks was looking for advice on how to set the boundaries for what is now the Audubon Park Historic District, the Community Board passed the resolution telling them to study a broader area that would include what we refer to as the upper and lower drives like where Maria lives would have been included. So would the site of this building landmarks did not do that, nor did they act on any of the other resolutions we've passed in the year since then that asked them to look at either expanding the district or designating adjacent districts. So here again we are looking at a project where had city planning acted, we would have had contextual zoning in place that would not allow a 13-story building or had landmarks acted. We would have had a historic district in place that would not allow an architecturally inappropriate development. So those are those are the two things that you know we discuss. I just want to return quickly to the equity and inclusion and planning I mean that discussion was focused on actions of city agencies, but just kind of referring back to the beginning of this meeting and the points that curtis raised. One of the things that we're looking at is you know going back to the planning study that we did in 2007 and, getting you know, community input on what our you know, the our local planning needs and objectives, and so that is getting input from the broad community, and I would say that you know we have a very you know. Diverse community and the people of the african diaspora, which is a very broad diaspora, should not allow themselves to be divided based upon whether their colonial masters spoke, English, French, spanish, Portuguese or dutch. That just allows you know the continued divide and conquer. We need to look at what are our interests and are those interests being served and expressed properly? That's it for me, you're going to have said in any better. Thank you, Wayne. Thank you for your awards. Give us hope. I have Natalie like to sort of like bottom line, with some of the things that gayle was not able to finish, not only no, I again. This is Natalie from the borough president's office. Your Community Planning board coordinator in this beautiful messy social experiment in grassroots local democracy. We call community boards. Thank you all for your service. We are here to help you congrats on so many of the updates that have happened. The new website, the audubon playground, opening my preschool library, the Fort Washington Branch of Nypl, being listed in the register of historic places, the national register of historic places. If for no other reason, then it was my preschool library, but a couple of housekeeping notes do fall on me, so I want to remind all of our wonderful community board members that please, you must. Let us know if you have a change in status. If you choose to resign- and I hope you do not- please do not just stop coming to the board. Please let us know, because if our office is not notified, we can not actually appoint your replacement, and that leaves the board short. If you move, please let us know, even if you think oh, I still live in the district. So why do I have to notify them? You must notify us, because we balance the board based on what part of the neighborhood to make sure we have a good distribution of who lives in the 150s and who lives in park terrace and who lives over in my wonderful 207Th Street parade. So we want to make sure that we have that great demographic slice of this community and we need that updated infor information and very important. If you change employment, you must let us know there are a few jobs, not many which actually do preclude service to this board. So we would have to know, and then there are there is a charter mandated cap on the number of New York City employees we're allowed to have. So if your status changes, CB12 is not close or has not been close to the Max, but we still do need to report out. If you look at our page, you will see those demographics that list who works. You know how many work in private sector. How many work in public sector how many work for city government? How many work for Loc, you know state or federal government, and so this is useful information for the people in this district to know who is representing their interests on this board and for our purposes to recruit people who continue to enrich this board so once again, n- E-, S-, P-, I- n-, o at Manhattan Bp.Nyc.Gov, a Su vidora for these updates and anything else, you'd like to ask gracias. Thank you. Thank you. I think that it's that has been the the end, not the end, but the last of our presentations and before we move on to all business or new businesses, at least so that you can have peace of mind. I guess you're very eager to say that italic that this is the time perfect time for you to do so before you do that. Let's see if Maria is stretching her hand, 10 P.M ready to go home Maria. Oh I'm sorry! I just want to tell you a bit a little bit on what, when he said about what makes a community- and I think that for what I have heard- the emails that we've received about courts and things like that does not make the new members out of our community. The community war feels or think that we have a division. We do have differences, an opinion and I think that we should not carry this into a you know, a situation that will it's going to make us be embarrassed. I think that we need to you know, work together, one of the things that you know actions have consequences recently on we've been talking about. I be, I need to say the same. We've been talking about the firecrackers and things like that on July 4th at midnight, firecrackers came whistling to an apartment on 551 west 157Th street the apartment caught on fire. The fire department came, got the people out they had to move for about two weeks. The mother of the family was sent to the Dominican Republic she's frail, but she was not all. She was on her late 70s only, but she was you know very sad about this situation happening in her apartment. They work very hard to have a very nice. You know apartment and keep their. You know the living coverage, but anyway I was just told this tonight that the mother passed away this morning. Very you know very sad situation, and I just want to alert people that you know all these problems, that we have a fire cracker and things like that. They have consequences and I believe, and the family believed that she was so sad by being sent away for a while that she passed away today. Okay, I just wanted to say that. Thank you so much. I think I also have to remember remind all of them all of you that we have african- american chairs of the community war. We have Marvin Higgins, we have pamela palenque, we have Richard Lewis, at least who else I do not remember. So I think we need to activate a beautiful community. It deserves our work and I think that we have to make a commitment that we need to respect each other. Thank you. Thank you. Maria we enjoy your experience. You probably are the You and Jim are the seniors of the room and your wisdom is always valued. Thank you very much. Maria solis. If you want to just talk about your interested and important tally, this is the this is the time I just wanted to. Let everybody know that they all passed good. Thank you and the lettered one's passed unanimously. Already on the on the new basis. We, even though the the assistant secretary term is supposed to have the person had the assistant secretary according to Rabbi, laws would have to have 90 days or three months or more so that our expectation elections could be held. We're going to take a step further, since there are more than one candidate one person who wants to hold a position and have a special election on the next general meeting next October, whatever that date is so that we can have a person be elected and serve for the rest of the term until December 15th, which is the next board general elections all right. So the next meeting will be held on the special election for assistant secretary position will be held in our next October general meeting. So, having said that, I will call this: can we identify the candidates, the candidates? So far? Those far I have Daryl who's been interested in Rosie, Perez, those two okay. So and we'll get a motion to finish that I had, I had my hand up actually, for I thought we were going to be called ask for an old business. We had old business or new business, so no that never was opened up to the rest of us, so I just wanted to yes what do you? What would you like to? I wanted to go back to the commitment to investigate the issues that were brought up in rude morales email that was sent, and I just wanted to know if that is something that we're actually going to do that, there's a commitment to doing that. I wanted to also say to the some of the elected official representatives and themselves who expressed their concerns about it. I want to thank them for doing that, because that's really important that we actually that they are vested as well and what's going on within our board. And lastly, I wanted to also acknowledge. Oh you, oh you, okay over there. Okay, I wanted to, lastly acknowledge the women who have the work in terms of issues of diversity. Inclusion on our board- that's been has happened, though, the work that we put in because a lot of times, the sort of effort and the work that we put into like addressing these social issues, and these do not get recognized, and so you know I would love to have had that sort of support, a public acknowledgement when we were going through hell last year with because I was the one that filed the eos CEO in case people do not understand, do not know because they're new about the bias against women on the board and when I thought it was over in January came back and I was still fighting for myself even after that change had occurred. So I just wanted to acknowledge that and unacknowledge that you know the pain and that we endure to try to make this board better. And yes, while we have had some representatives that are african- american or black, we've had a black president that does not erase racism, it does not erase anti- anti-, anti-, blackness or discrimination. It is a systemic issue, and that is why I and Steve Simon work together on a resolution of inclusion and diversity. So we can address the systemic issues that are prevalent on our board and it is not about not being hopeful. It is about recognizing each other's humanity and recognizing that we, as representatives of this community, are it is our job to make sure that we are reflecting. You know that humanity and that we are reflecting the values if we're going to represent this community. So I just wanted to say that and thank you to the women who put in that time and effort, even if you were not acknowledged. I see you and thank you sure thank you great points. Anyone else before we call this meeting to order Cedro, let's see you're raising your hand, so I really appreciate everything that Maria had to say many years of experiences, also very concerned about those allegations brought against some people who are part of our board. I think that we have served distinguishedly very concerned that, even though the email was sent apparently to everyone, there were some names that were not included on that email. I was mentioned on that email and I was nasty on it and I'm sure there were many others so right there. It's very concerning as we bring this a discrimination issue within the board. We also have to be inclusive that every now and then there are people who presume to know everything and they tend to degrade people who have an accent that is also happening on this board. So it is not just about race, it's about language. It's about your background, and that has to be taken to account. We are very dismissive on some members who have accent and if we're going to point fingers, we will, but we all we have to investigate this serious allegation. That was brought up and whoever made this allegation, they also have to be held accountable. It is not just making allegations for the hell of it. That's not going to be accepted here because you're, the family, people and you're dividing this community board, so any anyone that was mentioned by bringing up allegations. They have to be investigated as well and they have to investigate the fullest, because this has very serious allegations. If true let the punishment begin. If not true, then we also have to be sure that whoever is bringing this thing up must be to the fullest end of the world of the law. Punished. It's not acceptable in this. We have to move forward this thing about discrimination, yes very serious, but we must make sure that we are inclusive in all discrimination issues. Thank you, Mr Chair, Lisa, under old business. You were asked earlier in the meeting. If you could just give a report on the status of the Inwood rezoning, we had at the committee of the whole resolution authorizing the creation of a rezoning task, inward rezoning task force and somebody I do not remember whom at the beginning of the meeting asked if you know where we were on that so okay, I'm excited to hear your report on. What's been going on with that, because it's so important reporting what to tell us, let me tell you what are you asking I do not. I did not quite understand where you were at so. A year ago we agreed we had a lot of conversation about creating an inward task. Oh yeah, I get it yeah Natalie yeah Natalie, who was also part of the meeting. Would you like to please join us in this conversation and pretty much your office has been the one putting together the effort. Can you talk about that a little? Thank you. Well, what I can say is elias. You know we had. We had a meeting since there was not yet in formation a an inward responding task force locally. Normally, the borough president makes these, and that has been the case in a lot of the big development projects around the borough and so our land use division and our new urban planner for board 12 reached out. I was on the call we spoke to Eliasar, about creating an Inwood task force and supporting you know the identification of you know, non- cb member stakeholders and also just the you know, the logistics of running these meetings. Whatever you know what, however, they are going to proceed. You know it is the mandate of our office to provide you with the technical support for that. So certainly, we are open to continuing that conversation, and we can, you know, attend any of the meetings that you invite us to to continue that with a with a bigger circle of people. Thank you for the report and it's so informative and I'm sure that will keep us abreast of any new developments. I'd like to call the meeting to order. Can I get out now we're already in order you're calling for an adjournment we've been in order for three and a half hours, sure so call the meeting to order no you're going to our journey. No, I'm just going yeah, I'm just kidding yeah sure you're just going to get a motion, so I'm going to get a second motion to adjourn. Second bye. Take care well.",
            "summary": "This oncoming fall, one of them being in partnership with the Manhattan, the bid that presides of Cedro Medina with the graffiti removal of not just the area that encompasses the bait, but also in other areas that are just terribly filled with Graffiti, we're in the process of getting some funds from City Council in order to hire a company that can help us at least beautify the area and make it less a bit less 80s or a bit less Bronx is burning like The. Second note I, like I, would like to say, based on my experience, that we should engage not just in conversation, but we should also try out our hardest to be part of our committee meetings, especially at the subcommittee level.\n, I, merely wish to point out as a point of information that it is on the agenda It is on the agenda as a resolution of objection per the licensing committee, which you could have watched the meeting on youtube or read the minutes And You'll see, there's a negative resolution objecting to the application and we can discuss it when we get to that point.\nAre you working with the with cloth, which would cover lower heights right I have about 18 pictures, beginning from 157Th street by The. I, do not know the name of the park.\nI would like to get some clarification, especially and he's correct that other item that item, that that's being referred, to, Emma, is not was an objection on it, but I had a question about the part where this per the previous board members said that there was a recordings of people of someone saying that wanting to prevent a negro from becoming chair of Community, Board 12.\nIf somebody is saying that they're trying to prevent black people from you know getting positions, I know that I have gone through that on this board and continue to and so to hear this in this form, it's extremely disturbing, and I just feel like, instead of living.\nMyself personally have been a part of some of that, and I know that those of you who are new, as well as people who are old members on this board, have heard me speak to That.\nThere are outstanding resolutions and actions that were to be taken and, for instance, in regards to a retreat to discuss what these dynamics are, which, ironically, are the same dynamics that were discussed 10 years ago in something very much the same that took place and yet most of the people who have the opportunity to make these changes act as if this is something that's not happening.\nI. Think that we know the export member has brought up a lot of allegations without any substance to make sure that we're clear on everything Oh ebenezer, can you please add Philip from Germaine Williams's office.\nWe're going to miss you, And I, hope that the next secretary you know can do the work in be better saying that we are an excellent saying that I just want to start with my report.\nI mentioned that in my report, in June, I believe, but the work of radio started, the 207 bridge going to be refurbished, going to be painted and the contractor is looking to have communication with the small businesses with all the business owners on the Manhattan side.\nI said that in the general meeting in case you know, board members know a lot of people here and there please let the people having businesses around 207 bridge nearby, the 207 bridge, that there is a reconstruction and the contractor want to get in touch with them.\nThey are planning to build and a new homeless shelter on 10th avenue by the corner of 213Th Street They approach us because they want to start the conversation.\nThis is time we need to start talking to the people to the provider, because we need to request many services and ensure that they have like an indoor yard or a rooftop yard, where people can go outside the residents can go outside and smoke a cigarette And, you know, be an area for them to hang out outside outdoors, but inside the premises.\nYou posted elias already told me that he wants to have a conversation immediately with the provider and we will keep you informed and when it's time to bring it to one of the committee, we will do that as well.\nThe estimate of district need is due on October 30th We have our budget consultation, public heating on October 21st, so we're going to be working and sending you the information for the esteemed industry, need, and I would like that each committee chairs help us providing and creating the statement of district needs for fiscal year.\nProbably, you already know about it- that the community board 12 has a new web page with all the information improve web page, and I want to say thank We work together to bring this new website.\nOur shared person is aware about it, we're going to start preliminary conversation and when it's right to bring it to the community Board to one of the committees we're going to bring it.\nYeah, because you know we just saw the upper West side, get rid of a temporary shelter and kick a whole bunch of people out, because the community wanted that And I'm just trying to understand why we keep getting shelters to come to Inwood in Washington, Heights.\nAnd we're going to be providing you updated, executive, committee, General meetings and When it comes to the committee discussion, That, the process of placement of CitiBike stations in the network is a process that does involve the public, did, involve and certainly involve the committee and and has been presented to the full board as well They will always include a mix of street stations and sidewalk stations.\nI, put a lot of work into building the audience from our community and engaging people in supporting that Facebook page Right oc have been maintaining it in regards to uploading all of the data about any calendar, dates or information onto that.\nSo, just as a point of information when the most recent round of conflicts of interest training hosted by the borough president's office, I raised this very issue, and you know Natalie can help us by going back to that.\nThe agency needs to make to do it in setting that up and the Community Board did not vote to keep the old one.\nOur new school dos Amigos on 108 cooper street is open just to let everybody know that we do have our kindergartens in school four days, a week, Monday through Thursday, starting with breakfast and optional drop off at 7:30 and after school, we're keeping them in small pods.\nAn outdoor learning streets permit from Monday to Friday from 7:00, am to 4 pm before we start that we definitely wanted to reach out to the community and work with them.\nThat's it open to question I'll, be calling you If, there's anybody who lives specifically in Inwood around Cooper Street and wants to kind of work with us or think with us on how best to start operating the outdoor learning streets.\nAnd we just did not want to just you know, put up the signs without making sure we talk to the community.\nI guess: I'll circle back to Temple, who was able to come back on while Joyce breaks her Mic and if Temple did right, that they were having issues with their mic and if anything, yeah, probably her mic is not working because she's actually admitted she attacks.\nA long time friend is not that what you just read off of Working committee, chairs, Cedric Medina, go over the new 18 Thank you, chair for giving an opportunity to a report on the findings of the community.\nDo that, I'd like to share some links with you about the New York City, Hospitality and alliance report, saying that you know June, July and August.\nAlso, I'm, going to share report provided by the business insider what they speculate, that about 90 of all local independent restaurants might not be able to stay open until December.\nYou know mindful of the situation that just happened earlier with a public speaker who wanted to say something They were having like some technology.\nIt really is helpful in so many ways, but when somebody is having a connectivity issue and they've been in a zoom for the duration of the meeting and then all of a sudden, their computer, craps out or the battery dies or whatever their you know, their spectrum, farts or something, I can vote for them.\nThe person had been at the meeting and then because of technology disappeared- Then you know what the committee did is perfectly appropriate, but since they came, back, I think it's, you know far more, just among other things that they be heard.\nYou know it's like you can't control people's crappy technology It's a really unfortunate fluke of timing that right like right before her turn is when her technology decided to give up, but it just it just seems like there are some weird accommodations that we all as chairs and as board members have to make based on You , know this quirk of technology.\nIf, you take like a quick attendance to see what are the names, because it might be the name of the person on the application, in which case you know that what they're there for, but if it winds up being like their lawyer or somebody who's different from the name on your paperwork or a phone number where they're dialing in at the beginning, if you just make a quick check of who do, I have for items one through whatever If someone drops off the call, you can have another of your committee, members, call them back and say: hey.\nOther committee votes are usually against it and it will come in a formal resolution saying that be resolved, that you know.\nI'm, saying that I would like to add that as an amendment okay and are you ready to vote on You figured your mural Mariella about resolution, 16, the hours of operations.\nThey do not want to spend their whole time at the meeting, and we had people come in after they left We, you know if we had voted and they were gone, we would vote how we voted.\nIt does look as though we're going to be punishing them by voting on a resolution objecting to their liquor license.\nWell, I, you know, I mean if we're going to end up voting on another resolution.\nWhat's going on Jim I'll, essentially reiterate what I said: normally, if, when people want a liquor license, they are put on the agenda of the licensing committee and when we get to that part of the agenda.\nThe committee continued with its procedure because that's the way the vote was done thing, but the discussion we had just recently the last 15 minutes or so many board members feel seemed to feel that, because it was a technical glitch.\nThe committee should not have followed that procedure and let the people talk once they, you know, reestablish their connection and therefore it would be unfair to do the automatic thing and reject them, because they were not there because it was not their fault.\nIf you feel that what the committee does did, which is consistent with normal meetings, you know That, then you vote not to table the motion.\nI think if we do not reject them because of a technical glitch at least that's the view of some people If, the SLA is going to look at the thing and say: oh.\nBut people should know it's their business to stay on the meeting and not go mute and go do other things.\nWhat just happened with Omar has happened at past meetings with board members trying to vote where you know, for whatever reason, their audio connection is gone, and I will say that the first two community board Zoom meetings, the first one I could hear and see.\nSo we wanted to come up with a resolution thanks to Sidros and Domingo's input after I, you know, spoke at length with them about how we should approach.\nWe have actually to resolve the result that seniors and disabled be given priority to enter the necessary businesses, to be able to complete banking mailing and buy items necessary for survival, such as food, medicines and other necessities, and be it further resolved that this resolution be communicated to Washington Heights, Bid, Washington, Heights, Chamber of Commerce Washington, Heights and wood merchants, associations, local merchants, restaurant associations, and is there anything else, Mary?\nThat's not reasonable, and that's why the I think the resolution, whereas it should clearly state that it's during all operating hours, to add that I'm, sorry repeat , I'm, just saying that we're going to take at least four more questions, so we can move on to the next presentations from transportation.\nThere were people that got in the front of the bus that did not look like they had anything wrong with them, but obviously they had a disability of some sort, and you know it became evident as you rode, along on the bus with them, but I think it's been great points, Marielle extremely great point on really the difference between disabled and a person with disabilities and everyone else whose contribution made this.\nThe rebel, CEO and Community affairs person came to the meeting to present sort of their re, their reopening and what changed and how it's been going so far again more information in the minutes or feel free to ask the resolution to get to the resolution.\nThe, like nine block stretch from you, know, going north of 181St It's the they were just highlighting that those intersections have particularly heavy pedestrian traffic because of the presence of the various schools that people are accessing, etc.\nI sort of this, but this resolution was tracking the letter that came from again schools, businesses and representatives of the area, and it was done this way, but that's not to preclude the fact that it's sort of we have discussed as a committee that this sort of these issues of safety writ large or things that are clearly going to be on our docket, this year.\nMight be, I think, probably the best thing to do to make sure that we capture the ball fields, issues you know and all the places that people are trying to cross, because I imagine there's not.\nI, want to just start off by saying that you know this has been a very challenging year, obviously taking over the public Safety committee at such a turbulent time in our country, where we see racial injustices occurring and police brutality.\nSo we decided to write a resolution at the executive committee level to request additional time for our board to review the document and to provide a more rational, inclusive way of sharing our feedback.\nThe purpose of the executive committee passing the resolution asking for more time was for that exec Comm Meeting met Rezo to go out to the 34th and 33rd Precinct.\nYou know asking for more time, not for it to come to the board first to be ratified So Has that exec committee reso, been issued?\nThe executive committee does not speak for the board only, but the executive committee can speak for the board if it's time sensitive, So we're going to vote or do we have Can I just say: something, hang on a second daniel before you is mark, leaving a presenter before I have Danielle asks a question.\nThis is sort of the second time that a public safety reso was sort of held until the General Board meeting, because we actually drafted a rezzo.\nAnd, then no to the Rest Mariella Lee, yes to all, except licensing committee, resolutions, 15 and 18., yes to all, except licensing, 15 and 18, on which you vote no If you're going to vote that way, people just say, you know yes to whatever, except whatever on which I vote.\nIt is you're voting, I really would never cut in, but I just wanted to make sure that the new people understand that it says objection.\nWe need to have we're working on it with Maria and Wayne, and everybody else I hope it's a skinny little street, so he can't do what he wants to do.\nI know that there was concerns about what that means and what that looks like or how communities feel about that piece, and also to the fact that small businesses need support from the federal government.\nSeeing, some of his work and in conversation is, you know, as we've all been thinking about public safety or the words defund, the police, or these kind of these kind of really tense conversations that are actually necessary, that we launched a campaign.\nYou know in the public hearing around the NYPD matrix of discipline and then using really calling out that the police commissioner looks at the civil section code and really define that if there's conduct that that is still perceived, that might happen like, for example, when the police drove into the protesters in Times square right, and it is.\nTaking these allegations pretty seriously and we support a thorough investigation and we admire Curtis's courage in speaking up We're, aware of the efforts by other electeds, like the public advocates office, to have meaningful conversations around anti- blackness in the community.\nFirst of all, I just want to mention just following up to what Kiana said that congressman Espaiot took the lead in organizing the uptown cleanups and they have been going on and were very grateful both to the other electeds and to the community members who are you know, making taking their time to help beautify or at least help sanitize?\nHe voted no on the executive committee resolution of about the public safety and the time extension that should actually be recorded as not voting due to conflict because he works for the NYPD.\nIn early August, we had a further presentation on noise pollution, a further discussion with representative of Fdny about fireworks, I'm hoping to work with curtis, so that both of our committees will pass a resolution in October dealing with the issue of controlling the proliferation of the fireworks and the problems that we faced.\nThink I would like to see more members also points you know or share their views as well.\nSo I think that we have to put a lot of pressure on the department of education on being more transparent of the needs of our people in our community, especially the students in our community Well, thank you, Maria and although we did not discuss this, but I, think that actually, I just want to say yes to, depending on the new hearing that is going to be in the community.\nWhen you get them and next month we got a bunch of things going on, including some report from domingo about some improvements that his group, Uplift New York, are looking to do.\nIt's, just I'll, be coordinating with I'm going to be in communications with the hospital over the concerns over the I would refer you to the minutes, but I think for the first time in 10 or 12 years.\nDiscussion came out of the email that I think every community board member got from the Department of City planning in late June, stating you know their support for black lives.\nYou know things that comes to mind, but we can also think in New York City.\nIt points to an issue that the Community board has passed resolutions in the past 10 or 12 years that have asked city planning to do things or have asked landmarks to do things and in this particular case it overlaps, because we did a soft side analysis when Scott String was born president, that identified areas such as this that are zoned r8 as being potentially vulnerable because R8, you know, zoning density would allow bigger buildings that are currently there, and it's not that it does anything illegal about it.\nCity planning has not done a thing to act on the resolution passed by CB12 when the in 2008, when landmarks was looking for advice on how to set the boundaries for what is now the Audubon Park Historic District, the Community Board passed the resolution telling them to study a broader area that would include what we refer to as the upper and lower drives like where Maria lives would have been included.\nThe emails that we've received about courts and things like that does not make the new members out of our community.\nThink that we need to you know, work together, one of the things that you know actions have consequences recently on we've been talking, about.\nYou know very sad, situation, and I just want to alert people that you know all these problems, that we have a fire cracker and things like that.\nI want to thank them for doing that, because that's really important that we actually that they are vested as well and what's going on within our board.\nThat's been has happened, though, the work that we put in because a lot of times, the sort of effort and the work that we put into like addressing these social issues, and these do not get recognized, and so you know, I would love to have had that sort of support, a public acknowledgement when we were going through hell last year with because I was the one that filed the eos CEO in case people do not understand, do not know because they're new about the bias against women on the board and when I thought it was over in January.\nWe had at the committee of the whole resolution authorizing the creation of a rezoning, task, inward rezoning task force, and somebody I do not remember whom at the beginning of the meeting asked if you know where we were on that So okay, I'm excited to hear your report."
        }
    }
}