{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB11",
            "channelId": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "title": "Ethics & Disciplinary Committee 11/2020",
            "publishDate": "2020-11-18",
            "shortDescription": "",
            "lengthSeconds": "0:31:59"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB11",
            "normalizedName": "Bronx Community Board 11",
            "twitterName": null,
            "youtubeChannelName": "Bronx Community Board 11",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "mHQEzp_2VJ4",
            "fillerWordCount": {
                "uh": 60,
                "um": 39
            },
            "readTimeFullTranscript": "13 min read",
            "readTimeSummary": "2 min read",
            "wordCountFullTranscript": {
                "complaint": 21,
                "complaints": 12,
                "public": 9,
                "second": 6,
                "minute": 5,
                "screen": 5,
                "abstentions": 5,
                "item": 5,
                "incidents": 5,
                "page": 4
            },
            "wordCountSummary": {
                "public": 3,
                "complaints": 3,
                "abstentions": 2,
                "conduct": 2,
                "page": 2,
                "complaint": 2,
                "personnel": 2,
                "favor": 1,
                "opposition": 1,
                "flanker": 1
            },
            "fullTranscript": "The cloud all right: it's currently 803 pm on the 17th of November. We are in the ethics and disciplinary committee meeting. We do have a quorum one. Two three four members, four out of six people are here, so we do have a quorum to start the meeting I don't want to delay it, I'm going to keep my eye on the waiting room just in case anyone comes in I can let them in. So. Thank you all for dialing. In welcoming our new member Veronica to the committee. Thank you for volunteering to join us. We have two other members Johnson and Ken Gelnick. Those are the other two committee members. So looking at the agenda for tonight, we have to review the minutes for the October 2020 minute, so I can pull them up on the screen, so we can go over them. Real, quick, see here all right, so you can probably see the minutes on here so glance through them. Real, quick and we'll do a motion to approve them. You can't see it. You can't see my screen Eli. You could probably zoom in on top of the screen for on your phone well hold on, because I'm using my laptop got it. Okay, I'm minimizing this I'll scroll down in a couple of minutes, give everybody an opportunity to go through them scroll down just a little bit and Kenny just joined us Kenny we're just waiting last month's minutes. Sorry, I'm late! Sorry! These are the minutes from last month. I don't know if you had an opportunity to read it, but we're going to make the motion soon to approve the minutes. I can't seem to get out it's only one page tell it doesn't move different pages yeah, I'm scrolling, I'm taking my time scrolling, giving everyone because I had it zoomed out. It was hard to see if it was zoomed out. So basically, really. The biggest changes to that to our forum was that if someone files a complaint, the subject of the complaint, if they're going to have five days to provide a response, that was that was the biggest thing out of it and after we meet let's say to we don't have any new complaints, but if we picked up a new complaint and we're discussing it today, we have 10 days to notify the subject so we're just trying to close them out a little quicker. So basically, those are the minutes from last month. So a motion to approve the minutes from the October meeting do I have a second any second I think I heard Ellie first, okay up for a discussion, any issues with the minutes: okay, all in favor, hi, no opposition, any abstentions. All right passes. Okay! So that's just the first agenda item we just voted on the minutes. Passed unanimously go back to the agenda. Does everyone see the agenda now? Okay, so I need a volunteer. Please to take minutes for tonight. Any volunteers, I'm sorry I'll volunteer, I'm so sorry, I don't know. I was in I will take okay. So just a short summary, so that's the first thing we accomplished was we reviewed the minutes and we and it passed all right. So the second thing on the agenda is the conduct at meetings. We have a member of the public looking to enter I'll, admit them. So the second thing on the agenda is conduct at meetings, so we have prepared a form. We discussed that I think last month. Maybe briefly, I'm not really sure, because all these meetings are starting to kind of they're. All together we were supposed to discuss it at the general meeting, but because that meet and ran long we did not discuss it and we tabled it for next month. So has everyone seen that conduct at meetings letter so I? Don't remember it yeah Ken! You provided us with some remember the soliciting information, so it's so that that's the one we're talking about so I think for us is really and I put it on the agenda. I thought we were going to go in depth with that, but I think we reviewed it again at the leadership meeting last week and we were going to go with it so for this meeting, I'm going to skip it unless anyone has any issues from the committee, since we already discussed it all right item number three: the complaint form did everyone see Jeremy's complaint form or his response or complaint form the last edit. No, the complaint form. So, if remember complaint they can use, they can use the complaint form. I, don't know if I have it, let's see if it's on the website, one second, if the new one's on the website. Second, one there we go, let's see so this is still the old one. The new one has a lot more text. Give me a second I'll, stop sharing for a second I'll log into my email. Just give me one give me a couple of minutes, I'll log into my email. Yes, all right, I found it I'm going to share my screen again. Okay, does everyone see the screen? Yes, all right, so this is the new complaint point. Did we approve this? One I think we did, but I just want everybody else to take a look at it. So we have the new committee members here right. Okay, that's fine! Well, the previous complaint form didn't have a lot of details in it and we wanted to attach. We wanted to give all the guidelines all the information with the form instead of having a complaint form and a guidance sheet separate, so we decided to attach it all together. So this is just the first page. I'll give you a couple of minutes to glance through it. Yes, hi. How are you I? Don't know if you guys have considered, but I mean this is great, but is there anything going to be addressing behavior? This is the intake form. So if a member of the public wants to fill out the form I'm going to go down to page 2. you'll see what I'm talking about. Okay, we go down here to page two, but you know what Aidan Ellie it doesn't the new things that we discussed well, it doesn't have to right the five days for the subject to return an answer for us to have. We have 10 days to get back to the subject. That's not really necessary. It doesn't have to be on here right, not sure, I think it should, if be just going to give them all the information I get past. This form like if they just read this form, they should walk away with all the information they need. I think he's right, only going to be two sentences really, then yeah I think it's going to be a simple addition. I'll ask Jeremy to to add that the subject of the complaint has five days to respond to the committee, and the committee will well before that. The committee has 10 days after the meeting to reach out to the subject. So those are the two things that we're going to add here and I think it should be good here. It's basically the same thing that we had before the name of the complainant and what from flanker submitted and at the bottom here is complaint number, because some members of the public might not want their names to be disclosed. So when we vote on it or we discuss it, we're going to go by the complaint number and it would. You know, zero one for the first complaint that we get to number yeah. Would you send because I think I spotted some typos that I made that can take a look at okay I'll when I respond to Jeremy I'm going to respond I'll attach it so you can review it and I'll ask him to add the two lines or maybe, if you don't mind, adding it Kenny. Those two lines regarding just send me a send them to me exactly because I, don't remember exactly what was said on the two lines: it's not I'll. Take it down now. Okay, sure I'll! Send it to you, because it's in the minute from last month, all right so I'll I'll get that to you. So, okay, so we'll hold off on this, and maybe we'll take a look at it next month, one more time because it's a work in progress- and you know this committee's new and it's a new form, every single meeting we run into something new which is expected because we're basically building a foundation. We built a committee from scratch and it's not easy. We didn't have any or we weren't aware of any other committees similar to it in the Bronx that we can copy off of sometimes it's nice. You know if someone is doing something you just copy or get ideas from them, but we started from scratch, and here we are I. Think so far. We've done really good thanks to the help of Ellie and Hayden. You've done a wonderful job. Well, thank you. It was a team effort. I remember from our first meeting. We didn't know where to start and I remember the first meeting I think we've done good I think we're like eighty percent through or maybe more 90 through the stuff, so good experience overall, so I'll switch back to the agenda all right. We just talked about a and then b is the public complaints. So currently we have a few complaints that are still pending. They are related to community board staff or community board members to discuss those complaints. We would have to go into an executive session last month when we went into executive session. I asked other Community board members to leave the meeting, because I wasn't sure if they can be in the meeting. But after speaking with the Bp's office, they said. If you go into executive session during a committee meeting, other community board members are allowed to be in the executive session. So sorry, Naomi I, think I kicked you out last month. I did not know that information no problem. I've been kicked out of a lot of places. Well, thank you for hanging in there I think we were in executive session for like two hours and you waited for us until we got out. So thank you for hanging out yeah no problem so, but before we go because now I the a member of the public was asking why we go into executive session. It is in the community board handbook, I, think it's page 28 or 29 that any discussion that involves a personnel matter related to a staff or community board member must be discussed in executive session. If we do vote that vote has to be in public and before I make a motion to go into executive session. I'll give an opportunity for any committee members. Do you have anything before I go any other members of the community Board? Do you have anything before I go to the members of the public Al Naomi? Do you have anything okay and we'll go to members of the public? Let me go to the list to see the participants list. All right, I believe Roxanne Delgado you're on this is your opportunity. If you would like to say something: okay, all right hearing nothing from anybody. I would like to make the motion to go into executive session to discuss community board complaints. Do I have a second discussion. Hello! Yes, hello! I'm sorry, hello! Thank you! So hello! Yes, oh okay, you said I think you mentioned my name. I'm sorry in regards to what I just I was giving anybody an opportunity to speak before we go into executive session. I gave members of the committee and I'm giving an opportunity to the public to say something: okay, my apologies, because I'm actually at work right now so I had to lower the I sent you earlier this morning, Miss Delgado there's something wrong with your line this weekend, Mr Elgato there's something wrong with your line. According to me, I like to sit with the executive standard, yeah I can't hear her either she's breaking up. I can't hear you are you able to hear me? No I did no. Oh, can you hear me now? Yes, can you hear me sorry, I'm at work right now, but I just stepped outside sorry you're breaking up again you're breaking up again? Oh my goodness! This is awful! Yes, how about now? I can hear me. Yes, Miss Delgado, hello, you're! Still there yeah. Can you hear me you're going in and out? Okay, then I'll address the issue by email. Okay, thank you. Anyhow, bye. Okay, all right all in favor to go into executive session. Hey any opposition, any abstentions. All right just give me a minute. I'm going to do two things, members of the public, let's see, I, don't have anyone else. We lost Miss Delgado. So what I need to do now is pause. The recording give me a second now we are currently 10:34 pm. We are out of executive session. We are resuming our meeting, so the committee discussed some personnel matters and complaints that were filed. We will just discuss them briefly here before adjourning, aided get ready to copy some stuff down, wait hold on I, don't know what I did hold on a second hold on what the hell give me a minute. Oh, my god, yeah hey! Is there anyone in the waiting room? No I, don't have anybody in the waiting room? Oh my god, you guys I can't find I. Give me a minute. I, don't know what I did with that. My file. We didn't have much to the meeting. I think we're going to have a lot more now. No wait, but I think I lost what I just wrote up. Oh turn up somewhere, you didn't throw it. Oh I found it hold on I found it I'm so sorry, okay hold on 10:34. We got out of executive session, that's it okay, so we will vote on some recommendations right now, but we do have some complaints that were discussed and closed. We will a member of the public filed complaints and the dates of the incidents were April 14, June, 11, June 16th wait: 4:13 20, 20. 4:14, 4, 1 4. wait, 4, 1, 4, yeah, okay, and these are incidents or are these complete dates? These are the dates of the incidents: okay, June 11th, okay, June, 16th and March 4th. These are all this year. Those incidents. The committee recommends that worst has agreed that no further action is warranted. These complaints will be closed. So I will call for a motion that the dates I just mentioned. The complaints are closed. Due to no further action is warranted. Do I have a second in my Ellie. Thank you discussion. Any opposition any abstention. This passes unanimously. So then we'll go to dates of incident of November 22nd of 2019, that's 11:22, 19. may 15 of 2020 August, 26 and 27 of 2020. The committee will recommend that oil guidelines will be sent to all community members and staff. I'll call on a motion for those four dates for, for that recommendation to send the FOIL guidelines do I have a second seconded by Kenny. Thank you discussion, any opposition or abstentions passes unanimously and moving on to the July 17 2020 incident, where I call for a motion that the committee recommends that we will distribute to community members and staff, the New York City social media policy do I, have a second hi second seconded by Naomi and just to make it official. Naomi has now now a community board, crushing a committee member of the ethics Committee or do I have a discussion, any abstentions or anyone against okay that passes unanimously. Okay, we did review two complaints that were submitted in October of 2020. One of the incidents was October 7th 2020, a member of the public filed a complaint, so I call for a motion for the October 7 2020 for the for that complaint to be that it's partially substantiated and after reviewing it, we have decided to close the complaint because there was a technical issue during that meeting. Do I have a second all right seconded by Ken, discussion, abstentions or any anyone against okay that passes unanimously and, lastly, a complaint submitted for incident or a complaint submitted on October 27th of 2020 that references, numerous dates from starting March 22nd, so I call for a motion that the committee recommends. I'm sorry when was it submitted. It was submitted October, 27 2020. so for a motion that the committee recommends that dial in and options or dialing instructions or options are included in the invites and that the calendar is updated routinely and, lastly, that the community board will comply with all open meetings. Laws do I, have a second okay Naomi. Thank you, discussion, okay, anyone against anyone, abstaining, okay that passes unanimously. Thank you, everyone and that closes it out for the public complaints section. That was item number three on the agenda item number: four: is old business? No old business! New business item number five, no new business, okay and bill, because committees do not require a motion to adjourn. Does anyone have anything else before we adjourn I want to thank aided for taking the minutes, if you don't mind, sending them to us, we'll all take advantage of them and then we'll forward them up to be published and we'll vote on them next month. Anything else from anybody. Thank you. So much for sacrificing your time. I really appreciate you. This is a lot of hard work. We're doing so. Thank you. So much and I'll talk to everybody in two days have a how do I leave the meeting.",
            "summary": "I, don't know if you had an opportunity to read it, but we're going to make the motion soon to approve the minutes.\nSo a motion to approve the minutes from the October meeting.\nI, think I heard Ellie first, okay up for a discussion, any issues with the minutes: okay, all in favor, hi, no opposition, any abstentions.\nThe second thing on the agenda is the conduct at meetings.\nThe second thing on the agenda is conduct at meetings, so we have prepared a form.\nIf a member of the public wants to fill out the form I'm going to go down to page 2.\nRight, not sure, I think it should, if be just going to give them all the information I get past.\nWhat from flanker submitted and at the bottom here is complaint number, because some members of the public might not want their names to be disclosed.\nSo when we vote on it or we discuss it, we're going to go by the complaint number and it would.\nHandbook, I, think it's page, 28 or 29 that any discussion that involves a personnel matter related to a staff or community board member must be discussed in executive session.\nI would like to make the motion to go into executive session to discuss community board complaints.\nI gave members of the committee and I'm giving an opportunity to the public to say: something: okay, my apologies, because I'm actually at work right, now.\nWe are resuming our meeting, so the committee discussed some personnel matters and complaints that were filed.\nOkay, so we will vote on some recommendations right now, but we do have some complaints that were discussed and closed.\nNaomi has now now a community board, crushing a committee member of the ethics Committee or do I have a discussion, any abstentions or anyone against okay that passes unanimously."
        }
    }
}