{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "title": "Housing \\u0026 Human Services Committee Oct Meeting",
            "publishDate": "2020-10-02",
            "shortDescription": "",
            "lengthSeconds": "1:36:34"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "mhv80fzvb0Q",
            "fillerWordCount": {
                "uh": 238,
                "um": 204
            },
            "readTimeFullTranscript": "50 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "item": 47,
                "housing": 29,
                "line": 22,
                "land": 22,
                "funding": 21,
                "kind": 20,
                "percent": 20,
                "services": 19,
                "work": 19,
                "budget": 18
            },
            "wordCountSummary": {
                "housing": 12,
                "item": 11,
                "funding": 8,
                "court": 5,
                "land": 5,
                "services": 5,
                "income": 4,
                "construction": 4,
                "budget": 3,
                "kind": 3
            },
            "fullTranscript": "Am 709 pm and thank you so much everyone for being here. I am excited to get underway for our discussions about the budget. I should actually just ask you all: did you perhaps get the time to review the documents that I sent prior? Okay, a cursory manner yeah, it's a lot a lot to absorb okay, so I wanted to send those documents, because I realized that there's a lot of, I guess just questions about. What really is this process about? Really? How does it work within the committee? I'm not sure if perhaps folks might have heard a bit more about it at the past general meeting. I spoke with elisa this past week because I want to try and start making sure we got these items in on time. So essentially, every year, we're expected to provide the city of New York with a number of budget items that we think are of interest to us. Every community board does this throughout the city of New York we have had in the past, and if you look at the document I sent over, we had roughly about five items that were added to the list for expenses on this committee and then in capital. We had about six items and that's just to give you the essentially a brief overview of what we had originally put last year. If you saw in the documents that were sent over both within the statement of district needs assessment, as well as the city budget register, there was essentially a more in- depth. Look at what was the entire board's listings last year right, so I guess what we should first go through is really just the statement of district needs assessment. It was the third item sent. Does everyone have those documents? I only have the spreadsheet you send like the Google doc that you sent with a capital on expense. Was there a third in the email that was sent out the one on the 25th? I was just looking at it yeah on the 25th yeah, it's titled, October, 2020 housing and Human services. Meeting agenda there's a couple of attachments: okay, got it yeah, great okay! So now that everyone has it, I guess what I should really do is go through the introduction here, really just giving a brief overview. The annual statement of community district needs and community board budget requests are charter, mandates that form an integral part of the city's budget process. Together they are intended to support communities in their ongoing consultations with city agencies, elected officials and other key stakeholders and influence more informed decision making on a broad range of local planning and budget priorities. This report also provides a valuable public resource for neighborhood planning and research purposes and may be used by a variety of audiences seeking information about New, York, City's, diverse communities. So, if you go, I think it's the next page down, actually the mark at the right page. It's page five page six on the pdf reader you'll see that they every year they'll give this kind of breakdown of our community's profile. Giving kind of the highlights as to what we think what we've at least found in regards to some of the demographics you'll find the makeup of really a lot of zoning being included here, or at least what is most of the blocks being zone. Four, in addition to also a population breakdown and typically what they'll do on every report is they'll list. What the top three pressing issues are you'll see that they give a bit of a kind of description about each one, and it usually tends to be based off of really what happens in the voting of the individual items for both capital and expense which we'll get to in a moment. So I should note again. This has not been the most updated right. We have information that was based off really the 2010 census, for some of the things that have to deal with the population density. Of course, now we're in the middle of having the 2020 census being done and, of course you know, that's going to potentially look a bit quite different, but based on the information that was previously had- and I think it also includes some information from the American Community survey we had seen within Manhattan's Cd-12 district, there was 45 percent of households that had previously been reporting. They were spending 35 percent or more of their income on rent acrosss Manhattan. This was 37 percent New York City was 45 percent. The Mean commute to work was roughly about 41, pretty much keeping in line with the rest of the entire city. We found that amongst our population here there was limited english proficiency, specifically states that 37 percent of residents, five years or older, have limited english proficiency. This is actually double the rate that is in Manhattan and quite a bit larger than what's New York City's rate of 23 percent. Of course it would, it would be it'd, be rude of me to not mention access to parks. Thankfully, we've been doing well in regards to creating that sort of accessibility. As a hundred percent of residents living within walking distance, of course, there has been a lot of discussion within Parks Committee about how we can even expand parks. Even further a lot of folks have been trying. I think the last project we had been discussing was about one of these park projects that was supposed to be focused on around the dikeman houses. I'm not sure if that came to fruition, but I'd love to potentially hear more about it. With regards to our crime rate, it states that Manhattan CD 12 at 9.3 major felonies reported per thousand resins or per capita in 2017. This seems to be a bit lower than Manhattan and actually yeah and good portion from New York City, the educational attainment. It shows that Manhattan Cd12 district, there was 33 percent of residents 25 years or older, who had already earned a bachelor's degree or higher. This in comparison to Manhattan appears to be roughly about a half of that amount. Manhattan is 61 percent acrosss New, York City. It is roughly 37 percent, so within community district 12 it appears that we are, you know, quite a bit lower and the unemployment rate again. This is a much different time period from where we are now, but at the time it had been reporting that Manhattan Cd12 had been at about 6.8 percent of an unemployment rate that was the average between 2013 to 2017. in Manhattan. This was lower at 4.2 percent, 4.9 percent for New York City and lastly, the New York City poverty measure shows that within Manhattan Cd12 we have 20 percent of residents having incomes below what is the poverty threshold in New York City? I should note that for New York state we have a different poverty threshold right. This is at 200 percent of what is the federal. So you know, depending on really how you're looking at these statistics it can vary and yeah Manhattan was 14 acrosss, New, York City. This was 20 and on page 7, you're kind of seeing that in- depth look of really where you're, finding the zoning or the appropriate buildings being placed in each portion of the district. For the overview statement of the community district, really, I think I can spare everyone not go through the entire paragraph unless you'd like to spend some time going through it now, but I yeah, I think it's going over quite a bit of information that is captured from a lot of the demographic century surveys, the the census- and you know, kind of goes into some of even the information that we might collect from the city at different points for the top three pressing issues. Overall, the portion that I was mentioning prior it you'll see that they specifically list affordable housing at the very highest. The second is land use trends and the third is schools. I should just go through just the affordable housing section for everyone's own perusal. We received many complaints from residents and small businesses indicating that their rents are too high and that their landlords are harassing them in multiple ways. For the foregoing reasons, CB12 M Manhattan recommend the city to increase funding for mandatory right to Council, for anyone who has rent burdened pays 50 percent of their income in rent and also increase funding for legal representation in court. Cb12 of Manhattan also requests that permanent long- term, affordable housing construction, build a high number of these apartments or housing units, with immediate priority being given to non- profit organizations and community land trusts, they're partnered with non- profit developers. Emphasis should be given to 100, affordable housing based on the community's AMI. I'm actually just kind of going along with. What's been a huge discussion with the android zoning I'll mention the land use trends. Our district is facing a resulting proposal made by the near well the city of New York, and a resulting application for the inward section of the district that has been submitted to the department of City planning CB12 of Manhattan requests that the Department of City planning should dedicate additional planning staff to work with Cb12, M and local residents to formulate an implemental zoning plan for Washington, Heights and Inwood, and to provide technical assistance to Cb12, M and local residents to evaluate the inward rezoning proposal, including the draft and final environmental impact statement. So I think that the this item request for a dedicated person from or urban planner from the borough president. I, if I'm not mistaken. This item, is actually sitting on the land. Use committee request. But Ebenezer do you? Do you know if land use is I I'm almost positive it is. I always ask for like a dedicated person from the borough president, so I do not. I think we have to check with them and not duplicate efforts, because land use have I mean housing have more items than unless you said land instead. So I do not think that we should duplicate the effort, just no, it's a waste of a line, item yeah, so just to be clear, so I was just reading over it. Given that you know kind of really. The concern with zoning has to deal with a lot of the concerns that we have about. You know high rents, so yeah that has been an item that is yes, you're right, part of the land use committees and individual items that they've presented in the past. I can assume that now that the Manhattan borough president has provided that planning or the staff planner that might very well potentially change but yeah, it's just so that everyone's aware also hi everybody. This is aisha generally. What we do is, if there's a line item that housing agrees on and then we find because, like in this instance, land use is meeting after us if we find that they have already put it on as their line item, sometimes we'll collapse them into one at the budget meeting or if there are things that are specific to land use. We might split the item down the middle depending on like how it falls so just to add that context. Thank you Aisha. Can you explain this? What aisha just said about the budget meeting is that the executive committee correlates all this so every year the board is going to be having a budget meeting, it's really an opportunity for both the public and as well the community Board to spend time talking about what has been of interest to them. I have personally not been aware as to when the exact date is going to be for this year, but you know I'll yeah. I'm definitely checking in right now is that separate from the general meeting at the end of the month? Yes, typically, yes, it is. Thank you yeah, even though I think last year we did do it in one meeting. It's I do not personally prefer it. I think that the budget deserves its own time and space, but I think for the last two years we've been collapsing it into the general. You know a lot a lot of boards acrosss the city. They, you know they handle their business differently, but generally a lot of boards they'll. Do it individually, it'll be one event specifically. You know, typically at a school they'll invite the public right, but, of course, we'll have to plan out something with a with a different kind of medium. This year we can do it in the park. Why not with megaphones everybody will have a megaphone. Oh my that that'd be interesting. A question about item number one on the capital expense capital. You know what I mean the first one. There were like two buildings. I think I thought both already got renovated and now they are designated as affordable, affordable housing. Am I correct about that? I thought it was another. Am I correct about that? Is it still? This item is still open. Are you talking about 2110, arden and Amsterdam Avenue yeah last? I knew that they definitely started work on both projects, but what's been happening consistently is even though it's stated that the money is going to be given. It's not. It has not been sufficient and that's the reason why we've continued to carry it in order to make sure that the necessary funding necessary funding is allotted throughout the course of the project. So we would have to get an update from Martin Collins to see if that's finalized, because if it did, then it's a continuous support. It's not going to fall under a number yeah, then what I'm saying so we are kind of saving one right. Okay, yeah Martin Collins is the best person to get update for that yeah, and I should also mention text previously. We spoke with marieli Sardo. She was involved on at least one of the two projects yeah. I think it would also be good just to catch up with her yeah. She was involved in the arden project yeah, but before I go down to the individual items, I also want to go through the human services end because on so the following page or rather page 9, page 10, on the pdf reader, it goes through some of the items this kind of has to go through what aisha was just mentioning. That sometimes committees will also collapse certain items so previously I'll just mention we had a few items that were focused on mental health services. I think in last year's conversations we had put forward some particular items that were focused on increased funding for mental health services, and I think that it actually ended up getting picked up by health and environment, open environment, so yeah. I just want to just let folks at least read through what was the summary last year for mental health and substance, abuse, treatment and prevention programs. Under that section there it reads in the expense budget priorities for fiscal year 2021. The most important issue for health care and human services is to expand mental health services in the community, including crisis intervention and acute care for persons with severe mental illness. It is also important for CB12 and rather Manhattan to increase services to prevent and treat chronic diseases such as Alzheimer's, diabetes, cancer and heart disease, provide funding to ensure that all public schools, all local public schools have health clinics is relevant for CB12 of Manhattan noise complaints having incremented considerable in our community. For this reason, we request an increase of staff that conduct regular noise enforcement, air quality monitoring and water quality testing in our communities. All of that is health and environment, but yeah I mean it's, I mean with mental health and also not to mention a lot of the organizations that work on those very services. It kind of gets to the point where it's a mixture right, because you also have to bring in staff that are dedicated in certain fields, not to mention with individuals that might have particular needs. It could very much so vary so yeah. So that's just been typically one of the areas in which that you know both human, the housing Human services committee, as well as the health and Environment Committee kind of overlap. Last year we had an item that was brought forward by the committee but was also kind of collapsed into one of the health and environment committees items so just wanted to make note of it for everyone here, yes, Bruce, so Martin, just texted me back, he said both are under Rehab. At this time, Nmic Nimik will operate, 21, arden and cloth will administer 2010 2110 Amsterdam wow, that's from the front lines. Thank you for reaching out and yeah. That's incredible. We'll definitely have to. I think. Follow- up has been at it for like four years that I can recall. Probably she will probably correct me it's even longer than that. It's not more than that. I think it's 10 years at this point away. 10 years, 10 years, holy[ _ _] families that had a right to return. I'll also continue, and this might be something I I'm going to try and draft a little bit more this coming year, under the section there for needs for homeless, we have a homeless shelter in our district in need of funding and more services. It is still a matter unresolved. I will. I will definitely change that question there. I think there's a lot more to be said there. What do you mean? You will change it like how so like we've. We need to address really a lot of the concerns that has to do with the homeless shelters, but particularly yes, the service is being offered to those that are homeless. Okay, two sentences did not address that. Oh okay, I see what you're saying: okay got it yeah. I agree, and I do not. I think that should be like. Where is it on the list in terms of priority? Do we have the yes, the grid showing what the vote was yeah? Oh, so I sent I sent a link. I do not know if perhaps you might have saw it's a it's a link to that. You said at the beginning of the meeting right yeah, so it's just so that you see the individual items there and actually, let me just confirm if there is sorry I'm trying to our attendees okay, so I just what I'm going to do is I'm going to share my screen once we get up to the individual items, I think we should yeah. I think I think we're fine now, so I'm going to start sharing my screen so that the public members or members of the public can also see yes, Janet yeah, so that that's why I'm going to share my screen so you're all able to see, and just for those that are from the public, watching. The reason why this document gets sent out specifically amongst the members of the committee is because this is where we individually put our rankings. So this document does not, you know individually get shared with the members of the public right because we do not. You know these are our ranks. We do not want people to just simply be changing them, so I'm going to share the screen now for everyone to be able to see. Okay is everyone seeing my screen right now? Yep? Okay, great! So if you pretty much continue going through the document, really you see each one of these items here both between capital and then expense. If you'd like you can definitely take a moment now, just to begin looking through. What is that for both the Housing Human Services committee, as well as others, I've basically compiled those items that have previously been selected for our committee last year and beside them? I placed their individual rankings. What I'll say is that you know, as you saw and you've heard already previously, we've asked for the renovations of 2110 Amsterdam Avenue, and it's odd actually that we do not have the other building. I think I think- and this might have to be something I have to talk with Chris Martin. Oh sorry, Watson collins, Martin, collins. Yes, this is probably something I'll have to confirm with him why we might have taken off 21 arden. It might have very well been because Maria had said last year that I think they got the funding but I'll just try and confirm. This is why I saw this item. I'm thinking wait. A minute was not it already completed, because I remember there was a you know something on the one of the newspapers talking about one of the buildings that opened up yes and so yeah, but I'm not 100 sure so clearly, Martin or I do not know. If somebody else had more information about it yeah I yeah it might it might very well be I if I'm remembering correctly, I think Maria had said that they got it, and so last year it previously been Cs. But when we spoke to Martin 2110, it's still not been, and he showed us a couple of photos. I think I and Aisha please remind me if perhaps this could have changed, but I thought Martin showed us photos that it was still all boarded up. You know that had not been having any construction being done at the last time. Yeah. The last time I saw it, it definitely still had scaffolding on it so and that that's specific to 2110 Amsterdam yeah bruce. Can you ask Martin collins about the arden? I just did it. I just did, and he said both are in Rehab, so I'll ask them again, specifically if you want for arden specifically if the building was open and or specifically was it given the appropriate funding so that the construction could be done. I think that's probably. I suggest it's better an offline conversation with them because it may be complicated, but his text was both are under Rehab at this time, meaning 21 arden and 2110 Amsterdam. So I'll, ask huh sorry I'll ask him for an update via email how's that sound yeah. I was going to say I guess, for the purposes of to move forward in the in the meeting. We could basically say I would assume that we would all be on the same page as far as making sure that this is brought through to completion. So if it's not completely funded, if there, if there's any shortfall, can we agree that we would want that to be funded and if there, if it's done and it does not need funding, then we it drops off right and then number two become number one number three number become number two and so forth. Right, oh well! These are just the rankings from last year that you're seeing but right beside them. I understand that, but we are ranking all of them today right so well. If you want an answer right now, I'll try to get the best. I can from him, so this is the thing in previous years. What we've allowed folks to do is because some have essentially stated that they'd like to have their own opportunity to rank the items individually. What we've done is we've given them that time outside the meeting and we've given a deadline so, but if you all, feel comfortable ranking the items today right in this meeting, that's of course completely okay. But I would just know, however, that, because we want to try and hear back from from Martin Holland's, it might very well just be helpful to at least keep that sort. That sort of you know availability there, and once we've been able to hear from Martin, then I can also just establish you know when we want to have our deadline already set so to complete our ranking. So do you know what tracking number that is? So what I was saying in the last meeting is generally, what we would do is have the tracking numbers so that we can easily have the city's response right next to the item when we're considering so that we know what they said about, why it was or was not or how it was funded, and we could just like see the line items straight, acrosss and figure out versus having to keep going back and forth. But if you know the tracking code that way, I can go straight to it yeah. So I mean I did not put the item number on this document. We can input it as we're discussing it, but I just wanted to go through just what the items were right now going through the statement of district needs document and then switching on over to the register. You know what the what it is for that item, I'm just trying to find it. So the it's on page 815, I'm just trying to yeah three one: two: zero, two one: zero one: okay, sorry interruption Martin says remove both buildings from budget priorities, because both buildings are fully funded. Awesome. Perfect great, finally right so I'll go ahead and just remove this line item for tonight and Martin knows the budgeting process fully. Well because he was chair of the board years ago and to me his word is golden, so I trust whatever he says. Thank you. Martin I'll also just go through the other items you have here, so we had as- and this was ranked number two by the entire board- a permanent long- term, affordable housing, construction building, a higher number of 100, affordable units based on community AMI, with immediate priority given to non- profit organizations and community land trusts, slash land banks that are partnered with non- profit developers, though, for this item I'll actually just mention I was I was thinking over the past week, given really the concerns that were brought forward by both curtis with the introduction of Intro 2050, which focuses on expanding. What's the current bill that allows for people to have a essentially right to counsel and also an attorney be provided for housing court matters and it kind of goes through 2022., the bill that was introduced, and this was introduced by Mark Levine. It specifically seeks to ensure that this is going to occur immediately rather than having that wait until the you know the fiscal year. I think 2023 at that point. So with that in mind, I was actually going to say. Would anyone essentially prefer that we kept this individual item as it is and then create? A second line item focused on that bill? That's Intro, 2050 or would perhaps people prefer that we change the wording of this item so as to kind of include that very intent of the bill, and I'm sorry, if perhaps maybe folks have not seen it. I can actually just pull it up I'll, stop sharing on my end and pull it up. I'm sorry. I missed the context of what you said the bill encompassed. What is it so the bill? Let me just pull it up. Sorry, I struggle with multitasking at the same time, but is not that covered in this spreadsheet. Is it covered in the second tab under expenses, the first line item, or at least part of that? So, let's see you said the expense item here: increase funding for the representation in court. In all zip codes not currently covered in Cd12, ah, okay, I do not know if you were proposing to move that to the capital side, if that was the proposal, but it seems to at least some format of what we were just discussing is in the line item for the expense. Yes, I'm mixing those two items up, but yeah this would yeah so that intro 2050 would yes correspond to this item. Actually yeah. Sorry, I was clearly mixing those items there, but so my yeah, so we can return to that item, but so sorry mixing those two up yeah, but actually just because I'm discussing it- and I re pulled up the page, I might as well just show everyone the bill. Also. I feel like at some point. I do want to go over the legislature just so everyone can. Let you learn about using that. Oh, my okay, here we go got it. Can folks see my screen? Yes, okay, great so yeah, so this was a bill fairly recently introduced at the end of August, pretty much as it states in its name providing legal services for tenants who are subject to eviction proceedings. It's a local law to amend the administrative code of the city of New York in relation to providing these services, and it pretty much just goes into saying that the bill would amend local law number 136 of 2017 the housing court right to council law by requiring the immediate implementation of access to legal services for tenants facing eviction proceedings in housing, Court city- wide, and I can actually just open the bill. Stop sharing. So everyone can also see a document okay. So this is the bill essentially starting from section 26- 1302. It's stating subject to appropriation coordinator shall establish a program to provide access to legal services for covered individuals in covered proceedings in housing court and ensure that no later than July 31st 2022. That was the previous date given effective. Immediately is what it's been changed to all covered individuals receive access to brief legal assistance no later than their first scheduled appearance and a covered proceeding in housing court or as soon thereafter, as is predictable and all income eligible individuals receive access to full legal representation no later than their first scheduled appearance and a cover proceeding in housing court or soon thereafter, as is practicable, and you know kind of just goes into establishing a number of different. I guess caveats for the bill in which certain things would apply, and it's just really ensuring that you know this is effective immediately. I should note that what was the previous agreement acrosss, the entire city- it did not necessarily, I guess, strive in every sense to ensure that every family was covered. There was essentially capping by which every family had to abide by where it was, let's just say, for a family of four. If your income was 50,000, you know you're right on the line for whether or not you could receive those very services and if you were to have succeeded or rather exceeded that line, then you might not necessarily be eligible for various services. You know this is kind of going in into the weeds of what happened previously with the bill that at least has been responsible for ensuring these services were made available, but we had put forward a item that was specifically focused on ensuring that cap was increased so that it's not necessarily meaning that 200 percent, specifically in that very item in expenses, you'll see that we had asked for it to be increased to 300 percent. Does everyone understand what I'm saying there I'll just take it as yes, so yeah, so that was just yeah bruce, yes, are you? I can't raise my hand virtually I'm doing it physically gotcha yeah. What was your? What are you going to say? No, you asked- and I said yes, oh okay gotcha all right. I am seeing from a member of the public janet asking what is a covered person, and that was a four person family income limit. So we can. We can look this up, but it should. It should still stay at roughly what it was last time, which was 200 percent of the federal poverty threshold. So you know like I was mentioning it it's pretty much just you know it's capped very low in comparison to what a lot of families acrosss New York City might make, and especially, I think there was concern from correct me if I was wrong aisha, you mentioned last time about the 15 minimum wage and how it really affects families ability to fall into that 200 percent of the poverty threshold, but yeah. That was kind of the reason why previously we had been mentioning that idea. Can I add something to this, so my understanding is that covered person would pertain to zip code, because not every zip code has the right to counsel. Although I will a small cavite right now during the pandemic, pretty much all zip codes are covered just right now during the pandemic, but right before he has certain zip codes and if you've lived in one of those, then you were a covered person, so you were entitled to at least have a conversation. That's why it says brief. It does not say brief representation. I think brief advice or something like that, because you can meet with an attorney and just discuss your case. The next step would be income eligibility and that would be for full legal representation. So just because he's living in zip code, if you're over income, that you do not actually qualify for full legal representation. So my understanding is that we're seeking to increase to increase that threshold, so more people qualify for the full legal representation and they're, not they're, not out just because they barely you know made the income eligibility is that is that a good summary yeah? What the cover person is, because I think Janet was asking about a covered person and there's like a distinction between covered person and then income eligible persons. Like you have to be to be, you have to be both to get a full legal representation, yeah so yeah and there's it's changed from the very beginning right because this is this was roughly about 2015 when really just what was the covered areas were presented by the city of New York to what was I guess that concrete contractual deal with Las and Lesney and boom and all the other providers, but yeah there was a number of items that we would kind of go over with individual tenants. So as to request. You know both that information of their income, as well as their household size and what zip codes they lived in. That has, you know since changed quite a bit, I'm sure. But yes, I think the item that we were focusing on previously in regards to expense was to ensure that people had attorneys. If ever they you know have a housing court issue arise, but yeah that that's, I think, if perhaps do you do you? Do you maybe feel that the wording of that expense item needs to go further? Is that what I'm understanding? Let me see just have this law, that's fine and all zip codes not currently covered. Okay, my internet is unstable, so hopefully you can still hear me. No. I think this is pretty clear. Okay, yeah, I'm sorry! I should were you also going to say something or no. I was just so we are, we doing expense or we're doing capital yeah we're going to go back to Capitol, but I just wanted to bring up that bill just because I realized that I did not have everyone in the know of what exactly would the bill I was referring to but yeah. So that was just my sort of brief explanation about that very bill: okay, so yeah, but yeah that so that was just the explanation of the bill that we're discussing and that ADA had brought up as well previously so yeah. That was my long, my long way of going out to discuss the bill, but going back to the the capital items. Yes, so we had the permanent long- term, affordable, housing, construction, building, a higher number of 100, affordable units with immediate priority priority given to non- profit organizations and community land trusts, slash land banks. The second item was funding for supportive housing construction for Lgbtq Eu I'll just mention that the reason why we had discussed this and actually sorry, let me go back and share my screen, so the public can see as well. Can I start ranking on your spreadsheet, or are we going to do the ranking like we're going to do the ranking once we've been able to establish all the items? Okay, just because I you know, if perhaps people want to introduce any new items, I want that opportunity to be given, so they can also be ranked all right so yeah, so that very item that I was just mentioning was funding for supportive housing construction for Lgbtq youth. This was ranked fourth out of 48 items, acrosss the entire board, so we did quite well, then we have provide funding to construct, affordable, accessible housing for seniors. This is ranked fifth out of the 48 items. We have additional funding for aep and ppp program for preservation and rehabilitation of distressed buildings in Cd12 M. We noted it was immediate priority. It was ranked six out of 48.. I should note for folks that might not have been as familiar this so aep and ppp. Those were referring to programs that specifically are doing either enforcement or specifically the kind of rehabilitation that might be needed through HPD, the city's housing preservation and development agency, and then the last item is provide more housing for at risk and transitioning individuals. I noticed I wrote that twice individuals and families- and this was ranked 10th out of 48 items, any questions, thoughts about those five line items I've gone through thus far. Okay- and I guess just to add on to the next section here- are there any new items that perhaps anyone might want to add in? If not it's perfectly fine. If perhaps those very items are you know what you think is most important to have at this time? That's perfectly fine, but I just want to give anyone the opportunity to introduce new items that might have caught their interest, whether it be you know throughout really what's been the past few months or something just personal interest in the previous year, I believe we have discussed providing Wi- fi in public locations for people to be able to access the internet when they're doing their business, especially in the human services areas where people are spending hours, sometimes the entire day in those spaces and oftentimes need to communicate in order to handle the things that they need to handle so, but it did not get re- entered when Barbara was doing the budget last year. So I would, I would request that be re- added back for discussion, yeah and I'm sorry just to use the appropriate language. What was it exactly? You said pride to provide internet access, Wi- fi in the public spaces like at the welfare center, the social security. We learned that that's not specifically in our purview, but what we were supposed to do was to communicate with our elected officials about being able to address that in those areas. But basically figure out what are the spaces like the welfare office, where that type of support can be provided to basically have internet when people are in waiting rooms, gotcha and just so as to know, I'm noting it specifically as Hra service centers. This is this is kind of just because of the changing culture. What we have in DSS those are no longer referred to as welfare centers, so yeah, just noting as so. Okay is there anything else that might come to mind here that might serve as a capital expense to expand to beyond the service centers? Why not? All? Because you know there's also shelters on why not all spaces that are governed under Hra DSS, where people might have a need for that yeah? Sorry. So when inputting provider access in publicly available spaces, I meant to be you know, including of all, but I just want to note specifically including hra service. Centers. Yes, is that working fine or are you suggesting yeah? I just? I just wanted to make sure that we were not only focusing on the server sensors but like gotcha, okay. So then that should be fine. Any other additional items- hi Ariel. This is marielle, just a question of clarification, and this is coming from someone who's a little bit newer to these types of conversations and terms. I just want to make sure that my understanding is correct. When we look at item or row, six provide more housing for at risk in transitioning individuals and families. Does the term at risk also include those who are homeless or does at- risk mean those who are on the verge of becoming homeless yeah, both okay? That's what I thought, but I wanted to ask oh yeah that that's actually yeah a very good question. The reason why we were as at risk was because within at the time right and there's still a changing kind of universe, both the language and also the culture at city agencies, but at the time at- risk was referring to both those that either are without a home, as well as those that might very well be seeking out services, because they're very much so likely to be displaced so yeah. So that's just the kind of terminology that's been used and transitioning is also another sort of terminology word or you know a different way of saying the very same thing. Okay, that's what I thought, but again just wanted to to confirm that. Thank you, yeah, okay, so that are there any additional going once going twice, you say three times, I'm looking over the list that I read in regards to priorities just to see, if there's anything there, that has a funding need. Do you think a program remember? I was talking about blighted buildings as well as buildings that have have outdated electrical systems and the risks that it causes for fires that I had spoken to the fire department and DOB about basically right now the way that the law is landlords with buildings that are older than a certain certain date are not required to upgrade it. The way that a new landlord would have to implement certain systems to make sure that they are fireproof, or at least you know, less likely to have fires. What about funding, because I'm the discussion that I had with DOB was related to the fact that it would cost the landlords with older buildings. You know money in order to upgrade to and to newer systems what about a program that would provide funding for them to do so. Yeah do something like that. Not to my knowledge, my understanding is pretty much that if the building is a certain age that there's no requirement and there's no there's nothing, I was actually looking for it myself because, like, for instance, in my bedroom, there's one outlet and up until very recently, most of the outlets were only the two prong, not the three- pronged outlets as well. Some of them were actually they're all updated now, as of as a recently good, because that was the that was the issue with 775 Riverside, which had the six alarm fire two years three years ago. Exactly and Pinnacle walked away unscathed. So that's a good question: how do you be preemptive in the beginning because they had not done fire stopping in the dumbwaiters, and that was part of the cause that the fire shot up to the to the roof right? There was another one, also on Riverside that had a daisy chaining issue where they had plugged surge protectors and extenders one after the other and caused the fire. So I think that item would serve as a an expense item, and I can include it here as the providing of or right rather providing for the creation of a fund to aid in upgrading electrical systems to inspecting you know basically inspecting. First, you need an inspection report to say that there's a problem and then you have to deal with it. I would even go as far as asking to it's not going to happen right. We can always write it to outlaw the you know: the 99 cents extension cord, those things cause fire. There was a fire and 50 something straight like that was maybe three four years ago and somebody died yeah and especially the holidays, come well. It's not really an expense here, it's a it's, but I was just thinking about it, but I think get giving money for buildings to have an inspector come in at least is the very least we can do to identify a problem and separate, and apart from the landlord who's, never going to do anything to inspect their own buildings. So I'll also just note and yeah, as I was hearing your thoughts there bruce about the inspection and also really having inspectors. I was also thinking about this line item here on row five. So this is also to try and aid in that very effort, because yeah, that was one of the things that we were discussing quite a bit in in previous years, for I think it was 18 2018 but yeah. There's a speci there's a specific need to have more inspectors, not just specific to really just any. You know individual buildings or to really any individual community. It's just in general. The city does not really have that many inspectors and they kind of operate with a very, very under. I think I think under staffed kind of office, acrosss really just all of HPD the challenge. The challenge is who's going to call the inspector, because after the fire, the fire inspector said oh, that we could not find an apparent cause. Well, people in the building, one of whom works in our building, said: oh, they were they put rewired the building years ago and they basically put wires down the dumbwaiter shaft bx cable. It was not protected, it was not closed off. They did not fire stop between the floors. I mean it was just a travesty and pinnacle basically just scathed away with their attorneys and got through the court because of it yeah. Absolutely so is it that you think that there needs to be some like a different line item that might not necessarily fit with funding for HPD Housing code violation inspector. I do not know Hpd's what is HPD doing about inspecting these buildings. This is a condo conversion, so you know they have 70 rent stabilized tenants and you have 30 condo owners, and then you have a building that goes on fire and who's at fault. It's the landlord because they did not do what they were supposed to do. Yeah. How do you prove it? You can't it's hard after the fact, so I think and that so in the in the essence of conversion. That's dealing more so with department of buildings and it's odd because I'm actually thinking about it now and you know again- it's been some time but Aisha correct me for wrong. I thought this very item was not just solely specific to HPD. I thought it included the Ob originally yeah it did. I was actually looking at that myself just now. I'm not sure why it does not include DOB yeah yeah. That's a good point, that's a focus for somebody who should not be doing an inspection which they did not do in this case, or they did and they it got swept under the rug. I do not know why it was a hellacious fire and people were displaced for two years and it was tough going back and now they're back and they're still having a lawsuit against Pinnacle the landlord, the sponsor. So I've changed it now. So is it supposed to include both? Rather, let me actually just change it, so the wording is appropriate Ariel. I have a question. I wonder if there's something that we could do around just informing tenants of what housing code violations are. I'm not sure if this is the appropriate place to do it. I'd like to create a fund for some kind of work like that or if it's or, if that, could take the form of some kind of awareness event just kind of throwing it out there. You have my deepest concerns and shared interest there, so this is. This is kind of going to. Let's see this is line item both one okay, yeah three and I thought we had a different one as well but yeah. This is this kind of line three, so I say this with both respect and also a desire to better things there. So the city of New York up until about roughly what it was 2015 2016, more so 2015, but they had not been involved in that kind of work. This came about with the introduction of the Public Engagement unit. I used to work with in that unit when it first started and they kind of they kind of had the responsibility there within what was a sub unit, called the tenant support unit to go out to individual communities and specifically inform as well as educate as well as case manage a number of housing code violations that were found in certain communities and we also kind of got thrown in to a number of other projects. But we also partnered alongside Las, Lisney and really a number of other service provider. Organizations that were contracted also to really assist the tenants from being displaced and also help them deal with various a lot. A lot of holdover cases. Let's just say that might have arisen because a landlord could have made all sorts of accusations about tenants right that could potentially then leave them without being given the right to stay in their homes, but yeah the tenant support specialist they've done that kind of work. When I was within that unit, they were specifically designated to go throughout the zip codes that were contracted for legal services to be given by Las Lisney and a number of other service providers, and that yeah that work it does mean a lot to a lot of families. That was probably the reason why we wanted to also add in that item, with the additional mention of funding initiatives to inform and educate tenants of their rights, because you know, of course there is there's a number of other organizations that do that great work. Casa is one of them in the Bronx the right to counsel they. You know they came up more recently, but they're also doing that kind of work so yeah, if perhaps there's maybe any additional items that you think could be added as well to aid in that effort. Yeah I'd, you know, definitely be happy to hear. Thank you. That's hopeful, I am, I think I kind of glossed over and glanced over and did not catch that point there, but I guess this just brings me to another question. I realize we're already kind of late into the evening. How specific do these need to be the descriptions of the line items or yes, the descriptions I do not? I do not think we need to get in into too much stuff. Is there? I guess a concern about the wording or perhaps changing it. No, not a concern about the wording. It was just kind of more so for my own knowledge, because I was just wondering if there's you need to be like super granular, you know so really like when they see it, they really understand what it is that we're trying to get acrosss or if it's okay kind of putting you know the ballpark idea. This is what we would like to see in the community yeah previously. I think it's. It really depends on the in the on the issue, for example, the two buildings on the one in Amsterdam and arden. Those are very specific right, so it it's. There is no like rules, one way or the other. It's more. It kind of more depend on the issue. Okay sounds good. Thank you sure. The other thing is. We are limited in the amount that we can put in each line item. So what do you mean? We got ta. You me this is for the for the for the ranking, correct, yeah, there's a limit to the amount of characters that actually end up seeing, so we usually have to try to be creative in how we're giving detail, but in within the limitations of those amount of characters. Okay, that's really helpful. Thank you, you're welcome. I realized that yeah I mean in the I guess, in the desire to not go through all community boards of the city of New York and read each and every individual one's items not have them be so in- depth. I think that that's the you know the kind of thinking there behind it, but yeah. If perhaps the you know, any item might drag past that kind of character limit. That would just be something that you know. I could quickly edit so to kind of shrink that down a bit but you'll see so, for instance, the first line item there of the increasing funding for legal representation. I mean that's like the largest item. We have here- and that was you know previously, okay to fit in, so I think I think we're doing we're doing good here. Is there any additional items that will stock could be added for expenses? If not, I you know, of course, again happy to leave it there and because now we're clear actually that the original line, item or capital has already been taken care of. We can leave these items up and I'll actually just get rid of the blank spaces just to ensure everyone can feel free to rank them in their own time. Is that okay for everyone else here? Can we write them right now? I mean yeah if you'd prefer to, of course, but it's again completely up to everyone here, although I will request so because today, let's see today is the first. We should hear back from the staff about setting up a budget meeting. I do want to kind of leave the deadline open right now and just email everyone as to when they have to have that line item submitted, or you know just the rankings on the line item submitted yeah I'm going to I'm going to I'm going to get back to talking, valeazad and also the staff just so we can get a date which we're going to have all committee submit their rankings and yeah. I guess we can continue from there but of course again I'll just update everyone about it. Yeah. Is there any questions on that thoughts? Okay, I'll also just mention Janet sent a note. I think she was asking to whether or not to increase or raise the eligibility and come to include lower middle class. I think I might have already answered that, but, yes, it was to essentially increase the eligibility by income. Specific, your specific question about lower middle class. I think I think 300 could very well include that, but I'm not sure as to classes in the instance you might be referring to. So I hope that answers your question, so that is then tonight's main items with that. I am happy to open it up to new business. Did anyone have any announcements? I will also just take this time to mention to everyone. I'm not sure if everyone have seen but there's been an extension of the moratorium. You know evictions for the time being, so that's meaning that if folks have had, you know, for whatever reason, the concern about not being able to pay their rent being essentially evicted. That's supposed to be held off for the majority, not all I will say, but for the majority of people this will be held off until the new year. You know, as I mentioned prior there's loopholes that are always being just taken advantage of by landlords. I think that there's going to need to be at some point a discussion about what those loopholes look like, but I'll also just mention as well for everyone here that you know kind of going along with the emails that I was sent. I was sending out for members of the public just so you can also know now, I'm looking to set up a essentially town hall event in the form of zoom bringing forward. I believe it was a deputy commissioner that would be coming from the Department of Youth and community development in addition to reaching out to very to a few different partner organizations such as the coalition for the homeless, as well as help USA help. Usa specifically has been a provider of homeless, shelters and hey. That plea, please plea, please let me know if you want to announce this but yeah. We we've been also been speaking about bringing potentially a legal service provider ADA, if you want to add to that by all means, feel free. Now we're working on getting someone from the legal aid society, but not necessarily my unit, because we represent tenants who are facing eviction, but someone may be from the homeless project, but I have not heard back so I'll, let you know once they confirm so a point of clarification about the eviction moratorium. Can everybody hear me because I think my internet keeps freezing? You can hear me okay, perfect if I have to go off camera I'll. Do that to make it easier. So I'm excited yes that there's some sort of moratorium until the end of the year, a point of clarification for anybody who's watching this or who is advising someone who might be facing who's in an eviction proceeding or something is that what the governor did was extend the tenant, safe, Harbor act, not necessarily the moratorium as it existed until today. The one that expired today was like automatic tenants did not really have to do anything. The Tennessee Harbor Act protects tenants who have been financially impacted by Covid-19, but you have to raise it as an affirmative defense. So that means you have to already be in a in a proceeding. You have to raise it and you have to demonstrate that you qualify and ultimately, it is, is up to judicial discretion. But you know if you can demonstrate you've been impacted by Covid-19, then that defense is available to you and you are protected against eviction until the end of the year, because that's what the governor extended it to, but just a little bit different, because I think we've been hearing a lot about moratoriums and as they existed from the beginning of the pandemic through October first has been very different than what we're looking at now. So I think it's important for anybody who's paying attention to this to be like okay, it's slightly different and how can a tenant be able to bring this up if they are facing some sort of eviction? Proceeding the second point about the tenant safe, Harbor act, which maybe a lot of people are not familiar with- is that while it protects you from being evicted, it does not take away your obligation to pay rent, so the landlord can still obtain what is known as a money judgment and that could have some severe consequences for people. I think idea. You mentioned this last time in our last committee meeting, but just again because we might have people tuning in who did not see the last one is that a money judgment of course can affect your credit score. It can also impact your ability to obtain other housing if you're trying to move out so some real consequences. You know you're welcome to call 311 to speak to an attorney. There is a housing hotline that is staffed by attorneys and staff members of various legal service providers throughout the city, so you could just call in if you want to speak to the legal aid society we're on tuesdays edit question. Yes, so the last year's new rent laws said a landlord can't blacklist a tenant. Does that still apply in this case yeah the landlord can't technically blacklist a tenant that is correct, but that could still a money judgment could still affect your credit score, so it you know so that in a way can impact you and there's really no way. You know. Sometimes we have laws, and then I wonder well, how are you actually enforcing this and making sure that landlords are not actually using information against tenants, and I do not think we have a clear answer on that. Yet, thank you so much again, aydah you know how much I appreciate it. Okay, I you know, I do not mean to overstep. This is just like my little thing. That's what I do. No, I appreciate it. Yeah okay, can't say enough about how much I appreciate Las in the middle of all the cases that was taken on back in the little strange days of Tsu but yeah. Thank you again. So much so with that is there? Is there any old business that folks wanted to bring up and actually I'll, also just ask if perhaps members from the public, janet or danny in regards to one of the things on in our budget request is in relation to the community land Trust, and this is just an example where we voted near unanimously in support of the creation of a community land trust in our district. But yet this board, and specifically the chairs, have not done anything to advocate for that resolution and there's other resolutions where the same have happened. One of them, I I've spent a few months trying to bring it to the forefront, to make sure that it finally got sent out to the electeds, but in the cases of others that have been sent to the electives, there's been no advocacy and I think we need to review what outstanding resolutions we have that fall into that bracket is there? Is there perhaps any way that you feel might essentially aid in that effort of trying to get really the kind of local support for community Land Bank? How would how would you like? What would you think would probably be we are members of our community have won via Hpd's program for community land Trust the right to be in a in a in a program where they're nurtured through the process of creating this community land trust? So I feel like there's already community buy- in there's a lot of discussion that has been had about it. The agency is connected with that group within our community. Our court voted so more than anything, and what I'm referencing is the fact that, just like in the case of 2110 Amsterdam and 21 arden, where were it not for the work of Martin Collins? That would just be in the dust in the in the back of our minds and not any active action being taken for it. So really what I'm? What I've been attempting to have implemented is appropriate tracking systems so that we're not dropping the ball with the work that we should be doing and, in fact went as far as to put in an application with Microsoft. For that idea that I had have it accepted only for it to get tremendous Bush pushback from within this board. But it's it. You know it holds back progress. I was actually going to say. I did not know that the inward Community Land Trust proposal was already approved, did Phil if correct me, if it's still Phil did Phil, perhaps have like a public announcement, I'd love to try and hear from him. No, when I, when I say as far as that group being accepted, they won I'm trying to remember the name of it. But there was a program that hpv put out a request for proposals. I believe it was that they put out, and that group was one of the groups that won the right to be a part of that almost like an incubator program for community Land trust. So they've been going through the motions having meetings they prior to us, voting on it scouted out locations within the district that might be feasible, and so, but really what I'm I mean, and they continue to do that work. But really what I'm speaking to is what our work is as a as a board, which is we pass resolutions they need to be advocated for the work need there needs to be followed through on the intention of those resolutions, so pretty much being a partner to the rest of the community. That is doing the work in this case specific to community Land Trust, but I mean in all cases in the you know, we spent a lot of time having the discussion, sometimes bringing other people into the fray to have the discussions with us doing the research. I would assume that when we pass a resolution, it's not just you know just to go through the motions that we have. We actually have an expectation of some type of follow- through to be happening, and that's not what we're dealing with right now: okay, so, okay, so I'm thinking what would be the best way then on the community board, then, because if, for instance, so we have the district manager going to cabinet meetings, would we'd like to perhaps then discuss that with the district manager? How he can present. You know, or really just ask about what's happening with that funding that might have been allocated for community Land Trust. Is that maybe one way which you'd like to try and advocate for that? I was not. I was not saying that in our budget ranking that this needs to be taken off. We do need to advocate for funding specific to the to the crea, to the building of community land trust or the usage of lands or buildings in our district in order to implement community land trust. What I mean is so, for instance, the resolution was voted on. I think at this point it's probably like two years or three years now, but what is not happening is that from this board, our chair, which it is the chairs charge to be in the know of what these things are like in the case of the two buildings for instance, and to say, okay, we voted on this. It went forward to the elected officials. What's the status? Where are we with it now is there follow- through is the funding? There needs to be continued advocacy for those matters. So, in the case of the Community land Trust, there needs to be continued advocacy in support of the fact that we voted on it first of all, but also that we have an entity within our district that has been pushing for community land trust and doing the work of you know. Seeking out partners. Educating others in the district, but CB12 is has not continued their work. To make sure that the resolution we put forward is supported, Gotcha, okay and yeah. Sorry if it came off as if I was mentioning taking it off the priorities list, I was just trying to ask what you felt might be more helpful and if I'm understanding so maybe it might be great- to try and set up at some point in the year a meeting where we can enter well we'd. Rather we can. We can invite the council member to come to a meeting or perhaps even like a representative from the office so that we can speak to them about this and Mark Levine has been a part of some of those conversations in the past, but I think a definite I mean I'm. I work in the field of technology, so for me, what that would look like for our board is to have an actual system. That is not just paperwork where, when a resolution is passed, it can just disappear into the archives and nothing be done. That's more what I mean I do not know, maybe that's something that we need to be putting in our budget rankings. I do not think that it's necessary. It's probably something that can be achieved with our own budget, but some kind of work needs to be done to hold the office accountable and hold the other members of the board that have responsibilities to carry these things through to make sure that at all times, not just for any of these items, but for all future items as well that the ball can not be dropped. The work that's being done well Aisha. I think that at some degree we as members have to remind the office, maybe on a on a regular basis about those resolutions or items that need to push through. I mean I understand. I understand the spirit of what you're saying I completely disagree. No corporation is functioning the way that CB12 is functioning right now, and it's really not difficult it. It's very system. It really just takes the will to want to have a board that functions in that way and it's. I do not think that it's hard, because what, if all of us are not here next year, who's to remind the office the office should function. I do not disagree with you, but I'm saying that for right now, maybe the next thing to do is to keep reminding the office. Hey: what's happened with Xyz. Where are we in that process? Yeah and you know, because maybe you would not have to do it like on a on a monthly basis. I do not know to be honest that for me, that process has not been fun. For me, that process is part of the toxicity that I've experienced in this board, having to be one of the people very regularly saying hey what's happening with this, why is this not happening? This way are not we supposed to be doing Xyz and it becomes a matter of contention whether it's that people do not want to be reminded that they're not doing their job, whether they are taking a personal issue or have an agenda in relation to some of the topics, but that should not be allowed to happen right, but by I again, I agree with you, but by not saying anything, then it's like kind of oh yeah, yet forgotten so yeah, and we all people we all forget one way or another. I get it the office. This is their job, but you know we all forget, but continue reminding the office of those resolutions or issues that need to be addressed is the way to go, and you know at some point: if they do not, you know no. I honestly, I think that it especially considering the amount of antagonism that I've experienced in relation to many of these things. I think that we're past that I think that, where we are, is that it's time for the board's office to function honestly, this type of work is something that if it were functioning the way that it that it in my experience this is something people would get fired for. Honestly, I get it, but we're going back to you want to build some sort of a history are reminding the ex about z, about 50 time and those dates and so forth. So and so some of it you know some of it is like people forget and some of it they may be like neglected. I do not know, but do we have to continue to remind them all the time? I think that it's, I think that is definitely neglect. Sure. Do people just forget things, sometimes yeah, but should they be able to forget these things? Absolutely not if there should be a system that reminds people of what is outstanding is really what it is, and I have not had a problem saying hey. I see that this is not done missing, etc, but it has not been fun, but the response that I've received is not fun, which is why I do not think it should be anyone's specific responsibility to do what can just be done by a system just make sure that if you say it in a meeting and it's not in a minutes, then you have to make you know you have to point that out that it's something was not in the minutes, which is also the reason why I proposed and created a partnership. It only needed approval for all of the minutes to be done via transcript by trained stenographers, and I got pushed back for that as well, and but that is one of the reasons why I suggested that, because oftentimes things are left out of the minutes just going to the ask as well about the minutes this month so last month I had them submitted for for September. I actually wanted to ask: would anyone be willing to do now? The minutes for October? I'm sorry, I can't do any minutes. Yeah no secretary, I completely understand oc, so we're all the way. The way at least we've tried to do in the past is that we're splitting it up so that each month we can take this on. You know we only have 10 months. We have some members here, so it's roughly, you know about two times that anyone might be doing this. Would anyone be it will take on October? If not, you know, I can try and create a list and just assign it throughout the rest of the year ariel. What would be the deadline to when would you need it bye, just kind of thinking about everything else I got going on, I would say probably the 15th, the 15th so about two weeks from today. Okay, so I'll just put myself forward for October, then okay, thank you manny. I appreciate it and adia you could put me down for November if you want to just have that done already: okay, yeah and if there's specific time periods that you know just throughout the year in general that it tends to be easier. You know I'm always happy to try and accommodate that all right, so not to leave anybody else. The opportunity, if that is everything that's going to be going for tonight. I will then call the meeting to a close, so yeah. Thank you again. Everybody thank you. Have a wonderful rest of your evening. Happy fall, see you next time. Good morning, everyone bye good night.",
            "summary": "So essentially, every year, we're expected to provide the city of New York with a number of budget items that we think are of interest to us.\nWhat, the top three pressing issues are you'll, see that they give a bit of a kind of description about each one, and it usually tends to be based off of really what happens in the voting of the individual items for both capital and expense, which we'll get to in a moment.\nThe overview statement of the community, district, really, I think I can spare everyone not go through the entire paragraph unless you'd like to spend some time going through it now, but I And, you know, kind of goes into some of even the information that we might collect from the city at different points for the top three pressing issues.\nThe foregoing, reasons, CB12 M Manhattan, recommend the city to increase funding for mandatory right to Council, for anyone who has rent burdened pays 50 percent of their income in rent and also increase funding for legal representation in court.\nCb12 of Manhattan also requests that permanent long- term, affordable housing construction, build a high number of these apartments or housing units, with immediate priority being given to non- profit organizations and community land.\nWhat's, been a huge discussion with the android zoning Our district is facing a resulting proposal made by the near well the city of New York, and a resulting application for the inward section of the district that has been submitted to the department of City planning CB12 of Manhattan requests that the Department of City planning should dedicate additional planning staff to work with Cb12, M and local residents to formulate an implemental zoning plan for Washington, Heights and Inwood, and to provide technical assistance to Cb12, M and local residents to evaluate the inward rezoning proposal, including the draft and final environmental impact.\nI. Think in last year's conversations we had put forward some particular items that were focused on increased funding for mental health, services, And I think that it actually ended up getting picked up by health and environment, open environment , I just want to just let folks at least read through what was the summary last year for mental health and substance, abuse, treatment and prevention, programs.\nAmsterdam I just did, and he said both are in Rehab, so I'll ask them again, specifically, if you want for arden specifically, if the building was open and or specifically was it given the appropriate funding so that the construction could be done.\nAnd if there, if it's done and it does not need funding, then we it drops off right and then number two become And we've given a deadline, so, That sort of you know, availability, there, and once we've been able to hear from Martin, then I can also just establish.\nWhat we would do is have the tracking numbers so that we can easily have the city's response right next to the item when we're considering so that we know what they said, about, why it was or was not or how it was funded, and we could just like see the line items straight, acrosss and figure out versus having to keep going back and forth.\nWe can input it as we're discussing it, but I just wanted to go through just what the items were right now going through the statement of district needs document and then switching on over to the register.\nA, permanent long, term, affordable, housing, construction, building, a higher number of 100, affordable units based on community AMI, with immediate priority given to non- profit organizations and community land trusts, slash land banks that are partnered with non- profit, developers, though, for this item, I'll, actually just mention I- was What's.\nThe current bill that allows for people to have a essentially right to counsel and also an attorney, be provided for housing court matters and it kind of goes through 2022.\nIt's a local law to amend the administrative code of the city of New York in relation to providing these services, and it pretty much just goes into saying that the bill would amend local law number 136 of 2017 The housing court right to council law by requiring the immediate implementation of access to legal services for tenants facing eviction proceedings in housing, Court city, wide, And I can actually just open the bill.\nIt's, stating subject to appropriation coordinator, shall establish a program to provide access to legal services for covered individuals in covered proceedings in housing court and ensure that no later than July 31st 2022.\nMy understanding is that we're seeking to increase to increase that threshold, so more people qualify for the full legal representation and they're, not they're, not out just because they barely you know made the income eligibility is that is that a good summary What, the cover person is, because I think Janet was asking about a covered person and there's like a distinction between covered person and then income eligible persons.\nRight, because this is this was roughly about 2015 when really just what was the covered areas were presented by the city of New York to You know both that information of their income, as well as their household size The item that we were focusing on previously in regards to expense was to ensure that people had attorneys.\nIf ever they, you know, have a housing court issue arise, but Do. You maybe feel that the wording of that expense item needs to go.\nThe second item was funding for supportive housing construction for Lgbtq Eu I'll just mention that the reason why we had discussed this and actually sorry, let me go back and share my screen, so the public can see as well.\nThose were referring to programs that specifically are doing either enforcement or specifically the kind of rehabilitation that might be needed through HPD, the city's housing preservation and development agency, and then the last item is provide more housing for at risk and transitioning individuals.\nReally what's been the past few months or something just personal interest in the previous year , I believe we have discussed providing Wi- fi in public locations for people to be able to access the internet when they're doing their business, especially in the human services areas where people are spending hours, sometimes the entire day in those spaces and oftentimes need to communicate in order to handle the things that they need to handle so, but it did not get re- entered when Barbara was doing.\nBut basically figure out what are the spaces like the welfare office, where that type of support can be provided to basically have internet when people are in waiting, rooms, gotcha and just so as to know, I'm, noting it specifically as Hra service centers.\nSo I think that item would serve as a an expense, item, and I can include it here as the providing of or right rather providing for the creation of a fund to aid in upgrading electrical systems to inspecting you know basically inspecting.\nSo is it that you think that there needs to be some like a different line item that might not necessarily fit with funding for HPD Housing code violation, inspector.\nThat was probably the reason why we wanted to also add in that item, with the additional mention of funding initiatives to inform and educate tenants of their rights, There's.\nI guess, in the desire to not go through all community boards of the city of New York and read each and every individual one's items not have them be But you'll see so, for instance, the first line item there of the increasing funding for legal representation.\nThere is a housing hotline that is staffed by attorneys and staff members of various legal service providers throughout the city.\nSo You know so that in a way can impact you Any old business that folks wanted to bring up And, actually I'll, also just ask if perhaps members from the public, janet or danny in regards to one of the things on in our budget request is in relation to the community land Trust, and this is just an example where we voted near unanimously in support of the creation of a community land trust in our district.\nThat is doing the work in this case specific to community Land Trust, but I mean in all cases in the you know.\nIt's, probably something that can be achieved with our own budget, but some kind of work needs to be done to hold the office accountable and hold the other members of the board that have responsibilities to carry these things through to make sure that at all times, not just for any of these items, but for all future items as well, that the ball can not be dropped."
        }
    }
}