{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB6",
            "channelId": "https://www.youtube.com/channel/UCeY0bbntWzzVIaj2z3QigXg",
            "title": "November 19,2020 Public Place/ Gowanus Green presentation and Q&A",
            "publishDate": "2020-11-20",
            "shortDescription": "Find meeting materials here- https://bit.ly/111920PublicPlaceMaterials",
            "lengthSeconds": "2:24:23"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB6",
            "normalizedName": "Brooklyn Community Board 6",
            "twitterName": null,
            "youtubeChannelName": "Michael Racioppo",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCKaVsnwHRM6uXG-_rrWwHqA/videos",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "MLysKMjWNbM",
            "fillerWordCount": {
                "uh": 471,
                "um": 540
            },
            "readTimeFullTranscript": "78 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "housing": 93,
                "development": 54,
                "project": 47,
                "buildings": 40,
                "school": 39,
                "plan": 39,
                "place": 36,
                "slide": 36,
                "team": 33,
                "income": 33
            },
            "wordCountSummary": {
                "housing": 29,
                "development": 14,
                "team": 12,
                "school": 12,
                "project": 12,
                "plan": 11,
                "neighborhood": 10,
                "place": 9,
                "space": 9,
                "canal": 7
            },
            "fullTranscript": "Anybody else hi, I'm Lindsay, I'm director of Brooklyn planning at HPD at the housing preservation. Jonathan. Do you maybe want to call out those who sure I will just read down the list and actually maybe I'll just for the sake of tonight? And since we want to get to people's questions and get to the presentation, I will introduce you all quickly, so I think Mark unmuted himself from office of environmental remediation from HPD Lin introduced herself. We also have Aaron Buchanan from HPD and Michael Sandler from HPD. We have from the department of City planning team, Segee, Golan and Winston Von Engel, Jonah, Rogoff, Armatham, Amy, Jin and Thomas Smith, and we also have also from Oer not to be overlooked, is lialan from the development team. Here tonight we have Andrew Foley Sally, jilly, Land, Jay, Marcus, Aaron, Kaufman, Ira, lick, Tiger I, think I'm butchering some names but we'll get through this and I. Think. Let's see who else is here? Are there anybody if I haven't named you? Can you unmute yourselves great so and also, of course, CB6 is here as a panelist and we'll hear from them in a minute tonight. We are again excited to be here and thank you for taking the time out of your day and night. Tonight's format over zoom will consist of a presentation and a Q&A session. The meeting will run until about 8 p.m. Of course we are here to both present and to hear from you all. So we will be cognizant that if the presentation runs long, that we can be flexible to extend our time during the presentation we're going to have all mics muted from the general attendees, the chat function will be enabled we actually in some of our technical setup work tonight. We're hoping to have the Q&A function be available for us to receive your questions during the presentation so in it that unfortunately, wasn't enabled, and we can't enable it in the current environment. Otherwise we would all be booted out. So what we're going to do is we're going to pivot and we're going to be monitoring the chat tonight for your questions, which I think it will be really important, that we keep the chat to questions mostly. Obviously, people want to use the chat to express themselves and that's perfectly understandable. We also want to be able to monitor and get the chat to be a place where we can also get lots of questions. So please put your chat. Your questions in there we'll also be monitoring our email go on us at Planning.Nyc.Gov, and you can email us there as well and then we'll also during the Q&A session. Allow people to raise their hand in a first come first serve manner and they can ask their questions on Mike, and so you know as a reminder that we have now 220 folks that have joined us tonight and we had over 300 people register. We want to get to all of your questions so please be respectful and mindful of other people's time and also their humanness, and please keep it civil, particularly in the chat. A couple zoom tips to share is you know there are three symbols that you may need to use tonight again, if you raise your hand using the raise hand icon and are called on, you will need to unmute yourself with the mute unmute icon again we had hoped to have the Q&A, but that's not something that we'll have tonight so before we really get into the meat of the presentation. I do see that we have community board six here and also council member Lander. So if actually Councilmember lander, if you wanna say any remarks, you can unmute yourself, that's great! I'm unmuted! Can you hear me? Yes, all right great, it's wonderful to be here tonight with so many folks. Thank you to community board six for hosting and to both department of City planning and the Gowanus green team. This has been a big week for Gowanus already it was wonderful to be with so many of you on Monday when the EPA kicked off the super fun dredging. It's been a ten year effort to get to that point. It was so good to see the first bucketfuls of black mayonnaise come off the bottom of the canal. You know I, remember 10 years ago, when Walter Mugden from the EPA said that the cleanup will take longer than you want, but it'll be sooner than you fear, and when Trump was elected, I feared that it would be never that the Superfund program might be canceled before we would get a clean canal. But here we are the EPA and the Superfund survived the Trump Administration, and we've still got a federal government able to do big, bold things and that matters for the future of Gowanus and makes me hopeful for the future of the canal and our community and our democracy and those of us that all stood together. Fighting for the Superfund designation got to celebrate and big shout out, especially obviously to Congresswoman Velazquez, who led that 10 years ago and who we all work together with you know. For the same decade, we've been talking about the public place site, how to get it cleaned up and what should happen there and we're going to hear more of that history tonight. Where things stand in the cleanup and get more details about the proposal over the years, we've been pushing together on many of the details there together and we've made clear that what we need to see on the site is strong plans for cleanup that reinforce the Superfund cleanup of the canal and that the cleanup of the site itself is safe and healthy, that new development on the site be sustainable and resilient capture. Storm water participate in making sure csos don't flow into the canal and prepare for sea level rise that there be a public school on the site to meet the needs of a growing community and one that's working so hard to achieve school integration, as we've been doing in district 15 that there be a park along the waterfront as part of the waterfront Esplanade. And finally, the plan that we saw over the years was 75, affordable and 25 market rate and many people in the community who care deeply about affordable housing said on the one significant publicly owned site in the neighborhood. We need all the units to be affordable, so we can really meet the widest range of needs and I'm thrilled that HPD has listened and that the project is going to be as we're going to see tonight and it was announced earlier, a hundred percent affordable with 50 of those units for low income and very low income families making under 50 of the area median we'll look at later on what that means, with supportive housing for seniors and formerly homeless, families with affordable, homeownership opportunities for working-class families as well and with a site design that I think is really promising for the future of our community in all kinds of ways. So, I want to thank so many community members, both those who have shown up saying I really want to see affordable housing on the site and folks who show up in the community in the chat and say I, don't want any development at all. It's been a long standing conversation and it has pushed the project to be better and it is pushing the rezoning overall to be better and I feel really grateful to be in this community. Full of so many strong and vibrant and passionate activists and I look forward to hearing the presentation tonight and hearing the questions and answers as well. Thank you great. Thank you. It's all good yeah go ahead. All right, hi everyone, Mike Bresciovo, as you can see my name there, district manager, Community Board, six. We are happy to be surveying as a zoom conduit for tonight with DCP, HPD, Oer and any other development team, etc. We have been pushing for pre-certification meetings for a while and we are encouraged that Gcp has come to a you know come together tonight we have the other one on December, 2nd and I know this I'll put that link as well. You I mean there's already a bunch of people sign up for that as well for the infrastructure presentation. Of course, we are encouraged by pre-certification meetings, and you know engagement. However, CB6 will ultimately you know. Whatever our opinion on this ends up being will be determined on the content of it. I think what we saw today was you know, I would say, speaking with the board and very a lot of board members say I. Think they were very encouraged by the affordability numbers that seemed you know, because we just like I, think anyone who's involved in the affordable housing discussion in the city, the affordable, for whom question is always very important, and you know what was put out today is encouraging, but you know being encouraged and approving are not necessarily the same thing but I look forward to seeing the presentation tonight. I know that Jonathan and Jonah and Winston and everybody have been regular attendees of our CB6 meetings and we'll probably have them back a bunch more. But tonight, just like we did one of the presentations of the pre-certificate at the the drafts zoning presentation. This is for the community at large. Although I do see a number of community board members already signed up, and things like that, so it's great and I will I know I'm trying to get the list there, but I will just paste the list of the people that are already there and that have registered after I hop off this. Thank you, Jonathan and I, look forward to seeing the presentation and also, if you want to get because I know, a lot of people here do get their updates get updates from me. Basically, every day you can sign up at you can text Bkcb62222888 or just send me an email mycatbkcv6 or go to our website Brooklyncb6.Org and you can for either our daily or weekly updates, and you might get a little sick of me, but that's it back to Jonathan and good night great, thank you, Councilmember, Lander and Mike and CB6 so again to get right into it. Tonight we are here to talk to you about Gowanus, green, also known colloquially as public place. Tonight we will go over how the city has been planning for Gowanus green and then the development team will present on the specifics behind developing the sites, including site plans and massing project, resiliency and sustainability. The proposed affordable housing plan and some timing and next steps and first up from the agency team, is Mark Macintyre from the office of environmental remediation. Who will walk us through the history of contamination on the site in remediation updates. He'll be followed by colleagues at the housing and preservation development to talk about the project history and they will then hand it back to me to talk through the plant components and the zoning proposal that we are putting forth. That would facilitate this project so with that mark's going to take it away, I'm going to be manning the presentations. So the folks will tell me next slide. If something happens to my internet, there will be people who have the slides that are downloaded and they will take over and they will keep sharing. So here's to a smooth presentation, great! Thank you. Jonathan good evening. Our office runs the city land cleanup program, just as a bit of background, so the Gowanus canal and the path to its cleanup has understandably received a lot of attention over the past 10 years tonight, I want to spend a few minutes on the cleanup of the land that is public place for decades. This city property has been seriously contaminated and the contamination of the land has spread to the canal, causing the canal to be priced placed on the National Superfund list. But after 20 years of study and design, the land is now being cleaned up. This is an historic moment. After 160 years, this land will now be restored and made available for public and community use public place, as the slide on the right shows was the site of a power plant called citizens. It opened in the 1860s, with an early energy technology that heated coal to produce gas that was used to power, Brooklyn homes and streetlights citizens operated for a hundred years until it was closed in the 1960s. This technology produced a lot of waste, much of it coal, tar, which is heavier than water. It sank beneath public place to as much as 50 feet. 150 feet. Excuse me below the ground and spread to the canal. Next slide, please, ah, on the right question is what is going on here, what that is an excavation to remove a buried gas plant structure and contaminated soil around it? The chronology on the left shows the steps towards the land cleanup. The investigation began in the 90s in 2007, DEC state department of environmental conservation decides honest on a site remedy. It takes a decade to design the remedy and then, in the summer of 2019 national grid breaks ground, and the cleanup begins a word on the remedy. It is a containment remedy. It will remove contamination to a depth of 22 feet. It will place a cover across the site and erect a barrier wall to keep coal tar from reaching the canal. This remedy protects public health in the environment, by removing contamination and by boxing in contamination remaining beneath the site, preventing it from spreading further. This is a standard approach for remedies at former gas plant sites next slide. So here are the remedy elements: a barrier wall. This is 880 feet long. It's absolutely critical to the right success of the remedy. It keeps coal tar from reaching the canal and protecting the canal remedy. For the long term. There are recovery wells that are going to be located up gradient uphill of the barrier wall to capture coal, tar that mounds up against the barrier wall there'll be excavation. As I mentioned of coal tar down at 22 feet to date, 70,000 tons of contaminated soil have been removed and will continue more removal until the remedy is completed next summer. There will be a cover built across the entire site. This will prevent any exposure to people who come to public place in the future and there will be importantly, a what's known as a site management plan. This requires national grid to maintain and monitor the barrier wall. The recovery wells, the site cover to ensure their long-term effectiveness. The state DEC will also use the site management plan to direct any further remediation of shallow soil at public place. That may be necessary before the developer. Gowanus green builds on the site next slide, please so upon the rezoning of the Gowanus. The city will place environmental requirements on public place. This will require Gowanus green, to study the extent of soil contamination beneath the buildings it proposes to build. If the study shows further remediation is necessary. Gowanus green must perform this work to the satisfaction of the city and the state before it can pull. Building permits to prepare for this work. Gowanus green has asked the state DEC to make it a party to the brownfield cleanup agreement under which national grid is now remediating. The site after national grid finishes constructing the remedy. Gowanus green will study soil conditions at public place to satisfy the city environmental requirements. If the study shows further remediation is necessary, such as installation of a vapor control system beneath the buildings, Gowanus green will have to complete this work to the satisfaction of the state and city before it can build and occupy a building's own public place. Thank you I'd, say Jonathan yep, turning it over to HPD yep. Thank you Jonathan. Thank you mark for that update and good evening. Everyone again, my name is Lynn director of Brooklyn planning from the Department of Housing preservation development. I'm also joined here by my colleagues, Erin Buchanan Michael Sandler and Uriah Johnson they'll be on hand to answer any questions at the end of the presentation tonight and I want to echo Jonathan's sentiments. You know we're very excited about tonight and we definitely appreciate everyone taking the time to join us and give us this opportunity to discuss a really important project that has been in the making for many years. You know mark just talked about very long cleanup process, so I think I'll talk through the background. Just very briefly, many of you are familiar with this site. It's nearly six acres of vacant underutilized city-owned land, which is you know, it's roughly two city blocks, bordered by Gawan's canal to the East Fifth street, to north mystery to the West between Lucur and Nelson, somewhere in between there to the south in 2008, this development team and the Gowanus green proposal was designated and selected through competitive RFP. The designation came just in advance of the adjacent Gowanus canal being nominated as a Superfund site and then later designated two years later, so cleanup plants were starting to come into place and, and so, while those plants of the cleanup plans for the site and the canal were happening, and you know continue to be put in place, the city has been actively working with this designated development team. On shaping the project to include major additions that benefit the city and this community at large, the project today has evolved and we believe it reflects the growing needs of affordable housing in this city and I. Think, especially during this time of Covid-19, when we are hearing about the growing number of homeless, New Yorkers and many more that have lost their jobs. Affordable housing is not just going to be a problem. This administration, it will continue to be a problem for the city and especially in a neighborhood like Gowanus, where it's near transit, it's near schools, and it offers so many rich community amenities. We believe this site represents a tremendous potential to create affordable homes for individuals and families who couldn't afford to live in this neighborhood, otherwise, so I also want to just quickly I feel, like the council member did such a great job. He pretty much had all my talking points, but just highlight some changes. The original proposal had 25 percent market rate units. Today we are looking. The development team is proposing a 100, affordable project. The total number of units has also increased and that increase reflects the growing need for housing in the city and now that it is a hundred percent affordable. The total number of affordable units have increased significantly from the original proposal. In fact, the number of affordable units is almost doubled. The initial amount proposed in 2008. and it may seem like I'm just talking about housing, but the proposal that the development team will run through tonight includes additional community amenities and infrastructure on the site that complement the housing. That's go that it's going to bring such that the proposed project today will include 1.5 acres of mapped public park, that's open to the entire neighborhood. It would also include landscape view, corridors and shared streets. Oh my screen, sorry shared streets that are thoughtfully designed to connect planned green spaces at the site. The current plan also allocates space for a future 500 seat, public school, which was not present in the original plan. So, lastly, responding to the existing condition. This project will also include significant green infrastructure that will deal with stormwater management in a sustainable way. Next slide, please Jonathan, as some of you may remember, HPD and DCP hosted design workshop in 2018 with more than 70 community members, and we came back again and gave another update in 2019 on the project. At these meetings we heard questions and concerns and that have and will continue to shape our site goals. So the goals on the screen tonight, you know they're going to be driving forces for the Gowanus green project and, as we continue with the planning and design process, we will definitely always be guided by. You know these six goals that we have creating a sustainable, resilient, environmentally healthy community, supporting cleanup and remediation, creating and preserving, affordable housing for all people, but especially those who are at the lowest income brackets building network of parks and open spaces in the Gowanus, creating an inclusive neighborhood that is integrated and accessible for all and to support community and economic development for a thriving neighborhood next slide. Please. So I'm going to shift gears a little bit and talk about affordable housing in general. What is affordable housing? This is. This is often the question we get when we go to any community in the city with the affordable housing projects affordable, for whom, so that is it is relative. Affordability is definitely relative, but to us the definition that we're using is that affordable housing is when a household spends no more than a third of its income on rents and utilities, and here on this slide, we have a nice round. You know examples of what the approximate rental expenses might be for those gross incomes and what it should be. So, if you're making 20,000 a year but pay more than six hundred dollars a month for housing, then that's not affordable, that's not considered affordable, but if you're making a hundred thousand dollars a year and paying six hundred dollars a month for housing, then I think you're very lucky, that's extremely affordable and probably the luckiest person in New York City. But if it's over, if your housing expense is over 2500 a month and you're making even at a hundred thousand a year, then that's not affordable. Next slide, please! So here I'm going to talk about AMI, which is another term that gets used quite a bit when we're explaining affordable housing. It stands for area median income and it is something that the federal government determines annually for different regions. The AMI number acts as an indicator based on household size and what income category fall into and in 2020 the area media, income for or AMI for, family three in the New York Metro area is a little bit over a hundred thousand dollars, and you might say that is pretty high, that is very high and actually rather high for households who are looking and need affordable housing and can't afford it. So if we go next slide, please so the AMI, the 100 AMI, what it does it acts as a point of reference. It's a point of reference that we use when we're setting our income requirements in our projects, so the incomes and it's based on family size and family income. So the incomes show on this slide are examples of extremely low to moderate income. You know limits of three person. Households and HPD programs are finance programs which the Gowanus green project will use aimed to provide housing for individuals and families at varying ranges. So not just that the you know the median area median income of the New York area, it's the percentage of that, and it is a range of that. So we are talking about you know providing housing for the retail salesperson who's supporting could be supporting a child and an older family member to family, with two working adults in you know, with modest paying jobs. So this kind of gives you an idea of the you know the type of income and AMI's that our programs try to target next slide. Please, and here are some sample, rents and I know this. Is this table there's a lot here, but I do think it's a really great table and I want to recognize Uriah Naren at HPD for putting this together, because I think it really it's very effective in showing how the city's, affordable housing programs compares to market rates housing in the area, so especially at the lower income aml brackets. If we take a look at the top line, it shows the example households we're looking at so in the column on the left, where they're you know, studio apartments, someone who is a single person making about a little bit over or just under 24,000, that's a 30 AMI a sample rents from one of our projects would mean he would pay or she would pay just under 400 a month for housing. And if you move over to next column, a couple making just about a little bit over 70 thousand dollars together would be getting a one-bedroom apartment that is around 1500 a month. And then, when you go to the families, the two bedrooms there, depending on the size of the family, depending on their income, so a two-person household, making 45,000. their rent is about 1100 so and then a family of three. Where you know, if you have like one working adult making 40,000 your rent is a little bit less, even though it's still for the same two-bedroom. So it's it depends on the household size and the incomes and then lastly, I think on the bottom line. The sample market brands I want to you, know bring people's attention to. This is what the market rents look like today, the you know these are averages of these size units in the Gowanus neighborhood and surrounding neighborhoods. So, like parts live in Kerala, Gardens couple hills so they're nearby neighborhoods. These are what rents are looking like today for a studio under 2000 for one bedroom a little bit over two thousand, and you know a three bedroom would be three thousand, so even Anadoly we are hearing the rents and housing prices are coming down, but certainly in this neighborhood and surrounding neighborhoods, it's not coming down enough to serve the people. Who are you know for low lower incomes? So, and it's you know, families who are making 60 and 70,000 dollars a year would not be able to really afford an apartment in this neighborhood. So that's what you know this project. We're striving to do is try to hit and provide housing for people who can't live here. Otherwise, next slide. So the development team we'll discuss the proposed buildings at Guanis grain in a lot more detail than I am right now, but I do want to end with a summary for the city's, affordable housing goals. So, in addition to the map park, in addition to the allocation space for a new public school and new infrastructure, this project, Gowanus grain will be 100 affordable. It will serve New Yorkers with a wide range of incomes and needs. Almost half of the rental housing will be dedicated for those extremely low and very low income households. So those you know, family three, that's you know making about fifty thousand dollars a year. At least. Fifteen percent will also be dedicated to formerly homeless, households and- and we are also looking to include buildings that would be dedicated to low-income seniors, as well as supportive housing with supportive services, on-site and affordable home ownership, as well. So with that I think I will I think I'm turning over to Jonathan at DCP. Yes, thank you back to me. I'm going to run through, hopefully very quick, some slides about you, know our plan components and the zoning proposal, since it is pretty important to how the development project will be facilitated. First, as you know, there are probably a lot of people who are new to the entire process and study. We have been looking at an 80 block area for appropriate changes to zoning and land use, and we've studied particularly and propose specific zoning along the canal that responds to its unique conditions to foster a vibrant, accessible resilient and active waterfront with a mix of uses, new housing permanently, affordable housing and commercial artists and maker space, and a centerpiece of the vision that we have, and that was created over the years of process and engagement with the community, is the waterfront access plan that will provide a public open space along the canal and a key part of that waterfront access plan is Gowanus, green and, as many people have mentioned, Gowanus green is a extremely large site. It's also city owned, and that presents an enormous opportunity to really do some innovative site master planning. Some actions towards that master planning is first, we are De-designating the public place designation. This is necessary because public places do not allow housing to be built and at the same time we are proposing new public streets to reconnect the community to the waterfront and also a new public park. Looking at this from a bird's eye view, Gowanus green sits adjacent to the Covid-19 elevated line that cuts the site off from the adjacent Carroll Gardens neighborhood, there's also a sewer easement that bifurcates the private site to the south and crosses the future public park. The new streets, extensions of Hoyt, Liqueur and Nelson will reconnect the community to the canal and improve neighborhood livability with better access to open space in the waterfront, and when you put this all together, you start to see that we have a 1.5 acre, mapped public park that will also go through its own community engagement and design process. This will occur in the future after the Gowanus plan is approved that mapping application needs to be approved first. Currently, it's anticipated that the construction of that park will be overseen by the development team as part of the overall comprehensive remediation and site prep and construction of the site in the project and also, as mentioned a number of times, the plan and the zoning will help facilitate space for our future new public school on the site between the park and new streets and the space for the school. You get a glimpse of the remaining space left for where the buildings can go, and this is one of the reasons for the proposed heights and the massing that you will see the space taken up by the critical public infrastructure and key community facilities in open space means. The remaining development is really squeezed up. If you will another key principle that we've kept in mind and that we've heard from the planning process and the community is also evidence in this section, where we've kept in mind to shift the bulk and height away from the Carol Gardens, Brownstones and away from the canal to provide more openness and light and air. And this results in more height towards the middle of the site, and so, with that we'll hand it over to the development team who will go through specific elements of the development proposal, thanks Jonathan, my name is Andrew Foley, I'm associate director of development at Jonathan rose companies, one of four partners of Gowanus green. So our partnership includes my firm Jonathan rose companies, Fifth Avenue, Committee, Bluestone, Organization and Hudson companies. All four developers have been deeply committed to building affordable housing in this community for a very long time. So we are very excited to be presenting some updates to our plan, which we first embarked on before my time of 12 years ago or more and we're excited at this moment, and the updates will take you through quickly will show that our project is building more affordable housing at deeper levels of affordability, more publicly accessible, open space, providing a site for a future public school and building a more resilient and sustainable project than what we proposed back in you know, 2007. So what we're going to do we'll try to move quickly? We want to get to Q&A. I will just take you through some meaningful design updates, we'll talk a bit about the open spaces, we're going to get into resiliency and sustainability, particularly focusing on the approaches on stormwater and wastewater, and then I'll turn it over to my colleague, Aaron Kaufman at Hudson companies to take you through our affordable housing plan next slide. So this is the updated site overview of our project. As you can see, six residential buildings labeled a through F, comprising about 950 units of 100, affordable housing. You can see yeah that we've provided a roughly 23 24,000 square foot site for a future public school along Hoyt adjacent to the future public park, which also provides some at great play space for the public school. You know just wanna. One thing I just wanted to note is that you know you'll see in some of these design presentations. These are all very preliminary. This is not necessarily indicative of what the buildings will look like. These were massing designed in sketches to just give you a sense of what our intent is and we'll be developing designs much further as we go through and providing the community. The opportunity to give us input on the what the buildings will ultimately look like, but I think this gives you a good sense here. Next slide. As Jonathan mentioned, you know the you know, from public input and thinking through the site with our really tremendous design team at Marvel Architects, we zeroed in on a strategy of putting height in the middle of the site, so that is keeping heights along Smith, Street and fifth low both to be respectful of the brownstones to the west, but also as a pedestrian, walking down that very active street, not feeling like there's too much height loaded on that side. We also wanted to keep height away from the park to provide as much natural light to the future park as well. We also realized that was the right location for a future public school, and so what you have here are buildings. You know along Smith, roughly 10:11 floors in total on the other side of the site, a five-story school with a 10-story building, and then you know the result. Is we try to push the height as far into the site as possible to minimize the impacts to our surrounding neighbors? Next, just one thing to actually level back one slide. If you want my job, just one thing we wanted to highlight here too, is you know our intent for these buildings to be incredibly resilient and sustainable buildings? Were our intent is to put solar panels on all of them green roofs and build the building envelopes to a passive house standard to really be entered as energy efficient as possible? Now next slide, just a quick look at our ground floor, so we're proposing to build about 8,000 square feet of retail along Smith Street, no tenants identified at this early stage, but we envision this serving. You know responding to the needs of the community neighborhood serving retail on south of liqueur along Smith all the way through Hoyt, you see a series here of community and facility and commercial spaces. Again we envision a mix of healthcare uses. Maybe some senior uses we'd like to have an art use in there. We again look forward to coming back to the community to get more input as the product as these buildings progress on what types of uses you want to see north on liqueur you'll, see in kind of a light, gray, light Brown Masonettes, those are residential, ground floor units that act that help activate the street and build a sense of community, and then lastly, you'll see the site for the potential school here next slide. So this is our landscape site plan. So we really wanted to align our projects with the goals and principles outlined by the Gowanus Canal Cir conservancy through their lowlands plan. We really admired that work. We think there's some really good thinking in there and so what we one we hired skate architect, landscape, architects, who's been doing that work alongside the Glass Canal, Conservancy and you'll, see here the result of the vision that we put forward. You know we strive to create a poorest site that connects to the existing street grid and invites residents to come through our site through publicly accessible, open space and visit this beautiful amazing park and shore public walkway. So let me make sure I'm not forgetting anything so you'll see here and I'll just take quickly. Take you through kind of a network of publicly accessible open spaces. You know defined by our shared street, running through the site from Smith to Hoyt, and then rain gardens kind of dividing the site about at the roughly at the midpoint that are pedestrian-only passages and then a canal view plaza along the canal, which we'll talk a little bit more about next slide. So really I. Think the central pub public space in our and our plan aside from the public park, is this. The ship street and a shared street is basically a pedestrian. You know preferred street in which pedestrians, cyclists, motorists all negotiate the public realm together. You know I, think in this moment of Covid-19 that we're all living in I think we've all learned that streets, our public space, that we you know we do a lot of living there. We, you know they're, really important features to our our cities, and you know shared streets are really designed to generate that kind of social life that we see in great streets. European cities have been doing this for many years and benefiting from the great cultural exchange that happens when you just have people kind of in the streets together, and you know the Dutch call it a wound, which roughly translated means like a living yard. You know our goal is to bring the first wounder to the Gowanus neighborhood and we think this is a great site to do it, particularly because there's not a lot of through traffic. This will be a single lane street. So there's not going to be a lot of through traffic in this area, so we think it's a really great opportunity to put pedestrians first here next slide. This is just calling out. You know this shows the intersection of Smith and our look where shared street. You can see here that there's you know orientate. You know we showing kind of where vehicle vehicles bikes pedestrians, intersect. We also showing here you can see that there are protected spaces provided on the other side of planters, provide some protection and room for ample seating. Next slide. Here's just a section showing how we'd like to organize the street you'll see that a portion of this street will be a mapped street and then there's a section that shows our swale trail and sidewalk that'll, be in the private side, which allows us to collect storm water and run some private green infrastructure below which we'll talk about in a moment. Next slide. This is a view looking south to the project from fifth street. This will show you know again we're envisioning this being a pedestrian only passageway through our project, in a series of rain gardens and we'll show you those real quickly next slide. So a rain garden is basically a garden that uses the rain for irrigation and has a pallet of plant that is adaptable to storm water conditions. So you can see that this is a feature of our storm water strategy, but also we're hoping to activate this with communal gathering spaces. Seating areas, places for active play. It will be a kind of a protected area without vehicle traffic, and also our masonettes will have kind of a stoop-like feeling of you know many streets that we, you know we enjoy walking down in New, York next slide and then south on the queer we're proposing another rain garden that will be have a heavier garden, feel and be a little bit more geared towards for compassive type activities. We see it being a contemplative space, a place for meditation yoga, a place where it'll have flexible and formal seating places that'll just be a little bit more, not intended to be as active, digitally noisy as the one to the north of on the queer next site, and then, lastly, this canal View Plaza. We think this is a really great moment. It's across from the the park it's going to have a lot of activity coming from the shore public walkway. We would like to have this really feature some great art, we're big fans of the work that Guanis Canal Conservancy aged has done to show how we, the canal and the lowland, can act to be activated through art that reflects the history of the canal, and it's also going to be adjacent to some community space. That again will be seeking community input on programming and at a future date. But we think this could be a really great place to have an active community area next slide and just quickly on resiliency. So our plan is to elevate our buildings over six feet of what is currently required by code. So just to look to the right of your screen, you can see the mean high water line in 2020 and kind of the one percent. You know big storm event anticipated flood levels, our project, you know, New York City, has done some additional study to study resiliency and we all know, with climate change and sea level rise that we need to be anticipating of flood events to get higher and higher. So we've proposed to build our buildings to an elevation that is beyond the highest forecasted level in the design guidelines, which is the 2100 Hun one percent. You know flood level and, as you can see, you know to be nega. You know the design for the park is yet to start, and you know we'll have to you know the departments of parks will have to work through. You know as they work through resiliency as well. How do we also make the park resilient while connecting it to the short public walkway and connecting it to the water so more to come on that next slide? So, let's talk about Csos, a topic that we know and understand is a really important topic for the community and one that we also care a lot about. We really applaud the community's advocacy to ensuring that this is something that gets addressed in the rezoning, and that is something that is addressed in our project. And so you know we are early in. You know there's a big meeting in a couple weeks and we know that DEP and city planning and other agencies are working on a substantive update. Then, and you know, we have not seen the environmental impact and so we're early in this. It's going to be a big part of what we do, but just wanted to highlight that we as a development team. You know our goal is to make Guanascreen a net zero development and we wanted a net zero cso development. So I wanted you to talk through a few quick strategies on the storm water side and on the wastewater side on storm water. Our plan is to divert a hundred percent of our stormwater away from the combined sewer and we'll show you how how we plan to approach that and then. Secondly, we not only plan to address the stormwater on our site, but also address additional roadway runoff around our site by installing bioswales around the perimeter of the project and on wastewater. We look to reduce wastewater through really aggressive strategies on ultra low flow fixtures, water, efficient appliances and other controls that allow us to dramatically reduce our waste water flow next slide. So here's our site plan again just showing you know we have a network of green roofs, rain gardens our swale trail, which is basically like a long bioswale that goes down the center of our site, and you know first, actually, you see on blue around the site. You can see those are where we plan to install street bios whales to capture runoff from Smith Street Hoyt in fifth and yes in fifth, in the south side of La Queer, which will be public right of way and then in to Dr to address our stormwater. Our proposal is to install green infrastructure alongside Liquir that captures in heavy rain events, because again our green roofs and rain gardens will do a lot of good work. You know, but at heavy rain events where we would have a perforated pipe that goes down the center of our site connected to a water quality unit and that quality water quality unit in heavy rain events would actually deposit clean water into the canal next slide. So here's just a graphic to show how you know roughly how this works. You know during a heavy rain event, our green roof will absorb water, we'll collect water and cisterns to use for our rain gardens, and our swale trail will be doing a lot of work to capture and filter water, but there's this hydrodynamic separator, which would be sub service installed on our site below ground that would help to clean the water. So when, in heavy events, the water flows out into the canal, it flows out as clean water next slide and then on wastewater. There are a range of measures that we can do to dramatically reduce waste water. All four members of our team have a lot of experience doing this at our own projects to great success. It includes installing low ultra low flow flush, toilets, efficient fixtures showers faucets. You know one thing we have found is that installing dishwashers in all of our residential units can cut water usage by 30, there's also a circulation controls that means. So when you get in the shower, you know when you turn it on and it takes a while to get to a temperature that you're comfortable actually getting into the shower. There are controls that actually will keep prevent the water from flowing until it heats up to your desired temperature and then start flowing that can those controls can also be applied for other sinks and faucets in your home, and that kind of savings can add up to significant savings in wastewater flows. So you know more to come on that as we, but we you know. We think these can be really effective strategies that not only we can do, but the whole neighborhood could do to really reduce wastewater flows and help us achieve our goal and, let's see with that next slide, and so with that, I'm going to turn it over to Aaron Kaufman at Hudson companies who will take us through the affordable housing plan. Thank you, Andrew. My name is Aaron Kaufman, I'm a principal of the hunting companies and head of affordable housing and I'm joined by my business partner, Sally Gilliland, who can wave hello Sally all right well, who runs design so we've been working together on this project and so we're going to go through the affordable housing goals, our affordable housing plan and briefly go into the affordable housing. Phasing next slide. So, as we've led off, councilman lander led off and we've been saying before it will be 100 affordable with 50 of the housing dedicated to households with incomes, earning or averaging below, 50 AMI and as Lynn mentioned, 50 AMI is a roughly 51,000 for a family of three. So if that's a single earner with two children, you know you could think about that salary. Feeding the three it equates to roughly a rent of about 11:10. I'm sorry yeah about 11:10 a month for a two bedroom apartment, 1270 for a three bedroom apartment and 15 of all rental units will be dedicated to formerly homeless households. No more than 40 of the rental housing will be for moderate income, households between 80 and 120, AMI and again 80 AMI for a family of three is roughly 82,000 and 120. Ami, obviously is like around 120 2,000 as well. Just to give you an idea, those rents for a you know: two bedroom start around 1870 a month in 2020 terms, obviously we're not closing in 2020, but that's the only data we have, but that just gives you an idea of what the affordability will be. Senior housing will be provided for older adults 62 and over. We will have a supportive housing building of permanently available supportive housing for formerly homeless, disabled individuals, homeless, families with a disabled head of household and then finally, we're pleased to continue the affordable home ownership, which was in our first presentation way back our winning proposal back in 2008. We are carrying some of that home ownership into the project and those will be available for households earning between 80 and 130 AMI as well. Next slide, you can see here we're planning to use the off-the-shelf programs that are provided to developers from HPD, we'll be using all five of these programs in our six buildings, mixed income. Ella, you can see the alphabet soup here in terms of the types of programs we will be using. As we start developing the project you can see. Some of them have other set-asides that you know require a mix of incomes which I think we all agree is good for the city next one. So you can see our housing plan again. We have 950 units working our way from Smith Street East. You know we're looking to bring in you know on the Smith Street side of roughly 260 apartments again with a mix of incomes and permanently supportive housing, and then we will, you know, move to the taller buildings as we go down towards the water. We'll talk about that in a second. It just gives you an idea to see where the units are going. The home ownership will be in its own building, that's building f! You can see there at the southeast corner near the Hoyt Street extension. Closer to the park and the water next slide, and we just wanted to back up for a second right. We were designated in 2008 by the city and you know at the time I think we were I think we were part designated because of our rather progressive stance on bringing affordable housing to the Gowanus. We essentially had 74 of the units as affordable housing in 2008 and then 9. that was defined as anything below 165 AMI and just to give you an idea of what those income ranges were back in the original proposal, we had only 13 were below 50. we're now offering we're requiring 50 on ourselves, and you know you, then you had some more in the lower middle range 51 to 80 and then the rest of the upper moderate and then 26 were market rate, and you can see how we have shifted, and this is really due to the De Blasio administration discussions with Brad Lander Community stakeholders. You know we realized that we, this was the real opportunity with the city to bring true affordability to this site, and that's why you can see the breakdown here. 50 below 50 10, between 51 and 80. 40 between 81 and 120, and then again the homeownership units may have a few that go up to 130, but it's a drastically more affordable project than it was even back then when it was still considered the best at its time. So we are very proud of this new proposal. Next slide and again, I just alluded to this- you can see here in terms we're looking this to be looking for this to be a three-phase plan, basically running downhill towards the water from Smith Street. You know doing at least two buildings in each phase. We can certainly go through this in Q and a but you know in and obviously in every phase you have a wide range of incomes and a wide range of affordable programs in terms of permanently supportive or senior or home ownership, combined with the low income moderate income. That is going to course throughout the three phases, and you can see the park, School yard and the school as well and I believe that might be our last slide next slide. That is correct and you know we're going to jump right into the Q&A, but before we do, I just want to make sure everyone's aware. In less than two weeks time, we will be coming back for an infrastructure update, including the Csos transit in schools. Topics that we know are very important to the community and we're excited to be coming back so quickly and also as we've announced and talked about. We will be certifying the overall rezoning into public review. So you'll be seeing lots more of us and we're happy to continue to come out to come out as many times and to as many folks to present and answer questions on anything that you would like. And then there is the MIH and affordable housing meeting in 101. We actually gave this presentation in May of 2019 and we would like to you know, come back and give that same presentation to the community board. We have it down as Tbd just given the amount of meetings and work going on in December with the holidays. It's something that we still need to work on to calendar, but we plan to have that meeting and so I think, given it's 7:17, we would, you know, break for five minutes, I think. Maybe we can make this a two minute break and we'll come right back we're just going to get internally situated with how we're going to take the questions next who's going to go first and then we'll be right back with you to answer your questions. You, okay, I, think we are settled over here Amrita. If you can throw up the the timer share your screen. There you go. We are just because I know we have a lot of people who want to talk. We are going to have a two minute, timer we're going to cycle through people who have raised their hands. You know probably I, think a three at a time and we can make this up as we go and then we're going to shift back to questions that we've gotten from the chat and also from emails, and so I think with that we can start with first come first serve for the raised hands. Is that we have Amy who's handling the raise hands and we have Alex who's going to moderate questions, written questions and he'll read those off to us great okay, so the first three people with their hands raised so Kevin Duggan, I'm going to unmute you now you should be able to speak hi. Can you hear me yep, oh great thanks so much for taking my questions and for the presentation? Yeah. My name is Kevin. I'm with the Brooklyn paper and I basically have two main questions: do we have a build year for this or some timeline you give for this project? And my second question is: does the development team also pay for and build the school and the park, or is that something the city would pay for and build? That's it that great. So those are great questions. I think the first one we can hand off to the development team if they can take a stab at that and then I can take a stab at the questions around funding. I think if the you know I think based on the site prep and what needs to be done. You know we could be ready in 2022, but I don't know. If that's not exactly when you know, we think this may start because there's always delays. So it's hard to give a year I think we have to defer to the city in terms of pipeline and capital availability before we can give like a hard answer on. You know when this the start year would occur, but certainly I think everybody here is excited to get it started. Yeah I think thanks, Aaron I think that's a good answer. I think you're right. The other part of that answer is on us and on the city, and it's also partly entwined with the approvals. As we know, it's currently zoned m3 and a lot of things have to happen, including you know, obviously, the zoning approvals to facilitate the project. So you know working out from there it's a little bit, tbd and I. Think on the funding question that you had I think those are things that we're also still working out clearly we're proposing them and we're mapping the new public park. That would be approved and mapped, and so you know right now, given the fiscal crisis, that's ahead of us. You know we don't have those answers today. So, but thank you for your questions. Okay. So next person is Jack Riccobono and I'm muting you now hi thanks, Amy Jack Ricobono from voice of Gowanus we're an organization of community groups and activists whose founding members helped to push through the Superfund site. Designation and I know that a lot of you presenting tonight have put a lot of effort and time into this presentation and into this plan. But you know our group and the community has really serious health and safety concerns about this development plan, and I'm wondering if you can point us to any other site in the city with the same level of coal tar contamination that has been turned into residential housing, and if you are aware that residential housing over coal tar contamination has led to cancer hot spots in other areas of the country and I would also like to ask why the remediation was downgraded in August. Without any public comment, so my name is Ira Lichtiger, I'm a principal of the Bluestone Organization one of the members of the development team. To answer your first question the best one example that I can think of is Stuyvesant town, which is also manufactured gas plant development that really wasn't remediated and the with proper monitoring and a cover system. It has been proven safe for residential occupancy. The notion that you can not build safely to residential standard on a manufactured gas plant is just not the case in terms of the city's health department, the State Health Department and the city and state environmental agencies, and many examples where these pro- and this was a particularly you know large and lengthy. You know hazardous site, but partly because of the nature of the product, the coal tar, the fact that it's a heavy product that sinks until it gets to a point where something stops it and it doesn't come back up unless, with the monitoring wells, they are going to be bringing stuff up to when it you know to prevent it from putting much pressure against the bulkheads. You know so there's a as mark went into earlier. There's a combination of this remedy, there's the bulkhead that protects the canal from the you know to keep the remedy intact, and the grid is doing really. The heavy lifting of this remediation by hitting the gas tank hold the coal tar holders, which is the bulk of the real contamination on the site. We do expect that there will be additional contamination after they are there. They have done with their remedy, which takes care of the hardest part, and you know we will be required to and we want to- and you know we'll make sure that any place that we're going to be digging and, in addition, we'll be doing additional testing all around the site on in a testing plan, that's got to be approved by the state and the city will be involved in it as well, so we'll be taking out any additional. You know heavily contaminated soils prior to you know, building each of the buildings actually prior to building any of the buildings and then there's a cover system that consists of the impermeable surfaces across the site at which will be tested for the site will be tested and engineered. If there are hazardous vapors that could pro that could affect safety, there will be a vapor intrusion system that will protect that it different types of systems are available depending on you know the nature of the the intrusion. So, in addition to that, there's there are institutional controls, there's a deed restriction, environmental easements, basically on the site that require monitoring that require management of the site in perpetuity, so that, for example, the two feet of clean fill there will be controls so that nobody can just dig there without without having a plan that is approved. So we actually feel you know very comfortable building safely for both for residential and you know for school purposes, which is basically this really the same, restrict the same level of restriction with the remedy. That's been designed here and has been used many times in the city and across I believe across the country, but I know in this state and in the city it's been used on many sites, thanks Ira I, don't think I don't know. If mark has any helpful context about the DC change. I, don't know how much we can talk into their process. Yeah I can't this is mark. I can't speak to the public participation piece of the DEC announcements, but the DEC announcement at first blush. It looks like oh, my gosh we're going backwards, but we're not the you know. The initial view that contaminated soils needed to be removed down to eight feet was reached in 20 2007. There have been subsequent studies of the of the site, giving us a better understanding of the extent of contamination in the very shallow soils, and most of that shallow contamination is going to be taken out when the existing coal tar structures are removed. But you know what shallow contamination is left is going to be addressed by presumably by the development team, so that two feet of clean soil and two feet of clean soil is a standard remedial element in a residential cleanup across the state. It's been that way since 2005. no one has suggested that's inadequate. That's good I also know just looking at the presentation tonight that most all of the site is going to be built upon. So two feet of soil is really not going to be covering much of the developed site here. You know when it's put to public use, it's going to be buildings and there are concrete foundations and the sidewalks and the roadways and all of those are themselves very effective barriers protecting the public from whatever is beneath those barriers. Thank you. Thanks mark I think we have one more speaker, I, think right, yep. So the next speaker is Encore Dalal. You can speak now. Hi. Can you hear me? Thank you. I first just wanted to thank you all for your time and thank the council member in particular for joining us and I, wanted to express my strong support for this. This entire development and, in particular, I, wanted to express my strong support for the incredible amount of affordable housing that you're, proposing 950 units of affordable housing. I think can make an incredible difference in the lives of thousands of people and I am so excited to welcome. So many new people into this neighborhood I know you spoke a lot about some of the different environmental remediation efforts you're undertaking, including how they worked at sites like Stuyvesant, town and Peter, Cooper Village, and if I heard correctly, my question is just it sounds like there's an ongoing piece as well right that the city will continue to make sure that the site is appropriate for so many new homes and the city will continue to monitor the safety of the property. Is that correct that is well national? Well, first of all, Nash you know national grid has will have a continuing monitoring requirement. They're going to be, they have to be you're. Coming back to check on their monitoring wells and to clean out, if anything does come up and we as the owners of the property, we will also have a continuing role in it under the institutional controls to make sure that every the cover is kept intact. Probably, among other things, that's wonderful. Thank you yeah, and there is a there is. I'm sure there is more could speak to this better than I can, but I'm sure there is a continuing supervisory role under the brownfield cleanup program and also under the land disposition agreement. You know that the city and the state will have oversight. Well. That sounds great. Thank you and once again really appreciate the proposal. It's fantastic! Thank you great. So we will come back for the people in raised hands to give questions. Now we're going to transition to Alex, moderating some written questions that we've received hi good evening everybody a lot of these questions we received either via email or scanning the chat we combined a bunch, but I want to start with one first off, which is a more of a technical question. There was a question about whether the presentation will be recorded and shared out afterwards, and will the Powerpoint be available after this, so I can take that one? Yes, it's being recorded as Mike from CB6 mentioned at the beginning. We are co-hosting this with cv6 through, as he said, a zoom conduit I. Imagine that Mike will send out a link with the record similar to October 22nd, a recording of this presentation, along with the presentation and any other aspects of the zoom I think last time he also shared the chat, so that'll be on I'm sure from the community board, and we can also make sure that the presentation is shared widely and up on our website as well, thanks Jonathan. So moving on to questions related to public place, designation and the RFP process, can somebody please explain the what is a public place designation mean? Why does it need to be designated and then can somebody from HPD explain the RFP process and what has changed in the RFP based on the new development proposal? Sure I can start off with the public place. I'm going to try to turn my video on and, of course, here comes my son who's, it's time for his bedtime, so he's saying good night. The public place is a definition, that's very quite old. It's actually one of the earliest. You know land use tools that the city has used back. You know I, think in the 17 1800s it actually is, has doesn't have a great definition and it's pretty flexible, you'll see public places in the street right of way. Sometimes they're used as streets, sometimes they're used for other means. The main aspect of public place is that there's flexibility in them, for you know the city to designate something for a public purpose, which is what was done in the 1970s. When this site was designated as public place, it was designated for a public purpose which included a number of things, including a recreational space for the neighborhood. The site has remained vacant for the for those decades, and we see ourselves here now where we're proposing a number of different uses along with streets in a public park in a public school housing is not allowed on public places. That's one of the things that is pretty bright lines, which is why we have to De-designate it. But that's also why, in the designation, we're also proposing the new public streets in the new public park, those will be mapped and in perpetuity on the site. So I think if HPD can talk through I think the RFP yeah sure thanks Jonathan, so this RFP was released in 2007. So this was during Bloomberg's era administration and even in 2007, the idea was to develop the site for mixed-use residential development and so through a competitive process. Most of our ps is we put out the request for proposal out with the parameter of what we're looking for so usually is. What is the affordability that the developer is proposing? What is the developer's capacity to build such a project, their experience in building, if they're able to do it if they're able to manage the sites and designs of the building? So these are generally things that we look for and evaluate across proposals when we put an RFP out and in 2008 we designated the team that has presented today that consisted that consists of Hudson companies, Fifth Avenue Committee Jonathan rose companies and bluestone company. So this is the team that we've been working with and the development has changed. I think in the presentation, I kind of highlighted some of those major changes, because the Gowanus canal was designated as a super fun site, and we know there was a need for cleanup and a plan for these cleanups. You know we continue to work with the team on it and on this site in this project, so that what we have today reflects on the greater need we have for housing and and working with city planning in the last few years is also how do we connect the site to the rest of the neighborhood? So the earlier proposal you know, did not quite have the same street infrastructure and corridors that we're looking at now. Another major change I think I saw in the chat too, is about the public open space. That's being mapped as part of this, so I think that's another advantage of being part of this larger Gowanus rezoning. You know we are mapping this 1.5 acre of this public place property city land. As a public park. It's going to be managed by park. It would be on the city map as a public park. You couldn't build on it after it is mapped. So that is that's another major change and one more is the allocation of space. Knowing that you know, Gowanus is being rezoned and if there's more housing and residents coming to this neighborhood, we are going to need more school seats. You know we're not just attracting single folks, but families as well, and so so as part of the plan. We want to make sure because land is scarce and especially in a high opportunity area like Gowanus. We want to ensure that there is space for a school once that need. You know, ticks then, so those are the major changes from the original. You know the 2008 proposal that was selected all right. Thank you Lin and thanks Jonathan, all right, I'm going to do one more set of written questions and then we'll go back to the attendees that have their hands up. Okay, so a couple more remediation and cleanup, primarily, what is the status of the Cso tanks today and what is the city's role in the cleanup of public place versus the developer's responsibility? I think the second one is probably best handled by mark just given. He has this web of how these things work in his mind, mapped out better than I. Do I think the status of the cso tanks is not a question that I can answer. I. Think we've been seeing the articles in the news and the articles that have come out. It's still something that we are committed to as a city, I think when we have DEP here in two weeks. I'm sure somebody can ask the question then, and we can have our colleagues answer, that particular question. So this is mark the city's role in the cleanup to date. The city has not been the regulator of this cleanup. That's been the state of course, and they have made all decisions about the remedy that they've selected and in national grid is implementing. However, when the rezoning occurs there there's part of that, there is, as you I'm sure know, there is environmental review which will lead to environmental requirements being placed on this property on public place and depending upon the conveyance, that is, the conveyance of the land. Those environmental requirements may be overseen by DEP. However, it's also at some point the case that, when the property does get to the hands of the developer, there will be an e-designation placed on the property, in which case our office will determine when the conditions on the site and the developers plans for them have been adequately studied, shown to be safe and protective of public health, and until we in because this work is going to be overseen by the state as well. Until we and DEC state DC agree that public health is being protected, there will be no building permits available to Gowanus green, so the city plays a critical role after the rezoning when the property is actually moves forward in pre-development. So that that's the city's future role great, thank you so I think we'll pivot back to the raised hands for speaker, questions. Okay, so Glenn Kelly is next. I am unmuting. You I have many concerns about the Gowanus rezoning I believe that there is much room for improvement, but I will focus my question on this project and its affordable housing. I'm concerned about the description of permanently affordable housing and I'll present the scenario, and you can respond to it if I apply for affordable housing and am deemed worthy, my income is checked. I am awarded an opportunity. I occupy the apartment. Will my income be checked next year and the year after and there, by determined that I am still eligible for the subsidy which we will be providing to these occupants? I want to be sure that the subsidies are provided to people who need them in the future Lynn. Would you like me to answer that, or was that clear enough, yeah sure go ahead? Is that Aaron or yeah? Thank you for your question, sir. While you're income will be checked in the form of probably in a lease renewal, your what basically it's your year, one income. So it's the year one when you, if you qualify into that apartment you're in and you can't have that apartment taken away from you. If you all of a sudden, make a lot of money, win the lottery or something like that apartment is yours, and it's essentially set at the rent, slash income level in which you qualified. So yes, there will be subsequent checks, which is required by the city and state and depending on funding streams, which we don't even know yet maybe federal but definitely city and state annually, but it won't have any effect on your ability to possess the apartment and occupy it. I hope that answers your question. If it didn't tell me so this is an area where there is room for improvement. If our intention is to provide subsidies to the people who need them, we should continue to monitor income so that the subsidies are provided to the people who need them in the future, and we don't grant a permanent subsidy to someone who may not need it. That is a waste of our money and it makes that particular apartment not permanently affordable. It is lost, I, kindly disagree, I having developed and managed several thousand affordable apartments in New York City. The vast majority of people who qualify for these units have a steady, moderate, see a steady or moderate gain to their incomes at best and those units are you know those units remain affordable to them when, because their income actually does not grow, sometimes as fast as rent does, which I think we've all seen has occurred in the last 20 years, both in the city and nationally but I. That is a larger policy question that sounds like maybe HPD should answer I'll kick it over I'd, be happy to hop in for a second and I, understand the point and I think it's a fair point and a difficult balance, but I think for a project like this, where we're really hoping to create new opportunities that don't exist now for households to move to a community like Gowanus, and for that reason it's also and the part of that opportunity is being able to move and bring your kids and put your kids in school, and it's really important that folks be able to stay and grow in this community. And so you know, given the the extreme difficulty in finding housing in our city, we feel it's really important for folks to be able to move into housing and stay and have a stable home, and that stability is a really huge piece of the benefit to society at large that is provided by affordable housing. And so you know really the situation of having someone get a raise and have that mean that they are evicted from their home is not a situation that we're hoping for through the creation of affordable housing. We want people to be able to grow in their families to pursue career opportunities and not worry about having to lose their home as a result, thanks before Amy calls on the next person, I'll say if you're wondering, if you will be able to speak, feel free to raise your hand. You know we actually have six seven folks at the moment and you know happy if more people want to raise their hands and ask questions. So, if you're, what if you're worried that there's too many people, you know, go ahead and we'll try to get to you all right. So the next speaker is Spencer Heckwolf, I'm unmuting you now hi I know you guys often get questions of. Can we do a racial impact study on the site? I think we need to also flip that and say we need to do a racial impact study of not rezoning or not observing, especially in wealthy high opportunity areas like Gowanus, so I think whenever that's proposed, there needs to be no hypothesis null hypothesis kind of thing. So if you can just expand on the consequences of not rezoning, wealthy neighborhoods that'd be great HPD yeah, there's not a ton that I can say here. I would point to the recently released where we live NYC plan, which is the city's comprehensive, fair housing analysis, which includes significant analysis of the roots of our affordability crisis and their links with residential racial segregation. And you know, one of the findings of that plan is that in certain areas the lack of new housing has contributed to the inaccessibility of those communities to people of color and people of low incomes, and so we have done that analysis. This is part of a federal mandate to affirm relief, further fair housing, which means to kind of proactively take steps to reduce residential segregation and the negative impacts of segregation. So I encourage people to look at that report, which is I would say the closest thing to the analysis that Spencer asked for in his question and as to you know, potential policy changes to the way projects are analyzed in the future. It's an interesting area of policy, but not one that I have much more to say on tonight. Thank you, okay. So next person is Elise shook I'm unmuting you now hi Amy. Can you hear me yep hi? My name is Elise Rebecca, I'm a member of voices as well I just want to. It seems very clear that you all have spent a lot of time preparing this presentation. So thank you for this. My question is: I was at the event earlier this week with the dredging of the canal. Why does the city want to create more housing on toxic land at this time, yeah I know we have mark here. I think I can also maybe take a stab and mark and correct me or add to it if needed. I think you know a really important part of the overall plan and not just for Gowanus green has been the need to catalyze development to remediate land. You know the community has been advocating for a cleanup of the neighborhood for decades and the advocacy has resulted in the Superfund designation that just started dredging, but the upland sites are also part of that contamination and without spurring development there will be no remediation of those upland sites. People do not remediate land without some value that will be created from that development, and so the development is really pretty key to actually cleaning up the land here and the rezoning will cause, as we've noted elsewhere, e-designations to be placed on development sites that will have city jurisdiction and oversight. Excuse me of those for making sure that the remediation is done in a protective way for future residents and workers, and so it really actually goes hand in hand. If you want a cleaned up canal in a cleaned up neighborhood, you need to have the development to really catalyze that remediation sure mark. Would you add anything there? I would just add that you know the purpose of any remedy is to make land suitable and protective for its future use. Here, of course, it's residential and this land will be suitable for that purpose. We talked earlier about the coal tar at the site that is deep down, and so the surface of the land and the land. Let's say the soil is five feet under these buildings, that is land. That is perfectly, it will be perfectly suited to a safe residential development and so that the contamination that remains at the site is very deep and will not interfere with the public's use of this site. Great I think we'll switch back to Alex, so I'm going to cluster these questions together. These are all about the the building and the site program itself. So all condensed into here. So the first set is about the the question about the potential school and how is that related to the development? Can the school be separate? Can the school be built on its own without the development? It says it's a potential school at what point in time? Would that school be built? Actually I? Think Jonathan's frozen right now, but is the best person for answering this and Lynn had to step away for a second I'm I am back. Can someone fill me in on the question again? Sorry about that? Oh sure thing. So it's a question about the school: can the school be built separately from the development? It says it's a potential school sure. So does that mean it's part of the development and what's the commitment, yeah sure I think that it's a good question? Can the school be built apart from the development I think is the first one I would tackle I think we are planning for the school with development not just of this one, but also the rest of the neighborhood in mind, and so I think you know this goes back to some of our. You know a couple a year ago, or so, when we've had a lot of back and forth with the community board and others about how you do school planning and whether you build schools now and wait for children to show up for those seats or do you know monitor for the situation to arise when the school is needed and it's a delicate balance of monitoring, projecting demographic changes, building permits and also making sure that there's funding in place for a future school right now, a lot of these questions are unknown. What we do know is, we are planning, for you know a new population to come here, a significant amount of new homes here, and so we know that schools are going to be. You know a bedrock of what the needs are for new infrastructure, and so what you're seeing on Gowanus green is, you know really forward thinking and understanding that this will be needed and making sure there is space for the city to build a public school when that space is needed thanks Jonathan so related again to the building program. Can someone speak to the potential neighborhood services that will be in built into the to the site, whether that's retail, you know community facilities and stuff, like that sure, so, on the retail we are proposing eight thousand roughly square feet of retail along Smith. You know, given you know how far we have how we are, we don't have specific tenants to announce today. I mean we would also like the opportunity to hear more from the community about what they think is needed on the other types of spaces, we're currently proposing around 20,000 square feet of community facility space commercial space. The zoning actually provides some flexibility for us to use either community facility or commercial space. You know, regardless of what it is we do intend for it to be community serving types of spaces. You know our partner, Fifth, Avenue Committee is very plugged in to where the gaps are I don't know Jay. Would you have anything you'd care to add to that question? No I think that does sum it up again on the interior on the Queer street, we're looking for more local, serving retail as well as community facilities. We're outreaching to health clinics because we unders. We think that probably we need in the community and also, as you know, we want to be in touch with any needs for the arts community, so you know we'll be out there in the community seeking for both the community facility space and what local serving retail people feel is most appropriate. Thank you. So a question about site resiliency both from rain and storm events, but also flooding. Can you describe how the buildings and the site will be protected against like a hurricane, Sandy style flooding and the types of rain gardens and permeable surfaces, wastewater flow reduction? I know you've talked about that in detail, but just a synopsis of what the site's going to do sure. So on resiliency, you know our main approach is just to raise the buildings so that they're out of the future flood, not only what we think is a sandy type event today, but in 80 years from now, with anticipating sea level rise, so I think that's the main approach. We're also going to be exploring other resiliency measures. We can do as we get further into the design to help the community through events that occur so more to come on that regarding the rain gardens. You know we have two considerably sized rain gardens that will help benefit our stormwater approach and will also be so that they serve a purpose of both helping to retain and filter storm water, but also to provide social spaces for recreation and other types of activities. Was there another component to that question that I'm no I think that's it thanks great okay, I'm going to do one more set of the site planning and program and then we'll switch back to the hands up. Can someone explain how the parks and open space is going to be designed? Is the park going to be maintained by the parks department? Is it going to be by the development team and how is that going to work? Sure I think I can take that one I think the maintenance piece is something that I think is wrapped up with a lot of the funding questions around the park, which we're still looking into as a agency and development team, broader team, and we know that people want answers on and you know I wish. We had all the answers for you tonight, but we're going to have to wait until those are clearer down the road in terms of design I mentioned during our presentation. It is a public park, it's it'll be mapped park, it'll, be in the jurisdiction of the Parks department. They have a very rigorous design and community engagement process which will occur. You know in the future after the approvals are given, you know, and later hopefully in 2021, so they will. You know and I think many of you have also probably been a part of that process recently with Carroll Park and others that they've done nearby, and so you know, I think a similar type of to give you an idea of what that would look like would occur here. Okay, so we're going to move back to the raised hands. The next person is Marlene Panton I've. Only okay, I had put the question as well in the chat, but my questions were basically were talking about resiliency and climate change, and so I was asking New York City. Had the council had passed some legislation around bird, safe buildings and so noticing in the design that we're going to have all these apartment buildings with glass, and so are those going to be bird friendly buildings and are all of the plants and trees going to be native plants that are native to this area, because they also can provide support in terms of stormwater, runoff and so forth and I just want to reiterate those are my two questions, but also to reiterate that it's extremely important that we provide significant funding for maintenance of the parks, because the park's budget is below one percent of the city budget and therefore any plans we have around the parks. We should be having continuous maintenance funding for caring for the parks. Thanks. Thank you Marlene. Can you clarify those are great questions, and can you clarify, if you mean about native plantings, bird friendly design is that is your question focused on go on a screen in the development team here or on the broader development across the canal? Or is it now both since I've asked you that question yeah, it's pretty much anything that's going up and go on is green. I am hoping that we're also thinking we're talking about climate change effects, we're talking about resiliency that, hopefully we're also thinking about the glass we use, because these are a lot of buildings that are going to be going up lots of glass and therefore we would appreciate that you consider using bird-friendly glass if possible. I know New York City last year at the end of the year, passed that legislation around bird friendly buildings in the city, and so that is something that I'm hoping is being considered as we talk about climate change and resiliency and then in terms of native plants looking at the trees and so on, that's going to be put there I think we need to consider that even the trees themselves need to be native, because then they can do a better job in terms of erosion, stormwater, runoff and so forth, and so thinking about that, even as we're planning the landscape as well and Marlene. On your question about native planting, we wholeheartedly agree with you and, as does our landscape architect, and so we certainly believe in using native plant species in our designs and also recognize that they do have some benefits it. You know to storm water and so we're absolutely with you there and bird friendly buildings as well. What is there has there been any discussions about that? Not at this point it's a good question. We could follow up with you. You know at this phase of design. We haven't gotten into that. Well, you know really talking about what the facades would be. We would certainly you know, build to any applicable codes that are are required. Okay, all right. So the next person is Joe Corona. You are unmuted hi. Can you guys hear me? Yes, thanks so much Joe Corona, I'm a freelance reporter. My first question is both Mr Lick, Tiger and Mcintyre said that the oil is deep down, but the DC mentions in their website that the pollution also contains volatile chemicals that can vaporize and migrate up through soil into the air into the buildings where people would inhale it. Why hasn't this been mentioned as a health hazard in the case of public place, or is it a health hazard in the case of public place, who will be held liable if people start to become sick, if a situation of cancer clusters arises, for example, are there going to be limitations to the activities that take place on the site, both in the buildings and in green spaces? I'm imagining you know like? Can people take, have picnics plant, stuff, etc? And finally, the distribution of the AMI percentages were clarified for public place, but where are they going to be for the rest of the affordable housing units that council member is contemplating will take place in the entire rezoning thanks I could handle the question about the volatile chemicals and possibly coming up into the buildings. Would that be helpful? Yeah? Please do yes, that that question hasn't been carefully looked at to date. We have no buildings, yet it's going to be a while before we know what their design is know how they sit on the land, and when that concrete proposals are made along those lines, there will be a very careful study done of soil conditions and see what soil vapor levels there are in the shallow soil beneath those buildings, and if there are any, you know somewhat elevated levels of volatiles in the soil, those buildings will have a vapor control system. Typically, that's a sub slab depressurization system that collects vapors and shoots them through the structure and vents them to the open air way above the soil, and that's a standard approach in buildings all across the city. These days- and it will be followed here so that whatever vapor issue there is in shallow soil, it will not affect people in the buildings and it will not endanger people who are enjoying the open space around these buildings. There won't be for health reasons, any restrictions on activities on this property, and you know I'll just add to that. We expect that as part of the remediation there's going to be further, you know soil classifications and, to the extent you know anywhere we're going to be digging that there that you know that fine, that kind of situation we will you know above permitted limits- will be required to dig it out to a safe point, great thanks, okay, so the next person is 01 foot, you're unmuted! Now Owen, are you still there? Can you hear me now yep great, I'm sorry so I, I'm mostly concerned about the disposition of the public property. The program, as you know, has dramatically changed since 2007-2008 when it was issued for RFP. Now that we have a school as well as a substantial change to the program, will the city be in a new RFP so that developers who specialize in 100, affordable housing would have an opportunity to apply? As you know, I would presume in 2007 2008 those developers declined to apply because the RFP did not restrict the development to 100 and affordable housing. It also didn't include the public school part of the program, so I am wondering how I guess it's HPD would be issuing a new RFP to ensure competitive development or response to this program. Thank you sure. I could jump in and try to answer that I think. As I explained earlier with our RFP process, we look at. We don't just look at the proposed project. We look at a range of things, including developer capacity and experience the ability to do the project, and this is a great team. This team, in involves developers that have done 100, affordable projects on city-owned land and some of them. You know also pretty complicated as well. Just like one at this, the site is. It includes a non-profit local developer, Fifth Avenue Committee. That knows the area and knows the community-based needs of that area. So the reason that the 2008 proposal never moved forward was no fault of this developer and the fact that you know we are able the city is able to still push for the 100 affordable. At this point you know it's something we were able to negotiate, and so we did not. So we are keeping with the developer and the you know the designers that they have on their team and to work through this, because they have been working very actively with the city to try to improve this project and also to keep it. You know up to date to the needs that we're asking them to include in the school. The developer is not designing the school that you know that would be on the city, so we will be. You know at some point would have to involve the school construction authority on that and then the design the parks also would involve a public process as well. So so there will be other touch points where the community come in and provide input, but we do not see a need to to put out a new RFP when we have a very good team and who is able to deliver a project that you know. We would like to see here great so I just want to also do a time check. It's 8:14 through the people who have their hands up right now and make sure I think we can probably keep going to 8:30, maybe a little bit after that. I'll also note the questions that we've received in questions, that, if you want to email us, we can tonight make sure that we post questions we haven't gotten to. It were all questions that we we've gotten on our website, so people can see what the questions are, that their community members and others have sent in. So with that Amy, do you want to keep going along sure yeah? So the next person is Timothy Burke you're unmuted now I can hear me. Yep great housing prices have a direct correlation with homelessness. Those experiencing homelessness have a much worse health outcomes than the rest of the population, housing, unstable and rent-burdened individuals and their entire families deal with immense stress that has been conclusively shown to negatively affect their health. The pandemic really shows that now is the time to build more homes for people. My question is: if anyone is still hesitant about this project, if they've considered the public health aspect of creating affordable housing thanks Tim Timothy, it seemed like a question for people other than the panelists I. Think in the interest of time. Thank you for your question and comment and we can go on to Matthew. I think he's next Amy sure, okay, so the next person is Matthew, Muller, you're unmuted, now hi. Thank you for having me I. Think you covered most of my questions already. The one thing I didn't really see covered yet is I saw there was a mention of affordable home ownership. I was just wondering if you could talk a little bit more about what that type of program looks like. Is it going to be permanently affordable? Where there's some restriction on sales and just what the plan is for that Aaron, would you want to talk it we? So we do have. Currently we do have a affordable home ownership term sheet, and so it is. There is a an affordability term, I believe it is for 20 years and where, within those 20 years you couldn't flip an apartment, you know to what market rate would get you I think every year it goes up, maybe two percent or five percent of the sale value and it's you know it's they're, usually larger units, because we realize when people want to buy it's for couples or folks who want to start a family and stay in that apartment, so they're, usually larger. You know two and three bedroom units and they're. Also, sorry, I'm sorry I lost my train of thought. It's getting very late, I'm sorry, you want to jump in Aaron or I was just reminding. You said. The last thing you said was two and three bedroom unit. Just two and three bedroom units are slightly larger and the idea you know is that so people can grow their family and stay there in perpetuity, but then also there are regulations to limit the opportunity and restrict them from you know, making a profit, and you know that would be a terrible. You know use of city subsidies, okay, all right, so the next person is Maria, Hadamar, Hodder Marska, I'm sorry. If I'm butchering your last name, you've been unmuted. Thank you I'm here with my husband pen, and this is our question. We know it's a big deal to re-zone and we know that's why there are very specific provisions in the city charter of how that has to be done and what the community participation is. It appears in povertime that can't be followed. The terms of the charter can not be followed, and yet people are proposing to do it anyway in this Covid-19 time, when everybody's under pressure. This feels like an attempt to create a runaway train that, during the cove time, without proper reflection, without an understanding of what the landscape of the city will be in terms of housing, availability and whatnot, so there's wisdom in the way the charter set up with the eulips, which require very substantial participation under very specific circumstances, basically you're proposing to do it without an actual ulit. There's talk of a fake eulip, a a so-called virtual eulip, but the charter doesn't provide that it provides people coming together in a building with everybody getting to speak, that is Peop human beings in front of other human beings with facial expression, body language, that's what the charter requires. How can this go forward without following the charter? Thank you for your question there. At the end, I mean I. Just frankly, we are following the charter. I would also point to the fact that you know across the entire globe. People are coming together online to continue the important work that both governments and the broader society need to keep moving forward. I. Think, as we have seen you know, a lot of other city agencies are holding their important meetings online, but we're also seeing other jurisdictions all the way up from the states to federal you know, entities including the Supreme Court, have moved their hearings online as well and I. You know mentioned last time. You know on October 22nd, when we got very good feedback and questions from people on you know our engagement and doing things over zoom that we're very open to people giving us. You know, suggestions and helping us that tonight was our next attempt at making it better and on December, 2nd, I'm sure we'll have the q and a features set up and continue to evolve and make it. You know as inclusive and engaging as we can so definitely hear the feeling behind that, and you know we look forward to keep getting better so great okay, so the next person is William. Thomas you've been unmuted. Can you guys hear me? Yes, okay, beautiful hi everyone, my name is: will Thomas I'm here to support Gowanus green as a member of open, New York we're an independent all volunteer pro housing organization. This is more of a comment than a question, but I just want to establish that 900. Oh the 950 homes that this rezoning would allow are desperately needed and I want to say, I. Think many of the arguments being made against it are either very myopic or have been made an incredibly bad faith. I want to establish that this housing is absolutely necessary. So let's go through some numbers to remind everyone how bad it is. Since 2010 median rents have increased by more than double median wages. Homelessness has reached the highest level since the great depression and one in seven elementary school students live in a shelter. So in this environment we need every bit of affordable housing we can muster and the 950 homes that this rezoning offers is a great place to start. Second, these affordable homes are particularly needed in white, wealthy Gowanus, where the median household income is well over six figures. If New York does have any chance of meeting its fair housing goals, we can't allow the current residents of Carroll, Gardens and Gowanus to block below market housing, especially for purely aesthetic reasons like scale or building heights. Prioritizing a nebulous sense of neighborhood character over housing for human beings is extremely selfish. At third I want to emphasize that much. The opposition that we've heard tonight is being clearly made in bad paid. We're hearing from armchair environmentalists that claim that the ground on the site can not be remediated, but I find it hard to believe that as their true grounds for opposition, when they similarly oppose the rest of the Gowanus rezoning, which does not need the same treatment, you get the same amount of affordable housing through MIH, allowing greater debt elsewhere extremely telling that no one who opposes this project is advocating for that. So please I urge everyone to support this project. Thank you. Okay. Thank you for your comment, great okay. So the next person is cell francino, you've been unmuted hi. Can you hear me yep? Sorry I? My name is Benton Heimseth, actually, I think I have the wrong. Oh, I'm so sorry! Well, it's fine hi! So my name is Benton Heimsath, I'm a resident of this area. I've lived right off of Fourth Avenue and I've been following this rezoning process for several years now and I'm delighted it's moving forward. I'm a strong supporter and in particular, I'm thrilled to see the Gowanus green project going to 100, affordable, I, think it's I love this neighborhood and I. Think it's fantastic for the there to be more low-income residents who are going to be able to live here, enjoy the area and enjoy the trans rich accessibility to other job sites. So my question actually is about the the Gowanus green project. I noticed there was supportive housing element. I wanted, because homelessness is also such a big issue in the city. I was wondering if the development team could speak a little bit about the the services that will be provided for the formerly homeless residents. There will be on-site services, including 24-hour services, for the it's going to be the 73 unit. Building that'll be supported. Housing I also have a lot of community space for the residents as well. Learning space exercise space, but yes, there will be 24-hour supportive services on-site, including active case management plans, to hopefully get people to build up productive lives. Great. Thank you. So the next person is Megan. Blissick you've been unmuted hi, so the main concern that I hold and that most of the other residents of this area seem to hold other than the developers with clearly vested interest is the building of housing on land. That's considered to have some of the highest contamination levels of any water system within the United States and I know that there have been mentions that you know we'll have testing on site like it will be what like done like once a year, but we've also seen the city's complete lack of regard to maintain livable standards and other affordable housing such as you know, NYCHA housing, where residents in Bedstein Queens have been without cooking gas, some for the duration of in pandemic, since March some for shorter. But ultimately, we've seen this city not take care of anyone in low income housing. So wanting to reiterate questions that haven't been answered earlier, who will be held liable to both maintain the worthy, the warranty of habitability if people do and when people do start to become sick and who will like who will be held accountable to make sure that we're actually protecting the residents that we're trying to put in housing on toxic land? Thanks for your question mark, are you still with us I think some of this we've already kind of yeah they just the land? The question was about. You know the statement that this land has the highest contamination levels, that's not the case and that this land will be suitable for residential construction, and thus it can not have high contamination levels. It has very low contamination levels at the surface of this site, so it it's not a risky health threatening proposition to construct housing on this site at the end of the remediation yeah and mark, maybe also because it seems people are asking for like what happens after it's done. Is there some are there parties that are I? Guess people are wondering if they're liable for things to happen, I mean what comes to my mind. Also, that I think is, probably you know, I think better than you know the rest of the city when it comes to contamination and making sure that people are continuing to look at. This is the fact that we do have requirements like e-designations that have reports that are being investigated, that have the science behind it and that will also have a long-term monitoring plan and that e-designation stays on the site forever. I think what you know a lot of folks, don't understand is they may be living in brownstones and there's also stuff all over the city. I think you know, there's more oversight in a place like Gowanus moving forward than just the general folks that you know we have in the city, so I think you know in terms of that, I think I just wanted to put a little bit of additional color on it, because I think people have continued to ask. You know what happens in the future and I think there's going to be regulatory systems in place on these sites and I think people should feel sure that that's going to be protective. In addition, it's going to be privately owned sites, it's not a 100 percent low income, it's 100, affordable, it's mixed income properties and each of the developers on this team. You know have a stock of buildings that they own and manage that they have owned and managed for a long time. Bluestone Organization is a third generation family, real estate business and we've never sold any of the buildings that we've built in the city or outside the city. We I think we all take the position that you know when we build in a neighborhood. We become part of the neighborhood and we value our reputations and we're not going to allow this property to be run down because that's counter to our interests and it's not what we've always done. Thank you. So it is 8:30. I know some people have raised their hands as the night has gone on. We have time for one more question: if you want to email or send in your questions to the chat, we can also make sure to post those, and we can get to your questions at a future date and meeting because we'll be seeing a lot of each other in the coming weeks and months. So I think the next person Amy would be the last okay. So the next person is Baron bonnet. I've been I've unmuted, you very good. All these discussions with that was transpired. Tonight, there's no discussion of other infrastructure. Besides all the tanks and the new sewers that are going to be required, you know by the federal government and the city has been dragging their feet about the costs and everything, especially because now because of the pandemic, but also other infrastructure like the F train before the pandemic, you could not get on the F train in the morning because of all the development that has happened so far so there and the subways they take hundreds of years to design and develop. The city has no money for that, plus what about police and fire? Okay, because previous administrations have closed fire houses in this area and there's no, so this is very poor planning, so I just don't see how you're going to pull this off with a comprehensive plan with everything you put more people, you have to require every kind of service, not parks and all the pretty things you put up beautiful trees, and then you put up glass that you know the birds won't slam into. You have to do some bread and butter and I, don't think that's been discussed tonight, so who's going to address all the transportation issues. Thank you for that comment and I appreciate it. I appreciate it very much since it's been something we've talked about and worked on for the past five years during the planning process. If I want to just make sure we're all aware we talked about tonight, go on a screen, a specific centerpiece component of the overall Gowanus neighborhood plan. There is much more than just this if you can believe it, because this is, you know enormous. It's in terms of the amount of housing it's going to provide in the infrastructure it's going to provide in terms of streets and schools and sewers and in a park, and normally that's you know a big project in and of itself, but here we're also talking about the Gowanus neighborhood plan, and this is a part of it in the broader plan that we're going to be coming back. You know on December, 2nd we're going to be talking about infrastructure, particularly about sewers, but also transit and schools, and will it'll be a topic that we continue to talk through, including what our environmental impact statement will show are places where there are impacts to infrastructure and services that will need to be. You know, talked about during the public review process, and so it's very much on the front of our planning. You know, in terms of when we do comprehensive plans and so we're looking forward to sharing more with you about that and so I hope what you're seeing tonight you know after I've, just you know answered your statement is that this is actually not the you know the entirety of the Gowanus plan. This is a part of the broader, comprehensive planning that we're doing here. So please come to future meetings to learn more and ask more questions about infrastructure, because they're great and so with that I would just say thanks to everybody, for a very lovely and lively discussion and important questions and feedback in the chat. You know we really were hoping to use the Q&A feature. We really appreciate the civil discussion that went on tonight and also for all of you who raised your hand and spoke I know there are people that raise their hand, who weren't able to speak tonight and we'll get to you another night, and if you have questions that you would like us to post, you can also email us on that. So, as a reminder, December 2nd, we are going to be back here. Virtually with our colleagues from DEP and we'll be talking about Csos, transit and in schools. So with that, I'd also thank our panelists for being here and giving us your expertise and talking about the project that you all have been working on for the past decade, plus and I. Think with that we'll sign off and say good night. Thank you all. You.",
            "summary": "And, since we want to get to people's questions and get to the presentation, I will introduce you all quickly, so I think Mark unmuted himself from office of environmental remediation from HPD Lin introduced herself.\nAllow people to raise their hand in a first come first serve manner and they can ask their questions on Mike, and so you know as a reminder that we have now 220 folks that have joined us tonight.\nThank you to community board six for hosting and to both department of City planning and the Gowanus green team.\nStorm water participate in making sure csos don't flow into the canal and prepare for sea level rise that there be a public school on the site to meet the needs of a growing community and one that's working so hard to achieve school integration.\nThe plan that we saw over the years was 75, affordable and 25 market rate and many people in the community who care deeply about affordable housing, said on the one significant publicly owned site in the neighborhood.\nAnd, it was announced earlier, a hundred percent affordable with 50 of those units for low income and very low income families making under 50 of the area median we'll look at later on what that means, with supportive housing for seniors and formerly homeless, families with affordable, homeownership opportunities for working-class families as well and with a site design that I think is really promising for the future of our community in all kinds of ways.\nBoth those who have shown up saying I really want to see affordable housing on the site and folks who show up in the community in the chat and say I, don't want any development at all.\nThey were very encouraged by the affordability numbers that seemed you know, because we just like I, think anyone who's involved in the affordable housing discussion in the city, the affordable, for whom question is always very important, and you know what was put out today is encouraging, but you know being encouraged and approving are not necessarily the same.\nThe proposed, affordable housing plan and some timing and next steps and first up from the agency team, is Mark.\nThe state DEC will also use the site management plan to direct any further remediation of shallow soil at public place.\nGowanus green will study soil conditions at public place to satisfy the city environmental requirements.\nThe study shows further remediation is necessary, such as installation of a vapor control system beneath the buildings, Gowanus green will have to complete this work to the satisfaction of the state and city before it can build and occupy a building's own public place.\nWhile those plants of the cleanup plans for the site and the canal were happening, and you know, continue to be put in place, the city has been actively working with this designated development.\nThe project today has evolved and we believe it reflects the growing needs of affordable housing in this city and I.\nIt will continue to be a problem for the city and especially in a neighborhood like Gowanus, where it's near transit, it's near schools, and it offers so many rich community.\nWe believe this site represents a tremendous potential to create affordable homes for individuals and families who couldn't afford to live in this neighborhood, otherwise, so I also want to just quickly I feel, like the council member did such a great job.\nThe, total number of units has also increased and that increase reflects the growing need for housing in the city and now that it is a hundred percent affordable.\nIt may seem like I'm just talking about housing, but the proposal that the development team will run through tonight includes additional community amenities and infrastructure on the site that complement the housing.\nOh, my screen, sorry shared streets that are thoughtfully designed to connect planned green spaces at the site.\nYou know these six goals that we have creating a sustainable, resilient, environmentally healthy community, supporting cleanup and remediation, creating and preserving, affordable housing for all people, but especially those who are at the lowest income brackets building network of parks and open spaces in the Gowanus, creating an inclusive neighborhood that is integrated and accessible for all and to support community and economic development for a thriving neighborhood.\nThis is often the question we get when we go to any community in the city with the affordable housing projects affordable, for whom, so that is, it is relative.\nHouseholds and HPD programs are finance programs which the Gowanus green project will use aimed to provide housing for individuals and families at varying ranges.\nAnd I want to recognize Uriah Naren at HPD for putting this together, because I think it really it's very effective in showing how the city's, affordable housing programs compares to market rates housing in the area.\nIt shows the example: households we're looking at so in the column on the left, where they're you know, studio, apartments, someone who is a single person making about a little bit over or just under 24,000, that's.\nThese are what rents are looking like today for a studio under 2000 for one bedroom a little bit over two thousand, and you know a three bedroom would be three thousand, so even Anadoly we are hearing the rents and housing prices are coming down, but certainly in this neighborhood and surrounding neighborhoods, it's not coming down enough to serve the people.\nSo, and it's you know, families who are making 60 and 70,000 dollars a year would not be able to really afford an apartment in this neighborhood.\nIn addition to the allocation space for a new public school and new infrastructure, this project, Gowanus grain will be 100, affordable.\nWe are also looking to include buildings that would be dedicated to low-income seniors, as well as supportive housing with supportive, services, on-site and affordable home ownership, as well.\nI'm, going to run through, hopefully very quick, some slides about you, know our plan components and the zoning proposal, since it is pretty important to how the development project will be.\nWe have been looking at an 80 block area for appropriate changes to zoning and land use, and we've studied particularly and propose specific zoning along the canal that responds to its unique conditions to foster a vibrant, accessible resilient and active waterfront with a mix of uses, new housing, permanently, affordable housing and commercial artists and maker space, and a centerpiece of the vision that we have, and that was created over the years of process and engagement with the community, is the waterfront access plan that will provide a public open space along the canal and a key part of that waterfront access plan is Gowanus.\nThis is necessary because public places do not allow housing to be built and at the same time we are proposing new public streets to reconnect the community to the waterfront and also a new public park.\nAt this, from a bird's eye, view, Gowanus green sits adjacent to the Covid-19 elevated line that cuts the site off from the adjacent Carroll Gardens neighborhood, there's also a sewer easement that bifurcates the private site to the south and crosses the future public park.\nThe plan and the zoning will help facilitate space for our future new public school on the site between the park and new streets and the space for the school.\nFour developers have been deeply committed to building affordable housing in this community for a very long time.\nWe are very excited to be presenting some updates to our plan, which we first embarked on before my time of 12 years ago or more and we're excited at this moment, and the updates will take you through quickly will show that our project is building more affordable housing at deeper levels of affordability, more publicly accessible, open space, providing a site for a future public school and building a more resilient and sustainable project than what we proposed back in you, know, 2007.\nUpdates, we'll talk a bit about the open, spaces, we're going to get into resiliency and sustainability, particularly focusing on the approaches on stormwater and wastewater, and then I'll turn it over to my colleague, Aaron Kaufman at Hudson companies to take you through our affordable housing plan.\nYou know the you know, from public input and thinking through the site with our really tremendous design team at Marvel Architects, we zeroed in on a strategy of putting height in the middle of the site, so that is keeping heights along Smith, Street and fifth low.\nThose are residential, ground floor units that act that help activate the street and build a sense of community, and then lastly, you'll see the site for the potential school here next slide.\nYou know we strive to create a poorest site that connects to the existing street grid and invites residents to come through our site through publicly accessible, open space and visit this beautiful amazing park and shore public walkway.\nYou, know defined by our shared street, running through the site from Smith to Hoyt, and then rain gardens kind of dividing the site about at the roughly at the midpoint that are pedestrian-only passages and then a canal view plaza along the canal, which we'll talk a little bit more about next slide.\nSo there's not going to be a lot of through traffic in this area, so we think it's a really great opportunity to put pedestrians first here next slide.\nWe think this could be a really great place to have an active community area next slide and just quickly on resiliency.\nOur project, you know, New, York City, has done some additional study to study resiliency and we all know, with climate change and sea level, rise that we need to be anticipating of flood events to get higher and higher.\nYou know during a heavy rain event, our green roof will absorb water, we'll collect water and cisterns to use for our rain gardens, and our swale trail will be doing a lot of work to capture and filter water, but there's this hydrodynamic separator, which would be sub service installed on our site below ground.\nYou know we're looking to bring in you know on the Smith Street side of roughly 260 apartments again with a mix of incomes and permanently supportive housing, and then we will, you know, move to the taller buildings as we go down towards the water.\nI, think we were part designated because of our rather progressive stance on bringing affordable housing to the Gowanus.\nMy second question: is: does the development team also pay for and build the school and the park, or is that something the city would pay for and build.\nYou know we'll make sure that any place that we're going to be digging and, in addition, we'll be doing additional testing all around the site on in a testing.\nThat's been designed here and has been used many times in the city and across I believe across the country, but I know in this state and in the city it's been used on many sites, thanks.\nYou know what shallow contamination is left is going to be addressed by presumably by the development team, so that two feet of clean soil and two feet of clean soil is a standard remedial element in a residential cleanup across the state.\nI also know just looking at the presentation tonight that most all of the site is going to be built.\nIf I heard correctly, my question is just it sounds like there's an ongoing piece as well right that the city will continue to make sure that the site is appropriate for so many new homes and the city will continue to monitor the safety of the property.\nThe site has remained vacant for the for those decades, and we see ourselves here now where we're proposing a number of different uses along with streets in a public park in a public school housing is not allowed on public places.\nI. Think in the presentation, I kind of highlighted some of those major changes, because the Gowanus canal was designated as a super fun site, and we know there was a need for cleanup and a plan for these cleanups.\nWe continue to work with the team on it and on this site in this project, so that what we have today reflects on the greater need we have for housing and and working with city planning in the last few years.\nYou know we are mapping this 1.5 acre of this public place property city, land.\nKnowing that you know, Gowanus is being rezoned and if there's more housing and residents coming to this neighborhood, we are going to need more school.\nWhen the property does get to the hands of the developer, there will be an e-designation placed on the property, in which case our office will determine when the conditions on the site and the developers plans for them have been adequately studied, shown to be safe and protective of public health, and until we in because this work is going to be overseen by the state as well.\nThere will be no building permits available to Gowanus green, so the city plays a critical role after the rezoning when the property is actually moves forward in pre-development.\nThose units are you know those units remain affordable to them, when, because their income actually does not grow, sometimes as fast as rent does, which I think we've all seen has occurred in the last 20 years, both in the city and nationally, but I.\nI think you know a really important part of the overall plan, and not just for Gowanus green has been the need to catalyze development to remediate land.\nYou know the community has been advocating for a cleanup of the neighborhood for decades and the advocacy has resulted in the Superfund designation that just started dredging, but the upland sites are also part of that contamination and without spurring development there will be no remediation of those upland.\nPeople do not remediate land without some value that will be created from that development, and so the development is really pretty key to actually cleaning up the land here and the rezoning will cause, as we've noted elsewhere, e-designations, to be placed on development sites that will have city jurisdiction and oversight.\nYou know really forward thinking and understanding that this will be needed and making sure there is space for the city to build a public school when that space is needed.\nI know you've talked about that in detail, but just a synopsis of what the site's going to do.\nI think the maintenance piece is something that I think is wrapped up with a lot of the funding questions around the park, which we're still looking into as a agency and development team, broader team, and we know that people want answers.\nThe distribution of the AMI percentages were clarified for public place, but where are they going to be for the rest of the affordable housing units that council member is contemplating will take place in the entire rezoning thanks.\nWill the city be in a new RFP so that developers who specialize in 100, affordable housing would have an opportunity to apply.\nThis team, in involves developers that have done 100, affordable projects on city-owned land and some of them.\nThe reason that the 2008 proposal never moved forward was no fault of this developer and the fact that you know we are able the city is able to still push for the 100 affordable.\nWe are keeping with the developer and the you know the designers that they have on their team and to work through this, because they have been working very actively with the city to try to improve this project and also to keep it.\nThe developer is not designing the school that you know that would be on the city.\nSo there will be other touch points where the community come in and provide input, but we do not see a need to to put out a new RFP when we have a very good team and who is able to deliver a project that you know.\nIt's 8:14 through the people who have their hands up right now and make sure I think we can probably keep going to 8:30, maybe a little bit after that.\nMy question is: If anyone is still hesitant about this project, if they've considered the public health aspect of creating affordable housing thanks Tim Timothy, it seemed like a question for people other than the panelists I.\nI'm thrilled to see the Gowanus green project going to 100, affordable, I, think it's."
        }
    }
}