{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CB 3 Manhattan - Arts \\u0026 Cultural Affairs Subcommittee",
            "publishDate": "2020-08-13",
            "shortDescription": "Agenda\\n1.    Approval of previous month's minutes\\n2.    District Needs Statement\\n3.    Vote to adjourn",
            "lengthSeconds": "1:55:40"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "moiBKBZnxLM",
            "fillerWordCount": {
                "uh": 94,
                "um": 203
            },
            "readTimeFullTranscript": "56 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "arts": 59,
                "funding": 54,
                "budget": 28,
                "programs": 27,
                "artists": 25,
                "need": 22,
                "culture": 21,
                "paragraph": 21,
                "bit": 19,
                "school": 19
            },
            "wordCountSummary": {
                "arts": 21,
                "funding": 13,
                "culture": 7,
                "DCLA": 6,
                "budget": 5,
                "industry": 5,
                "workers": 4,
                "programs": 4,
                "businesses": 4,
                "grants": 4
            },
            "fullTranscript": "Hello Carolyn hi yeah. Can you hear me I can hear you. I can see you always well so, okay, great, how are the computers tonight right? I just sent you a copy yeah, so I do not know if we can share us. You know have a shared screen with that or if you need it as a pdf, if you want yeah, I just have to go open it I'll. Do that, while we wait here, okay, great. Thank you so much for doing this. No problem trying to help out everything got kind of messed up with Michael's, whatever Michael was doing. Let's see- and it said, but I saved it here- maybe it's further hey susan! How are you carolyn, okay, that hopefully, that the heat humidity will cool down tonight? Oh man! I know it's been intense, highlander Linda. Do you know Susan Mckeown? No, I do not think so. I think follow Foundation yeah we corresponded about. I was at the landmarks. Oh I remember yes. Indeed yeah I just was not looking at you. I was like do not worry what I was going to share or try do not look at me. Okay, I can look at you. How are you doing? Okay? So do you still have another committee member to go here? We're expecting olympia and tariQ&And windy, and I ask people to let me know you know: everybody's been notified and sent the link. So I guess we'll see crystal my usual policy is to wait till about 6:35 and then say: let's go okay yeah! Well, we can't approve the minutes with unless some of them sign in so did Anisha get in touch with you about coming in tonight. In case you needed a co- chair or a co- host a co- host. No, but okay great. I can certainly make her a co- host as we discovered Atlanta right. Almost is a good thing right, yeah, so co- host could be a good thing. Do you think Indonesia could take over hosting your meetings in future? I have no idea we have not. That would be good because it's all screwed up. You know right yeah. Now I understand that it is that the twists and turns of life tomorrow will be interesting at the Parks Committee yeah. Well, thank goodness. Michael is going to host that I was not looking forward to doing it. I said I would but it's a big meeting and you know, but I do not know, maybe Michael will now do exactly see. I do not nobody seems to know what's going on so is he not fully back? Is he partly back? Does he want less responsibility? You know he has not. He has not clarified so okay work out in the next couple weeks. Yeah it'd be nice to get an update about. What exactly is. Did you have the feeling I mean you're, not usually an exec, but I that he was just doing way too much. He was not only was he running all the zoom meetings, but he was also doing a lot of things for Alicia. You know attending girl board in her stead and sharing the billboard meetings. You know right now. I know you know that's a lot of extra work and I think he's pretty much whatever's happening with social media, so somebody take over some of that stuff. So I thought Toddy was dealing with social media. Maybe that's true. Maybe that's true that so I should probably pause this recording motion to approve the minutes. Is there a second? Could someone who a committee member at the last meeting at the second, the motion? Okay, all those in favor, three? Okay, what about wendy in favor? Yes, okay! So wendy? Are you available to vote on the minutes? Hello? Can you hear me okay? I do not I'm using a new headset, so I do not know if it's working or not- okay, yeah. Now it's coming through. Okay, there's the motion on the floor to approve the minutes for that for July. 22Nd. Yes, so are you in favor of that? Yes in favor? Okay? So that's one two, three four five of us, so I think that that's we can approve the minutes so going forward. How many of you were able to review the draft of okay? Can we post that Linda? Because I do not know if everybody has to give it a shot here, okay, so we're fixing to post the draft of the district needs statement. So if you want to take a moment to go through it, oops reshare it sorry silly me. I thought I could do something that I could not do there. We go. You just tell me when you want me to scroll. Okay, we tried to reflect in the draft about the needs of the arts and culture community. The fact that 69.2 percent lost of total jobs lost since February of 2020, which has put cultural workers, including performers, artists, administrators, in a vulnerable position. Okay, can we skip down a little bit? Okay, many gig economy, artists and cultural producers have had no income since March and were not able to access unemployment benefits for months. The prospects of new commissions and projects are, I think, it's non- existent since theaters. Want me to change that, for you, yeah, please Theater's venues and all live performance. Initiatives are get indefinitely, shuttered that the economic hat that the arts and cultural sector is receiving will last for three to five years, depending on sector specificities, artists and cultural workers, or the creative capital of New York are integral to the creative industry capital that fueled, New, York's tourism and export economy for years. At the same time, the majority of public programs and all live performances are canceled. All arts and cultural organizations and venues are experiencing drastic revenue loss and significant reductions in annual operating budgets. This has caused an inability to cover operating costs, especially rents, and there is growing fear expressed for the very survival of many organizations. Arts and culture have a proven positive impact on the local economy and are important to psychological and physical well- being of local residents. At this moment of crisis, it's even more important that extra funding, support and resources are given to these sectors, with special attention to local organizations that focus on the most impacted population by Covid-19. Okay, we can that are low- income. People of color here are specific programs. That initiatives would like the city to fund for Fy 2022.. The city should create a WPA style program to employ artists and cultural workers for the next three to five years, as impacted arts and cultural industries rebound okay down to the next page. Dcla and moment should create grants and forgivable loans in collaboration with 5bs, with svs, with specific parameters that can be met from artists and local arts organizations. This funding should be used for rent relief payroll, as well as for creative methods for online and outdoor programming. Many local nonprofits rely on City Council discretionary funding for their operations, and this year one of our council members received a 98 budgetary cut. She had 11 million 375,000 last year, the school year 2020 to has been reduced to 225,000 for fiscal year, 2021. we're calling on the city administration to reallocate DCLA and other funding to balance this unconscionable funding reduction to a district that has been recognized as a vulnerable area, given the concentration of low-, end communities and marginalized groups, many non- profit, cultural organizations within the CD receive annual funding through the Department of cultural affairs as resources redirected to respond to Covid-19. The city's annual budget has become more constrained, so support for small vulnerable arts organizations is not certain in Cd3 neighborhood, art venues, libraries, community, gardens and parks provide local, often low- cost access to cultural programming, and arts and culture should be integrated into the planning of city projects such as designated arts and cultural spaces. In new publicly subsidized developments, the Department of Cultural Affairs should follow the recommendations of create NYC cultural plan by supporting arts organizations that expand, promote diversity and inclusion in the cultural workforce and to increase language access for communications and cultural programming to reach broader, more inclusive, audiences and programs that support the cultural life of low- income communities marginalized groups in Cd3. This would include funding for latinx and people of color residents, artists and cultural workers and cd3, with particular focus on those in Chinatown and Loy Saida. The city should explore incentives for developers to provide the low market rate. Rentals phase for arts businesses and non- profits and city development should include the low market opportunities for arts, businesses and organizations, as was done for food businesses and Essex crossing financial incentives for property owners to provide lower- cost rental space to arts and cultural organizations would both lessen the number of vacant storefronts that can bite a neighborhood as well as benefit the arts businesses. The city should include programming for public participation in the project. Design process of publicly subsidized projects. City hall should move forward in reacquiring character. I do not understand for community and cultural center at you meant non- profit. Maybe non- profit is what it means. You know non- profit, community and culture as a non- profit. I think it should be as a non- profit, community and cultural center. As stated by the mayor in the October, it should be October, 2017, town Hall, a restored Charis elbow heel can serve as a much needed access for a local web of organizations, stakeholders and leaders that reflect the values of the communities they serve. The mayor's office of media and entertainment and DCLA should support a neighborhood level, trilingual data and communications platform for the many cultural spaces and projects located in our districts to share information on programs and learning opportunities, DCLA, the mayor's Office of Recovery and Resiliency, and the New York City. Emergency management should support arts and cultural organizations direct participation in resiliency planning such as outlined and create NYC culture plan. The city should increase community participation and engagement with the Community board regarding any and all new cultural communities faces and publicly subsidized developments in the district at the end. Yeah, that's the end, that's the end. So how can we go about first? The committee members: do you have comments on what's been drafted? Did you raise your hand in participants, Hi Anisha, hi, sorry to join a little bit late? I think this is going. My comments are, I think, it's going in the right direction. I think there's still a lot of information that was from the 21 district needs statement, so you know we should figure out if all of these different pieces continue to be the priorities that we want for Fy22. Do you have specific examples? Well, you know I was not part of. I mean I guess, I'm still not technically part of the arts and culture subcommittee, but you know some of the things like community engagement with the community or like participation and engagement with the board. I think there are some things that are you know with the fiscal crisis, the impending fiscal crisis of the city. I think you know maybe not having this entire long list of priorities and figuring out like because the pandemic is such an extraordinary situation and it has disproportionately affected arts and culture. What are the couple of things that rise to the top, because you know I can hear Susan saying like this- should not be as long as it should it is. You know this which keeps on giving in economic development which keeps on telling me so I know Linda, I see you so which I mean just to say that, like we should try to tighten it up a little bit. You know maybe like the stuff about the create NYC cultural plan. I think that is really important, but maybe it's not every single piece. That's in it. Maybe it's a couple of the pieces. I do not know. Okay, all right, tati yeah! No, I agree with Anisha. I think that there's we really wanted to be like as specific as possible to the needs and to the district, and you know you know like, for example, the last one. The city should increase community participation and engagement. I think that's true, but it is pretty general without touching on a specific need. I think the I do not know. Maybe Anisha would have a better answer to this, but is the budgetary cut, like obviously we're saying in the introductory paragraph of the cuts and the effects that they've had, but is that really, I do not know? Does that? Does that work in a district needs statement that number I do not think like, particularly, we need to call out because so many things are going to change. That's my sense of it all that. Certainly there are council members that got their budgets cut for this coming up. You know year fiscal year, but I do not know that we need to get into the specifics of that. I think the bigger challenge is that you know DCLA did not reduce the size of their budget and they're still sort of committed to giving grants and funding from you know, council or other places to arts and cultural organizations is at least my understanding, but it does mean that, like we do not know that's for 21, we do not know what 22 will look like. Okay. My comment on that is this one. A lot of small arts organizations depend on discretionary funding going through delay because they do not get funded. Dcla tends to fund organizations that have more funds. Basically, what will happen is that the smaller organizations will be defunded and I think state of the art DCLA that they're not going to allow a number of new organ. You know like usually every year the Cdf opens to new organizations like people who have organization. I do not think that that's going to happen as much, because it's still the limited pool of resources, so I think we should say I do not think that it needs to be as the specific numbers that we're in all that Tariq has to scroll to the top of the. Are you talking about? What's in the council members Budget yeah right, because normally the way that most small arts organizations are funded through DCLA is through a 5,000 grant from the discretionary funds that goes through DCLA. So, basically, the amount of money that's been awarded to the council person is not going to go very far in regards to funding small arts organizations, because that a discretionary fund also funds other non- profits. It funds everything, so that will have a huge impact on many of the liberal arts organizations in this neighborhood. So I do not know quite how you know if you cut it out that it's going to reflect what the actual reality of the situation is, I think we could say something like local. Non- profits rely on City, Council, discretionary funding for their operations and for fy Fy21, which is what I believe, oh yeah. It says that later the council members that represent community district three receives significant budgetary cuts and then some of them are. I just do not know. If we can say it is an unconscionable funding reduction and I guess that's a question for like anybody else's committee, about how we say something like do. We say I do not know okay, so it's all right, so I think you could say instead of unconscionable, that the funding reduction to a district has been. You know it will have a severe impact that way that drastic, maybe yeah, drastic discretion. Do you want to put all these numbers in there? Is that what you're saying I mean it just I do not know if it makes sense to include all of those specific pieces of information, because again not all of it goes to arts and culture. I you know I did not work on this little piece of it, so I'm not sure if all right and then Tariq had a comment in the chat, can we add, rely on discretionary funds both for operations and for programming right, because that is one of the advantages of DCLA is that you can use funding for administrative expenses as well as for the programming, and there are very few grants that fund administrative expenses. So it is the way that many small organizations help to meet some of their administrative expenses, as well as to pay for the programming right so Linda, if we could add in for their operations and programming right here, yes, operations and programming, and then I think the period there and then this year or like in Fy, 20 and 21., I'm going to say that in Fy, 2021, okay, I think also too, where it's. It should be many local arts non- profits in the front, because there are many nominations but they're, not necessarily arts organizations. Let's see option from like 20 phones, okay, they received a cut to 225, 000. and you're, just cutting out the alumni keyboard. Here, it's funny all right delete key. Where are you there? You are okay in Fy 2021, our council members received okay, a 98 budgetary cut, and then this does not make sense anymore. No, it's for the 20:22 our do we want to take out these specific numbers. Well, I think, if you say a 98 budgetary cut right. Okay, then, you could take out the numbers, but it's, I think, a 98 budgetary cut that drastically reduces funding for organizations within for arts organizations within the district right yeah. I would say right, but it's also, since we're dealing with arts organizations in this document. I think many it should. The paragraph should begin. Many local arts non- profits rely on city discretionary funding. Okay, let's start over here now, let's see so, we said many local non- profits rely on City, Council, discretionary funding for their operations and programming in Fy 2021. Our council members received a 98 budgetary cut that drastically reduced aggressively reduced. I'm sorry, I wish I could type that would help right, yeah man well, computers would sometimes be user- friendly, drastically reduced funding to arts organizations within the district Linda. Do you usually since you're another chair of a committee? Do you have things like? We are calling on the city administration to reallocate the ecla and other funding? Well, that was not. It was not sort of was not relevant to landmarks. I guess we would call it out if we were facing drastic cuts in our funding because of the city budget cuts we'd want to say something about it. Nothing gets funded anyway, so does not matter. Okay. Does this now make sense? I think that's fine. I think Carolyn's last point was many at the very top of the second word should be many local or third words, non- profit, yeah right here. What you want to say, art, many local arts, non- profits, looks good. Okay, should we, I think we should say drastic again here. We could probably just take it out because we already said drastic right, but I think you could also take out the arts in front of organizations and put these instead, because it's redundant to have it twice, yeah right here, I'm taking arts out yeah and put these to these organizations. I think that's fine yeah Mike in asking them to reallocate DCLA and other funding to balance this funding reduction to a district. Okay, the funding has always come through DCLA through the discretionary funds. How do we address that? Because I do not. I think that sort of gets lost. I do not know that you necessarily need to say that, at least in my I mean, I think what this was one of Olympia's points. What Olympia was trying to say is that, even though DCLA has still a budget and like a huge budget and is still committed to funding arts organizations, it's the fact that City Council in our district had their budgets cut the mechanism through which that money comes which does come through DCLA. I do not know if that truly matters in this. I think it's just that there is less money. If that's what you are implying, I guess, or if there's something that I'm missing I'm trying to okay, if they're reallocating, dhcla and other funding to balances, how would they do that? They should take money from other things in the city and give it to arts and culture? Well, the thing about it is the mechanism to do that in the way that they normally receive. The funding for arts organizations is through DCLA through the city or through the lower Manhattan cultural council. But that's you know, that's funded, so at any rate, should we mention Llnc Linda. Can you make a comment there and maybe we could move on from this point and then see what other things are in the document and then we can right on here right yeah, since I do not know how to do it. The other way I'll just put it in here, okay llmc and what is the comment? Lower Manhattan cultural council is funded through DCLA and so expanding the amount of money that goes to to lower Manhattan cultural council would allow arts organizations and artists to be able to apply for grants directly through them as compared to DCLA. That's a long comment. Okay start over okay. I wonder if we can just put a note that says like mechanism for funding and then we'll come back yeah. I just put that's a lot better: okay yeah what about including llmc, because that's the only funding source. I know that if you're reallocating funds through DCLA that they could give it Lmc Allen Cc, lower Manhattan cultural council yeah, that's it Linda. Could we start from the top? Maybe yeah I mean if I could just comment, it seems to me that your need basically is hey the funding for what we do is gone right. You know, that's you need is to retrieve that funding, somehow restore that funding. Okay, go ahead! Okay, maybe if we like, if anybody else has any sort of like global comments like any sort of big picture things that we should that people think are left out or you know, maybe should be cut altogether sort of that kind of level yeah. So why do not? We try to engage the rest of the committee members to comment that Tariq? You want to just do paragraph by paragraph see. If there are any paragraphs you could just eliminate or rewrite or whatever. So there is a question from Jack in the chat that I can answer, so the discretionary funding is actually I distributed from directly from I mean through the City council, so the they are a different budget line than what we would like to use. That would be a city line where that other funding comes from City Council, like budget line, if that makes sense jack to your question. So I'm not clear on that. If it comes through city Council, but there's still an aggregate reduction, would it not make sense to make an appeal for the compensation? I do not know yeah. I do not know if they they said earlier in the course sorry everybody by the way for joining so late, but I'm in the d.o.e part of reopening the schools and it's tragic what they're doing right now and so so. Basically, the reason is actually the city council speaker has the discretion of giving to the various districts and their council members money and because Carolina Rivera specifically voted against his budget. She's part of a dozen of City council members that so above 90 I mean in our district 98 funds cut it it's ridiculous. It really sounds like they're toddlers and they we vote for these people, but that's the reality of what we're dealing with here and that's going to have a huge impact, a lot of local community groups, because very often these are the kind of funds that are a bit less complicated to get compared to other funding streams and department of Cultural. Affairs had already said that you know our district because of the concentration of latinx people of color chinese Americans. It has a lot of small, like lower budget community groups that do a lot of arts and cultural education and service, and those usually are the folks that are impacted by this kind of budget cuts. Yeah we've talked about that, but the thing is about a mechanism about how it could be addressed, because DCA historically has used the discretionary funds to fund the smaller arts organizations and if those funds are not available through the discretionary funds. The other thing, the other way that DCLA can administer funds is through lower Manhattan cultural council, which is a much less complicated application process. That would be more accessible to artists. But I think I think there is a simpler way, caroline, basically, because the funding stream, you know the DCLA- may administer funds that come from the city budget, that the mayor as an administration distribute, and then there are these additional funds that come from the citizens right. Sorry, my daughter now I want to say hello to everybody. So basically, what I think we could do is by just asking DCLA to make sure that there is additional administration funding. Okay, that could already would be a solution. So the thing is, the programs can be the same right, but the funding stream that they will use. You know, for instance, the city will receive federal relief right now. We do not know how much of that relief will go; no, they will receive it. That's like something will come like. I was also in a call with Schumer like there will be something we do not know what it will be. The question is, the city will prioritize certain needs, and so, as arts and culture committee, what we can say is this sector is worth of being prioritized because it had the huge impact because it serves the people who have been most impacted, etc, and so I do not think you need to go crazy about finding the way that they can do. It just tell them that they need to re-, establish the funding seam and you are okay, yeah well, yeah, it's a matter of opinion as to whether or not they'll do that so get anywhere. I think whether they do it or not is their decision, which of course, can always be affected by appeals and lobbying and mobilization. But the whole point of this letter, I think, is to make the appeal is to bring awareness and to make the appeal not to second- guess whether they will or won't do it. I mean that's just my sense of okay right now. The discussion really needs to be with the committee members Jack. So to go through it. Members comment first, so at any rate Thomas do you have a comment? Are you still there yeah I'm here, I'm just thinking more along the lines, just I'm in the school system, and these cuts really affect our ability to run after school programs, and I do not know if we could. I do not know how to articulate there is a need, is going to be a need, at least in the next two years or more, for some kind of remote engagement. And how can we fund that you know because they have the ability to continue services, but that's the frustration we've been having just how to get people to buy on to funding something. That's happening remotely. Okay, so I think we can edit that a minute can we check with wendy and to see I mean, but if you think that what Thomas suggests it is worth- and I think it is- we can already start editing. There is a no, but I think we need. We need to ask the other people on the committee. What their opinion is: olympia, okay, so wendy July. I think I think Carol in the proper point of order is Thomas should have said. I make a motion to add after- school programs and then we can say: is there a second? We can say second and then we can edit the razor, because if wendy adds another issue on the agenda and we discuss something else, then it's going to be harder for us to edit the result in a proper way. That's my recommendation. Okay. So where are you suggesting that Thomas Insert this or make the motion to insert at Olympia? I think it's an easy way to add it. We can say where we say that should create grants, a forgiveable collaboration with SBS, with specific parameters that can be made from artists and art organizations. We can also create a new, a new bullet point and say that they should also collaborate with DOE and give emphasis to cultural organizations that are after school providers and support services for public schools. I think we can add it like that. Do you like visuals, at least Olympia, sorry say that again you mean right in this bulleted list yeah we can add one more bullet and just say that we want also DCLA and mom. I do not know if you work with music also, it can be also DCLA only collaborate with DOE and create grants for cultural organizations that are giving support services and after school services to you, know, public schools in our district, it's sort of including remote learning so and that's a complete sentence. Please, and I will type it in yeah, okay for now we're actually on blended learning in this district that I do not think it's going to work, but you know that's what they're telling us so Thomas you Wanna say it or I should you Wanna, try it. I like the way that you articulated it and we can capture it. I think that'll be really good, a little slower right. So I would say: DCLA should collaborate oops now you have all caps. One thing happens to me all the time. My fingers on the wrong keys should collaborate with d.o.e to create grants and funding streams for cultural organizations that provide support services and after school for the local district schools, cultural organizations that provide right support, services, no crime or reason just the keys, just go where they want to go. Now, really it's something very strange: support, services, support services and after school for local. Actually, I think CB3 is both district 1 and district 2 for schools, because our community board and our school district do not go inside. So I would say local schools- and you know I mean like after school programs right, yes, local schools, including remote learning, including Mama, says point. I mean I think the funding streams can cover anything they want if they want remote learning, if they want blended, whatever resources they need, you know, should we say flexible funding streams that can cover all the needs that these kind of organizations may have. Well, I think the remote is kind of important to include just the term, because even if it's blended that implies that there is a remote aspect and as students in the school actually wind up having Covid-19 or staff they're going to be on quarantine anyway. So I think it's important to have it, because it's going to be a trend for the next two years foresee foreseeably how about we say: support services, comma, remote learning and after school programs. Great. That would cover it because I think that needs to be explicit. I do not think they think about these things. Well, actually, there have been comments. Are links in the DCLA newsletter from the commissioner that they're asking there's. There are programs that are available, that nonprofits can apply for through DOE to provide after- school services and I think and community space as well so wendy do you have some comments? I do not know I'm being nitpicky about this, but then that last, that section provides support services, comma remote learning within, like I think, instead of saying instead of comma just put including remote learning and after school programs, would read a little better. Okay, you're right all right. Do you have any comments? I guess I feel like we might be straying a little bit from the district needs just because the district needs we're just supposed to be just explaining, what's happening exactly in the district and what specific hits are, and I feel like I feel like we can create a reso. That is also focusing on like the more immediate needs as well, and maybe some of this language can go in there as opposed to district needs and as far as the after school programming yeah, I mean Thomas, we'll know about this too. I mean we do have a similar need expressed in education, health services- that's expressed pretty similarly, but yeah. Those are my comments. Okay. What about you? Gerry is your microphone. Can you put it in the chat box? Okay? So now, maybe we should take comments from the public. That's attending anamari, the wild project, Andrea hi. Sorry, I had to step away for a minute yeah just globally. I also agree with many of the things people have said. I think that yeah, it's important to underscore that the performing arts, in particular kind of like small businesses, are hyper reliant on especially performing arts venues. I do not know if we want to single that out at all are extremely reliant on on income from performances and that sort of stuff, and without that happening for a year or more, it puts especially small and medium- sized or organizations at complete risk and without any kind of steady support they will shudder. So I do not know if we want to add a little bit more specificity. It's stated there. The performing arts sector is especially hard hit. That's yeah, that's one thing that sprung to mind in terms of needs, and I do think it will be long term, so by 2022, we'll still be performing. Arts groups we'll still be struggling with this. So so I know you guys are considering also erezzo. I heard so one thing I wanted to say: I completely agree with Andrea, but the one issue is that, unfortunately, the city can not do much. So basically what these venues are asking for- and you know I work closely with all of them. They are asking for rent relief for the continuation of eviction moratorium. Actually, right now, the numeratorium signed by comma until September 4th does not cover commercial leases if they have not qualified for pandemic unemployment. The pro proprietor, it's like super complex. Actually, these people are can be evicted before right now, but I think those can be things that we consider for the reso, because those things the city, unfortunately, can not do anything so you're, basically suggesting that this paragraph here about the majority of life. No, this is okay. This is okay, because that one we use in order to act to advocate for a WPA, because the impact of the industry and the workers will go on for three to five years. So we want them to create a funding stream for WPA and to preserve the workers, because what we're hearing is the workers are either moving away or changing jobs, and if for the industry, the creative industry to rebound, we need to preserve some of our people. You know- and so that's why we put it there. But I was talking more about the concern that Andrea brought up. That, I think, is a very fair concern that these people are not going to even survive, but the reasons they're not going to survive is if we do not do anything about the rent, because it's just you know they are expected to be paying the same amount of renting, but those have been sat down from the city and they have no ways of generating income. You know so right. Also, the other thing that I need to find out. Anisha do arts organizations, theaters performance venues have to pay a 19 tax. So on like property taxes, you mean yeah, like small business establishments, do not they have to pay like a retail tax or something like that on the space that they occupy. It's usually that the landlord passes on the portion of the taxes in the rent or commercial expenses that they pay to a landlord like nonprofits themselves, obviously do not have to pay any taxes, but if they occupy space in a building that is owned by a for- profit, they usually the landlord passes on the proportion. So is there a way of reflecting anything about that? How to address that issue for non- profits that are performance, spaces that are in commercial buildings? I think we have it included in this paragraph. Okay, I think I think Andrea's comments are reflected in the district needs right now. Okay, but I agree with andre also that, like out of all the different parts of the cultural landscape, performing art seems to obviously be the hardest hit and the center for urban future report that is referenced in you know this DNS sort of reflects that all of the jobs in the performance, not all a majority of jobs in this performing arts have been workers have been laid off right. So Susan. Would you like to comment? I think, on Marie, who you mentioned before she just said she was not. She did not realize she was muted. Do you want to go first yeah? Thank you so much everyone, okay, I'm I got into the meeting late because I got the email late, but first off. I just want to appreciate- and thank you all for doing this and taking the time out and writing this language, but yeah it's kind of hard. I mean the discretionary, the Cdf money that you all are talking about. Definitely the feeder companies that do not actually have physical spaces. It's going to hit them the hardest, not having that money and for us being a venue right now for a car like, for instance, we got money from cars on the internet this year we got it and it was a huge help to us, because it's helping us pay our rent. So without that money there in the future being that it's going to take so long in our industry, I think very fun is really big in the coming years: okay, so Susan thanks and thanks carolyn for inviting me along this evening- yeah I'm still new to this, but I've been coming to community board meetings since the fall, because I reoriented completely. I transformed what I was doing. I am an artist and I still live here and I learned from you carolyn about those facts that between 2008 and 2017, almost 4,000, artists and arts related businesses disappeared from the lower East side and that's related to the healthy storefront vacancy rate, or the lack of that I mean that went to 15 even before this. So for our organization, it's kind of evolve or die. So I'm wondering with this document, what's the expectation or what's the purpose, I mean what do you? What does the community board want to achieve? What's the expectation and ask I mean I'm just interested in that, can we expect the city to seriously take this in hand. I think that this is the only mechanism that we have through the community board that we can reflect what the needs of the community are and that the document goes to all the elected officials as well as to the city agencies, and it puts it out there that these are the needs. These are the facts. This is what's happening, so I you know that's the best. We can do right now at this point in time, yeah and it gets their attention anyway. So I know you're the need for the community, hopefully so you're mentioning the create NYC cultural plan, and I wonder if you're familiar with the people's cultural plan, yes and great, and the Low East side of plan might be worth mentioning. In this context. I just thought in our because it's from our our community yeah and because some of the ideas articulated in those plans really relate to culture and land and rather than gentrification rather dispossession and the challenges facing artists to hold on to play spaces to live as well as spaces to work and yeah. It was really interesting to learn that statistic about 69.2 percent of total jobs lost and the strategy that we're looking to develop slowly is with kids and early stage artists who are out of school already and starting to try to earn a living. So I appreciate the mention of that. It's crucial to try and restore Charis to the community and any available cultural spaces, because we have poets and we're known as the one, perhaps arguably the most creative. You know quarter of Manhattan, but we do not have poet's house. So we have all the history of immigrants, but we do not have the same kinds of cultural space as other parts of the island. We are the home of the broadway musical, but that got taken uptown so, and these are the kinds of things that have been in my mind and how to really hit home with that as the uniqueness of the lower East side and what it has brought. But now it's our artists and performing spaces. Cultural organizations are decimated because of this so to yeah, I've been searching and listening to all of this, and how do we really articulate that yeah and articulate that in a really strong way? So sorry, that's a bit of a general thing, but that's my that's where I'm at. Thank you all right. Thank you. What about Jack? Are you still there Jack Carol? May I ask a point of order if we are adapting this document should not. We have like a formal process, not just generally listening to comments, but basically just review the language and basically suggest amendments if people have something to add, because it is a very long document- and I must I apologize- I have not had time to edit the older requests and I was hoping we can do that today, because the older district need requests were incorporated, but, for instance, status. We should update it with the latest or others may need to be updated because now they're irrelevant because of Covid-19. So I think if you want to adapt today this document as a formal way, we should finish that and if people want to participate, they should just make it in a form of amendments, or you know the only way that someone could make a formal amendment. It has to be someone from the committee to make an amendment, but I think it's good to have public comment in order for a committee member to be able to make a motion to address that issue. Yeah generally district needs do not require formal amendments. They're sort of the whole committee agrees to them, but there's not even you know you do not not even have a resolution to approve them, but I just feel that if we continue having general comments, we're not going to be able to do the work that we need to do, because the text is not there yet right. That's why I thought maybe you'd like to go paragraph by paragraph or something I think it's a great recommendation, Linda. Yes, we had started doing that olympia before you got here. We went over each paragraph. Oh so you finished editing. No, we have not finished the editing. What we did is we reviewed each paragraph and we asked for suggestions from people and comments from the committee about what they think needed to be included or deleted. Okay, and so far today we have tati who's, saying that some of the points that we brought into the district needs statement could be drafted into a resolution and removed from the district needs statement. So perhaps if that would be a starting point to do, that would trim down the district needs statement Anisha. What are your thoughts I'll? Let you know Andrea still has her hand up. I was not sure if there were more comments from Andrea, but otherwise I think we should maybe just start from the top and go down okay. So my comment, thank you. So my comment was actually related to the to like a specific point about the district needs that might fit in, and I was thinking about the the cultural plan point. I think that, just to make it a little bit more, I guess practical. I think that we could combine or at lea. Maybe like the point about the I agree completely about having there's been a lot of conversations about reviving the WPA and ceta programs, which I believe were federal and it just. It just came to mind that most of the create NYC plans come from federal dollars. So, like the building community capacity program, I forget the other ones. I want to say the disability forward fund. Those are federal dollars, so I do not know. If maybe I do not even know if that merits like a discussion about where the funding would come from for this sort of stuff, but but it's just a point, I wanted to raise for clarity and within those two okay, all right, so we want to start with the first paragraph suggested edit Olympia. I think they're awesome the first product yeah, the first paragraph is just general and I can hear me is good too. If I could pipe up yeah, can you hear? Can you can you hear me tarika? Yes, oh great, okay, I said my Mic Yay. You got your mic working, yeah, okay, great all, right, I'm here, okay, all right hard to type! First paragraph I think, looks great yeah. There's no comment on that: okay, wendy! I think as we scroll down. Maybe people should speak up when they have something that we need to change. I agree just tell me if you want me to stroll more scroll, more yeah, I would say you we can scroll yeah. Can I ask olympia you or like it's? I do not know that. We know that it's going to last for three to five years: no, the rebound yes, so the economic studies that I am you know being distributed for the music sector for sure the impact is three to five years. That does not mean it's not going to restart and some money are not going to be coming, but if we're expecting the level of activity, jobs, Et cetera that were there before the best cases in three years, everything will be back. The worst case is five or never. I do not know, but that's the cycle that I'm told from industry I mean I can try to find you a source, but the studies are done now. I think we should put a source if we know it or we should say something like the economic. The negative economic impact to the arts and culture sector is anticipated to last. Yes, let's say it's anticipated. Thank you. That's a great edit. It has to be nuanced yeah. I think we should still include a source with that. I think so too. Okay, I think for the first sentence, the many gay economy, artists and, oh sorry, what happened? The first sentence that bit that says, had no income since March and were not able to access unemployment benefits. I think it's still an ongoing problem using past tense. That makes it seem like it was an issue before, but now it's like slightly better, so we change it to like present tense. It might like actually yeah. All right still has no income, no income yeah. So that way it makes it seem like it's like it's. It can't be trivialized as easily. So may I suggest two things one because I think Linda was finishing the previous edit, maybe the economic impact, because the heat has happened, but maybe say the impact for that sentence where you, edit it to say, is anticipated to be the economic impact and then about your comment about them. Had no income since March. I think that is obvious. That is continuing, but they were not able to access unemployment benefits for months and then what we can say is currently it is debated for how long those unemployment benefits will also be available because they already expire the enhanced benefit, but the pua is secured until January. So I mean, if you want to be precise, we can add a sentence, but I think the sentence that is there is valid, but if people are not still not able to access unemployment benefits, I think the difference is it's one thing if they are not applying for it before they were not able, just because they were not there like the federal and state were not even able to pay anybody you might have applied. You might have done everything right, but no money came to them for three months, most of them now, if somebody just did not apply or they can not, they do not have the information. I mean, I'm sorry, but the system is there. You know what I mean before the system was not even there. That's what this says, but I think the comment of sorry. I do not know your name of the person is valid, because what it's referring to is the fact that unemployment then has unemployment has already expired on July 31st and the general pandemic unemployment for which every worker can qualify is only extending through January for now yeah Linda. Let's start at the top of the paragraph, many gig economy, artists and cultural producers maybe lost in or like lost all income is it had? No income is the right. I do not know. I mean they ceased having income in March, okay, let's just keep having kids. They have had actually have had no income since March, okay, no income since March and Olympia. You are fine with Warren or are not able to access. No. Currently, they are able to access. They were not able for months so for three months after they stopped having income, they still could not access money because the money was not there. I mean the fastest ones within two months qualified, but the majority of people after three months got it. Then you wanted to add a sentence after this sentence. Yes, so somebody just said that we should also add that the pandemic unemployment benefits are set to expire in January yeah. I mean the thing is because these heroes act and what act? They constantly change those deadlines, but I think they're set to expire sooner than we know that artists will be able to go back to work, and we need to do something about that. I guess that's the real sentence, but I do not know, but I'm trying a way to say that without having to go into all of the details, right, yeah, so much thing so much stuff could change between today. Why, when this is important, I mean, I think, the reason for which you need. That is because what you're urging the city to do is to take care of the of the artists and the workers, the cultural workers, with alternative programs right- and we can say the continuation of unemployment benefits- is uncertain, short enough. Let's say that cuts to a lot of stuff phew we made it almost after benefits is uncertain. The continuation of unemployment benefits is uncertain. You've got the prospect of new commissions, and projects are not existence. These theaters venues and all live performance initiatives are indefinitely shuttered and the economic hit that the arts and culture sector has experienced is anticipated to last for something to that manner to five years. I think the negative economic impact yep that the arts and culture center yeah the negative right in front of economic, just put negative in front of economic Linda. Negative no negative is above in the line above it's in the lineup. Where did it go right in front of economic? That's where we want it yeah. Here it is yeah. We should remove it there. I know this is the most annoying thing I did not plan. For that to happen. Do not worry my computer does all the time the same thing does it. I mean they all like to think I could stop using word. I would be very happy anticipated to last three to five years, depending on sector specificities. Sure, however, artists and cultural workers are the creative capital of New York and are integral to the creative industry capital that fueled New, York's tourism and export economy for years. I do not know that last fully makes sense olympia. Should we change I'm sorry, but that the negative economic impact changed that to on the arts and culture sector is anticipated because of that they are right. Yeah that works you're right. So what are you saying? Can you say you want to make it shorter? I just do not know that the last one makes sense. You do not even know. Basically it's just yeah. It's not a fact. You've been doing pretty good about giving facts yeah so, but fundamentally, the only fact that what we're trying to say is you want to preserve workforce, because our city agencies have a way of preserving industries, and that means they give grants to the businesses and the organizations, but they do not understand that those do not always arrive to the workforce, and so that's why the rhetoric here was you love the creative industry, but you need to fund the people who fuel the creative industry, but if you think it's too worthy or obscure, we can just edit it. I do not think that what your sentiment is comes acrosss in this sentence. I think it seems like it's a random sentence about how New York City is a creative capital based on tourism and not a connection between that workers work in the creative industries and we need to support them. So do you think we should just write more straightforward? I think straightforward or you know. I think this is like that sentence is more for like why New York City cares about arts and culture, maybe not necessarily why Community board 3 cares about, at least from my perspective, arts and culture, even though it is connected to tourism for sure yeah. No, I think what is important for cd3 is that, even though the industry wants rebounds for three to five years, we want to preserve those artists that live and work in our district. While the industry is returning. So then, why do not? Because you say something about that- you want to retain the artists who you know live here that feel, however, artists and cultural workers. We can say take out the word at the creative capital of New York. We can say, however, artists and cultural workers of the impacted industries. Greek has a good sentence in the chat. Oh great, okay, what's the track, I do not even know if we need the. However, I think it's that artist and cultural in community district 3 are integral to the creative capital of New York that fuels the city's tourism and economy. Perfect. That's great! That's a great sentence! Thanks Anisha next paragraph, so this paragraph and the next paragraph are a little bit redundant and I think that they can be combined in a couple of ways or reduced. So I think it also, though, that first paragraph speaks to the points of the specific programs that we'd like the city to fund. So I do not know if it needs to be said before we address the point yeah. So you know this is the framing for asking the for givable loans and the grants in conjunction of DCLA mom and SBS. So we can. You know I mean if you think that we do not need to frame it and we just can ask for it without framing it. We can do it that way. I felt that we had to make the case, but you know I'm following whatever the group feels is the best way to convey the need. I would suggest that we get rid of at the same time and just start. The sentence with the majority of public programs and all live performances are cancelled, that you know that are with the majority of public programs and all live reports that all arts and cultural organizations and venues are experiencing drastic revenue loss and significant reduction by eliminating that you change the grammar okay, so the majority of the programs, you know what images are cancelled, yeah are cancelled, all arts, that's a consequence. Okay, I would put with the majority of all public programs and all live performances. Now we're going back here, yeah just put a width and I think you could get rid of the r okay. I think that paragraph looks good otherwise, and I think the beginning of the next paragraph could be removed, and maybe we just focus on that last bit, which is special attention to local organizations that focus on the most impacted population that are low- income people of color, and I do not even know that it's we, I think what perhaps it's, that it's arts organizations that both serve and represent. In my opinion, people love color, I like to add, surf and represent one question I have for you and isa. The reason for which this is an older sentence edited the reason for which I think it's important is because people constantly talk about soviet trauma. Right now I mean both for you know the victims, the people who I mean people who die people who lost their jobs and also kids. You know because of what is happening, how we live, so the fact that they should fund these things, because these things also function a little bit like therapy. This kind of programs is important, so that was somewhere else. I also might have too much, but is that not at the top? Also right now? No it used to be at the top and then, when I had it did it ended up at the end, I think we do not have to say again that it's a positive impact to the local economy, because we've said that a couple I completely agree: yeah, let's take out the economy, the chair of economic development said we can get rid of the economy. Well, I talk about it right. I think it's fine to say if we want to talk about the more psychological or you know, human impacts, I think that's fine. I do not know necessarily that the point that you're making connects to that last piece of it, then that special attention to local organizations. I think everything is about special attention to local organizations that focus on or serve and represent people of color. We made a sentence. It does not work anymore, so culture are important to the psychological physical, like make it into two sentences at this moment of crisis period Yo. If you put a period yeah, then it makes sense this moment of crisis. At the beginning, let's say: art and culture are important to the psychological and physical well- being of our community, and then say it's even more important that extra funding, support and resources are given to these sectors, and we can also take away the what these sectors and say to local organizations that and make it even shorter, okay, again, okay, so we got that part yes and then just take out this sector and say directly that the funding goes to organizations. Sorry, it's even more important that extra funding, support and resources are given to local organizations that focus on yeah that focus on the most impacted population are the most. So we just take out this part to these sectors with special attention yeah just to make it shorter. If we do not yeah, I like that, let's see even more important. The next one is are given to. We do not need attention real. You do not need attention. Okay, be picky. Here, be an editor, I would say suggestion. I think that it would make more sense if you said that the focus on the impacted pop are the population most impacted by Covid-19. Yes, I agree with you yeah much better goodbye and then this last part does not make sense, maybe which are low- income people of color instead of that yeah, instead of that put which hey we made it through the paragraphs yeah, we just need to get rid of that comp. Oh all right is that a comma period here it looks like a period it's supposed to be a comma, f, okay or which you should have a comma. It's a comma, all right. Okay, let's go into the should define. I just make a comment here. You know the district needs are a predecessor to later budget requests right, and some of them feel me like budget requests rather than statements of need. Well, the is if we put that in the resolution and passed a resolution in support of these items. Yeah the same for the budget requests in the fall yeah carolyn. The budget requests are coming up soon, right so yeah that usually it's the end of September or October. So I think the idea was that we would actually try to match the disc needs to the budget requests, and so that's something to think about. I have this need in my community. Here's the money, I'm looking for you to give it to me right. So do we want to take this particular segment out that the specific programs initiatives would like the city to fund for Fy22 and turn that into a resolution? Why do not we just read through them and see if any of them really do belong in the needs statement? Okay, I mean the fact that we need the city to create employment. Programs, for the workers is a need. I mean we can write it in a different way. No yeah! I do not know I mean we can. We can describe it as our district needs to retain arts and cultural workforce while there is no work out there. We've said that very well up here, yeah we have. I think the this is good. These are all good statements of needs. Good, okay, perfect, but I do not know if any of these other things really are more needs than budget requests, because I did not read through them. I'm not trying to dictate I'm not on your committee right. No, I know but Party whatever teeny bit of wisdom I have and what Susan is going to say. Yes, exactly I mean I think, maybe what we can spell out is in that sentence where we're talking about the fact that they lost their income and they can not meet the rent, etc. I think maybe the need is that, because of the particularities of venues and non- profit organizations, they do not always meet the criteria of the programs that are out there right, and so that's why they always need to say that there needs to be programs that are designed in a way that they can meet the criteria. But I do not know if that is something we put in the need or right olympia, because I think what you're? I think there is a connection, as Linda pointed out, between understanding that arts and culture is like the most. I mean my economic development, so, like I think about it. This way it is the hardest hit sector right, besides, like general small Business in New, York, City, and very much so in our community board area, because there are so many cultural organizations, small theaters, and I think you can certainly say that. Maybe it's not like there's a we know specifically that there's a program or funding that's needed, but that there should be funding, that's specifically targeted towards the cultural sector, because it does make up a significant share of the city's economy. You know something like that. So it's like it's addressing a need, but it's not necessarily. You know it sort of ties to a budget priority that we do not know yet. Well. I can see your budget priorities. Okay, wow. You got him yeah. Okay, so are we just leaving everything below their off or are we going point by point to the older staff because the older staff start from point five on? I think I have not edited those at all. Those are the last year. District needs from bullet point five. I think like here. Yes, exactly from that point on, it's all our all this techniques, and so I do not know if we want to just chunk them or repurpose some of them. I do think it would behoove us to start at the top of the bullet points and just all so that everybody has a chance to read it and go through, but I thought you said that they are like budget priorities and were not entering the first five because they were covered. I'm just. I think I think what Linda was saying, straddle the line between budget priorities. Yeah, it's tough just decide what we want to keep it. What we do not when is anything redundant here, any way you can shorten it up is always good or you could just leave all this stuff in there and let Susan have at it. That's another possibility. I wonder if this bullet point the department DCLA should follow the recommendations of create NYC. I wonder if that is exactly what we're looking for to expand, promote diversity and inclusion in the cultural reforms. I mean yes, obviously, that is what we're looking for, but through these things like cultural programming to reach. I wonder if there's a way to like shorten this and also make this a little bit more relevant to the time, because I think this is for. Like I mean I work on the cultural plan, I think this is more diversifying boards or like hiring people. You know, which is a lit. I think a little bit different from the specific needs of today. Okay, but basically, is not DCLA following the cultural, create NYC plan that they've integrated it into their operations so telling them that they should follow it. They are following it. As my understanding I'm just like. Is this the most relevant? If you do not need to say so, I think they already. I do not. I do not think it's relevant to today's time right now with the changes that they have integrated into DCLA and how they're operating the programs now that they require that, in order to receive city funding that you have to have a diverse board, you can't receive. Unless you do, I mean I think the point is that they've already adopted it. So I do not know that, like that's what I'm saying is they've already adopted it and they've put things in place so that it's impacted on the arts, organizations that receive funding from them that they have to follow the create NYC plan going once going twice. Shall I blow it away gone yeah? I think. Actually we covered it. Also above when we said we want you to find the people most impacted correct. I also think that we can take out the publicly subsidized projects, because I do not think we're going to have much development. I do not know for the next year. I do not know I mean we can keep it the next couple of years. Yeah, it's again. It's almost like you want to focus on the Covid-19 impact. Yeah, for sure that's, this is just sort of a general statement of principle. Well that principle applied last year when rampant development was going on in the neighborhood right. Now, it's going to be questionable as whether rampant development can go forward yeah. I do not know that one makes sense in the same thing. Maybe we can take it out this year, no yeah. I think we could we're going to have a lot of vacancy, and you know Ryan from bad we're saying that more trying to keep organizations in their spaces new spaces right, so this paragraph can go yeah. So what about the next one almost says the same thing I mean actually the way this should be written because, right now it does not make sense. It should have been. The city should include funding for participatory design processes in public subsidized projects. But again I just said it with funding. It's a little bit a budgetary priority. As I wrote it yeah I mean we can just keep it further for the budgetary staff yeah. It was big with two bridges. You know like with two princes. We had to fight to get funding to get all those community sessions input. You know sure yeah. So what I would do Carolyn is hang on to the draft. Since I've already wiped out this document and this thing's in there, you should bring forward at the time of the budgetary priorities right. I presume we do want to keep charis in here please, but we should update the language to reflect all the issues that you discussed at landmarks. Well, this is the point, though, is that the city needs to acquire it. Yes, the the issue of the you know problems I would leave out of this. I do not think it needs to then. Let's go to the next point: okay, media and entertainment. I could see these are kind of left over from last year. Yeah media and entertainment in DCLA should support a neighborhood trilingual data and communication platform for the many cultural spaces and projects located in our district to share information on programs and learning opportunities. That's more like a budget request. It is, but I think the district need that was voiced is that we do not have basically a lot of the programming out. There is not available to all our communities because they do not have the means to produce trilingual promotional. I guess, like with community gardens. Green thumb is producing promotional materials in different languages and providing translators, so the city has been doing that in that particular instance. This is a bigger ass, though right to create a platform right to create a platform, but it is they've sort of been headed in that direction, because now you can request signage in Bangladesh Spanish, whatever link a chinese. Is there a difference? I think in this time like mom is like represents. You know. Cultural is not just DCLA right, it's all of the film television media, it's all of those sectors that Moam controls or like right. It also overflows into parks right. So I do not know if I think this ask of this like bullet point of mom could be a little bit different. I think we should include mom in here, but I do not know if this specific ask is the Ask. I wonder if you should change it into a need yeah. I think if you changed it into it right now, it's like a budget request. Yeah. Let me let me talk to you anissa. You should consider maybe this for your district needs, because the reality is that the trilingual thing has been mentioned to me also as a need of small businesses, because not we are talking about cultural programming, but the difficulty is that a lot of the programs that are announced, grants etc often are not timely, announced in other languages, and so you have it already did. I think we were thinking about more. I think that felt like more of an immediate term like there are programs that are coming out now and we need a resolution for it now, not necessarily to describe it in this way. Great. Okay, so are we taking this out or leaving part of it in or how are we changing it into a need? I mean, I think, it's okay, if we take it out since they've done a result about it and it was, it was been one of the small business results from okay, bye hi. This is similar. I think this was around. You know a side, Costa resiliency plan and stuff that they felt that it really has to do a little bit like participatory design like before. I do not know. I do not know what is happening now because, to be honest, we need open space with Covid-19 and they're going to close the park so well. Here's hoping on the 20th that there's something else that happens, but do you think we need that or we should just take it out for now. Carolyn I mean generally is an important request, but I do not know if it's a district need for 2022. Maybe it is, you know it's a bound of contention because CDC and the contractor that they're using are promoting an arts plan for the fencing as they destroy the park. So you know, depending on what happens, we'll see that they basically have it. They apparently took this to heart because they've included it and it's part of their destruction plan that they're proposing to have art contests, involving neighborhood artists, school children, etc to design art to go on the fencing as they destroy the park. So I really think that we could delete it right now. Okay, so, let's delete that. I think the next point we can keep, because it's an important one in the long term, but the last one I would just move higher up, because it was more along the lines of the first bullet point. You want to move it up yeah. I would move it like probably point number, three or four figure out what it goes after yeah it can go even too. What do you think was it tariq who no, it was Thomas who suggested it? I think even number two. What do you think Thomas? I mean it's important, but we're also dealing with that and the other committee to the Hs hm. I mean it's a valid point, because there are a lot of artists who do work with us, so all right, yeah. I, like it third, okay right now. It's second perfect! You want me to move it again. No, that's fine! Second or third! Second, is fine. Okay, it's important now! I know it is and it hits at something the city has to do. They have to fix the whole education system, and so this is important as Olympia knows, right and Susan, so pretty good work. Folks, okay, do we need to you said we do not need to move to adapt or do everything we just finished the job. I think what, if I recall correctly, you need to send it to Susan, but the actual approval of it will come at the same time as that we do the budget priorities, which makes a lot of sense. In my understanding do not we send this to economic development and they vote on it. Oh probably yeah. No, it has to go to economic development and if you all think it's ready for September, I think we can, but I think we is it. I mean Tariq has said we vote in October, but I do think that we, I think Linda is also right that, like it's adopted all together in October with budget exactly right. Well, they have the they have public budget hearings that people will come and testify that will impact on this. That's in September. I think it's usually the end of September first week of October yeah carolyn, it's up to you as to whether you think this is in the shape that you want it to be presented to economic development for September or, if you'd like to October, pretty much tailored it down, and that you know that we need it to go to economic development for September vote so that it can be presented for the full board in September and presently I make a comment, sorry and I'm going to have to leave, but I've so enjoyed this. Thank you all, and would you mind scrolling down Linda to your first item and because I never saw the whole thing yeah and just that I had put in a language suggestion and I'll sign off after I say this, so you know. Obviously I usually lose it, I'm just a person in the community and that the city should create WPA style programs. I love that and Thomas's comment that prompted the Sec. What is now the second point is very innovative and I often find that's what's missing and in something unprecedented like the time we're in to push for innovation, to push for the change that we really want to see. So the Thomas prompted one is already suggesting something that would never have been thought of last year. So the first one WPA, that's the first thing I thought of in March, but to not to charge them with doing it, but to charge them with looking at cultural economies in a new way to revitalize communities and arts and culture reach like the way the lower East side used to be so we're kind of fighting to get some of the soul of our arts and cultural. What's the hey. But what about? If we inserted after cultural workers to revitalize their with that, I actually threw a word again and again, I'm just going to scroll up a bit that the city should urgently fund innovative research in collaboration with artists, I mean I do not necessarily mean it has to be that language, but something to say, look we're suggesting they collaborate with DOE, so the city collaborate with communities with community representative with community boards. I do not know what the answer is, but just not telling them to do it, but charging them to collaborate so there's more innovation at the local level from the bottom up. That's what we need! That's what the cultural plan, the people's cultural plan is proposing, so something that charges them. What if we just add in here collaborate with the community too yeah that would work and there might be a better wording. You'll come up with once you look deeper, but yeah not just to say they should do this, because that top- down approach is what's gotten us into this. Yes and it's terrible. Thank you. I'm going to sign off. Thank you so much good to see you all again and see you guys. Thank you. Susan bye, good night, okay, I think it's pretty good folks yeah. I just tightened up a lot yeah. You may do you know when you start thinking of this need and this budget request. You know you may make changes, but that's the whole point of doing them together. Right does there need to be a dash between much needed because they're yeah? Where is it? Oh here? Yes, it's yeah Microsoft is kindly telling us that, yes, they are okay. I did not run. I did not run any word. You know, cameroon, yeah! No, I know it. It's just and there's one other down here any and all new cultural that you've got underlined yeah. It does not like that. But what are you going to say, I'm going to say and put a slash. Would that work? I would get rid of any and just say: oh okay, let's do that then it won't complain anymore, right. There's. Also the note we never came back to about Lmcc. That's right yeah. Where did we put that note? It's in the bullet points. Oh it's in a bullet point all right, I'm not sure. Is it still there yeah here it is okay, all right, yeah and the other thing is cut. I think budgetary cuts it's underlining cut. It does not like cut that it well if Klutz was plural. No, that's not right. What is that? Maybe let Microsoft dictate your life? Okay, if you get rid of the that and put what reducing instead of reduced, that might take care of it yeah, you know you're letting Microsoft dictate your life and just change that to reducing. I actually believe we can get rid of the comment about Lmcc, because we do not need to find the solution. We just tell them the need. The need is that they establish that funding. How they're going to do it is up to them, or we can ask it at the budgetary request resolution this one I mean just we'll put it in with the budget request: okay and a period. Okay does not like this any better here right. It's just that it was missing a space, an okay. So is there a motion to forward this to the says we do not need emotion. We do not need a motion to do that. Nope, okay, general agreement motion is coming in October, okay, fine. I just want to make sure that there is not anybody else. Who has any other comments? I know that you know we tend to dominate the conversation. There's anybody else who has anything to say, maybe not okay, so I moved to adjourn the meeting. Is there a second to the motion? Do you need to do a wrong question? If everyone could sign in to the chat, I think usually for the zoo. That's what we've been doing at the other meetings. Is people put their name in into the chat, and that way we have a record. So, okay, I'm going to stop the chair, so we can see each other's faces again there. We are okay, great Thomas, which school are you with I'm at 7:51 m, one east? Fourth, between first and second avenue, so your district one or two, oh okay, we're making iraQ&As a district one. We should connect. We need to get funding. Yes. Definitely I have a four- year- old too, so I know the feeling that okay yeah they're pushing to the openness very unsafe school anyway. So the meeting is adjourned, but I could not resist asking you which screen you are.",
            "summary": "Because I do not know if everybody has to give it a shot: here, okay, so we're fixing to post the draft of the district We tried to reflect in the draft about the needs of the arts and culture.\nThis moment of crisis, it's even more important that extra funding, support and resources are given to these sectors, with special attention to local organizations that focus on the most impacted population by Covid-19.\nThe city should create a WPA style program to employ artists and cultural workers for the next three to five years, as impacted arts and cultural industries.\nThe city's annual budget has become more constrained, so support for small vulnerable arts organizations is not certain in Cd3 neighborhood, art, venues, libraries, community, gardens and parks provide local, often low- cost access to cultural programming, and arts and culture should be integrated into the planning of city projects such as designated arts and cultural spaces.\nIn new, publicly subsidized developments, the Department of Cultural Affairs, should follow the recommendations of create NYC cultural plan by supporting arts organizations that expand, promote diversity and inclusion in the cultural workforce and to increase language access for communications and cultural programming to reach broader, more inclusive, audiences and programs that support the cultural life of low- income communities.\nThis would include funding for latinx and people of color residents, artists and cultural workers and cd3, with particular focus on those in Chinatown and Loy. The city should explore incentives for developers to provide the low market rate.\nRentals phase for arts businesses and non- profits and city development should include the low market opportunities for arts, businesses and organizations, as was done for food businesses and Essex crossing financial incentives for property owners to provide lower- cost rental space to arts and cultural organizations would both lessen the number of vacant storefronts that can bite a neighborhood as well as benefit the arts.\nThe mayor's office of media and entertainment and DCLA should support a neighborhood level, trilingual data and communications platform for the many cultural spaces and projects located in our districts to share information on programs and learning opportunities, DCLA, the mayor's Office of Recovery and Resiliency, and the New York City.\nI think you know maybe not having this entire long list of priorities and figuring out like because the pandemic is such an extraordinary situation and it has disproportionately affected arts and culture.\nThat work in a district needs statement that number I do not think like, You know year.\nI. Think the bigger challenge is that you know DCLA did not reduce the size of their budget, And they're, still sort of committed to giving grants and funding from you, know, council or other places to arts and cultural organizations.\nNon- profits rely on City, Council, discretionary funding for their operations and for fy Fy21, which is what I believe, It says that later the council members that represent community district three receives significant budgetary cuts and then some of them are.\nYou know it will have a severe impact that way that drastic, I mean it just I do not know if it makes sense to include all of those specific pieces of information, because again not all of it goes to arts and culture.\nWe said many local non- profits rely on City, Council, discretionary funding for their operations and programming in Fy, 2021.\nWe could probably just take it out because we already said drastic right, but I think you could also take out the arts in front of organizations and put these instead, because it's redundant to have it twice, Right, here , I'm, taking arts out Mike in asking them to reallocate DCLA and other funding to balance this funding reduction to a district.\nThe funding for arts organizations is through DCLA through the city or through the lower Manhattan cultural council.\nIt has a lot of small, like lower budget community groups that do a lot of arts and cultural education and service, and those usually are the folks that are impacted by this kind of budget.\nIt can be also DCLA only collaborate with DOE and create grants for cultural organizations that are giving support services and after school services to you, know, public schools in our district.\nMy fingers on the wrong keys, should collaborate with d.o.e to create grants and funding streams for cultural organizations that provide support services and after school for the local district schools, cultural organizations that provide right, support, services, no crime or reason just the keys, just go where they want to go.\nWe want them to create a funding stream for WPA and to preserve the workers, because what we're hearing is the workers are either moving away or changing jobs, and if for the industry, the creative industry to rebound, we need to preserve some of our people.\nThat, I think, is a very fair concern that these people are not going to even survive, but the reasons they're not going to survive is if we do not do anything about the rent, because it's just you know they are expected to be paying the same amount of renting, but those have been sat down from the city and they have no ways of generating income.\nThey're sort of the whole committee agrees to them, but there's not even You know you do not not even have a resolution to approve them, but I just feel that if we continue having general comments, we're not going to be able to do the work that we need to do, because the text is not there yet right.\nOkay, and so far today we have tati who's, saying that some of the points that we brought into the district needs statement could be drafted into a resolution and removed from the district So. My comment was actually related to the to like a specific point about the district needs that might fit in, and I was thinking about the the cultural plan.\nMaybe I do not even know if that merits like a discussion about where the funding would come from for this sort of stuff So we want to start with the first paragraph suggested edit Olympia.\nSo somebody just said that we should also add that the pandemic unemployment benefits are set to expire in January They, constantly change those deadlines, but I- think they're set to expire sooner than we know that artists will be able to go back to work, and we need to do something about that.\nThe only fact that what we're trying to say is you want to preserve workforce, because our city agencies have a way of preserving industries, and that means they give grants to the businesses and the organizations, but they do not understand that those do not always arrive to the workforce, So that's why the rhetoric here was you love the creative industry, but you need to fund the people who fuel the creative industry.\nWhy, New, York City cares about arts and culture, maybe not necessarily why Community board 3 cares about, at least from my perspective, arts and culture, even though it is connected to tourism for sure I think what is important for cd3 is that, even though the industry wants rebounds for three to five years.\nHowever, I think it's that artist and cultural in community district 3 are integral to the creative capital of New York that fuels the city's tourism and economy.\nThat first paragraph speaks to the points of the specific programs that we'd like the city to fund.\nPeople of color, and I do not even know that it's we, I, think what perhaps it's, that it's arts organizations that both serve and represent.\nI. Think maybe the need is that, because of the particularities of venues and non- profit organizations.\nI think there is a connection, as Linda pointed out, between understanding that arts and culture is like the most.\nRight, besides, like general small Business in New, York, City, and very much so in our community board area, because there are so many cultural organizations, small, theaters, and I think you can certainly say.\nWe know specifically that there's a program or funding that's needed, but that there should be funding, That's, specifically targeted towards the cultural sector, because it does make up a significant share of the city's economy.\nI do not think it's relevant to today's time, right now, with the changes that they have integrated into DCLA and how they're operating the programs now that they require that, in order to receive city funding that you have to have a diverse board.\nCultural is not just DCLA right, So I do not know if I think this ask of this like bullet point of mom could be a little bit.\nYou may do you know when you start thinking of this need and this budget request."
        }
    }
}