{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB1",
            "channelId": "https://www.youtube.com/channel/UCZAWa1UvCXDqD9pBPDAqQ0Q",
            "title": "10/21 Executive Committee 2020",
            "publishDate": "2020-10-26",
            "shortDescription": "10/21 Executive Committee – 6:00 PM\\n\\nLocation: live Remote Meetings - Https://Live.Mcb1.Nyc\\n\\n- Capital And Expense Budget For Fy 2022 - Resolution\\n\\n- Warren St Cargo Bike Corral - Presentation By The Dot Freight Division\\n\\n- 52 William Street \\Temporary\\ Shelter- Report, Discussion And Possible Resolution\\n\\n- Committee Reports",
            "lengthSeconds": "2:45:19"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB1",
            "normalizedName": "Manhattan Community Board 1",
            "twitterName": "Manhattan Community Board 1",
            "youtubeChannelName": "Manhattan Community Board 1",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCem-EVlcjv8dPUETrVMt2yQ",
            "twitterHandle": "@CommunityBoard1",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "Mszdq4hXBbk",
            "fillerWordCount": {
                "uh": 202,
                "um": 251
            },
            "readTimeFullTranscript": "89 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "bike": 63,
                "space": 61,
                "cargo": 53,
                "bikes": 45,
                "street": 40,
                "loading": 39,
                "parking": 37,
                "streets": 31,
                "traffic": 25,
                "foods": 24
            },
            "wordCountSummary": {
                "bike": 21,
                "space": 21,
                "cargo": 17,
                "bikes": 16,
                "foods": 14,
                "parking": 12,
                "loading": 12,
                "streets": 9,
                "street": 8,
                "deliveries": 7
            },
            "fullTranscript": "And we are now recording welcome everybody. Thank you for your patience at 6:10. This is the executive committee of Community Board, one in Manhattan. My name is Tammy Meltzer, I'm the chair of Community Board, one for our executive committee. Today, we've got a fairly robust agenda. I see we have capital and budget expense first, but I'm going to hold that I'm going to allow a Warren, Street, Cargo Bike Corral presentation by DOT. If they are all here, we're going to start with that, then we'll go to 52 William we'll do budget and capital expense and then committee reports at the end. If there's any highlights yeah good, perfect, so solution can we get D.O.T? We have sherry gold here, who's part of the DOT program that I think is piloting this, but sherry. If you would, let me know who else I should pull over into the panelist section is Jennifer from the Manhattan office. I do not see Jennifer either Jennifer. I do not see either no okay, so Eugenia Tang and Jeremy Saffron would also would be leading the presentation all right and I'll keep for both Jennifer Okay Jeremy Eugenia are both on yep they're on okay hi yeah. So it's going to be oh yeah. It's going to be kimberly from the Manhattan office representing us tonight rather than Jennifer. Is there a kimberly listed Supreme, Court, okay, great so which one you would like to have their presentation? Privileges? That's Eugenia! I think sorry, I tried messaging. You guys come on okay, Jenny, I'm going to pass over the presenter controls to you sure, okay, hi everyone! This will be a brief presentation. My name is Eugenie Tang. I'm a project manager for the movie unit at DOT, happy to be here to present and update you about our proposal for a cargo bike corral to be called mid block on warm street in front of the in front of one of the exits of whole foods between West Street and Greenwich Street. This here is an image showing the cargo bikes operating out of the whole foods on Houston Street, using the space at the curb without a cargo bike corral. But just like this location, whole foods on Warren Street is working to use cargo bikes for their local deliveries as a pilot participant they can load unload and stage your deliveries at the curb, but having a dedicated space with cargo bike rails can improve safety and efficiency of their overall operations. Oh junior, if I may interrupt real quick, so Eugenia has a whole presentation for us. Some of you may have been in the audience when we gave the presentation a couple of weeks ago to to the committee how much new? How much of this do you want us to present? We can. We can just tell you what we've done since we last met with with CB1, or we can go through the proposal in its entirety. Whatever information you need to make your decision we're happy to provide, I think, because not everyone is on our transportation committee and you're looking for a resolution potentially from us that you should go for all of it succinctly, but all of it all right sounds good. Eugenia go right ahead, sounds good. Okay, so two ago we had presented to the transportation and street activity permits committee about this proposal, so I just wanted to give a brief update about what to those that were there, but also for keeping everyone up to speed as to what we've been up to the past two weeks, so we were able to get contacts for the school nearby Ps234, the residential buildings, transportation alternative and by NYC, to send out an email to inform them all about the project. With a letter of notification, along with a copy of this presentation, we were also able to go out onto Orange Street. To do an in- person. Outreach got to speak, got to speak with a couple of folks and left hard copies of the letter of notification and also the presentation as well. Last night, we also presented to the bike advocacy groups in the the community bicycle working group meeting where transportation alternatives and bike NBC was also present, as well so they're aware of this project. So let me jump right into the presentation now, and this is where I'll start off by giving a brief background of the of what the commercial cargo Bicycle pilot program is and then I'll talk about what we're proposing to install as a new cargo bike corral through the bike corral program to improve the operations of the pilot I'll then walk through the proposed location and design of the cargo Bay Corral and talk about some of the next steps. So a bit of how we got here is that, back in December of last year, we held a manual press event announcing the launch of the commercial Cargo Bicycle pilot program. This pilot allows companies to partner with DOT and making the switch from using the typical trucks and vans to using these zero emissions. Cargo bicycles for a safer, more sustainable enough, an efficient way of delivering goods in dense neighborhoods like in lower Manhattan. So we launched a program with Amazon, Dhl and ups with about 100 bikes at the time and have since grown to now, also have fedex with technology and npd logistics on board as well. So now we're looking at over 200 bikes that are currently operating in the pilot program and it's continuing to grow. So we had initially stated that this would be a six month pilot, but it's been extended. This program is managed by the free mobility unit in DOT, but we work very closely with other agencies and divisions and teams. So we work very closely with NYPD dot's parking division, commercial Bicycles unit and safety education team to help run the pilot smoothly. Participants of the program are given five guidelines, one of which the guidelines is that the participants of the pilot can load unload and stage our deliveries at the curb. Wherever commercial vehicles can but oftentimes you'll find that these spaces are all parked up. So installing a cargo White crawl can provide a dedicated space to improve and expedite their operations safely, and some of the feedback that we got from participants already is that the is that being able to safely get access to occur plays a huge role in their delivery. Cyclist's operations, a newly designed cargo bike rail can be installed through duty's bike corel program, an application based program to provide increased by parking capacity at the curb using these bike. Racks shown in the image below these bike rails are installed, where there's a high demand for bike parking and where sidewalks fees can be limited. So this sorry this can help alleviate issues like parking on street signs, fences and trees to keep the sidewalk clear. So here we're looking at an aerial view of orange, with the curve regulations shown in color- coded blocks, they're representing them standing anytime, the yellow, representing the truck loading and the blue, representing the bus stop. So what we're looking at is installing the cargo Bike rail in front of one of the exits for whole foods, as shown in the black dashed line. So again, this will be partially occupying the truck loading zone, where the pilot participants, such as whole foods, is permitted to load, unload and stage their deliveries at the curb already, but having dedicated bike parking available with the Cargo Bike Rail improves safety and also provides free, convenient and short- term parking for the public to use we're taking a closer look at this drawing here to show you an example of what the Cargo Bike rail could potentially look like is that the space will be marked out with bike racks, flexible ballers and markings in the outside lane. These cargo bike rails can fit up to spikes on each end, secured on the bike racks and have room for multiple room for multiple cargo bikes to fit in the middle. The difference between a cargo bike corral and a traditional bike. Rail is this additional space allowed for cargo bikes to load, unload and stage their goods safely in the space which are which are not allowed to stick out of this marked out space or block the travel lane, so they can either park parallel or at an angle, to the curb, depending on the dimensions of the bikes and whole foods, will be maintaining the cargo pipe corals to ensure that they'll will be clear of snow and debris and report derelict bikes. The next steps to this process here is that we're hoping that you can all vote on this since we're cutting it close to the end of dot's implementation season and as the holiday season is quickly approaching, we can expect an increase in deliveries, so we're hoping to install this fairly soon with continued monitoring and observations. Thank you happy to answer any questions. I have a question. This is batmoor. Maybe I misunderstood. So this bike corral is for whole foods so that they can load and unload for their deliveries right, but the public can use this as well. It's not it's not reserved for just them, but it can help facilitate and provide additional parking for all to use, so how much of the space is allotted to whole foods and how much of it is public space for bike parking? It's more like a first come first surface, so it's not like a servant. Space is reserved for whole foods or okay. So whole foods is a private company that makes a huge profit, and so a city street is going to have part of its space they're going to get for free they're, not paying for this parking right. No, that's correct, they're, not paying yeah, so I I'm not. I mean. Maybe it's me, maybe I'm crazy, but I do not understand it's like placard parking. It's like the whole thing it's like taking over all of our space right. Are we giving city streets up to a private entity? I'm not sure. I understand that yeah! No, that's totally fair they're, a participant in our in our cargo Bike pilot program and as part of that, our goal is to switch over from trucks switch over from vans and other polluting vehicles. That add vehicle miles traveled and create safety problems on the city streets, to delivery by cargo bike, and in order to facilitate that, we think one of the helpful tools is to have space that they can load and unload those vehicles. In doing that, we also we also get space for the community and we do not think of it as like. Oh seventy percent of that space is whole food space and thirty percent is for people it can be. You know it like Eugenia said: first come first serve and the racks are added bike parking for either shoppers or community residents. Or what have you? I think one of my concerns, if I'm hearing Pat correctly is first come first serve is God Bless. Whoever coughing is an interesting dialogue, but Amazon is there 24 hours a day so effectively? There is no first come first serve, it is privatized. Well, they're, not there I'll make a quick correction they're, not there 24 or 7., though you know point taken about them being there probably the most. But you know if they start they do deliveries before 7 A.M, so they're out doing deliveries between 5 and 7 and they deliver as late as I think, 11 or midnight. So for most part, and then I would assume they have to park the bikes there right, while they're working. They do not get to store them overnight in this space and that's a very clear aspect of our guidance to all pilot participants. They store. They have to find a place off street to store their bicycles overnight, but in the process of loading unloading and staging they're able to use this corral space- and you know it just assists in making bikes a worthier option to make some of these deliveries, which you know during the pandemic. There is a high demand for grocery delivery, with the with the grocery store crowding issues that are present the lines that can form it's. Just it's just another option for people who want to avoid appearing in person to get their to get their goods, their necessities, they're, currently occupying the sidewalk and so they're already able to you, know, they're already able to have their operations in the public right- of- way. This is moving them to a place where they are less in the way for pedestrians and where their operations can be smoother, and also, if you see the diagram of the setup, the space in the middle does not have as far as I understand it, anywhere to lock their the bikes up to so the locks are on the sides, so it's a little bit of a distinction between like the actual operations and where people can lock up their bikes on either on either side. Just I have forgotten how to raise hand on webex. I know on Zoom. How do how does one raise your hand, participants tell you what I tell you. What bruce I promise I'll call on you. It goes Pat, justine, Paul, Mariama and then okay, yes, the other part of my question is so I mean I have no dog in this fight because I do not have a car, but it's taking up even more it's taking up car space, so people who live on that block are losing another if I'm not mistaken, another parking spot. Is that sorry, a quick point of correction? And you know it's a it's- definitely a valid it's. It is a curbside space, but that current regulation is a truck loading zone so yeah. Instead, it is not a daytime space available, but it becomes a space. That's 6, P.M right what you're losing so what you're losing and all day on the weekends? That's right! That's right! That's right! So you are losing space but you're, providing potential spaces for more folks to park bikes than the space that there would be allotted for vehicles. Sorry that that, with the conversion from vans, which is part of the current operation at that store to cargo bikes there, you won't see vans. Amazon vans parked there occupying the spaces, either during the truck loading hours or afterwards. So that it is freeing up space that used to be occupied by vans to space, you know to a smaller space, more constrained space, because bikes are smaller right, yeah. Well, how many? How many, how many vans are being replaced by bikes and is the total length that you're talking it looks like it's five van five car spots? Is that accurate, pretty much yep that's correct, and is there no way to accommodate the cargo loading bikes during the seven to six hours that you have seven am to six pm, while still being able to return that space back to public use for nights and weekends? So I think I think the answer is yes, but the option is that they as part of the pilot, the participants, can load and unload their bikes wherever commercial vehicles can load and unload, and they can do it in this truck loading zone once you know they're starting to switch their operations over, but this space is a safer space. We think to do that operation. It's more well defined! It's more well understood by various road users. It adds parking for bikes in the community and overall, I think it's an improvement on just leaving at a truck loading zone and having that operation occur more haphazardly in that space, and that is a permanent, build out. I'm going to go next to Justine, just confirmed that's a permanent build- out, so that becomes a Bart a bike loading spot period as long as they need it as long as they're doing delivery as long as they're active, because there is no, it then is no longer and a loading zone quote unquote. Well, it's a loading zone for bikes. I guess you could say but yeah permanently, there's no finite hours. It's not like it's seven to six. It becomes a 24-hour bike. Storage, correct, that's, correct and permanent in the sense that you know we are, we would install it using. You know our materials, but those materials are not made out of concrete those materials could, after monitoring and after you know, continued observation. If we, if we really thought it was a failure, it could be ripped out just being your next thing. Would you mind if I put your hand down? Oh yeah, I'm sorry, can you do it, I'm putting mine down just like you can do it yeah, so there it is. Okay, justine go for it! Thank you. So you say it could be the car, the cargo bikes or other bikes what other bikes would park there. I do not I'm confused. I mean me on my regular bike that I'm going to write. Why would I park there or what benefit is it to me to park there versus something else? That's safer yeah. I mean it's up to you. It depends on. I guess if this is closer to what you're trying to go to it. I mean that in that these the racks on the side here will look like racks that you would park your regular bike against. So no I mean when I say safer. I guess it's. I guess it's safer from traffic because it's somewhat removed, but it's not from being stolen, so right, absolutely yeah, all right so yeah. I do not see the benefit to the community, particularly because you can park your bike any place from that regard and then so you're losing five parking spaces. I would reiterate that that's an issue, and then I conceived my time. Thank you. I think Mariama is next, so I agree with Pat and made a similar comment at the previous meeting, which is why I was also one of the members that wanted to make sure that the community really had an opportunity to attend and to hear this presentation for themselves. I live on the east side and do not think it's fair for me to necessarily decide what they would prefer, but do agree that a loss of parking spaces in lower Manhattan is really a travesty, because we have very few. You can go to other neighborhoods, even neighborhoods that are considered to be more heavily trafficked and find spaces that are alternate side. You know they're all over the upper west and east sides, and but down here we have very few spaces that are parking is available all day and we have very few spaces that parking becomes available at six. In most cases, if it becomes available at all, it's seven so to be seen you're going to take five or six. It was six at the last meeting of those spaces away from residents who may need them whose children may be you know going into the downtown community center. That's what I used to use. That's how and that's why I know the traffic rules over there. Although I look on the east side, I would have to park to pick up and drop off my kids or to attend some sort of something that they were doing there and if we lose those spaces and to the community and that's not their preference, I would be. I would have a very difficult time voting for that. So if I do not hear from enough people from outside I'm going to have to abstain on this thing, because I do really see a problem with taking potentially from citizens, civilians, taxpayers- you know many of whom are back at work and then they come back. They come home and they can't find a place to park, and it's so that you know one of the richest people in the world or the richest person in the world. At this point, I believe can have free parking. He can afford to build a bike rack, but you know, or whatever else is necessary for his customers to be able to park bikes or cars, he should have built the garage when he was putting that place up. So that's all I have to say thank you thanks, mariama yeah. I know I know that it's not per se a question, but I will say that we did the in- person outreach as requested at the last meeting, and we went door- to- door on the block. We talked to the the buildings on that block. We talked to the Manhattan youth center. We sent we sent letters and the presentation to the school, and I think that the reception was generally positive. Kimberly can weigh in further, but Manhattan youth center, especially, was saw that the changes is a positive change. The residential buildings did not have as much direct feedback about this, but you know, I think that they were. They were happy to be notified. Okay, bruce. I think there was somebody before Bruce, but all the hands went down, so I apologize whoever it is I'll get back to you. It was Paul. Ah Paul, okay, sorry Bruce, you got ta wait. Paul goes first, it's fine! Thank you, Paul, just a couple of questions, so the current rigs for that space are what no standing Monday through Friday 7 A.M to 6 P.M trucks, loading and unloading. That kind of rig Eugenia. Could you go back? Yes, I think the answer is yes. Yes, okay, so, and is there no concern about trucks, double parking on the street if they lose any loading zones on in that area? Is that something you've accounted for? That's a very fair question. We've done observations on this block. We feel like this. The loading zone is somewhat underutilized and we also. We also recognize that, in switching over from vans loading to to bikes loading that the space that was needed for truck loading, you know can now can now be partly taken for the bike loading, because it's a direct replacement of that same operation. Did you also say that they're already parking in already using that space in the roadway for bikes rather than trivens? Well, there are not. There are not bikes directly operating out of the Tribeca location, they are, you know, and any ones that you'd see here are being dispatched out of Houston Street or the Chelsea location, but yeah. The operation now is vans and walkers and the vans. The idea is to replace the vans with bikes. Okay I'll leave it at that. Thank you first you're. Next yeah I have a few questions. First of all, is this a fade accompli and despite a resolution, one way or another you're going ahead with this as D.O.T usually does I think, Sherry and Kim if you want to chime in there. So typically, the bike corral program does require that the Community Board approve vote to approve. So the answer would be no thank you. Okay and that's good, and so, as you may or may not know, when Officer Lee Rick Lee was our community liaison from the first precinct he negotiated is a great guy who's retired. He negotiated a deal with fresh direct that gave them unencumbered 24-hour usage of the East side of West Broadway between Leonard and Franklin and 24 hours a day. They have a series of trucks parking there spewing diesel emissions and the refrigerator trucks are on from which they disperse food to the neighborhood. That's a private entity. They have never paid for that space. We essentially gave them a free warehouse on the street. They took over the street and we've given them a free warehouse for eight years. I've never understood it. Every other small business person has to go out and rent a warehouse or a garage we're doing the same thing now for whole foods. I do not know if either of you lives in the community and really understands the issues here, and I'm saying that as a disgruntled and angry resident of worth street, where we've been suffering for years. So are you aware of the fresh direct situation? For instance? Are you aware of this? Not specifically, but I understand where you're coming from 100. You know fresh direct trucks are sort of those these mobile warehouses as they treat them. The point about using the street is well taken. I think one of the things that we're aiming for here is to take vans and trucks off the road. Actually, this enables the cargo Bike operation and cargo bikes are obviously non- polluting it. It's not as if the operation is created by the addition of the space. The operation already exists, but it's accomplished using more polluting vehicles than this cargo bike corral would would switch us over to. I think that that's a net I would, I would consider that a net environmental benefit. You know we're here for in part, so you can decide whether it's a net community benefit. So that's really, I think what we're looking for well, that the latter sentence is, I think, a fair analysis. Everything before that was theoretical and, to my mind, tautological, but you're, trying to make your case since the zero vision program or whatever it's called. You realize that there have been more accidents than before. I would argue as a pedestrian and a driver and a friend of many by bikers- and I mean mechanical bikers, not motorcycle. Bikers the streets have gotten more dangerous because they have not been widened. New York City was not laid out that way, and there are so many uses that DOT is trying to provide for the streets now by and large, where there are all of these multiple uses: commercial, vehicular buses, bike lanes, New pedestrian areas. It looks painted in such a way that it looks like someone on psilocybin actually did the layout and it's so confusing and dangerous with various modalities, interacting with each other, and this is just one more. I do not think no offense to you. I do not think either of you really has a granular sense of the neighborhood. Let me give you one instance, one instance that does not relate to this people. Three people have their hands up beside you, Sir Succinct, please. I think we have had issues with forestry. For four years we had one guarantee from D.O.T. There have been so many changes at DOT that over these years of work that there's no institutional continuity. The new people do not know what the old people promised in writing and I just I just to me. This whole concept is objectionable and it's not because I necessarily drive more than anyone else. It's just enough input on our streets. Thank you. Thank you. Bruce I have Susan Michael Franco. Then I have a question. If it's not asked by either of them, then we'll go to deda and members of the Public Susan. Take it away. Okay, we'll go to Michael Franco, we'll come back to Susan sure. Can you guys hear me? No, I yeah. Oh there you go Susan, oh, go for it, I'll go for it! I'm going! Listen to me! The trucks and the vans are still going to come. It's disingenuous who, as reporting to us, to say that and I take offense with it. I just want you to know it's not going to happen. These cargo trucks delivered they deliver in front of my building instead of bikes, because they're delivering during this pandemic time tremendous amounts of groceries so to tell us that the trucks now are going to be in the in a lane where cars come and go that this is going to avoid. That is not correct and we're not silly and our streets are crowded, and I find this I just I I'm very offended by it. That's it okay, we're representing the facts. I think. As truthfully as we can and the you know, the operation will switch over from Van to cargo bike that that's as much as we know and yeah. I that's do you have an agree so before I go to Michael and then Betty and then deda do you have one of the things is that building that whole foods is not has a loading dock, they used to load their vans in the loading dock. We know this because there are several public bus stops right over there and they used to have the loading bands all over want to call it Murray Street. That's there, I'm not certain. If anything. Other than convenience purposes, they chose to move their whole operation, or maybe they do not have to pay for the loading duct, but there's some reason that they stopped using the loading dock for the building that whole foods is in and focused on the street. So that's a question that I'd like to understand. You know why are not they using the loading dock for their vans if it's simply because it's easier to where they have it currently on Warren Street? Well, then, we've just made their. I think we we're using public dollars to enhance the profitability of a private company while removing public assets. I am all for cargo bikes. Do not get me wrong. I think it's an amazing service. I do have an issue with how it may how it is done, and why, if this is the project that's being done, why are not they using the truck loading Zone right now for the bikes, there's nothing preventing them from doing it? Is there that that's true, they can use the truck loading zone according to the you know, the regulations in our pilot, the cargo bike. Corral, though, is a safe, more protected space, and that would really unlock the cargo bike operations at this site for them, and do you have a guarantee that do you have a guarantee from them that they will no longer use vans or allow their truck deliveries on that street? We have a guarantee that the Van based deliveries would switch over to cargo bike in November. If we could get it installed, that's correct. Do you have a guarantee? They will not allow their trucks because they no longer have a truck loading zone to park double park on Warren Street that question we have been raised specifically, but if that, if that would be desirable for the board, we could ask that question. Yeah, okay, great just to clarify. Also the truck loading in front of their building is not specifically for them right. There's truck loading for that longer length and it's not specifically designated for each business right and it can be hard to tell I mean in the sense that the vehicles are branded, it becomes pretty obvious, but we yeah. We fully understand that request. As far as far as the loading zone or the loading bay and the loading dock is concerned, they've stated that is primarily for incoming goods and there are enough goods coming into the store currently that it is essentially completely occupying the loading dock, and there are large amounts of goods that need to be refilled in store, and then the outgoing goods and outgoing food deliveries of which the volumes have greatly increased, would be at least partly accommodated by the corral, along with the other uses that the corral allows for. Okay. Moving on after Susan was at Michael, then Betty Vendetta, great thanks tammy. So one thing that came up in the conversation that we had in our committee meeting was that the office has received complaints from residents complaining about those vehicles in that voting zone. So this proposal was viewed in a way that it could possibly address those concerns, and I was wondering if lucian might be able to elaborate on the complaints that he has gotten in the office. And then I was going to just ask D.O.T to see if they heard any of that when they were doing their outreach, so hi everyone. This is lucian, I'm the district manager I in the past, I have received complaints about the Amazon delivery bans idling in the street in the area and in fact I had to call up through you know, multiple different numbers of through whole foods, trying to find someone who I could speak to with decision- making authority to really register an actual complaint and try to work with them to reduce the amount of idling which they had tried to do, and it seemed to help. But the absence of complaints is by no means evidence of the issue disappearing completely. So you know I can't say for sure that they fixed all their idling issues, but they certainly did for some for some stretch of time but vans any vans. If there's no access to the curb will likely be idling and unfortunately, the depb Middling Bounty program is not pervasively used enough to cause enough economic impact for people not to do such a thing. But but I do expect any bands that are being used for deliveries to idle because we rarely have curb access in this district. Great thanksgiving. Thank you Luke. Did you guys hear anything about idling concerns when you guys are doing your outreach or did that topic come up not directly Eugenia? Do you recall any of any of those instances? No, they were mostly just positive feedback from for having additional bike parking available, and one thing I'll say is: maybe we can get as direct aligned to residents as we as we would want to? I mean the residential buildings. You go through the person behind the front desk, the building manager, and you know you get that you get their opinion, but perhaps not the actual occupants, and hopefully some of them we could have sworn with. I could have sworn. We asked you to have a notice sent to a task: the management company, not the management company's perspective, but to email, the residents in the building we sent that out because having just the okay Alrighty Michael, do you have any other questions or comments? I do have a comment but I'll. Let everyone go around okay, Betty. Thank you. I want to remind community board members that vision, zero and the New York Climate Leadership Act are real and have goals that we need to meet. In order to do that, we need to reduce the number of cars and other vehicles on the road. We also need to deal with with vision, zero. We also need fewer cars and more sustainable transportation. The reality is only a minority of people have the funds to afford their own personal vehicles. So I'm speaking about speaking about who deserves to own the road and who does not car owners is a big question. Why do they get space and nobody else in the community does so, let's not act as if we're talking about equity when we're talking about car owners getting their personal spaces preserved for them, because it's not exactly true in my neighborhood, yes, they're people with cars, many of them have their own parking spaces and do not use them around the neighborhood. What they want is fewer. They want less pollution, so they would like the zero emission bikes they're. Very for that. We also would like to have smaller vehicles making the deliveries in our neighborhood. So in fact the benefits are much bigger than just who does or does not get them on that particular stretch of Warren Street. It's also who's making deliveries and puts up with them around the neighborhood, and I think, there's a very big push for it. Let's get rid of the vans. Let's get rid of the staging trucks that other companies use. This space is not only going to be used by whole foods, but can be used by other companies. I'm hoping bed bath and beyond will take the cue and follow it since they're right there as well, and those who said why would locals use it for parking. Well, I have a few neighbors that take their cargo bikes with their kids everywhere and they shop and, yes, they do park there because they do shop there. So there is a demand from local and they should not be diminished as insignificant, because only cars are real transportation. Bike riders would like the same respect in our neighborhood. Thank you. Thank you betty, but that brings up a point betty that is not satisfied. In this conversation. There is absolutely no way to guarantee that the public has bicycle access. If everything is on a first-, come first- served basis. It is basically a private corral for the app for Amazon unless the bike racks that are at the ends are specifically tailored for public use only and they are not allowed to be used for Amazon they're asking for a bike corral. The only way to ensure that the other bikes are not attached is to ensure that there is publicly accessible bike racks within here, because quite frankly, first come first serve, does not work when Amazon delivers 20 out of 24 hours a day, and is that something kimberly and anyone else from the team has considered a way to guarantee public access yeah. So absolutely our bike racks, which will be at either end of the overall bar corral cargo bike. Corral are public temporary short- term bike parking for the public, so the center space is meant for the cargo bikes and also open to the public. So just as mentioned, if a person a resident, owns a cargo bike and wants to park there, they could as well, but the intent is that the whole food cargo bikes would fill up the center space and then the bike racks at the edge are meant for the smaller everyday cyclists. So it's not that you know there's no signage. We can't say you know. This is only used for a particular group of people, but the cargo bikes can't actually park at those racks, they're, not big enough, so the intention is, it would be for the smaller, typical bicycle writer. Thank you Sherry also. Is it? Is it safe to say it's a request of the board for us to instruct whole foods to have their people not attempt to park in the racks on the side of the cargo bike? Corral? Yes, okay and it's quite frankly. I also think that there's no way that any of us should approve it unless you have in writing an agreement from whole foods that they will not allow their own vans or any of their deliveries for the store to double park on Warren Street, and I think, that's completely fair, because what this is not about a general cargo space for multi- delivery companies. This is a this is privatizing a section of the public's way. I hear what Betty's saying, but from 6 p.m. Every week, night and weekends the space is used by the public. Yes, whole Foods man's are there, but the space is used very widely by the public. That's right! It's and it's to say that you know whether that member of the public is lucky because they got to park there and it's a problem because then the vans are double parked. Well, I get that, but you're now providing a very fiscally solvent company with a solution that they needed for a use that they did not anticipate in the private way while taking stuff away. I'm you know if it was something that you said to me during seven to six Monday through Friday during existing loading times, that they were going to get that and on the weekends. If there were space that you know, they'd have to carve it. That's one thing, but that's not what this dialogue is. This is about changing. What I'll put it to you. This way we have to fight to find street available access for the restaurant tours right who could not afford anything? This just does not seem to be an equal thing and I support bike cargo because I think it's a really good thing. I just am not a hundred percent on the privatization of the streets and allowing you know they should provide their own employees for parking right for their own bicycles. Their employee bicycles should not be parked to assign or in these bikeways, because otherwise, then again, there's no access for the public. So I would say if we go down this road and we choose to say we're going to approve this, it has to include a it's contingent on a letter from whole foods and Amazon. They will not allow their vans or any deliveries for the store to double park on Warren Street, and they will not monopolize the bike racks to allow for public uses and with that, I'm passing it off to deda. Who is next hi Dada hi? Oh, wait! I'm trying to get yours! Okay great! I just want to say that I think there's a different way to look at this, and this is really those racks on either side of this are going to be a huge community benefit people who want to go with their own bike to whole foods who now might have to search high and low for something to lock to some sort of street sign some sort of sidewalk bridging they're going to have a rack there, that's going to be a huge amenity for the community, it's something that can be used by many people like the space before that could be housed only five loading or unloading vehicles and then possibly five. You know car storage bots now this can be for many more than just five people who are going to come and use those racks at the edge of this cargo. Bike loading unloading area, and this really in the time of Covid-19. You do not want cargo bikes on the sidewalk, making the sidewalk very crowded and hard to navigate and for them just to go in the commercial loading unloading zone with no protection, though that's also a little risky. So this is like the right solution to take them off. The sidewalk put them in that commercial loading unloading zone with protection plus a give back to the public that whole foods has to maintain, but yet they're not even going to be using those racks on the side of it, and that will be a huge benefit and it will be a benefit for a lot of people. So I think the community board- you know, has a chance right now to be a leader and to be very bold and to take a chance on something new and really just take that chance and see how it works out and be a leader. And I so thank you. Thank you all right, so I think everybody has spoken. Who wants to speak? We know that they ca that, according to their own routes, they can not go forward without a resolution on this. So there is a resolution that we can go through and do lucian. Excuse me before you get to May. I make a comment sure. Please do sorry. I missed you. Oh my gosh, I'm! So sorry, that's all right go for it. Is there any reason why that big sidewalk on Greenwich Street is not being utilized. There are several. If I'm not mistaken, there are several bike racks holders there on Greenwich Street, so in terms of people being able to ride their bikes to whole foods they can. They could do that. Space is readily available, but that's an extremely wide sidewalk, so you're all right, you are so correct. I do not know why they keep looking at Warren Street when it's very narrow and you have the kids from the school and because it's easier for them, oh yeah, well, easy might not be right. The right thing to do take a few more steps. That's a good question for D.O.T. The question is yeah in terms of that wide sidewalk. Oh, is it a preference that the cargo bikes Load and unload and stage on the sidewalk, rather than in the commercial loading Zone? Well there's more space over there, so you can navigate. You know, I think you it's not a normal sidewalk right. It's you, okay, yeah! I no! I was just phrasing it for the board. To answer I mean, I think you know DOT views it as a good behavior to encourage on street and in many places it occurring on the sidewalk can be viewed as a nuisance for pedestrians or whomever. So you know that that's part of the thinking- and you know that that's what we're going for with that and also like I just wanted to just add there are a lot existing bike racks on green street, which they are at full capacity. For years now, we've been getting requests from the community to add more bike parking, so we just saw this is another opportunity and to just go back with that. We're at and making sure that our sidewalks are clear and making sure there's more space for people to continue to add just more street furniture and more you know, sidewalks is something we're trying to avoid and then just to you know also what Jeremy was saying with just safety. We want to make sure that, with the cargo bikes constantly going on and off the curb, we see that as a safety concern again our focus on pedestrians and keeping them on the sidewalk traffic. I disagree with you with the amount of traffic in the on black those fight, the utilization of those bike racks because they're they are from when I've gone over. There they've been underutilized to the point where people can set up little booths there and sell stuff a lot of times. So I do not know when you walk by there, but that's what happens when I walk by there, but has there been any dialogue with whole foods because they're basically coming to us they're asking for the street and the sidewalk, because it's convenient for them they've not have to do any relocation on how they do their deliveries. Based on where their delivery infrastructure is, although you know they're they, pursuant to what Francis is saying, there could have been opportunities on the Granite street side because they have all that space and they have a space that they use for carts inside. So if people are not coming to the store as much and people are getting more deliveries, you know, do they need the giant room? Could they have figured out a way to redo their infrastructure, to utilize the square footage they have versus privatizing the parts of the street or and utilize still being able to do cargo because they can already do it in the truck loading zone? So there's no impediment to that. Have you had that dialogue with them? They've made it pretty clear that this would aid their opera operations and their switch over to cargo bikes. We do not know like to the extent that each square foot of their existing facility is being maximized, but you know a lot of a lot of the loading Bay operation is incoming goods and this is about outgoing goods, and you know the net increase in bike parking availability, whether or not the current bike parking on Greenwich is always fully utilized, especially with you know the nearby commuting traffic beating down. That's perhaps a separate question, but this certainly would be a net gain in publicly available bike parking spots: okay, lucian. There is a resolution that is up in the executive. I can either share it on my screen or, if you can share it on yours, the one that's in the drive tammy. Well, you got that. Would you mind? I have a quick comment. Oh sorry, I'm cutting someone off Hey pat did you want to go? If you have a resolution, can I call the question? I have a question. We're going to go. Colin made a motion to call the question we're going to have to show the resolution because there's already you know, there's been enough back and forth and dialogue and concerns just to make sure we've got everything. Okay, I just want to go. I hope. Can you say for the spot? Tammy. I'm sorry just give me two more seconds. I just I just want to remind people that we have a really contentious topic coming up next and we're kind of yep taking a long time here. Yeah, that's a good point. I would second Colin's motion when that's appropriate all right here we go so this is a a resolution that tries to incorporate everything. That's been said, so I'm going to go through it really quickly cora. Unfortunately, while people are reading Korra Lucian, can you unmute Quora or give me controls too hello? Yes, am I hurt? Yes, you are I'm from Canada this hi, just one francis said yes on Granny Street is a wide grand street. That's why sidewalks, but I just want to remind everyone. Delivery is already happening. I do not know the hours I do not live there. I invited the Ibn folks to attend. I do not know if they are in the public attendees, but I know the fact that delivery is already happening. They use that space. I do not know what company I did not pay attention, but regularly. That is the truck events. They are actually doing loading and loading and people like moving the boxes around. So I just want to point it out, and the second thing is still t okay to share whom you reach out to with the community board. That's it sure yeah we reached out to all active stakeholders on that block. We can definitely provide a list that would that would be great. So I think I have everybody's concerns in there, but actually one of the things I do add in there that there that the Community board has in one of the, whereas is that the Community board has expressed concerns about providing a private delivery area from taking public space to a private company. That is a concern. Okay, so I put in there the guarantees from whole foods because we will know. I still am not sure that I'm 100 convinced on the removal of parking, 24 7 and why this corral can't follow the loading zone times that are available. Does D.O.T have an answer of why that can't be sure I yeah and I apologize if this was not clear before, but perhaps it's the infrastructure of the corral itself that precludes that. Does that make sense with the flexible bollards and the bike racks being you know, you know obstructions for other vehicles to pull into that space and those things are permanently in the ground. Am I am I explaining that properly for you? It is, but you just said to us: it was not going to be permanent and if it did not work, it would be able to be removed, so that yeah, so those installations can be ripped out, but they are, they are planted in the asphalt in a way that does not make that space available to cars to pull in. Is there a way to do it as a pilot, a temporary pilot, so we can truly see the behavior that happens and what it is instead of permanent and rip out, which we have a suspect that if it does not work- and it does need to be ripped out for whatever reason we're going to hear back from the city we're so sorry, but we do not have the money to do that. That's a capital thing, sorry, no go just to jump in there. I think this is. This is the same as all of our other temporary projects or sip projects, improvement projects, the same types of materials which we regularly make adjustments and changes to when they are not working, how they should be. So it's not permanent in any way it's just markings and flexible delineators which, as you probably know, come out and have to be reinstalled regularly. So it's not capital in any way and removal would not be capital either. I think you can consider it to be a pilot in that sense. Oh, please, no more markings on the street. We're marked out. Okay, so does anybody have anything else that we would need to do on this? Just a clarification. It would be impossible to have night parking because of the way it's set up while it's comfortable, okay, yeah. So then no I'm quiet we are, we are losing the parking. There is no more parking there. It's six spots that are gone, nights and weekends. Okay, so I'm calling the question and lucian: can you roll call it? I could do that, I'm going to unshare the screen, so you guys do not see my voice. Give me one second or I can roll call it you can you can keep it up and I'll roll. I have to unshare the screen, so the hotel's, not on the public record, okay, Tammy! I need to see the resolution yeah put the resolution back up and I'll find a vote sheet and I'll call it. Okay, I think you got both sheets in here for exactly you. Do, okay, ready! All right! You got you got it ready to go yeah, I'm just going to bring this all right: alice, yeah, yes, Susan Cole, no justine, Kucha, No, Mr Sarah because of the first, therefore, because of the first therefore be resolved, I have to say no because of the first one yeah support supporters: okay, Tammy, I'm sorry alice. What is it too late? I feel like I just do not quite Un, you know get it all. I think I better best of staying here. I feel like I'm a little. I just have not taken on it. I have to say this business where we get the get the resolution in front of us in real time like this and have to vote on. It is very tricky, but I I'm going to abstain. I'm sorry! No problem, Paul, Goldstein, Abstain, Mariana, James, no Mr, Joyce I'll, come back to you, trisha Betty. Yes, so Patrick was off. No! Yes on the resolution. Oh sorry got you Betty got you Patrick Elizabeth Lewinson, Absent, Colin Mahoney, yes, purely because of bays and passion speech, Moore, no Britney, Wade, Abstain and Melcher's going to be a yes, because if they do not play nice, they said they could take it away. So we are one two, three four yeses, three abstentions and one two, three, four: five six no's. So the resolution does not pass an executive. Okay. I think I would recommend to DOT. If you can, we can certainly have a follow- up conversation if you'd like what I think the appropriate thing to do would be to have another dialogue with whole foods about size, shape, accessibility and see where we can go to make cargo bikes work somehow in that zone with maybe real estate from the front of the building. Maybe some of the loading dock, but not all of the fixed bases- and you know, try and make it work, so we can get some of the cargo bikes in there all right. This idea of it's going to prevent idling is illegal. I do not know if everybody's clear on that for more than five minutes truck idling is illegal, so the suggestion that putting in bike lanes is going to prevent illegality is ridiculous. We need to consider this, I think in the future of that's. That should not be a reason that is put forth as to why something should happen or not happen. Illegal things should not happen period right, but they so this is not going to solve it. I would, I would agree with you, and I hope that, with the existing landscape on the front side of their building, they can take a look and find a way to make the cargo work and maybe even working with D.O.T for a smaller footprint on the street bed. That's what I was going to ask the DOT, which has a big footprint, come to us to negotiate or ask or discuss collegially before tonight. This is the collegial discussion, my friend and we are collegially, saying that we like and support some of the concepts and ideas we do not like the particular sighting of where it is and so okay, we can go that way. Right, thank you. Does anybody else have any other questions? Okay, let's hit it, let's go to the next topic and Jeremy Eugenia Kimberly. Thank you all for your time. I think that we can make something work in that zone, maybe not as quick as you would want, and let's talk about coming back with a revised proposal. Okay, we look forward to more conversations thanks. Thank you all right, 52 William Street, so I want everybody to be caught up on where we are lucian. Can you pull up my letter? We, everybody knows what's happened so far. This is a letter that I sent to commissioner banks on October, 8th after the last meeting that we had and we I am really distressed on how the city has termed CB1 and the canvas they're trying to paint on us for several reasons. First of all, Pat mariama has done amazing work and quality of life with DHS and DSS coming to talk to us. They came to talk to us in Q4 of 2019 about permanently citing a new shelter somewhere in community board one and the meeting was very nice and they were very collegial and we said we would be open to working with them because we are dedicated to helping the people who are on our streets. So every time that DHS and DSS says oh you're, a bunch of nimbys and you just do not want anything. I want to make sure everybody knows. We have shelters in Community, Board one and have four decades. This is not a new concept for us. Ask anyone who lives over by northern Tribeca there's a shelter who's been there for decades. We have some other shelters that need to be left nameless for purpose and their address is not known and that's a great option that they have in our community as well. We support many of the shelters in our. We have many social services in our district. Downtown alliance has partnerships. So the idea that we do nothing- and we do not want anything- is fairly insulting to community Board one. We are no strangers to what it is down here. Generally speaking, the colonial streets and the early industrial grids do not support the social distancing. As we know, we've had discussions about our district needs, and things like that. So I sent a letter to commissioner banks and lucian can scroll down a bit basically saying you know what we have been willing to work with you, but you need to think of other locations, because William Street, being one of the two northbound streets in the historic district of Fidei, is not a place. That's really going to work well with the narrowest side, some of the narrowest sidewalks that we have in the district. So we think that there are alternate sites and locations that they should look at and to consider now. Further to that point, I want to say that DHS, with Leilani and project renewal came to quality of life again this year in July, to talk about the sighting of the temporary shelters first, and we had a very robust and very good working dialogue with them. So again the mayor's pronouncement that we have nothing, we do nothing is complete fabrication. It is not true, and I want to pick that straight out there for everybody, because we have been a community who wants to solve issues wants to help the people and have advocated many times. I think everything that I've heard on the calls to do with inappropriate location based on many different factors and finding a better location is the goal, because we want to help the people on the streets. We do have a group called open hearts that was willing to try and work hard to make. People feel welcome and help them figure out, for example, as Pat said so many times where on earth you're going to go smoke over there right. How are you going to get around there's not enough places for the things that they need for services, so this letter was sent October, 8th and it'll be posted on our website. The DHS and DSS need to stop the conversation co- mingling temporary, which is what 52 William was supposed to be and permanent. Those are two totally different conversations. We've had conversations with them about permanency and about temporary. So, let's make sure when we're all talking, we know 52 William was the temporary sighting. We have still say: that's, not a good location. We do not have anything to opine on right now in terms of the move of the Lucerne men to there, because that's in the courts, that's not where we're going. So that's not our point. My point tonight for having this on the agenda is to say that the dialogue that we have with friends of Friday, open hearts, there's is going to be welcomed in our community board for quality of life, and things like that. I want to do a resolution that kicks the ankles a little bit because we have a history. We have been an open community to having a dialogue and to put it in writing that says they were here. Then we've welcomed them at all these different meetings. We've done all these steps, so kindly have the courtesy to come back to the Community Board and continue a dialogue instead of lying and saying. Oh, they do not want to talk to us, because that's just not true in any step, and I find it flat out insulting. So on that note, I wanted everybody to know. I invited friends of Fidei, because I'm hopeful that they will be able to work with pat and the team. They are on the call so Caitlyn's here, and I also want to make sure that people know the temporary shelters we have when this Covid-19 emergency is over, for what DHS has promised us and told us is that group of people go back to the shelter they came from. What we do not know is what they're doing to help the people on our streets that we would like to be able to get shelter and the groups of people who are together, who want to move together. So we've started to have some dialogues to see. If there is a way to do that now, I can't say we're making a whole hell of a lot of progress. I know downtown alliance works with goddard Riverside to have them try and get people in for shelter, but I think the biggest point is for us as a community, to figure out where we are know what services that we have know what services are offered and be able to get it all together. So we have a really informed group on the board, whether we do this through a task force, a working group, a subcommittee or only in quality of life- that I'm going to let pat lead and figure out. That's not going to be for me to decide. That's you know, that's not the way I roll. The board can figure out how they want to do it, but the topic of 52 William itself in its dialogue about being a temporary shelter, has been a rough one for this community board, mostly because the mayor's office had no respect for community board, one for the work we have done and the work we continue to do so with that I'm going to put hands up for anybody who would like to speak on anything about this. My goal would be to do a resolution basically saying what I'd said now, I'm going to start I'm going to go Colin Susan Justine in that order, so far, Colin you're, first we'll start with the kind of a strange start. I just want to make a motion to limit debate to 35 minutes. Is there a second a second and that's a lot of we should say 20., I'm down with that motion acceptance, Susan you're next, three things, one! We trinity ran a temporary shelter here for many years and they closed it. Not because of us. We have. We approved a woman's shelter to go down on Greenwich Street about three years ago, but the landlord pulled out we've been very receptive. I just want everybody to also know that this is a vendetta against us from the mayor, who's angry about the jail and do not any of you. Forget it. Oh yeah! Well, thank you Susan. I won't. I do not disagree, actually Justine Mariama and then Tricia thanks two things. One is I'm really glad to hear you say that there'll be some sort of a task force or something where we're going to be discussing this further, because part of the issue, I think in getting the people who are already here off the streets is the way the DHS is approaching it and handling it, and I think that having some partnership with people in the neighborhoods, where there are homeless people, which, of course is all of Manhattan and all of every place it matters and having people that are there on the streets and having people who have already been welcomed to our neighbor into our neighborhood as neighbors, because they're already here would be people who should be placed in situations. I also agree with everything you said in your letter and in your in your condemnation. If that's the right word of the name of the mayor, because that's unconscionable, there has been two responses come down here and the largest response has been, I think, welcoming, and then I want to say kudos to friends of Fidei and I'm looking forward to hearing from them and caitlyn as to hear us what? If there's any plan- and I know that we all collected a lot of money made cookies- I did all sorts of stuff to welcome the folks to the Radisson Hotel and I'd like to know what happened to all that and if we can take that and put it to the other shelters that are here. Thank you. Okay. Next, I totally know you're better. I think yeah. I totally agree with your letter tammy and everything that you said in your opening totally agree with Susan as well and justine, and would just like to add that the location is in appropriate. The timing is inappropriate and this rush job of trying to get everything through while using expired, executive authority and power. On behalf of the mayor, I think is specifically for that reason before the New York State, Supreme Court, maybe or somebody steps in and yanks those powers away, as was done to governor Whitmer in Michigan, he is trying to push all these things through, whereas not only is the public out crying for different reasons. We do not all have the same reasons, but there's an outcry from all over the public. Be it the men themselves, other homeless people who are not getting the same attention upper West side residents who are on either side of this issue, lower Manhattan residents, who are on either side of this issue and the city Council now has stepped forward led by the head of the health committee. Saying this similar to what I've been saying since this began. This pandemic should preclude any urgency to move people around in large groups period. The CDC guidelines are against it. We thought we were doing better. We are doing better and I mean you, I think new yorkers really. You know you know we're a steadfast group of people and we try to follow the rules so, but our numbers are going up too, and so in the midst of this increase, this third wave that's coming across the country, you want to move a vulnerable community into a vulnerable community when that's been when the federal guidelines suggest that you do not do that, but why you know the question I think we have to ask is why and not even a full year ago, this exact location was under a New York state investigation that was called for by the governor and all of a sudden. It just went away. What was the outcome all of a sudden, it's gone, and this guy's in this in this location is eligible for federal funds to be funneled in how I'm giving you one minute. I'm done! Thank you all right, all right, I'm going to unmic Kate Dooley before I unmic Cake Kate's from friends of Fidei. I will say that Pat Moore and I had a call with lucian and some of the people we've been working with to see if there were options of things that could be done on a different way, to reinvent how we help the people on the streets to help the people on the streets in CB1. First, it's getting cold. We want to help the people on the streets here, so I do not have anything I can report out on that, but pat, hopefully we'll. Maybe we will before November all right caitlyn. Is it Kate or Caitlyn yeah either one is fine hi, I'm Kate everyone real! Thank you so much tammy great to be here and thanks for all of the great sentiments before this. So my name is Kate myself and four other women from the area. Co- founded this friends of fight. I do not know feels like years ago, but I guess it was three weeks ago now and our goal really is you know we agree with a lot of the things that have been said already in terms of this was rushed, and why is the mayor doing it? And these men should not be moved, but I think what we found is that we're all within friends of Fidei just coming from a place of trying to take this at the grassroots, like allowing people like you guys and other politicians to figure out the grass tops and we're hoping to be in a place where we can be the grassroots and really supporting the individuals, whoever they are that are in Fidei and either currently homeless and unsheltered, or moving into new shelters or also already in shelters down here. So that's where we've connected closely with the open hearts group on the upper West side and are learning from their experience, because they've done some pretty groundbreaking things when it comes to providing that bridge between the community and the shelter residents myself. I come from a social service background. I was trained in the settlement house model, which is a very old model invented down here in lower Manhattan, the first social work, so people would get off the boats and settlement houses would welcome them. So that's the background I come from and really what we're doing at friends of Fidei. So we are welcoming people, we have a welcome committee, as justine mentioned, and a number of people. The outpouring of support from the community has been incredible, the fundraising the donations and we are moving ahead. That's just the tip of the iceberg. We're now hoping to start replicating some of the experiences on the upper West side, so holding employment and resume writing workshops. Hoping to do newsletters main thing initially would be kind of more fellowship things. So when the gentlemen arrive or residents arrive, whoever they are, we can give them a tour of the neighborhood have welcome maps, so they know where good grocery stores are really we're. Just trying to be good neighbors, like you would. If someone moved in on your block, so the outpouring has been terrific. Please look up our facebook page. We would love any of you to get involved. We are going to be working with project renewal at their six water street location. Now, that's where the first package that was meant for the Monday group is actually going to go. The first package of donations and welcome kits we're going to we've had a great experience. Working with project renewal so we'll be doing that and we're going to keep going up to the upper West side, I'm actually going up after this to drop off those cookies justine, and so that's where we are we're very new, but we're very eager- and it's just been such a neat way to connect with other wonderful neighbors in Fidei. So thanks very much for listening happy to answer any questions, good to hear, say hi to Jam. Thank you. So Shams is what spoke very eloquently on the meeting. He is one of the leaders of the residents of Lucerne and he was also willing to come to another community board meeting where we talk a little bit more about things that happen. As I said, Mariama handle all of this in quality of life. So, if you are on this call- and you want to know what's happening, our goal is to be able to be able to find out in detail all the services that are offered in community board one. We know a lot of them, but every time I think I know something else. Pops up. Thank you Susan. For the history lesson- and those are super important things to know and hear because we need to ensure that if people need help, they can get it all right. So does anybody have any questions and does anybody feel on oh susan, your hands still up. I got that. Does anybody feel we need a resolution to kick back at the mayor, to put it officially in writing from the Community Board one perspective, basically showing what we have done and saying we look forward to the dialogue, stop trumps and in the neighborhood and maybe come talk to us. I second that I second I do too and then, if we could add, maybe support of Scott Springer's call to have his fiduciary powers return to him. I would love that as well. Personally yeah. I actually think we should do it. I support that as a separate resolution. So let's do two. If everybody's okay, with that the first one's going to be basically saying, stop calling us idiots so to speak and all right. So this I think we can do as an all in favor kind of a thing. So here's what I'm going to do for everybody, that's Trisha, do you panda? I did I just was I you know it's enough to say I second this. I think my points have been well enough covered, I mean one of the ways is one of the, whereas I would say Tammy is the fact that I did not have time to do the research, I'm pretty sure that it was the beginning of the De Blasio administration that he actually closed a shelter down here, and I need to keep it in. So to me, what bothers me the most and I'm so happy. First of all, thank you for your leadership. I think that the letter's excellent, but I think what bothers me is that it's the same theme we've seen a lot of, is this pitting people against each other, especially in a time like this is, in my view, completely unacceptable. You know there is the right way of doing this and the wrong way of doing this, and we need to send the message that it's the wrong way of doing this. We need to take our focus off the content and talk about the intent, and I really think it's worth our time and energy to do that, so that we do find ourselves again here in this place. I remember the pink summonses on Thomas Street. You know this happens over and over again, where there's no outreach, there's no thoughtfulness in terms of their initiatives, and it has to stop so that's my two cents. I love that and that's good. So I think we are in a position which is interesting and good that I'm going to do a roll call on this a little differently than I did before. So it's basically going to be I'm going to assume everybody's a yay and then I'm going to call abstentions, nose, abstentions and recusals. So with that in mind, I'm sorry do I have I'm not very sorry. The all the warehouses are the history of CB1 and the therefore be it resolved is demanding that the mayor's office, DSS and DHS work with community Board one in a dialogue instead of contin. You know to continue the work we've already done for sighting of a permanent shelter with Community Board one. The way they have the process without including us is where we got to here. You know: try talking to us. Try working with us, try understanding who we are and our street grid. They have a requirement under fair share to look at all of our documentation, which includes our budget-. Based requests includes our concerns about our streetscape and everything else. So, basically, his sighting at 52 William ignored everything, but that was quote unquote. Temporary we're talking about permanent got it because I can't everything else is in a lawsuit, I'm talking about permanent and timmy. If we could add something it does if we could add something that Trisha said about pitting neighbors against neighbors yeah, okay, putting that in there. Thank you. I like that language all right, so my way of calling the question. Is there any abstentions and do not be shy if you do not feel like it? It's okay, unmute yourself! If you abstain, please no abstentions. Are there any no's mahoney you got it. Are there any recusals, perfect? Okay motion passes. All right next is taking the subject that was sent about, requesting that the mayor's emergency orders are curtailed to return checks and balances through the controller's office. Okay, yeah. If I believe that there was a joint letter sent all right, so that's okay! Thank you. Cora sent me a joint letter from the elected to the mayor about putting a moratorium on moving shelter residents from hotels to hotels. Well, that's nice, cool. There's, also a letter that the controller sent to the mayor and several others at the end of August, saying that the pandemic has stabilized to a level that checks and balances should be returned and that to rescind part of the executive order to allow that more oversight. So that is what we are asking for. It will be very short and sweet, and that is the therefore be it resolved to rescind that part of the executive order, return, checks and balances. Did we have a second that I do I seconded it? Sorry I seconded it perfect. So then the question is: do we have any no's mahoney? That's fine. Do you have any abstentions? Do I have any recusals motion passes all right off. We go back to our agenda. I thank everybody for participating on those. Thank you very much to Kate for coming in and we move forward to the budget and lucian takes it away. Okay, everyone! So, thanks to all the committee chairs for your work in discussing the New York City fiscal year, 22 budget, this is the part of the process where we go through not only last year's remaining items which I'll walk you all through, but also new ideas that were generated this year. So let me just take a second to pull up the correct screen. What you're seeing right now is our database with all of the budget items for 22.. This includes both ideas, which were generated and inputted by committee chairs, cv, members of the staff at the behest of CB members, as well as items from last year that I have identified as not being fully supported by the city for one reason or another, and I have not included items that the city has said were fully funded, so I can change the way that this is filtered. So you can see all those items, but what I recommend is that we go through these items. There are 102 of them and the committee here can discuss what to keep and what to discard. If there are any items that some of these items are no longer relevant and some of these items are extremely relevant, so it's better to try to keep these items to the most important and also to if something is just never ever being funded, either change it or alter it or explain it better. But we had to find a way instead of just kind of throwing the same information at the at the agency to get them to either better understand it or sell the idea through this portal, which is, admittedly not an amazing way to send them information, but they do have to synthesize information from 59 community boards, they're all doing the same thing, so it's always better when, throughout the throughout the year, we are, you know developing resolutions sending those on and providing lots of facts, context and backstory, but as part of this process, specifically what we decide to keep today, I will bundle together for a full board all together, and I will update the narrative for statement of district needs and then go on to the special portal for district managers to manually input all these items to be submitted to their database. So that's kind of the process on my end and how the work on your end leads to that result. So, however, you want to start. I have this set right now to go through the new ideas and then to go then into the items that were either rejected or partially approved, but I can easily flip that around according to what the committee's, how you want to kind of start this process, but there are 102 of them, so some of these will be fast and some of them you'll want to discuss. So I recommend you dive in. There are 102 of them. How can we deal with this efficiently so last time we called it out, and it was if I hear if I, if I do not hear a resounding no, we leave it where it is. Thank you right. It's if it's a continuing thing. We just continue it on all right. So I used to have a book and I went so here it's okay. First one was a request to just make out gateway plaza as a nork, which is a naturally occurring retirement community. You know a portion or all right, keep going. Next is the reason if we say nothing, that means you keep it yeah all right. Okay, jp ward! It does not drain properly. I can't we're definitely never going to change that one just keep going, because it's a cesspool corner all right. Support of the city's green infrastructure programs, sure city parks and green streets have previous green spaces. Adequate storm water capture, hearing nothing. We continue CB1 next ask city budget, include allocation for staff positions for Covid-19, and this comes from quality of life and an EPA. I think, hey keep going park, mates and staff along the East River Esplanade City, Hall Park and pick Slip Park, okay, restore and upgrade City Hall Park Northeast Plaza. Does that include? Does that include the sidewalks that have been damaged by the NYPD cars pulling up on there yep? That's what it says. Specifically. I did not get to it. Oh yes, all right! Okay! This is also City Hall Park recommended repairs, including the broken pavement beyond where the car is parked. Replacing chemically damaged stuff keep going. This is the next couple of minutes. Barnett Newman Triangle, keep it keep going parks, partnership for parks to support neighborhood volunteers for parks and maintenance. Keep going. Are we asking for fiscal support on that? One mission it has to be yeah. This would be, I guess, expense, budget yeah, so I would say for this one we might want to be specific or what we just want to give more budget to partners for the parks. Okay, I can make this a little bit more specific, because partnership for parks is not a volunteer organization. Is it it's kind of like a quasi city, it's kind of it's like a not- for- profit, but it's essentially city Department of Parks and recreation's special not- for- profit arm. I would just say you should add that you know at a time of fiscal cutbacks and park maintenance. We need to support and create additional friends of groups, something like that: okay, something like that and I'll keep working on it. Okay, thank you. Okay, Tin square, again, the same kind of thing supporting the maintenance of fin squares, keep going. I might want a location because I'm not sure if they know where it's where it is yeah, let's give a what's what are the approximate cross streets here? Paul? Do you remember? North America is Barrack West, Broadway Franklin, and it ends close to leonard. Thank you all right. Could you just give me two? I'm sorry just give me two Cross streets, American, West, American, West Broadway. Thank you. Okay, bowling green park enlarge and make the major tourist destinations safer. Now the city decides to keep the charging bull find a way to separate visitors and vehicular traffic by enlarging the busy park there we go keep going. I just I did not mark this one. Last year: okay, Injuries Pedestrian and cyclists, based on the Brooklyn bridge. That's an easy one. Keep going! Yes, Canal Street Enhanced, Pedestrian Safety, yes, yep Tribeca on the bike path. Actually we that one was funded already. I think they completed everything on the west side of the greenway, we'll Ju. We have to check on that. I think that one's been funded unless you want, unless they're talking about the expansion, all right Betty. Do you know? Do you remember sorry? This was to complete it in case it's not completed by June of next year. It is funded for now in the current gotcha. It's okay, so for just because of the budget, the budget, just the turmoil, I think projects that we assumed were funded last year, it's probably safe to try to put it back on the top of our list and ask for funding if we're not totally sure that they're getting money until the shovels are in the ground, gotcha. Okay, all right! Next, making our streetscape friendlier, that's good. Okay, all right keep putting all right. This one is for the traffic intersection increase the lines of size management. This is CB1. This is the idea of taking a study from West Street yeah. I think from what street this is a community board one passed a resolution talking about enhancing the bikeway to potentially look at the potential to take one lane off of West Street and adding it as a dedicated bikeway until Chamber Street from so it's not way down. It was from chambers north. That needs to be reflected, increase that reliance recycling so slow, making the West side highway less of a highway yeah finding a way to usage. I would make it come all the way down, but they, if you're going to do, I do not know if I agree with it, but if you're going to do it, come all the way down? No, you can't because of the turn lanes. That was what we already have a resolution. We have a resolution based on that. Yes, that makes sense. Okay, all right next traffic study for Albany at the crossing of West. This is after the removal of the Rector Street Bridge we had asked and DOT agreed. We would like to ensure that the safety study gets done next. Yep, that's funds to complete 42 trinity beneath the Brooklyn bridge turn the parking lot into a green play space. Yes, I'm not hearing a lot of people saying no look yeah. This is all good you ate somewhere. Is this a duplication? It's amazing? Okay. I think it is great. Okay, no is not it. We've already done Brooklyn bridge and bicyclists. We did okay, because this is this is we did? This is the second one: oh okay, but you're not taking off the one about the new space. Okay, no! Definitely not at all, okay, good, okay, affordable housing, yep. That stays reminds me thinking composting. That is something that we've supported and we asked for and has been, is viably on the chopping block, so yep keep going the affordable housing it was for it was for preservation. Are we doing anything for creation? Yeah, that's good! That's the last note that I have is. I did not see it yet mariama, but I wanted to talk about creation and I was going to see if it was there for affordable housing, okay and I think we should call. We should also call out specifically the World Trade center site as separately, that we want that for housing as well question also to talk about housing and affordability. Can we throw in there? This is more like limiting budget not asking for money, but how about 300 million is enough to collect the battery Park City Authority, it does affect the city. The city is a big part of that, and just it's saying 300, that's enough! I do not know how to say it. I do not know, but that would be something that would be interesting and it does affect the budget. It definitely does, but I do not know where that would fit in here, but all right solution do we have anything else on the affordable. Well, so I'm just making sure to add this item while we're talking about it. From what my observed of these conversations, a lot of what I hear is people saying that our children can't afford to live in the place they grew up so either way. I was going to phrase. This was for families and you know young people, so that speaks to large unit, housing or units and then also single people units. Yes, I want to make sure that everyone is okay with that phrasing, because sometimes you know people are against studios and one bedrooms and want to say we want more. You know two three bedroom units, so I just would kind of want it all. Would not it be nice if the teachers yeah the teachers would not be nice if the people teachers could live here. You know if you work in a you know. If you work as a doorman in a building, would not it be nice to live in the same neighborhood that you're working or, if you're a firefighter in the neighborhood? No, you do not think so, maybe not the same building but the neighborhood. Yes, I do not know fireman sure why not I've been working with paper, okay, so yeah. This is good. Okay, great all right, I'm going to go back, I'm just adding that in all right. Okay, where were we, we were down children. Yes, that's the standard. We do that, okay, trains for community members. No, that should be done professionally, not by the city. There. They have community outreach, liaisons they're, not for profits. They work. That's what God or Riverside does that's what the others do and for people who want to be trained, they should be going. They should be going to those organizations, but is this? Is this for the city to perform the training or to pay for it? This is for paying for it. No, this is to provide. So it looks like DHS I mean DHS is a is a it's the agency that manages all these records, so the way it's worded is that DHS would be conducting the trainings I see I did. I did not think so. Some! I do not think that. That's something that we that we, I think that if you want to be trained to go, help homeless, the homeless in the neighborhood, you should go volunteer and work with the organizations that do the outreach who are professionally trained. How about asking for more funding to the community organizations instead of community members to conduct outreach, because part of what part of we asked for earlier right is to say how do we help the people that are here? This is one way to try to figure out how to help the people who are here already, and how do you get engagement? I have no troubles with. I think that's a valued way to go is to ask DHS to provide funding okay to organizations to increase the amount of outreach available perfect. I would be okay with that. Okay, so the one that was in there and change it. Why are we adding that we have a? We do, have two DHS items but they're, not exactly what you're saying so I'll just modify this one. I just wanted to check make sure that we were not making it right. We did not like this one, the way it was worded. So this is a good one to modify and you already started it. Okay, all right. So, let's additional, I hear what you're saying justine, but I'm not asking the city to train members of the public. We have organizations that do that. I want the city to help fund them, so people can go and get no. I agree with you. I agree with you with that change. I agree with you. Thank you, Madam Chair, okay, after Lucian's done typing. You know what lucien slide it over on the screen, because I can just make some faster notes with you done all right. Waterfront. What's a bathymetric survey, Holy Smokes says it right. There measures the depth so that we understand what uses would be use gold doable all right next, assassinatable yep. Definitely long- term resiliency, okay, so that needs to just change. Is this? Is this through the bpca for Stuyvesant? Is that part of the well because then it would not go through the city budget? Well, the problem is Bpca. Is stopping they're not making it all the way up to Canal street, so we need to find a way for the city to connect into whatever plan the Battery Park City Authority is doing to finish protecting the West side. I think it's saying north of Stuyvesant I mean I did not write this one, but it's pretty close to what I think is the idea and the month. There's money there to research this and that's what we would want to have researched. I think it's. The btca is going north of Stuyvesant right are not they going to North Moore Street or some or we do not know what they're doing yet, because they have not decided north of Harris of North Moore. That's true yeah, but just correcting it that way. That's all yep yeah correcting it. So instead of Simon says North Moore, it is north Moore, I think, is not it from the that's what I recall from the last meeting. I was like, I think, if you just said the West side highway and connect into the Bpca, maybe their plan. I do not know Tammy. Are there a hundred and seventy of these and we're on twenty? Where are we in this? I know? No. There was a hundred and two uh- huh and we're twenty all right. So here's what I think I'm going to do, I'm going to take note solution and we're not going to wait for you to type, because that takes a really long time, all right. So flood barriers, yes, keep going next enhance fire and Ems. This was expand. The funding. That's fine, because there's no connection into the battery Park City lands interim flood protections on the West side that all right, so that one we have to take a look at the flood protections to make sure it's not duplicative. Okay, all right, inspect, okay, so we're getting okay. So this is now we're getting into our holdovers from last year. So we put this in this continuous support. They said more information needed, you know either we have to provide more context or we have to get rid of it. Be careful. Where was the water okay right, so this is about the water main breaks and the never ending projects on worth and West Broadway and others with the DEP and Con Edison thoughts comments. Take it off leave it on so this also could be an example of something I added a lot of his first fiscal year because for new ideas, I'm tracking when they were first placed some of these items may have been on here for quite some time, just being put back on over and over again. So this could have been an issue before and now Dc is you know, replacing water mains, so you know, may not want to keep it just may be on just from you know, never having been taken off. I think we can. I think we can kill that one for right now, all right, but they wanted. Specifically, we have to add more okay. We can take a look at that. We can take offline because we have resolutions. We can add on that. So that's fine add to the green file battery. What do we need a second impression? Ah, they need a comfort station and park office in the battery. That is true, and we've done a resolution on that before so yeah keep going that stays this we can get rid of because that's in progress right yeah. They have to get the people to move out of yeah it's an agency. It's an agency thing that is funded. That should say continue funding yep it's on there for some reason, more information needed unsure. Why? I do not they broke ground, so, okay, keep going! This is different, Elizabeth Berger Plaza. Is that? Do you remember it's done yeah. I think that it's a done deal. I do not think it's finished construction right all right. We can take that off. It's still in the DOT budget, it's active, so we do not need to keep on our list. Well, not necessarily, but I do. I do not know that they consider it finished. Well, I'm just you know it's funny. We talking about this because I'm a little worried that it's one of the you know, projects that has been interrupted by Covid-19 and in that case we could advocate for it to be in the next wave of projects that they, you know, finished yeah, gotcha, okay, all right, good. Next traffic calming on 9a, we have to add, we have to add the specific streets. We have a resolution on that we can add those streets I'll. We can go do that tomorrow, no problem next yeah sanitation denied, okay, I think they want specific locations. We did that with the downtown alliance. I believe we talked about pilot locations, Betty or Michael. Franco might remember, so we can add that at the pilot locations for that not now, but we can follow up with you afterwards keep going bioswells, Barnum, Yep, Reconstruct bowling green park, the pathways- yes, that's separate, that's different from the other one go for it, Bluestone pathways in City Hall park with more durable bluestone. Do we need to keep? Do we need to keep that one because we have the other one well. This is an issue that Friendship City Hall Park has. It does not raised to keep it in exactly okay, so this is create, let's just say, create East side of Cd1 and complete I'll believe it. When I see it when the library opens I'll call it complete yeah all right next yep keep going. I believe they did the Morris Pedestrian Bridge. The problem that I think their issue is that this is they did it's a state bridge, oh, but I think it's finished, though they did upgrade it right yeah they did the upgrade it's the elevator. That does not work right, yeah, but it's not. I do not even know there is no okay speed cameras, I'm good with that. Keep going! Please tell me we're like past 50 already right feels that way. Can we scroll up the list to correspond roughly with the the items being discussed now, so we can see where we're at oh cool, we're, past 50.? Okay, I'm loving it. Okay, all right like we did Morris, we did speed cameras. We did. This is a duplication, I believe the Brooklyn bridge pranks. Oh no! This is different because it's different yeah one was the banks, yep nope, that stays obvious how much we'd like traffic coming yep. You know this one has problems. First of all, it's Is-289 that is with Ps89, so that's just informationally needs to be adjusted, I'm also not sure where they want the crosswalks, because there are crosswalks built out at both corners in either direction. Is this your question? You want one in the middle of the block. I think that's so inappropriate of the school that I can't support that it's not just actually support. We did support it because it was from the front door of the school directly over to the ball field, yeah and it's the way in between traffic, but it's between two traffic lights with buses, along with traffic control measures. No because this is a very separate thing and the kids just walk whether whatever you're saying that no one walks the corner. This is where they walk so having a crosswalk would be really useful so when they say they do not yeah. That was the situation that was at millennium. You know you have yeah, you want to believe that you're going to talk those children to a corner, but the other thing to take into consideration that we found at millennium is that you really do not want to walk them to the corner. You want them to have their own crosswalk and I'll. Tell you why the business foot traffic is on the corner, mixing the children in with that foot. Traffic did not have good results, and so we built the crosswalk at millennium and the speed bump, because they were not going to go to the corner and mix in with the business foot traffic to go to the Stone Street Plaza and at is 289. They go to the ball field all day long. They have recess there. So it's really that the teachers supported it, that the dead teacher supported it, and I think we should yeah. I know- and I think that you're right, I think, Manhattan youth would support it and that's gold green would support it too, because they all use it all right. Did you want to? Did you want to add something about a speed, hump or anything else like a traffic control measure, or you just want to leave it this way? Oh, let's add a speed bump or traffic control measure. Sure you can't, because there are buses we did try to do that and Betty is correct. So just to understand what does this mean? The cars are going to stop at the middle of the block when the lights rip, as opposed to going all the way to the light, or at least be aware that kids are crossing there because of the crossbar it gives you causing attention to it. Yes, it's one of those crosswalks. That is it's just like on the bike path. How they're supposed to stop when people are crossing the bike path to go? You know, let's say you're on Harrison Street at the end, it's there they're supposed to stop. Okay, congratulations! I want you to know that that's against DOT regulations, what you're asking for, because that's why they won't give me a crosswalk at the end of north end, Avenue to cross Chamber Street. Well, I mean rules. Dot rules have accommodated the needs of the community on streets that were not built to have schools study and that that's they. The speed bump on millennium was rejected for three years before we got it and it was not until we really drilled it down and helped make them aware of the fact that maybe they need to put the regulations regarding curb cuts aside for the better of children, so they are not killed by oncoming traffic, and also there was a was a child kill struck by a car at millennium. Remember I was knocked out yeah. Well, there was one crossing here as well. That's true, so I can't see encouraging more to use that as a path. It's not encouraging. If they use it, add a stop, sign and build out and it thought it would be cool crosswalk that way you have traffic is indicating traffic is told to stop. It's maybe a yield sign, so that way people will slow down, but not necessarily stop. If there's no reason to we advocated for a school crossing sign, which is usually that goes along with that and Ed was you know, I think they were very much against it and I do not you know again. These are situations where the DOT is going by the regulations based on traffic, but they are not. You know absorbing the fact that we have schools in places where we're going to have to bend those rules to accommodate for the pattern of children, and you know we did not. You would not ideally put a school there and then and then a ballpark across the street, but that is in fact what happened because of the limitations that are our opportunities here, and so at that point we just have to advocate for it and with enough with enough effort, we get it. What about a flashing, yellow light? That's harder! I've seen I've seen on West 125Th, Street Mid block crossings with stoplights. It's a long walk and dots added a crosswalk with stop with a with a traffic control device to accommodate it mid- block. So that's what you want. It's something that we can. Certainly advocate, for, I think we should have some signage in addition to the crosswalk. In my opinion, I would agree with that. Something like that perfect okay, I mean they may say no betty. I acknowledge what you know in your position, but we got. We could ask so this one was this. One is something that we put together to try to force or try to encourage D.O.T to change out the street lamps, particularly along Worth Street. So I think that we need to focus this to be clear that Word Street is exactly where we want it. I think they were kind of saying. Oh, we need a more precise location, so we can. We can carve this to be even more direct since Tammy's, not on I'm just not hearing any objections, I'll keep moving myself yep keep going, we've who's talking about compost, I'm muting, you! Okay, all right! Do anybody remember this one I do not from last year they have a public plaza, so they the pace on their private property. They read to the plaza, but the large expanse of sidewalk area in front of pace belongs to Gop and it's in disrepair, and so they want D.O.T to renew it matches the quality of the private part of the plaza. Why do not we let D.O.T take care? I mean pace, take care of that. What do we need to do that for since they're built? I actually agree with they're building a new building. They have not been good now. I do not need to worry about that. Let's move on, I say: no escorted hungry, keep going all right, fun! We've repairs to the staircase on Frankfurt Street, leave that because we've already said about recreation, so keep going next franklin between Hudson and Barrett cobblestones we're just going to run right. There we've shown streets that are in disrepair, so if so, I'm assuming that you all want to keep those yeah you'll see a lot of these. That's fine just keep going. They have to get people from Italy to come over. Okay, this one's different keep going. I think that's yep! Okay, sorry! Why is that ours yeah? I do not know what that is the new market building site, it's all down by Howard hughes. We do not want howard hughes to be in charge of every section. I thought it was this. Thank you Paul. I got it fine. Why do we? Oh okay, keep going all right hold on yep leave that I'd rather leave everything with them. Yes, yep good. We already have something more detailed on that one can go away, keep going. Those are the school they denied that Trisha. They denied the request that we made for the office buildings. I think I think that what office program I got go back again. I do not know what that is broken up to three separate requests for the schools. The schools that are co- located in office buildings have very difficult times for the kids in the schools yeah this year. We can just make three separate requests. I think that's what they want us to unbundle them, I'm happy to unbundle them as long as they do all three yeah three equal requests, but individual requests they had. They made four attempts to renovate the elevators at 26 broadway. They had put a charter school in them before even looking at the elevators. I was there randomly three times in all three times there were children stuck between floors in those elevators and to the point where they had to give the principal a key to the main elevators in the business part of 26 broadway parading the children across to the business side, which is by the way against the law and the chancellor's regulations taking them up to Lmc. So I would say that situation is probably an emergency and you know so as long as they do it, that's fine if they, if they turn them down lotion. When we separate them, we should definitely take action. Okay, I'll! Let you know as soon as this. These results come back in by the way 81 new is 26 broadway. That would be important. That's the same! Building it's the same. Building 81 new is the school's entrance. 26 broadway is the business entrance okay, so we will just be two requests, then yeah. Thanks for that apologies, my kids made dinner. Okay yep keep going, keep going, we're good. I think they denied that, but we do. We did ask for some particular locations. We should be asking for every location that has a along with the ferry stops. The air, the helicopter pads and we technically have access to air quality information for the helipad because part of their contract is they have to provide it for the reports to EDC. So if we want to do something with that data, I can request the quarterly reports from EDC, but for other locations such as the ferry terminals. You know those are places where we do not have an identified stream of air quality testing. Okay, can you scroll down directly where we are on the list? Please, I'm just exhausted we're just trying to figure out how fast he can get out of here, and I do not blame him and there's that one issue I texted you tammy yeah, we'll get there all right. Yeah remember this is a year's worth of work plot. So this is, you know yeah. This is this is one of the most important things that the community board does it'd, be nice to get community board staff, but yeah they're not going to happen. I think you care it does not matter, keep it in exactly keep it in yeah. Okay, I had to be going okay, yes, yeah! That's good yep! Anything! That's placard! Yes, exactly yeah, bicycle lighting, oh yes and skateboard! Actually we should include electric motorized bicycles on sidewalks that are not used for ADA purposes for sure, so another rebel scooter riding straight through the parking battery in the battery. I saw them on the West side highway as well, but I'm talking on the elevated portion where they're not allowed so and the Fdr drive so telling me that they do not go on there, I'm a little so sick yeah, but that's Darwin yeah my husband's making snarky comments. I have to tell him to be quiet because he forgets the meetings are recorded. Okay, keep going yeah! No! I do not want that one there right, yes receiving a yes! We do want that! Contextual zoning. Yes, we can add more information to that. We know where we're going, keep going. Fine, there's our this might be a duplicate. Unless that's the one we added it's the one we added, because we had okay, I think it was no. This is this is the existing one? Oh you want to need more information yeah. So we know we can. Oh, this one is specific to Battery Park City. I think that's the difference. I'm going to put this as modify and then we'll come back to it. That sounds good. All right keep going working yep! I like that. Yes, what is it we do too yeah all right keep going. Okay, that's great yep keep going again more waste yep! Yes, okay, keep going quality of life issues yeah! Well, that's what we're about! Yes, you should put some social workers in there anyway go on. I was going to ask if we could get awesome for NYPD. Can we go back down a little yeah? Read this one, a little bit double lecture bus, this one yeah, maybe yeah? Okay, I, like the non- commissioned officers, is that what that is yeah the neighborhood coordination officers, neighborhood yeah, but they should well. We should add in that's a good thing, but I think we should add in that they should have social workers too yeah to respond to like the well. They should contract with it's a long involved process, but they should not they. You know, but yes, my daughter made popovers. Oh I'm glad you're reading. Let's keep moving all right. Sorry keep going additional uniform workers yeah that later, let's keep moving. Okay, you can break. You know we'll clean it. That's pretty controversial, but what the hell that's related to the other one we can get. We can get back to that. That's related to the elevators yeah. What the hell bruce! That's right! Yeah there we go. I think I'm not going anywhere. What does it mean? What does it mean for this to only be partially approved? They want to remove some rats blocks only on certain blocks keep going. I think there may be some parts of lower Manhattan where it's, where they're applying on the 50th floor. You know really here we go. This is perfect, that's exactly what we're talking about yeah! Yes, let's go so good yep, but can't we combine them, but let's go they do not. Have these categories keep going? Okay, separate all right, going we're good. We say that before somewhere, but I guess we said he all bark nope, that's yep, that's perfect! Keep going! I thought we were almost at the end. It does not seem like it. We are. I promise keep going yes that stays well we'd like to be nice to LPC. Why not? I like that? Oh that's pissing in the wind, but why not go on I'm thinking the same thing? Yep yep! Oh! This is the last one perfect. So there are a couple things that I think we need to take. A look at. Also one of the things did not you see Pat. I did not see you know high harp on that left turn from West Highway into Greenwich south to Albany. I did not see that you're talking left turn on Albany, yes from the highway. Okay, I did not see that we need to add that back in, I think it fell off both of those okay, so solution who's ever typing, stop typing! Please sorry! It was it's a left turn Mary, I'm a mutant dude from 9a on to Albany into granite, South turn southbound 9a onto Albany straight, that's one! We did the social workers Bruce has one bruce go for it. You have one to add. No did I have my hand up, not Albany snow, not Albany street. Oh the one. You wanted to add for budget consideration. I'm sorry! I do not remember what I wrote. What I texted to you was semi- private, but for you lucian and me for a minute about War, Street, okay, that we'll do that after I'd like to actually, instead of having individual companies campaign DOT to have to privatize space on the street, I'd like to ask the city to do a study of locations where we could potentially advocate for a cargo centralized cargo station like that they've been talking about. I like that. That's a way to kind of give them the cargo station, because it's a concept. It's a good idea. I just do not like it where they're doing it well, I do not think they think it out. No, I think you're right. It's a knee Jerk reaction. I think that's great tammy and so doing the study is a great idea. That's a good way to do it, everything, but they you know, yeah the bike. Cargo yeah we're talking about bike cargo places, let's find places in CB1 that can lend itself naturally, so maybe fedex has a place or ups or whomever it is that they have more individual places, Amazon whomever that they can fresh direct. So they can instead of what we got going yeah. But why are they paying for this? Why are we giving this to them for free they're, commercial entities? I do not. We do not want to do it. We want to identify areas right and then we want studies and then they can pay for it yeah they build their thing. That they're doing did we put scaffolding back on? I do not know. I did not see scaffolding, but I will we will add scaffolding. What do you want specifically about the scaffolding other than a review yeah review? I do not know if they need more employees to address the issue of maybe calling on some of these businesses when they've just left up scaffolding and are not working. That's Drp! That's the Ob yep! So we're looking for DOB funding to review the scaffolding policy and enforce it. That's supposed to be scaffoldings are not supposed to be up for more than six months or three months or whatever. It is. There's a new policy and they're up for too long exactly got it. Okay, all right from everything else that we've done anything else that we see is this is this the play I mean you remember they had the there was some legislation I do not did it pass where new buildings had to have indoor garbage container rooms? Yes, but it does not solve the problem of the existing buildings that we have. No it's just. It applies to conversions, I believe and new all right. So that's addition pilot project that was actually legislative. Betty. Do you remember we had talked about this. Excuse me. Do you remember the legislation passed? No, it was legislation that the city council was doing about having indoor garbage compactors. I think it was quality of life and not transportation. It would have been quality of life and I'm not aware of it is the answer as well. Right, I think it. I thought it was a pilot program. I was not sure it was legislation that passed, but we can. We can look into it. Well, look because I kind of remember it at a kickoff meeting that I was at instead of anthony, maybe in January of this year yeah it was. It was not that long ago, yeah, okay, Betty you were there. This is a pilot program where they were talking about getting the trash off the streets and putting them in Tooth yeah pilot program for establishing trash. I do not say[ _ _] within a curb lane, so you could pull the trash bags off of the pedestrian right away and appropriate some out of the oh, that's a separate way for storing trash, but I think there's even more than that, where they're all looking they're also looking for expressions of interest or some, you know some degree of that at waste storage within the roadway within the public, right- of- way. First, you know some that was at Betty's meeting, but we did. We do have something on our we did. We do have a request for that: okay, good all right, so I think I think that could be it anybody else from any other. Oh not true. We need to put in somewhere here because of the open streets that we are requesting, with outdoor dining being permanent, a complete renovation starting on the local level and view of parking. What do you mean renovation of what so now that outdoor dining is a permanent aspect of potential? We need to really take a look at what we've learned and the feedback we've gotten overall about. What's working and what's not and try, and instead of sticking it in the middle of what our streets are, what we should be doing is taking a look and saying: okay. Well, you know what on this street there is. You know nothing but agency parking and there are several restaurants here, some retail establishments that could use space yeah. I was going to wait till new business, but I went to the claudio last week and sure enough across the street from the restaurant, where they originally had their outdoor seating, their larger portion of outdoor seating, because they have some immediately in front of the door, a couple of small tables and then across the street. They had that one of those larger you know temporary build- out things that is now in front of them, which we knew from the last meeting, but we're in its place. Although the streets been closed completely on both sides of Anne, on Nassau and on park row, so that there is no traffic, there were a bunch of cars, black placket cars, many cars parked across the street where seating had been and could be. But I think, there's a larger issue. I do too pat. I think I do not mean to step on your toes the problem nobody's radio. The problem is up until now: we've had control over sidewalks and how we wanted to regulate sidewalk cafes. If this now has become permanent seating, then do we still have the ability to regulate it or you know up until now. I mean right now for this temp. What was temporary, they were allowed to do what they you know. They regulated themselves. We want to know now. If the control comes back to the Community Board to regulate outdoor seating, I agree with Pat. There is no tribulation, there is nothing and if they and they do not have any rules and enforcement or whatever it's got to come back in some way. This is all temporary. Until we establish something permanent that we have some input in it, that's crazy. So let's agree with both of those. Let's your point, this particular space and with both sides either side of the street is closed. So there is no vehicular traffic there yeah, I hear you. These cars are probably something you're like into a budget request. That's all I'm saying turn it into a budget request. Well, my budget request is that the control and regulation of outdoor seating come back under the control of the community boards. I do not know if that's how you word it, but I agree that there has to be some enforcement and it gets related to enforcement and regulations yeah. I do not know if what I was saying was a budget request. I was just mentioning it then, because you started the conversation about the traffic, but these cars are parked there indefinitely the streets closed and they're there they are. They are city cars. They are placket cars that are taking up the space that restaurants could and should be using that's kind of the point that one of the things that we want to do is we want to. If we can audit the streets, we can really redefine it, so we can look and make giant areas for cargo and giant areas for we need to get. Quite frankly, we need to get most of the placards and the agency parking off the streets to the maximum that we can, especially if, in the new world of virtual with people not going in, they do not need all the space. They've got well the city, and you know what they could they can. This city should pay for parking. They should support businesses exactly okay, the taxes all right yeah, but I think we have a bigger problem, like Susan said, with this whole new free- for- all with the outside eating, because that and street incl the claudio's. It was it's a horrible situation, because I saw a garbage truck when the street was closed. The garbage truck made had to get through and did not know the street was closed and had to make them open up the street so that the garbage truck could go through Ann Street to pick up the garbage, but that's one little issue, but we've we're going to have a whole lot, because with this that's my whole point yeah. That's my whole point is that we really need we've had a taste of what it feels like to have. You know public outdoor seating and to have more bicycles and less cars, but to truly get it done in a way that works. You can't be jamming it in bit by bit by bit. You need a holistic look at it. No, it can't be a free now, it's a free- for- all and it's just like the homeless situation. The shelter stuff he's just doing things on a whim and he's not going through the proper process with the communities that are affected. By what happens you just have we have to put it in. We can't let anything get by us. That's a piece of it exactly. Let's move on, because I can't stand till 10 o'clock, it's getting please and it's dripping all over my shirt and I want to take my shirt off, but I can't because of the zoom there you go, do not be jealous on that note. Does anybody have anything else? Well? Is there any other work we need to do? I have not set business around licensing and permits and it goes to terraces and roofs. We passed something in 2019 which, when I reread it and I used, I talked to Jeff Ehrlich about it, made no sense and it was gobbledygook. It was not written properly. Whenever the committee gave me the authority to rewrite it and to make it tighter in this day and time around roofs and what we have access to or not- and we do not. I do not have to belabor this I'd like you all to read it. We can bring it up as a new business. I do not know the parliamentary procedure tammy for on voting, but I'd like it to be it's rewritten, it's clear, there's only one sentence, I'm having some trouble with, but it's okay. Basically it's what we have and do not have authority over around licensing and noise and whatever on terraces and roofs. So you can read it. You can text me, but we do not have to deal with it tonight. Everybody can please look at it so that we can be. How was it Jen just sent it out to everybody on our committee pat and went to the executive committee? It went to the executive committee- okay, great thanks all right, so all of you should have copies of it and it went to the my license. The licensing, not my the licensing committee meeting. Does it need to get approved or worked on for Tuesday or it does not need to get. I do not think it needs to be worked on. I think it needs to be brought up and voted on and reiterated whatever that parliamentary procedure is Tammy, I can't hear you you're, muted, you're, still, muted, okay, Patrick, you got a parliamentary ruling, we've already passed a resolution. This is an updating one. So do we need to vote on it in exec or just can we bring it to full board? It's basically amended. Well, the all the whereases are not amended Patrick, but the body the I mean the whereases are amended. The therefore be it resolved. The three of them basically read the same, there's a type over two in it, but they read the same. So the therefore be it resolved stays the same, but all the, whereas is just make more sense. It flows. So I understand it's just more of like a drafting amendment. So yeah it's cleaned up, updated language yeah. Thank you very much run it through the executive committee. I think you just bring to the full board and point out that we, you know we cleaned up for clarity, a few things, and here it is because everyone will get a copy of that ahead of time yeah. But the sense of the committee is cleared yeah. Would you please go read it Patrick? Sure? Okay, all right! That's cool! All right! Lucian! You still with me yeah! Okay, so we've done we now. Can I get a call for a vote on the capital, an expense budget for year, 2022 sure yep I'll call the question I'll. Second, it great. I love when it plan comes together. All right, I am not doing roll call. I am just saying that, if does anyone are there any no's? Is there any abstentions? Are there any recusals motion passes, love it? Okay, that's good news. So I think that's everything we can do committee reports. If anybody wants to do a committee report, it's 8:55 we've got five minutes left. You can be super short by telling me no and just for three minutes after was you and good night I sent oh sorry, you have to wait because.",
            "summary": "I see we have capital and budget expense first, but I'm going to hold that I'm going to allow a Warren, Street, Cargo, Bike, Corral presentation by DOT.\nI'm a project manager for the movie unit at DOT, happy to be here to present and update you about our proposal for a cargo bike corral to be called mid block on warm street in front of the in front of one of the exits of whole foods between West Street and Greenwich.\nThis here is an image showing the cargo bikes operating out of the whole foods on Houston Street, using the space at the curb.\nBut, just like this location, whole foods on Warren Street, is working to use cargo bikes for their local deliveries as a pilot participant, they can load unload and stage your deliveries at the curb, but having a dedicated space with cargo bike rails can improve safety and efficiency of their overall operations.\nWe work very closely with NYPD dot's parking, division, commercial Bicycles unit and safety education team to help run.\nThis sorry this can help alleviate issues like parking on street signs, fences and trees to keep the sidewalk clear.\nThis will be partially occupying the truck loading zone, where the pilot participants, such as whole foods, is permitted to load, unload and stage their deliveries at the curb already, but having dedicated bike parking available with the Cargo Bike Rail Improves safety and also provides free, convenient and short-term parking for the public to use we're.\nTo show you an example of what the Cargo Bike rail could potentially look like is that the space will be marked out with bike racks, flexible ballers and markings in the outside lane.\nRail is this additional space allowed for cargo bikes to load, unload and stage their goods safely in the space which are which are not allowed to stick out of this marked out space or block the travel lane, so they can either park parallel or at an angle, to the curb, depending on the dimensions of the bikes and whole foods, will be maintaining the cargo pipe corals to ensure that they'll will be clear of snow and debris and report derelict bikes.\nThis bike corral is for whole foods so that they can load and unload for their deliveries right, but the public can use this as well.\nWhole foods is a private company that makes a huge profit, and so a city street is going to have part of its space they're going to get for free, They're, not paying for this parking.\nThat, add vehicle, miles traveled and create safety problems on the city streets, to delivery by cargo bike, and in order to facilitate That.\nSeventy percent of that space is whole food space and thirty percent Like Eugenia said: first come first serve and the racks are added bike parking for either shoppers or community.\nThey have to find a place off street to store their bicycles overnight, but in the process of loading unloading and staging they're able to use This corral, space-And, you know It just assists in making bikes a worthier option to make some of these deliveries, which you know during the pandemic.\nI think the answer is yes, but the option is that they as part of the pilot, the participants, can load and unload their bikes wherever commercial vehicles can load and unload, and they can do it in this truck loading zone You know they're starting to switch their operations over, but this space is a safer space.\nThink it's an improvement on just leaving at a truck loading zone and having that operation occur more haphazardly in that space, and that is a permanent, build out.\nI'm going to go next to Justine, just confirmed that's a permanent build-out, So that becomes a Bart a bike loading spot period as long as they need it as long as they're doing delivery as long as they're active, because there is no It becomes a 24-hour bike.\nI live on the east side and do not think it's fair for me to necessarily decide what they would prefer, but do agree that a loss of parking spaces in lower Manhattan is really a travesty, because we have very few.\nHe can afford to build a bike rack, but you know, or whatever else, is necessary for his customers to be able to park bikes or cars.\nWe also recognize that, in switching over from vans loading to to bikes loading that the space that was needed for truck loading, you know can now can now be partly taken for the bike loading, because it's a direct replacement of that same operation.\nNew York City was not laid out that way, and there are so many uses that DOT is trying to provide for the streets now by and large, where there are all of these multiple uses, commercial, vehicular, buses, bike, lanes, New, pedestrian, areas.\nThese cargo trucks delivered they deliver in front of my building instead of bikes, because they're delivering during this pandemic time tremendous amounts of groceries so to tell us that the trucks now are going to be in the in a lane where cars come and go, that this is going to avoid.\nWe know this, because there are several public bus stops right over there Other than convenience purposes, they chose to move their whole operation, or maybe they do not have to pay for the loading duct, but there's some reason that they stopped using the loading dock for the building that whole foods is in and focused on.\nThe district manager I in the past, I have received complaints about the Amazon delivery bans idling in the street in the area and in fact, I had to call up through you know, multiple different numbers of through whole foods, trying to find someone who I could speak to with decision-making authority to really register an actual complaint and try to work with them to reduce the amount of idling which they had tried to do, and it seemed to help.\nThey were mostly just positive feedback from for having additional bike parking, available, and one thing I'll say is: Maybe we can get as direct aligned to residents as we as we would want.\nDo they get space and nobody else in the community Let's not act as if we're talking about equity when we're talking about car owners getting their personal spaces preserved for them, because it's not exactly true in my neighborhood, yes, they're people with cars, many of them have their own parking spaces and do not use them around the neighborhood.\nServe, does not work when Amazon delivers 20 out of 24 hours a day, and is that something kimberly and anyone else from the team has considered a way to guarantee public access Absolutely our bike racks, which will be at either end of the overall bar corral.\nCorral are public, temporary short-term bike parking for the public, so the center space is meant for the cargo bikes and also open to the public.\nIf a person, a resident, owns a cargo bike and wants to park there, they could as well, but the intent is that the whole food cargo bikes would fill up the center space and then the bike racks at the edge are meant for the smaller everyday cyclists.\nThis is only used for a particular group of people, but the cargo bikes can't actually park at those racks, they're, not big enough, so the intention is, it would be for the smaller, typical bicycle writer.\nIs, it safe to say it's a request of the board for us to instruct whole foods to have their people not attempt to park in the racks on the side of the cargo.\nI also think that there's no way that any of us should approve it unless you have in writing an agreement from whole foods that they will not allow their own vans or any of their deliveries for the store to double park on Warren Street, and I think.\nAnd I support bike cargo because I think it's a really good thing.\nI just am not a hundred percent on the privatization of the streets and allowing you know they should provide their own employees for parking right for their own bicycles.\nThey will not allow their vans or any deliveries for the store to double park on Warren Street, and they will not monopolize the bike racks to allow for public uses and with that, I'm passing it off to deda.\nA huge community benefit people who want to go with their own bike to whole foods, who now might have to search high and low for something to lock to some sort of street Sign, some sort of sidewalk bridging they're going to have a rack there, that's going to be a huge amenity for the community, it's something that can be used by many people like the space before that could be housed only five loading or unloading vehicles and then possibly five.\nYou do not want cargo bikes on the sidewalk, making the sidewalk very crowded and hard to navigate and for them just to go in the commercial loading unloading zone with no protection, though that's also a little risky.\nThe sidewalk put them in that commercial loading unloading zone with protection plus a give back to the public that whole foods has to maintain, but yet they're not even going to be using those racks on the side of it, and that will be a huge benefit and it will be a benefit for a lot of people.\nI, mean, I think you know DOT views it as a good behavior to encourage on street and In many places it occurring on the sidewalk can be viewed as a nuisance for pedestrians or whomever.\nFor years, now, we've been getting requests from the community to add more bike parking, so we just saw this is another opportunity and to just go back with that.\nWe're at and making sure that our sidewalks are clear and making sure there's more space for people to continue to add just more street furniture and more you know, sidewalks is something we're trying to avoid and Just to you know also what Jeremy was saying with just safety.\n: We want to make sure that, with the cargo bikes constantly going on and off the curb.\nSo I think I have everybody's concerns in there, but actually one of the things I do add in there that there that the Community board has in one of the, whereas is that the Community board has expressed concerns about providing a private delivery area from taking public space to a private company.\nBut you just said to us: it was not going to be permanent and if it did not work, it would be able to be removed, so that yeah, so those installations can be ripped out, but they are, they are planted in the asphalt in a way that does not make that space available to cars, to pull in.\nSo we can truly see the behavior that happens and what it is instead of permanent and rip out, which we have a suspect that if it does not work- And, it does need to be ripped out, for whatever reason we're going to hear back from the city But we do not have the money to do.\nWe can certainly have a follow-up conversation if you'd like what I think the appropriate thing to do would be to have another dialogue with whole foods about size, shape, accessibility and see where we can go to make cargo bikes work.\nThis is the collegial discussion, my friend, and we are collegially, saying that we like and support some of the concepts and ideas we do not like the particular sighting of where it is, and so okay I think that we can make something work in that zone, maybe not as quick as you would want, and let's talk about coming back with a revised proposal.\nThey came to talk to us in Q4 of 2019 about permanently citing a new shelter somewhere in community board one and the meeting was very nice and they were very collegial We said we would be open to working with them because we are dedicated to helping the people who are on our streets.\nSo I sent a letter to commissioner banks and lucian can scroll down a bit basically saying you know what we have been willing to work with you, but you need to think of other locations, because William Street, being one of the two northbound streets in the historic district of Fidei, is not a place.\nFurther to that point, I want to say that DHS, with Leilani and project renewal came to quality of life again this year in July, to talk about the sighting of the temporary shelters first, and we had a very robust and very good working dialogue with them.\nWe do not have anything to opine on right now in terms of the move of the Lucerne men to there, The agenda is to say that the dialogue that we have with friends of Friday, open, hearts, there's, is going to be welcomed in our community board for quality of life, and things like that.\nWhat, we do not know, is what they're doing to help the people on our streets that we would like to be able to get shelter and the groups of people who are together, who want to move together.\nYou say that there'll be some sort of a task force or something where we're going to be discussing this further, because part of the issue, I think in getting the people who are already here off the streets is the way the DHS is approaching.\nAnybody feel we need a resolution to kick back at the mayor, to put it officially in writing from the Community Board one perspective, basically showing what we have done and saying we look forward to the dialogue, stop trumps and in the neighborhood and maybe come talk to us.\nYou, know to continue the work we've already done for sighting of a permanent shelter with Community Board one.\nSo, thanks to all the committee chairs for your work in discussing the New York City fiscal year, 22 budget.\nSupport of the city's green infrastructure, programs, sure, city parks and green streets have previous green spaces.\nI. Want you to know that that's against DOT regulations, what you're asking for, because that's why they won't give me a crosswalk at the end of north end, Avenue to cross Chamber Street.\nWe need to get most of the placards and the agency parking off the streets to the maximum that we can, especially if, in the new world of virtual with people not going in."
        }
    }
}