{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCB4 October 2020 Housing",
            "publishDate": "2020-10-26",
            "shortDescription": "Agenda\\n1. Committee Discussion: Temporary Homeless Shelters\\n2. Community Update: Ryan Chelsea/Clinton Center \\n3.Committee Vote: Fiscal Year 2022 Budget Priorities. \\n4.Old/New Business",
            "lengthSeconds": "2:11:48"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "N4qLcmbbD4I",
            "fillerWordCount": {
                "uh": 298,
                "um": 330
            },
            "readTimeFullTranscript": "80 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "services": 48,
                "health": 45,
                "street": 40,
                "guys": 37,
                "housing": 31,
                "patients": 27,
                "center": 24,
                "neighborhood": 22,
                "residents": 20,
                "work": 19
            },
            "wordCountSummary": {
                "health": 17,
                "services": 11,
                "residents": 9,
                "center": 8,
                "street": 8,
                "housing": 6,
                "patients": 5,
                "safety": 5,
                "mayor": 5,
                "care": 4
            },
            "fullTranscript": "We are now officially recording and we are going live on YouTube. Okay, great, thank you nelly good evening. Everyone thanks for being here, I'm Maria Ortiz co-, chair of housing, health and Human services, and this is our monthly meeting and our agenda and the materials for tonight's meeting are on the website the Manhattan community board for website. The meeting is being recorded just so you're all aware on YouTube, it's live streaming, everyone's going to stay muted throughout the meeting, except for whoever is speaking after the presentation committee will have an opportunity to ask questions or comment, and then members of the public who are identified as attendees on zoom can ask questions or comment. Sometimes what we do is on some items after the public comment. There's a discussion again among committee members and then we we vote to write a letter, a recommendation of a letter of recommendation or for support on a topic. Can you all see me? Okay, give me one second, that might be better. Let's see the last thing. I want to remind everyone- oh yes, so for attendees in order to speak on a topic you're going to have to raise your hand, you'll see it on the screen and if you're on the phone you have to press star 9 to raise your hand, star 6 is to mute and unmute. Are there any questions so far tech questions from any of the attendees? Okay good? There are nine. So first I'm going to switch up the agenda tonight on the agenda. We're supposed to have a committee discussion on homelessness. The Ryan Chelsea center is supposed to speak and then we're going to discuss the third item budget priorities for fiscal year 2022.. So what we're going to do? First, I'm going to switch it up a little just waiting for Joe to jump on. So I'm going to have Ryan Chelsea health center speak first they're doing a presentation, and will I see that you are on? Can you hear me? Yes, just waiting for Dan Pitchinson who's going to be presenting to come, so he should be on any. Second, so can will or charlene begin the presentation and then Dan will jump in wherever you guys are sure I can start great well. Can we see your beautiful face? Please, okay, give me one. Second! Thank you. Okay, hello! Everybody! Thank you! Oh, what's that okay hold on, I just lost the screen all right there. We are okay. If we could just start, I guess so good evening everybody, my name is William Arvaleta, I'm the deputy director of the ryan Chelsea cleaning committee, health center we've been serving the community since 2001.. Currently we are open. We have been open throughout the pandemics serving the community 70 of the patients that come to our center reside in CB4 or around CB4. We are a mid- sized health center with about 11 to 12,000 registered patients. Last year we had 43,000 unique visits. Our payer mix is approximately 55 percent Medicare, another 20, I'm sorry Medicaid 20 Medic, Medicare 15 self- pay which are uninsured and then the rest is private insurance. The mission of the Ryan help you want to go to the thank you so ryan, Chelsea Clinton is a sub- recipient or an affiliate of the Ryan Network Ryan Health, which started in 1967, which was established to meet the need for health care services on the upper west side of Manhattan as part of the war on poverty and the greater health care. Movement Community Health center started in the mid to late 60s. First one was in Mississippi rural Health, being the focus and then in Boston, and we were the third they said today. We are a network of health centers across Manhattan. Actually we just had a ribbon cutting today for our new site up in Washington Heights Ryan Wadsworth. So that's great so, like I said, Ryan Chelsea Clinton was founded in 2001.. If you're going to go to the oh hello, can you hear me hello? You can hear me okay, so I said, as I said before, our mission is to provide high quality, affordable, comprehensive and linguistically appropriate healthcare services to the medically underserved, providing high quality healthcare to those with, regardless of their ability to pay. You can go to the we are a leader in the Community Health Center movement, as you see, by the photo there. During the pandemic, we were open. Senator, Brad Hoyleman was generous enough to donate us. Those are about ten thousand masks which we have been our staff and patients have been using we're still going through those you can continue, as I said regarding you can go next, regardless of everybody's ability to pay. So, basically, actually talking about that, you can stay on this slide. We serve everybody regardless their affiliate pay. That means, if you do not have insurance you're, put on a sliding fee scale, which means that you can pay as little as 35 dollars per visit or as much as 105 visit, depending on your income and family size. Our hours of operation are Monday, Tuesday and Thursday, 8:30, 7, wednesdays and fridays 8:30 to 4:30 and we're also open on alternating saturdays. You can go to the so. These are some measures during this time that we keep everyone safe at our centers from our staff to our patients. So we follow CDC recommendations. All patients, visitors and staff entering the center must wear face master face covering. We also do pre- screening for Covid-19, asking the essential questions checking to see if anybody's been to any states that they need to be quarantined in and they'll also check for temperatures and symptoms. If somebody is showing it, you know answering appropriately for these questions, they get put into a screening into an isolation room where they're having further screenings. We also ask all of our everyone coming into the center to use proper hand, hygiene which is to use a hand sanitizer upon entry. You can go to the next story. We have visitor limitations, so basically one adult is allowed to accompany a patient for a visit. One parent can accompany a pediatric patient and no other visitors are allowed. We have screens, which I'll show you next partitions to help with social distancing and making sure everybody's six feet away. We do constant clean disinfecting of the center throughout the day and again we adhere to social distancing. We also have staff working from home so as to not to burden. You know have staff too close together. Obviously the layout of the site did not take social distancing to account back in 2001, so we have those who can work from home do work from home either alternating or on an ongoing basis. One example is our social workers are doing everything by a telehealth and they've actually been more productive and seen more patients through televideo and telephonic visits. You can go to the please, as you can see there. I do not know if any of you have been to our center, but it used to be a really open and airy and roomy place. Now we've had to partition them, so those are all six feet apart. We've with all the chairs six feet apart, you go to the please, as I talked about before in mar back in April, when the folks were quarantining or staying home or afraid to go out. Ryan's health instituted telehealth. So all co- pays and for these telehealth visits have been waived and they are actually. We are getting full reimbursement from the government until 2021. Right now so video conferencing with your provider works similar to in- person, visits. They review your medical history and you can basically have basically I'm sorry but we're continuing with treatment plan. Obviously there's some aspects of the visit that are not applicable during telehealth, but you can do follow- ups, you can have discussions and all you need is a private or semi- private, setting a good internet connection desktop computer and one of these operating systems. You can go ahead next and then here is a way to make the appointment. You can call 749- 1820 or go through the my portal account to register as a patient and go to the next one. So these are the current services. We currently provide anything from primary care to from adults, adolescents. We have pediatrics women's health. We have two dentists, who are amazing. We have a full eye clinic. We have case management depending on certain chronic diseases. You know various specialties on site, we have, you, know nutrition. We do prep and pap and HIV services. We do have sti. We have Covid-19 antibody testing available. We currently do not have nasopharyngeal swabs. Only in the case of a pre- op visit go to the. As I said before, we do have antibody testing available at ryan. Any questions regarding Covid-19 antibody testing make sure you just wait till the end. Okay, gotcha you're muted, but I understood your movie all right. We also offer at home HIV testing. We started out really slow. So basically you call this number and we will send an email to pro or you can send an email to Prep at Ryanhealth.Org and your response within 24 hours, we'll send you a free, HIV test through the mail and you have it and or pick it up at one of our sites and sit at home kit return it and you'll get a and you'll get a result started out very slow. I think we did about one or two a month and now we're doing about five to ten a week. So it's very good all right. We do have pediatric vaccinations available, one of the measures that has decreased throughout the pandemic or vaccinations, so it's very important for children to stay up to date in order to stay healthy. So if anybody, you know anybody who needs pediatric vaccinations, please have them come to the center behavioral health integration, so ryan Chelsea Clinton uses a collaborative care model where the provider, a social worker and a psychiatrist discuss the patient's needs. We offer depression screenings to talk about the behavior health conditions. We do short- term therapy as well as medication management, so the collaborative model helps to ensure that patients get all the care they need and if they need, you know something more than short- term care. The psychiatrist will sort of do a case conference and suggest longer- term care and refer them to another facility. Next question we are also ryan Chelsea Clinton also participates in the city's mat program, which is medication, assistant treatment, so there's Dr Sadiqiya our medical director. She provides buprenorphine, which is a non-, addictive non-, addictive sorry, non-, addictive treatment for opioid addiction. Patients are screened, they do a short- term, brief intervention, referral treatment and then they seem they're eligible. If they are too much in the in the in the throes of addiction, they get. They get referred to rehabilitation, but if they can take buprenorphine if they're eligible and if they're deemed the right fit, then they are on this regimen and they visit the provider once a week and they it's a good way for them to get off and they're. Also, it's also part of the clinical setting. We have a geriatric program. We have behavioral health support for patients who are 55 and over a social worker who specializes in in older adults. We also have a patient navigator, dedicated to helping them with their social determinants of health, whether it be transportation, whether it's nutrition, whether it's, whether it's being in a social setting and helping them integrate into that. We also have a robust HIV services program where we offer HIV primary care by HIV specialists. We do rapid testing on site for free. You do not need. All you need is an I d. You do not even need to be a patient and you get results within 20 minutes for those who are getting HIV care who are eligible. We do over offer case management services who will wrap around everything for social services, Housing transportation, food and such we are part of the city's Undetectables incentive program which helps folks, which is an incentive program for folks who are undetectable, who are living with HIV, who are undetectable to get a monetary incentive every three months. We also offer prep and pep services. We currently have 300 patients who are in prep who are on Prep, and then we well before the pandemic we did have. We were targeting priority populations with outreach and engagement events throughout the neighborhood and the city. We also have a robust cancer screening program. We have a grant dedicated to increasing our cancer rates. We have a dedicated patient, navigator, Technical assistant in training, and we have. We are part of the state's cancer screening program, which provides uninsured patients over the age of 40, with free cancer screenings, and actually today we had our Mount Sinai Mammogram Van. I think we saw over 25 people over 25 patients received mammograms in front of the center today, please, we have another patient navigator who is dedicated to helping our patients receive benefits that include Snap health, insurance, cash assistance, lifeline phones and other public benefits, and connecting our patients to these services is very important. So in assistance you know what we recognize is that assistance to Innocen in addition to clinical services and primary care services, we provide as I'll point out later on the social journals of Health Transportation education. Food insecurity are just important to somebody's health as them getting a check up every year, so we have identified that need and applied for grants or provided resource or obtained resources to help with patient navigation for all of our patients. Please. So here is a prepare screaming, as I was discussing before the social determinant of helps right. So what goes into your health? There are many different factors right: job status, education supports income as well as the physical environment. You live in other things like health behaviors right, so how you eat any addictions, you might have your sexual activity and as well as your access to care, these are all go into how healthy you are, how healthy you can be so we've developed. So we offer these prepare screenings to help us identify these needs in all of our patients, because somebody could be you know, could really have want to be healthy or want to have a partake part in becoming their healthy selves, but there's many barriers that we want to identify and help work on and provide assistance for. Can you go to the so again? Prepare stands for protocol for responding and assessing patient assets, risks and experiences right. So it's a screening tool to assess a patient's social determinants of health right, as discussed before our outreach team and our patient navigators connect the patients to community resources within their zip code. We do these surveys during a patient's visit or during our outreach, calls and right now we are piloting with outreach to any hypertensive high blood pressure patients right now and then, once we determine the success of the program, we'll expand it to the general patient Population, as I discussed before, patient navigators are, very one of you know is, are very vital, cog to the success of our patients being healthy and living healthy lives between July and September of 2000 of this year, we've had 532 unique out patients who have been touched by our navigators. What we've did what we've? What we've come to the conclusion of that care coordination with external agencies is important and vital to get these patients connected to the resources that we as a health center community Health Center can't can offer right. So you know home health, so you know working with other agencies such as you know, housing agency will work well with you know, breaking ground housing conservation coordinators and make referrals for the services that the patients need. We also connect folks with health insurance applying through the marketplace and as well. As I said before, Snoop Snap and pantries in the neighborhood other services that we that we provide include transfer arranging transportation, we have elite, we have legal services, we have a lawyer coming once a month to one of our sites and to help them with housing and other types of you know: immigration law, not criminal law, also providing assistance and support. As I touched this from phones to referrals to behavioral health nutritionists, employment assistance and such go to the this is something I'm not aware of charlene. Do you want to talk about the here for you platform, charlene on the line? Did you just she unmuted? Oh okay, sorry now, I'm unmuted yeah! So, okay, so we're on the slide on the collaboration with breaking ground in the male units. No we're not there! Yet we're on the airplane platform launch the one before that. Oh okay, sorry! I did not have it yeah sure, so I can talk a little bit about the here for you. So on there we base the platform off of bertha and patients are able to enter in their zip code and it'll give them the resources in their area that they're most interested in so far from our Qi Department we've had about 400 or so searches and the most popular things that people were looking for was connection to housing, food security as well as health insurance connections. So we've been able to to reach out to people who've used that platform and follow up with them and see if they were actually connected to those services on site. Great all right, we can go to the Star Charlene. Actually, so Charlene is our community relations coordinator and she's heard she's tasked with outreaching to the neighborhood to strengthen existing relationships, create new ones. So she's going to talk about community outreach right now, yeah. So I mentioned this earlier today in our other meeting, but we've started a new collaboration with breaking ground and we've been using our mobile unit and visiting different areas of different hot spots in Midtown and kind of closer to Chelsea area so places where there's high rates of homelessness reported high incisions of substance use, as well as people who are accessing free meal services through local churches and other pantries and with pairing with breaking grounds. We're able to visit those locations have direct contact with a lot of the individuals provide services like flood blood pressure screenings glucose screenings, we've done a lot of food vaccinations. Within the last few weeks we successfully connected a new patient to care on site, as well as enrolled two new people into our map program. So that's an ongoing outreach effort that we're looking to continue with breaking ground and potentially also bridging, more connections with other organizations that are doing similar types of work within our neighborhoods. So thank you Charlie. So the we have a mobile medical van that goes out and does all these also provides all these services showing said- and you know he goes to Hudson guild breaking ground- has been a tremendous partner for us. You know bringing you know. We brought the Van to the people or bringing the people to us, and this is a great way how we can help the community beyond the four walls of the center. So I will. I just want to give a shout out to our team, because throughout the pandemic they were coming to work. You know a lot of them got infected, had to be stay out for two weeks and came back healthy and ready to go. We really did not know in March and April. You know what the what the next day was going to bring but they're going to be throws of people coming to get tested. There's nobody going to show up, but one constant was that our staff was ready, willing and able. You know to take care of the community, and you know I just want to. I just want to applaud their efforts. You know for them coming in and taking care, and now that you know we've gotten back to our. You know: we've gotten back to our pretty much our pre- covered levels. As far as visits I mean 80 of our visits are in person now telehealth is about 20, although we'd like to keep telehealth in order just to maintain just to make sure not too many, you know not. We do not get too many people in the center for social, Justice and reasons yeah, and these are just some of the athletes. So you know we've gotten awards and we are joint commission certified and we are certified level three patient- centered medical home. I think that's it right, yeah. Any questions I think Dan is on the line now too somewhere. I'm sorry that I'm having a wifi trouble, I'm the executive director, I know, will one was very thorough, so I just want to tell the community board members get your flu shot, get your flu shot, get your flu shot. Tell your friends and family get your flu shot, so we're going to we're developing a partnership with New York City Department of Health Mental hygiene, we're probably going to open up the center for about eight saturdays that were not usually open and just do mass flu shots for the for the neighborhood so more to come on that thanks Dan, it's actually a population for when there's a cova 19 vaccine is there's many channels that the vaccine will flow through and one is through federally qualified health centers such as us, so we're using the flu shot the flu season as a dry run for when the vaccine is raised to vaccine to vaccinate as many people as quickly as possible. So so it's two one is good public health and one is strategy for getting to the pandemic when it's time. So I was having a issue, but thanks for having us thank you Dan! It's fine that you had. Some troubles will got it. You did good well! Thank you. I do have a couple of questions before we go to the the rest of the committee. Members Dan do not go away. Yes and Charlene and Dan Stay also, I forgot I'm sorry. I wanted to mention that on the attendee side we also have, I noticed we have Emily Bart. I forgot your last name, emily, I'm so sorry, emily bartosak from Linda Rosenthal's office and we have Jordan who is from the speaker's office just wanted to throw that out. There also great collaboration with breaking ground on doing that. Just some quick questions did you say: 25 medicaid, well, no 50, 55, oh 50, to 55 Medicaid management, oh okay, and then I was curious about the trends that you're seeing related to Covid-19. If you have that kind of data or information, so Dan you want to take that one did. I die, I mean myself or dammit, no you're good. We hear you, we hear you so in terms of if you're asking about like Covid-19 antibodies seroprevalent, we offer that for our patients and become a patient. So right now we're about at our center about 21, which is kind of what that what the rate is for Manhattan, so in general, a little bit higher than for what the West side is so, but we, but, as people know, cover 19, has been disparately, impacting individuals from communities of color individuals who have less access to things to overcome social determinants of health, so health center patients are more likely to have Covid-19 than individuals with private doctors. We've seen a higher rates of screening for depression and anxiety, which is being seen around the world really nationally, so we're our social workers as well said, have never been busier and we're still trying to direct people to the appropriate care we've reached out to fountainhouse and also Hudson guild a little bit. Thank you and you said, 21 you're talking about I'm sorry, you were saying the number of people who are getting coca testing antibodies, yeah 21 of people who have had an antibody test at our center, which is several thousands now came back positive, meaning that at some point that they, according to science, at least as we understand it now- is that they at some point were either had Covid-19 their. They were exposed to Covid-19 whether they had symptoms or not. That's not to say that the negatives is, I mean they're still up to debate, whether you can have had it and be negative right. Okay. The other thing you just mentioned about the higher rate, your screenings you're, seeing higher rates of depression and anxiety. I actually had a question about that: how your behavioral health staff? How many do you have in your behavioral health staff? Again we have about three and a half at Fte like three and a half social workers psychiatrists. We do not have at our own center we're actually going to be engaging in conversations with the fountainhouse around it, but we in our network. We have psychiatrists that are 96, I'm sorry 100th in Amsterdam, so we can make referrals up there, but there's a there's, a shortage of psychiatry and community settings, so there's kind of a wait list which, unfortunately yeah and so the our providers also you know- are: we do have a social worker on site once a day. At least you know, there's one social worker on site, they do a rotation and they do you know we do they do our providers and our navigators do warm handoffs to ensure you know, transition to care continuity of care. We also do virtual warm handoffs also as well, and are you seeing any trends? I'm curious. I do not know if you would have this data either, but are you seeing any trends related to homelessness? You know that's a big issue for us in the community right now I mean we see we're seeing more homeless people or who identify as homeless at registration. I mean both of it is because of these hotels in the neighborhood, and we have not really seen an uptake in current paid in long- term or patients who are registered pre- covert experiencing homelessness. Yet- and I think that's not eviction, you know the no eviction. So that's why we have not really seen that yet and the social determinants of health screening. I think you already mentioned this. I was my thought was when you were speaking about it. If there was anything significant to see before that, you were seeing when you were doing that screening. But if I'm curious it sounds you know. The thing is, I did hear you talk about the here for you platform and it sounds like housing. Food security and insurance are the main things, but I was curious when you're doing that other screening, if there's a repair screening yeah, I do not really. I have to get back to you on that again we're in the pilot stage right now, so we're just focusing on folks who have hyper, who have high blood pressure. If you give us yeah, I can get back to you with some data on that yeah. I would appreciate it. Yeah just follow up with me tomorrow or early next week, and you know I can either get you to get to the information or I can connect you to Sharmista, who is our population health manager? Okay, thank you and my last question. Are you seeing an increase in people coming in getting their flu shots compared to last week? Oh, yes, okay, good and als. Also, it's we're not we last. You know. Since I've been at Ryan Chelsea we've had just you could just walk in off the street and anybody can get there well. We did have like flu shot hours, tuesdays and thursdays, but we never turned away. If somebody wanted to get a flu shot, you know they could just come in outside of those hours. Now you have to make an appointment there's just we just do not have the capacity to you know to get. You know anybody just coming in we. You know we encourage everybody who comes in for a visit or physical to get their flu shot. Then but you can come in, but you have to make an appointment to get your flu shot just because the demand is so great. I mean we're lucky also to be part of this: a city program, vaccines for adults which provides free vaccines or low- cost vaccines for adults who are uninsured. So we do have a nurse a registered nurse who's dedicated just to do that, and you know the vaccines- and you know, he's been invaluable- this flu season, because he's just doing flu shots all day and all night if we were open. Thank you. So let's go I'm going to go around the room on my screen and see. If anyone has any questions judith, you are the person right next to me. No questions comments concerns okay, Betty, okay, Leslie Williams yeah. I had one concern: are you? Is your funding being affected by Covid-19 at all? How secure is your organization in terms of funding Dan? Do you want me to take that? I do not know where Dan went to Dan Lee he's back he's back. Did you want to you want me to answer that question or do you have it? I do not. Oh the question is from Mr Williams. He says he asks. Has our funding been affected due to the pandemic, so I'll? Take that one? So yes, so while this, while the state is reimbursing for telehealth in ways that it never did before, is that so we have certain programs that are grant funded by the state of New York when we, the state, is withholding 20 percent of everything that we have, that they owe us. So they say it's due to they're managing the state, the health Department's cash flow. So we are now delivering 100 of the services and getting 80 back on certain state grants around HIV cancer screening. So we are optimistic that the health, the department will make good and send us up. I mean yes, so we are praying that the state will give us the money that we can do that day that we are owed. You are Leslie, that's it yeah! Okay, I'm wondering the number of unemployed person coming into the office your office versus what you had last year prior to the Covid-19. Are you seeing an uptick on that an increase in the number of unemployed people who once had private doctor and now no longer have them so we're seeing up it's just in the last two or three months, we're starting to see an uptick in people with Medicaid, so we're primarily medicaid, but we see the number of individuals with Medicaid growing and the numbers within private insurance, so to speak declining. So that would tend to go to your point is that people who pri previously had a primary private insurance are now accessing Medicaid benefits so and we're trying to tell people and we're, and we would encourage the community board too. If you know, people who lost their job and do not have insurance or need access or recently obtained Medicaid tell them to come to us if they live in the neighborhood, please what are their nearest guys, we're tracking the number of visitors Medicaid versus the Medicare individuals that now Medicaid? Sorry I missed that one yeah, I mean we track, we track the payer mix. So how many folks, you know and we've seen a an increase over the Dan said over the past couple months of more folks that make it that's the e that's the best, the most accurate barometer of folks who you know who are struggling financially right if they had private insurance before, if they're no longer, you know, they're become self-, pay or uninsured. You know that is that's a good barometer. I think what happened is when people were furloughed. Many people were able to keep their insurance during that time period, but as furloughs turn into something more permanent, then it goes from further to layoff and that's when people start to lose their insurance and some people use money to carry on with cobra to maintain it, but then after fun, you know it gets very tough. Do I pay my bills? Do I pay my cobra to try to keep my insurance? It's a very challenging decision. Individuals make and please, if you know, people who need health, insur health care, send them to us or their nearest community health center. Yes, and next would be Jessica sorry about that background. Hi. Thank you and I want to just acknowledge how difficult and challenging it must be to continue to work or to have worked during the pandemic. I also work for a nonprofit that was providing direct service and I know how challenging it was so from one to the other. You know congratulations on persevering and doing this important work. I was hoping you know just again as someone thinking about how to continue to fund my program scale. A program meet community need like there was this question about funding. But what is your like? What keeps you up at night? What's the biggest issue you guys are concerned about right now? Second wave! Yes, the second win is you know we so second wave because as public as a community center, our job is also to do wellness and public health education. So to tell our patients, you know, everybody's got fatigue around this. You know it's very hard on every level. Parents, families, people who are living by themselves, yeah and financially. I do get nervous that the state of New York is experiencing an unprecedented deficit in terms of funding and will they reduce funding to health or social services in general? You know the governor has said that he's thinking about you know 20 the board reductions for every sector. That's unprecedented! Really that in our time so- and you know to add to what Dan is saying- I mean you know we were lucky or skillful. However, you want to put it that we were not. We did not have to lay off any one of our employees, except for our two dentists were furloughed for a couple months, and that was because of the American Dental Association's restrictions on dental procedures, but as soon as we were, we were able to. We brought them right back, as Dan said, you know the reductions that the governor is proposing. I do not know if he'll be as lucky next time. If we'll be able to, you know, keep everybody working. Thank you thanks. Jessica katie you're up next, then dolores, hey, I'd like to first say what or to duplicate what Jessica said, but I think the fact that you guys have stayed open the entire time and not laid anybody off, except for the two dentists given the Dentistry rules is phenomenal very good. But I do have a question and I'm sorry if I missed it- or maybe I should know the answer already, but why is it that that you're, not that you're only doing the antigen testing right now or the antibody testing, and not the Covid-19 itself test? And I guess what I'm wondering is for people in the community who think they may have Covid-19? Where are you sending them if you can't do the testing there? So there is a city testing site which I have the address in my office, not in my bedroom, the Chelsea center, it's on 28th and 9th thanks part of it is that if we do testing is that there's a lot of protocols around keeping the rooms? We do not have that many exam rooms. So once somebody comes in and we're doing a test on them for Covid-19, then that room comes out of service for about three two to three hours. Roughly. So if we had like 10 people walk in then, essentially we would cease to function when we already have about 140 patients scheduled. So that's why we're not doing it plus it would burn through the PPE more than and we're trying to conserve that in case there is a second wave and the city is being able to do. The city is able to do that. The city actually does a great program, so you go online. I do not have the link, but if you go to Nyc.Gov and you can go and make an appointment in your neighborhood center and they have availability and you get the results within three hours. It's a very s. You know you, they have an appointment, it's like it's totally free and yeah you go in. I mean I actually went to get my test done on 28th and 9th, and it took less than half an hour. Quick question. You guys did do cover testing before right on site. Very limited yeah in the beginning limited, but you know there was you know, we're actually still short on nasopharyngeal swabs and again, as Dan said PPE, you know we were, you know, had we done full scale or large scale testing. We actually closed one of our sites in Harlem, our frederick douglass site, and this actually just because of the lack of volume we transferred them over to our site, a few blocks away from it there the state actually used that site just for t as a testing site, and it was just closed. I think in at the end of August. So thank you, but the city does a great job for testing. Thank you. Okay, thanks no questions. You guys do great job, thank you for being part of our neighborhood and providing services that you do and then nelly. If you have a question, you're welcome to ask Martin yeah I'm having a food shop. If I come down with symptoms anyway, should I get tested and I come down with symptoms? Should I get tested right away? Yes, if I'm understanding correctly, is that some people in reaction to the flu shot get like a little bit of a fever yeah. So what the doctors have been telling people is that, if you're in a high- risk group, if you have- and I'm not a doctor- but this is my understanding, if you're in a high- risk group or have some sort of conditions and think that there's like you have not just been quarantined in your own in your own space and you might have been exposed- is to try to get a test. If you're not in a high- risk group, they say, and if you know, if you have a fever- and it's not going up, you know just wait a day or two and see if it goes away, because if it goes away, they say it's not likely go ahead. But if you're in a high- risk group, we should get tested right, okay and we have Joe Hector and Jd Joe just joined so hector and jd hello. I just wanted to say: oh I'm still, muted. No, I'm not! Okay! Thank you very much for all the work. You folks do incredible work. Both my kids went to Ps11 and also attended the clinic that you guys had many years ago, and I'm really amazed that you guys were able to carry out everything from these epidemics and continue to stay open and serve the community. The way you guys have been continuing the good work, I appreciate it. We all do thanks. Thank you. Thank you. Yeah, you guys do a terrific job community, the neighborhood, your doctors are very dedicated, just very dedicated. Please keep and I think Joe, and I can remember when you first came into the neighborhood not that long ago, but you are real positive member of the community. So keep up the good work and thank you. I do see one public one attendee has their hand raised Lucy Ellie. If you could bring her over lucy, you can speak now. Can you hear us yes, hi Lucy. Did you have a question or a comment regarding the presentation that just happened? No, oh okay. Your hand was raised all right. Thank you. Thank you. Will Dan and charlene for being here. Thank you for having us and thank you for all the work that all of you do on our behalf. Yes, thank you. I will see you soon. Thank you. So next on the agenda, we have a committee discussion regarding homelessness and, while I know Joe, you want to put the letter up so while we're, I guess doing that because I'm I do not think I have it, I'm not on my computer, I'm on a tablet. Yeah, it's okay, Nellie's got it, but what I just wanted to share briefly with everyone was just some of the things that we have done. I actually it's in the letter, but I think I wanted to share anyway with committee, because I'm not sure, if they're clear about how much CB4 has been involved in meetings myself Joe. I do not remember dolores if you've been in on any meetings, but it's been a lot right now. It's about 20., I think today I was on two of them, so it's a lot talking with non- profit, provide providers in the community and listening to community concerns. We've talked about staffing. We've talked about security at every site. We talked about the services for clients, asked about the number of staffing and it's been really challenging. I think since may I'm just giving a little quick recap. I think we've been discussing this at committee since may it's come up every time on the agenda, which I think is significant. I have never seen that I've only been on the board for six years, so it's not as long as other people, but I've never seen an item brought up at every committee, which is significant to me and we've written, I think Joe. This is our third letter or fourth letter. Fourth, our fourth letter and this one gets into the details. It's 11 pages, if not more, we highlight the number of social services in Community board, 4 and that have already existed, and then we add in the significant increase due to relocation sites, and we talk about what our main concerns are. What we would like to see happen, the one thing that I do want to just add, because I today I was on a meeting with Skyline and I have to say it was one of the most productive meetings. I thought that I've been on in a long time. The other meeting that I can think of that I thought it was pretty not significant. That's not the word, but that it went well and the nonprofit provider was open to suggestions and also very responsive, was bvsj on 57th street right and is the letter? Oh that's about it that I wanted to share, really highlight for right now, yeah I had board had one gone over the top on engaging with this issue. These meetings happened during the summer. They were pretty much just thrust upon us and Maria has carried a big part of that burden, but I also want to thank a lot of the committee members. This letter really was a product of a lot of back and forth among committee members and, if anything, it got better during the course of this letter. This was published today at the Community Board website nelly. Can you go to the map at the end, so I think this is significant. Look we produced a map of all of our social services, pull it down a little bit nearly so they can see what the types are. First, no down other direction right, so we list temporary homeless, shelters, the relocations homeless, supportive housing and homeless, shelters and facilities. And if you pull it up now nelly, you can really see that our board is not a board that has said no to homeless facilities, whether they be temporary, shelter or permanent housing. So the idea that these temporary relocations happen in a very unordered unplanned way and when you put it in perspective, the city noted that it relocated approximately 10,000 single adults in shelter and to our neighborhood now originally we're 21 2142 now there's 1803. That is roughly 20 of the entire relocation it did in the city of New York, and that's why I believe we have our problems regarding this public safety issues, because it was not planned, not thought out and the building types that folks are relocated into for the providers and the shelter residents are just not adequate or properly programmed for that and then on top of it. We've had an increase in street homeless and the combination of a great number of people with many social service problems have also attracted a great number of people dealing drugs. That's been a huge issue on thirty on thirty six straight unions, from 10Th Avenue and on 42Nd Street. So in total we really have a not a social service issue only but a resulting public safety crisis that is resultant from this poor planning. I really encourage all the members of the committee and members of the public go to the Community Board website. This letter is now up there nelly. You can probably put the link in the chat, so people can see it and we just wanted to update where we are. This letter went out. We expect that we will be engaging with the department of Homeless services in the mayor's office sometime the next two weeks. I believe we've taken a very thoughtful considered position, but this administration- it has not exactly been the most thoughtfully, considered response. So, given that I would open up to the committee for any comments about next steps and then we'll open up to the public for comments also, you want to if you can take the map yet so anyone can raise their hand, I'm kind of Marie. If you can see everybody crawl on like this, I really can't see everybody at once on the tablet. You're. Muted. Thank you katie thanks. So I am just curious. What next steps are and Maria and Joe like? I know you guys- have done so much work and you've attended. So many of these meetings are there going to be more meetings coming up? Do you want any of us to volunteer to help attend or cover? That would be great? Yes, okay, I mean we're supposed to start in October. I do not think it's scheduled yet Ab meeting, meaning that the Community Advisory Board meeting for all the shelters together and Jesse's going to be running that so having more than one of us on that would be excellent because the problem is there's so many hours in a day, katie right now, I'm sure, with our letter, requested a meeting with the mayor and the Commissioner Steve banks. So that's what we're looking to do to put together a working group to figure out how can we come up with a plan to manage to reduce the population, increase the services and manage the public safety stuff? That's our that's our big request. So what is mine about how they're going to respond? I believe we're getting clearer and clearer with the issue. Yes, I just wanted to add to that. There was a meeting I was on recently with Micah. I believe it was on 36Th Street, and I know that they're going to be using be able to use like Metro Baptist space starting this month for some programming. I do not know how often that's going to be it sounded like it was a pilot, and what I heard on the meeting, also I mean, was adding additional security at some point at this. During this month I mean there's things at every site. That's being talked about it's just really hard to. There is no overall plan. That's our problem! Yeah, there's nothing consistent and across the board shipping there a little bit. A pilot metro baptist is not going to serve 1800 people just not going to do multiple locations and something that we also mentioned in one of our letters is DHS also having like protocols in place, for which would be great for all the sites, something consistent and across the board like, for example, having the Qr codes, which are for oversight to ensure that people are going to the location that they're supposed to when they're doing. Let's say security checks, so they're actually doing rounds so yeah when they're doing rounds, as opposed to saying they are and really just not doing it. Yeah and Jd is raising his hand. Yes, the skyline up on 10th avenue between 49th and 50th. The situation has improved greatly. I so the question is: why has it improved and can that whatever work there can that be taken to other problematic shelters like 6Th, Street, great question, jd, something that actually Joe has discussed it and talked about it before openly in meetings? And I think it's very true- and we all know this kind of common sense kind of thing is that you, as a nonprofit provider, you bring a certain kind of culture. You have a culture that exists at your facility right and certain things are considered acceptable. Some things are not, and it's just how you are managing your staff and managing your clients and so, for example, with the skyline. What someone actually shared in a meeting today was that they were actually telling their clients. They can no longer hang out in front of the skyline, their clients and she actually shared that clients have been upset about that. So that's something significant. I think it's just about having a level of like what's acceptable and what's not acceptable and I'm sorry guys. I'm sorry! You need to come in or you need to keep moving. You can't hang out, and I think you can do that and also have compassion and empathy right, but it's also about what is going to be tolerated and accepted right. I really believe it is not surprising that black veterans of social justice does not have a major problem at the Watson on 57th street, yet we have a huge problem with Nica. This is a organizational culture, organizational management some have been able to manage betters others not, and therefore our community is suffering and the funding agency DHS must hold those providers accountable. That's just basic how you work social services and this, if you, if you're getting funded, you have to provide it and you have to provide in a responsible way and if you have security issues you have to raise, it is our job to keep people's feet to the fire and, I think, really sitting down with the mayor's office in DHS and coming up with a plan as to how we're going to manage this. That's the key here and Katie. I do not have school, but they have not really talked to us. Yet that's the problem and my ques, I'm sorry just to follow up. My question then is: is there a deadline for them responding and if they do not respond, then what well? What do we normally do? Jd? Well, we keep at it. We keep at it, but I think sometimes it's good to have a deadline to say if we do not hear back in two weeks or three weeks or whatever it is, and the situation is still out of hand, then we need to hit again well. We actually did ask them for a meeting if they do not respond, but in this month they're going to get a very bigger broad ride next month from us, and it's going to be very public right. Well, one thing that was supposed to happen that I think would be helpful actually, but still has not and there's no date for it. Oh, I think you mentioned it already, joe we're supposed to have like a district- wide cab, and we have not heard about a date about that. Yet I announced our September meeting to happen in October. It's October 15th, guys yeah Buddy. First, you guys are doing a great job. It is amazing and the letter was in a monumental document. I had not seen the map before tonight and you know I love the map and I also had two other thoughts in dealing with the mayor's office and DHS. To make the point when you said that 20 percent, if I got it right of the temporary shelter, hotels, are in district 4:20 of the 10,000 single people, relocated in the city or the borough or in the city in the city. Okay, so I would think it would be nifty if you could make some kind of bar chart or pie chart or something that just shows that you know it to just put it out there. I think it's a dramatic statistic. So that's one thing and the other thing is for those facilities that are doing it right. You might make something very simple in terms of what factors make them succeed and so it's sort of almost like a no- brainer for other facilities. This is my two ideas and you just keep going thanks. Betty and dolores I'm sorry. I went over you, I passed you had your hands up you're virtually here everybody's comment is valid Joe. You asked the question: what do we normally do? What we normally do is we partner with our elected officials? I've been on record, saying this and I'll continue saying this. We have a complete political vacuum, we're not being supported by the people that can make the changes happen. Everyone on this committee. Everyone on this board has been doing everything in our power we've written letters. You guys have gone to endless meetings. There have been walk throughs. There have been proposals for community members to do actual their own cleanup on their streets. For I mean I can't remember the sli. What was that our full board meeting the guardian angels they're coming back to our neighborhood? I mean I remember them as a kid throughout the neighborhood, everybody on our side is doing what we need to do. We do not have political support, so there are plenty of ideas, not just from us, but from other members of the community that have been coming up over the last few months and they're great ideas and a lot of them are implementable. The problem is, we do not have political support and we're not going to accomplish reducing that density or pressuring any of these facilities to go ahead and provide the services needed to ensure the safety of those residents and the safety of our other residents. Unless we have political support, that's as simple as that, and let me just chime in we have some political support, but not all of our elected officials who cover this district are supporting this cause, which I agree with you, dolores, is is part of the main issue is: does anyone else, Wanna, Ojd and then Leslie just to follow up on that? Can we request a sit- down meeting that is we lowell the Community, Board Maria and Joe and Lowell to sit down with Corey or Brad and talk about this? Is that out of out of the question, I would just say we should to have a sit- down meeting with everyone together period yeah, I'm not to single out anybody. There are some people who are more beautiful than others. Let's put everybody in the same room and talk this through yeah in the same zoom room yeah. The other thing I want to highlight jd is that when I was talking about the 20 meetings, almost 20 meetings- or I think it's maybe today, 20. today makes it 20. I think the speaker is usually present, so I mean I yeah. The speaker's office is usually present. I think I'm sorry to interrupt you, but what Joe just said is important. The speaker's office is at all of these meetings. The speaker's office is being very proactive, they're on the streets, walking with you they're in all these meetings, they are doing the work. Corey Johnson is absent. Corey Johnson has it in his power to assist in the density issue, to assist in working with DHS on these facilities, providing the services needed for the public safety of those residents and the other residents within the community, so Cory's office is there. Cory is not, and that's what I'm calling out political vacuum completely. He is the speaker. He should be actually doing the work yeah. I just think that we're starting to get some ideas here at that. What the next letter coming out of this committee for this month and that is working for a meeting of all the elected officials with the board to really sit and respond to us on the letter that we sent we're. Also, as Betty noted, I'm sorry, I'm forgetting what you said. It was perfect. Having a covered moment, there were two things right and a chart showing the 20 of the city, which is an amazing statistic and also maybe the like the 10 qualities that make for a successful facility or something right. So I think that's a great idea with our follow- up letter, saying now that we've asked for this meeting with the mayor's office and the administration also meeting with our elected officials to deal with this, because we have to keep the pressure up to get people to engage. I do believe in the end everybody will engage here. I do believe this. Could it just take way too long and there's way too many problems happening that are not being solved? It's not going to help us get a little more security. It's if it's a disaster, leslie yeah! I think that's also a bottom line issue. Somebody is making money out of poverty and that needs to be addressed. Jessica yeah, I just to underscore the the point about moving quickly. I'm sure I mean you guys are a lot closer to this, probably too close for your preference, but the press you know like the Lucerne topic, is like I'm hearing it every freaking day on the radio you hear lower Manhattan residents talking about how they do not want these places moved there. You are advocates talking about how you know these individuals should not be moved multiple times. They are all valid and important points, but I think dolores her point is right on a few different levels, including like we really need leadership to come up with a plan quickly and execute that plan with. You know a high degree of confidence that this is the right plan. Otherwise this is going to just going to continue to be it's going to be fed by people's concerns and ongoing community debate, which obviously we're all for we're doing it here right now, but I just I'm really concerned that it's going to be almost feel impossible to find a solution that keeps everyone happy and that the more that the media focuses on this. The more we're stuck with this problem right and also from the point of view, is we're not talking about a day now. This is a very good possibility. A lot of these temporary shelters will be in place through next summer through next spring, and I do not think not any of us can bear to live in this manner. People on 36th Street now on 10th Avenue is a little bit better, but who knows, as we have to get some standard practice on how things are managed, otherwise we're going to go down to a black hole, again wait! Jd before you speak again. Let me just check in on hector and Martin to see if they have anything, they want to add hector yeah. Actually I do I agree with dolores and about Corey Johnson's office. I do appreciate that Eric and Carl, and some of the other individuals that worked for Corey Johnson's office is representing you know representing him in some in most of these meetings, but Corey Johnson himself has not been present, but it can't all fall. You know at his feet. Obviously I mean the bug: stop stops pretty much at the mayor, okay and let's face it. The way he's been running this these programs and the way he's been implementing this emergency hotel shelter locations has been really pitiful, really bad leadership as far as I'm concerned, and I'm sure, there's probably a bunch of people in agreement with that as well. So it does not just stop at Corey's office. It's actually, you know the mayor's fault as well, if not, first and foremost because they run the agencies. So exactly, and it's not only that DHS I mean we could. We can basically say they've failed in a lot of the tasks that they're supposed to be responsible for, but honestly, it's it's a whole factor of things. You know as far as I'm concerned, DHS, not you know, following the mandates of the mayor, obviously, and trying to implement his policies has fulfilled in a lot of regards. I know they're struggling there's some good people in DHS that we've dealt with but honestly it's time for some really good leadership. Here I mean if the people in DHS- or you know, can't get the job done. Maybe we should try to find somebody else who will you know? Let's vote them out it's a voting year. Let's change things up, yeah! Okay! Thank you! That's all I wanted to say thank you yeah. I think I think a meeting with the electors if we can do it, is a very good idea and also, I think we can be very specific- we're not going to solve the whole homeless problem throughout the city, but we can certainly be very specific about 36th street. That is something that needs to be solved. Those people are frightened and that's something we can focus on. We do not have to say solve the whole issue, but we can focus specifically and, as Maria pointed out, some and Joe pointed out. Some operators are good and we can focus on the ones that are not good, and I think we could probably get some results. Martin. Oh I'm are they members of? We have a lot of members waiting. So that's why I want to continue katie. I think this is similar to what or follows on to what Jd just suggested as well. To be honest with you, I feel, like we've had a lot of meetings. I think we are. We are super clear on what the concerns are and it's you know around 36th and 37th street, and while I certainly appreciate it's a good idea to ask for a letter, I actually think that it would be lovely and faster if we said wrote like a one paragraph thing. That said, you know Dear Corey, Johnson, Dear Mayor. We want you to sign this saying that you support a request to De- densify, the 36th street area. We want at least one of those places shut down in the next month and find by us again. We support it find by us if you put it somewhere else in our district, but it can not be, you know so dense and I think if we just make a very specific proposal and ask them to sign on to it as opposed to like come talk to us some more because I we've done the work, we know what needs to be done. We have a solution and we need them to support it. Well, I would say just getting them in the room alone is the first goal, because no one's going to sign anything because they believe, unfortunately, DHS believes they're doing the perfect job right now. They acknowledge there are some issues, but they're very invested, so just getting them at the table. I believe Katie is our first step joe. I think it's also important to point out that those specific elected officials chose not to sign on to Gail Brewer's letter, so they're avoiding dealing with 36th street. It's unfortunate and I just wanted to just say hector- I'm not blaming Corey for the for the situation, I'm blaming him for the lack of leadership, because in the end he is our council member and our council. Members should be fighting for every single resident and that's not just residents that have been here, pre- pa pre- covered, but the residents that are also here now, so those shelter residents are not being fought for they're, not getting those services and those that live on. The block certainly are not being fought for in terms of having to deal with a very rapid change in their community, which has become a public safety issue. So can we now go to the public and nelly? Can you see that Maria the hands up and start bringing people in one at a time, yeah and nelly? Can you see her or I do not know if you could just unmute them or bring them over? I'm not sure what you do. Yes, can you hear me we can hear you yes, okay, thank you. I can not tell you what it is like to listen to this meeting and realize how profoundly you understand the issue that we're facing on 3016, and I thank each and every one of you are everything that we hope for in a democracy. God bless you. I am going to give you two new thoughts that I had, because I think about this. Every day I just googled the population of the upper West side. Today there are 100, seven hundred and six residents today on the upper West side to have a sense of what we're dealing with down. Here on 36Th Street, a shelter population on our block, twice the size of the number of residents, imagine 202,000 shelter residents arriving over a 24-hour period to live five months without services. On the upper West side, three hotels were put on the upper west side, not 200 and 2,000 residents, and I feel strongly that, because they have not been provided with any services, they can't because there's no room in the hotels, the only services that they've been provided with are the drug guys who come and service them in the morning, and in the afternoon at four o'clock, the shelter at the doubletree, the homeless services pulls up in their Van briefly, and I want to go out and say why do not? Why are not you here, 12 hours before, when we have 40 guys standing doing Chin ups under the block? They are increasingly angry and increasingly they have not been treated, and so it's gotten it's very different now than it was in June, because they're desperate and that's why we see people assaulted. That's why people you know you've heard of you know more than we do. I think about our block at this point, but it's getting worse for them, because even we're getting worse because we're not seeing any relief but they're getting worse because they're not getting any mental health help they're, not getting any drug help they're, not getting any counseling, because there's no room in there's only room in the lobby for one weapons detector. They can't even feed them in the lobby here. So nobody even went into the buildings to check them out before they put people here. So that's why you know the little family, lady in a sorry two, you know indian family, two kids elementary skids, husband, she's, knocked to the ground. You know the one thing that you see all over badly hurt the police came and they said you can't arrest anybody can't arrest the gentleman because he's a mentally ill person and he's back on the block you know. So I think it's getting worse because they have not been provided with any services and I think the density thing imagine 200,000 people being put on the upper West side. I mean they're, making a fuss over three hotels. Well, I think you're about to remember, too that if there were less people in each hotel, there would be more space to help people and provide some kind of services does not mean everything in the room needs to use to house somebody. We need to have a plan, that's the guts! Thank you, Ann who's that Brian Weber, and I actually would encourage anyone who is on the attendee list who lives on 36 or 37 to speak, because we need to hear your voice, hello, hi, Brian, Weber, I've spoken to many of you. You must be tired of hearing from me at this point. Joe too, I am a resident on 36th street. I have a front row view of the Doubletree Hotel, I'm also a public member of Community Board four and I'm a co- chair of the recently formed 36Th Street Block Association, which formed as a result of what's occurring on our street now at this point, we're five months into this, since the arrival of both nika and black veterans at the doubletree in the Marriott, and I do not know how many speakers will be on tonight. I do not know what the community board continues to hear from the public, but I'm gauging it's a lot, but I got ta say so much of what's going on our street constantly in a 24 7 hour period is not reported. We just do not know who to even share this information with at the start of this, I was telling my neighbors, you got ta call Corey's office they're, going to help us. You got ta call Communityboard4, and I again thank you guys for listening and hearing us and showing compassion to our situation, but just last night, in a two- hour period we had 11 emergency response vehicles, police fire ambulance, reporting to different incidences occurring both at nikah and black veterans and they're directly across the street from one another. I just want to say that on 36th street I know it's a different situation than the rest of Hell's kitchen. Increased security, increasing sanitation and recreational space alone is not going to cut it. We must reduce the density of the Shelter population and I really think we must relocate one of the shelters and I'd advocate for Nike. There was discussion earlier about shelter, culture, and I can tell you from what I witness that Nike's operational protocols are lacking, their staff is unmasked, their staff is unruly. They can not maintain curfew, I could go on and on. I can go on and on about them double parking in the street, making it difficult for emergency responses to get onto our block and park in front of the hotel. But I know my time is limited and I really want to echo what dolores said. I was not going to specifically do so, but since she's already called them out, I want to say that we need Corey, Johnson and Brad Hoyleman to get on board with the concept of reducing the density of the Shelter. Population Corey's office routinely responds to my neighbors by saying we've added security, we've added sanitation. This is not addressing the situation. We have to have some hard discussions, which I see that the community board is willing to do, and I want to let my other fellow neighbors speak, but I would just ask that when those conversations do occur, that a the community board is in the room, as I'm sure they would be, and I'd also just like to request that someone from 36th Street be in the room to give the perspective of what it's like as a resident to to be living on this block during current times. Thank you guys. Thank you. Do you think you can't see how many people are raising their hand right joe? I'm just wondering if I need to start timing people what I'm going to ask. I appreciate everyone. Who's raising my hand, it's about 12 right now, Maria! Okay, if you could keep your comments a little bit brief I'd appreciate it. I just think it's important that we have, as many people speak as possible. The next person is Alexander or bring them over. Are they already here? Alexander hi? Can you hear me we hear you great. Thank you. I will be brief because thank you. I do appreciate everyone's time and I appreciate the opportunity to speak tonight, as I said, I'll try to be as brief as possible and really not because I do not have as much to say but because echoing brian sentiments, especially Brian and I have never met. However, we've been on many of these calls together and I I've my wife and I have had the opportunity to speak and be involved, and I really I my wife and I are residents of 36 between seventh and eighth. We are the only residential on 36 between seventh and eighth, so we have a rather unique perspective as well, and it really without going too much further. It really is an untenable situation. It is, it is everything that everyone has said already: Miss Miss Reuben, you hit the nail on the head, so much of the so much of the issue is about the lack of services, as well as the lack of a lack of political will, but it also is that the police department, my wife and I have seen people arrested and literally back on the street three hours later, not even like nothing happened and the cops they come around. They hang out in front of our building and we talk with them and we get their perspective as well. The density the density is a is a is such a is such a factor. It should not be overlooked in comparison to these other issues, and it is- and I know, there's other residents of my building on this on this call right now, and they will probably, I assume, will echo similar sentiments. Our children are unable to my son used to walk to 38th and 8th for a slice of pizza. I can't let him do that anymore. He and my daughter used to ride their scooters around the blocks. Can't let them do that anymore. These, in, as I said, it's an untenable situation. I do appreciate everyone's time. I appreciate the opportunity to share my you know on behalf of my wife and I and I would be happy to continue this conversation with whomever in whatever venue is afforded to me. Thank you. Thank you. David you are up next. Can you hear us David yeah? I just had to unneed sorry, okay, great wow. This is my first exposure to your committee. You guys are amazing. Thank you. So much for your calm and thoughtful approach to this really difficult topic. Could you post a link to the letter joe that you've mentioned, because I looked on the website and I do not see it quickly. It looks great I'm going to ask nelly from our district office to do that. Great. Thank you. I'm a member of the 29Th Street Neighborhood Association and I'm curious what we can do to help and support you and back you up on this. We think that we cover this 23rd to 34th river to river. Although there's you know sort of five volunteers, so we can't possibly do what you guys can accomplish, but I'm curious how we can support you and then my other question is: do you coordinate with your counterparts at CB5? Is there a way that together we can help you, because CB5 has not the acuity that you see on 36th street, but the number of hotels that are being used for this purpose in CB5 in the 20s and 30s is a concern for me, and I wonder if there's somehow power in aligning with them to catch up to where you are to put more pressure on Corey. So first, please send your contact information to actually put in the chat. So then nelly can pick it up. Okay and reach out to you. The second thing is yes, we do normally coordinate with CB5, but I will tell you that this has been coming so fast and furious. We've been sort of just trying to ride the wave ourselves we will reach out to Cv5, and I know that Jesse Beaudine, our district manager has spoken to CB5 to wally the district manager, but coordinating in a better way would be makes a lot of sense. I think that that's a very good idea. Okay and I'm happy to help with that- you may wally, either retired or disappeared. They've got a brand new person there. I think everyone's, you know doing what you're doing trying to keep up with a rapidly changing situation. So if I can help you bridge between you and them, I'm happy to do that too. We would very much appreciate that great thank you, David we're going to bring over bernard and I'm going to ask everyone to keep their comments to two minutes. The other thing I should add is there are also things that I have not shared because there's just so much information, including with you Joe, even though we speak, but there's just so much it's overwhelming, but I have actually been in contact with someone from Cd5 who co- chairs a similar committee. So we can. We should talk about that bernard yeah hi. This is Bernard yeah. I just wanna. I just Wanna reiterate what the previous speakers have said about. You know their appreciation for the board. You know really appreciate it and I know you guys are getting strung along and you know that sort of leaves me sort of despondent, but I really appreciate you know staying at them and you know it's just hard to describe like the temerity that you have leaving your building around here. You know we have this sort of weird curfew, that's not Covid-19 related, and you know I'm about to go out now and get myself a slice, and you know it's like you feel, like yeah you're, in a weird sort of quarantine, where you should be stockpiling, so I think Katie really had it correct in terms of you know, you know not to be selfish about this, but you know we know where the problem is, and you know and we're you know Brian myself, we're down here, Alex, where I can't even imagine being east of 8Th Avenue. I mean I my like my heart goes out to him. It's like to me: that's like a no- go zone, so I really appreciate it and that's it. What Katie said about you know telling being specific we're not going to solve homelessness, but you know putting. However many thousand people on one street or two streets is insane and if you could just you know also even you know further the more you can further. You know further to the doubletree or the former doubletree on the north side of 36.. That's all thanks! Bernards! Thank you! Do not get despondent. Water eventually goes to Iraq and our community board. Our members can attest. We do not give up on issues we just keep on pushing. Yes, we really appreciate it because we're down here guys. We appreciate everything doing here we're down here. Thank you for speaking Bernard Lucy you're up next and you have two minutes lucy. Can you hear us yep hi guys? It is awesome to hear that tenacity like we need. We need you to keep at it. You know I'm a red resident of 36Th Street, I'm between 8th and 9th. I look out at the devil tree all day and I just wanted to tell you a little tiny story of the typical thing that we'll see out here. This was a couple weeks ago we saw a duo from the Doubletree one in a wheeled walker, go over to the entrance of 360 West 36th street, which is just two doors down from us. The one guy took the other guy's shoes off shot him up in the feet. He nodded out. We called 9- 1- 1, because that's what all the officials have said, that's what everybody said, call 9-, 1- 1. If you see somebody doing or dealing drugs, eight and a half minutes later, a fire department truck showed up. Four guys got out, shook the guy see if he was conscious. An ambulance showed up. Two people got out shook the guy to see if he was conscious. He reacted a little bit. The people in the fire truck got back in the truck and left, and then the ambulance guys got back in their ambulance and left. This guy then sat for an hour and a half sprawled out on the sidewalk, and then his buddy yelling at him to get up get up, get up, get back to the doubletree he. Finally, like 25 seconds, he got up. He literally wheeled himself, slowly back up across the street to get back into the double tree. This is not a managed shelter. These people can not be sustainable and we can not continue to live in this environment. Thanks keep at it stay strong. You can not, and you do not deserve to Peter you're next hi. Could you hear me? Yes, we hear you okay, so my name is Peter Orland, I'm married to Dorothy's house. We live between 7th and 8th on 36th street and we feel pretty bad for a lot of these. The people that we see on the street. I mean it's a it's a really horrible situation for them. I really appreciate that the board has mixing the right amount of compassion as well as concern for the residents we're already here. I just wanted to say in light of Ms Rubin's comments that Corey Johnson's been completely unresponsive. Is there maybe the only way really to get their attention is to contact the media. Brian Lair has the mayor on at 11 o'clock on wnyc. The reason why I'm saying this is that very often you do not really you do not. You do not really get much attention from public officials unless they feel there's public pressure on them. So I know New York, one and gothamist have had some information on what's going on around here, but there's far less buzz in the media concerning our neighborhood than there has been for the upper West side, which is has as everybody's remark, is a much less serious situation I mean so I mentioned the mayor is on Brian lair on fridays at 11. Typically, I do not know if he'll be on tomorrow, but if that's one avenue you can try 30 seconds Peter, okay and that's all I'm asking and thanks for the good work. Thank you val hello. You hear me hi, val yeah. We hear you yeah hi yeah, I'm val. I live between eight and nine. On 36. I have a nine- year- old son and I'm a single mom just wanted to say thank you. First of all for helping us trying to help us. I actually live in that building. That Lucy was describing with the two men without shoes, and I had guests that day and they saw the whole incidents and I did see how ambulance came. Nobody helped them and they just left and those two guys stayed near my building. I have pictures of it. I mean I took. I took some pictures from the lobby, I mean every day. I see something disturbing at 10 A.M I saw a heroin addict inject himself in the open. I took a picture of that. My son sees from the window here and Eric's passed out right in front of our window because it's faces 36Th street. I'm scared to go out and unfortunately, it's not a choice. For me, I have to go to work and I have to take my son to school when I walk, I'm scared to death that someone who is high or mentally ill was just punch me or my son on Thursday. While he was doing his blended learning, we heard somebody was robbed and a woman screaming that somebody robbed her. I mean I'm scared to death, walking on 36th street, I'm trying to avoid it, but sometimes I just can't avoid it and I walk there. I'm just scared that somebody who is high just going to punch me so I just go on a street with the cars you have 25 seconds now. Thank you, and I mean I can't sleep at night since ambulances and fire trucks are always on our street in the middle of the night. I do not. I do not remember a night where I did not wake up in the middle of the night, because somebody is crazy screaming or an ambulance is coming. I mean like what criminal act has to happen on here, so someone will start acting and moving them from this street, like I feel unheard like when is this going to? Thank you val, thank you Carol. Can you hear us hi yeah, I'm sorry I got it. I have a timer on Maria. So do not worry. Thank you all. I'm going to echo everything. Everybody said particularly val just now in Bernard earlier describes what it's like on the block. Just to give you a little bit of an idea, I'm a former prosecutor in Manhattan Da's office. I spent the first 15 years of my career there, so I'm used to crime and things like that. I've never and I do not scare easily. I do not like leaving my apartment when it's dark. It's I. It gets your front door because people are like huddled around it doing things that you they should not be doing and it's not safe. I do not have children. I can't imagine what the other neighbors in my building feel like, and I think Betty had a great point about the bar chart. If you could in highlighting the neighborhood, if you could highlight 36th street in particular, because we have over 500 people between 8th and 9th avenue that will make it much clearer. I absolutely love that idea, but I think that would take it to a different level and just you know. Finally, in speaking with the elected officials, I agree with everything we're not really getting the reputation representation that we need, but also, in speaking with the mayor, you know the police take their take their direction from the mayor's office, so we could get more support and the Midtown south precinct is on 35th street. Their driveway comes out onto 36th street on this block and they are not getting the direction or the support from the mayor to actually be able to do from a safety perspective, help the people on this block. So in conversations with them, and if you need anybody from the 315 West 36Th Street Board to come and join any conversations, I am happy to volunteer. Thank you all. So much you've done a fantastic job, I'm so impressed with you thanks. Thank you. So much Carol, Andrew, hello, yes and I'd like to back up totally what everyone is saying about the hard work that the community board is doing. It's really appreciated and, thank heavens, someone is speaking up. I live also same building as val 36 between 8th and 9th, and we have a and someone earlier on. Quite rightly made the point about how this was like a sort of in a way like an extra covered quarantine, but it's not our related. I mean we have a a child. Our son is under the age of two and the reality is that we have to be fairly careful any time of day that we go out with him, and that does not seem to me to be in any way appropriate, and I think I would very much back up what Brian has said is yes, of course, these folks should get more support and more help, and it is clearly not happening and that's clearly contributing to the problem. But I would say the underlying problem is clearly density and that that's really what has to be addressed head- on so, but thank you very much all very much appreciated for all the hard work you're doing. Thank you Andrew Marta. Can you hear us I'm also on West 36Th Street between seven and eight like Peter? I want to follow on from what Peter said and also what Jessica said Jessica from the committee about media. The media situation is very important and it's important that we have a very clear thought out. Well thought well thought out and delicate strategy. Peter mentioned compassion, and I think we all do. We are not the upper West side who had a media strategy that backfired on them, but, as Jessica pointed out that has not gone away and it's getting in and it's getting in the way about us getting our message across, but having no strategy is not a strategy. If I can help at all in any way with it. I'm a former journalist, I have a lot of media contacts and if I can be involved in brainstorming how we handle it, I'd be happy to do so. Thank you. That would be very helpful and again your contact information sent to nelly. So we can, we can be able to follow up with you. Okay, please thank you, katie. I think. That's how you say your name. I apologize. If I'm mispronouncing it, can you hear us? Yes, hi, my name is actually Kath and I live in the same building as val and Andrew and we are under a constant assault. It's not just an assault when we go out on the street, we're assaulted in our apartments. I work from home and I have a lot of meetings and all during the day, the sirens, the police, the whatever. I can't even talk on the phone half the time, that's kind of pathetic that even in my own home and something as simple as there's a group of guys outside the doubletree who play their music constantly and it's loud and it's like it's like it's in my apartment, I call 311 so often, okay, that's not someone shooting up and I've seen that a number of times, but it's such a mental assault that I just I'm constantly stressed because there's nowhere to go, I can't, like my home, is no longer a sanctuary that a home should be that's not how we should live, and I have to say thank you so much for your support, because without you guys, I do not know where we'd be, because clearly Corey Johnson is m.I.a and that's so disappointing. But the other thing I'd like to say is the thing that I do not understand is we know where the drug dealers are. They stand out at 36 and 8th they're there every day I can point them out. They have tried to sell me drugs. Why can't the police do something? Why and where are all these security guys? That's what I'd like to know? Why can a security person be permanently stationed on that corner, of course, 25 seconds yeah? The issue is there's too many people, and so these little fixes here and there it's not the solution, but at least it would be it would make 36th street safer to walk down like I do not even walk down 36 anymore, and I know most of the people that are talking do not either. Thank you so much again and that's it. Thank you and Miss M Kraft hi. Can you hear us this is marlese? Can you hear me? Yes, we hear you now hi. I live on 36th street between 8th and 9th as well, and I just wanted to say ditto. Thank you all so much. I had no idea. We had such robust advocates in our corner, so it's good to know. I have three kids and they're all trying to deal with getting back into some semblance of school and all the anxiety that goes along with that, and they have to hear, as other people have mentioned the other day, a woman screaming blood curdling scream for help. Every time we leave, we have to go as group. My kids were just starting to go out on their own, as someone else mentioned in the neighborhood, and that is no longer possible. They are not leaving our house without an escort and even at that we still have to plan and try to see how we're going to circumnavigate the safest routes from the corner to our building and back, which is not possible to do at this point. It's gotten much worse. We have to walk through or around groups of people without masks, Plumes of Marijuana cigarette smoke, people urinating on the walls and the cars or in a state of delirium or anger. And of course, my children have now seen people shooting up on the corners, it's really devastating. So this is every time we leave when I go out by myself. I can longer go out at night because I'm accosted every time I leave every time I come back, even if I'm on my own, so we can no longer do that. We have to go out as a family 30 seconds. So that's all I have to say just let us know what else we can do to help if we're willing. Thank you. Thank you alexandra hi yeah, so I want to go off a little on a slightly tangent of this. I know that I know that there's a lot of issues and everybody's venting over all the things that they've experienced, but I keep hearing people say we're not going to hold some homelessness, and I know that we have a problem that we need to deal with and that needs to be addressed, but we're just kicking down the bucket. We just keep fighting the symptoms and we're not having we're not dealing with the fact that homelessness in the city is increasing, has been increasing for years, and it's going to increase even more after the pandemic, whether we want it or not. The fact is that we're going to have a lot of evictions, because no one's doing anything to at this point, no one's doing anything, to try to address that and there's only not just the evictions piece but there's also the lack of affordable housing. Someone asked in the last meeting what was being done in our district to see if there were any new initiatives to increase for zoning or for increasing the number of affordable housing units in our district and by affordable housing and means something at a at a low percentage of average median income, not the farce. That has been done in a lot of the buildings in our area that are targeting the like 150 percent of Api. I mean really much lower average median income percentages and you guys just picked 30 seconds Alexandra. You said it was going to be discussed in a different meeting, and but I think that needs to be discussed sooner rather than later, because we're going to have even more people going into homelessness. I lost my job during the pandemic. I was unemployed for three months and luckily I have a job now, but the reality is a lot of people lost their job and still do not have a job and they're going to end up in the homeless system as well. Thank you. I just want to note for everybody. The majority of affordable housing produced in our district is for that people is for sixty percent of AMI to fifty percent of AMI, meaning a family of four making less than like 55,000 a single person less than 42,000.. So that's the majority of housing being built. We do not have a majority of housing being built for anyone at 120,150 of AMI, which is modern middle income. That's the absolute minority and I think we can present in our new number of different plans that are on the table of housing that will be coming on, affordable housing that will be coming online in the next three to four years. That'd be a helpful thing to do next. Maria Joe are not. We one of the community boards that have the highest number of affordable housing or new developments coming up in or in the city actually has the highest number of rent new rents of rent stabilized units and that's directly related to the affordable housing production that happened through the rezonings of West, Chelsea and Hudson yards, and it's really made a major difference, but I think it's time to help for the public to see it. We go through a review every twice a year of where we are in that process and the production of affordable housing. We do that in our next meeting. That's a good idea! Okay, thank you, Randolph! I hope I pronounced it correctly. Do you hear me? Yes, we hear you yes well. I've lived here for 22 years, and can you just say where you live? Also, please live on 36th directly across from the doubletree and next door. To me is the is the veterans bomb sandwich between the two belters. So I just want to thank you guys and reiterate what everyone else has said, but just like have said about being in your own home and having no break from this with a constant radio playing the constant guys just yelling to each other, the constant ambulances, just it's just it's just no way to live and and just walking down the street. You kind of run the gauntlet just trying to get from my apartment to the subway, because I'm a working person and you have to walk through groups of guys that are milling around selling drugs. They have scaffolds everywhere. So they do not move aside. You have to walk through them and if they have a mask on at all, it's is around their chin or it's under their nose and they cough on you and they're smoking, their cigarettes or their or their marijuana and they're blowing on you. So you know it's just you do not even feel safe, walking down the street just from Kovitz and I'm a guy. I do not worry about getting assaulted, but I mean I guess that could happen too, but just fearful of for my health, so 30 seconds just want to thank you again for all you guys are doing. At least we have someone listening to us and if is it any anything we can do just let us know. Thank you. Thank you. I'm going to Brian I'm going to give other people a chance to speak angela. Okay, can you hear me now? Yes, we hear you. Okay, sorry, my husband and I are on 37th street between 8th and 9th, and I want to echo what so many people have said. I guess my biggest question is: why is there zero policing there's no policy to police these people, my neighbor, walked out and to go across the street to the grocery store at 7:45 in the morning, and it's accosted and my husband takes, goes out the window and takes a picture of someone shooting up it's just like. Why is there no rules for these people and there's rules for us? Someone who's normally with someone who's mentally ill has no rules, and I just like: where are the rules for the in our protection, for the people who are living here in the neighborhood? I do not know how to. I know you guys are doing your best. I do not know how to get this to the governor's office. I do not know how to get it to the mayor's office to change the dynamics. It's really scary time. That's all! Thank you, angela catherine, there I it's a perfect segue for me, you've written that excellent letter. I live on 36 between 8th and 9th, and you have written this wonderful letter and I'm wondering how and whether you can deliver it in a more aggressive way. Is someone able to take it and actually go and sit in the mayor's office with that letter and just persist until it? If you have to be a pain and stay there and bother the secretary or the assistant until you can just get some assurance that they might look at it because we can't get ahead, I mean I have heard I'm sure other people have heard that Cory Johnson has had emotional difficulties slightly and is not up to the job stopped being running against De Blasio, and he wanted to give his focus to the neighborhood. Well, he needs to be told to get on it. I've had great conversations with his team. They give me every reassurance, I feel you know happy and encouraged, and then I hear from others that nothing happens you just they just can't reach it. So I've had success in my experience with going down to city halls and sitting places with my documents politely and then giving them, and I'm wondering how you were going to be delivering that wonderful piece. You wrote, I was just bowled over with the care you took and the thoughtfulness and that you've heard everyone, and so I thank you all. Thank you, catherine. Thank you very much. The city hall is not even open. So we can't deliver anything in person. Everything we do, unfortunately, is now in this same kind of venue with Zoom. I think I've had one meeting with city hall since March, you know in person. So the real issue here is need to be more public and I think that's we've heard loud and clear from the broader public and that's, I think, the next way to go really get this. Thank you, you're brought out in the media. That's what we keep hearing so he's a very good suggestion. Yeah thank you and Brian had his hand up. I was going to give you one minute to speak Brian. Oh god, I always have my hand up look was that an accident? No, it was but listen. Just two quick things: Lucy's story about the man being shot up by the other man. I went to speak to Leslie Murphy the other day from our board and on my way they were doing it again this time in the morning, so it has not changed. That's been that happened two weeks ago still happening today, and I really appreciate the board for giving my neighbors an opportunity to speak about this, because you know no one knows where to turn and brian. You have 30 seconds okay and when we do turn somewhere, we kind of feel like we're. The answers are deflective, so thank you so much and thanks for everything I'm good. Thank you just want to know thanks all the residents for coming tonight and being serious, and it is very hard for all of us on this committee. We know how bad it is, but it's very hard when we listen to it yet again to know what your lives are on a daily basis. So thank you for being there and again do not give up we've been in much more difficult times in our neighborhood and we have gotten through it. So thank you so much joe. I just wanted to wrap up with something on this topic and if you want to say something else, jd you had your hand up. I'm sorry did I. Oh I listening to all the comments again tonight. I did not count how many speakers they were, but I will so you know I have to say that I feel infuriated and sometimes when I feel infuriated, I do not make sense. So I'm trying you know keeping myself level and but sometimes I also get emotional when I'm infuriated. I have been involved in so many meetings. Having so many conversations and I have done walkthroughs, I have not had the opportunity to do them with the speakers with DHS, but I know that DHS and the speaker's office did it. I've done it on my own, with community members and with Carl Wilson. The last walkthrough I did on 36th street was actually on Sunday and I saw probably at least 15 people, including and on the side of Nica, most of the people. There looked high, including a child that looked about five years old, and you know that I work. If you do not know, I work in child welfare, and I was just like. Oh my god, what is this two people sitting on the floor by the Doubletree hotel right by the entrance? I spoke to security at the pineapple, which is right beside right beside the doubletree. It was just I can't imagine living there and the thing that I, the other thing that I just quickly want to share is that, based on my experience with this issue and my own observations, the conversations, the meetings, it seems like there's a couple of issues and we've spoken about all of them. Everyone else has spoken about them, but I just want to highlight them. The lack of assistance from the mayor's office, the speaker Nyb NYPD, pulling back extremely limited services that are happening at the shelter sites. Some people are saying: there's no services for them, there's a little bit very limited, it's not what it should be for the populations that are there also. I think it's also about the culture that the nonprofit providers have, and I want to highlight the thing to me: that's most significant and stands out is how this impacts the residents of the block, everything that they're saying I they're not overstating they're, not exaggerating, including from what I've heard from CB4 members who live in the community, including like, for example, someone told me. I do not walk up down that street anymore unless I'm with my husband and she just met along Ninth Avenue. So I just want to highlight that this has serious impact on the permanent residents who live on the block, and I am glad and thankful, and appreciative of everyone who spoke tonight, keep coming back to our meetings. So picking up on the suggestion that we are specifically now a second letter from tonight calling for a meeting with our elected officials to respond to putting this together and putting a letter together in a letter that also has a series of bullets about here is what could be done here is what could be done so and then we'll circulate that via email and synthesize. All the comments from tonight hector get your hand up. Yes, I did thank you I just wanted. I wanted everybody to have their say before I jump back in again for those of you who do not know me. I've I'm sorry to interrupt her, but can you just keep it a little bit brief? Thank you sure. Okay, I'm a disabled, veteran, I'm also a resident of NYCHA. I've lived over here for over 25 years, I'm also on the tennis association, buffalo Chelsea, and now I'm a resident of Fulton as well. So what you folks are experiencing right now, we've had to deal with for many years with the homeless situation and the drug situation and the criminal activity. One of the reasons I joined the housing subcommittee here is because of the issues that we deal with here and the city abroad. So, to make things short, I basically support you all, and I hope you know we're all doing what we can and I'm glad we're getting as much support as we can from the community in general, Maria and Joe and Betty, and the rest of the crew here are doing our most best to try to secure better lives for everybody, I'm just hoping that in the future. You know when all is done and done, and we hopefully come to some kind of resolution for this homeless crisis that we're having in your communities like 36th, Street and some of the other locations. We take a really close look at the housing authority and NYCHA, especially, and hopefully we can do something more direct and do some real impact. Okay on that, because thank you thank you, yeah! Thank you. So much can raise or not of ascent about the general idea of this letter from the members. Jd has his hand. I think you can not make a motion, but I will make the motion yeah, since your co- chair, I'd like to recommend I'd like to propose that this committee write a letter to our elected representative, Brad Holliman, Corey, Johnson, Dick, gottfried, all of them, urging requesting an immediate meeting to deal with a situation in the West 30s. That needs immediate solution, and I would and that they should meet with the Community Board leadership as soon as possible. Is there a second then I second that, but I'd like to add that we urge that we create a plan, a plan of action, because again the immediate has to be front and center, but we need to have the city create a command right. I'm talking specifically to meet about the situation in the upper 30s, immediate, it's a crisis. Why do not? Why do we incorporate both? Because we have to talk about specific action, steps to figure this out? So I think that sort of is that is that okay, dolores and Jd tied. We need to address the situation on 36th and 37th street. This is a crisis. People are afraid to go out of their house all committee members, any abstaining, any opponent judith. What was your vote? I do not see you or hear you yeah, no she's got a thumbs up that passes. Thank you all very much maria take us to the budget. Let's see the public. Thank you all for being here tonight. Yes, thank you, everyone for the budget. We I sent out an email for everyone to look over the capitol and expect expense requests that we had, and I got a few suggestions or ideas or what people think they would like to see here as a priority. So most of it is actually Leslie Williams. I got Josephine Judith Betty. All of it has to do with for capital, affordable housing for expense. It's I see social services here. There's some services related to homelessness, social services, family shelters, expanding mental health treatment for those experi who have mental health issues and are experiencing homelessness. Betty actually suggested funding a study to establish a process for locating temporary shelter hotels so that a neighborhood or a few blocks like we have in this particular situation, do not end up with such a high concentration over. You know whelming the residents of that block. Let's see what else I wanted to share with you, something that I also highlighted in the email that I think is important. Is the community needs assessment that we had a group do for us and just a reminder. The four groups that the four groups that were viewed as having the highest need were teens and young adults needing employment, okay, older adults, especially non- native english speakers needing services needing folks in affordable housing needing affordable affordability in the community, and the fourth thing was folks that are homeless and or have mental health issues, the need for more services and including family shelters. The other thing I just wanted to mention is that traditionally the things that are that we vote at I'm having a little trouble here. Basically, the three top things that we usually focus on are affordable, housing, neighborhood preservation and air quality. Joe. Do you want I to it's really important that we're in a budget cycle? Even though the budget is bad, we have to respond and what everybody asked Maria and I mean and nelly to send out to us our last year's recommendation, which pretty much this was discussed in the landings committee too. It's the production of affordable housing at certain sites such as harborview in the west 50s, there's continued support for the MTA and DEP sites for supportive housing for the slaughterhouse site, for reported, affordable housing and for affordable housing on West 52Nd street at 500, West, 52 and 560 west 52.. It has not been in our budgets for a number of years and, as everybody knows, we put capital requests in because year after year they eventually get done and that's why we keep them on the budget doors. So just so, everyone on the committee knows actually on our committee is the chair of the Budget Committee Jessica and also on the on that committee is Maria and myself. So all of those items that have been long- standing will continue to be budget requests, but many of you may have seen that there was a in this month's packet. There was a survey they went out to the broad community because clearly, Covid-19 has highlighted some new things and what we're looking to do is to get that input and incorporate it into the budget. Conversation recognizing that there is going to be a shortage of funds that there are cuts happening all over the place. We need to continue, as Joe said, keep these items still front and center that we've always advocated for the top ones from this committee have been very specific projects on affordable housing, but they've also been on improvements within NYCHA, and then we also highlighted a lot of issues and concerns for prevention of homeless services and maintaining programs that that keep people from taking homelessness. Yes, it is late, it is late, so it all to say is that these items will still be there. What we're trying to be and Jessica, I do not want to steal your thunder, but we're trying to do is to be thoughtful. Around new things that may have come up and been highlighted from Covid-19 and how to articulate that in this year's requests, did I miss anything Jessica? That's terrific. I would just add for this committee not specifically related to this year's budget requests, but the survey results have been quite robust. We've had over 180 people participate so far. I think Jesse was going to. I think it went out again just yesterday, and so it could be about 180 numbers from earlier this week and each committee excuse me will then get the feedback that community members have shared. Not surprisingly, homelessness in the preliminary results is at the very top of the list, not just in the categories where it seems most relevant, like health and human services, but also comes up again and again in parks and sanitation and all the other areas. So we'll look to see how we can get those results back to help drive the work of this committee going forward as well. So normally in the in the budget phrase, it's called we vote for continuing support for this number of affordable housing developments and then continuing support on the expense side for the homeless, for the prevention issues and the mental health that we've asked for before, and then anything else we'll have one more go right, Jessica to be able to add anything else new or are we at the point where we really have no more time the well? The budget committee will be meeting next week, so it would be really important to get any feedback or recommendations from this group now and then we will put that into the to the meeting and bring everyone synthesize all of the different committee's recommendations and then it. The hope is that this will be presented to the board with recommendations at the next meeting. But again everyone should remember this is for recommendations for next July's budget. So this is. This is a long way off. The mayor then puts together his plan and then again we have an opportunity to reflect on that. So just for fiscal year, 22 July 1 2021 to June 30 2022.. So we had to ask you to synthesize the comments you've gotten back so far, and then I think we've had a good discussion now, two months in a row continuing support on the affordable housing and some of the services and then the new one, just you can just put them in and we'll ask the budget Committee to try to synthesize. Our committee's responses is that okay, guys Jessica? That would that sounds great to me if, as long as everyone's comfortable with that, I think these are long- standing commitments, as you said, and only cobit has only exacerbated them. Not yes! So can I give in that proposal within the report both on the capital, expense side and Maria synthesizes in their comments, came from committee members and said it's a budget committee, all those in favor. Please raise your hand all those against opposed anyone, abstaining anyone president eligible to vote. Okay, it carries given that I think we've had another pact full of emotion and living in our neighborhood meeting, and we really thank Maria for you managing this, because I had such a limited technology capacity tonight. I really appreciate that. Thank you so much so is there a motion to adjourn anybody motion to adjourn? Second, thank you all so much. Thank you. Bye good night.",
            "summary": "On YouTube, it's live streaming, everyone's going to stay muted throughout the meeting, except for whoever is speaking after the presentation committee will have an opportunity to ask questions or comment, and then members of the public who are identified as attendees on zoom, can ask questions or comment.\n, I'm, the deputy director of the ryan Chelsea cleaning committee, health center we've been serving the community since 2001.\nWe have been open throughout the pandemics serving the community 70 of the patients that come to our center reside in CB4 or around CB4.\nThe mission of the Ryan help you want to go to the thank you so ryan, Chelsea Clinton is a sub-recipient or an affiliate of the Ryan Network Ryan Health, which started in 1967, which was established to meet the need for health care services on the upper west side of Manhattan as part of the war on poverty and the greater health care.\nIf anybody, you know anybody who needs pediatric vaccinations, please have them come to the center behavioral health integration, so ryan , Chelsea Clinton uses a collaborative care model where the provider, a social worker and a psychiatrist discuss the patient's needs.\nWe do over offer case management services who will wrap around everything for social services, Housing transportation, food and such we Are part of the city's Undetectables incentive program which helps folks, which is an incentive program for folks who are undetectable, who are living with HIV, who are undetectable to get a monetary incentive.\nWe are part of the state's cancer screening program, which provides uninsured patients over the age of 40, with free cancer screenings, and actually, today we had our Mount Sinai Mammogram Van. We have another patient navigator who is dedicated to helping our patients receive benefits that include Snap health, insurance, cash.\nFood insecurity are just important to somebody's health as them getting a check up every year, so we have identified that need and applied for grants or provided resource or obtained resources to help with patient navigation.\nYou live in other things like health, behaviors, right, so how you eat any addictions, you might have your sexual activity and as well as your access to care.\nSo, it's a screening tool to assess a patient's social determinants of health right, as discussed before our outreach team and our patient navigators connect the patients to community resources within their zip, code.\nAnd it'll give them the resources in their area that they're most interested in About, 400 or so searches, and the most popular things that people were looking for was connection to housing, food security as well as health insurance, connections.\nSo I mentioned this earlier today in our other meeting, but we've started a new collaboration with breaking ground and we've been using our mobile unit and visiting different areas of different hot spots in Midtown and kind of closer to Chelsea area So places where there's high rates of homelessness reported high incisions of substance use, as well as people who are accessing free meal services through local churches and other pantries, and with pairing with breaking grounds.\nI mean 80 of our visits are in person now telehealth We do not get too many people in the center for social, Justice and reasons You know we've gotten awards and we are joint commission certified and we are certified Level three patient-centered medical home.\nSo we're going to we're developing a partnership with New York City Department of Health Mental hygiene, we're probably going to open up the center for about eight saturdays that were not usually open and just do mass flu shots for the for the neighborhood so more to come on that thanks Dan, it's actually a population for when there's a cova 19 vaccine is There's, many channels that the vaccine will flow through and one is through federally qualified health centers such as us, so we're using the flu shot the flu season as a dry run for when the vaccine is raised to vaccine to vaccinate as many people as quickly as possible.\nSo right now we're about at our center about 21, which is kind of what that what the rate is for Manhattan, so in general, a little bit higher than for what the West side is so, but We, but, as people know, cover 19, has been disparately, impacting individuals from communities of color individuals who have less access to things to overcome social determinants of health, so health center patients are more likely to have Covid-19 than individuals with private doctors.\nWe have psychiatrists that are 96, I'm, sorry 100th in Amsterdam, so we can make referrals up there, There's, a shortage of psychiatry and community settings, So the our providers, also you know-are: We do have a social worker on site once a day.\nYou know, that's a big issue for us in the community I mean we see we're seeing more homeless people or who identify as homeless at registration.\nSo If you know, people who lost their job and do not have insurance or need access or recently obtained Medicaid tell them to come to us They live in the neighborhood, please what are their nearest guys, we're tracking the number of visitors, Medicaid versus the Medicare individuals that That's the best, the most accurate barometer of folks, who you know who are struggling financially right if they had private insurance before?\nIf you know, people who need health, insur health care, send them to us or their nearest community health, center.\nA program meet community need like there was this question about funding.\nHey, I'd like to first say what or to duplicate what Jessica said, but I think the fact that you guys have stayed open the entire time and not laid anybody off, except for the two dentists, given the Dentistry rules is phenomenal.\nThere is a city testing site which I have the address in my office, not in my bedroom, the Chelsea center, it's on 28th and 9th thanks.\nYes, if I'm understanding correctly, is that some people in reaction to the flu shot, get like a little bit of a fever If you're in a high-risk group or have some sort of conditions and think that there's like you have not just been quarantined in your own in your own space and you might have been exposed--is to try to get a test.\nNext, on the agenda, we have a committee discussion regarding homelessness, and, while I know Joe. You want to put the letter up so while we're, I, actually it's in the letter, but I-think I wanted to share anyway with committee, because I'm not sure.\nIf not more, we highlight the number of social services in Community, board, 4 and that have already existed, and then we add in the significant increase due to relocation sites, and we talk about what our main concerns.\nThe idea that these temporary relocations happen in a very unordered unplanned way and when you put it in perspective, the city noted that it relocated approximately 10,000 single adults in shelter and to our neighborhood now originally we're 21 2142 That is roughly 20 of the entire relocation it did in the city of New York, and that's why I believe we have our problems regarding this public safety issues, because it was not planned, not thought out and the building types that folks are relocated into for the providers and the shelter residents are just not adequate or properly programmed for that.\nI believe it was on 36Th, Street, and I know that they're going to be using be able to use like Metro Baptist space starting this month for some programming.\nSo the question is: Why has it improved and can that whatever work there can that be taken to other problematic shelters like 6Th, Street, great question, jd, something that actually Joe has discussed it and talked about it before openly in meetings?\nAnd, I think, really sitting down with the mayor's office in DHS and coming up with a plan as to how we're going to manage this.\nWe do not have political support and we're not going to accomplish reducing that density or pressuring any of these facilities to go ahead and provide the services needed to ensure the safety of those residents and the safety of our other residents.\nHas it in his power to assist in the density issue, to assist in working with DHS on these facilities, providing the services needed for the public safety of those residents and the other residents within the community, so Cory's office is there.\nHe should be actually doing the work What the next letter coming out of this committee for this month, and that is working for a meeting of all the elected officials with the board to really sit and respond to us on the letter that we sent we're.\nSo I think that's a great idea with our follow-up letter, saying now that we've asked for this meeting with the mayor's office and the administration also meeting with our elected officials to deal with this, because we have to keep the pressure up to get people to engage.\nI mean you guys are a lot closer to this, probably too close for your preference, but the press you know like the Lucerne topic, is like I'm hearing it every freaking day on the radio you hear lower Manhattan residents talking about how they do not want these places moved.\nPeople on 36th Street now on 10th Avenue is a little bit better, but who knows, as we have to get some standard practice on how things are managed, otherwise we're going to go down to a black hole, again wait!\nWe are super clear on what the concerns are and it's you know around 36th and 37th street, and while I certainly appreciate it's a good idea to ask for a letter, I, actually think that it would be lovely and faster.\nAnd I think if we just make a very specific proposal and ask them to sign on to it as opposed to like come talk to us, some more because I we've done the work, we know what needs to be done.\nWell, I, think you're about to remember, too that if there were less people in each hotel, there would be more space to help people and provide some kind of services.\nI just want to say that on 36th street I know it's a different situation than the rest of Hell's kitchen.\nWe have to have some hard discussions, which I see that the community board is willing to do, and I want to let my other fellow neighbors speak, but I would just ask that, when those conversations do occur, that a the community board is in the room, as I'm sure they would be, and I'd also just like to request that someone from 36th Street be in the room to give the perspective of what it's like as a resident to to be living on this block during current times.\nBut it also is that the police department, my wife and I-have seen people arrested and literally back on the street three hours later, not even like nothing happened and the cops they come.\nSo I know New York, one and gothamist have had some information on what's going on around here, but there's far less buzz in the media concerning our neighborhood than there has been for the upper West side, which is has as everybody's remark, is a much less serious situation.\nYou know the police take their take their direction from the mayor's office, We could get more support and the Midtown south precinct is on 35th street.\nDriveway comes out onto 36th street on this block and they are not getting the direction or the support from the mayor to actually be able to do from a safety.\nWe one of the community boards that have the highest number of affordable housing or new developments coming up in or in the city actually has the highest number of rent new rents of rent stabilized units and that's directly related to the affordable housing production that happened through the rezonings of West, Chelsea and Hudson yards, and it's really made a major difference, but I think it's time to help for the public to see.\nYou do not even feel safe, walking down the street just from Kovitz I mean I, guess that could happen too, but just fearful of for my health , Okay, sorry, my husband and I, are on 37th street between 8th and 9th, and I want to echo what so many people have said.\nYou just want to know thanks all the residents for coming tonight and being serious, and it is very hard for all of us on this committee.\nBased on my experience with this issue and my own observations, the conversations, the meetings, it seems The lack of assistance from the mayor's office, the speaker, Nyb NYPD, pulling back extremely limited services that are happening at the shelter sites.\nI. Think it's also about the culture that the nonprofit providers, have, and I want to highlight the thing to me Is how this impacts the residents of the block, everything that they're saying I They're, not exaggerating, including from what I've heard from CB4 members who live in the community, including like, for example, someone told me.\nI, do not walk up down that street anymore unless I'm with my husband, So I, just want to highlight that this has serious impact on the permanent residents who live on the block, and I am glad and thankful, and appreciative of everyone who spoke tonight, keep coming back to our meetings.\nYou know when all is done and done, and we hopefully come to some kind of resolution for this homeless crisis that we're having in your communities like 36th, Street and some of the other locations.\nKeep these items still front and center that we've always advocated for the top ones from this committee have been very specific projects on affordable housing, but they've also been on improvements within NYCHA, and then we also highlighted a lot of issues and concerns for prevention of homeless services and maintaining programs that that keep people from taking homelessness.\nWe vote for continuing support for this number of affordable housing developments and then continuing support on the expense side for the homeless, for the prevention issues and the mental health that we've asked for before, and then anything else we'll have one more go: The budget committee will be meeting next week, so it would be really important to get any feedback or recommendations from this group now Then we will put that into the to the meeting and bring everyone synthesize all of the different committee's recommendations and then it.\n, two months in a row, continuing support on the affordable housing and some of the services and then the new one, just you can just put them in and we'll ask the budget Committee to try to synthesize."
        }
    }
}