{
    "data": {
        "YoutubeMetadata": {
            "author": "QCB3",
            "channelId": "https://www.youtube.com/channel/UCUD7E8dGGz0kGqAPOAL-cBQ",
            "title": "Queens CB #3 - September 2020 Meeting",
            "publishDate": "2020-09-18",
            "shortDescription": "",
            "lengthSeconds": "3:42:22"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "QCB3",
            "normalizedName": "Queens Community Board 3",
            "twitterName": "Queens Community Board 3",
            "youtubeChannelName": "Queens Community Board 3 Virtual Meetings",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCUD7E8dGGz0kGqAPOAL-cBQ",
            "twitterHandle": "@communityboard3",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "n6K-J9xfhfc",
            "fillerWordCount": {
                "uh": 371,
                "um": 407
            },
            "readTimeFullTranscript": "107 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "services": 54,
                "information": 50,
                "individuals": 39,
                "shelter": 38,
                "housing": 34,
                "chat": 30,
                "clients": 29,
                "guys": 28,
                "evening": 21,
                "night": 21
            },
            "wordCountSummary": {
                "services": 13,
                "clients": 11,
                "individuals": 10,
                "shelter": 9,
                "information": 8,
                "housing": 8,
                "work": 6,
                "neighbor": 6,
                "residents": 5,
                "street": 5
            },
            "fullTranscript": "This conference will now be recorded hello, good afternoon, hi ma'am. How are you good? Thank you, I'm going to mute and I'm going to mute everyone until our meeting starts. It's going to officially start at 7 pm and Dr Laverne. You will open up by calling the roll call that's around 705. Okay! Is that fine, Dr nimmins, hello, Mr Gandhi, all right, Dr Nimmin! That's fine! Can you hear me? Can you hear me? I do not think she can hear you. I do not think she can hear me either thanks, Clara, I'm going to play g. How are you I'm? Okay, I'm going to mute everyone for now. Okay, did you hear me talking to you no yeah? I was talking to you to let you know, I'm muted. Can you hear me now? I can hear you now, okay, so what I was saying to you is at 705. Okay, let me turn my phone off. I'm going to hang up, Mm-, hmm, so it's vernetta yeah! I can hear you. Can you hear me, I can't hear you, oh no. I can't hear you. I can't hear you. I do not know. What's going on, is your speakers on? Maybe I should go out and come back in. Let's see this, you did not send the you did not send the entry the entrance or to the meeting was on the agenda. That's on the gender, the link, you usually send it separately. All right, I'm going to do that to everybody right now, hello, I'm going to do that right now. Ah, okay, I fixed it. I'm in I got it done all right and I'm sending everyone a link again for the folder. So we'll start in about Dr Laverne at 705, we'll start. Okay, all right give me a minute to send this email to everyone, because somebody got it. Did everyone get the link to the phone people were saying they did not receive it? No, that was my mistake. I did it wrong. That was me because once I was winning again, I saw where I made my mistake all right. Well, I'm going to send it to everybody one more time. Edmond did you get the link to the folder? Yes, I did. I did so Martha said she did not get it now. Let me ask someone else: you got it Mr Chaudhary! Yes, I did. I got it. Thank you see the agenda, today's agenda. Yes, the minutes, everything full package budget and all this okay. So you have everything. Okay, all right! Let me just send it to Martha, then all right, no send it to me too, because I did not get everything all right, I'm going to send it to everybody. I did not. I just got the agenda hello, hi, yes, hi! This is viviane Hi Vivian, I'm putting everybody on mute right now: okay, hi who's, caller number one some people have called in. I just want to make sure I get your name if you've dialed in I need to know who you are. Please Hamilton, you ready. Yes, I can hear you Hamlet say it again. So you're say your name again we're going to start at 705. Everyone welcome! I'm going to mute, you victor, because you have a okay. Thank you because you had you had a lot of background noise. Do all right members! You should have received an email from me a minute ago. Just in case you have not. You should have all the items in your folder in there today's agenda, everyone. The agenda- has been updated where it says DOH is DHS department of homeless services, so you can just make that change under 115Th Precinct is DHS and Nika Ebus aloft, hotels, okay, you can just make that and I put an updated agenda in your folder. You should have that so just everyone in the public. If you do see our agenda online, it's DHS, not DOH, caller number one can you just. Let me know who you are? Oh, it's being pranked you're, not on the phone Frank! Oh sorry about that. If everyone if you'd like I know, I have not seen some of you in a couple of months. So if you want to turn on your camera, you can so I can see you to make sure you're, a-. Okay, some of our members, it'll, be good to see you, hello, Mr Gandhi. How are you? Okay, hello? All right is the NYPD on Hi Keisha right now, everybody's moved it out all right. It's 705 I'd like to welcome everyone to the queen's community board number three September meeting. We have not met in the past two months and it's great to see all of you that are on the line today and we're going to open up our meeting with the roll call. So Dr Laverne. Can you do the roll call? Please yes good evening, everyone and welcome those faces that I can see. You look absolutely marvelous wonderful to see you we'll begin I'll, just say I'm here or yes or what. However, you respond. Just please respond: Cam, Vlada you're here, okay, Ann, Brown she's, not here right now, okay, Elba Bundia! You have to turn your Mic on members. I'm here. Thank you. Thank you! Elba Mark Burmester! I'm here. Thank you. Please tell me to say your last name, so she'll be calling it all through the meeting yeah. My last name is Burr Master, okay, Mr Chowdhury. Yes, I'm here: okay, Mr, a hacker: cornelson corn! Now, listen, hey cool! No he's! Not here chivdas, not here, Sonya roberts. Do you see her on the list Keisha at all under people? No okay, Vivian Doc Scare! I Vivian Margaret does not here, I'm here, hi Margaret, Renee English! Are you there? I'm here I'm teasing Mr Gandhi. Yes, I'm here are you here? Yes, I am here. I see you. Yes, I'm here: okay, Pastor, Peter Herron! I saw you walking earlier I'm here, I'm here, I'm not here yet: okay, Kevin, Hughes, absent Joyce Julian. You see him on the list there at all Edwin Karenin, I'm here my brother with the same birthday, Stephen Cole Hanik, I'm here, Marta Lebaton, I'm here, Carlos, Andrus, Lopez, okay, okay, Lisa is going to be late. She's here, oh lisa, you're, here, okay, hey, yes, Ralph Morena he's not here: okay, Richard, Mullins, Laverne nimmins! I'm here present wait a minute. Okay, phillip pappas! Here, okay, I see you, phillip esteban Peralta, Perez Dorothy Phil on Dorothy is dorothy here, I'm here I see you dorothy okay, Megan Rockwell, Megan you're, here yep hi, Darling, Foster, Rodriguez, hi, Ro rodriguez, the Onicio Romero Tammy rose edmund Rosenbaum yeah. I see you Edmond David Rosario Love, saying Salaka, Jimmy, Smith, Marlene, taper, hey Frank. I know you're here, okay, Arthur, Tyler Otter, not here at the moment I know it's the jewish holidays. I do not know if he's coming in today. Okay Chanel Thomas Henry here Rationale Hamlet Wallace, I'm here, hey Hamlin and Toy Washington Simone, okay, anyone please everyone. If you've already spoken, please put your phone on you to limit the background noise. That's very important! Go ahead! Okay, we have. We have 27 absent and 22 present. Okay, we'll wait for some more to come on in and so we'll see. Who else is here? Okay, as we go in and whatever Quorum 26. they'll come on in and what we're going to do is Keisha yeah. When you see members come in, can you just text that information to laverne? Do you have her cell phone number I'll? Give it I'll send it to you in the meantime again, I'd like to welcome everyone to our meeting and you should have the agenda members. You should have the agenda in your folders and the public. We've posted it on facebook, we've posted it on twitter and we posted it on Instagram and just one adjustment. As I mentioned earlier, under after 115 precinct, we'll have a presentation from the department of Homeless Services Anaika ibis aloft hotels, all right, so it was not DOH. It was DHS and I and the update was posted to the members folders okay. So as always, when we begin our meeting, we begin with public participation, I'd like to welcome Mrs, Chanel Thomas Henry. Thank you. Renetta welcome, back Fellow board members and the public. I hope everyone had a safe and enjoyable summer. I just want to bring you a couple of updates from the airport, but first I want to give one personal update. I do not know if you can see clearly but baby Quinn did turn one this summer, she's beautiful. Thank you! So yes, ty and I are feeling blessed she's healthy, she's, walking, she's running all right, Mr Gandhi! Please put your phone on you or Kisha. Can you meet him? Please sorry, Chanel go ahead. Oh do not worry. So, although we, our offices were closed, the community Outreach office was closed over the summer due to the pandemic and we have not returned to the office. Yet the entire team is working remotely, but we are accessible via phone and email and we do continue to do quite a few programs online. We did a stem program this year, where we had over 80 students grades six through eight from the local community in partnership with Langston Hughes Library. We also did a sustainability camp with an additional 40 students this summer, so we did do two virtual camps with children from our community. We had our first round of bond college. Scholarship. Winners worked with the Port Authority Virginia, so we had six interns work with us and we awarded five additional students scholarships. So we have a total of 11 schools that have been awarded to date and our first round of students that actually worked with us in terms of construction. It continues. I just gave you this green Chanel. I do not know if you saw it sorry, but go ahead. Okay, it'll probably take me a minute to figure out how to use it and you're ready. Okay, go ahead. Sorry, no worries the arrivals and departure hall for Terminal B is completely is open. It's been open since July, so for the majority of Terminal b is now open. So if you have are flying out of laguardia, it is truly an amazing space. Ten times the size and visually appealing than the former terminal, so that did open this summer. Again, as we continue to do things virtually, we have been doing a lot of programming for both our individuals looking for jobs as well as individuals who have businesses so every Tuesday and Thursday we host an online orientation with the Council for airport opportunity. We do several resume building workshops. We actually have one coming up next Wednesday in conjunction with elmcore. We also have an information session tomorrow with Elm Core for Microsoft certification for any individuals. You do not have to be looking for a job, but maybe you want to enhance your microsoft office skills and become certified. We will have information on that tomorrow, as well as a webinar on getting certified as a minority or women business enterprise with the port authority. So I'm going to put in the chat our website, so you can see all of our calendar of events board members in your packet. You would have seen a notice. So, as many of you know, there has been an environmental study going on for the air airtrain. The draft Eis document was made available at the end of August, and the public comment period is now through October 5th, so I do encourage everyone to go on and review the document as well as make comments. There are some workshops as well as hearings next week. So again I will put the web address to our website anewlga.com in the chat so that you can log on to view the document as well as get up- to- date, information of what's going on with that project also, and finally, as it relates to the air train project, there has been a request for proposals put out looking for professional architecture and engineering design services firm for the flesh and Bay Promenade. If the air train were to move forward, part of that plan does require the port authority to do significant improvements to the Flushing bay promenade to include beautifying, a main gateway to Flushing metals Corona park, provide amenities for the local community and other park. Users improve the denmark's boulevard entrances to pedestrian bridges at 27Th, Avenue and 31st drive, as well as alleviate destruction disruption to park resources. I will send that to you, renetta and Giovanna, to distribute amongst the board and again welcome back everyone. I will also put my contact information in the chat if anyone has any questions as it relates to the airport thanks. Oh thank you, Chanel, just showing us a picture of the little one, we're glad that she's growing very nicely. Congratulations thank you and we do not have any other folks for public participation, but we do have public information and in public information. This is where you have the opportunity to ask questions and what we're going to ask everyone to do, because Keisha is helping me today with the moderation, because our wonderful Kevin, his husband's birthday, is today so Dennis's birthday's here today, so he's not at the meeting. So please type any questions that you have in the Chat box and we'll be monitoring that and we'll call you by name. So you can ask your question to the presenters. So does everyone understand this? Okay, so you'll type your questions in the chat area, all right, so I'd like to our first speaker for public information is Reverend Manuel, De, Josus Rodriguez from our lady of sorrows. Are you on reverend Manuel? I do not see his he's not announcing himself reverend Manuel Well Reverend Manuel is the new pastor at our lady of sorrows and over the summer the Community Board did an event of masturbation over there and he's the new pastor that we want. He wanted to introduce himself to the community and if he comes on a little later before the end of public participation, we'll bring him back on again, but I do not see him here. So what we'll move on to our next speaker, 115 precinct, I see captain. I saw him on the captain, all right! Wonderful! So can you unmute yourself yep, I'm unmuted! Everybody can hear me yes, and if anyone has any questions for the captain, as he proceeds through his presentation, please type that in the chat and Keisha will call out your name for you to speak or I'll call out tuning. All right go ahead. Captain good evening, I'm out captain Anthony Masia, I'm the 115 precinct executive officer. I've been assigned here since December of 2019 I'll start off by going over our crime statistics. For the past 28 days we have in the 115 precinct, had one murder versus zero same time period. Last year, zero rates for this 28-day period, 19, robberies versus 27, that's down 29:25, felony assaults versus 32 for the same time period last year. That's a increase, a decrease of 21.9 percent. Our burglaries are 10 versus nine, so we're up one burglary compared to the same time period. Last year, Grand larcenies 60 versus 48 we're up 25 in grand larcenies and glas. Our vehicles are spiking a lot for so our stolen vehicles are up 25 versus 11.. Now something important on that stolen vehicle is, it does include mopeds and bikes so of the 25 stolen vehicles in the Gla category. 15 of them were actually automobiles and of those 15 automobiles, nine of them. The complainants left the keys in the car, so they were running vehicles for the year when we look at their stolen cars, we're up 132 versus 81 and about 50 percent are usually the residents leaving keys in the cars or people coming to shop along the story of Northern Boulevard, leaving keys and cars going back to grand larcenies. We have seven instances within the 28 day where it was extortion, meaning phone calls where they're either pretending to be members of the 115 police department or other types of federal agencies and they're getting elderly complainants to give up money in exchange. So that's something important that I'd love for you guys to discuss with elderly residents that you might have the the felony assaults about. 15 are domestic violence at this time and as far as our number one 311 area for noise complaints, it's been along Northern Boulevard for the 28 day period and it's continued throughout the last three months. We've had a big spike in that area. We hear your complaints and we've been focusing a lot on enforcement, along with the bars speaking with the bars and the restaurant owners, to try to get compliance with the music, but also moving cars along that are coming to the area that are not necessarily residents that are bringing large crowds in front of these locations and music's their own speakers and they're, taking over parking lots at this point I'll open up for some questions. Okay, the first person. I'd like a question is nulla: can you unmute yourself and ask your question? Nullah: oh, can you unmute yourself? She has to unreach herself. Yes, she has to go ahead. Noela. Ask your question: please: okay, sorry, it's really noisy here. Do you want to go ahead and read it? Okay, ask your question since you're open and anybody else, please. He should please mute anybody else, so it's only neula on right now and the captain go ahead. Okay, so captain along 94th and 95th street we've had a persistent problem with ongoing drug dealing and the associated violence and we're wanting what we as a community can do to help you curb this violence, especially since, hopefully school will be starting school soon at Ps280, just one block away, so specifically just those issues on 94th and 95th street between 35th and 37th avenue. What can we do about it so, from the community standpoint, we'd love additional. What I've done? Actually that block those two blocks when I first got to this precinct, the gang activity at those locations were brought up to me by members of the public at a tree lighting on 37Th Avenue, and we focused on it. Since then, we are actively having operations in that area for the community. What we would love is more, not more, it's like, if you see the violence starting to get up there again, you see the groups outside you see them with weapons or firearms or any other type of things just does not make you feel safe. Please give us a call. What you will see from the NYPD 2 right now is there's a fixed post for me right at 95th and 35Th Avenue right now. That post is there on the third platoon, which is you know, from 3 P.M to midnight and also from midnight to 7:00 A.M. That's due to the increase in 911 calls not necessarily complaints at this time, but when we get the 911 calls from the community and we're able to look back at our cameras that we have there too, but we will would like more. You know we'll take any information we can because we're using it for an ongoing investigation into that area. Believe me, we were very active with the gang problem at that location. We definitely see the narcotics sales there. We definitely have had contact with my other parts of the police department to help address those concerns. I wish I could give you more information, but I promise you we're working on that area. We also have been ticketing abandoned cars in the area to get them removed, we're seeing a lot of cars without plates. We think that's part of the part of the way. Some of the individuals are making money all right. Thank you. Thank you. Noah Mr Chaudhary, yes, hi captain, I we live in Jackson, Heights Area and we have only one place to sit or just have fun. At least in this covered 19 pandemic time is diversity plaza if you have ever. I brought this issue to officer David in the in her last presence in the boat, and this is not at all walkable, even walkable, not seat even walkable people illegally. They have occupied the area and with a wife or with a woman or with a girlfriend, you can not walk in the area. This is very bad, so I request you to look onto this matter. Absolutely sorry. Diversity Plaza continues to have a some of a homeless issue. As you're describing you know, we will reach out again to homeless services, to see what we could pull together to address the concerns there. In the meantime we do have, we will increase the presence there, but we also you know I'm not throughout this last few months we have a post. That's there many times it's usually there overnight, we'll see to get more more attention during the day to that location, because you're talking about hanging out during the day correct somewhere in my house. Excuse me captain. There are some vendors. There are plenty of vendors occupying the whole area, and that is very disgraceful. You can not walk with your wife or children in the area. That's the concern is with the vendors, not necessarily with homeless. Oh yes, in the night time, but daytime and evening time, vendors that are completely not workable, no problems here I'll speak to my NCOS and see what we could do with guarding the vending vending issues at the location, but we'll see how we could improve that for you. Thank you. Thank you all right. Thank you! The charger all right. Okay, sorry, yes, go ahead. Hi, captain yeah hi. There hope you had a having a nice evening. So during the protest that I've attended there have been, you know, like huge numbers of police officers present, you know, even when the protests have been. You know completely peaceful and I'm wondering you know and at the same time a lot of crime is increasing in other parts of the city. So I guess my question is about how decisions are made where officers are deployed at the protest or in the community, and if officers from the 115th precinct have been diverted from our community to patrol these protests, officers from the 115 precinct do at times get assigned to protest coverage in other parts of the city, including other parts of the borough, other parts of the city. We will move manpower. The department will move manpower as needed. They have been they it's been in the news. They changed days off for a lot of different parts of the police department. They did that in an effort to create more available manpower on the weekends and that's hopefully going to help keep the police officers assigned to the 115 precinct here in the 115 precinct for the majority you know as often as possible as far as how often it happens. If I'd have to get back to you on that. Initially, when we did have the you know the protests going on a few months ago, when things were at times pretty violent, I myself was sent down to Soho during the looting with a bunch of my officers from here. I think that's why the department has changed its view: change your rdos, meaning the regular days off and increase the manpower on weekends for other units so that other units can chip in that were normally off on the weekends and not touch a patrol precinct like we are here in 115 precinct. Did that answer your question, sir yeah? Thank you. I appreciate it. I have a question: what do you do about illegal vehicles like in a residential block like food trucks, and so on that stays there for a few months? The food trucks are the chickpeas yeah, so food trucks are a little bit more difficult. The way we handle them depending if they are doing you know they are having food sales like some of them. They take 101 at 3-, 7, they're selling food until four in the morning. Oh, no, I'm just talking about a residential block. That's been sitting there for months, no foods being sold or anything perfect. Give me the location, we'll take a look at it. We're doing an operation in the morning actually, and I at the operation we're going to be removing a few cars all right, I'll talk to miss Reed about that all right, Laura, Freeman, Laura! Yes, I'm here! Can you please ask your question? Yes, captain! I we have a lot of problems here on 104Th Street, 39Th Avenue, almost every night they're shooting fireworks off the train station 103Rd train station platform. We had it going 12 A.M to 5:00 A.M Tuesday night the day before the kids started, the remote learning- and I do not know what's going to it- keeps going on here and they there's a whole bunch of gangs hanging here they have chopped up cars. They got about eight cars blocked on this block. They're smoking, hookahs, there's about 12 guys it's the same 12 guys constantly and I know you're your neighborhood police cop. I think he had spoken to them, but you know as soon as he left. You know they just you know returned to normal. You know normal business as usual, and this is every night. Nobody could sleep, they turn up the volume on the cars like. If you say something, I'm like hey we're trying to sleep, you know, could you please turn it down? You know what you either get a fu or they turn up the volume on their car. You know they have those like loud systems. It's horrendous. I've been in touch with the community board about it. You know Clara Miss, Reid, they're, aware they urged me to speak up at this meeting. They said you know, there's nothing they can do but put in reports. So now I'm you know pleading with you. I am so for the past month. I had a feeling this would come up because I work at night, I'm going to be up hungry until 7 am tomorrow morning tonight and the amount of sound coming from that area in sector David yeah, whether it be vehicles a lot of vehicles, some storefronts- that we definitely are it's a little easier to address it's concerning I'm. You know I'm concerned, I see the three one calls and then there's really one close. I have members of the community telling me that you know just like you brought up. My kids have school the next day. You know I can't sleep, my kids can't go to sleep. What we are doing we focus on when you call 3- 1- 1. I know you get a response a lot of times. It says unfounded or not addressed or 91 there. The music is a little bit harder for us to address, but we are going out there on those three- on- one calls, but the 28-day. You know this community is up 689,311 calls when compared to last year, so last year. At this time we had 2141 311 calls. Oh no that's. For this year last year, the same time period was only thousand four hundred and fifty two. So three one calls are forty seven point, four five percent. With the majority of those calls. Let me get you the exact number happening late on the you know later around 10 o'clock at night, and there are a lot of music calls when you, when you look at them loud noise from auto loud noise from stores yeah, we have a Roosevelt avenue task force which would cover which does cover that area they're in Tuesday nights the captain's going to be walking in any minute now actually and I'll, speak to him about that. They have an additional 26 officers assigned along the Roosevelt Army corridor, which does cover 103 and roosevelt. Well, I have to add something: there's a library on our corner. Yes, it is closed. You know, because of the pandemic, but since that library has been closed, it seems like they use that they're going buck wild with that, because the library has you know, cameras and they know that nobody's in there monitoring those cameras anymore. So they are just going buck wild, like I said it's from 104Th Street, 39Th Avenue to 103Rd Street and 39th Avenue, it's just beyond it's like we're the prisoners. Now everybody's scared to come out of their house. Now it's unbelievable! It's just a it's a it's, a special group of guys, the specific ones every day like I could even point them out. I'm like that, one that one that one that one you know- and I probably have investigations into some of them too- and that's hopefully going to be the long- term solution, yeah the same thing that goes with 95 street. It's to address some of these quality of life concerns is actually getting back to longer term investigations into what they're doing so. We could hopefully even keep them my house if you needed it. I really I would offer up my house if you needed to like film them or something I really I'm so desperate, we're so desperate here so 104 and 39 right, 17, 39th avenue. So it's from the corner library all the way up to here, I want to say about 104,24: they hang out in front of 39Th Avenue, 104, 24., yeah and there's a preschool right, acrosss, the street that just started today and there they were smoking hookahs in the freaking car. Excuse me: I see them getting so I'm so sorry and I saw the little kids they're all standing there with their little masks and here's these guys. You saw the big puff of smoke coming out of there who gets out of the car right acrosss. I said I can't take this. I just came inside. I could not even take it. I do not know. Thank you. It's like the hostages. Thank you, miss Freeman, so you have all your information captain Merci. Thank you so much. Thank you. I apologize we'll work on our best for this. Thank you. Thank you. Thank you. Miss Freeman, Frank Taylor. Oh yes, hello, good afternoon or good evening. Captain I'm over here on did Mars Boulevard and we're having a problem with getting any type of responses even from the officers over at the 115th, which is highly unusual. What type of calls I'm sorry excuse me? What kind? What kind of issues are we having up there? Okay? Well yeah? We have nuisance, calls people coming on your property. We have people, smoking, Marijuana or whatever, in cars or standing outside, doing it in front of people's homes. There's a multitude of things that go on, but the things that's really disturbing me is that we'll call the precinct and they'll tell us to call 9- 1- 1, and then nobody shows up you're, always going to be better off, calling the priest calling 9-, 1-, 1 and or 3- 1- 1, then calling the precinct direct. There's a slight delay that when you call 9- 1- 1, our phones actually go off like a text message and they go off almost just as the operator is typing in the type of call. It is type of call for service. It's going to go off to the study sectors to their phones. Our response time right now on 30 series, meaning in progress. Jobs is under three minutes here in the 115 we do have an increase I'll have to get the radar around numbers just like we have an increase in the three one. Once we have an increase in the 911 just like we have an increase in crime right now. Just let me get the boundaries exactly that we're talking about and whether you want to speak to me afterwards. I'll give you my number to call, or you want to speak with me in person we'll I'll meet you outside at the locations. Maybe too we could do that I'll, walk through the area, and we can talk about some of the areas you're. Having concerns with that's fine, I'm looking at 114Th Street to 98th street on big mars and we can take walk. That's not a problem because you'll see exactly what we see and if you wanted to okay, so community affairs is here with me too: they had a meeting. While I was on vacation. I guess they had a meeting with the East Elmhurst association about the issues and concerns up there. The command officer was there yes, yeah, the commanding officer. Was there we'll do additional follow- up on this? So I want to address this concern for you, sir. All right appreciate it. Thank you and if you want to type your information in the chat, you can captain put my email in there too yeah. Can you do that? Please, yes and Brown put your phone. Your volume is not on got that one. Okay! Now sorry yeah! I thought I immediate I just I was going to get piggyback on what Frank was saying, because I kind of experienced over the fourth of July with the fireworks, and I found it interesting that I made a call to 115 precinct the guy said well, somebody will come out with getting complaints, but I also call 3- 1- 1, and my question is: if I'm putting in a complaint, 3- 1- 1 at 9:51. I look back at 9:53. It's been closed out, that's less than three minutes. So are you to say that in those three minutes when 15 is picking this up or somebody supposedly have come out, because it says the police has responded, so those three minutes and a lot of them were under 10 minutes in from the time the person reported and it being closed out. So is that the time the police picks it up or supposedly the cops come out? Investigate then close it out. So there were some issues with the 301 system when it first started coming to our phones. We just got that one to our phones. We did not always have three or one store phones and with the time frames, but I can't imagine a three- minute response. I'd have to look into what happened with that unless they were already there for other three one calls at the location instances where that would happen where you see that even I responded to were on northern boulevard during the same time period when the fireworks were completely out of control, the noise complaints were ex they were. They were up in an enormous amount too, on Northern boulevard, the amount of calls from eight from, like eight five actually to nine. Oh those calls we were finalizing, some of them a little bit quicker because they were we were on scene. We had a whole team that was just going back and forth on northern for fireworks, noise and stuff, like that I'll have to look into the individual one that you have a concern about, because at three minute response time. If it was not an overlap, then that's something that I have to look into. It's not something that we want to see yeah. It was not overlap because that three- minute one was one of mine, and so I started looking in the neighborhood of surrounding ones that was put in one another. One was open and closed in eight minutes. I'm like there's no way in the world. The police came out here in under eight minutes and closes I mean if you would be so patient is to pull one month and run one month of these three one calls to see when the call came in and when it was closed, and if you could share that with us, or at least you look at it. I will absolutely thank you. Thank you. Roberts who's, our public safety chair. Do you want to say anything or have any questions? No, I do not have any at this time. Okay, Mrs, Henderson, hello, hi, everyone good evening, everybody. This is to the captain. I live in the building where the murder did happen, and first I want to thank you for the police presence. We've been seeing, it's been peaceful, yes, but I do I'm just curious. Has there been any arrests made? Do you have any idea of where we do have leads? We have four individuals that we're looking at to question in regards we have. We did find a vehicle that was used in regards which we did. We have it. Okay, the investigation is moving forward. I can't give all the details out on that. As far as the response up in that area, the command the fixed post was moved at this point. So, yes, I you know, we move that fixed post actually to 95th street. We do have limited. I get stuck. You know, kind of balancing where we're going to put everybody with the amount of resources we have. What we're going to continue to do are have the steady sectors do downtime, do directed patrols over there to try to maintain that peace that we've had over there right and we're going to confuse you with checkpoints. Excuse me because the question the thing is like I was saying to I do not know who I was talking to, but most of all of them out of if it's 20 people out there, maybe two live in here. You understand and it's like sometimes the police will come by and do not say anything I mean I do not know if they can. If it's that's an issue yeah and you bro you do have residents in here who are and speaking for myself, are afraid to even come in or go out of their homes because of their. You know the dice playing the drinking the smoking, the big Barbecue grills on the sidewalk, and when I tell you, no one lives here, that's doing it and it's caused a big problem over here where it really has a lot of people afraid it's just not in the buildable on the block itself, because a lot of people have to walk by here to go to their own homes. You know, and it's and you know when you see people outside you know guys outside and there's dice games going on. That leads to fights arguments, and then you know shooting stabbings or what have you and not. That was what was going on the night that young man got murdered, but you know anybody could have gotten hit. It was not like it was late at night when this happened. It could happen. You know whether they got who they was looking for, and you know wanting it or not. We do not know, but I'm just saying it could have been someone. I do not know if this guy's, what I'm saying was an innocent bystander, but it could have been me one of my daughters, my grandkids anybody. So it's you know you're afraid, because I know for a fact. I have called the police and they never show okay, when you going back to the location, if you have an instance where my with our police officers do not show that's something that will absolutely address. I was on scene for the homicide and you know we pulled the video and those shots came from the corner. So you're absolutely right. You know you have shots coming from a corner kind of far away. Anybody at that point could get hit. You should feel safe, walking in and out of your house asking people to clear the front of the building, though, if they live there or not, you can see how that could cause problems for us as a police department, the dice game. So should you know that's something that we do get regular ones there from time to time and it's something that we do check for the response times on, but again, all the response times are going to go in almost a priority order, a shooting, a homicide, a assault in progress, they're going to be the ones that are going to be under that three minute response time. Then we're going to work through our crimes down to the three one ones. Okay, as far as your community, though, and up there in that sector, we're going to con, you know you have two shootings there this year here, let's not let you have another one yeah, that location is, I would say, for the precinct violence- wise, it's second to nine five street or it's in nine five in that location they go back and forth. That's the reason why we're glad at least you have someone stationed there now, because Miss Henderson when I met Miss Henderson when she said how they're afraid to come out of their house. That's a lot, especially you know, since their families that live there, elderly that live in the building and those residents do not even live in the room. I can't stand seeing it either. I when we pulled a video and you did see a resident that was not associated with the group hanging out in front, walk out right before the shooting and that's scary. You know there were, I think five. It was six shots coming from the corner, that's about three houses away and that could have went anywhere in the window. I had to check the entire block to see if anybody else was hit in the down further on in the houses down on the block. It kill. It's not what we want to say you know, and as far as our investigation and that homicide we're going to look into it and we're going to. I can't give you more details of that, but I promise you that's what we're going to dig into okay. Thank you so much. Thank you. So the last question I have not seen anyone else ask Annie is going to be Mr, Fosto Hey good evening, hello. Captain. Thank you for your great job. Has your job has been affected by the funding in the in the in the area? So the only thing that's currently it's not direct result of the funding at this point is we have not gotten any new recruits and, as officers have retired from the command or went to different agencies, we have not gotten new officers back at this point. That's not you know. I do not know how that ties into the funding, I'm speaking to you as an executive, that's assigned to this precinct and somebody that hears your concerns and that's the truth. At this point I have not got any new, I'm not, and we do not we're not scheduled to get any new rookies, there's no academy class in now and the July one was cancelled, meaning right now you guys are understaffed. Am I correct? You're staffed we right now we hit our minimum manning on a daily basis. You know, but we're not exceeding it at this point. Thank you. Thank you. Fasto all right, thank you. Does anyone else have any questions for captain Matthew? Yes, I do. Okay, reverend Herron and you'll be our final question. Okay, this is Reverend Herron from the leverage memorial church, hi son. How are you on 32nd, Avenue and 103Rd Street? On the 103Rd street side, we've been having a number of young men just hanging out there, it's gone from where they been washing cars to where they're smoking, hookahs and smoking drugs and I've spoken to them and they've been cordial. They have not. They have not been rowdy, but they just hang out there and it's come to a place where they've brought chairs. They have a van that they park there and, I believe, they're living out of it. Some of them are living out of it. They leaving the place a mess. The place has really been a mess, and so I'm just asking you to look into that for me. 103Rd Street and 32nd avenue the leverage Mario church right on the side. Absolutely sir, the Mario Ropes is taking the information for me and we'll push it out to NCOS. These are our quality life concerns that we do have in a couple of areas of the precinct too, but we'll definitely get on that one. Thank you. Thank you all right. Thank you. Thank you. Captain matchy for coming out tonight. Your presentation was wonderful. Thank you. Thank you for having me I'll work on every one of these issues at this time and the captain has posted his email address in the chat. So it's there for everyone to see and again, if you brought up an issue, could you just shoot me the address so make sure we have it right anybody that that asks a response or yeah? I will be emailing you, so thank you again for my issues, but thank you again and thank you again for all you doing in the community and keep safe out there. Thank you all right. So we'll move on to our next Speaker Amanda. Are you here from Department of Homeland Service? Yes, I am here yep. We can't see you though Amanda I'm here. Can you yeah? I I'm on my phone. I do apologize. Okay, that's no problem. Do you have a presentation that you like to show, or so we do not have a presentation, but we do have folks from Nika on the call. I want to introduce myself for folks on the call who do not know me. I am Amanda Naser, I'm the queensborough director for the New York City Department of Homeless services. I do have the social service provider Nika on the call as well. They are operating the new hotel, the ibis. They are the social service provider on site, so I do want to give them the opportunity to introduce themselves. They are on the call and we will be giving a brief presentation about the operation that we have going on at the site. What the staff patterns look like security and then obviously we'll take questions from the community, but I do want to give Nika the opportunity to introduce themselves and then I will have someone from Nike just sort of explain a little bit about nika as an age as a non- profit altogether in the work that they do. So I do want to pass it over to Nika to introduce themselves and Amanda. I just want to say something so again: everyone, if you do have any questions, please type it in the chat and we will call you out one by one and those from Nike. I need to type your name in so if you could give me a minute when you before the next person announces themselves, because I think you're all of you are on the phone, I think yeah all right so go ahead. Amanda you can call them out and write their name in sure. I'm going to have Sierra sort of lead, introducing herself and then other folks from Nica can conjunct and introduce themselves hi good evening. Everyone. My name is Sierra Thompson, I'm the executive director of transitional housing with Nika and with me today I have ricardo Cosme, who is the executive director of governmental affairs. I have Maria Martier, who is the executive director of facilities, and I also have Anthony Acosta, who is the program director of the Ibis hotel with us? I'll have ricardo start off with a brief history on Nika good evening, everyone a little brief history of Nikah Nika stands for Neighborhood Association for Intercultural affairs. We are a Bronx based organization established back in 1974. Our mission back then, was to provide free legal services for families and individuals that are facing eviction or have cases in Bronx housing court. This was during the era where the buildings were burning and very lack of advocacy for residents. Now Nika has grown to the point where we continue to provide services for individuals that are facing eviction housing services. We work with rent carriers we reach out to the community and provide services and repairing their apartments and so forth. In addition to the services that we provide for housing and with families, we also have the transitional housing program that we've been doing since 2011.. Our first one opened here in the Bronx, and it was for 241 men and we have been extremely successful and since then we have been growing. We have transition housing program throughout the borough except Ma, except Staten Island. We provide an array of services on site. We work specifically only with single male and females. We are. There are some sites that are located in front of schools. There are sites that are located in front of churches. We have a great relationship with our stakeholders. The only reason why we have a great relationship with our stakeholders is because we coordinate quarterly Community Advisory board meetings, where we invite stakeholders to participate. That includes the community board, the elected official, the precinct any businesses or any faith- based organizations that gives them an opportunity to address any issues and concerns that may affect the community and as well, learn more about our services and provide updates on residents that are moving out and living back independently, so and jump in really quickly. That is something that we will also be executing in this community. We will start a community advisory board for this specific site. We will ask the Community board and the local elected officials to to you know. You know, share individuals that they think are appropriate for the site, but we will, you know, work with you all and identify folks that can be on the cab and we'll look to have one in October. So Ricardo. I are you sorry to have interrupted you. I do not know if there was anything else that you no that's fine and we will definitely collaborate with Amanda and identify those key stakeholders to attend our virtual cam meeting schedule late October. Yes, I want to pass it on to Sierra. Thank you, Ricardo Amanda. Did you want to start or yeah? Let's get started, so I know we do not have that much time and I did want to give you know a sort of presentation or share the operation that the shelter you know what's going on at the site, how many clients are servicing so just a little background for everyone. We were using the Marriott Hotel, for I believe it was three years prior that we had three years prior to this, this site we moved to this site sierra. You can correct me if I'm wrong at the end of July, we moved this site the Marriott to the Ibis hotel. So now we're operating at this at the Ibis hotel. Is that right? You guys started in July at the end of July, yes, yeah all right so currently at the facility they are serving 172 clients. These are single adult males. The population is general population, meaning these individuals either are employed or looking for employment, or you know, seeking some sort of permanent housing. So this is a general pop. What we consider a general population shelter. We are occupying 86 units and the number of clients employed is about 40. Obviously, that number looks a little different than it normally would. A lot of our clients are out of work, but I still think that's a great percentage given during given what you know the country is going through the during the global pandemic, so 40 percent of the clients are employed. The number of clients that we've been able to house in the past year is 56. So the goal for these individuals who are coming into our shelter system they go through intake. We DHS, we do an intake assessment of them, we're determining psych and socio we're doing psychosocial evaluations, we're determining what shelter best fits their needs. Once that assessment is completed, that assessment usually takes two weeks. It could be a little a little longer they're placed in an assessment site. Once that's completed, we find the shelter that best fits their needs. So in this situation, individuals who are residing at this site have gone to a an assessment site prior to this, and we've determined that this site is best for their needs and the goal Nika will work with them to obtain. You know public assistance, whether they you know they will work with them to obtain jobs. They will really work with them to find permanent housing. That is the goal here right. We want to move all of our clients into permanent housing, but we want it to be successful. We want these individuals to move into permanent housing and stay in but stay in permanent housing, so they do not have to return to the shelter system. So niko works with them. They meet clients. Our clients have to meet with their case workers on a somewhat regular basis. I believe it's every two weeks, they're required to meet with their caseworker. During those meetings, they're asked to present information, whether it's about pay stubs and show them that they're saving money, so they can obtain either a voucher or some sort of permanent housing. So I do want to talk a little bit. The staffing pattern that they have on site at the ibis so hold on one second, so I do apologize so they have 44 shelter, staffs, 22 guards per shift, and I want to give you like a further detail, broken down detail of what the staffing pattern looks like at the facility. So they have a site director. They have an administrator assistant, they have a director of operations, they have a security director of operations and security. They have a director of social services, they have an operations manager, they have two social services supervisors, they have seven social service and case workers. They have two employment specialists, one program associate and two housing specialists. They have seven shift, supervisors, 12 safety monitors and one residential aid. They also do provide meals to the men three times a day they are provided. There are in addition to that. There are 22 security guards. Now I do have a breakdown of the shifts. Obviously you know I do not know how much time I have here and what's important to share or not. This is something that if the community board would like, I can certainly share this with them and they can follow up with all of you folks, you could have that breakdown, but I do want to continue so we're able to get to folks questions, but that is the breakdown of the staffing. So I do want to talk a little bit about what a day to day looks like at the site when an individual first arrives at the site, they're meeting with the operations staff to conduct a new residence orientation and go through the good neighbor policy after they complete the initial intake. So again, like I mentioned folks, are coming to intake one of our intake centers for single adult males. It's on 30th street in Manhattan. We are doing an assessment of them there and then we're doing another assessment of them when they're placed in the assessment sites and then in addition to that, when they arrive at their shelter, the the staff on site is giving them an assessment as well and talking to them about the good neighbor policy which all clients have to abide by a good neighbor policy. We're happy to share what the Good neighbor policy is, but essentially it's asking the clients to you know, be good citizens and not do things in the community that they would not want doing done in their own communities to treat this community like it's their own. So we have all of the clients participate in signing something like that, and this is something that we constantly are reiterating to the clients right during residential meetings or housing meetings. The staff Nica is reiterating this information to the clients that they need to abide by the good neighbor policy that all of that stuff happens within 24 hours of the individual, getting referred to the site after that they are meeting with their caseworker for goals and setting me they're meeting with their caseworkers and setting goals right, whether this individual might need to enroll in public assistance, if there's other linkages and stuff that the site can't provide for them, they will make those connections and referrals for them to either receive those services, on-, site or off- site. Clients are meet with a case manager on a weekly or bi- weekly basis. If employment is needed, they are referred to employment special when housing ready is referred to a housing specialist. So these individuals, the men residing at the site, will work with again the employment special to either obtain housing. I mean to obtain employment and they will work with their housing specialists to obtain housing. Again, like I said so. If individuals, you know, are not able to receive a service on site, we will give them off off- site, linkages and referrals to seek those services that we might not be able to up. You know, provide on- site, so the types of referrals that we sometimes make are housing, employment, schooling, trade, medical, mental health, substance, abuse, etc. I do want to give the opportunity for ricardo, because this is the work that he really did on the ground to go out into the community and make these linkages and make these connections so we're able to refer our clients to them. So I want ricardo. If you could talk a little bit about the work that you've been doing on the ground to to make those connections as far as like referrals go. That would be great, absolutely thank you Amanda, so we, you know every site, every new site that we are able to obtain and develop. We always do a canvas of the community to take the opportunity to utilize the community- based organizations that surrounds the site that provides an array of services such as substance, abuse, alcohol abuse, mental health, even a general health care provider that can provide simple tests like Ppd or any other test. So we did canvas and we were able to we're currently working and establishing and establishing a linkage with urban health plan outside the salt Family Health center located in Corona. We also working with the Pac program of Queens, the New York State Department of Labor at workforce, one development for employment services, also a ahcr in Queens who is who does employment program services as well: catholic charities of Brooklyn and Queens brightpoint health services, which is essential in providing substance, abuse and mental health counseling. Also the queen center for progress for employment on preparation and career development, the addiction care intervention and the addiction care intervention provides the drug and alcohol treatment program. Now I may have missed other community- based organizations that may provide other services, so if any other community board members may know of any other programs that could be beneficial for our residents. Please share it with us. We are open to ideas and suggestions and no one knows their community better than you guys. So, thank you so much. Thank you ricardo. So before we wrap up- and I you know- I I'm seeing some of the questions that folks are writing in the chat. So I do want to get to those, but I do want to talk a little bit in addition to the other work that Nika is doing on site with these clients. So, as I mentioned in addition to you know, meeting with their caseworkers and their housing specialists and employment, specialists Nike is providing workshops and stuff for the clients to participate on site. So I want to give a little update on that and then we'll open it to questions, but so housing groups available housing available vouchers how to apply how to interview with the landlord those meetings are held or those were held every second and every third Thursday of the month, employment groups, so they host Mock interviews, interview, Attire, do's and donots of the interview, those meetings. Those workshops are held every first and fourth Thursday of the month, computer lab they to apply for housing and employment. So there's a computer lab, so individuals can go in and they can log in and they can look for housing and employment activities of daily living groups. I do not know, I do not know if you want to sort of share a little bit about what that is, that you guys do during activities of a daily living group and then, in addition to okay, I'm sorry go ahead. Oh no! Sorry! So activities are there living. You know how to budget your finances. A lot of the you know. Individuals may not know how to properly budget, so you know to help them be ready. For you know, returning to the community and be able to you know so, have a little change in their pocket, but still pay for a metrocard and pay for rent. We give them. You know, tips on how to budget their money, how they pay their bills. A lot of us. You know our communities are moving online payments, so we're teaching them how to use the computer how to do online payments, even something as simple as you know, how to cook a quick meal or how to wash your clothes or things that are in local communities, that they can do. Food pantries and things like that. So when we refer to activities of daily living, those are the things that we're talking about right and then, in addition to that, they're having housing meetings every third Wednesday of the month, so in those housing meetings, they're going over this information, whether it be the good neighbor policy or speaking with clients about workshops and other things that they have to offer them and speaking with the clients, if there's anything that they can refer them to. So you know nika. I do not know if there's anything you guys else, you guys want to add before we sort of take questions from what we're going to do Amanda before they end off I'm going to there's some people on the phone that may have some questions and then I'll call the names of each person that has written in and then we'll field the questions that way. Okay, yeah sounds good and that I have some yeah I'll call questions first, but I think I do not know if Amanda's finished yet I am done yeah yeah, all right, miss doc. You can go okay, Amanda I'd like to know whether or not your residents participate in the census. That's actually a really good question: Sierra or Ricardo. Can you guys the census? I do not know actually Ricardo or Sierra. Do you know if someone from the census has been to the shelter to try to? I know Amanda. Let me answer that hi. This is Ivan Balot, I'm a social commissioner for adult shelter operations we have as an agency as a holistic agency against all of our sites out. All of our shelters throughout the city have worked with the Census Bureau to participate, there's no individual shelter, that's participating with the census because we have given those numbers as an agency, so your numbers have been submitted directly to U.S census. Yes, we've had people work with the Census Bureau regarding our shelter, residence and shelter, and how are they submitted? Are they submitted by neighborhoods? Since you know it's really by our district accounting, the numbers, especially in Queens, I'm not sure how they were submitted, whether they submitted by neighborhood or just, I would imagine so depending on where our shelters are, but we can investigate and get back to you. That's really important right now, because our numbers really need to come up in our area. Very good. Okay. Another question have any of your clients tested positive to cover virus, hello, hi. I can answer that so with DHS. They provide us testing actually every three weeks so in regards to our hotel at the ibis. No, our clients have not tested positive for Colby. However, if I may, we every residence that or the residential staff that do come in on the site they are, they are temperature, checked and to be screened. Yes, okay, thank you all right, so the next pat beckles good evening. Everyone hope everyone is well. I have a few questions. First of all, how often you know a temperature check does not determine positive or negative coded. So what else are you doing as far as testing? So in regards to testing? What we do is with DHS. We have d just provides us with providers, but medical providers that come in and they set up shop, so they set up like a little clinic within the within the hotels and the clients, come down and get tested, so that testing occurs every three weeks. Okay, next question: you said you offer all these services. How long do they receive their services? Do they receive employment services, housing services, Social services, addiction services until they have gotten a house until they've gotten a job or how long does it last yeah? So we put, we provide services up and well not up until so. We provide services during the duration of their shelter stay and then we also provide services a year after they move out. So once the client once the client work, you know they become a part of our shelter system. We provide them services right away and then we follow them up to a year after they move out just to make sure that they stay out acclimated that they do not need any extra. You know services or anything like that and make sure that they get settled and that they're okay and that they're able to you, know easily. You know progress into the community and if they need any extra needs or anything like that, we're able to provide that to them. So we can, you know, make sure that they're comfortable and that they can stay in the areas that they're living in okay. So you also stated Amanda. I think you stated that you provide a good neighbor policy upon them entering the shelter within the first couple of days. We have to actually I'm a resident of Dick Marsh Boulevard. By the way we had to actually complain because of some of our residents complained about the occupants of the shelter urinating on their lawns, harassing the seniors at the senior living facility, liquor in hedges and basically a nuisance yep that young security, that's when security was instituted. I'm sorry say that again, that's when there was a security presence yeah, so I would say if you know we did meet myself and Nikah met with residents of that area. I think it was a few weeks ago. I do not know if you participated in that in that meeting, but I will say that if we, if you guys, are seeing individuals in the community that you know are due engaging in those sort of activities that you're describing, we would encourage you to reach out to us either via you know the 24 hour line or an email or even myself, you can always contact. We will, you know, figure out if that individual is a resident of ours, and if they are, we will figure out either will case conference them or figure out a site that might be better for them, but we will certainly share a contact information for everyone on this call to have if there are concerns about what they believe to be our clients. I know also at that meeting I had suggested I believe Moya's office hosted it with other. You know residents of that of that block, but what I suggested that we start an email chain if folks are interested in doing that, we have not started that email chain. I've been where you know we're waiting to get everybody's contacts, but if folks are interested who are on this call in joining that email chain, it's just a good way for us to all be in communication. We will, like, I said, start a community advisory board meeting for this site, but I think you know hearing from residents in real time. If there are concerns about our clients, we want to hear those and be able to address them really quickly. So again we will share contact information for folks to have so. If there are concerns we would like to address them immediately. I do want to you know I do want Nika to talk a little bit about you know, sort of the patrol or security a little death. I know I had mentioned the staffing pattern, but can you guys talk a little bit about if that's, okay, Amanda a few questions, we still have a number of questions. Yeah we'll go back to Nike in regards to the question: yeah: okay, Burns, but Miss Ruiz Mr put his contact information to the chat. If anyone wants to look at that information, you can have it there, but thank you pat, but we're going to go on to the next. We have a few questions and I want to get those questions in all right, amanda and then because yeah, of course, yeah great information Troy. I thought someone else was going to read it. I'm sorry! Oh, what's your talk go ahead! Some questions. Are there plans to acquire space at the a- law hotel, which is the neighbor to the abyss, and I asked that question because the aloft is currently vacant and I'm noticing that security is managing the potential in and out of that entrance. So in short, I just wanted to know if there were plans to acquire space in the a- lot hotel, in addition to the site that we're using no there's, not nika, will only operate out of the Ibis hotel now. So it's not an ideology. Can someone from Nike Clarify because I am unaware of but hi? Yes, we are. We are only at the Ibis hotel. We will not be staying at the loft and I'm sorry just one additional piece of that. You mentioned at the start of the presentation that there were 86 units being occupied in the ibis. Is that the entire hotel, or do you know what the total room count is that's the entire hotel? Thank you all right, frank. You had a comment. I see you said something there or is that was just a comment. Yes, hello, everybody. My question just simply comes down to is this the right classification of shelter in this area? It's a residential area. We have six shelters within a mile of each other. We have family shelters, we have a rehab center, we have a nursing home and we have residents without gates. We have property lines were good enough for that, and we've already heard that the response time of the police is not adequate right now. You know it's easy to sit back and say call somebody, but when you're being accosted, how do you call? I mean we've heard from them saying that this is a excuse me, the governor actually said this is a transportation desert and one gentleman from Nike was saying that this is a they get all these services from everywhere, except for east Armhurst. So how is a viable location for this classification of a show so I'll answer that this is amanda from DHS Frank? I know that's a question that you've asked us previously and, as I've said before, you know we are looking to open, shelters and we've been opening shelters, all acrosss, New York City in every kind of neighborhood you could imagine, except for those places all right Frank. Thank you all right, Amanda, I'm sorry! I do want to just continue to answer so yeah. I do not know what Frank said, but I imagine it's something about community boards that do not have sites and, as I've been as I've said, before, we're looking to open shelters in those communities too. This is you know. The mayor has an initiative called turning the tide. It's we're going to open, 90, shelters, we've. I believe we've hit 70 and we're looking to open again, 90 and close out commercial hotels, but those 90 sites we're looking to cite all acrosss the city, not just in your neighborhoods, all throughout New York City. So we do think this is an appropriate site. We've operated homeless, shelters in residential neighborhoods in communities that have no transportation similar to yours, right where the transportation is just buses and stuff like that and like we did mention you know, Nika is the social service provider on site providing services, so the majority of the clients are able to seek their services that they need on site, but we're also trying to create an environment where these individuals are going out into the community and seeking other services that they need, because that when they leave the shelter system, they're not going to have services right downstairs right, they're going to have to go out and find those services, so the services, then the linkages and the referrals that Ricardo found you know might not be right next to the shelter, but they very are close to the site that we're operating and again. This is a temporary solution for these individuals. We are trying to create an environment where they can get up and they can do things on their own with the little support that we're going to give them. So yes, we do believe that this is a an area or a neighborhood where we would open a shelter and we do think it's appropriate. This site had operated very well for the last several years at the Marriott. We are transitioning into this site. Nika is getting a new security team, so I think once those things come into place, you know it will be like it was before. I think a lot of folks on this call probably did not even know we were at the Marriott and that's the information that I've received. That folks did not know, and you know I mean we want to work with the community. We want to create a partnership here. We will, like, I said, have, meetings and stuff, so we can hear from the community. We can share what we're doing on site, whether it's moving folks into permanent housing, the services that we're providing. So we will continue to have conversation, because you remember my confusion and I just want that clarification for everyone to understand what temporary means, because different things to me versus, what's the definition yeah and then we'll go on to the rest of the questions. Sure yeah so for temporary. So part of the turning the tide plan is again like I mentioned open, 90, new shelters, 90, new, high quality, shelters and kind of and close out all these cluster sites that we're using the borough of Queens does not have any cluster sites. So we want to close out cluster sites. We want to close out commercial hotels, so the goal is to close out all cluster sites by 2021, I believe, and to close out all commercial hotels that we're using by 2023.. So there has been a back and forth with myself and community residents when we've had calls prior to this one about what temporary, obviously temporary means something different in my eyes and what the agency states as temporary than it does in your eyes in the community's eyes. Right when we say temporary temporarily, we mean we will close out this site by 2023. If not before that this is not a long term. We do not have a long- term contract at this facility. We are looking to phase out this hotel. Thank you. Go ahead, all right! So nula you had a question yeah. I wanted to know if there was any preference for locally homeless people to go to local shelters what I've dealt with people in our neighborhood, mainly around the Brooklyn Queens expressway. One of the reasons they do not want to go into the shelter system is they say they have to leave the neighborhood. So is there any way to keep the people who are housed the people who are homeless here in the neighborhood in the local homeless? Shelter like yours, yeah? That's a really good question and absolutely that's something that this administration is really looking to do. This is why we created this borough- based plan, we're really trying to keep individuals and open shelters in every community that they do not have shelters, so they can give. We can give folks the opportunity to sheltered in their neighborhood now. Obviously you know I do not know if you're speaking about chronically homeless, individuals or home individuals living on the streets- and you know in that case they might not be appropriate for this site, which is unfortunate and are looking to open more drop- in centers and safe havens, which are more appropriate for our chronically homeless individuals who have like maybe mental illness or substance abuse. Those are better facilities for them, and I do not know if that's what you are. You are saying here, because in order to meet the criteria to be placed at this site, you have to be able to move into. You know like looking for permanent housing, no severe mental illness or substance abuse, but absolutely like. If someone becomes homeless in this neighborhood we want to, we will give them priority and we want to prioritize putting them in a shelter in their neighborhood if it's, if it's appropriate for them right. If an individual is coming into our system and they have severe mental illness or substance, abuse and they're not able to get a job and we would we would have to find another facility, not in the you know, this would not be the right facility for them. I do not know if that answers your question, but yes, we absolutely want to do that. We understand and we recognize you know the importance of being in your community and we know very well that residents are, I mean you know, individuals coming to the shelter system are very reluctant to come in if they are not able to be in sheltered in their neighborhoods, which is why we started this borough- based plan. But when it's possible, we absolutely do that. Yes, all right. Okay, quick follow- up what here in the neighborhood can we do to welcome our new neighbor yeah? I love that question and you know I think I would like Nika to sort of weigh in too as well, but I think there are many things that we can do to like work with you guys and create a better partnership, and you know things you guys can do to welcome these individuals, whether it's care packages, I'm happy to speak directly with you after this call or offline about what that could sort of look like in brainstorm ideas. We love that you know we we're very appreciative of that. We obviously you know these individuals will be in this community, for you know some time and we want to make it work for you guys, but yeah. So absolutely I'd love to connect with you after this call about what that would look like Norris, yes, hi. I think you might have answered some of my question. But how long do you intend to use the ibis or ibis as a shelter like what? When does the contract expire? So I do not have specifics on the contract and I'm happy to follow up internally and get maybe more about that. But as I mentioned it is, it is a commercial hotel, as you, as you all know, and under the turning the tide plan, we will phase that out and it should be by 2023. It could be sooner, but I think because of the capacity needs that we've had to readjust our focus during Covid-19, it could be, it probably won't be you know. I do not want to say anything actually like that. I'm sorry I do not know, but by the end of 2023, we will be out of this facility and have any of the 300 men moved from the upper West side or that will be moving from the upper West side been relocated to this facility. No, they will not no nope. Okay. These the majority of these men had already been at the Marriott and then once they moved from the Marriott to the ibis. Those individuals moved from the Marriott to the Ibis hotel, but no none of the men or the individuals. None of the sites that were closing on the upper West side. They will be coming to this site. No okay, Chanel. You had a comment that you had posted yes and they did reply. I just they had named a number of facilities that work with individuals dealing with substance abuse and you do have a facility walking distance from the shelter elmcore on 108Th in Northern boulevard. That has been a part of the community for 35 years and we do have substance abuse, inpatient, outpatient services, wow. We really appreciate that we'll definitely ricardo. If you could capture her information, we could connect you guys. That would be great yeah awesome. Thank you. Thank you. Thank you. I already dotted down the information and I appreciate I appreciate the connect, no problem and we also have a career services center awesome. That's amazing, tonya, Davis, Roberts and that'll be. The final question is from oh wait and Lobston has a question: okay, Sonia! Yes, thank you. I just wanted to know are any of the residents in this that you have there? Are they accused or convicted sex offenders or violent offense, violent offenders, violence, offense yeah? So let's we can talk about the sex offender, Aspect, Sierra or Ricardo. Do you know if you have any sex offenders residing at this facility? I think the last time we talked about this, you had said no right. So when we receive the clients during their initial intake, we do screen them for that. So at this moment we do not. We do not. You say what do you mean? What do you mean at this moment? Are we talking because the courts are closed and they have not had an opportunity to have their cases heard or completely? No, I'm not sure. No, so what happens is if we do, for example, if we do receive someone who you know is a certain level sex sex offender, we do request a transfer, especially if we're buying schools or anything like that, but as of right now, all the clients that we do have currently at that facility. We have done a background check on them and no, they do not. Thank you all right, a lob song. I do want to answer the follow the rest of that question or whether convicted felons or individuals who might have been in you know in prison. I can't give specifics about that, but you know we have a right to shelter law. There is a right to shelter law. We are legally mandated by law to provide shelter to any individual who seeks you know, shelter from us and that could be- and I just want to be really apparent that could be. You know, individuals who I do not want to say. Yes, 100 percent they're individuals living here who had been are formerly incarcerated, but I also do not want to say that they're not right. We have a legal mandate to provide shelter to individuals, so if they've completed their time and they do not have a place to live and the state was not able to set them up with some sort of housing, you know they would come into the shelter system. Now I know recently there has been you know, we've been the mayor and the state have been letting folks out of Rikers. I know that that's another department of corrections has been opening other facilities separate from us to house individuals who might not have housing but but yeah. I do want to be transparent on that and then so as far as the sex offenders go as well, I want to be clear about that as well. So, although there are no sex offenders residing at this facility now, if an individual is a sex offender and they do not have living restrictions, they can be placed here now. That's not obviously an answer that you guys want to hear and that's also not a policy that DHS or even nika creates it's a law that we follow right. If an individual is a registered sex offender and they do not have living restrictions, they can be placed anywhere in New, York City, that's any individual who might exit you know. You know the prison and they have to register as a sex offender. They could live in your neighborhood on their own free will if they are not if they do not have living restrictions, so I just want to be really transparent about it, but but yeah all right. Thank you follow my question on that. Well, if someone is- and if someone, if, as a comes into the community on in your shelter who is who is a convicted sex offender and they have to register as a sex offender, will you notify this community at this person or you have someone in your shelter there's a registered sex offender? We need to be notified of that because we have elderly, we have schools around. Would you notify the Community Board of that? So you know this is a question. I get a lot about sex offenders and whether we would notify so. The notification that looks like this is so individuals who are registered sex offenders are already on a registry, a public registry, so it would be like any neighbor in your community that comes into your neighborhood. There would not be like the precinct would not announce it at like a NCO meeting or anything like that or build a block meeting or whatever it would just be. You know on the public registry that folks would be able to identify if there is now. I can not give out information like that. Like I can not say. Yes, we can sit here and say there are zero amount of sex offenders, but I can't notify you guys if there is a sex offender who resides at this facility, you would have to go on to the public registry where individuals are registered. Obviously, that's not an answer that you guys want, but I'm just trying to be honest about what information I can give you guys. Thank you all right, lob song and then miss Reed and Miss Reed will be the final question. I just want to be mindful about the his felonies. Rather than that good question. I have some people that do not have an apartment or living place, but they're looking for the job and they do not make enough money. So what's the requirement to be placed in soldier and do they get like what kind of facility they get like apartment or room or something? What do they get? So you mean when individuals you know are having. So that's actually like a lot of our clients who enter the shelter system right. A lot of them do have jobs. They just are not able to make ends meet because living in the city of New York, as you all know, is very expensive and finding actual affordable housing is almost impossible, but so what we will do and our providers will do- is they'll work with each individual to secure a voucher if needed. So most individuals who exit the shelter system will exit with a voucher, meaning the city will pay a portion of their rent and they will be responsible for covering the rest of their rent in order for them to qualify that for that they have to have an open public assistance case and they have to be continuously working with their case workers to prove that they are eligible for it right like if they're, showing that they're saving their money and stuff like that. We want to make sure again when folks exit our shelter system if they are exiting with a voucher and the city is paying a portion of their rent. They are saving their money and being responsible and they are able to pay their portion of the rent until that voucher expires. All righty. Thank you, miss reed. Ah, good evening, everyone can you just advise about overnight staffing and security. Sure I want to pass this over to Sierra to answer that, specifically about overnight staff and security yeah. Let me before you start also, if you can talk, speak on whether or not you have. I do not know if you mentioned, if you had medical services or nursing services on the premises. If so, if you can advise about when that personnel is is on, is working yeah, those two things great okay good evening, so in regards to overnight staffing, so we have so each shift. We have three shifts. We have a 12 A.M to 8, A.M, 8 A.M to 4 P.M and then the 4 P.M to 12 A.M, so our overnight staff. We have about 12, I'm sorry about eight ras, eight residential aides, but we also still have 22 security guards on the overnight staff and we also have, and then we have our operations manager who works around to 12:1 o'clock in the morning, just to make sure that everything is safe and secure and everyone's in their proper place. Before we get into the full swing of the overnight shift. Okay, and do you have medical personnel or a nurse on the premises and if so, what what hours are they available? We do not have a medical like a medical team on our staff, but we do have brightpoint health who provides medical services, so we do have like medical vans and things like that or providers that have those type of things that they can come and bring services to the site. So we do not have something permanently planted at the site, but we do have providers that come to the site and provide services when needed. Okay and one last question: do your clients have a curfew? Oh yeah, they do and that's something we should have covered. I do apologize so yes, this is a standard, wide curfew for all single adult sites. Acrosss the city, it's 10, P.M individuals have to come in through you know. I do not know what door they're using, but they have to come in. They have to sign in and then there is room checks that we do. If folks miss curfew, you know they might lose their bed and we might be transferring them. You know DHS would come in, for you know by then, and bring them to another facility. Folks who have jobs are able to. You know, get a pass and work or come in after carefully, but they have to show you know like a work schedule, but yes, a standard acrosss, the board. There is a 10 o'clock curfew and then, in addition to that, there are room techs after curfew. Okay, thank you all right. So thank you, amanda, of course yep. Can I add one last thing I did provide hi. This is Ricardo cosmic release. I provided my contact information on the group act and also you're welcome to look us up on our website. Www.Nicany.Org. There you'll see the many services that we provide and also all of our sites and there's a phone number there and also an email address any issues and concern in addition to what I posted here, you also can reach out to the email and the phone number that is on the website. I get that as well all right. Thank you so much department of homeless services and we have your contact information and I know folks will definitely contact you. Thank you great. Thank you. So much again, this is looking forward to the information about the when you're starting to put the people for the cab great yeah. We absolutely will be in touch. I appreciate on the Community Board for having us tonight and again we will be in constant communication with you all and we will look to start a cab in the very near future. So thank you so much all right. Thank you. Thank you. Good night, okay, be safe, good night. Thank you! Everyone all right, good night! Thank you! So much mrera, so everyone we're going to move into our public hearings. I'd like to call up our two cheers of our capital and expense budget, Elba, buendia and reverend Peter Haron. If you can introduce the material and all members, you should have received this information, your packet and it was released to the public by our social media. If I can just interject tonight, we're just asking the public if they would like to add to our priority list. We're not conducting the public hearing this evening got you because I saw it on the public hearings, all right, so elba and reverend Haron. So you can ask, and if anybody has anything they can put it in the chat, and I can read it off to the committee players, but there's Reverend Haran everyone, my name is elba and what is my partner? I do not see him. Okay, we hope everybody has the package, the document where we have the priorities for the budget, expense and the capital. So, like Ivana, said tonight, we're just going to have received any suggestion if you guys want to move them from one place to another. So we just open speak up. I see Reverend Haron is still here, but I guess so. Does anyone have any additional suggestions? I'm still here, okay for a few months, I'll give it a minute or more. I see someone put there Lisa it's in your folder members of the board and the public. We did post it. If anyone does have any additional suggestions, it can be emailed to the board at Community Board three at NYC, DOT rr.com ronetta, find me suggestion. Yes yeah, so I think we should also have because we live in the transit desert area should have a metrocard stations all right. So can you jot that down committee chairs under transportation? Anyone else has any other suggestions. We will be having a meeting with the committee coming up soon and others can join the mid the meeting and then also you have any other suggestions. You can definitely email. Someone say something all right again, any other suggestions can be emailed to Communityboard3 Nyc.Rr.Com or call one eight, four, five, eight, two, seven zero seven. I do not know. That's why all righty so he's the salami saying something? Yes, this who lisa yeah Lisa? Are you saying something you have to turn your mic on all right? I just wanted to know which one of the parks they say, northern playground, because we used to is it the one on 90th or the one on 94th street or the one on 93rd there's a couple of them? Oh, it's not important I'll! Look on my own lisa. What item number? No! I just wanted to know when you say upgrade northern playground, which playground which street were you talking about when we refer to the northern playground, we're talking about the one. That's opposite, the precinct opposite the precinct. Okay, great, that's! Wonderful! Okay! Thank you! Does anybody else have any other questions or comments or suggestions to share with our chairs all right? Thank you! Elba and Robert Moran good evening, as it is good morning for me tonight we have five applicants and then I want to say a little something after that, let's just get into it because it's getting late first application is Valdez House, Bar, Restaurant, Corp still early all together would still be a little we're doing good with time, but go ahead not really but 9109. 31St Avenue East Elmer's application for a wine Md license is the applicant present. Do you see their name down here on in the chat? Yes, you can hear me rodriguez, yes, how you doing good evening so you're, the representative. Yes, I'm the representative, okay, the applicant's, not here the applicant, is there too yeah? I think they were speaking louise. Okay, I see him. Okay, welcome so just give us an overview of the business. It's a restaurant that is still not open. It's increasing couple things to start the request by the Community Board to get to get a community liquor license stipulation was already presented as requested by the board, and we took all the information that the board requested at the time and we send it notarized as so. What type of restaurant is it? What just idea of what the operation is going to be? What the restaurant is food ethnic food- that's going to be on in the area, it's going to be a full kitchen and the area for the restaurant. Okay. Does anyone have a question? Please only one at a time? Well, I think it's best for them to chat to type any questions in the chat and then I'll. Let you call them out. Okay. Does anybody have any questions and the chair will look in the chat, get them one minute? Okay, so I guess no questions. Yes, I'll, just unmute the two people, okay! So no questions. Can you pick it up in a quick executive session later? Thank you. Thank you. Thank you and you can. He is 9504. Restaurant Corp doing business as Rico 9504 37 in Jackson Heights. This is an application for a new full liquor license is the applicant present. The attorney are Helio Rodriguez, I'm here. Okay, so just give us the presentation just an overview yeah. So pretty much. This is a Rico restaurants and it's a standard. It has standard hours, so it opens 11 A.M to 11 P.M on most days and Friday and Saturday. It closes at 12 midnight. It serves it's. It focuses on peruvian food. It's a small, very small location, measuring 350 square feet. It has it just has several tables and several chairs it's a smaller place. You know it'll probably have a larger, take out, slash delivery component to it. The idea was just to serve. You know that area around it's located at around 95th street and 37Th Avenue. Okay, anyone have any questions. Please type them in the chat. I'll give you about a minute okay. So it seems like there's no questions so we'll move on next applicant is Alex. Pizza Deli, Corp, 70-, 20, 35Th, Avenue, Jackson Heights application for a new wine and beer license is the applicant President, I'm the representative, Gustavo SAPOlgal, the applicant is president as well. Okay, just give us an overview of the business sure, so it is. The business is located at 47:11, 45th street. It's been there for about three or four years now they are now applying for a beer and wine license. The premise is going to sit. It's going to have four tables seating, a total of 16 people Max the type of food that they served. It's pizzas italian dishes and he has a mix of some spanish dishes in there as well. The stipulation was sent to the board, as requested for the hours of operation 7 to 11 pm Monday through Saturday Sunday, 7 A.M to 10 P.M and alcohol service, beginning no earlier than 11 A.M Daily. Are there any questions, type them in the chat right? I think he gave the he gave the wrong address. Can you repeat the address? Sorry 70:20, 35th avenue? Okay, any other questions, yeah, it's right, acrosss from Regal heights, okay! So we'll no other questions so we'll move on next applicant is Michelada. House New York, two incorporated 8819 Roosevelt Avenue in Jackson Heights application for a new wine and beer license is the applicant present? Okay, the representative is having trouble unmuting himself. Can we see if we can unmute Victor o'see? Okay? Can you look for him? Victory is unmuted yeah. He is unmuted. Yeah he's just not saying anything. Call him by name Victor representing Michelada House New, York too incorporated yeah he's on me. Yes, I'm muted. I see it on the screen. Yeah, it's green. He just a muted himself. Let me just unmute him. Oh he muted himself. Oh no, there's two victors there yeah! It's the second one. Well, he just muted on me just muted himself, yeah, there's someone all right and he's on me. He has to unmute himself. So do you just want to talk to it since it seems like unless someone wants to contact him? If not, we have to keep it moving. You have a phone number for him. That's him ransom! Let me send this I'm going to request that I do not know what I clicked you. What are you trying to do? Oh I'm not familiar with the Mac okay. I just sent Clara a message to call her so we'll come back. Okay, good, so we'll go to pro Cyan incorporated Dba Fun 8422, 37Th Avenue, Jackson Heights! This is a application for a new full liquor license the owner is on it's. The first victor is the applicant present hi? Yes, sir, yes, welcome. Thank you very much just an overview of your business hi. My name is Ellen. I'm from ABC licensing we're the representative for Pro Cm, Inc, Dba, Tan they're, located at 84:22, 37 avenue between 84Th Street and 85th street. It's a thai restaurant Thai asian fusion they've been operating since February of this year. It's a small restaurant. They have six tables and 12 seats, a small bar which is 7.5 feet by 7.6 feet with four stools, so total of 16 seatings available in the dining area, which is about 330 feet, 330 square feet. The total size of the entire restaurant is about 1080 square feet. The first floor is dedicated to dining and kitchen restroom and basement will be used for storage use only currently their business hours 11:30 to 10:30 7 days and he's he and Victor will stay as and keep that business hour, as is, and any questions all right. Any questions tag them in the chat. If you have any questions, okay, we have no questions. Thank you. Thank you. Thank you very much. Well, the previous applicant is still having an issue entering okay, so we can Clara can give him or who has his contact information so that we can give him the power of us could have him at least call in. So we get at least a verbal okay. We will do that in a second hold on Okay Miss Reed spoke to Clara and she gave Clara the information and the gentleman should be dialing soon correct, Ms, reed, okay, I'll give it I'll give it to Clara right now, I'm going to give it to her by the Chat Clara. I just gave you the telephone number. Okay got it. Thank you, wait and see if the attendee number goes up I'll show when he dials in okay. Where am I in the camera, though who's? This? Is this the oh? This is high room, oh okay, so Hiram you'll turn on your camera. We're coming to you next with Hamlet. Okay, all right coming to you after this report and Hamlet, are you ready to go right after Edmond? Thank you, Hamlet! Are you on okay? Can you hear me yeah, so we just a minute after edmonds report, then you'll go right after okay does not look like he's calling in all right. So do you want to talk? Did you talk a little bit about the business already or shall we move on, then we can move on and we'll talk about it. In executive session, I got you so Hamlet. Can you please I wanted to mention, but you want to mention one more thing: there's someone that just arrived, so I think he's on now hello. What's his name victor, are you on yeah, I'm online? I'm watching I'm watching you. So I do not know. I hear everything that you talk with. I can't get it talk with you. I do not know what happened. I'm sorry any convenience! Okay, so this is Michelada House New York, two incorporated yes Sir, I'm here with Mr Jose diaz, the owner of each alarm. This is a restaurant, a spanish restaurant Mexican exactly located in Aba 19 Cruz Pelagio, Jackson High. This is the application for research. Why am beer? Actually we under temporary permits? There was a previous license of chinese restaurant and descent. This is a mixed area. No bar a family restaurant no dancing floor, no u- box, no live entertainment, just as recorded by the owner they like, so they we signed already with a community border with stipulations hours, operation, Monday to Wednesday, to 11, A.M, to 3, A.M, Friday and Saturday from 11:2 A.M to 3, A.M and Thursday, and Sunday 11 A.M to 1 Am. Alcohol will end one hour prior to closing and kitchen will be open for food service. All the times we have had, the certificate of occupancy is 73 persons. We have 14 tables and 62 seats include with a four waiter services. Okay, are there any questions in the chat? If you have any questions, what is the? Is he always there? Yes, no! I just muted the person all right go ahead. Admin, oh we're going to start doing a little bit of business outreach before it gets too cold. I'm going to be contacting everyone to solicit volunteers, we're aiming to gather information for contact information, the businesses in the area so that we can easily disseminate things from small business services and chamber of commerce places like that meetings, workshops, grant opportunities and also to distribute our information if they need any assistance or help. Ideally, I figure this can be done on each individual volunteer's own time, but we'll set a time frame to have our initial outreach done. So I'm going to probably email requesting volunteers. Now I have a little meeting first, hopefully soon and then we'll get started all right and you can reiterate that later on in when we do again in committee reports- okay, if I'm still here, if you're still here- okay, I got you because it worked. This reason why you mentioned it now, I see all righty, then we'll call up the land Use Chair, Hamlet, Wallace. Okay, thank you. So much welcome back everybody. It's glad good to hear you. We have one application. This is BSA calendar number 315-, 90 dz, it's 82-, 06, Astoria boulevard. This is a Bp gasoline service station on a court southeast corner of 82nd Street, and that story boulevard. So been the approximately about 60 years, four pump islands. We have genetics about five underground, 400 gallon gasoline tanks with a one- story, a one- story, convenience store on the site. This is Block 1094, lock, one in the Zone Design District commercial overlay, C2- 3 in the residential area. Zoning district R4, I'd like to invite Mr hyrum the rock group to to who's representing the architect to speak. Is he here hello? Yes, he's here, you can take yourself off of a mute, high room, okay, good! Go ahead! I'm here! Thank you! Thank you, everyone! So, as Hamlet said, the gas station has been there for 60 years. The extension of term, which is a maximum of 10 years, has run up this coming January and we're seeking an extension of term for another 10 years. Without any changes to the gas station. It has roughly 1100 square foot convenience store with four pump islands. It's a 24, seven hour station and there are no changes being proposed. It's occupied by a bp. Okay! Are there any questions? If you have any questions, could you verbally say on them, because I can't, I can't see the chat. Thank you very much so go to the executive session now. Thank you. Thank you. Everyone. Thank you, chair all right. Thank you. So much hyrum, absolutely my pleasure all right. Everyone, so we'll go into our executive session. As you know, we always open up our executive session with the pledge of allegiance. So let's begin with our pledge of allegiance, I pledge of allegiance. Thank you. Everyone again welcome to our first meeting of the year of the after the summer. Excuse me welcome to you all so before we begin I'd like to adopt the agenda with corrections, I call for a motion. Motions by committee will first bring up business, echo, okay, hello again, so we'll start with the first applicant first applicant is Valdez House Bar Restaurant Corp 9109 31st Avenue, East Elmhurst. This is an application for a wine and beer license. Motion by committee. Its committee recommends approval of an application for an on- premise license, provided that a stipulation has been signed. Saying the hours of operation will be 9, A.M to 1 A.M on Monday Thursday and Sunday, and 9 A.M to 3 A.M on Friday and Saturday Alcohol. Our pride one security guard will be present from 9 pm to closing from Friday to Sunday and there will be food service at all times. Do you have a second? I second three times: okay, call the question: okay, the motion to approve Valdez House, Bar restaurant court, 9109 31st, Avenue, East, Elmhurst, New, York, 11369, new wine and a beer license. Yes for approval, no for disapproval and we'll start with cam black, okay and brown. Yes, Elbow Bundia, yes, Mark Burmester, yes, Mr Chowdhury, no, hey gold, Cornell's, Courtney, Cornell's, listen, hey, go yes: okay, Sonia Davis, Robert, yes, Vivian Doc, yes, Margaret, Dossier, Yes, Venetta, English, yes, Mr Gandhi! Did you say yes, Gideon difference? You got a lot of cases. Yes, you really want to see better and better. Yes in case that one should not you, someone should mute. They have your television going: pastor, Peter, Herron, no Mr, Howlett, Halidar, Abdur, Abdul, Harim Haliter. I do not think he's on right now: okay, Edwin cannon, yeah, Steph, Stephen Kohanick, yes, Marta, Lebron, Lepreton, no Lisa Mesulet, yes, are silent, laverne demons, yet Nola Nordie, oh no Nola, yes, Philip Pappas, yes, Ladies love Perez! Ladies Dorothy Phelan, Dorothy, Megan, Rockwell, yes, Foster rodriguez, yes, Tammy rose, Tammy rose, Edmund, Mosenbaum, no Lopsang, Salaka, Lopsang, Frank, Taylor, no love last name is mute. Lobster unmute yourself! Yes, did you hear me? Okay, I hear you now. Yes, okay, Chanel Thomas Henry, yes, Hamlet Wallace, yes, toys, Washington, Simon, yes, okay, that's it! We have miss. This was like yes, ladies. She said yes and Abdur is back okay, where's lettuce. Ah, yes, I said yes in writing. I had bubbling with a microphone. Okay, I have you. I have you, ladies yes, for approval. No for disapproval. He does not hear anything. Did you get Richard Mullins? I have Richard? Is here Richard said yes, okay, nothing from is it is it anyone that I left out? Did everything romero, hello, yeah? You can totally answer romero. Yes, oh yes, okay! I have you. Okay, I'm glad you're. Here laverne: did you call Ed Wesley? It is not on today. Okay, no, I have him down is absent. Okay, who was that? Who was that last person to just Leonardo? I do not know, remember oh romero? Okay, let me get you down, okay, all right. Okay, so I have Kevin's tool there, so she's adding up everything with Excel, so it's taking her first time doing it. So, thank you. Lebron! Listen, it's interesting! Okay, so I have 23 yes to no! I have three abstentions. Oh no frank! I'm sorry! I put you down. No! That was my mistake. My error! Oh no problem! Okay, okay, I think I have it now. I still have one do not have your TV on. In the background. Please put your phone on mute after you voted. Please! Thank you. So we're good. Okay, I have 23. Yes, six! No okay, admin go ahead. Okay, so that motion passes second applicant 9504 restaurant Corp, Dba, Rico, 9504, 37th, Avenue, Jackson Heights application for a full liquor license committee recommends approval of an application for an on- premises. Full liquor license for this applicant. You have a second okay, any discussion once twice three times: okay, call the question: okay, most yes, motion to approve 9504 restaurant court, 9504 37Th, Avenue, Jackson, Heights, New, York, 11372, new full liquor license. The committee approves. If you vote to approve yes and a no is a disapproval and we have okay, Ann Brown, yes, Elva Bundia, yeah Mark from Barmeister, yes, Mr, cloudy or me: yes, cherry! No, yes, sonya roberts, yes, Vivian doc, Yes, Mark, Margaret Docier, yes, Vanetta, English, yes, Mr Gandhi! Recently Gandhi! I do not think he's on the continent right now. He's dropped off. So you do not have to question me: you'll rick, Gideon, Mr, Gideon, yes, Pastor, Peter, Herron, no Abdullah raheem, how loud louder, no evan, kearney yeah a Stephen Cohonic, yes, Martha Lebreton, no Lisa, Yes, Richard, Mullins Richard is Richard there. Okay, laverne nimmins, yes, yeah Richard is there, but his phone is on Mute. So go on Nola! Yes, Phillip pappas! Yes, esteban! No he's not here! Ladies perez. Yes Dorothy Phelan Megan, Rocket Rockwell, yes, Fosso Rodriguez, yes, Linda Romero, yeah Leoncio! Are you there? Leoncio Tammy rose, Edmond Rosenbaum, yes, Richard just came back in again. I guess he got knocked out is David here, no love saying: solaca Lobsang, yes, okay, Frank, Taylor, Yes, Chanel, Thomas Henry; yes, Hamlet Wallace, yes, Toy, Washington, Simon! Yes, okay, we have 24, yes for no did anyone. Did I miss Anyone Richard said yes, Richard? Okay, let me go back: okay, Richard, okay, so that changes our vote to 26. Yes, 24, no, okay. The motion passes. The motion passes yes, next applicant Alex, Pizza, Deli, Corp, 70-, 20:37 of Jackson Heights application for a wine and beer license motion is committee, recommends approval for an on- premises. Wine and beer license for this applicant, provided that a stipulation has been signed. State in the hours of operation will be 7, A.M to 11 P.M, on Monday to Saturday and 7 A.M to 10 P.M on Sunday, and then alcohol service will begin no later than 11 A.M on a daily basis. You have a second any discussion going once twice. Three times call the question. Okay, the motion is to approve for Alex Pizza, Deli, Corp, 70:20, 35Th, Avenue, Jackson, Heights, New, York, 11372, new wine and beer. Yes for approval, no for disapproval, and the first person cam blatter, cam, yes or no cam yeah and brown. Yes and yeah. Elba bondia, yes, Ark, yes, Mr Chowdhury; no courtney, listen Mr; yes, Sonya Davis, Roberts, yes, Vivian doc; yes, Margaret Joe's! Here, yes, Vanetta English, yes, Mr Gandhi he's dropped off, so you do not have to call his name: okay, Mr Gideon, Ulrich, Yes, Bastard, Peter, Haron, no Abdullah, Raheem Holland. Is he here, yeah Abdul raheem? Yes, very good! Thank you! Edwin Kiernan! Yes, Stephen Kohanek, yes, Marta Lebaton, Marta, Lebreton Martin! You there! No, oh, no Lisa, Yes Richard, Mullins Richard! Are you there? He said yes, Richard said yes, Nola, oh daughter, yes, no pronounce your last name! For me: oh Darty, oh darty! Okay! Thank you! Phillip pappas! Yes did you slow perez? Yes is dorothy here, Megan Rockwell, yes, pastor, Rodriguez, yes, Leoncio Romero, Leoncio Romero dropped off so moved on, move on Tammy goes. Can you hear me yeah? Go ahead? Leoncio! Sorry! Yes! Okay! Thank you, Tammy rose Tammy. Are you there? He left edmund rosenbaum, yes, David Rosario, oh David's, not here, love, saying Solanka, yes, Frank Taylor, Yes, Chanel, Thomas Henry, yes, Hamlet Wallace, yes, Toy, Washington, Simon, yes, Edward he's not here; okay, so we have 27. Yes, three three no's the motion passes. Okay, fourth applicant is Michelada House New York, two incorporated 8819 Roosevelt, Avenue, Jackson Heights application for a wine and beer license motion is committee, recommends approval of an application for an on- premises. One and beer license for this applicant, provided that a stipulation has been signed. Stating the hours of operation will be 11, A.M to 3, A.M Monday to Wednesday and Friday to Saturday and 11 A.M to 1 A.M on Thursday and Sunday. Alcohol service will end one hour prior to closing and there will be food service at all times. Have a second. Is there any discussion, call the question. Okay, this is Michelada House New York, two Inc 8819 Roosevelt Avenue Jackson, Heights, New, York, new wine and beer license yes for approval, no for disapproval. Yet, okay, all right, cam, Blatta Kim! Yes, please! Yes, we have to approve that one: okay, Ann Brown; yes, Elba Buendia; yes, Mark Verma, Burmester; yes, Mr, chowdery, no hecal cornelison; yes, Sonia, Roberts, Yes, Vivian doc; yes, Margaret Dozier; yes, Vanetta English; yes, Mr Gandhi! Oh he's not here; Mr Gideon, you'll, rick, Gideon, yes, yeah! I got you pastor, Pastor, Peter, Herron, no, okay, Edward cannon; yes, Stephen Kohanic; yes, Martha Leverton, no Lisa! Yes, you hear me, I got you, I got you! I'm sorry is Richard here, Richard Mullins, you put yes in the chat: okay, laverne nimmins; yes, no Nola, newla! Yes, okay! Ladies Lo Perez! Ladisla. Are you here good? Yes, in the chat? Okay, Dorothy? She dropped off. I'm sorry! I vote. Yes, okay, foster Rodriguez, yes, Leoncio Romero, yes, Tammy rose. She dropped off Edmond Rosenbaum, oh Rob, saying solaca lottery; yes, Frank Taylor, Yes, Chanel, Henry, Robert, Janelle, Henry, Chanel, Thomas Henry; yes, Hamlet Wallace; yes, Toy Washington! Yes, okay, the motion. The motion passes 24, yes for no okay, the last applicant pro siam incorporated Dba Thon, 8422, 37Th, Avenue Jackson Heights application for full liquor motion is committee, recommends approval of an application for an on- premises. Full liquor license for this applicant. Do I have a second? Is there any discussion going once twice three times we call the question. Okay, this is five pro siam. Okay, the motion is to approve pro Syam incorporated: Dba Fan 8422 37Th Avenue, Jackson, Heights, New, York 11372, new full liquor license- and this is this- is five right hit? Five: okay, cam? Yes, what did you say? Jim, listen, Yes, Sonia, Roberts, Davis, yes hold on. Forgive me for one moment: Vivian Doc, yes, Margaret! Does here? Yes, Venetta! English! Yes, excuse me, have you forgotten my name? Oh forgive me Mr chowdery! Yes, I know what is going on. You said no! Yes, no, I did not know voted no okay, yes or no Mr child. No three times. Okay. She just called Jenny. You said no right, he says: okay, oh lord yeah! You have to forgive me because I have okay, Mr Gandhi Mistaken. What happens? Is the spreadsheet is so long and I can't the names are not aligned? Yes for me. Yes, who did I? What am I up to? Oh, you came back yeah, I'm always with you, but he did not call my name three times yeah three times he was missed. Okay, what's up, what's your vote? No, all the! No! I do not. Like recap. That's right! Oh wait! A minute guys! This is very confusing hold on a minute, hey guys. I think we need to take it easy on Laverne. It's her first time. Let you know she's doing a good job. Let him try to do the job. Let's try to be easy. Okay, please! Thank you so much. I appreciate that. What would you like? Do you want me to send you just a list of everybody? Is it getting a little something with the spreadsheet? Well, no, I have the spreadsheet. Let me try something hold on, because what normally happens, wait I'll, just explain when Kevin and Kevin just gave this to De La Verne. Yesterday she uses a spreadsheet and she's trying to type everything in and it automatically connect calculates the number of folks that voted so using the spreadsheet. I guess something is misaligned and we shall move on I'm almost there. Okay, very good, we're up to the last business though, and then we'll move on to land use, yeah, okay, all right. Okay, sorry, Mr! Okay, let's go I'm here! Mr Gandhi is not here. Did you call Elba Blandia's name, because she you want to start from the beginning? He did okay, she did. Okay, sorry! So Mr Gandhi is not here: okay, Mr, Gandhi, okay, get Mr Gideon. You said yes, Mr, Gideon, yes, okay, I say yes, okay, pastor, Peter Herron! No! I do abdullah Ham. How will palada? No okay, I like what you have on Mr Abdulraheem Powder. Thank you Edward. Yes, okay, martial every time no Lisa Yes Richard Mullins in the chat. He said yes, okay, laverne nimmins, yes, okay, Nola, yes, Phillip pappas; yes, sure! Yes, we're almost done peralta! No ladies love Perez, yes, Dorothy is right. Here. Megan is not here Fosco. What do you do? Yes, bacon? Is here I'm here: yeah begging your hero? Yes, okay and yeah said yes, okay, Tammy rose, yes, Frank trailer, yes, Janelle Thomas Henry, yes, Hamlet Wallace, yes, Toy, Washington, Simon, yes, okay! The motion passes 27, yes for no. Thank you all right, Hamlet! Thank you Edmund! Thank you. Thank you all for your patience. Thank you. Thank you. Thank you. Have one more stop one more okay, BSA calendar number 315- 90 Dz, 82-, 06, Astoria boulevard, Queens, New, York, Block 1094 lot, one in a matter of an application regarding 82- 06, Astoria boulevard, Queens, New York, the Blue teal fuel llc, owner of record, is seeking to extend the terms of an existing variant in a R4 zoning district use group 16b for the operations of a gasoline service station with convenience store accessory use on the southeast corner of 82Nd Street Nestoria Boulevard the owner is requesting an application for an extension of the terms of the variance for an additional period of 10 years. Current expiration date is during January 25th 2021, the new Cfo required. Let me clear up this review of this matter recommends the application for the extension term of a variance before additional 10 years be approved. Thank you. Hey call the questions whenever you're ready, Dr Laverne. Okay, do not forget to save the spreadsheet when you're done. Yes, of course, just give me one second, and thanks for coming in and stepping in since Kevin was not able to be here today. Oh no worries I just have to just one second: okay, ready land use motion, BSA cal, 315-, 90-Bz, 8206, Astoria, boulevard, Queens, New, York motionless to approve yes for approval, no for disapproval: cam blatter, I'm ambrose; yes, Alba, Buendia, yes, Mark; yes, Mr chowdery, yes, Mr, Corleyson, Yes, Sonia, Roberts, Yes, Vivian doc; yes, Margaret, Dossier, Yes, Venetta English; yes, ah Mr Gandhi. He dropped off Mr Gideon Mr, Gideon, Yes, Pastor, Pastor, Peter Herron; yes, Mr Howlitter; yes, Edward cannon; yes, Stephen, Kyle Hanik; yes, Marta Lebaton, yes, Lisa; yes, Laverne Richard, Mullen Richard; yes, he put it in the chat. Laverne nimmins, yes, newla; yes, Phillip pappas; yes, Ledisla Perez; yes, Megan Rockwell; yes, Foster Rodriguez, Pastor, Leoncio, Ramirez Romero! I'm sorry! I'm sorry please forgive me: okay, Tammy rose edmund Rosenbaum is edmond still here we have to go to work so he's gone. Okay, lobster and Salaka love song. Yes, Frank Taylor, Danielle, Thomas Henry, yes, Hamlet Wallace, yes, Toy Washington, yes, okay, the motion passes 28, yes, zero, no yay! You did it country smiling at you. Now he got over his nose really appreciate when I reach out the phone. Well done. Well done! Well done! Thank you. Thank you. Thank you all right. Everyone, I'm just going to show you I'm going to go into the chair report. What's in your packet, and I just want to show you some of the things that we've done over the summer. You know if you see it, you should see it on your screen. So welcome back board members. The time went far too quickly. Covid-19 had a major impact on our lives and Covid-19 is still around, but our community suffered losses and changed many aspect, our lives or through it all the community has prevailed. I'm happy to report to everyone that, despite the Covid-19 Epidemic Queen's community board number three. Our office has been fully operational over the summer we distributed over 20,000 masks in East, Elmhurst Jackson Heights in north Corona, and sponsored a very successful community cleanup of the Flushing bay promenade. I would like to personally thank the community board number three members: the U.S Census New, York, City census. The many volunteers over the summer are elected officials for their assistance also through the summer. So these are some pictures here from our various events and hopefully you could see it. I know it's a little small on your report. Let me see if I bring it up a little bit, so we were at elmcore and our borough president joined us at this mask distribution and the email went out to everyone to hopefully come out to volunteer, and this is an east Elmhurst. Also, and one thing that was great. Every time we went out, we always had the Us and they were able to sign up numerous members of the Committee of the community because our numbers were down in East, Elmhurst and North Corona for self- response. It was around under 50 percent, but our numbers have gone up as census representatives have come to the neighborhood. We were in Jackson Heights over here at the NYPD event a few weeks ago, and that was very successful. Many are still suffering in the community with food issues, so the pantry lines are still long. We went to our lady of sorrows north Corona, and then we were at Rego High, I'm sorry. We were also at diversity plaza and a number of people were able to get mass, and these are some pictures from the cleanup that we had last Saturday and it was very successful. We had over 65 volunteers over 70 bags of trash, we painted benches and it was so wonderful. It was various organizations from our council person to elmcore to the regal heights to the National Association of University, women to east summer's Corona, Civic association and our lady of sowers also came out. Also. The dominican american Society also came out right and I do not think I'm missing anyone, Right Miss reader, hopefully not, but it's all written down. Sorry, I did not watch people, yes, that much boulevard. Yeah Good Morning, River, keeper and River keep oh, yes, not even river people, guardians of the bay. Thank you and yeah. I ai not got something absolutely so. These are some of our young people that were there picking up garbage and it's needed because right now the amount of employees that are down there very under 10. I believe so. It was really successful and I thank you all so some things I like to highlight in my report here the fact that a number of you attended the memorial for Claire Shulman, who passed away over the summer. Also there the pictures from all of the various mass giveaways they're here you can find them in your. You can click on the link in the report. We are working on our new website and that's going to come out in a few months and I'm very excited about it and I like to again think publicly Kevin Phillip, Toy, Edmond and Stephen they've worked hard all over the summer, managing our twitter Facebook Instagram and our website. We had numerous meetings over the summer, as you see all today, for the homeless, shelter, the new one that we did not know about, they did come and present within us and they do want to work with the community. A letter was drafted and sent to the DHS commissioner, voicing our concerns about the shelter and the fact that we're requesting for it to be a family shelter instead of an all- male shelter, and there was also another meeting held by councilman Moya, the Queensborough Board borough cabinet we've also attended Miss, Reed and myself. Let me go down some more. If anybody has any questions while I'm going down there. Let me know again I'd like to thank Leoncio and Miss reed. Over the summer, we worked on a variety of issues. Thank you, leoncio you're welcome. We had new member training again, so I'd like to welcome our new members, cam and also mark a number of us there's other issues that are going on in the community that we will be addressing in regards to open streets. We had our. We enjoyed our number of our restaurants, our outdoor restaurants, a lot of issues went around and we took a lot of calls in regards to tropical storm Isaias and another area. That's been very involving and, as you know, as the chair of the board, I sit on the queen's complete Count committee. That's related to the census. I was really concerned because our numbers in East Elmhurst and North Corona, the self- response, were under 50 percent, but our numbers have gone up as the enumerators have been walking the streets of our neighborhood and the numerous community events, and I'm happy to report and you'll see that there's a report from city planning related to the census. That's in your packet that are numbers in north Corona, the self- response, plus those the numerators that are walking the street. So far, our account is 92 of the percent of those in the community that have been enumerated in north Corona, 92.7, east Elmhurst and 94.9 in Jackson Heights. But, based upon a workshop that I went to a couple of days ago, we really need to get up to about 99, so we won't be considered. Undercounted, so please encourage those in the community that have not responded yet to the census. Please respond to the census and there's some information here about voting. Some of us may not feel comfortable going to the polls, so please submit your application to vote by mail again. Everyone please get tested if you have not already for Covid-19, as was mentioned earlier by chanel, and we're going to have a report from the airport committee that will discuss about the updating, upcoming meetings related to the ffa environmental study and reminder everyone. If you have anyone that has any concerns or complaints, they can contact the board at Communityboard3, Nyc.Rr.Com or dial 718- 458- 2700, any questions all right, Miss, Reed, District, manager's report good evening. Everyone. Thank you all for coming out just to let you know that we had this evening, 71 participants, so I'm very happy that we are getting the word out about the our meetings and that the community is getting getting more involved with the board and becoming familiar with all the concerns and issues. So thank you for helping to spread the word and reaching out to your neighbors as well, so we had a very busy summer due to to do to our chair who's done an excellent job. We have had a presence in the community all around the community and we've had some sort of activity in every neighborhood, Jackson, Heights, East, Elmhurst and North Corona again, I think you all can join me in agreeing that Miss English has done a fantastic job. Let us clap together. Thank you, Mr Chef and I'd like to say Miss Reed, thank you for carrying the office as you've done well, and also I'd like to thank Keisha and Clara. Also, let us flip for them too. Thank you. Well thanks. Thank you. Thank you. Okay. So, just briefly I'd like to say that I'm sure you all know that September 30th there will be indoor dining with a maximum capacity of 25 percent, and I believe that for a short period, the outdoor dining will continue until probably about October. As you know, our businesses have suffered severely because of the of the epidemic, but the city is very slowly. Turning around and I'm optimistic that next year, this time we will be back to, I hope to normal when we have the public, the public information session, with the department of homeless services and with Nika the operating operating entity. I was a little bit concerned about the fact that they were not able to confirm whether or not their residents participated in the census, so I will definitely reach out to all of the facilities and out of this district just to ensure that they are have been participating and filled out the forms, because all of these things make a difference. Let me okay go ahead, no because and I'll. Let you finish because what I remember from meetings that I've attended, that they say that folks do go to the facility and get those numbers. So I was surprised by what that representative said from DHS, but go ahead, yeah, okay, so I will double. I will double check that to make sure, because every number counts- let's see in, as you all know, with the start of the full. The board is extremely busy at this time: September through December next month. The board will take up the issue of the capital expense budget. You will have the adopted budget that was approved last year last. We are currently operating in fiscal year 2021. We are about to adopt next month the budget for fiscal year 2022, and we have to submit our capital expense budget by October 31st. So on October 15th we will review the budget review. It holds a public hearing and vote on the matter also at the same time, our district needs that will have to be released by October 31st. So while it sounds like a very simple task, it is very time- consuming and and has to be difficult to put together, but as every year we will make sure that happens. I want to thank the members. I would like to thank the members of my staff for their outstanding work. You may not know it's while we may be at home or not in the office. It makes our work a lot, a lot more difficult, not having access to our files, but we are prevailing. Despite that situation, the meetings will be continued to be virtual and the district cabinet meetings and committee meetings will also be virtual. We will not in the very near future, conduct any beatings in person again. I thank you for your support and, as I always say, Community board 3 is the best board in the city of New York you're. Here any questions any questions. I have a question for you: okay, that Metro car station that was suggested. What did we put in a budget? A metro card station? Yes, all right what I was what I would recommend to anyone who has suggestions, send an email so that I can compile them right. So I can pile compile the list. We can discuss it over at at your capital, expense, budget, meeting and also reverend Hernan. Okay, all right any other questions for Miss Reed. All right. Thank you and I forgot to mention everyone happy labor day that was a couple of days ago, happy hispanic Heritage month, Happy, Rosh, Hashanah, happy good night, happy grandparents day. Oh, yes, happy grandparents they'll, add that to the list happy with nash chartres. I guess I have to get this property was grandparents day national suicide prevention month. Please watch out for those circle. Yes, sorry and it's national preparedness month. I'm surprised Martha did not have something to present to us for that, but we'll move on was not. I was not asked well, even though you're not asked you can always since it's national preparedness month, you can or anyone that's not asked, and you know it's something going on the month. Please let us know and what you have to say. Would it be appreciated? You know that Miss Marta and anyone else that does not know that please so the next. I call for adoption of the June 18:20 minutes go for motion eye motion, any questions additions all in favor Aye, Okay committee reports. Airport, can you hear me? Yes, we can yeah all right. Can you bring up the monitors in the page of that chanel head so to send us yeah? Okay again, I want to welcome everybody back after the summer. I'll start, I just want to give an update where we left off in June at the June meeting at the June meeting. We I kind of reported that the community board three, along with other organizations, has signed on to a letter of support from the guardians of the flesh and bay that was written to all the congressional leaders requesting that the representative to refuse port authority requests to allot any type of federal stimulus money. That's going to go towards the air train at that time. I also said that the Faa would be releasing an eis during the summer and I wish they did, which they released it on August 21st, I kind of signed on late, but I think I did hear Chanel speak about it. So chanel you'll make this a little bit easier for me and thank you for this statement. As she has stated, the eis was released on August 21st and there's a 45-day comment period where the public have an opportunity to go in and make comments and voice concerns again up until October of 5Th. I have distributed to east Emperor Civic, but I will send this one page out again to our community, so they can sort of get more information on this. I did have a concern, though I wanted to if you could bring it up, because what had happened with the dates, and this is actually next week. This is next Tuesday, Wednesday and Thursday, and looking at the workshops and the hearings, three two of the workshops are doing. What I consider- and I know it's my work day because I'm still physically never left my physical place of business working and that's during the work day. Also when the public hearing is during the day, so you have a public hearing one night from seven to nine and the other one is five to seven. So there's none of the workshops that are in the evening, which I would consider, let's say after work and like I said I know before when we're going over to the Marriott we were going over at the end of the day after we had left work. So that was one of my main concerns is having it available for people to actually log on. I'm not sure if you at home, if you're working from home, that you actually take this block out of your time and do it. But that was one of my concerns, but I think again thanks Chanel for providing this, and I will send it out to other members of our community and I do want everybody to sort of go on and voice concerns, because the in your comments must be received by 5 pm, Monday, October 5th, and hopefully, I'm not sure you know they're. Looking for more comments, I'm not sure how many more comments they're looking for to make any more informed decisions on the progress of this ear train. So I just want to thank you but you're going to have to register. You have to register for these workshops in here. So go on and register. You know, and the link is in the document here. Everyone thank you. Edmund already gave his report about for the community event that business echo would like to have. They would like to canvas the businesses in the area and get their information to so that the community board can begin sending them information in regards to information from small business services from the chamber, information related to grants and any information that we get in at the board that we think is important to send to our business owners in our area. Any other questions so we'll go to our legislature's report, Lisa Atkins Lisa. I think she left okay, one more James. Oh president, we can hear you Mr what Gideon James are you on or you left, okay yeah come on? Okay, so you have a minute: okay, yeah hi! This is James Margio from the office of the New York City comptroller. I have a few updates for you. One is I'd like to tell you that we, our office, has successfully gotten two million dollars back to people that were not properly compensated on jobs. They did for work that was contracted out by the city. Our Labor Law bureau was able to get people this money and you can still search your name or your friend's name to see. If anyone you know was owed money for working on city projects, a lot of people were not paid the correct wages by the contractors. Essentially, the contractors are stealing people's money, so our Labor Law bureau has really been working hard to get the money back. I think I mentioned this, maybe two or three meetings ago. So please continue to look a lot of people who are owed. Money live in Corona, Elmhurst, east Elmhurst, Jackson, Ice and Woodside, so the general area around where we live and a lot of it is actually CB3 area. So please check that out. We also just put out a back to school guy. Actually, I'm one of the people that helped to create it. I sent it to some of the people on the board already I'll put it into the chat as well, so you can check it out. It's a back to school guy to help people figure out what to do now that school's. Starting again, it has some information for schools that are not public schools, including catholic schools, from the Archdiocese of New York, as well as the diocese of Brooklyn. So it has a lot of general information that are not it's not just DOE information, other supplemental information that parents might be interested in so please check it out and send it to other parents who might be interested, especially if you're involved in in a school- and we also our office also just put out a recently put out a letter to the department of sanitation asking for them to figure out how to better make sure our city is clean, especially the big commercial corridors where garbage is overflowing. I've noticed a lot of garbage overflowing in our neighborhood. You know, as many of you know, I also live in CB3, so you know I've seen a lot more trash in certain locations, so we asked the sanitation department to figure out a strategy of how to better clean up the area. Given that you know there are budget touch which we do you know realize, but you know, Controller Stringer wants to make sure that garbage is still being picked up so I'll stop there. I do not want to talk too much more, but please check the chat. I'll put some of the links in there, so you can see the all right, everybody well good night. Thank you, James sequoia, good evening, everyone. My name is Sequoyah and I'm coming from Councilmember Francisco Moya's office. So our in the over the past few Months Council member has been giving away thousands of mass the next mass giveaway will be Saturday, the 19th at eternal love church, and we will also be having one the following: Saturday at septee advantage. We have the census at all of our events assistant and spreading the word so stay tuned on Facebook for any updates. I'm also going to post a flyer in the chat our office organized several community cleanup with Sanitation Department Parks Department in Eighth. We were joined by so many great volunteers who take pride in this community. Most recently at american trinity, Triangle Corona plaza back in August. We did the promenade and then we did the promenade on Saturday along with CB3, and we will have one coming up very soon and if you would like to volunteer, please contact the office through the cleanup initiative. The member allocated 160 thousand dollars in funding for DSNY and AIDS program for additional services in the district. If you see any illegal dumping and problematic areas of garbage feel free to reach out to our office or say also, additionally, parks enforcement officers has been added due to the concerns we've seen in the park. The council member funded local restaurants in partnership with Hispanic Federation, to prepare and distribute thousands of meals to Families City Council allocated 25 million in emergency funding for pantries and emergency food provided citywide, so our local food pantries remain well funded, well stocked and ready to serve the people in our community. An extension of the council member legislation on cap in the fees charging third party food delivery service that prohibit on permission diamond was passed and will be extended to the end of the Covid-19th pandemic, and I'm also happy to share that the city and State Magazine public published its first queen's heroes list and our very own councilmember Moya was selected as Queen's hero due to his great work he has done during this pandemic. I will also put that link in the chat, for you guys read it. He calls for the emergency fund to help provide low- income undocumented immigrants, with this Bungie burials the mayor needed that helped in May agreeing to expand the city, existing burial, existing programs to undocumented immigrants and increasing eligibility to all low- income new yorkers, regardless of immigration status. Okay, so again, please feel free to reach out to our office with constituent and community concerns, as we continue to work remotely Monday through Friday from 9 am to 5 pm and you all have a wonderful night. Thank you. Thank you. Tokoya George good evening, everybody just a couple: quick announcements: we're going to be doing more book giveaways this saturday from 12 P.M to 2 P.M at the shopping center, also Saturday, the 26th of the Jackson Heights, stopping shopping, Center, 77Th, Street and 31St Avenue, and we'll also be giving out some books tomorrow morning at the Woodside street station, from 7:30 to 10., so that'll be fun and I'm sure you guys are waiting we're actually going to be having our paper shredding Saturday, October 10th from 10 A.M to 2 P.M at the Jackson Shopping Center on 77Th Street and 34 7.. Thank you and that's all. I've got oh we're all. Of course we're also open 9 am to 5 pm. You need help, feel free to call us or email or facebook message or dm or whatever. Thank you so much, and I hope you all have a great evening. Thank you and Jessica hey. How are you everyone, so the mayor's been working on advocating for the federal government to provide a stimulus and for the state to provide long- term borrowing authority we're working with labor union leaders to prevent the layoffs of 22,000 city workers. The mayor announced this week that all mayor's office employees will be taking a furlough week to address the ongoing budget crisis announced today that there is a testing lab now, based in Manhattan, launched by New York City EDC. That will be called the pandemic response lab. This facility is dedicated to processing Covid-19 test within 24 to 48 hours for New, York, City H, it's up and running, and it's going to be scaled to up in capacity to process approximately 20,000 tests per day by November. Not only have we been encouraging folks to get Covid-19 tests and you can find ongoing sites as they open at Nyc.Gov Covatest, but we are now also encouraging new yorkers to get their flu shot. You can find your nearest flu shot site at Nyc.Gov, Flu or just calling 311.. In addition to that, we've been working to support a lot of small businesses with our open restaurants program. We now have more than 10,000 restaurants participating in the program and that saved approximately 90,000 jobs, acrosss the five boroughs. As Miss Reed said we will have indoor dining starting September 30th at 25% capacity. If all goes well, we expect that capacity to open to 50 by November, first and throughout the opening of indoor dining. If the city hits two percent and Covid-19 positivity rates will reassess the opening of indoor dining we have schools. Opening on September, 21st and announced today is that the opening of blended learning and in school learning will be staggered with 3-K and pre- k and district 75 students, starting on the 21st, K-5 and K-8 schools on the 29th and then on. October 1st will be middle schools, high schools and secondary schools, we'll be adding about 4,500 additional staff to address staffing needs with the blended learning model and, lastly, in addressing some of the concerns that have been expressed, citywide about the sanitation situation, the city's reallocating, a portion of the sanitation budget to support the restoration of approximately 65 liter basket trucks weekly. That's a 24 increase from the current levels. Nycedc is restarting clean, NYC with the DOE fund to provide supplemental cleaning services and we're partnering with community- based organizations to sponsor community cleanups in streets and parks. If anybody has any questions, I'm happy to answer them and Jessica I'd like to thank you again for furnishing us and being the conduit for the mass that we were able to distribute in the community thanks again, of course, any questions everyone, any other person did I miss anyone that needed to say a few words. Yes, hello. Can you hear me? Yes, I can and maribel who? What? Where are you from? I am the district director for Congresswoman Ocasio-, Cortez, okay, wonderful hi, everybody! So just wanted to give you a quick update as to what we have been up to in the last three months, so we have been very focused on virtual town halls. The congresswoman has done a town hall police brutality on the census on Covid-19 relief. Just today she did a town hall with telemundo to try to reach out to the hardest rich communities. She also has hosted an information session for the service academy applicants. On the legislative front. We have been busy with appropriations, so in July appropriations was the focus, and during that time we were able to pass a few of our amendments, including a ban on the purchase of chemical weapons, as well as protecting public housing and eliminating opportunity zones. And then, after that, we were able to introduce with Senator Kamala Harris, the Climate Equity Act, and what that does is ensures that we center communities on the front lines of the climate crisis in policy related climate and the environment. We also have, along with representative Velazquez Congresswoman Ocasio- cortez, introduced the Puerto Rico self- determination act and what that does is to create a status convention whose delegates would be elected by puerto rican voters and that would develop a long- term solution for Puerto Rico's territorial arrangement and, of course, in August. The focus was on Usps and the postmaster de joy. There was the house passed, the non-, partisan, postmaster, General Act and the congresswoman participated in the oversight hearing with postmaster Dejoy, and at that hearing she pushed Postmaster De Joyce to release a detailed calendar to the committee, and she also urged him to respond to the community's request for a disability ramp at the Jackson Heights Post Office. Now, turning to the census, it's been spoken about how important it is. Then one thing to clarify is that enumeration is not the same thing as counting and that's key, because when we see that 90 something percent is enumerated, that does not mean that it's been counting. Enumeration takes a lot of basically, I would say, informed guessing from the census, but it's not the same, and so we can't we run the risk and that's how we have seen many hard- to- reach communities being under- counted, so we really need to continue to push for people to get counted. Enumeration is not enough, and because of that, the congresswoman is really pushing and pressing for the deadline to be moved back to October 31st, because the movement of the deadline, one month before, is really risking, not counting a lot of people. Finally, we should we want to make sure that you know is that we have really focused on making sure that we're honoring those members of our community that we have lost to Covid-19, and we also want to celebrate all those people in our community that have gone above and beyond, to support our community. So I will put in the chat two forms that we have if you Wanna nominate somebody who you believe has gone above and beyond and is part of our community, please let us know, and similarly, if you know of a loved one in our committee who has been lost to this virus, we would like to know, and then the final thing is we are working remotely, but we're completely available completely working on casework and anything that is needed. You can reach out to us via our website, which I will put on the chat and also via our phone number. Thank you and maribel. My question is what types of events are: is the congresswoman sponsoring that are in the community and to get folks to fill out the census on the ground face to face? Yes, so on the congressional side, we are being very careful in terms of not being you know, not congregating a lot of people, because, as it is right now, we're still seeing high numbers in certain areas, especially in our community, so we have been focusing on reaching people virtually but also like I said today, the Telemundo Town Hall was completely in Spanish. It was completely in the local telemundo station, so we're trying to find different ways to reach the community without putting anybody at risk. Okay, thank you. Thank you know who I am hello, I'm not about this. It's lobster. How are you doing? Well? How are you laughing I'm good, I'm good. I do not know if you receive an email, I send an email about recognizing somebody, so I just want to make sure you receive the email. If nothing, I can send you again. Yes, I received your email and, like I mentioned, I will put in the the link to the to that. We have how people can nominate different either organizations or individuals who want to make sure that we have the same process for everybody. So if you can just go to that link and nominate whoever you think has gone above and beyond in our community, that would be great. Oh there's a link to fill out. Okay, yes, all righty, then I think that's it. So I call for would you have something to say: James yeah, I wanted to say one more thing. I forgot to mention before just something that we got a lot of phone calls from Community Ward 3. relating to property damage from the big storm that we had with like trees, falling and some other city- owned structures like light bulbs. I just want to let everyone know that, and please tell us to other people too you're able to file a claim through the comptroller's office, to ask for compensation for damage incurred to your property, whether it be a motor vehicle parked on your property or on the street or a fence or your house like, for example, I know in our neighborhood we had trained big trees, pulled down on the 94th street near like 25 and so on, 23rd out. So if there's any damage like that occurred to your property, you can file a claim. It does not mean that you'll be compensated at all, because there are certain things we check for at the controller's office. So I'm going to put some information about how you can file to do it digitally or by mail I'll put it into the chat. So please, if you have neighbors that were in these situations, please let them know that they can file and, of course, if the tree was damaged prior to the storm or if you put 311, pulls in or tried to tell the city hey, this thing is structurally deficient: it's a danger to me. Those are the cases where you're more likely to get compensated. You know. But again I can't I'm not a lawyer. I can't tell you whether or not you'll get something or not, but if you wish to try to get conversations, please look at the links that I'll put into the chat right now. Yeah or you can also contact me James. Can you also let our listeners know how many days in which they need to submit their claim? Yes, sorry, I should have mentioned that from the beginning, so you have 90 days from the date of the incident to file. Your claims must be done within 90 calendars day from the date in which the incident actually starts so time's running out. Basically, you know if something happened during that big storm we had you know days are passing by. You only have a limited amount of time to file, or else past 90 days you no longer can file against the city all right. Thank you, like anyone else all right, I call for a motion to end our September 2020 monthly meeting at 10:32 P.M, second, a second all in favor all right. So I look forward to seeing everyone in committee meetings. I look forward to seeing you out in the community. Please be careful out there and take care of yourself and all of you, parents that are working with your young people all the best. That's not an easy time right here, good night, good night, everybody good night, everybody good night, everyone! Good night! Oh I'm! Sorry did you want to say something. I just heard your voice Ben! Oh, no, all right, maybe it was her voice, take care good night.",
            "summary": "Where it says, DOH is DHS department of homeless services, so you can just make that change under 115Th Precinct is DHS and Nika Ebus aloft, hotels, And I put an updated agenda in your folder.\nIt's DHS, not DOH, caller number one All right is the NYPD on Hi Keisha I'd like to welcome everyone to the queen's community board number three September meeting.\nAs I mentioned earlier, under after 115 precinct, we'll have a presentation from the department of Homeless Services Anaika ibis aloft, hotels, all right, so it was not DOH.\nSo you'll type, your questions in the chat area, all right, so I'd like to our first speaker for public information, Is Reverend, Manuel, De, Josus Rodriguez from our lady of sorrows.\nHe wanted to introduce himself to the community and if he comes on a little later before the end of public participation, we'll bring him back on again, but I do not see him here.\nWe hear your complaints and we've been focusing a lot on enforcement, along with the bars speaking with the bars and the restaurant owners, to try to get compliance with the music, but also moving cars along that are coming to the area that are not necessarily residents that are bringing large crowds in front of these locations and music's their own speakers and they're, taking over parking lots at this point, I'll open up for some questions.\nSo captain along 94th and 95th street We've had a persistent problem with ongoing drug dealing and the associated violence and we're wanting what we as a community can do to help you curb this violence, especially since.\nThat's, due to the increase in 911 calls not necessarily complaints at this time, but when we get the 911 calls from the community And You know we'll take any information we can because we're using it for an ongoing investigation into that area.\nThey did that in an effort to create more available manpower on the weekends and that's hopefully going to help keep the police officers assigned to the 115 precinct here in the 115 precinct for the majority, you know as often as possible as far as how often it happens.\nInitially, when we did have the you know the protests going on a few months ago, when things were at times pretty violent, I myself was sent down to Soho during the looting with a bunch of my officers from here.\nDavid I have members of the community telling me that you know just like you brought up.\nThank you, and if you want to type your information in the chat, you can captain put my email in there too I just I was going to get piggyback on what Frank was saying, because I kind of experienced over the fourth of July, with the fireworks, and I, found it interesting.\nSomebody will come out with getting complaints, but I also call 3, 1- 1, and my question is, if I'm putting in a complaint, Because it says the police has responded, so those three minutes and a lot of them were under 10 minutes in from the time the person reported and it being closed, out.\nAs far as your community, though, and up there in that sector, we're going to con, You know you have two shootings there this year here , That location, is, I would say, for the precinct violence- wise, it's second to nine five street, or it's in nine five in that location, That's a lot, especially you know, since their families that live there, elderly that live in the building and those residents do not even live in the room.\nThank you for having me I'll work on every one of these issues at this time and the captain has posted his email address in the chat.\nThe staff patterns look like security and then obviously we'll take questions from the community, but I do want to give Nika the opportunity to introduce themselves Then I will have someone from Nike just sort of explain a little bit about nika as an age as a non- profit altogether in the work that they do.\nWe, work with rent carriers we reach out to the community and provide services and repairing their apartments, and so forth.\nThat includes the community board, the elected official, the precinct any businesses or any faith- Based organizations that gives them an opportunity to address any issues and concerns that may affect the community and as well, learn more about our services and provide updates on residents that are moving out and living back, independently, so and jump in really quickly.\nYou know, share individuals that they think are appropriate for the site, but we will, you know, work with you all and identify folks that can be on the cab And, we'll look to have one in October.\nAnd I did want to give you know a sort of presentation or share the operation that the shelter you know what's going on at the site, We were using the Marriott Hotel, for I believe it was three years prior that we had three years prior to this, this site.\nThe population is general population, meaning these individuals either are employed or looking for employment, or you know, seeking some sort of permanent housing.\nA lot of our clients are out of work, but I still think that's a great percentage given during given what you know the country is going through the during the global pandemic, so 40 percent of the clients are employed.\nSo I do want to talk a little bit about what a day to day looks like at the site when an individual first arrives at the site, they're meeting with the operations staff to conduct a new residence orientation and go through the good neighbor policy after they complete the initial intake.\nWe're happy to share what the Good neighbor policy is, but essentially it's asking the clients to you: know, be good citizens and not do things in the community that they would not want doing done in their own communities to treat this community like it's their own.\nThe staff Nica is reiterating this information to the clients that they need to abide by the good neighbor policy that all of that stuff happens within 24 hours of the individual, getting referred to the site after that they are meeting with their caseworker for goals and setting me they're meeting with their caseworkers and setting goals right, whether this individual might need to enroll in public assistance.\nSo these individuals, the men residing at the site, will work with again the employment special to either obtain housing.\nIf individuals, you know, are not able to receive a service on site.\nI do want to give the opportunity for ricardo, because this is the work that he really did on the ground to go out into the community and make these linkages and make these connections so we're able to refer our clients to them.\nWe always do a canvas of the community to take the opportunity to utilize the community- based organizations that surrounds the site that provides an array of services such as substance, abuse, alcohol, abuse, mental health, even a general health care provider that can provide simple tests like Ppd or any other test.\nSo if any other community board members may know of any other programs, that could be beneficial for our residents.\nWe are open to ideas and suggestions and no one knows their community better than you, guys.\nSo I do want to get to those, but I do want to talk a little bit in addition to the other work that Nika is doing on site with these clients.\nIn addition to you, know, meeting with their caseworkers and their housing specialists and employment, specialists, Nike is providing workshops and stuff for the clients to participate on site.\nThose are the things that we're talking about right and then, in addition to that, they're having housing meetings, every third Wednesday of the month, so in those housing, meetings, they're going over this information, whether it be the good neighbor policy or speaking with clients about workshops and other things that they have to offer them and speaking with the clients.\nYou know progress into the community and if they need any extra needs or anything like that, we're able to provide that to them.\nI do not know if you participated in that in that meeting, but I will say that if we, if you guys, are seeing individuals in the community that you know are due engaging in those sort of activities that you're describing, we would encourage you to reach out to us either via you know the 24 hour line or an email or even myself, you can always contact.\nIf that individual is a resident of ours, and if they are, we will figure out either will case conference them or figure out a site that might be better for them, but we will certainly share a contact information for everyone on this call to have if there are concerns about what they believe to be our clients.\nWe, will, like, I said, start a community advisory board meeting for this site, but I think you know hearing from residents in real time.\nI do want Nika to talk a little bit about you, know, sort of the patrol or security.\nYou know we are looking to open, Shelters and we've been opening shelters, all acrosss, New York City in every kind of neighborhood you could imagine, except for those places all right.\nIt's something about community boards that do not have sites and, As I've been as I've said, before, we're looking to open shelters in those communities.\nAnd, we're looking to open, again, 90 and close out commercial hotels, but Those 90 sites we're looking to cite all acrosss the city, not just in your neighborhoods, all throughout New York, City.\nWe've operated homeless, shelters in residential neighborhoods in communities that have no transportation similar to yours, right where the transportation is just buses and stuff like that.\nNika is the social service provider on site providing services, so the majority of the clients are able to seek their services that they need on site, but we're also trying to create an environment where these individuals are going out into the community and seeking other services that they need, because that when they leave the shelter system, they're not going to have services, they're going to have to go out and find those services.\nSo the services, then the linkages and the referrals that Ricardo found you know might not be right next to the shelter, but they very are close to the site that we're operating and again.\nYou know, I mean we want to work with the community.\nWe can share what we're doing on site, whether it's moving folks into permanent housing, the services that we're providing.\nKnow, individuals coming to the shelter system are very reluctant to come in if they are not able to be in sheltered in their neighborhoods, which is why we started this borough- based plan.\nOkay, quick follow- up what here in the neighborhood can we do to welcome our new neighbor Think there are many things that we can do to like work with you guys and create a better partnership, and you know things you guys can do to welcome these individuals, whether it's care packages, I'm, happy to speak directly with you after this call or offline about what that could sort of look like in brainstorm.\nObviously you know these individuals will be in this community, for you know some time And we want to make it work for you, guys, How long do you intend to use the ibis or ibis as a shelter like what?\nSo if they've completed their time and they do not have a place to live and the state was not able to set them up with some sort of housing, you know they would come into the shelter system.\nSo I just want to be really transparent about it, Well, if someone is- and if someone, if, as a comes into the community on in your shelter who is who is a convicted sex offender and they have to register as a sex offender.\nSo it would be like any neighbor in your community that comes into your neighborhood.\nThey just are not able to make ends meet because living in the city of New York, as you all know, is very expensive and finding actual affordable housing is almost impossible, but so what we will do and our providers will do- is they'll work with each individual to secure a voucher.\nSo, most individuals who exit the shelter system will exit with a voucher, meaning the city will pay a portion of their rent and they will be responsible for covering the rest of their rent in order for them to qualify that for that they have to have an open public assistance case They have to be continuously working with their case workers to prove that they are eligible for it.\nYou know like a work.\nThere you'll see the many services that we provide and also all of our sites and there's a phone number there and also an email address any issues and concern in addition to what I posted here, you also can reach out to the email and the phone number that is on the website.\nThank you so much department of homeless services, and we have your contact information, And I, know folks will definitely contact you.\nYou know that area around it's located at around 95th street and 37Th Avenue.\nThey like, so they we signed already with a community border with stipulations hours, operation, Monday to Wednesday, to 11, A.M, to 3, A.M, Friday and Saturday from 11:2 A.M to 3, A.M and Thursday, and Sunday 11 A.M to 1 Am. Alcohol will end one hour prior to closing and kitchen will be open for food.\nOkay, the motion to approve Valdez House, Bar restaurant court, 9109 31st, Avenue, East, Elmhurst, New, York, 11369, new wine and a beer license.\nOkay, so that motion passes second applicant 9504 restaurant Corp, Dba, Rico, 9504, 37th, Avenue, Jackson Heights application for a full liquor license committee recommends approval of an application for an on- premises.\nYou have a second okay, Most yes, motion to approve 9504 restaurant court, 9504 37Th, Avenue, Jackson, Heights, New, York, 11372, new, full liquor, license.\nI would like to personally thank the community board number three members, the U.S Census New, York, City census.\nEvery time we went out, we always had the Us and they were able to sign up numerous members of the Committee of the community because our numbers were down in East, Elmhurst and North Corona for self- response.\nAs you see all today, for the homeless, shelter, the new one that we did not know about, they did come and present within us They do want to work with the community.\nWe, had new member training again, so Other issues that are going on in the community that we will be addressing in regards to open streets.\nI was really concerned because our numbers in East Elmhurst and North Corona, the self- response, were under 50 percent, but our numbers have gone up as the enumerators have been walking the streets of our neighborhood and the numerous community.\nThank, you all for coming out just to let you know that we had this evening, 71 participants, so I'm very happy that we are getting the word out about the our meetings and that the community is getting getting more involved with the board and becoming familiar with all the concerns and issues.\nAnd, as I always say, Community board 3 is the best board in the city of New. I have a question for you: okay, that Metro car station that was suggested.\nThe eis was released on August 21st and there's a 45-day comment period where the public have an opportunity to go in and make comments and voice concerns again up until October of 5Th. I have distributed to east Emperor Civic, but I will send this one page out again to our community, so they can sort of get more information on this.\nOur Labor Law bureau was able to get people this money Anyone you know was owed money for working on city projects.\nOkay, so again, please feel free to reach out to our office with constituent and community concerns, as we continue to work remotely Monday through Friday from 9 am to 5 pm Tokoya George, good evening, everybody, just a couple , quick announcements: We're going to be doing more book giveaways this saturday from 12 P.M to 2 P.M at the shopping center, also Saturday, the 26th of the Jackson Heights, stopping shopping, Center, 77Th, Street and 31St Avenue, and we'll also be giving out some books tomorrow morning at the Woodside street station, from 7:30 to 10., so that'll be fun.\nYou can find your nearest flu shot site at Nyc. In addition to that, we've been working to support a lot of small businesses with our open restaurants, program.\nSo on the congressional side, we are being very careful in terms of not being you know, not congregating, a lot of people, because, as it is right, now, we're still seeing high numbers in certain areas, especially in our community.\nI just want to let everyone know that, and please tell us to other people too you're able to file a claim through the comptroller's office, to ask for compensation for damage incurred to your property, whether it be a motor vehicle parked on your property or on the street or a fence, or your house like, for example, I, know in our neighborhood."
        }
    }
}