{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCFaHgF5NoFGxOKQH0dPiGiQ",
            "title": "Health \\u0026 Environment November 2020 Virtual Meeting.",
            "publishDate": "2020-11-06",
            "shortDescription": "",
            "lengthSeconds": "3:07:09"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "n96Xzbg7Fls",
            "fillerWordCount": {
                "uh": 500,
                "um": 473
            },
            "readTimeFullTranscript": "110 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "services": 48,
                "health": 41,
                "information": 39,
                "fireworks": 36,
                "space": 31,
                "percent": 30,
                "numbers": 25,
                "data": 25,
                "center": 25,
                "week": 21
            },
            "wordCountSummary": {
                "services": 14,
                "health": 11,
                "information": 5,
                "data": 5,
                "test": 4,
                "location": 4,
                "day": 4,
                "testing": 4,
                "prevention": 4,
                "access": 4
            },
            "fullTranscript": "And with the restaurants and this open street stuff, open restaurant well, the rest of where's, open restaurants, and then there's opens there's the open streets right and then there's like the open streets with open restaurants. Like Dyckman, I mean it's not just about dyckman. It's everybody came to y' all's meeting. That's right! We've had a lot. We all every meeting we have businesses come yeah she's, you know, she's the only one with open street no open streets. Okay, there's a couple of things: there's open restaurants, that's the only thing the restaurants have anything to do with restaurants, when it's the restaurants are open. Restaurants right, it's not it's not they do not have. Restaurants do not have anything to do with the other thing, which is allowing retailers to have street fronts. Now that has nothing to do with the restaurants. Those are two separate things, so my question was did because there's I mentioned in Tnt. Both of those are DOT programs. Was there going to be any discussion about making this permanent? Because restaurants already is he's done it by Fiat, but I think the community board should weigh in on it and it hits a lot of committees. It hits this one. It hits business Department right, but it's already a law he's already made it permanent, so only thing we'd be doing, would just be making a statement, and that's really up to the chair. I'm not the chair of business development, so you know think about which committees it would hit the most. I do not know I mean I mean it to me. It's a public health issue because they put up these like little pog plastic pods around table. They were like little coco because you could never sterilize them between parties. Well. The thing about that is. That is not something that I I'm just seeing a lot of pictures that seem really weird right house standpoint and that's actually enforced by DOH, not D.O.T, right, EOH enforces, and special enforcement right. No DOH enforces restaurants, Department of Health they're, the ones that do the inspections they're, the ones that need to they're, going to make sure that the restaurants are following the rules. As far as Covid-19 and distancing and that sort of thing- that's all- that's D.O.H hi, it's pauline from DOH, it's actually a combination of our agencies, so the mayor under the office of special enforcement has pulled together inspectors from all agencies, so any agency that has an inspector force has been tasked with enforcing Covid-19 social distancing regulations across cover- oh okay, yeah, but when it comes to actual restaurant food safety inspections, yes, that continues to be department of health inspectors. Who do that? Sorry? I should probably hold the question until Steve is on the phone when you're doing your presentation as much as I want to ask you questions. The agencies are DOHMH mayor's office. The coordination is coming out of what mayor's office is special yeah. So the mayor's office of special enforcement is coordinating all of the other agencies inspectors and they can include folks from obviously DOHMH DEP DOT, DOB, FDNY NYPD, so any city agency that has inspectors who are now trained to do this type of work can be deployed for any social distancing component you're DOHMH right, correct, yes, okay, so I heard a rumor which I'll say before the meeting is recorded. The rumor is that y' all are actually doing all the work for hh, health and hospitals. That's not a high! I mean it's, that's not 100! True, I think there's nice! No! I do not. I actually do not know the breakdown, but I do know that ally, you're stirring the pot sally. We have not even got going yet and she's already. Oh my god, like I got a headache, already got some ibuprofen. Oh my god. I got something better. I got chocolate. I got chocolate, everything is backwards. Love is the way it's at the cathedral. They make two shirts that I love this one and the one that says. Oh, my god, I wore it to a church across the street. From me, I'm episcopalian, but it was the catholic Church good shepherd and boy did. I get some flack people telling me it's sacrilegious and I thought it can't be sacrilegious. It came from the shop at the Cathedral, St John, the Divine. I love theirs. I love their swag. I guess it's not swag, since it's not free pauline did we get a child sighting today you might he's stuffing all of his cars into my pocket at the moment. No idea what's happening rocky. Do you want to say hi yeah hi, hey hi, he's going to be out before you are and there's our Steve right on time. Yay. This is great. What's our Quorum Steve I forgot, you're muted is Steve there. I thought he stepped away for a minute. Yeah he's there he's just muted. Oh okay, now he's not there. He is. Can you see me yeah? Now we can yes. Now we can all right, I'm within the frame. Yes you're far away, though, why are you so far away? You do not like us, y', all, I'm afraid, I'm afraid you're going to hit me. Oh, no, all right did you see the reso I sent a few minutes ago? No, but I can look for it. Okay, yep got it: okay, where's my this is not my list. What the hell is. This okay is Betty here, Tanya's here Daryl's here, Catherine nation Sally Barbara. What is this is here? I see her name and I'm here. Nate nature is here: yep she's, here, yep, he's, muted, he's, muted you'll, marry Smith, he's no longer a public member for your committee. She resigned actually she's, not a public member for any committee, no longer, oh, okay, all right so well. So that means we have 10 members. We need six to make a quorum and we now have six yay all right to Tanya, Daryl, Nasha, Sally and Jay. What was that cool? Oh cool? Okay, paola did you? Did you get the resolution that I emailed just before seven yeah? I thought I saw you send it to everyone she's under attendees. She needs to be promoted, oh yeah. She should be promoted and given a raise yeah, you just got promoted Yay Betty. You deserve a raise too so daryl. Okay, all right so we're up to seven. All right is Mark Levine on the call not yet does not look. So no so steve. You have a view. I do not know if you're logging, in through your phone or through a computer, but you have a view where you click on participants and you can tell who's on your stack. So you can tell who's on the call forward right now: Cheryl Miller, Justia, Monty's, Maria, Garcia and that's all so far. It just started Steve and they're used to not starting necessarily in time, there's other entertainment going on tonight like what oh you mean constantly looking at numbers. Oh god, I can't. Oh my gosh. I heard there was a lot. We counted. Another 10,000 stack. Okay, great! You know like seriously. Oh that's my mom yeah. She would that's! She had that painted for her parents, my grandparents, when she was 18.. I love that picture and it was apparently under the stairs of my grandmother's house for 30 years and we found it when we were cleaning out our stuff, oh by the way, I'm wearing double glasses in case. Anyone needs that because when I try the magnifying glass it makes my face make one of those like balloon things, the gross things my son used to do on like apple, and I can't stand that so apologies, but my eyes are getting worse and I have not gone and gotten them all right. I'm going to call it! I'm calling hello yeah calling the meeting to order it to 705.. We have a long agenda that we have to get through we're going to be joined. I guess at some point by Mark Levine tell us about a lawsuit that he's joined as a plaintiff, suing the federal government over its response to the cobra 19 crisis. So when he joins the call like it will we'll and we'll let him we'll let him start speaking. I guess pauline you want to begin sure, hi good evening, everyone. So thanks for having me back, as you know, cases across the city are, we are seeing increases in certain neighborhoods. I looked at your data on our website and it looks like one zero three and one zero. Four zero over two, of course, have a slight decrease in cases and one zero three two and one zero. Three four have a slight increase, so I mean, I think the whole issue is ebbs and flows right, but the point is we are encouraging everyone to go, get tested to maintain. You know the core four again. We really want that messaging to be out there. So if you need anything from our ends, posters palm cards, things like that to share with the community, please let me know if there are any organizations on the ground level that work with. You know disenfranchised populations, immigrant populations who maybe do not really trust the government. You know elderly folks who do not have access to the internet any of these folks who really need to get this information and still have not, please let me know, because we would love to be able to find some way to share this information with everyone again. Thank you so much for a member of your board, who continuously sends me some problem locations. I forwarded all of those over to the mayor's office of special enforcement and the Community affairs unit so that they can send out inspectors to inspect any type of social distancing violations. So again, just to be clear when it is a social distancing violation. The mayor's office has a task force under their office of special enforcement to go and send folks to those locations currently they're at a capacity working at you know those specific locations in Queens and Brooklyn, but they do send folks out to you, know, spot check locations that have continuously popped up as being problem location. So please I encourage you to continue sending those to me continue calling 311 just letting us know what more we can do to get this messaging across the folks, because we do know it seems as though there might be a pandemic fatigue where people are a little bit tired of doing all of these things. So you know maintaining social distancing staying home if they're sick wearing face coverings in public and also indoors. If you are up in a location that is not your home and you are with people who are not your immediate relatives or who live in the same household as you must wear face covering. So all of this information is on our website. We continuously update our website with information. We are coming out with guidance for the holiday season, so please look for that. I will definitely send it over to the board as soon as it's up it'll be translated into multiple languages and, of course, we're more than happy to come and speak to groups as we want to pull together. You know a group of people before the holiday season. Just let me know- and I'm happy to speak with folks on that, but I want to turn it over to Laureen from h, test and trace, because she has a lot of really exciting things that they're doing on the ground level. I know our action center has been passing out, face coverings and working with local cbo's and things like that. To get you know, resources out into the community, but I think Laureen has some really exciting news to share. As well so I'll just pass the floor over to her and before we move on to, is it Lorraine? Let me ask you something I was, I guess, tagged on facebook by somebody who's concerned about these outdoor restaurants that have they've set up like tents, see- through tents around the table. So everybody is within the tent sitting around a table and they're, not necessarily family members, but the concern is that it's a closed space where aerosols could more likely be transmitted. Is that a is that a source of concern they might be gone? All of these structures should be approved by the DOT if it's for outdoor dining prior to setup or after you know after they set it up, they need approval before they can allow patrons to utilize that space. And so, if you see a location of particular concern, I would recommend you know checking in with the DOT to see if they have the proper permits in place, but I think, as long as it's open on one side like there's a large opening, I believe that that's within the state's guidelines and regulations- and so that's okay, if there's like one tiny doorway and a completely enclosed day so like in a sidewalk, enclosed sidewalk, cafe, that would not be something that would be allowable on the street and also if the tables are far apart. Far enough apart of six feet apart, I think that would be within regulation as well. So I think a lot you know they're. They have to get approval before they're operational. So but again, if there is one particular a couple of particular locations of concern, definitely you know reach out to DOT to see if they have the proper permitting in place for their restaurant yeah. It look. It looked as though it was just like a a flap as an opening. It did not look as though there was a very long. It did not look as though there was a any cross, any ventilation. Sure I think Steve can I talk. Can I go ahead? Okay, I think. Actually, when I was driving back into town on Monday, I saw some people standing with someone outside at those pods. As we made the turn, and I think the pods are gone, I mean those bubbles are gone, but they are still they're building out onto the sidewalk, with tents that are basically turning outdoor space into indoor space and I'm not sure how that's being regulated it did come up. I brought it up at traffic and transportation since the open streets open restaurants, is a DOT program and debbie and agreed that I guess it's up to Eleazar for the bylaws to figure out what to sign it, but maybe we should have sort of a town hall addressing you know, or at least the committee should have a conversation, probably health and environment traffic and transportation, business development, and maybe licensing if this is a. If this is a health issue, I do not know. I do not think we. I do not think we need to wait for a town meeting. I think it's a big issue and as long as we know the proper reporting, I did have a question for you pauline a separate question. I know you said the numbers were down, but I think I saw a patch article saying the numbers were really high, maybe week over week since the beginning, they were really high in 3- 3. There were 40 more cases in 3- 4. I can email you that article, but it seemed to be that we were actually having a problem that we had bigger increases. I can see if I can find it now, but you know I mean from what I just gathered from our website and one zero. Three. There was a 12 decrease in cases, but I mean you know I mean there's also there's also sorry. I guess it depends on one day of the week because they were increasing by like a full percentage point in sort of testing results. Yeah I mean, and also I think, a lot of confusion lies around testing rate. Also you know per 100,000 residents. So I think a lot of a lot of that data is may cause some confusion. But again you know things change week by week. I think, if we're not seeing a steady, dramatic increase in a neighborhood, I think that's good, but I think whenever we see some small incremental increases, we do want to put resources into the community and make sure that stops before it becomes a big problem. So yes, absolutely. I think I think we are focusing on your district. So Washington Heights is not like a hot spot location right now, but we are seeing some incremental increases, which is why I think you know our health action center and health and hospitals are doing some on the ground work in your district. So few other things quickly. One is, I would be interested in the palm cards, Et cetera, so I will reach out to you what is best to use. So my email is p and my last name for Auntie F E R, F-, E-, r-, r-, a-, n-, t- E at Health.Nyc.Gov great then. The last thing I want to bring up, which also would impact Lorraine's, is, I guess, effective, Wednesday of this week- there's a change in guidance for travelers. It used to be. You do not have to test, but now it looks like they changed it to anything, that's in a non-, contiguous state or location, and but you can opt out of the two- week, quarantine by getting two tests- one, maybe there and one here- and I do not know if you could get one here and another one here, but you know I do not know where I would have gone in DC to get tested and I would feel more comfortable getting tested where I continuously get tested the day. I come back and then later so I'm not sure how that works, but I know that the mayor's, the governor's guidance has changed and it's a fairly significant change. Yes, you're right, it is a government, it's a state change in guidance. So I believe that if you do have two tests that are negative, you can, you know not have to quarantine for the 14 days. I do not know the specifics. I apologize off the top of my head, but I can try and find the link to the guidance, and I can send that over right and also I just wonder if you're sort of caught in the middle, because now one can't even go back and look at what the guidance was before the fourth, at least on the governor's website. I have gone on the website, so I know the new guidance right, but I wanted maybe so I think maybe we can get the state Department of Health next time for questions related to that. Okay, I just did have a quick question which was similar to a question in the chat for Pauline yeah. Just about you know if there are stores or restaurants that we see are not complying. You know with you know. The mask thing, then, is three one still the best way to report those places or yes. So three one is definitely still the best place to report that you can also just send me an email at the same time or with the 311 complaint number and I will be sure to reach out to the mayor's office so that they can let their team know. And then, if it's a restaurant that serves alcohol, I think you should let the state know because they have the arm of the state Liquor Authority and I think the state Liquor Authority ha- and I do not want to be punitive to these restaurants right, like they've, had a really difficult time of it, but if they really are contributing to you know people not following any guidelines. I think they should be educated a little bit more, but then, if they continue to be a bad actors right, the state liquor authority should come down and sort of have a good talking to them about what is right and what's wrong. But I know that the governor was pretty pretty committed to having the state Liquor Authority Revoke liquor licenses. So if that's something that you think the that business might need, I would recommend letting the state know as well. I think a lot of people sally, let me get in here- you can yeah, go ahead and type your question if you want cheryl yeah just to answer yeah pauline. I just want to make note that, since this committee met a month ago, there have been 428 cases in all four zip codes: four additional deaths, so I mean Zip codes, 32, another cases, zip code, 33,126, zip code, 40, 69, zip code 34, another 93., so I do not does seems as though seems as though we're not doing that. Well, I mean I, you know, based on population size. I can't I do not really know what your population is for your zip code, but I mean any case right to us- is sort of a case for concern, but I think you know just to be comparative to the other locations where we're seeing huge hot spots. I mean they're at like a five percent, eight percent positivity rate, whereas you guys are not anywhere near that. So I think all of Manhattan at this point is still pretty much below that threshold, and so you know I know it's not any comfort to you. I know you want many more resources available to your constituents into your district, but I think we're seeing some real problems in other neighborhoods throughout the city, and so a lot of the focus is on that, but you're right like we do not want to get to that place in Manhattan. Well, for the most part. For the most part we rank in the middle. I think there are maybe 177 zip codes and zip code. 32 is number 79 on the list. Zip code 40 is number 80.. Zip Code 33 is number 91 zip code. 34 is number 120, so we're far from being at the top of the list we're being in the worst category, but in the in the last column, on this on your chart on the table on the on the DOH website, it says that three of our zip codes have a nine percent positivity percentage and zip code. 34 has seven percent, so is not. That is not that fairly high. I can't hear you sorry I needed myself. I did not see that on our website, so let me go back and check because if that's the case, yes, it is pretty high, but I do not know. I do not know, what's contributing to that number, whether or not it's you know based on rate, which would be so. Let me let me go back and check. Okay, yeah. Let me yeah. Let me know what that signifies, because if it were, if it were that high, then we it would have automatically triggered something within our agency to say that this location requires a lot more attention and that has not happened yet so. But let me just double check for sure and a lot. A lot of the zip codes seem to be very high. They seem to be way over the two percent or three percent. They all seem to be somewhere in this range. So I'm just trying to figure out what does that percentage really represent? I just wanted to jump in pauline sorry. My name is Laureen Valentine. I am the borough outreach director for New York, City, Health and hospitals, specifically for the test and trace unit. I've just been helping my colleagues over in the Bronx, but now I am completely focused in Manhattan. I joined pauline at a community board meeting just last week. I worked at some of the polling sites this week in East Harlem and in Washington Heights specifically, and so I can tell you from the city's perspective health over at health and hospitals. We do not have not even a 2.0 or two point and higher positivity rate in Manhattan. My job specifically right now is focused on prevention, so that we can keep the numbers down work with all the community- based organizations within your community board in order in an effort to partner and provide access to PPE, give you micro sites where folks can get tested for free or low cost at no cost in your area and to hopefully work alongside with you. So you can be conduits to your community to disseminate information. So I think Mr Simon will go back to our colleagues and our departments to verify that information. But as of this morning, every day I do my daily team calls. Those numbers are surprising and shocking for me specifically since I'm tasked with Manhattan and that has not come up. They must represent the the percentage going back to March they ca. They can't be like the current testing. It does not make any sense exactly it just you know I, but I even if, even if we're talking about going back to March, I was surprised that they were as high as that, but that's the only thing that would make sense to me. I mean what: how can they possibly be that high right now when we're when, as you say, we're we're under two percent and maybe even under one percent yeah and the only zip code that I had in Manhattan? That was on our watch list, which, as of Monday came off, was in east Harlem and the minute it went on our watch list that the very 12 hours later I did an outreach program in East Harlem right away and had a canvas team out there. Okay, I mean well I mean I I'm. I got to believe we're. Not we're not in a severe critical condition at the moment, but I was struck. I just kind of you know if pauline will go back, she'll figure it out for me and she'll tell me what those numbers represent, but I we definitely want to establish a an ongoing working relationship with you and want to support your efforts and want to make sure that people in Washington Heights who wish to get tested can find an easy way to do so and hopefully get their results back pretty quickly as rapidly as possible. Absolutely can you post, I'm sorry. Can you post the links you and pauline to the links to the websites that you're you've been sharing with us? If you could do that, that'd be great I'd. Love to I do not have. I do not have the chat feature available to me. I guess, but I can okay, so I can definitely send an email with all the resources I have available to you folks and so that you can send it out to the entire community board. Absolutely perfect. You could you're going to send it to me, or maybe you now have Paiola's email yeah. I do have Paola's email address and I'd love it all right. So then copy me if you do not mind and we'll we'll send it around, and and would you would you also want to join us on a on a regular basis as pauline does absolutely? If, if I'm allowed absolutely I'd love to do that? Well, I mean I would allow you who else has to allow you. Thank you. Thank you. So much Mr Simon, okay, all right Steve! Yes, I just checked our website and what the what the number and percentage you were talking to were cases from March. So that's the total overall from March until now, a nine percent yeah. So that's the number. So I would I would trust Laureen's daily count because she probably has the best information right. So I mean Laurie. Do you specifically know what our positivity rating is in in Washington, Heights and Inwood? Are we do you know where we are so I do not have a specific number for where we are in Washington, Heights or and Inwood, but since I've onboarded for Manhattan, it's been on my watch list. I've actually already partnered with a social dominican club in Washington Heights and I'm reaching out to elected officials as well in the area I've joined the community affairs unit, my colleague, Isaiah Jenkins and I and Pauline actually are working on something that we hope to get some information to you early next week, where we're planning a joint virtual health seminar prior to thanksgiving. Since we want to get in front of things, you know we're very hopeful that folks will be vigilant, but, as pauline had mentioned, there is this Covid-19 fatigue. People are tired of hearing wash your hands. Wear your mask socially social distance. However, some new information that we've come across is that the uptick in numbers, or an increase in positivity rates, are due to small family gatherings, not the large family gatherings, especially in enclosed spaces, which is why we're trying to get ahead of things and possibly have a speaker and an expert on there. Once we've confirmed that prior to Thanksgiving, we'll roll that out to you and an invitation to everyone on this community board, along with some other folks in upper Manhattan, so that we can work together in order to prevent a second wave. And are you also working with the northern Manhattan improvement corporation? A couple of their resource navigators gave us a presentation. Maybe it was two months ago and they apparently supplement the work of the test and trace core by providing assistance to a people in isolation. They're not actually doing the tracing, but I guess once you identify them, and people are placed in isolation. They then come in and provide support. Services for the people in isolation make sure they get food and medication and any other assistance they need. So I would hope that you're in close contact with the people there at northern Manhattan improvement corporation. Well, I'm not sure if it's north and Manhattan improvement corporation and I can check for you, but we definitely do have a take care program. That's kicked off, and tomorrow we'll have our new communication pieces where we're going to disseminate to the public. I would absolutely send that to powell line yourself as well. We'll have information on the hotels and the food that we're providing to folks who are not able to quarantine at home and do need assistance with quarantine. There'll be free, Wi-, fi folks can hold on to their phone or devices while they're there so that they can stay in touch with their loved ones as well. We've had a lot of folks asking for detailed information on this. I myself have not been able to see the information, yet I'm not privy to that. So we'll have tomorrow, they'll be displaying that to us internally and then we'll be disseminating that to the rest of the community. All right well, keep us in the loop all right sally. You have a hand up. Okay, then, I had a question: okay, sally you're, muted. Yes, I posted, and it's under answered questions the patch article. The reason it caught my eye is the picture that it had with the article were two people with masks on in front of coogans, which I thought oh yeah. I saw that that's right yeah and that's where the positivity rates were said, the rates in all three zip codes. For some reason they only did three two three and three four, the productivity rate and all three should not increase from the previous four week period. This was for the period ending October 24th. The most recent overall code would test so Nikki jumps across the board, and I guess that the data from last week was 67. Zip codes around the city were above two percent of the four weeks according to gothamists, which reported the deal so it so it was saying it says that three of our zip codes were above two percent. It will I'll give you significant increases and I will tell you what they were. It does not say what they were. It does that's why I'm just scrolling down? Okay, yes, I am aware of this article as well, and it's caused a little disarray for the gothamist versus the information that we're actually receiving at the Department of Health and the city from the testing sites from the locations from the hospitals that report back to us. So there seems to be two different sides: the gothamist has theirs and we have ours and that's not something that we. Those are not the numbers that we've seen. So I can't speak on the gothamist numbers, but I can't speak on behalf of the city and say that is in fact, for us that is not true. Okay, they should. I give you the numbers that God that they reported in patch yeah. What are they? Positivity rates in 1033 was the highest. It was 2.01 percent in 3- 2. It was 2 and then 3- 4. It was 1.7 percent and then they gave the, and that was out of 67 zip codes around the city had were above. 2 percent and 16 were above 3 only 20 zip codes in the month. Prior only 20 zip codes had rates above 2 percent, including 80 above 3, and then the number of cases they said in three two most recent four weeks 104- and these are the weeks ending October, 24th 1032 had 104 positive cases in the prior weeks. It was 41 cases, 1033 had 98 positive cases in the primary I'm sorry. Maybe you could just post that in the chat, and we could. I know that I answered Channel's question. So if you go under answered, patch is saying that our positivity rates were basically two percent or lower. So that does not seem to be a problem. I mean, if that's what they have, if that's what they were percent, what I think the idea is you want to be below two percent well well, but we we're not very m in one case we're at two percent, the city, but the city is too high. If these numbers, as Laureen, said if these numbers are cheap or any good because was not two about, two percent- was like the same cut off: they used for schools if the rate went above two percent and we're closing the schools. So Steve two percent is a very significant percentage, which is why the accuracy of the state is essential, you're right sally as soon as a zip code or a neighborhood gets identified at the two at two percent. It becomes on our watch list and we start a strategic plan. You know pauline would get hit up right away all kinds of folks within the agency and that becomes a primary focus for the next 72 hours. I would like some of the swag. You know the palm cars and stuff like that, because I see a lot of in the park and I can hand them out and I'm always in the park, so I'd be really happy to do that, and I could do it at the farmers markets and I'm happy to walk over to dyckman houses and do it over there anyway. But Lorraine you're saying that, according to DOH records, the patch article is not accurate when they say that the two of our zip codes can't, I can't speak on DOH. That's where pauline comes. I have to be very careful about. You know that line, but I can speak on behalf of the city. Mark Levine is here, but he changed his name to K Smith, okay, so Lorraine just quick question: what is the role of the sheriff's office in what you all are doing? I'm so sorry? I have to get back to you on that. This is the first time I've ever been approached with that question. Oh okay, I guess! Maybe it's not! I'm pretty sure it's true, because I saw people at the airport recently I was in Texas and and they had the trace and yeah there's so there's several units in test and trace you're. Absolutely right! Now I'm getting texts from the sheriff's office about it. I'm like okay. What is it yeah so I'll find out tomorrow we're on a call with our entire team. My unit specifically deals with outreach and specifically with outreach within the community in the city of New York, all right all right. It looks like we have two other hands. Oh one is K. Smith is mark on the call I am, but I apologize. This is Keisha Smith, my Scheduler, whose name is appearing and I'm trying to change it on the fly I apologize, but it is all right. So did you have a question for Lorraine? I can clear I can clarify this dispute on the data if you'd like okay, which is that, unfortunately, what's available publicly, is pretty delayed. We have a view over the last month. It's a four week average and it's a week old when it's posted and those are the numbers that the media is citing and they do indeed show rising positivity rates, city- wide in Manhattan and specifically uptown, and so many of them were at or above two percent a week ago. Those numbers have been updated today and they are mo. A couple of them are slightly better and a couple of them are now worse. Looks like the one. That's worse is, let's see 1033,103. The positivity is now 1.93 percent 3- 4, it's 2.47, which is worse, wow, 3- 4 is horrible. 4- 0 is 1.17, so that's better, and I do not know if I just said three: two: it's 1.74 these are obviously much lower than what you're seeing in states around the country where the virus is serving much lower than what we faced in New York City back in the spring. The concern is really the direction that we're going in and we have had a slow and steady increase. Most of these have doubled in the past month, really compared to mid- September. The number of cases have done is more than doubled. The positivity has roughly doubled, and all that was before the weather started to get cold and the cold weather means. I do not know if it was pauline, I'm not sure who was speaking about it, but it's going to push people back inside and the we've been living life in our parks. Uptown I mean Birthdays Weddings, family reunions, yoga classes, not to mention outdoor dining and that's been the safest place to be for the spread of the virus, and you know the data we're seeing reflects that period when it was warm. We had a very warm fall and now it's getting colder and I'm sure you've all seen it. The parks uptown are much less full. Where are those people now well probably inside? Are they wearing masks when they're gathering? I do not know? I worry anecdotally. I've heard not necessarily and what we've seen around the country is that what's driving, this is small gatherings inside sometimes with family, with close friends where, because it's not a lot of people and it's people, they know well folks, let their guard down and the virus spreads that way and we've got to be worried about that uptown. We live in small apartments and- and this is going to be a tough two or three months, while the cases are increasing the end, the vaccine's, not here, we still have horrible leadership at the federal government which I'll speak about when you cue me Steve, but we have to be really vigilant. Now it's going to be a challenging couple of months. Can I ask you a question mark sure, and maybe before we go to Mark, I want to make sure that it might be department of Health and it might be laureen has his number yeah. I just want to make sure. Can I go back to Lorraine? I want to make sure lorraine is finished with what she had to say. Sure. Thank you so much Mr Simon. I appreciate it so really quick. I think council member Mark Levine really hit it on the nail there where folks, as I mentioned earlier, you know we're trying to take preventative measures and help folks, as we approach the holiday season right, we want to be respectful and responsible for folks. So one of the ways in which test and trace would love to partner with you is to help us promote the basic four core that the city is putting out there and I'll email. You, our digital pump card, and we have that available in different languages, promote nearby testing sites which I'll also email to folks. According to the zip codes, distribute palm cards and masks. So I'm not sure if there are community- based organizations in the neighborhood or centralized where we could. Actually, you know, send cases of masks and Pom cards and folks who do not have access to that can actually pick up organize days of actions for nearby testing sites. Handing out flyers mass to drive traffic to sites materials to be provided by us from test and taste test and trace. So really would be a special day where you promote getting tested or, and if there are not a community- based organization that is doing this or willing to do this. You know I folks want to host if there are community- based organizations that are willing to do this if they want to host a microsite. Maybe if there is not one in a neighborhood, for instance, if seniors have a hard time accessing it because of the terrain, the turf that you guys are at so Hnh staff would bring self- test kits for people to test themselves and folks will receive instructions for how to get their results. So those are some of the ways that you know we're looking to get ahead. In addition to possibly coordinating this virtual health webinar I'll do 1034 more than happy to okay, I have a this is Barbara. I have a suggestion, I'm on the board for the Star Senior center. I also was in touch with the Ymha on Nagel today, and both senior centers are in the process of looking for in the near future, starting grab starting grab and go senior lunch. They won't have a sit down lunch, but they will. They are doing outreach and hope to begin soon grab and go senior lunch. That's a perfect way to disseminate information, absolutely mask and pump cards as they're, giving out cards and maybe even set up a micro testing, and what about the food pantries that are giving out food yeah. That's another good point and also houses more so than the food pantries, the site at the Y and the site at the Star senior center have the room and the space for a micro testing site and a good way to do the distributions. Well, that's definitely something that we can talk sidebar about if we can get that information to Paola and Mr Simon so that we contin we can continue this conversation. I'd really love to connect with those folks, you know so I can see if it's, if it's available but at least to see how we can start disseminating information at mutual aid sites as well. Yeah, it's not soon. They hope to not, but soon Betty. Are you on the call yeah? I am. I wanted to say that, and it's just a pet to add on to what Barbara said all the senior centers are supposed to start grab and go and ostensibly the date was initially November 9th. I have not heard about any changes in that date, but one of the things we can do is check to see if that's the actual date or if it's been pushed back, it has been going back a couple of times Richard, you might know you get on mute last Friday afternoon, the department for the aging sent a directive to all senior centers in the city that grab and go and all on- premises activities, including grab- and-, go, do not go forward at this time. It was, as was just mentioned, targeted initially for November 9th. It's not happening with a new date not in place. At this point it appears that the guidance came initially from the Department of Health on that. Oh all, right. Well, that's too bad all right, but but certainly when it comes time, if they start it up betty, maybe you could help put Lorraine in contact with all of the people through the council on aging. Yes, I can help. And yes, all right, very good to help you betty and then and Richard is in is runs a senior center in central Harlem, so I'm in Harlem, but it's part of the long time Washington Heights Organization are Fort Washington right, I might add, in terms of numbers. In my conversation with the Y on Nagel today, I was told that they have 1,000 about 1,000 seniors on their active list yeah, so that's which means that they come in for the lunch, the regular contact, regular activity. So that's a good number for just one center, well plus of course, but plus. Of course, the y has a whole variety of in normal times a whole variety of intergenerational programming. So they reach a hell of a lot of people in the community beyond just seniors. Yes much more. So maybe we should just send all our suggestions to Steve yeah, okay and I'll pass them on. I have a burning question and I'm not sure who can answer it in the state, but I've got a lot of expertise in this room in the same way that nursing homes have to report cases and deaths. Where are hospitals reporting that information hospital by hospital? I know that the New York Times had gotten hold of some of that data back in July and they showed very disparate death rates depending on location. Like I think, Nyu Langone was the best bellevue was the worst, but even within the different hospital systems, there are widely varying rates of success. I guess, and I wonder if nursing homes have to report this data, I know there's somewhere that hospitals are reporting it. I just can't find it and I wonder if you guys could be any help pointing me in the right direction. I know it would be state Department of Health yeah, it's not easily accessible publicly, not by journalists and honestly, even the New York City Department of Health has to struggle for it yeah. I know it's impossible and it's critical data yeah actually mark. I would like to have a separate conversation with you about that question. All right is there anything else for Lorraine all right Lorraine. Thank you for coming. I'm going to put you on the monthly list to invite you back so email address all right. My email address is V, as in Victor a l e N T, I l the number eight at N Y C. Okay, great! Thank you! Thank you so much for having me. I really appreciate this and I look forward to partnering collaborating with all of you all right well rely on us for any help. You may need, if you and let us know how what how we could possibly be helpful. A day of action sounds great to me: yeah. Well, let's figure out how we can give her right all right, very good, all right! Thank you, Lorraine! Thank you! Pauline Mark you're up excellent, great presentation, Lorraine. I want to emphasize that this fight is not over and I'm really grateful to the CB 12 health committee and usd for just continuing to focus on an issue which we're all frankly exhausted by it's harder and harder to keep people's attention while the numbers are going up and up- and I think this- the stats we shared momentarily ago tell the story, but this is not about hot spots in Brooklyn and Queens anymore. It's really not! It has not been for weeks. The numbers are moving up steadily in the borough of Manhattan. This is a citywide trend, not thankfully the explosive geometric growth we saw in the spring, partly because we're still pretty good about wearing masks and social distancing and that and that has put something of a break on the rate of growth. But the numbers are growing, we're getting more people importing cases by traveling to and from other states that's a real risk for us and only getting greater as the virus surges around the country. We do not yet have a good read on the extent to which indoor dining is a source of spread. It's something we have to watch closely, but we know that the cold weather poses a risk factor. So in that context, Steve invited me to speak about an important legal effort, I'm involved in challenging the trump administration which well I've got one eye on the news sites and boy, it's looking better and better for those of us who are rooting for biden. I realize this is a non- political environment. Please here no partisan activity here exactly just reporting the news either way the president is going to be Donald trump until January 20th, and so we can't afford to lose another two and a half months in the cobin fight and I'm part of a team that has determined that the trump administration is in violation of a law which I had known about before. They approached me. The pandemic preparedness act, which was passed in 2019, and it turns out to require that the department of the health and human services at the federal level share extensive data, collect and share extensive data about a pandemic with the public and consult with local leaders in policy making and amongst the kinds of data that they need to help collect and share, are testing and context racing, and so a legal team which is headed by Norman Siegel. But I'm sure Steve, knows and others know, has been a crusading civil liberties attorney in New York ran the New York Civil Liberties Union for many years he's been kind of the main legal mind on the team, and I've been brought in as a plaintiff in my role as chair of the City Council's Health Committee because of the ways in which this failure by HHS to live up to its legally mandated obligations, has hindered my ability to do my job. The way I should because, as a policy maker, like all policy makers, we have lacked critical data about this pandemic. I mean my goodness think about back. In March we were essentially drowning and barely knew we were wet because we had no testing data. That's on the federal government, but this is really about the next two and a half months and trying to force H to finally do the right thing and we have a we're. This case is being heard in Manhattan federal court. There's a public hearing schedule. The first hearing is scheduled first week of December. The date is still in flux, probably December, 2nd I'll. Let you know when it's scheduled, because the public can participate they're, all virtual now, so makes it a little bit easier. But potentially the remedy could be a receivership for HHS if they refuse to comply, and I think the timing now is critical as we face a second wave in New, York, City and really a third wave nationally and just the absolute requirement that we up our game now during these difficult two and a half months. So again, this is the lawsuit. What I, what I'll do Steve is drop a link daily. The daily news had an article on it. That might have been what you saw. Yes, so maybe I'll drop that into the chat and I'm happy to take any questions on this. I know you have a big agenda, but I do appreciate a chance to update you on this important legal action yeah. I appreciate that. Let me just ask you that line you had a little while ago we back in April, we were drowning and barely knew we were wet. Yes, is that your own line wait is that I did not make that up. I forget who I'm plagiarizing? Oh that's a great one. I think someone. I think I think I got that from someone in the Department of Health, but I'm probably the first to say it publicly. So, okay, a good line, very good line. It's a good line to steal. Okay, any questions it looks like we have a couple of questions: sally and Nancy Preston Sally go first, I'm going to pass my question. That's to my hand from where can we get the hospital data question? Okay, dad take away your hand then, for now can that can do? Can Nancy ask a question: how do how do we? Let Nancy ask a question: you eat she either types in the chat or we promote her to panelists nancy. Could you type in your question? I wanted. What is it? Do we have it? Why do not we just enable chat? I do not understand all right go ahead. Well, I think we should too, but yeah other executive committee. People all right go ahead. Did you promote, or I hope, yeah payola paola Nancy, the panelist yeah? What happened I'm looking for you need what nancy we need you to promote, Nancy Preston panelists, so she can ask a question: she's under participants, but not under panelists cheryl is also an attendee and she was able to type. I do not know if there's something I do not know on her side, but I will do it. Yeah go ahead. Hi Nancy, I'm mute, okay she's! She just needs to be unmute. She needs to unmute herself that she has to do herself. I can't do that for her nancy. Can you unmute yourself? Oh god, all right. Just all right! This does not seem to be happening. Okay, nancy trying to mute yourself at the bottom of the screen all the way, the bar all the bottom bar all the way to the left is the mute and unmute button. All right. Are there any committee members with any questions for mark all right, very good, all right! Thank you. Mark thanks everybody and keep us posted on the progress of your lawsuit. I definitely will thanks so much Steve yeah and the date of the public hearing, especially okay, all right, very good. Thank you. Thank you. Bye- bye. All right next up is Janil edwards from Columbia University, Irving, Medical, Center Janila, you with us hi good evening Steve and to the rest of the committee. How are you okay glad to hear that? So my report for this evening is very brief, and I just want to confirm that everyone is able to hear me yes, yeah you're, coming through at my end, okay, great thank you. I know zoom could be a little temperamental from time to time, so I'm just going to do a really brief overview of some of the activities that we've been involved with since the month of October. As some of you may already be aware, on the 27th of October, Dr Barr gave a presentation to the General Board meeting talking about Covid-19 and the local research that was being done at the medical center. He touched on a few important points that the pandemic continues to worsen, even though the course is predictable. We do also know that public health interventions and options are effective and are available at our disposal. He continued to emphasize vigilance on mass social, distancing and avoiding crowded spaces, and he also briefly touched based on the Nih- funded research that was provided in order to look at long- term consequences of Covid-19 on the lungs and on the heart. Another thing that I have to report on is that the current class of Dickman Institute Scholars has been selected. We expect that these hard- working students will be alerted as soon as possible within the next week or so, and then on the November 24th general board meeting. They will have the opportunity to be publicly recognized by the board for their academic accomplishments. I'm just a reminder: the Deckman, Institute Fund scholarship is awarded to students in the Washington Heights and Inwood area who have applied to Columbia, College and or the Food Foundation School of engineering and applied sciences. So we're really excited about the work that these students have done and we will take time to publicize their hard work and their efforts and acknowledge them and congratulate them. The last thing that I will be touching upon are our testing numbers at the medical center campus, and this is only at the medical center. I can not report on the cases at the hospital all through the last week of October 26,516 students were tested, one test came back, positive, 699, faculty and staff members were tested, present, company included and one test came back, positive, 77, other affiliates were tested and that yielded zero positive results. So that's just a really brief overview of on the testing. That's happened on the medical center's campus and this information is updated, weekly at Covid19.Columbia.Edu, where we gather not only the campus data by cohort but campus contact tracing more information about campus testing, along with a brief snapshot of New York City Data, and that's it for me. Okay, so it was 77. You described the 77 people as as affiliates. I guess those are employees right. Yes, okay, all right! So out of all of that testing, only two people, one one student and one faculty or staff member- was found to be positive. Yes, that is that's correct. That's pretty good! Okay, all right! Very good! Are there any questions for Janille? Well, oh, very good! You get off Scot- free upcoming events. What is that? What's planned for November December in terms of community outreach, yeah and covered outreach, especially well, we would like to have or invite a faculty member come in to speak to every general board meeting just so we can cast a wider net in terms of outreach, and you know updating the community about the efforts that are being made on the medical center campus. Traditionally, in November, we have done a canned food drive to support Fyi's food pantry, but unfortunately, this year we won't be partnering with them as their cova. 19 protocols do not allow them to accept in- kind donations and that's a policy. That's also been you know, adopted by the medical center, so we're definitely still looking out for opportunities to support the community to be a resource, particularly during this time- and I will you know- make the committee aware of any upcoming events as those become finalized, and I have the go ahead to publicize them. And my other question is: are the medical students going back to clinics to do some work? Are they basically just doing their one lab class and doing the rest of the stuff virtually? As far as I know, the students are have been allowed back on campus, but I need to get some more information about that in particular, and I can follow up with you yeah or the committee yeah I'd like to because I know a lot of them were really enjoying being in the clinics. You know yeah, it's an important part of their training as well. Okay, thanks so much you're. Welcome all right, very good! Thank you, Daniel! Thank you. Everyone have a great evening you're going to email, something to me. Yes, I will all right. Thank you. Okay, next Betty Lehmann Betty wait. I have a question who's. Speaking now nation I used to yeah. Now you should go ahead. Just I do not know just a general question. I do not know if people are aware of this, but I just found out that apparently, there's been like shortages or like community clinics have been short closed down like significantly during Covid-19 and or at least in a greater proportion than other healthcare facilities. During the time of Covid-19, I do not know if this has been on our radar, but I think it'd be important for us to talk about this or get someone to come in to talk about community clinics and ambulatory care services being shut down. I'm not aware of that which ones which ones are you referring to well just like programming throughout nyp campuses for ambulatory care services have been shut down or, like have been, are still not. All of them are fully functioning or they were not functioning during Covid-19. These are services that are critical for communities, because they're community- based services. Well, I think they may have shuffled some people around, but my understanding we got a report in one of our earlier meetings. I believe that all of them are open can do. Would you be able to come gather any more specific information about this yeah? I can gather some more and get back to you all right. I will I'll help you out on that, because I know like a lot of the clinics, that the medical students at Columbia were staffing, if they're not going out in the clinics and those like Tuesday night clinics are not going on right and just like more like. I just think that if we're going to move it and talk about addressing Covid-19, we need to address it from a community standpoint as well from as well as a health standpoint and these other clinics that are dealing with the community and people in the communities and they're not functioning. How do we expect to ever fully get it under control all right? Well, let's gather some specific information so that we know what the what the right questions are to ask you're saying you're saying these are the these: are the hospitals, ambulatory care, centers? Well, they're, all that is different network, so these are like. I can't hear Naisha sorry, so these are like under the ambulance or care network. So these are satellite clinics programs that function in the community that are funded by or in part, by New, York Presbyterian, and just I want to make sure that these programs and these clinics are open and open to the public and being advertised. Otherwise, our community is not lost like we're losing out right all right. Well, I would want to know that they're not opening that they're, not open. That's news to me! Well, I would I'll just call them up tomorrow and find out if they're open, I mean I can't you know, but it would. It would be disturbing to hear that they're not open. I could understand, maybe if some of the services were being centralized, which I think they were telling us at one point, that they were moving some services from one location to another, but my understanding was that they were open well right, but even if they are, the services are being centralized. What communities are they being centralized into and out of right? I think it's important for a question of who's losing services and who's gaining them services. Okay. Well, let me let me know what information you find out and I'll try to make some phone calls as well all right Betty. Are you ready? I am okay, a couple of things. We are continuing to follow state and federal guidelines with regard to infection control, including the weekly testing of staff. All staff are tested every. We are conducting window visits with family members and residents of isabella, and we do that. You know, as people call in to schedule it we manage to bring the families and the residents together for a period of 35, I'm sorry 30 to 45, minutes and and so forth. You may know from the recent media coverage. We actually had a wedding at isabella a couple of weeks ago, not of one of the residents but of the daughter of one of the residents actually got married in the courtyard of Isabella and her mother was able to be at that wedding, which is really quite nice. It was covered by a number of media outlets, including Channel, seven Channel four and I believe Europe one anyway. I have an announcement. We have been operating the resource center. In fact, all of our community programs remotely since the start of Covid-19 and one of the things we had to take a look at, was whether we were going to renew the lease at the resource center, which is on 169Th, Street and Broadway, and at this time we've decided not to renew it, because we do not know when this virus will subside and people will be able to return to a location. So we are going to not renew it right at the moment and we're going to continue to have our staff work as they have in the last eight months. They're working remotely part of what the resource center does is. It speaks to residents with regard to benefit enrollment as well as well as managing a naturally occurring retirement community right in that area. So we're going to continue to function as we have for the last few months, but not in that location. That's it all right! Well, I do want to mention that I've been checking the the state Health Department reports about nursing, home Covid-19, related deaths, and you know- and in the last month there have been no additional covenant- related deaths at isabella. Right, that's important to make note of either it's been that way for a few months now, yes, either confirmed or presumed deaths. I ask a question: yeah go ahead. Betty, do you have information on the number of patients you've admitted to the hospital and the conclusion of their cases which hospitals they were admitted to and what the result was from the beginning of the Covid-19 epidemic? I do not have that information. No, I do not have that. I know the hospitals. We were directed by the governor way back whenever in April of May to not report. Any of that was the responsibility of the hospital to do that. Yeah. We just can't find where they're reporting it huh, it's just impossible to find the hospital. I know. I know what yeah I know must be a very powerful hospital Association in New York state. Oh I'll comment all right, any other questions for Betty. All right, thank you. Betty! Are you going to email, something to me? I am I'll do that later tonight. Very good! All right do not go to bed until you email it to me. Okay, all right, very good. Okay, this ends the Covid-19 for 19 portion of our meeting. Next is a presentation on the Columbia University Medical, Center, Community, Outreach and engagement program by Andrea, Reyes manager of Health, Education and Outreach, and who, at one point years ago, was actually a member of this committee. Andrea, are you still with us? I am with you. How are you all doing? Hi Steve? It's been a while hi Betty. I have some friends in here Steve may I share my screen and you can share anything you'd like okay. I just wanted to pull up a flyer, so I'm here to present just very briefly on actually one second before you go on, there's a hand raised someone. This is someone named gabriella, says Gabriela estrella. All right. Forget it all right go ahead, I'm here hi! This is gabriella. It just promoted me to a panelist hi everyone, I'm Gabriela Bozono. I actually was a former pediatric resident of Nyp Colombia during the pandemic, and so I know that in regards this is just a comment in regards to. I think it was Miss Diaz who mentioned something about the clinics being closed from Nyp. So I just wanted to clarify that there were clinics that were like pediatric clinics that were physically closed, but all of the patient, all the Acn patients were still being seen at the audubon clinic either through telehealth, or they were getting their vaccines and getting their primary care at the audubon clinic and there were urgent care services available to them as well. I can't speak to what happened after I graduated in June, but I know that was what was happening in the when they redirected us in the springtime. So just wanted to clarify this so you're. Saying, though, that the the other Acn's excuse me on 181St, Street and and up in Inwood and the farrell center and the rango center, they were they all closed. I know that the pediatric clinics were closed. I'm not. I can't speak to the adult clinics or the Ob gyn clinics, but I know that the pediatric clinics we were directing all of our patients to we had like a central number and we had nurses available. We had telehealth, we had and we had all of our attendings working at the audubon clinic to see all of the Acn pediatric patients, but I can't speak to the adult or the Ob gyn patients, so that so that was it to audubon Avenue with 166 free yeah. That's the out up on Acn, yes, okay, I'm not only talking about okay, gabriella, yes, to tell me your last name: Besona B is in boy I- S- O-, n-, o b- I- f-, O-, n-, o Bifono yeah, B-, I-, S-, O-, n-, o, yes, b-, I-, S-, A S, as in Sam. Yes, oh no, and are you currently a pediatric nurse at the hospital? No I'm a pediatric, I'm a pediatric doctor! Oh excuse me ella! Can I ask you a question? Yes, okay, so they were directed to the audubon clinic. Do you know how the census went up at the Onboard Clinic? I do not know, or the number of visits went up at the audubon clinic or dude. I'm sorry I do not have. I do not actually know the information, but I'm sure they collected data on all of the cases that they were seeing. Yeah. Sorry, the patients that we were seeing you ever find a way to mine to help us mine the data. We would love to get some numbers yeah. Whoever might have that information. There was also an autonomous post about the number of children. I guess one or two hundred thousand being diagnosed with Covid-19. I do not know the data on that. I'm sorry I'll, send you the article okay, all right! Thank you. Thank you. Thank you. Guys have a question and a comment. Okay. What my first question! I have a question and a comment. The first thing question is Julio Batista on this call no well. I do not think so. Okay, because if we want numbers, we should reach out to him regarding that information, because he should be able to provide that or gather it yeah. Well, the problem, the problem we have with the hospital right now is that they are refusing to provide us with any numbers every time we ask them for any numbers, they do not give it to us. So I have a. I have an issue with the hospital right now to that definitely. Secondly, I wanted to say that thank you gabriella for bringing that up, but I was not just speaking regarding like health care services right like I know what New York train is a hospital, but there's also other programming. That happens, and I think it's critical in our community and I want to know what the status of those programs are. It's great, that our services, like healthcare services, were either done through telehealth or concentrated in one clinic physically, but I think we need to talk about other, like community health care program, that patient navigation programs, other programs for youth in the community and how those programs are functioning throughout the pandemic and are still functioning, because I think those programs again are critical for our community to add real quick. This is Katherine. The navigation programs have not been shut down. I mean they have multiple patient navigation programs and community programs, but those all continued via telehealth and then on a case- by- case basis. Escorting did take place and it continues to take place well, yeah. I think what we. What we learned a couple of months ago was that the resource navigators at northern Manhattan improvement corporation are still functioning seven days a week. All right are we ready for Andrea to begin her presentation? Okay, Andrea! Go ahead, okay, thank you, Steve! I'm just sharing my screen so one second. Can you see what I pulled up? Yes, my flyer? Okay, so hi everyone Steve! Thank you for the introduction. So again my name is Andrea Reyes. I am among many things, a health educator at the at the Office of Community, Outreach and engagement and which is part of the Columbia University cancer center. We are a team of really culturally diverse team of community leaders, cancer, researchers, educators and clinicians. We work to identify cancer trends in the community and address cancer disparities and work with communities in order to reduce those disparities. One of the things that we do our free community workshops for any community organization that wants to host us. I have workshops in English and spanish. They are simple, easy to understand very colorful and get the point across, so they all have a cancer prevention and cancer risk reduction focus. If you see on the right, we have a list of community workshops. I wanted to let you all know about nutrition, for everything, from nutrition to lung cancer, risk hpv, preventing skin cancer, breast and prostate colorectal cancer awareness. So all of the Curricula start with you know the identification of the problem. What is it, what is cancer? What is cancer in this particular area? What it? What are the risks? How can you reduce your risks? We link people to care when they need it, and we talk about screening for all of those different cancers. I can scroll down because there's more so. This is basically who we are. What we're offering at this point, we are happy to take suggestions from different organizations. We were doing all of this work in person and since March we have not but we're putting on some really great workshops and webinars for anyone who wants them. Basically, so I just wanted to let you all know it's my information on this. No, that's the old information, so you can take down my email address, which is ar 281 at columbia.edu. You can write to me anytime. If you would like to know more information or you can ask questions now. Well, you should you should email the presentation to me, so I can send it around to the committee members. It's not that easy to read at all. You know it's a lot, but so what you, what you're inviting us to do is to distribute the information so that community groups will know that they can take advantage of the workshops that you're offering and you're able to offer them remotely. At this point, at this point yep and when we can come back in person, we will do so. Okay, there's a great article in cure magazine. Cancer updates research and education. Called food fight. Could fasting save your life with special diets? Cancer treatments could be more effective and tolerable for the little article. It's a great magazine. You probably have it in your office all right all right. Are there any questions for Andrea all right, very good, so send me the presentation and we'll send it and I'll send it around to the committee. Members will do. Thank you very much. Steve. Okay, thank you. Thank you great to see you again all right stay in touch. Definitely I love seeing the pictures of you with the boy and the dog. That's all I do. I know thanks we're, Facebook, friends. Okay, all right next is an update from the Washington Heights Corner Project Alexandra Moreno, the program innovation manager, Adrian Feliciano, director of harm reduction services and executive director Sam Rivera they're joined by Gail Goldstein from the New York City Department of Health and Mental Hygiene, alexandra hello, everyone, hi Steve. Thank you for allowing us time to address the board. Today I have a visual to go along with our presentation. May share: go ahead. Okay, I just need permission sally. Is that a new hand of yours or an old one? Okay, now can everyone see? I can okay, I'm going to hand it off to adrian our director of harm reduction services to begin yes, first good evening. Thank you so much for having us here today really appreciate you taking the time to be here and to have us on the agenda for this evening. My name is adrian Feliciano and this evening we're going to be presenting on a proposal for a temporary solution for housing our program. So this is a presentation that we call the village, and I would like to begin by introducing our team, our leadership team. Since June of this year, we have been under new executive leadership by Sam Rivera who's actually with us now Sam, if you'd like to take a moment to just introduce yourself to the Community, Board sure, hello, everyone, I'm Sam Rivera. First, I want to thank you for allowing us to participate in your meeting. It was a pleasure to join a little early and watch the interaction and how committed you are to your community. I really appreciate that, so it just makes me more excited about the work, we're doing and being a partner with you guys and everything we're doing so again. I just want to acknowledge the commitment, I'm sure you know it because you live it, but the city and watch it was pretty cool. Pretty amazing, so we'll make sure that to everyone that they're being represented well, so I've been at the organization since June it's been pretty exciting but also very challenging, and it's really been a pleasure to be a part of the Washington Nights Community, I'm born and raised on the low East side of Manhattan. So I know many of the experiences that you guys are going through. We went through in the lower East side many years ago, so I'll leave it there. It's been a long night and asked the team to continue the presentation and I'm available for questions as well. Of course, and I'll be happy to share my information with you all. Thank you. Well, I just I just have to say that as someone who remembers the corner project beginning with one woman who I think worked out of her knapsack, it's somewhat amazing to see that you now have 26 full- time staff. Thank you yeah. You may not have a location, but you have somebody yeah. Well, you have a location and you have the trailer, but I forget her name right now, but think that what she started some years ago has now grown to 26 people god. If they, if we yes, they will come yeah right. Yeah. Absolutely thank you! Steve! You can actually take that's pretty much part of my pitch but yeah. We started off very small. That was actually Jamie Favaro, who started the organization with Us way back in 2005 out of the George Washington Bridge Terminal, and now we're compromised or we're composed of a large set of staff that are led by Sam Kailyn and myself, who are co- directors of the program and Alex who was a program, innovation manager, and we have public safety and outreach team which is out collecting. You know syringe letter and engaging folks in the community. We have case managers who are doing linkage to care HIV and Hepatitis C testing benefits and housing navigation. We have six harm reduction and syringe exchange folks, who are on front lines meeting with our folks, educating them and providing supplies and, of course, our data and program management program. So to speak on the other programs, like I said before, our health services programming, which is really partnered and really strengthened by our partnership and through New York, Presbyterian and Montefiore hospital. So we through that we provide intensive clinical care coordination, HIV and Hepatitis C testing. As I said before, and community engagement with which I said before, which includes our syringe, cleanup and public education on public injection diversion which goes into our overdose prevention, harm reduction, programming and support services, which is really a huge part of of our programming drop- in services and hygiene services, which includes our respite care and day shelter, which has really been something that has taken an impact since we have lost our space so just to go into it a bit in 2018. As many of you know, we did lose our space, which forced us to shift our programming into the vehicles that we said that were mentioned by Steve earlier, and that really displaced our participants from the facility that we had. It was an eight thousand square foot facility and it's really been reduced now to three outreach vehicles and all of these services are crammed into those vehicles. So we provide the case management services, which is which has really fallen by 60 percent through this crisis, while the crisis intervention that we've done has actually increased by 339 percent, so as a direct reflection of our work being more reactive to the case, as opposed to being proactive to it and it's hugely impacted by the loss of space. And of course this has increased. You know: community complaints of public injection of syringe litter- and I know participants of course have lost their stable space and their location where they can have all of their basic needs met. The Covid-19 has just really impacted this further and you know further restricting our ability to use the space adequately and you know, having to socially distant and making sure that every that all of our vehicles are safe for our participants to enter. So we do have a proposal for a solution and Alex will lead us into what that looks like thank you, Adrian, and I do want to share to give a little bit more detail about these numbers that we're seeing here on the screen this 339 increase in crisis intervention services. This is specif specifically refers to our internal data collection, on how many syringes we've been collecting on the street. So when we had a building and we were able to sort of you know house our participants versus when they were displaced into the street in the following year, we had a 106 increase in the number of syringes that we saw outside alone. We went from. We have a public safety team who dust sweeps of the area and Highbridge park picking up syringes safely and to give you know a direct number in the year while we were housed, we had we collected 191,000 syringes versus the 395,000 we collected once our participants were displaced and the problems were pushed outside further crisis intervention. Data numbers include naloxone distributing naloxone within the community. People are looking for a direct crisis response, as opposed to the 60 hit that our case management intervention services took. So that's our our HIV and hepatitis testing. That's our long- term case management, services, housing, long- term treatment services. We found that when people do not have a safe space to touch down and spend a confidential time with their case manager, they are not able to access these services as frequently or sustain them long term. So that's a little bit of insight to this graph that you're seeing right here now. As mentioned, we do have a solution that we've proposed throughout these two years. We have been looking for a permanent space, but it's been very difficult. Looking within our catchment area and given the barriers that we face as an overdose prevention center, we have certain limitations to where we can be placed. That being said, winters are very difficult working out of our mobile sites, because we just do not have the physical space to have participants nor staff, especially safely throughout the pandemic. So we desperately needed a solution while we find a building- and that is where this interim solution comes up and we call this the village. This is a interim emergency response solution to operate services out of what we call a village of five CDC compliant street side trailers, and this is placed alongside a block of Amsterdam avenue between 177Th and 178Th Street. This is a block south of our current location, and the specific area fits all of our qualifications, as directed by the city to where we can be placed. Now, this model will take us from a winnebago and two small rental rv vehicles to, as you can see here, an expansion of five trailers. Now this model will allow for a 150 increase in services. So this includes a resumption of suspended services such as HIV testing, long- term treatment, coordination, housing and shelter, assistance, food services, benefits, navigation, advocacy and job seeking support, we'll be able to scale up our health care and critical case management services using telehealth and following physical discipline guidelines. In fact, we have a comprehensive plan here for social distancing that adheres to guidelines that is constantly being updated by DOHMH for how to reopen drop in centers. So we will be able to have a bathroom trailer here that will give participants staff and the community access to sanitized bathrooms and running water. I'm sure many of you know many of the public restrooms in the community have been shut down and in fact, in the area where we are working now, 179 in Amsterdam, there are none and we do not have any on our vehicles. So obviously working no one wants to work in a pandemic without running water, so we've had to source hand washing stations in the meantime. But this expansion will allow us to have bathrooms, to have sinks, to have running water on sites not only available to our staff and participants but available to the larger community, socially distanced and regularly sanitized, we'll also have Covid-19 services available to the community at large. That's distribution of free PPE, masks, sanitizer temperature checks and cover 19 education and referrals. A few additional benefits will have a 100 increase in staffing at the temporary site, so this will include case managers, Healthcare providers, outreach team and security all there to serve participants and to engage the community again. Like I mentioned, we have a full line of Covid-19 prevention protocols, including physical distancing and daily sanitation, we'll be able to increase our service referral and health care access, which will then result in sort of a decreased fallout that we'll see in the community. Greater access to these kinds of services means that within our population we'll see a decreased rate of disease transmission, we'll see decreased rates of public injection of public urination and defecation and related quality of life concerns throughout our neighborhood. We'll have a dedicated security presence and clean up around the village, and this will also allow us to have a 60 increase in hours of operation. Now this model will be time limited. It is only an interim solution and it will be scaled down as a permanent location is secured, with an overlap and transition period to ensure continuity of our services will be authorized by a permit from the street activity permit office from the mayor's Office of city- wide events and coordination management, and this permit must be authorized following community consultation every month, as you saw prior on the plan we have been situated so as we will not be obstructing any public sidewalks, we will not be obstructing bike lanes or any park access points and we've been authorized by the State Department of Health following oversight and guidance from the city. Finally, we do have we do want to maintain community engagement and transparency with the community throughout this whole entire process. To that respect, we offer a public safety hotline that operates 24 7, and the number is here. This is for the community to reach out to with any syringe litter or public safety problems, or basically, a direct line to the agency for any questions and to further transparency and community engagement. We also have a monthly community advisory board to inform the implementation of this project and to deepen our relationship with the community. Our contact information is here. If anyone wants to have wants to get in touch after this, and we can open for questions at this time yeah. We have apparently several questions, but before I turn it, let me ask you: I'm I'm going to want to see the powerpoint, because it was difficult to pick up on everything so would appreciate if you could send it to me and I'll, send it around again today and I apologize it's a lot to get through in this short time. Absolutely we'll send you more information, but let me ask you at one point: we thought that we might have been able to broker a something for you with. I forget the name of the Drug Rehab program that moved to around the corner on Amsterdam Avenue from 180Th Street. Maybe they moved within a block on Amsterdam down to 179th street and they told us they had a floor or more that they were willing to sublease to you did. Did you ever? Did you ever enter into discussions with them to see if that was a doable space for you? Yes, we actually did view the space and we went through it with our consultants, but because of there was an issue with the entrance of the of the building and it being a shared, a shared entrance with another program. It was not necessarily seen suitable for our facility. What was the name of that drug program that was upstart? Oh yeah, they had another name, and then they changed it all right. So that turned out not to be doable all right. We have some questions. Catherine Diaz, hi, hey everyone, hi Jan. I have two questions so one just to confirm from the map. Is it between 177 and like where the bus stop is or more closer to 178? It is on Amsterdam on the east side of Amsterdam, between 177 and 178.. There's. No, it's opposite. The bus stop yeah! That's exactly what I meant, but it is taking parking spots. It is taking parking spots right, and so I do not want to like diminish the role of and one I just want to. Thank you for the presentation. I thought it was an excellent presentation and we all know the urgency and the importance of y' all having space, and particularly in my capacity when I was working with you guys. What I do want to highlight is, I think, the importance and not necessarily diminish the importance of the board but, for example, like what is this same presentation going to happen at the daycare at NYCHA across the street at the clinic and the co- op across the street, because you know on the board. We understand the importance and a lot of that gets lost in translation, because these presentations do not make it to the people on the block and given that, for example, that the timeline is all the way through June you know and given covey. We do not necessarily know what's going to happen next year, even though it's not blocking the park. That park has multiple tournaments. That brings huge crowds. It is you know, a regular place for folks to hang out, and I do think that it is essential to not have repeats of like the last two years to be able to. You know really bring in those like deep presentations and conversations, and I say that especially around parking is a hot topic on the board and around there. It is incredibly difficult to find parking. So I just I share that and I guess it's more of a comment less than a question so yeah. No, I I absolutely hear you a couple of points, so I did mention we have our monthly community Advisory Board and we are doing continuous outreach to the community. So this is not. This is not just larger stakeholders that care about the syringular issue in our community. It's local business owners on Amsterdam, it's parent advocates on the the schools on 182Nd and 183Rd. It's people residents who live on Laurel, Hill, terrace down the block from our from our service sites, so we're actively engaging folks through our public safety team who goes out into the community every single day for sweeps. We engage folks that way we engage the folks who reach out to us through our public safety hotline and otherwise, and we invite them all to our community Advisory Board for feedback we're proactive about reaching out to the businesses nearby. So if you have any specific contacts, you know absolutely. These are the folks that we want to hear from, and yes, we do share the presentation with our community Advisory board members. This. We did the presentation just about about two weeks ago at our at our last event, and we do have it at the end of every month and it is welcome to everyone in the community because we do want to keep people informed as the process goes as mentioned. We want monthly community consultation, because that is important for our permit approval. We want to keep the community informed and in conjunction with how we move- and that being said, it is a temporary project. So we are kept at nine months in this area and you know we have to do our due diligence on our end in regards to our permanent space search. So we, you know, we do have a cap, we will be following monthly community consultation and we hope that this you know we can build on that transparency with the community. This way, I'm sorry Alexander did you say that this would only last for nine months. Yes, currently, as we have been working it out with the state and the city, we have been capped at this location for nine months and what is the timetable is as to when you plan to begin so at this moment we are just in the permit application process, and that is going in for submission this month and after that you know we pending permit approval will be we'll be able to install. So this is a perfect application process to to the city for the the street activity permit or the office of community. I forget what it's called Ocmc, something like that. This is s- a-, p- O street activity permit office at the mayor's office as well as d-, O- b, right, all right, so you're submitting permits to them. So this could happen relatively soon then, in the next couple of months. Yes, yeah, okay, tanya, you have a question yeah, hi alexandra how you doing. I just have a couple questions. One is just: are there any other models that you know of any other places that have done this similar models and how you know did that work out? The other question is: what will be the criteria? I know you said you have to monthly get this permit renewed. What will be the criteria that will determine whether you will be renewed? What are some of the regulations or the criteria, because one of the things that I'll be concerned about is that if one little complaint comes in or if something happens, then that then you could just end up shut down pretty quickly. So I want to know like what will that entail in terms of the approval every month? What could what things could impact that that approval I'll? Let gail speak a little bit more to this as our city partner, but this is like I mentioned it is undergoing guidance from the city, so this feedback is pertinent to the monthly permit approval from the sample office. Hi, everyone, I'm sorry I must I may have missed this. The permit needs to be renewed every month. Yes, sir, okay yeah, so the goal behind that is so that if there are problems with the site- and there is sort of you know significant issues- I think there'll be a variety of people to who can who would be weighing in then the city would reconsider that whether or not the permit continues we have not put. We have not developed any specific criteria yet, but it's something we've been talking with the mayor's office about all right. That was Gail Goldstein. Yes, sorry are there any other models? Has this been done in the other place? Do you know that these models there have been other models but not specific to syringe exchange so right, one of those like testing emergency models, we've sort of modeled it after that, in a sense, but for overdose prevention. Centers, it's a little bit unprecedented. Okay sally! You have a question sally yeah. It takes me a while to find my unmute great presentation, I'm thrilled that y' all are back, however, temporary and my questions. Just how often do the community advisory boards meet and how does one become involved? I just did a cleanup in Highbridge park and yeah. I mean I think the location is actually ideal given what's going on, I mean there, you go over that fence and there are people living there. You know we did not destroy any of those homes, but I can imagine just on the other side of that fence. You're collecting a lot we found now when I'm doing cleanups. I do have a syringe container that we can put them in, but we that's our first warning to anyone on our cleanups, because we have kids and families and stuff and do not touch that's when you alert the site leader and we can get in touch with you guys. My question is: that's a lot of infrastructure. So are you renting those trailers? Okay? Yes, so let me just start from the top. The Community Advisory Board meets on a monthly basis and I can send the next one meet at the end of November and I can send the invitation to Steve, so he can disseminate it to the people here. Yeah, okay, we are, these are rental. These are rental trailers, they're quickly to be installed quickly, to be taken down and are rented by month. Okay and then my last question is: what can we do to help? We we've passed resolutions in the past, supporting your location, which we hope for on by the bus terminal. What can we do to help? Do you need anything supported your application? Well, we are hoping to take this now to the General Board at the end of the month. What would happen is that it would come from this. The this committee would be the committee to pass a resolution and then it would be presented to the General Board for approval at the monthly meeting. If we can cobble something together and I'm not sure- that's obviously steve, if that's a possibility, we can just resurrect our old resolution in support of this temporary plan and vote on it. As a community- and then we have, I did not realize that this was something that was going to require a motion, and I would like to see how did Ellie Wayne did the chair of our board agree to to have you give the presentation at our board meeting, so we attempted to get on the October on the October meeting, but we're only able to get time on the public forum so yeah exactly so. We went to you guys, hoping that you could help us get on the next one. Well, I think the better thing for us to do would be a resolution, and then that resolution is presented to the board and then you can have you can't have two to three minutes. I think it says three, but now it's two: it's just it's a confusing handout or the confusing visual, because it says two in words and three in parentheses, or vice versa. Anyway, there's a provision by which the chair can extend it and he can also decide to just allow somebody to make a special presentation outside of the normal bounce of the public session and Steve. You could do that at the executive committee is fair on La's R2 yeah. I tell you because this also kind of sort of cuts across our committee and traffic and transportation yeah, but the health care aspect I mean the opioid crisis is only getting worse and I know we've heard some, I'm sorry the market priorities we just passed speak to this at all, I'm sorry down or what did you say? Do the budget priorities we just passed speak to this at all. Yes, they do mental health and homelessness, mental health community as double trouble. People with a mental health diagnosis and a substance use disorder, and it is a big problem. We had a separate one for increasing substance abuse services in the community, including specifically opioid overdose, prevention, education and funding for syringe, cleanups and collections, and that ended up as the number six priority overall for the board. So we can refer to that in our region. Sorry Steve! I know I want to respect turns, but I do think that this is significant enough, as we've had in the past, with like other organizations that they present at the beginning of the meeting. So I'm sure we can just send Ellie an email, a five- minute presentation so that board members can ask the question outside of the committee report, because I do think it's significant. I agree with you. Could I answer your question please, but once I daryl was Daryl, did you already ask your question? I did not ask my question yet no, I guess my question was- and this goes back to what catherine was saying earlier. This is right next to Highbridge park and did you reach out to Jennifer Hoppa, who you know, runs northern Manhattan parks for the for the Parks Department and then there's also the head of the hybrid direct center? If you've done outreach to them not parks, we did collaborate with parks early on in the project, because there have been many different variations of the projects placements and such so. They are aware, but not this, the specific person that you mentioned, because I can't see it being problematic for part absolutely. We did go through whether we would have to permit for parks and everything, and it turned out that we did not have to now. As far as the Rec center we I mean we are just a block up of this area, so we do already service around the Rec center and our participants do generally stay in that and live in that area already. So we are familiar with the Rec center and part of the community engagement process that we want to do is engage all of those institutions near us so that they know who we are. They know the services that we offer and our public safety team is there to be of service of them as far as cleanups go. We want to offer that as a resource to anyone who expresses the need and not only that, we're being proactive about going out there and asking who needs help. I mean, as long as I think, there's a point person at least that they could. You know call immediately if there's a problem that would be great and I just think one other thing. I think you have to go beyond that in the interest of full disclosure. You know I work for the Parks Department and, and I I'm the Manhattan chief of staff, and so I also work closely with Jennifer Harper, and I think it is vital if I can speak wearing both of my hats, that be, you may not be on Park's property technically, but in effect you are- and I think it's vital that you have a clear working relationship with the Parks Department. So I would absolutely encourage you to sit down and have a discussion with Jennifer and and her staff, because you need to have a working relationship if this is going to work at all in our mutual interests and then Steve. While you had your other hat on, I'm going to put my other city agency hat on for a second, I work for the city Commission on Human rights, and I understand you all have a workforce development program. I think Adrian was talking about. One of the provisions of the human rights law is that people in employment can not be discriminated against under the disability provision for being in some sort of for having drug addiction, if there's a caveat, if they're in active recovery. So you know I'd be happy to talk to you all more about that. If you want to learn more about that, if I can also just mention, we've been working, obviously with Washington Knight's, corner project and parks very closely for a long time, they've actually been key partners in helping to clean up the parks. I'm sure you guys know that, so we can help facilitate that kind of a meeting so that the Manhattan parks are fully aware of the plan. Yeah, all right, barbara, you have a question yeah. I had a question about the what you called your bathroom facility. First of all, you first of all said it would be well supervised. What does that mean? Second of all, since you would be servicing both men and women and other? How would that be handled in a proper manner? And third, one thing: that's been more successful in getting people into longer term services has been also to offer shower facilities, and you do not seem to offer that why not- or maybe you should so- those are my put my sort of questions. Okay, so each trailer has a crowd. Control supervisor outside this person will be doing Covid-19 screenings, because anyone who comes onto our vehicle does need to. You know, be screened for symptoms, or else they are not allowed on. That is part of our Covid-19 safety guideline. So in that respect it is a controlled entry. It is a limited number of people who can come inside only two people at a time and there are separate entrances to the bathrooms individual entrances now, as far as having showers would absolutely love showers, but we had to limit the plan bluetooth space due to budgeting due to several reasons we, you know we were able to sort of scale up most of our services, but showers is one thing, that's sort of at the tippy top that we were not able to fit in now, given the temporary status of these trailers. However, if we are able to scale that up throughout the duration of this day, we can absolutely do that and just switch out this restroom trailer with a combo trailer as we you know, we did try to get one before, but you know with especially with Covid-19 many of these bathroom rentals and shower services are being used right now. They do not have stock because they're being used by temporary sites, temporary Covid-19 emergency sites, so they are difficult to get, especially as far as showers go, but it's certainly something that we would that we want to have, and we recognize how important it is to have it. Did you say that each trailer will have bathrooms, so we have not each trailer. We do have half bats in two of our service trailers, but there will be a separate bathroom trailer that has multiple private stations, but are they separated? Because, frankly, you know these sort of trait these sort of public bathrooms are often the site of mischief and so you're saying that the supervisor would be outside not inside. That's not that's, not a bathroom attendant there. No, there will be outside supervision and inside supervision. We will have the screener for Covid-19 screening on the outside and there will be a bathroom attendant indoors. Only two people are allowed inside the bathroom at one time now. What kind of janitorial and maintenance service do you have during the day for both the syringe, the maintenance, the service area and also the bathroom area? Yes, absolutely. We have a full suite of safety and sanitation guidelines, especially as it relates to the pandemic. After every use of the bathroom, it will be sanitized before the next person goes in. Our staff is trained on how to do that and to top it off. They do a deeper sanitation in the morning and at the end, and we will have a separate cleaning service who will come every day to do professional, sanitization and garbage collection. So, yes, we do have a plan: okay, good, okay, all right! Catherine! Are you asking more questions? It's Betty. I wanted to ask what, if you appropriate for her again, I can't we can't hear you can't hear me. Can you hear me now? Yes, okay, so the question I have is: would it be appropriate for them to do a presentation for traffic and transportation this month, since it involves a very sensitive topic of removal of graphics in parking spots? And if you wanted to do a joint resolution with traffic and transportation would be appropriate for her to do a presentation and get that information out of these two more people on the community board, the question yeah actually does traffic and transportation. When do they meet? Do they meet next week they meet on a Monday, and I want I do not have the calendar in front of me. It might be the 9th yeah. It would probably would be a good idea to try to get on there. They already met for this month. They met last this Monday. They already met all right all right. Well, maybe they should be on the agenda for the for the December meeting for traffic and transportation, or we can invite them to Army. Well we're having our meeting now, damn it yeah. No, I think you should get on the agenda for them. Next meeting. Welcome to the meeting sally dammit, all right, I'm cooking dinner, all right, any other questions, oh god! So Steve can you let me or is: can you just let us and also corner project know in terms of if next steps is that they're going to present either at the general meeting and are we drafting a resolution or is that going to get drafted in time for the executive meeting? I would be happy to draft a resolution yeah, but when we get a talking, whether we're going to be able to vote on it, well you get you're going to have to. Could it be done from the floor like? Can it be? Can that is that something that can be done at the meeting? Well? Theoretically, yes, yeah, it could be, could be brought up under new business yeah. That's why I was wondering that could be another option just to do it then yep. That will give me a little more time yeah, but I think more people have to hear about this, because you know you know what my fear is. We did a resolution for the site at the bus terminal and we put that we got that through with some resistance at the full board meeting, and then I almost feel as though it got ambushed. Somehow it did, then the whole thing went awry and even p. You know. Well, then, why do not? I do it in time for the executive committee and then at least all the chairs can weigh in yeah. That would be better. Maybe they should have a presentation at the executive committee. I will. I will draft that and send it around. I do not know, catherine. What do you think of the idea of having to make a presentation at the executive committee? I think, if possible, we can send the presentation in the materials for the executive meeting and make sure we can put it on the agenda for the general meeting and let everyone and send it and Paula's on the call so making sure that we send it with sufficient time for folks to review it, because it will be a repeat of the terminal yeah. But so definitely, I think by the executive meeting representatives from the corner project zoom in to the executive committee meeting, because questions will arise. I would rather have the questions come at that meeting than the first time the questions are asked being at the general meeting right, but I will add, you know sally, like a lot of folks do not necessarily attend. The executive committee are not necessarily in the loop in that way. So I think a two- fold approach is appropriate, but for sure, as long as we can circle the presentation and forward it to folks before the general meeting, so they have an opportunity to get aware with it before you know, because it will dominate the majority of the meeting this month and that's just you know. We know, we know our people though, but I think it would be better if we could get a resolution through the executive committee. I agree so I think it would carry more weight. So catherine, I think maybe the two of us could talk to Ellie about this yeah, absolutely, okay, all right, very good. So alexander you're going to send me the you'll, send me the powerpoint tomorrow or tonight, and Steve you'll distribute to the committee. So I can yes, Steve I'll, be able to send you an info sheet. Okay, very good, all right! Thank you all right! Thank you. Thank you. Okay, Mr Rivera. I look forward to meeting you someday in real life. Yes, I want to make one quick comment. Can you guys hear me? Yes yeah, so you know I definitely I'm sensitive we're sensitive to the question. Catherine brought up and a number of other people chimed in about regarding parking space, and we know how important that is. So just so, you know, while we're doing we're, putting a lot of energy into opening the village, it is very important and priority for us to find a permanent space and Steve. You mentioned that earlier about that other space, and we really appreciate that so we're there. You know really. The goal is not to even be there the full nine months, but what about the? What about the old space that drug program had that they that they moved out of on 180Th Street? Did you look into its availability and whether it might be suitable? We definitely inquired and I'm reaching out to the having conversations with the trying to get and have conversations with the landlord of that space yeah. I tell you that more, I think about it. The more I think you know here, yeah you have a space that was used for I do not know how long maybe decades for a similar population an overlapping population. So it's going to be hard for people to say that you're, maybe intruding or doing something- that's not already been done in that particular space or in that particular building. And so you know you might have an argument. You might have less of an argument than you than you would have elsewhere. I would go after. I would go after that space yeah are you? Are you do you have access to my emails, because these are the exact conversations I've been having for the past month? So this is very interesting. I'm glad we're on the same page, but and I'm telling you the exact conversations about space yeah. I think that space would make a lot of sense with the December meeting is not that where we did the board elections, or am I missing messing up my dates? No, that's yeah! That's the board of elections right! So that's an even more important reason to do this. At the executive committee yeah and just fyi, someone will probably ask how many parking spaces exactly. Will this take up. So if you can find out that information 10 it's about 10., okay, great, I I'm sorry, but in my frame of my frame of reference, the parking is is not the most important issue here. That's why you're not sharing the transportation yeah! That's yeah! That's right! Okay, but there are more nine months. It's nine months. It's like a construction project. Okay, there are much more important issues at play here. Okay, all right, we'll be in touch. Thank you. Thank you guys so much. Thank you. Everybody have a great night. Thank you. Thank you, nice to see everybody all right next on the agenda. I probably nobody had a chance to look at it, but just before seven o'clock, I emailed around a proposed resolution on the fireworks issue. I could. I could read it yeah and just a gentle time check it's about 9:15. right. Well, we're coming down to the end of the meeting, just share it on the screen. Yeah, you can share it on the screen. Steve. Okay! I do not know how to do that. Payola I sent it to you. Can you do it? Okay, let me try. All I can see is as a hand up. I do not know if that's old or a new question, Barbara, what your hand is up. Did you have a question? No, I should take it down. Sorry, that's! Okay! There we go! Thank you! Okay, oh great, all, right! Daryl, now your hand is up. I should take my own advice. Yeah you should there is no reasonable standard there. It is simply illegal. Well, there's a there's, a reasonable noise standard, that's the basis of the noise code. Okay! Well, I was saying in excess of any reasonable noise standard, because you're implying in that language there's that we sort of live with, whereas okay, very good, okay, the first, whereas the use and sale of fireworks is illegal in New York City. But despite this fact, it has been become customary for people to settle fireworks in the period leading up to the fourth of July in the streets of the city, including in Washington Heights inward okay, in this in the second, whereas you say lasting beyond July 4th I'd, say beginning well before the fourth of July. You know you know we needed early June, yeah, yes and lasting well beyond July 4th, okay, beginning in early June, I'd say in May I was it was. It was may when it started late, may, okay, beginning late from memorial day or lasting well beyond July 4th lasting well beyond. Okay, that was like the first, whereas is what usually happens, and usually it starts a week or two before July 4th and beyond the second, whereas is what was went on during this summer. So the first whereas refers to summer's past right? Yes again, that was that yeah, that's the point of it, so it should be often until four or five A.M. Instead of saying this last summer, you could say in the second one this past summer, or you could say in summer, 2020 yeah good. Well, this past summer, right yeah, it's been a blast. I hope it is not the last summer we'll ever. You can also note that it has been increasingly getting worse. Just that escalation is important to make clear and also, I think you should state the number of 311 complaints, because we had the most in all of Manhattan, oh yeah yeah. Let we can, I think, that's important, because it was like that's a good one, tens of thousands, yeah and also the data well once one second one at a time tanya, do you have that number? I do yes, I can get that to you I'll, get that I'll. Look it up as soon as do you want me to give it to you right now, no dude, you can say it later I'll, send it to you. Yes, I have that, and the other thing I would add was here: the 311 is the native study that was done by the respectful decimals level, where they said x percent of which 69 percent of which were dismissed without action. I mean, as long as we're being saying, we need increased enforcement. We need to stress that it was not enforced. In fact, 311, which was our way to report, was basically closing them out within minutes. Well, let me ask you hearing about that. Like do we want to mention specifically that NYPD has not been yes well, you know I did not. I did not want to really attack them because well then, just put the data in the data weeks yeah right so is it? Is it really? Is it really only 69? I hate to say this: is it only 69 it might be higher? I can get the data from that group. Okay, very good, and speaking of the group, though too, like that was formed this year. It might be good to include like how much that group grew just within a couple months. Good point: thanks to tonya another, I mean how many people are in it now. A lot like, I think, over 800 or so about 900, something yeah. Okay, all right next is excessive. Levels of noise are known to impact the health and well- being of affected individuals, which is why New York City developed its precedent, setting noise code to restrict unreasonable levels of noise throughout the city and whereas the fireworks in our community last summer were far in excess of any reasonable noise standard and adversely affected the quality of life of the majority of residents life in health. What the quality of life in health, because this is we want to make sure that this is not just relegated to a quality of life thing. It's a public health issue, okay, but I want to make it clear that we're talking on behalf of the majority of residents, okay, the quality of life and health. Actually, I want to say I want to say the overwhelming majority. Okay, then we should put the public health point and say the fireworks were also significant public health issue in our community. It is believed that the fireworks cause at least one death. Well, that's the next paragraph right. You can put the public health in that one as a first sentence. Well, it goes beyond just that, though, all right, I can work it in okay, all right, so it is believed that the fireworks caused at least one death Wanda. Barely Ortiz has reported that her eighty- three-, year- old mother, Belkis Pirelli, with whom she lived on Academy Street, had a panic attack because of the fireworks outside her building on July 5th, which turned into a heart attack and a week later she passed away and whereas fireworks also caused a destructive fire in a ground floor apartments at 184, Nagel Avenue on July 5th, in which a family lost all its possessions and a similar incident reportedly occurred on West 157Th Street. That same day now, therefore, be it resolved community board. 12 Manhattan calls upon the mayor to give this issue the highest priority in 2021 and to bolster interagency efforts to prevent the illegal sale and use of fireworks within the city and to increase efforts to stop fireworks from being brought into the city from nearby states. What about enforcement of people who are doing it? Does that have a role? Do you think and in this resolution, because for us it really was. You know yes, you're correct people were bringing. There was a lot of the illegal bringing these legal fireworks in, but it was their end though then it's like. What do we do so it becomes an issue of there needs to be some enforcement apart, where the people that are doing this here once it enters the space that needs to be dealt with now, it's really up to you know like you can say what you want that to look like, but it there should be some sort of way to stop that. No, that was my intent. You know I dashed this thing off, unfortunately, just in a short time, and if you can, if you see by the heading of what I gave the resolution, my original intention was to focus on increased enforcement. So, yes that belongs here. Well, I have to really you know, spoil the party a little bit in terms of enforcement. You have to see what you know. What is what someone can be charged with for illegal fireworks? It's not much. I believe it's really almost just a disorderly conduct summons, which has now been put down to almost like one of these one dollar summons. It's not much. I want to be clear what I was talking about, and I hear you barbara you're right because that's not a deterrent. I guess what I was talking about. I was not looking at enforcement only being harming you know like saying giving somebody a summons, but also like enforcement, meaning that when we see this happening, that there are efforts to break that up, that it's not just about okay, we're going to hand out a summons, but how do we when we see well? We know there are hot spots right. How do we enforce those hot spots, so this activity won't even get started up right because a lot of times the police will literally drive right by as they're lighting fireworks right in the street, so where's the? Where is the enforcement in that right? And what could that look like other than I agree with Barbara like these summonses are not deterrent so because so many of these things have been fully downgraded to non totally non- criminal. Listen, I would be. I would be happy if they just confiscated the fireworks. Yes, absolutely yeah, but when they do it, they do not take out many the morning guacamole thing they take out their roman candles or whatever light it up and then dance away. Somebody needs to mute themselves because I can hear you talking he's over all right. Cass. Do you have a question? I yeah. I wonder if tanya are you kind of alluding more like preventative efforts over the word enforcement, because what comes to mind in what you're sharing is kind of like, for example, let's talk about the FDNY and the hydrants, and obviously we know hydrants. You know that that's part of a culture like officially but at the FDNY has done a lot of changes over the years and education and more targeting around what the opening of the water with the pumps. So I do not know if you're kind of like thinking along that direction in terms of like preventative work over necessarily like a summons and arrest and increase policing. When we of course are talking about defunding and removing cops, you know yeah, and I think when I mean it's right, it's what I mean if yes, prevention, but prevention in a way where we can cut the activity off at the knees right. So we know that there are hot spots. So why can't we have more? Where can we oh, I got it steve. Where can we engage? Maybe the park's pep officers? You know what I mean like some Pla, some presence that can some way deter, or if we see it, we can have a way for the patrol those hot spot areas or problem areas, and so there's a presence there that will deter some of that behavior. Some of that activity. Well, pep officers can only be inside parks. They can't be, for example, on Schumann Avenue, where they tend to say. The job here has to be done by the pd yeah. It has to be done by the pd so yeah I get you, for example, auxiliary cops. We do not have to hash out these kinds of details right now. We just have to indicate that we expect them to do better and increased enforcement right. I am I'm going to meet with the people who did the study, and so I will have a couple whereases that reflect the specific findings. That will add some facts to okay, which story? Is this the one on the three one calls? What was the answer? What was not and if there's anything else, that what Daryl suggested about the formation that group and how quickly it grew, I will meet with them tomorrow morning and get something to you by the end of the day, very good. Okay, there are a couple of questions here Steve. I would like to say in this part of the reason that it was so bad this year is that the fireworks were able to get into the city. The big reason for that was that in prior years, we, the NYPD, used to send out anti- crime officers into the poconos, and they would stay out there and watch these sites where the fireworks were sold and they would watch for New York plates that bought large quantities of fireworks. Then they would follow these vans back into the city and as soon as they cross the Lincoln, Tunnel or George Washington Bridge, they would bust the vans and they would confiscate large amounts of fireworks and that really cut it off at the source with the disbanding of the anti- crime units. None of this was done in the poconos last summer and it's also expensive to have you know: officers twiddling their thumbs, basically surveilling these various sites that sell fireworks out in the poconos. So that's expensive. You know to have several officers all scattered around the poconos and with the defunding of the police. You do not have that anymore. So I think you have to have a resume part of this resolution. When you call for increased enforcement, we also have to call for the funding of it, especially for funding so that we have squads and officers available in out of state to be able to intercept, because that's what I do not really that's opening up a Pandora's box. I do want to say that they need to do those kinds of surveillance activities and they do have to stop it at the source and track people who are bringing it into the city. I like that idea I do not want to. I do not want to veer off into this whole issue about funding the police that they should just find the money, but what I do Steve. I just want to say one thing: I just want to be clear, like people who are doing this, I'm not one of those people that say when you commit illegal activity that you should not pay consequences. I just want to be clear that people have been died. People of buildings have been burned, people could have died in that building on Nagel. So what I'm saying is that I am not by any means suggesting that we should go easy on people who are out there, and these are not kids. These are grown people out there. Some of these people are grown men out there doing this. We should not it's not that we I'm not saying at all that they should not suffer consequences. If you, what you're doing contributes to a building being burned. Where was the? Where was the accountability for that so yeah? I want to know whether anyone was ever arrested and they should have been, and I just want to be clear that when I say the summonses and we're talking about summons is not effective. Yes, they're right they're not affected, but what can we do where it will be affected and we're not saying you know, people need to understand that this is a dangerous activity like you're, saying Steve in this resolution. This is a danger activity, real consequences and closest. Where do we ha right boys? These are not firecrackers and sparklers. These are grenadines very dangerous. I was not. You can't walk out of your house, I mean on fourth of July. I filmed all of what I mean the Emerson playground. It was covered with detrios from the night before and it was terrifying you could not go outside. So you, if you wanted to haul all right. Listen, we have. We have two members of the public who want to speak Bernard, Grobman, Maria, Garcia, okay, good, I want to say you can't talk about requesting something and not wanting to have it funded. I we do not need to plan an entire strategy. We just want the issue addressed. What people can we can? We can we upgrade Bernard, Brahman and Maria Garcia? Yes, and do you need me to still share the screen or I can take it, can we unshare it yeah and Steve? Can you send me the send out the corrected one after this thing, so I know okay, good yeah, I'm not going to send it out to you. Send me your stuff. I do not remember all the changes that were made. That's okay! I just I made notes of them. Okay, can you just screen take a shot of your notes or screen share your notes? Oh god, you can't even read this thing: okay type them in tonight I sent you the last email. What hey Steve? Why are we waiting for bernard to get on panel? Can why I suggest one more thing in your resolve. Yeah in your resolve, you say very clearly: you're asked in terms of to bolster interagency efforts, but can we also add in that they should also engage with the community on potential solutions. Good point, good point, because yeah I just think that should be a part of it. Yeah good point: okay, is it my turn or yeah go ahead? Okay, I wanted to point out that the bombs that were used at the Boston Marathon were made with fireworks. Okay, this is really serious stuff and if they I do not even know, I did not even know that they had completely decriminalized the use of illegal fireworks in New York. But if you decriminalize something why even bother having the law on the books anymore, you know what I mean. I mean I watched guys outside my window. Over the summer they're grown men, they're, 30, they're, 40 years old. You know you're not going to take them in and put them in a softball league and suddenly they're going to stop doing stuff like this, and the other thing is without actual criminal penalties. You'll never find out where they're buying it from because there's no reason for them to tell you know so I mean in the past. The police department, I believe, did do as as Barbara alluded. They did stakeouts and they knew the wholesalers in Pennsylvania and upstate, New, York and others who were selling these things in large quantities and they staked them out and they followed people back into the city. So I think I think the pd has got a pretty good sense of where the fireworks are coming from I mean just to bring up a very unpopular name: Giuliani even shut off the John Gotti fireworks. You know so it can be done yeah. Yes, it has been done, it can be done and but without enforcement. If it's a situation in which there is no criminal penalty, the police will go past. The guy they're not going to stop up and get into a scene over some kind of a summons that costs a dollar. It's not going to happen. Okay, I do not know what the facts are about that okay, Maria Garcia yeah. Do we have Maria Garcia he's muted Maria? Can you unmute yourself, okay type it in the Q&A catchment? Is that a new hand or an old hand? Sorry, that's the old hand, hold it. The only way she can type in the Qa Q&A is to Un promote her. She can't type in the qa if she's promoted at the bottom is not muted Maria. We can hear you now. No, we can't you're unmuted, but we still can't hear you here. I am, she must have her volume down on her mic or something she does not look like. She lives on Nagel and Elwood, and on the issue of noise pollution, I have not slept in three nights because of cars with loudspeakers and restaurants on Nagel that have giant speakers. Well, those though Maria you should call in those complaints to 311. They should be referred to DEP, especially if, if these are restaurants, those are those are things a Dp can can send down inspectors for, and she also says we are still getting fireworks as well. It is a public health issue because no one is getting any sleep within half a mile. Please do not respond to one calls she's right. Okay, he uses Bernard says users have to be arrested. The only way to get the sellers is to enforce against people selling them off. Someone else here Lynn. Thank you very much for working to address this problem. Fireworks which made the summer in our neighborhood truly unbearable, it'll, be easy to push it to the back burner during the autumn winter, and then the problem will start next year. Appreciate your continued focus. Thank you. Okay, very good. Okay, all right maria! You can also go if you need any assistance, you can also call the Community Board office at 212-, 568- 8500, but my suggestion is, you call 311 and register the complaint about the restaurant with the lounge with the giant speakers that that's a separate issue I wanted. I wanted to deal separately, at least in the beginning, with the fireworks issue, which was so paramount during the summer. All right is there a motion on adopting this resolution Steve. I would like to clarify if I would for a moment, the penalty for having fireworks if you possess or explode fireworks, you're just charged with a violation and, as you know, that's pretty meaningless nowadays, but if you're caught selling or distributing there is real teeth up to 90 days in jail for a smaller amount up to a year in jail can get up to four years in jail. So the issue is to catch the distributors. There is real, still real teeth in the law about distributing. But again, if you possess or explode a firework, you will be charged with a violation which we know is like less than a traffic ticket right. Okay, so I think the the tenor of the comments I heard earlier from committee members was that we did not necessarily want to crack down on the people who were setting off the explosives in the streets. Is that correct? No, I do, but I understand, but what's going to happen what's going to happen? Is it depends if there it depends? It depends on the severity like if that action. Let's say it leads to a tragedy like Nagel or something like that. There should be some real consequences, yeah or whatever, behind that right, the crime and also we can see the fireworks at the point of explosion. That's a consequence, yeah! Nothing, maybe they'll, stop doing it yeah in the first instance, but but there should be some kind of upgrading. You know if there's a repeated, if the repeated violations people people should have to do more than just pay us get a violation or a simple summons, and I agree with you Steve. I just want to say I do not want to take up all this space, but I just want to say one of the things that you do not have to be careful. How you word this because you're going to run up against the folks on the board, who are the defund, the police folks who feel like I do not care. If you slit my throat, you should not go to prison, so I'm just saying all right. Well, I'm one of those defunded police folks. So I should I want to just say something I am against criminalizing setting off fireworks, because I think there are circumstantial things and there's community- based things. There's cultural things, there's a lot of factors into it and when we bring police in- and we start criminalizing folk for doing things like setting off a firework, we're setting off a perpetual chain of consistently being criminalized for things that other people white people would not be criminalized for. So I strongly am opposed to criminalizing people for setting off fireworks who's. Talking no you're, I'm opposed to not getting sleep and having my blood pressure go up and having my blood sugar go up. Ten point: that's what I'm opposed to, because I got no sleep. I got no sleep. I have my own months. Okay, I do not think we're talking about criminalizing it. It's already here. That's not what we're saying no you're talking about the enforcement of it right, so they're saying that a summons or a violation is less than a traffic ticket right, they're, arguing for more than that. What I'm saying is. I do not okay what about seizure at the point of explosion? That's more than the summons! That's saying! No! You can't do this. These are illegal they're, not allowed New York we're taking them. They should not be summoned. They should not be confiscated. I'm not saying that what I'm saying is if we're crim like, if we, if we move beyond violation, what are we moving towards criminalization right, like people are going to get arrested for having fireworks, we do not want it, and I think that, right before we make the same decision and make it like our very arbitrary choice to like recommend that people are arrested for setting off fireworks, we should think about the consequences. That's all I'm talking about. No, I agree, and I do not think anyone's suggesting that it should be more than a summons, unless maybe it leads to arson or leads to something exactly that's what we're saying just the fireworks. If they just go into the air come back down just a summons, I do not think anyone's pushing for no that's what it currently is and that's kept people up all summer long and that's written in fourth ignore, as Steve Simon asked how many summons were actually issued. We do not know yeah, oh no again, I did not really want to. I did not want to get caught to dealing with that particular issue in this resolution. So one more thing to say: sorry, I think that- and I do not want to excuse this, but I also think all right. It's me Barbara Naisha is speaking Naisha. Thank you. Yeah go ahead, so I do not want to get caught up in the idea that, like I also do not get like kept up by fireworks, because I do they're annoying like I hate them right, but I think also that when we like, I was under the impression that we were advocating for the criminalization or something more than a summons which for me, is like a very sticky territory and I'm like uncomfortable with that conversation. But, on top of that, I want to say that the combination of defund, the police, which was like exponential like it, was like a bigger movement this summer, along with the Covid-19 like it's like the intersection of all the things that people were experiencing in our neighborhood this year, made things worse, that's not to say that last year they were not bad also, they were, but I think we also need to be mindful of the fact that, like there's certain intersections of things that are making things exponentially worse, naisha, what I was speaking to is that the partial solution to the problem is to intercept them before the fireworks come in at the poconos, so that they can't be set off. When you stop the distribution, the mass distribution and cut off the source, that's why you can buy them on the internet. Well, that's not is possible. We need it at the point. I think we can only deal with it like implement something that has a safeguard like that. Like there's a lot of legal things that I am not equipped to discuss and like I do not know if anyone here is a lawyer, but I think that likes to have step checkpoints or safeguards like inspect people that may be trafficking. Fireworks is like, at least above anything that I can like, rather than so. I think that it's important, but I myself can not talk, but I can't contribute. We could do the same thing to stop them from coming into parks. We know where the hot spots are. We can set up cars that would stop them from coming into the parks because they know that if they come into certain hot spots, they're going to be seized. Do I hear a motion on whether to adopt this resolution? I make the most about the resolution. All right. Is it seconded whoever Barbara you go at you? Take it baby, yeah first yeah, I rescind the motion, so we got to start over. Okay, I make the motion to adopt this resolution. Can I second it so Barbara seconds it? Okay, I'm going to have to there's a house: I'm not get the data to you tomorrow. Okay, all right, I'm calling the role on this motion. Betty Lehman, yes, Tanya, Barna, yes, Daryl Cochran, yes, Catherine Diaz, yes, Nation, Diaz, Abstain yeah, yes, Barbara frazier, yes, Jay Mazer, yes, Steve Simon! Yes, all right resolution passes on a vote of three six, eight to one eight to zero to one eight, oh one. What about community members are waiting is Richard Allman still on the call are any other board, any other board. Members on the call. I see his name yeah. I do not hear him there, but his picture is not there and his microphone's not on all right yeah. Also Bernard Graham and Cheryl Miller Lynn, Maria, Garcia and Nancy Preston are still on the call. So can they type in their yes or no's to the question yeah in the chat, those five one, two three, those five people should put their votes or they could raise their hand or raise their hands. Yeah Bernard, Cheryl, Lynn, Maria and Nancy Bernard votes; yes, Cyril, Nancy, Preston votes, yes, Cheryl, Lynn and Maria any vote. I think we have unanimous- I have not heard. Did you hear from Cheryl Lynn and Maria Cheryl? If you can raise your hand? Yes in the Chat Maria said yes in the chat, yep right, yeah Lynn said yes in the chat. They all said. Yes, okay, so is that five yeses? Yes, okay, very good! Okay! Next on the agenda old business, tanya you're going to give us a report about the noise pollution task force. Yes, and I'm going to make it quick because I know everybody do not. People want to go okay, so back in August, when, when Steve and our when Steve held the pub the hearing on noise, the public hearing on noise I mentioned, then that you know we should have a task force and there was an overwhelming community desire to have this be community led. So that's what was done. We have formed this task force. We have 22 members of the task force and those members are very diverse and they represent various constituencies in our community, from small business to elderly, to our schools, youth, to our tenants, the people who live in our apartments and our intended associations. So we, you know, we have and other community activists who have been very involved in this community for a very long time. As I mentioned, it's extremely diverse and that way as well. It is also very diverse in terms of people who are on it. We have 12 of the 22 identify themselves as either black or hispanic, eight beings, hispanic and four black and nine white or caucasian, and then we have one person who is middle Eastern, who has been heavily involved in the jewish community and we are very represented in terms of evenly represented in terms of Washington Heights Inwood, with 12 of our members being from Washington, Heights and 10. In enwood, we have most of the member 17. Both either live or live and work in our community, and there are four who do not, but they are. We have also have our community experts, our academics, who are part of this effort as well, going to bring a lot of that perspective with the work they have been doing on owing the connection between noise pollution and public health, because this is a public health issue and so what's going to happen next. Is that we're going to be meeting this month and are having our first meeting and at after that time we will announce who's there on the task force, we will have a community advisory component to the task, because the task force will be doing its work and we allowing them that privacy that space to do that. But we will have a community advisory component where the community can provide feedback and it can go both ways from task force to others in the community and vice versa, so that we are able to to hear those perspectives, but we're going to be bringing in different conditions with constituencies before the task force to address to you know for the for us to figure out what the solutions are, what solutions could look like and at the end the end game is to provide a list of recommendations, slash solutions with accountability with who would be accountable for ensuring that those things happen and so, and so that's where we are, I'm very excited about the people we were. We have they're a strong group and really excited to for that for them to begin this work to really begin to address this issue from a community perspective. Any questions, Tanya Maria Garcia, said she'd be happy to help on the committee. Oh my gosh, yes Maria, we got ta talk, I can't Maria. I'm can you put your email because you can put your email in the chat, so I will screenshot it and I will get in touch with you. We definitely would love to have you be a part of this? Is you know this is truly community- led and it's extremely important that happens and in its extremely strong group. So I want to please do that and I will screenshot that now, if you can do that for me, it's in there. Thank you, I'm going to screenshot it now all right will somebody will somebody be able to copy the the chat before I I've done, I'm already doing it and it started an email, okay, great right after this. So is that the same as the Q and a yeah, it is yeah all right, any other comments or questions for Tanya. Okay, very good. I just want to quickly cover two other items on the right: two new business: oh okay! What's that never mind we're not there yet okay, so you may have seen the final list of FY 22 budget requests from the community board as a whole. I'm pleased to see that nine of our expense budget items were within the top 25, which is supposedly the cut off for how many you're supposed to be able to submit to to OMB and once again the number one priority for the board as a whole was to expand mental health services in the community. The number three priority for the board as a whole was to increase staff to conduct regular noise enforcement, air quality monitoring and water quality testing. The number four board priority was to increase services to prevent and treat chronic diseases such as Alzheimer's, diabetes, cancer, heart disease and hypertension, conditions that increase susceptibility to Covid-19. The number six priority was to increase, as I mentioned before, substance abuse services in our community, including opioid, Overdose prevention, education and funding for syringe, cleanups and collections. The number nine priority for the board was to increase trash basket collection on commercial streets, fully restoring the FY 21 budget cuts. The number 13 priority was to increase funding for a targeted educational outreach campaign for Covid-19 Prevention and support services and underserved communities such as Washington Heights, Inwood number 22 on the list was to increase HIV AIDS prevention and treatment services and the number 23, oh, I left out number 16. number 16 was to provide funding to ensure that all local public schools have multi- service health clinics with nurses and social workers, and the number 23 priority was to increase pest control efforts to eliminate rats cockroaches in our community on the capital budget. Our number one priority became the number nine priority of the board, which was to expedite the replacement of old water mains and sewer lines. The board's number two was the boards number 12 to provide additional garbage collection, trucks and sweet street sweepers, and our number three was the board's number 20 to install the green infrastructure such as bios whales, to divert storm water from the sewer system. Second number: two on for me on old business: the city's ratings on yeah. Sorry, I had a question on that. I saw another committee had something that talked about getting more spanish speakers for health inspectors yeah. That might be, I think, that might have been under business development should that have fallen under their committee or should that fall under our committee? Well, you know, I think it's something that Allah wanted. I do not know if you were, you know it really. It really should have probably come to our committee. Maybe we could oh well it's too late, maybe for next year I would say we could, but I tell you know it was a. I do not know if you were at the budget hearing, but you know it was a little dicey to try to convince Faye Florman that the item that was she had put under her committee for mental health services really belonged to us in the end they were combined, but she also has an item for youth suicide prevention, which you know ended up as the number 32 priority for the board, which to me is a shame yeah. But to me that falls under what we had in mind for expanding your mental health services and we included youth in that category. So I do not know that she needed to have a separate one, but yeah I mean there is overlap and it's hard. If you know there's no real. You know you know there should be a better system in which we can, which we can review these budget items and combine them and and simplify the process for the board members yeah. That's a little unreal, yeah, okay, kindergarten on the Ra ratings for clean streets for September. We dropped down below 80, which I believe is a is a threshold we're supposed to maintain. So we were in in September, we fell to 78.4 the previous month. We were over 92 percent, so this was a pretty significant reduction drop in our ratings and on the sidewalks we were at 97.9 percent. Is there any any new business? No new business? Yes, I have get these votes. Counted. Sorry, go ahead, Sally! I'm sorry! I have three items 20 days, getting fountain house on the agenda for December to come and present based on the services they offer in our district, but also what they're doing citywide with decriminalization of people with mental illness, and they can probably answer questions a lot of questions that come up when we're looking at other proposals like the double trouble which affects the substance use disorders. So I do not know if we have room in the agenda. There's another group that has presented to the aging committee that would like to present on sustainability and environmental work that they're doing, and that group is friends of Inwood Hill park. Again we'd like to be on the agenda for December or January, and then finally, I think that we should recognize which we did not do in the general meeting. I think we should recognize the death of Cecil Corbyn Mark yeah. I think that's really important and also oh. I did have one other resolution to propose that we cobbled together something more current on the New York Presbyterian Resolution, given that Covid-19 now impacts it and it's a whole lot easier, not to open a unit than to close a unit, and I think that we need to be very hard- hitting with the hospital it's frustrating to refer back to 2016 or whenever they originally did their work. I think we need to bring that up to date and put it in a covered perspective. I would be happy to work on that resolution. What are you talking about the site unit at Allen? Yes, and what they're, in the capacity that's being lost, city- wide because those were there the alternatives they gave us to the loss of the psych unit? Well, we've lost 50 beds at Brooklyn methodist in the Columbia presbyterian system, they've closed down chemical dependency units, so there's shrinking capacity all over the place just to piggyback off of one of Sally's earlier comments about next month's meeting, it's world AIDS day. So I know we usually have someone come speak about. Can we do a proclamation like do we do that? No like at the General Board means like just recognizing something like that? Is that exactly and you can actually drop off it's interesting that you mentioned that too, because the other thing I wanted to mention along those lines was next year. I think it's in June or July will be the 40th anniversary of the first report in the New York Times that many people are familiar with 1981 right, yeah 1981, so that the 40th anniversary, that is a big celebration of that did you have a suggestion for a speaker on for the on world AIDS day. Well, did you who was the doctor that spoke last time I thought was really good. What was his name? He was really good. I forget right now we can look back and he's going to do a few of our meetings, but yeah he's good yeah, but you know we would like to vary it if we can. Okay, I could. I know someone at the New York City AIDS memorial they're down on in the village, but you know it covers it's a city. You know now that we're remote, even though Harlan has moved out of Inwood, maybe he could zoom into the meeting. Oh god, I'd like to touch business, it just would be so cool if we could start recognizing some of these things and proclamations, just as just a formality, just like just acknowledging right. It does not have to be anything. You know it's not like involved. It's just a statement, a brief, like proclamation that some body would get up there and just say or get up there, we're not getting in there. We're like get we'll just read it and we keep it moving right. It's just like yeah. It just would be nice. You know if we could start integrating something like that in the process, so you're suggesting that, in with respect to World's a day, that's right the proclamation at the general meeting yeah I mean now that we've done a street co-, naming we might as well do a proclamation. I think that would be nice because more than that recognize people when they leave, we should recognize people for the work that they've done in the community. Yes, tattoos that too sally yes, all of those things could be proclamations that we should just do. What did you say Barbara? I did not hear you. I said more than a happy more than a happy birthday less than a rezzo, just something that you know you acknowledge and yes, that's one way of putting it. I like that I like that. Okay, are we ready to adjourn, I believe? Are there? Are there announcements or are we ready to Adjourn? I'm tired, Steve you're, going to follow up on that grab- and-, go connection to meals, connection to the woman with the distribution of masks and stuff? Well, I'm going to suggest that she stay in contact with Betty Lee. If you want, you want to send me the you want to send me contact information for the Star senior center and the y. I bet he has it yeah and I'll give you information for the dyches fam she can go through. I have all the I have all the individuals for the senior center, so I can send it nelly. Do you have the Dikeman food distribution? I know the woman's on the aging committee oh carol weeks, can we include her in it because she knows what's going on in the dyches houses. I would also like to be on the list because I want to do something in Wood, Hill, Park yeah. I have Carol's phone number. Interestingly, I do not have an email for her, but I can call her and get these okay. I can send it to you, I'm sure Mary Anderson has all the senior centers well Betty. Has it all well either way? Okay, all right! Let's adjourn this meeting at 10:02 P.M. Thank you all motion to adjourn. Okay, very good I'll see you have a good night. Okay, bye! I, like your mom's picture, she's a beautiful woman. Oh thank you! Thank you all right. Please send me the stuff from the chat. Okay, Steve Simon. I understand you, the stats with you briefly about the ring garden. The did you oh we both need to, but let's not do this in a public forum. No, let's with my capital guy tomorrow at one o'clock, I'll talk to you after that. Okay, oh okay, great okay, we'll call you at three: I got a call at 2:30., so 3:30., okay, 3:30 tomorrow, it's a date; okay, all right, bye! So barbara we'll do the conference call thing again: yeah.",
            "summary": "But when it comes to actual restaurant food safety, inspections, yes, that continues to be department of health inspectors.\nIt just started Steve and they're used to not starting necessarily in time, there's other entertainment going on tonight like what oh you mean constantly looking at numbers.\nThanks for having me back, as you know, cases across the city are, we are seeing increases in certain neighborhoods.\nI mean, I, think the whole issue is ebbs and flows right, but the point is: we are encouraging everyone to go, get tested to maintain.\nIf you need anything from our ends, posters palm cards, things like that to share with the community, please let me know if there are any organizations on the ground level that work, with.\nI forwarded all of those over to the mayor's office of special enforcement and the Community affairs unit, so that they can send out inspectors to inspect any type of social distancing, violations.\nAnd I'm, happy to speak with folks on that, but I want to turn it over to Laureen from h, test and trace, because she has a lot of really exciting things that they're doing on the ground.\nI know our action center has been passing, out, face coverings and working with local cbo's and things like that.\nAnd so, if you see a location of particular concern, I, would recommend you know checking in with the DOT to see if they have the proper permits in place, but I think.\nIf there is one particular a couple of particular locations of concern, definitely you know reach out to DOT to see if they have the proper permitting in place for their restaurant.\nSince the open streets, open restaurants, is a DOT program and debbie and agreed that I guess it's up to Eleazar for the bylaws to figure out what to sign it, but maybe we should have sort of a town hall addressing you know, or at least the committee should have a conversation, probably health and environment traffic and transportation, business development, and maybe licensing if this is a.\nThink it's a big issue and as long as we know, the proper reporting, I did have a question for you pauline a separate, question.\nI guess it depends on one day of the week, because they were increasing by like a full percentage point in sort of testing, results.\nIf we're not seeing a steady, dramatic increase in a neighborhood, I think that's good, but I think whenever we see some small incremental increases, we do want to put resources into the community and make sure that stops before it becomes a big problem.\nSo Washington Heights is not like a hot spot location right now, but we are seeing some incremental increases, which is why I think you know.\nSo I, think maybe we can get the state Department of Health next time for questions related to that.\nIf that's something that you think the that business might need, I would recommend letting the state know, as well.\nIs sort of a case for concern, but I think you know just to be comparative to the other locations where we're seeing huge hot spots.\nI know you want many more resources available to your constituents into your district, but I think we're seeing some real problems in other neighborhoods throughout the city, and so a lot of the focus is on that, but you're right like we do not want to get to that place in Manhattan.\nI am the borough outreach director for New, York, City, Health and hospitals, specifically for the test and trace unit.\nMy job specifically right now is focused on prevention, so that we can keep the numbers down work with all the community- based organizations within your community board in order in an effort to partner and provide access to PPE, give you micro sites where folks can get tested for free or low cost at no cost in your area and to hopefully work alongside with you.\nWe definitely want to establish a an ongoing working relationship with you and want to support your efforts and want to make sure that people in Washington Heights who wish to get tested can find an easy way to do so and hopefully get their results back pretty quickly as rapidly as possible.\nActually are working on something that we hope to get some information to you early next week, where we're planning a joint virtual health seminar prior to thanksgiving.\nSome new information that we've come across is that the uptick in numbers, or an increase in positivity rates, are due to small family gatherings, not the large family gatherings, especially in enclosed spaces, which is why we're trying to get ahead of things and possibly have a speaker and an expert on there.\nOnce we've confirmed that prior to Thanksgiving, we'll roll that out to you and an invitation to everyone on this community board, along with some other folks in upper Manhattan, so that we can work together in order to prevent a second wave.\nIt was two months ago and they apparently supplement the work of the test and trace core by providing assistance to a people in isolation.\nOkay, yes, I am aware of this article as well, and it's caused a little disarray for the gothamist versus the information that we're actually receiving at the Department of Health and the city from the testing sites from the locations from the hospitals.\nYou know the palm cars and stuff like that, because I see a lot of in the park.\nActually, you know, send cases of masks and Pom cards and folks who do not have access to that can actually pick up organize days of actions for nearby testing, sites.\nIf there is not one in a neighborhood, for instance, if seniors have a hard time accessing it because of the terrain, the turf that you guys are at so Hnh staff would bring self- test kits for people to test themselves and folks will receive instructions for how to get their results.\nIt has been going back a couple of times Richard, you might know you get on mute last Friday afternoon, the department for the aging sent a directive to all senior centers in the city that grab and go and all on- premises.\nI know that the New York Times had gotten hold of some of that data back in July and they showed very disparate death rates depending on location.\nThe pandemic preparedness, act, which was passed in 2019, and it turns out to require that the department of the health and human services at the federal level share extensive data, collect and share extensive data about a pandemic with the public and consult with local leaders in policy making and amongst the kinds of data that they need to help.\nHe continued to emphasize vigilance on mass social, distancing and avoiding crowded spaces, and he also briefly touched based on the Nih- funded research that was provided in order to look at long- term consequences of Covid-19 on the lungs and on the heart.\nThink it'd be important for us to talk about this or get someone to come in to talk about community clinics and ambulatory care services being shut.\nI. Just think that if we're going to move it and talk about addressing Covid-19, we need to address it from a community standpoint as well from as well as a health standpoint, and these other clinics that are dealing with the community and people in the communities and they're, not functioning.\nThese are satellite clinics programs that function in the community that are funded by or in part, by New, York, Presbyterian, and just I want to make sure that these programs and these clinics are open and open to the public and being advertised.\nAll of our community programs remotely since the start of Covid-19 and one of the things we had to take a look at, was whether we were going to renew the lease at the resource center, which is on 169Th, Street and Broadway, and at this time we've decided not to renew it, because we do not know when this virus will subside and people will be able to return to a location.\nWell, I do want to mention that I've been checking the the state Health Department reports about nursing, home Covid-19, related deaths, and you know.\nI do not actually know the information, but I'm sure they collected data on all of the cases that they were seeing.\nRight like I know what New York train is a hospital, but there's also other programming.\nI am among many things, a health educator at the at the Office of Community, Outreach and engagement and which is part of the Columbia University cancer.\nSo to speak on the other programs, like I, said before, our health services programming, which is really partnered and really strengthened by our partnership and through New York, Presbyterian and Montefiore hospital.\nOn public injection diversion which goes into our overdose, prevention, harm reduction, programming and support services, which is really a huge part of of our programming drop- in services and hygiene services, which includes our respite care and day shelter, which has really been something that has taken an impact since we have lost our space so just to go into it.\nWe have a public safety team who dust sweeps of the area and Highbridge park picking up syringes safely and to give you know a direct number in the year.\nWe found that when people do not have a safe space to touch down and spend a confidential time with their case manager, they are not able to access these services as frequently or sustain them.\nThis includes a resumption of suspended services such as HIV testing, long- term treatment, coordination, housing and shelter, assistance, food, services, benefits, navigation, advocacy and job seeking support, we'll be able to scale up our health care and critical case management services using telehealth and following physical discipline, guidelines.\nWe have a full line of Covid-19 prevention, protocols, including physical, distancing and daily sanitation, we'll be able to increase our service referral and health care access, which will then result in sort of a decreased fallout that we'll see in the community.\nEvery month, as you saw prior on the plan we have been situated so as we will not be obstructing any public sidewalks, we will not be obstructing bike lanes or any park access points and we've been authorized by the State Department of Health, following oversight and guidance from the city.\nIt was an excellent presentation and we all know the urgency and the importance of y' all having space, and particularly in my capacity when I was working with you, guys.\nDo want to highlight is, I think, the importance and not necessarily diminish the importance of the board but, for example, like what is this same presentation going to happen at the daycare at NYCHA across the street at the clinic and the co- op across the street, because you know on the board.\nWe understand the importance and a lot of that gets lost in translation, because these presentations do not make it to the people on the block and given that, for example, that the timeline is all the way through June you know and given covey.\nWe do not necessarily know what's going to happen next year, even though it's not blocking the park.\nYou know really bring in those like deep presentations and conversations, and I say that especially around parking is a hot topic on the board and around there.\nIt's parent advocates on the the schools on 182Nd and 183Rd. It's people residents who live on Laurel, Hill, terrace down the block from our from our service sites, so we're actively engaging folks through our public safety team who goes out into the community every single day for sweeps.\nWe did the presentation just about about two weeks ago at our at our last event, and we do have it at the end of every month and it is welcome to everyone in the community because we do want to keep people informed as the process goes as mentioned.\nThis is a perfect application process to to the city for the the street activity permit or the office of community.\nWe had a separate one for increasing substance abuse services in the community, including specifically opioid overdose, prevention, education and funding for syringe, cleanups and collections, and that ended up as the number six priority overall for the board.\nI want to respect turns, but I do think that this is significant enough, as we've had in the past, with like other organizations that they present at the beginning of the meeting.\nSo I'm sure we can just send Ellie an email, a five- minute presentation so that board members can ask the question outside of the committee report, because I do think it's significant.\nYou know, I work for the Parks Department and.\nWe did try to get one before, but you know with especially with Covid-19 many of these bathroom rentals and shower services are being used right.\nIf you wanted to do a joint resolution with traffic and transportation would be appropriate for her to do a presentation and get that information out of these two more people on the community board, the question.\nCan you just let us and also corner project know in terms of if next steps is that they're going to present either at the general meeting and are we drafting a resolution or is that going to get drafted in time for the executive, meeting.\nWe know our people though, but I think it would be better if we could get a resolution through the executive committee.\nCatherine brought up and a number of other people chimed in about regarding parking space, and we know how important that is.\nPublic health issue in our community.\nYou know I dashed this thing: off, unfortunately, just in a short time, and if you can, if you see by the heading of what I gave the resolution, my original intention was to focus on increased enforcement.\nSo I, do not know if you're kind of like thinking along that direction in terms of like preventative work over necessarily like a summons and arrest and increase policing.\nI do want to say that they need to do those kinds of surveillance activities and they do have to stop it at the source and track people who are bringing it into the city.\nPeople need to understand that this is a dangerous activity like you're, saying Steve in this resolution.\nIf you possess or explode a firework, you will be charged with a violation which we know is like less than a traffic ticket, right.\nOkay, so I think the the tenor of the comments I heard earlier from committee members was that we did not necessarily want to crack down on the people who were setting off the explosives in the streets.\nIt can go both ways from task force to others in the community and vice versa, so that we are able to to hear those perspectives, but we're going to be bringing in different conditions with constituencies before the task force to address to you know for the for us to figure out what the solutions are, what solutions could look like and at the end the end game is to provide a list of recommendations, slash solutions with accountability with who would be accountable for ensuring that those things happen and so, and so that's where we are.\nThe number one priority for the board as a whole was to expand mental health services in the community.\nThe number 13 priority was to increase funding for a targeted educational outreach campaign for Covid-19 Prevention and support services and underserved communities such as Washington Heights.\nI, think it's in June or July will be the 40th anniversary of the first report in the New York Times that many people are familiar with 1981 right.\nYou know if we could start integrating something like that in the process, so you're suggesting that, in with respect to World's a day, that's right."
        }
    }
}