{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "title": "Parks & Public Spaces Committee Meeting",
            "publishDate": "2020-12-01",
            "shortDescription": "",
            "lengthSeconds": "0:59:15"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "nlQV3F_TWpk",
            "fillerWordCount": {
                "uh": 107,
                "um": 153
            },
            "readTimeFullTranscript": "35 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "position": 28,
                "kettle": 22,
                "park": 17,
                "realm": 15,
                "event": 14,
                "space": 12,
                "language": 12,
                "agencies": 11,
                "public": 10,
                "marketing": 9
            },
            "wordCountSummary": {
                "position": 11,
                "public": 5,
                "agencies": 5,
                "realm": 4,
                "statement": 4,
                "parks": 3,
                "budget": 3,
                "details": 3,
                "space": 3,
                "park": 3
            },
            "fullTranscript": "Thank you, Mike and Chris I see your notes. Okay, I think we can get started, we're doing pretty well, hello, everyone, I'm Clayton, Smith, chair of the parks and public spaces, Committee for Community Board five. We are hearing a couple of items tonight. The official position of community board. Five is not until a week from Thursday, when the full board will hear the committee's deliberations. That meeting information and sign up there for the public is at Cb5.Org and we are good on quorum. We are going to begin with a little bit of a rehash of an issue that we heard a couple of months ago, namely the proposed position of the director of the public realm, put forth by municipal arts, society and New Yorkers for parks, so Tara Kelly is with us from Mas hi, Tara, hello. So, by way of recap- everyone we heard this, as you might recall, as a committee specific to issues that pertain to our committee's jurisdiction, and there are many of them with this proposed position, and we agreed unanimously to put that into a written statement that would we weren't exactly sure what the strategy was going to be but be submitted to the city in some fashion, to indicate our support for the proposed position in the two or three weeks immediately following that, as you know, the Bex Committee on Community Board five took up the same issue in regards to the formal budget request for the year and we determined that was the best way to lead on this issue. Coming from the budget request process formally and now that has been done, we thought that it was a good idea to re-hear this idea at committee again, for two reasons: number one is to hear from municipal art society about any updates we should know about whatever progress has been made or anything that has been further evolved in the proposed position since the time that we saw them last and secondly, just as a strategy for Community board five, since there is such widespread support for this proposed position, even as many details continue to be talked about, is that we, as a committee, can take the content of that written statement and actually, assuming that we have things we might want to add or talk about tonight, put that into the form of an actual resolution which is just stronger and then can be sent to full board and then a full board people on other committees. The other issues can add something they'd like there if they see if they deem fit, and then we'll actually have a statement of support as a resolution from the full board, which is the strongest way moving forward. After our already being on the public record for the budget request, so that is why we were having this kind of rerun of hearing this issue on tonight's agenda and so before. I turn it over to Tara I just wanted to see if there are any questions from members of the committee about this anything procedurally or any questions or comments that you have at this time and Luke did drop the link to the registration for the full board meeting into the chat by the way and seeing none I will ask Tara to give us kind of a recap of how things have progressed over the last three months. I think it is since we had you here last well, so you know we continue to have our action alert on our website asking members of the public to send a note to mayor De, Blasio, requesting that this position be created. We had a series of four conversations over the course of October and November about management and oversight of the public realm as it pertains to design how it works in relationship to providing open and green space. How the public realm is adapting to support businesses through street tale and open dining and one more oh, active, transit, and so all things that I think that CB5 is well acquainted with and how we see that we really need this coordinating position to balance all of these really important aspects of our public realm infrastructure. So we've just been continuing the conversation. This, as you know, is also part of our larger fight for light campaign, and so we're working on some land use recommendations around that in the form of a development framework and so kind of in the research phase of that work, and just continuing, though, to conduct outreach around the director of the public realm. So no major movement in the time since we last spoke but very happy to have your support in whatever form that takes and I'm happy to answer any questions. Members may have. Thank you so much. I'm curious with that with the land use recommendations. If what who, what where who's doing that research and what you kind of imagine how detailed and in the weeds you imagine getting into that simply as part of the position proposal sure, so we see these two things as dovetailing one another, that we need coordination and oversight of the public realm and then we also need some more prescriptive measures taken in terms of our land use process to improve elements of the public realm, and we see that role of the director of the public realm was really integral to sorry. The word is just gone from my head to execute and oversee the and implement those changes. So this is work that we've been focused on for about a year and a half in broad strokes. It was in our bright ideas report where we had a number of recommendations looking at cities around the world for how they better facilitate sunlight protections in the public realm and we're focused in three key areas: around design guidelines, environmental review and regulations. So essentially zoning. So that's work that we're doing at the staff level, but we've had some workshops with experts again from around the country and around the world and we're working on that to hopefully have something come out in January, very cool, and is there any more public forums that have you been to any other community boards or any other group? Since we saw you last, you know, Spencer and Steven have been out on the circuit and I. Don't have an exhaustive list in front of me, but I can connect back with them and find out who all they've been in contact with, but we're trying to build a broad coalition, not just of community boards, but elected officials. Looking for a champion for this position and also affiliated groups to support the campaign and again I'll just remind you guys that this is part of our larger fight for light campaign. So there is a focus on protection for sunlight within the public realm. But, as you all know, there are really important elements of this position that are integral to all aspects of planning in New, York, City and in the public realm. Where so much of our life takes place, so you know we see that this is far beyond what our campaign is calling for. We see the utility in this position great. Thank you. Tara yeah we'd be interested in knowing specifically about community boards, just so that we're informed about what other boards we might be aligned with already, if that's the matter of the public record, yet that's just useful information to know and then, of course, we'd be happy to speak and coordinate with other community boards and moving forward to borrow board as well, so to my fellow Community, Board Committee members. Does anyone have any questions for Tara or about the proposed position that maybe didn't strike you three months ago, when this was a new idea to us? Todd I mean Jeremy, yes great, so this is for Tara. So what is your concept of how the head of the public realm or the office of public realm? What would be the best way to empower it? Should it be part of the mayor's office? Should it be? You know a separate elected official with all that involves you know. Should it be somebody that's beholding to the city council I mean what is your concept of that and what? How should we, as a community board if it's to be created, going forward? How do we lobby for that? So you know when we were researching where this would sit within the government. You know we debated a lot of these ideas and I. Don't think that we have the strong resolve about the exact right and perfect answer. We in our report state that it should be within the mayor's office so that it can coordinate between all the different departments and agencies, but we also understand that is only as effective as the mayor who appoints that person and so I think that, in terms of accountability and empowerment, this call coming from the people of New York City asking for this position to be created to then create some accountability to the public. I think is really important, but you know we've had suggestions from other colleagues, particularly in the four series conversation on open space that we had was moderated by Susan Chin, and she strongly advocates for a deputy mayor position to really oversee all of those disparate agencies. So you know I think that we want to we're trying to get the conversation started and I think that you know, as you as members of the community board, who interface and interact with all these agencies have better suggestions and recommendations for how this would be implemented and be most effective. We're certainly open to hearing that and adjusting, but the reasoning that we had for the mayoral office was so that we could have coordination between the agencies. Thank you and Todd also just to follow up on that I think similar to the statement that we wrote in response last time. The language in this resolution will necessarily reflect the fact that this is the beginning of a process of developing this framework for this position. So this does not necessarily mean that we are unanimously in support of specific things that are not yet in place. So I think that it makes a lot of sense that the position being in the mayor's office is the one that would be quickest to have authority and would come with the least baggage. But as Tara said, it also depends on who the mayor is so looking at that, and also looking at what a more institutional, broader fix would be is something that, of course, would interest us so just to reiterate that this statement of support is loose in terms of the details as the position is now and that we would very much look forward and hope that we have the ability, once the budget is approved, to create this position, that we have the ability to then weigh in a more fine, detailed level of how this would actually work, coordinating between different agencies and all those operational details. Any other questions or comments from members of the committee and while we're waiting I will also open it up to members of the public. If there are any members of the public who have any questions or comments about the proposed position, yes, Leslie Hendricks Luke will, yes, you should be good Leslie. You have to unmute hi, I'm Leslie Hendricks with the 29th Street Neighborhood Association, and what we see is that there's no coordination between land use, there's no land use with public spaces, and so you have this hodgepodge across the city. What we're finding is the most frustrating are our pops spaces, because there doesn't seem to be any uniform rule and there doesn't seem to be any uniform enforcement if they developers not meeting their promises. So they get all the benefits without having to take any responsibility. Do you see that there will be some coordination between say, open streets and pop spaces and bike lanes or increase pedestrian plazas, so that there's some city planning to coordinate all these things and how would that be enforced? That's precisely our hope. What we do see is that there currently is that there is not a lot of coordination between these agencies and pops being the case in point where it's city planning, who understands best what the particular rules are for each one. But it's the department of buildings who enforces it and I think that we're seeing a little bit more intention and they've improved a little bit in terms of their communication between the agencies, but we really would like the public, doesn't understand the difference between the agency jurisdiction between that pops next to a plaza next to a park next to the bike lane. As being you know something we it's a seamless public realm, at least we want it to experientially, be seamless, and so we want better coordination between those agencies, and so that's why we hope that we have so having someone looking at the bigger picture and not just saying like. That's not me, that's you! It's the person fulfilling that role who says all of this is the same thing and that's how the public needs to experience it and for the most part does, and so it's all got to be coordinated. That's great! Thank you! Leslie and yeah. Also following up on that. One thing that we highlight in our language certainly is about enforcement because, to the point of, for example, cafes in a pops, it is just no one understands. There is no rationale, that is the department of City planning, who is responsible for enforcing a sidewalk cafe and a pops when everyone is familiar with DCA doing the same on a sidewalk, and you know, after being on the community board for x number of years. Eventually you catch on to how it works, but there's nothing rational about it and it can be very frustrating so very much to Leslie's point I. Think the enforcement of many different kinds would be one of the key things. I think that we would look forward to this position tackling how to better resolve for the public Chris. We have a question. Yes, thank you Clayton. So this might be a bit of a premature question to be honest, but just thinking about the different agencies and departments that this position would interface with. Would that have to be enumerated as the position is being created? That here is a bulleted list of the agencies, that the position has some responsibility to, or would the position be able to as new problems and challenges come up? Would they be able to say pull in the police department or some other agency that might not be included in that initial idea of what agencies and departments are relevant? Would there be that flexibility or would everything be listed out in advance? Well, it's certainly. You know in working on our report, even the graphic, that's on our website demonstrating the difficulty of the inter-jurisdictional warfare that happens on the street. It's almost impossible even to list all of them into a chart, because there are just so many. You know what they're you're talking about sanitation and trash pickup to transportation, to MTA, to you know, just everything that you could possibly think of so I think that we would make an attempt to recognize all of the potential variables, but I think that it needs to be flexible, because you mean you also have authorities and utilities. So there's so much that goes into these spaces that it's it is very complex and I. Think that at this point, obviously it's incredibly flexible because we haven't hashed it all out yet great. Thank you, Chris any other questions or comments for members of the committee and seeing none can I hear I'm assuming that everyone is on board with this proposed position, especially as it's already part of our public record, but we'll see, but could I hear a motion to have a resolution on this topic? Okay, great! Let's take this to a vote. Clayton! Yes, Craig is yes Dave thumbs up thumbs down I, can't you're, muted, David, Calis I'll come back to you, Miriam yes, Mary! Yes, I! Think Kelly's, not here Chris! Yes, Aaron! Yes, John! Yes, Sam! Yes, will yes, Mike! Yes, Kim! Yes, Evan! Yes, Todd! Yes, Barbara! Yes, Noah! Yes, Jessica! Yes! Dave! Are you back with us? Yes, thanks motion passes great. Thank you so much everyone Tara will be in touch and thank you so much for attending tonight and we look forward to next steps thanks so much for inviting us and we're really happy to have your support, see you all soon, we'll see you soon. All right. Moving on I should have mentioned at the outset that our third agenda item tonight was removed from the agenda because D.O.T was not able to attend, and there was nothing particularly pressing about hearing that this cycle. So we will be hearing the automated public toilet sighting issue next cycle. That is already posted on the agenda online for next month and second, but not least, we have the Madison Square Park Conservancy welcome. We also have Rebecca Smith who's, a representative of the Salvation Army and will or married would one of you like to introduce this application. So honestly, I haven't had a chance to connect with anybody on this, yet I can introduce it based on my understanding from the reading, but I don't know Mary if you've had a chance to speak to anybody or not. No sorry, okay! Well, this was a. This was an unusual cycle because of the holiday, so a lot of work was done by email and stuff prior. So it's if you want to just introduce based on your reading of the application. That's fine sure my understanding of the application is that this is an event that the Salvation Army is proposing to host in Madison Square Park and there are a few I think it's maybe just best to let the salvation Army present the application themselves or with the conservancy I, don't know if Keats or Robin would like to do that. I'm not going to do it justice, honestly, so yeah, Keats, you're, muted. Thank you. So, first of all hi everyone, it's nice to see so many familiar faces in our weird new world, which may come to an end at some point next year, the world or weirdness of our world so yeah. So you know just first of all a quick update on the park. We are obviously still open and have been through throughout and have staff coming in every day and we're proud that we've been able to be there for people to be a safe outdoor space. It's been harrowing at times and but mostly we're clean, green and safe. So one of the things that has hit us hard is marketing events. Obviously we haven't had many applications for them or any and we've lost a lot of revenue as a result. So not only are we excited about the presentation that Salvation Army is going to be putting in the park, but it's meaningful to us and that it's a glimmer of hope for future earned income to keep the park going. So with that I will and I want to thank Robin Lockwood for being here. Robin is our deputy director of community relations and Stephanie Stachow, who oops my puppy just jumped on me: Stephanie stay Chao, who is our community relations and HR manager, so Stephanie's gonna, walk us through and, of course, to Rebecca. Welcome it's nice to see your face from the Salvation, Army and I. Think I believe Stephanie you're going to be giving the presentation correct. So I'm happy to give a presentation. Does everyone mind if I share my screen all right? So I'm going to go ahead and do that? Thank you and let me just in the beginning: okay, so hi everyone, my name is Stephanie Stachow. I've actually been with Madison Square Park for almost six years. At this point, mainly in operations capacity and just recently in this new role, so today we're presenting a sculpture of the iconic Salvation Army red Kettle that will be placed in the park for five days in December. It harkens back to a long tradition of sidewalk kettles on New York, City Street corners since 1903. It will remind New, Yorkers and visitors to share in the joy of the holiday service season and to serve those in need. So throughout December this piece will actually be touring the city, including times square, the meat packing district and Astor place. This is a one-time event and a generous donation has been given to Madison Square Park Conservancy, as Keats had mentioned. This is our first and only marketing event for 2020 due to coped. So in terms of the actual dates the installation will happen on December 11th overnight, from 12 to 6 am nm. A specie rep will be on site and per the parks department regulations. No vehicles will enter the park and all materials will be either walked in or dulled in they will be erected using a scissor lift. Any construction lights that are being in use will not be pointed at residential buildings, and we anticipate that the crew will finish around 5 am with a final site clean by 6 a.m. So there's no disruption to any park visitors when we open at 6 a.m. The kettle itself will be illuminate. Excuse me, the kettle itself will be in the park from December 11th to December 15th. The kettle is a larger kettle and we'll have a frame a kettle itself and will be illuminated with string lights similar to our holiday decorations in the park that already exists there, every December it will have a couple of small spotlights at the base and I honestly, don't anticipate it to overpower a regular holiday lights, display at all during a 12:12-hour period during the day and evening, there's an on-site team which can press a remote that will cause the lights to go from a static state on the kettle to a very glowing like state for about 10 seconds. The glow light will be disabled at 11, with consideration for residents along the park. During the activation there will be security present 24 hours a day. There will be a salvation Army volunteer on site to answer any questions about the installation. If they're asked and a technician insight manager will be present to ensure smooth operation throughout and then the load-in itself will the loadout itself will be December 15th. They plan to wrap at 8 and just assemble by 11:30. This is actually one of the shortest loadouts that we'll have out of any marketing event we've done before, and we anticipate it to be much easier based on the actual cattle. So here's a concept art of the actual kettle installation that will be on site. The base beams will be 16 feet in length and it'll be a height of 32 feet. The kettle itself is five and a half feet tall five feet wide and I know there are concerns about. Potentially the kettle swinging in inclement weather, but that's already been built in there are hook, features at the bottom of the kettle that will allow weights to be attached. So the kettle will not swing and that can be secured during any type of weather. If we need to as well as over the overnight, there is a signboard that informs people how to donate electronically via text or web page. If they choose to do so, no physical donations will be exchanged per parks, department rules and regulations, no materials or giveaways will be distributed. There is a live stream camera similar to the shake shack camera, which will be pointed at the kettle. It allows visitors to go to the webpage to view the kettle itself per your suggestions on past meetings. There will be a sign, letting visitors know that there is camera being used. They may be photographed if they go near the kettle. As for the actual design on the kettle itself, it's really a combination of snowflakes holiday bills and the actual Salvation Army logo. This will be on a red kettle and all the decorations on it will be white itself. As for the location of the event, it's located on our west gravel in Madison, Square, Park near the 23rd Street and Broadway corner. So you can see here number one: red triangle is where the kettle will be: there will be a 10 by 10 unbranded white tent for the site team that will be on site kind of managing the event itself, and it will also the lights will be powered by a very small generator. It's one of those 1.5Gallon generators, very quiet and everything. The installation will follow a social distancing plan and requirements per the parks, Department special event permit. We really don't anticipate huge crowds or any crowds really for this event, but if necessary, we are prepared to deploy social justice markers that hug the gravel line, just the left of the red triangle, so that would actually follow up the pathway towards where you see the 101. That line would be the social distancing line if any crowds are expected, but we don't really anticipate anything. Stephanie can I just interrupt you for one. Second I noticed this page says five foot six kettle and that's a reference to the height I think some of the documents that were submitted say: seven foot six. Can you just confirm yeah, sorry about that? The kettle actually shrunk in size since the document was first submitted, but it's still a 32 foot tall frame. Yes, okay, thank you! So that's pretty much. The majority of our presentation, myself, Keats, Robin and Rebecca- are here to answer any questions for you great. Thank you. So much will and Mary I'll. Let you lead with any questions. If you have any I would just note a question that you guys might normally anticipate. We often comment on these notices about being filmed. If there's any better way that we could address that, potentially will it be hi. It's Robin during the presentation, I usually do and I know exactly the language you're talking about and we've actually we're working with the Salvation Army to draft it, but we'd appreciate any suggestions. As Steph said, the camera is really going to be shining on the kettle. It's not meant to be. You know catching a lot of people, but if somebody walks by it you know they may get caught on the live feed. They do delete the live, feed, I, think every night or every 24 hours or something and it's not going to be used in any other way, but we're happy to send you the signage that we've agreed on the past and maybe work with that same language. So that's similar, that's interesting, because it's similar to the shake Shack Cam right. It's a live feed. It's not really there for historic purposes. It's just like in the moment you can see what's going on in the park, but it's not being used for commercial purposes or anything like that yeah. So if that's the case, I mean I, don't know how other people on the committee feel, but I'm comfortable with that yeah I I'll just pitch in and see. If anybody else has thoughts, I think you're right will that the catching people, incidentally, is one thing that we definitely understand more so than trying to get people interviewed or whatever. Secondly, not using it for commercial use is obviously critical and then third one thing that you might just be wary of with the language one of the phrases that really makes Todd Shapiro the hair stand up on the back of his neck is, if you do not want to be recorded on this camera, leave this space immediately or like terrifying language that you shouldn't somehow aren't allowed to be in a public space just because you don't want to have your likeness in perpetuity throughout the universe. So language about you must leave if you don't want to be recorded, is definitely language to stay away from absolutely well we'll stay away from that it'll be much more polite than that and Todd did you have any thoughts on that yeah, so you know, given that this is just a webcam just to record generally what's going on during the installation, the notice should make clear to everybody that that's what's going on that it's being reported as part of the general sense of what's going on in the neighborhood. Please be aware of it, and not something that tells people to keep out of the park as Clayton said, and that should be fine and the law under New York state is that incidental or de minimis capturing of images you know falls within the realm of what's permissible. So I think what I'm hearing is fine. The other item that I wanted to just ask about is with regard to sound. It seems like there's no use of amplified sound for this application, which is great but and I know that this there's probably a free speech. Something associated with this I know. Traditionally, the salvation Army has a lot of people ringing bells around the city and I'm wondering if just because we're talking about in the park, if there's some way of potentially limiting, if there is a plan to have bell ringers to like certain hours or anything like that, so this activation will have no sound component whatsoever. It's really just a our installation with lights. Okay, great questions from other members of the committee- yes Barbara I was just wondering: can the kettle be moved? I mean I know that you talked about having it so that in the event of a storm it couldn't move around, but I'm just wondering are people gonna be able to push it, and you know is that a problem? It was definitely something that they were discussed during fabrication. Weights can be installed at any time. So if there is any tomfoolery or anything like that, the security person on site, who is there 24 7, we'll go and address it, and if we need to install those weights, so the kettle can not move, but it's pretty weighty, okay, I, don't want anybody to play with it get hurt. You know that whole thing so understandable totally and you too, okay thanks Noah, yes, hi on the 11th and 15th during the load in and load out. Where is the positioning of the truck and where will the people be moving to and fro from in terms of the actual installation itself or just if they're support vehicles, I, guess both I guess where on the street, where the you know, where will the vehicles be parked during those five hours? So it will be on Madison Avenue, along 23rd to 24th street. On the East side, I've already made a request of the mayor's office to check to see if there are any film productions or any other reserves on that space, and they said that it's clear during that activation time or install time and then during those four days will the vehicles be on Madison Avenue, or will they just be coming for those five hours on the 11th and the 15th sure there will be a couple of support vehicles, namely probably the scissor lift and the people who are traveling on site, for example like the security guard and the site manager? Okay, thank you. Craig. You had a question yeah thanks, so I'm assuming this is going to be the only marketing event that you'll have, because you didn't have any before, and it's already November 30th. So what percent approximately of your more expected marketing revenues or contributions, I should say: do you think that this will represent? Do you expect this to represent? In other words, is this twenty percent of what you expected? Is it seventy percent? I'm not looking for the actual dollars, I'm just looking for how much of a shortfall percentage-wise. Do you think this you're going to have this year, Keith's you're on mute? Sorry about that? It's about you, know 10 or 15 percent of what we would have had in a normal year, so your shortfall for the year is like 90, roughly yeah. How are you separate to this issue to this application? How are you coming up with the shortfall because I mean you still have your options? It's been an interesting year and I'll start that by saying that we're very proud to have kept every single employee on staff and with health insurance through December, despite the fact that we've lost 30 percent of our overall revenue. When you asked about you know, the 90 shortfall is a it's a category. It's earned income of marketing dollars right, so we have survived the year, I think pretty well the generosity of donors and foundations, and we also got some of that ppp money. We're okay for this year, I honestly think next year will be tougher. I'm assuming there won't be government money, I'm assuming foundations. Aren't going to be jumping in to rescue everybody in the way that they were, you know last April, and may I'm hoping that at some point we can actually do earned income again and have marketing events and bring that money back. We cut. Let's see 25 of our budget in March and next year, so out of in 19 2019 we were a five million dollar budget in 2020. We're a four million dollar budget and in 2021 will be about a 3.5 million budget and that's to deal with the loss of revenue. So you know the marketing dollars are a big deal and they're important and we're grateful that the Salvation Army thinks we're an exciting place to be, but yeah it's a big shortfall and I. Think we're. Oh, you know we're. Okay, I'm grateful and I. Think a lot of other nonprofits are struggling even more. Thank you and it's good to hear that you were able to maintain employment for your and health benefits for your folks in this very difficult killing. It's I'm glad to hear that yeah, it's been a tough year for I, don't know the whole world so anyway, we're thankful. Thank you. Thanks for the question, Craig and again, I will I. Do this now make a plug for people to sign up for your emails, because I find your email newsletters to be very pithy and succinct and useful and inspiring. So, oh good, are you talking about our weekly ones or the ones I send out to like our smaller community? Oh well, I guess, I'm part of the smaller community, but I actually don't differentiate between them, but both definitely the ones you've written your direct address ones as well as the newsletters they're. Just really well done. Thank you. So we will come back to the committee with further discussion and comments, but I also want to open the floor. If there are any members of the public who have any questions to this application, please use the raise hand, feature and let us know, and seeing none you're free to continue to raise your hand in the next minutes here, but back to the committee. Are there further questions or comments on this application? Mary I know you had a comment yeah. As you know, Clayton I didn't feel comfortable doing this presentation, because I don't support this application. I understand that as members of this committee we're supposed to limit our opinions on whether or not to vote yes, no based solely on whether it meets the physical criteria, that's being presented, I just have to say that the reason that Gail asked me to join this community board is to lend my expertise for 30 years. I was the head of the coalition for the homeless. Among other things, were the court appointed monitors for the shelter system in New, York, City and I can say without qualification that the shelters for single men and women run by the Salvation Army are among the worst, and for that reason, I can not get behind supporting this installation. I'm going to abstain from voting just out of respect for the extraordinary work that's being done by the Madison Square Park Conservancy I know you guys have taken a major hit. Make no mistake. Homelessness is big business, especially in New, York and Salvation. Army takes in millions and millions of dollars a year. So, even though this is a quote, nonprofit, basically taking money from an organization that gets a lot of money and you're, giving them an even higher profile, so that's all I have to say I'm just going to have to remain neutral in voting Mary. Thank you much very much for that input. I'd love to know if the Salvation Army represented would like to respond, or also, if there's anyone else. Who has further comments about that. I'm sorry that you feel that way. I think we're doing great work for New, York City, and you know: we've partnered with the coalition a different, the don't walk by coalitions for many years and I respect your opinion. Thank you. Mary yeah I just want to make it clear that it's not an opinion. It's actually well documented in multiple inspection reports that are publicly available. Thank you, Marion. Thank you. Rebecca Chris, yeah I'll also be taking the position of Mary on this and abstaining Mary. Thank you for sharing all that information. I, really appreciate that background. Thank you Chris. So as chair I would like to just remind everyone that this is certainly a tricky circumstance, because everyone is entitled to their opinion, of course, and we have a difficult job deliberating all the time about applications that have many nuances and many parameters around them. It is true that, typically, we weigh in on impact in the public space by a proposed commercial or marketing event, and the reason we do that is because we there is so much competing use of all of our public space that we came up with the matrix in order to frame those discussions and guide our informed opinion about whether the benefit to the public is worth what the private or nonprofit or whatever it might be applicant, is gaining from the use of the public space, so the matrix I, don't really believe. We need to move through the matrix right now, because I think it's pretty clear that this application has pretty minor impact in the ways that we are concerned about, even with illumination that has been taken to consideration the smallest generator, no sound, no handouts, the footprint is in the gravel area, etc. The things that we always look at that is not to say that I don't understand the concerns and I don't mean to suggest that you're not entitled to your opinion and vote, how you deem necessary for yourself, but the vote on this application is has to be seen in context of our history, of taking public positions on all applications, and this is where I really get a little stymied, because when we have had even charitable organizations in the past file for permits to use park space, we have not asked about hiring practices. We have not asked about any history of discrimination by staff. We have not done that. So I am not saying your concerns and anyone's concerns are not legitimate. I am, however, suggesting that we have to take very seriously precedent and what it is we're actually suggesting we do moving forward, because we have not researched or asked these questions of many applicants in the past. Nor could we possibly do so in a way that would be comprehensive or universal. I just I offer that as we continue to deliberate because it is a it's a difficult and kind of unusual circumstance and I want to try to address it as best I. Can you know, while also absolutely conceding that I understand the objections? So if anyone else has any questions or comments, I have a question to that point. Clayton I'm gonna presumably be writing the resolution with Mary and I. Don't know if to that effect, there's any specific language that you or Mary or anybody else would like included in the resolution. I, don't know if we're at a point for making a motion yet I would propose that I will be making a motion to approve this event and that, if there's any language that anybody would like to include beyond the scope of what the event itself is that maybe this is the time to discuss what that is, because it's probably something that we should all agree to. If it's germane and appropriate to include I, guess that's a question for you: I don't know yeah, that's a good point and I would love to hear from other members of the committee. If there's any language that you think could usefully address, that's Todd, yeah I just wanted to say Clayton, that as to the issue of the Salvation Army and its business practices and manages management of its various charitable endeavors, I agree with you, I, don't think we can really get involved in that I mean any for-profit or non-profit institution or company or group that comes before us is going to have from time to time issues of controversy or politics or business practices. I. Think for us to wade into that is opening a can of worms and start a slippery slope that I don't think we should really get involved in other than to say we understand it, I mean I. Remember there were some applications at Bryant. Park Facebook is a Facebook. What was it? I was some tech company and people were really angry at them. I mean there's always going to be things like that. I think we have to stick to our jurisdiction and you know I would be very reluctant, except in extreme circumstances, to allow that comment commentary by our committee to enter into this. So I don't think we should really add language of that type. Unless it's you know extraordinary circumstances, I would second what Todd is suggesting and I think maybe the answer is this forum is a great place to discuss it, but and have the conversation but going on record and writing to Todd's point I have I agree with what Todd is saying: Craig you had your hand and then Mary yeah. Thank you. So I will third, what Todd said: I agree with Todd and will I mean. Our task here is to say: is this a proper use of park space? What is the impact? As you said, we go through the matrix. This is a proper use of the park space and it's low impact and it's also giving valuable dollars to the Madison Square Park Conservancy we as Todd and will have said we go through a lot of applications in this committee and we also go even though it's for profit. We on psql look at every all these businesses. We don't look at the hiring practices of Danny Meyer when we're looking at a Danny Meyer restaurant application. All right. That's not our jurisdiction and, quite frankly, the you know. That would be something that the SLA would look at so I. Don't think that that's really our role here, I think, as Will said. It's certainly a good thing to talk about I. Think Todd said this. Also it's a proper thing to talk about, and it's good that we're communicating our concerns to the representative of the Salvation Army here, but that's not what our function I, don't believe it that's what our function is in terms of how we vote so I agree with Todd and will that I don't think it should be a line in here. That being said, I respect, Mary and Chris their position and what they're saying and their concerns I don't want to belittle that in any way, shape or form I, just don't necessarily believe that it belongs in the resolution. Mary yeah, I'm certainly not asking for it to be put in the resolution and I'm not trying to shirk my responsibility for work Clayton. If you want to have somebody else to lend a hand in doing the resolution, I have no problem with that. I completely hear you Guys Craig, well, Todd, I, just think that I need- and I'm not gonna- keep beating this horse to say that this is another type of slippery slope. I, don't know if it was you Clayton, but somebody raised the historically homophobic practices of the Salvation Army and was assured that they had cleaned up their house so to speak so Todd when you say only if it reaches something extraordinary. I just hope that poor people, and especially our homeless neighbors, merit the type of attention that our gay and lesbian brothers and sisters have been afforded. Thank you. Mary, yes, Rebecca I just may respond. The Salvation Army serves all those who come to our doors without discrimination based on any gender identity, sexual orientation or anything else. That is our stance and it always has been our mission is to serve all without discrimination. Thank you and Mary. You know, I appreciate your comments again there and acknowledging that our jurisdiction on this committee is what it is and I do, though, want to suggest that doesn't mean. This is not an issue that we can't investigate how we might incorporate that into all the very many things that we're discussing right now with homeless services in our city. So this is not a question for this committee, but I do wonder if this might help to inform conversations moving forward with the bigger picture about what's happening with health and human services and homeless services in the city. You know talking about this issue in the context of this occasion, so I I'm loathe to kind of give off the feeling that we're just stopping that threat of conversation, because we don't care about it. That is I'm trying to combat that, while also acknowledging what it is that we can do as a committee right now so I hear you thank you. So I will leave that to conversations moving forward and I think we've covered all the other parameters of the event. I will give one last shot for raised hands. If anyone has questions or comments and if not, then we can hear a motion to approve second, okay: let's take it to a vote. Clayton, yes, Craig. Yes, David! I'm going to abstain, Miriam, yes, Mary Stein, Chris, Help Stan as well. Aaron! Yes, will yes, John? Yes, Sam, yes, Mike! Yes, Kim! Yes, Evan! Yes, Todd! Yes, Barbara, yes, Noah, yes, Jessica Jessica's! Still here, she's gone, he's blind, okay, so motion passed all right. Thank you. Everyone very much and Keats. Yes, I just want to share well, first of all, thank you all for that conversation and for approving it we're grateful. I also wanted to share. We've had people reach out over concerns of safety in and around the park, and so well two things, one in terms of data we're as safe as we have always been and there's actually less quality of life issues than we used to have. But two we want to. We are convening in partnership with the bid to have a conversation about our neighborhood and community and safety, and so we're asking NYPD we're asking a few of the homeless organ organizations that address homelessness like urban pathways and Carlina Rivera will be attending with us and Clayton I thought later offline I could ask if you wanted somebody from the community board to join that panel or discussion, and that will be December 7th from 5:30 to 6:30. Great thanks. If you could email me that or email the board office, that would be great sure we'll do. Thank you so much. Thank you before we adjourn everyone applicants you are excused. Thank you very much for your time. Thank you before we adjourn I just wanted to see if any members of the public had any I think one person contacted the board office in advance of the meeting, so I just wanted to see. If anyone had a final comment before we adjourn, it seems that person might not be in attendance. Oh no. We have Carly Lubin, okay, Carly. You have to unmute yourself, hi hello, good evening, everyone hi Carly. Thank you for giving us a brief idea of your comment. Yes, I, don't know if it's necessarily appropriate for this meeting, but I wanted to state what I wanted to say. I'm basically I'll be testifying on behalf of the expansion and development of community gardens with also integrated, but also the integration of school gardens. At the same time, food insecurity has also has always been a problem that New York City residents face from, but Covid-19 has sadly exasperated the situation. The most vulnerable, who suffer from food insecurity, are minority New, York, City students. More specifically feeding America, has stated that over 335,000 or 80 percent of all children across the five boroughs are currently food, insecure with 40 percent of them being either overrated or obese. With allocation development of community gardens in New, York City public school children would have the potential to become involved in the formation of school gardens. Once school gardens are formed, public school children would essentially have the autonomy to control what they eat and how to eat. In essence, school gardens have become a lifeline for some of the neediest New Yorkers, as of November 19 2020 grow, NYC, teaching garden from governor's island has helped donate 20,000, plus pounds worth of fruits and vegetables to the hardest hit hardest of communities during the this pandemic. In order to make food insecurity a thing of the past I urge this committee on parks and public spaces to support the legislative bill. Introduction number 0578-to 2018 by submitting a letter to the city council that stresses the importance of establishment and development of school gardens throughout the fibers for New York City public school children who currently suffer from food insecurity. Great Carly. Thank you so much for attending and for your input. I believe that you have emailed your statement to the board office. If you've not, then please do so, and we will certainly look it over and give that some thought all right. Thank you so much. Thank you so much everyone. Thank you. So much for your time meeting is adjourned. We'll see you at full board. Thank you. Everybody! Thank you. Bye. Everyone.",
            "summary": "Okay, I think we can get started, we're doing pretty well, hello, everyone, I'm, Clayton, Smith, chair of the parks and public spaces, Committee for Community Board five.\nWe are going to begin with a little bit of a rehash of an issue that we heard a couple of months ago, namely the proposed position of the director of the public realm, put forth by municipal arts, society and New Yorkers for parks, so Tara Kelly is with us from Mas hi, Tara, hello.\nWe heard this, as you might recall, as a committee specific to issues that pertain to our committee's jurisdiction, and there are many of them with this proposed position, and we agreed unanimously to put that into a written statement that would we weren't exactly sure what the strategy was going to be but be submitted to the city in some fashion, to indicate our support for the proposed position in the two or three weeks immediately following that, as you know, the Bex Committee on Community Board, five took up the same issue in regards to the formal budget request for the year.\nComing from the budget request process formally and now that has been done, We thought that it was a good idea to re-hear this idea at committee again, for two reasons: number one is to hear from municipal art society about any updates we should know about whatever progress has been made or anything that has been further evolved in the proposed position since the time that we saw them last and secondly, just as a strategy for Community board five, Since there is such widespread support for this proposed position, even as many details continue to be talked about, is that we, as a committee, can take the content of that written statement and actually, Assuming that we have things we might want to add or talk about, tonight, put that into the form of an actual resolution, which is just stronger and then can be sent to full board and then a full board.\nThe other issues can add something they'd like there if they see if they deem fit, and then we'll actually have a statement of support as a resolution from the full board, which is the strongest way moving forward.\nI just wanted to see if there are any questions from members of the committee about this anything procedurally or any questions or comments that you have at this time and Luke did drop the link to the registration for the full board meeting into the chat by the way and seeing none I will ask Tara to give us kind of a recap of how things have progressed over the last three months.\nWe had a series of four conversations over the course of October and November about management and oversight of the public realm as it pertains to design how it works in relationship to providing open and green space.\nThe public realm is adapting to support businesses through street tale and open dining and one more oh, active, transit, and so all things that I think that CB5 is well acquainted with and how we see that we really need this coordinating position to balance.\nThis, as you know, is also part of our larger fight for light campaign, and so we're working on some land use recommendations around that in the form of a development framework and.\nBut, as you all know, There are really important elements of this position that are integral to all aspects of planning in New, York, City and in the public realm.\nAnd, so I think that, in terms of accountability and empowerment, This call coming from the people of New York City, asking for this position to be created to then create some accountability to the public.\nI think is really important, but you know we've had suggestions from other colleagues, particularly in the four series conversation on open space that we had was moderated by Susan Chin, and she strongly advocates for a deputy mayor position to really oversee all of those disparate agencies.\nAnd I think that you know, as you as members of the community board, who interface and interact with all these agencies, have better suggestions and recommendations for how this would be implemented and be most effective.\nBut as Tara said, It also depends on who the mayor is so looking at that, and also looking at what a more institutional, broader fix would be is something that, of course, would interest us so just to reiterate that this statement of support is loose in terms of the details as the position is now and that we would very much look forward and hope that we have the ability, once the budget is approved, to create this position, that we have the ability to then weigh in a more fine, detailed level of how this would actually work, coordinating between different agencies and all those operational details, Any other questions or comments from members of the committee and while we're waiting I will also open it up to members of the public.\nWhat we do see is that there currently is that there is not a lot of coordination between these agencies and pops being the case in point where it's city planning, who understands best what the particular rules are for each one, And. I, think that we're seeing a little bit more intention and they've improved a little bit in terms of their communication between the agencies.\nBut we really would like the public, doesn't understand the difference between the agency jurisdiction between that pops next to a plaza next to a park.\nThere is no rationale, that is the department of City planning, who is responsible for enforcing a sidewalk cafe and a pops when everyone is familiar with DCA doing the same on a sidewalk, and you know, after being on the community board for x number of years, I.\nMy understanding of the application is that this is an event that the Salvation Army is proposing to host in Madison Square Park and there are a few.\nI think it's maybe just best to let the salvation Army present the application themselves or with the conservancy.\nSo today we're presenting a sculpture of the iconic Salvation Army red Kettle that will be placed in the park for five days in December.\nWhere is the positioning of the truck and where will the people be moving to and fro from in terms of the actual installation itself or just if they're support, vehicles, I, guess both I guess where, on the street, where the you know.\nAren't, going to be jumping in to rescue everybody in the way that they were, You know last April, and may I'm hoping that at some point we can actually do earned income again and have marketing events and bring that money.\nThere are any members of the public who have any questions to this application, Please use the raise hand, feature and let us know, and seeing none you're free to continue to raise your hand in the next minutes here, But back to the committee.\nI understand that as members of this committee, we're supposed to limit our opinions on whether or not to vote yes, no based solely on whether it meets the physical criteria, that's being presented, I just have to say that the reason that Gail asked me to join this community board is to lend my expertise for 30 years.\nI'm going to abstain from voting just out of respect for the extraordinary work that's being done by the Madison Square Park Conservancy.\nI think we're doing great work for New, York City, and you know, we've partnered with the coalition a different, the don't walk by coalitions for many years and I respect your opinion.\nBut the vote on this application is has to be seen in context of our history, of taking public positions on all applications, and this is where I really get a little stymied, because when we have had even charitable organizations in the past file for permits to use park space, we have not asked about hiring practices.\nIt's also giving valuable dollars to the Madison Square Park Conservancy we as Todd and will have said we go through a lot of applications in this committee.\nI just wanted to see if any members of the public had any I think one person contacted the board office in advance of the meeting, so I just wanted to see.\nWith allocation development of community gardens in New, York City public school children would have the potential to become involved in the formation of school.\nIn order to make food insecurity a thing of the past I urge this committee on parks and public spaces to support the legislative bill."
        }
    }
}