{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCABe2FgVNv2hgBeMu2mySVg",
            "title": "CB12M  Health \\u0026 Environment October 2020 Meeting",
            "publishDate": "2020-10-01",
            "shortDescription": "",
            "lengthSeconds": "1:50:24"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "NvU4YySj_WU",
            "fillerWordCount": {
                "uh": 304,
                "um": 223
            },
            "readTimeFullTranscript": "62 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "information": 28,
                "health": 28,
                "list": 27,
                "data": 23,
                "services": 23,
                "weeks": 22,
                "cases": 18,
                "enforcement": 17,
                "zip": 16,
                "resources": 15
            },
            "wordCountSummary": {
                "information": 7,
                "enforcement": 5,
                "health": 5,
                "face": 4,
                "data": 4,
                "resources": 4,
                "parties": 4,
                "inspections": 4,
                "public": 3,
                "cases": 3
            },
            "fullTranscript": "Nation is fairly recent. It's about you know a week old, but per your district. In the last four weeks in one in zip code 103.2, there have been 41 cases in zip code 133. There have been 52 cases in zip code 134, there have been 30 cases and then it could 140. There were 37 cases, and so only in zip codes, 133 and 134 were there a net increase over the two weeks, so we are seeing a pretty big. It was like an 89 increase in zip code, one zero three, and it was about a thirty one percent increase in zip code, one zero, three four, so I mean this obviously can attribute to many things right. I think, as the city continues to open, people are feeling more comfortable and we're. Seeing that you know, behavior is really something that we want people to pay attention to. So we're not targeting specific groups of people. We're not saying that you know people of a certain religion or whatever need to be more careful right. The virus does not discriminate again, it has no boundaries, it affects everybody, and so this is more a matter of behavior and doing the responsible thing and protecting all your neighbors, the vulnerable among us. There are so many people that we really need to do the right thing for, and that really means to stay home if you're sick, we're face covering when you're in public really do not gather in large crowds with people who are not your immediate family members, because we're seeing that this is as a result of this behavior we're seeing significant increases in cases, and so you know again, we want everyone to go, get tested so that the data is as accurate as possible, and the reason why we want people to get tested is so that we can really go and mitigate and prevent these clusters from spreading into larger community transmission and where we have to revert back to the beginning of this pandemic. When everything was shut down. That's the last thing we want for businesses who are trying to reopen. That's the last thing we want for people. You know who are just starting to go back to school, so you know these are all things that we as new yorkers should be focused on and really just not doing it just for ourselves, but really doing it for the most vulnerable among us. So that's the biggest takeaway I wanted to share with everyone today. It looks like your neighborhood. You know two out of the four are doing good and two out of the four having some issues. If you guys live in those zip codes and know, maybe potentially why we might be seeing an increase in cases. Definitely let us know you know if it's the issue of people gathering. If it's an issue of people not wearing masks, we can designate folks. So the mayor has designated specific. You know inspectors to the neighborhoods that we're seeing this increase. So if, in your neighborhoods you're seeing areas of concern, definitely let us know let the mayor's office know so that they can. You know, delegate and put resources into the community to make sure that this does not become a bigger problem. We really want again just emphasize that we can't let our guard down and also flu season is starting, so we really want everyone to go and get their flu shot. You know if you could prevent disease and prevent overwhelming the hospital system, as we enter into flu season, a thing to do as well. So again, really it's just a message for all of us neighbors to do our part in making sure that we keep transmission levels low, keep ourselves healthy and really do what is right for our neighbors. So I am happy to answer any questions. If anyone has Paulie yes did you say that there was an 89 increase, so only just over the last two weeks, so it's taking four weeks of data, and so it's just comparing the last two weeks to the beginning, four weeks of whatever time frame that was, and so because zip code, zero, three had a total of 52 cases in the four week period, the last two weeks had an increase, and so it was an increase of 89 percent. So it does not mean that there's like a gigantic with the neighborhood. It just means in the last two weeks they're seeing an upward trend. Does that make sense, and I encourage everyone to go onto our data page to like look at the data for yourself and read through everything that is provided because I'm not a stats person and I do not and do not analyze data regularly. So you know there are things that maybe you can get from the data page that I may not be explaining as clearly as possible. Okay, I had a couple questions. A couple questions: are you done Steve? No, not yet, but can somebody get betty a glass of water? Oh? No, I have I'm sorry. I checked the website every now and then and last time I looked was September 22nd, nine, eight or nine days ago yep and the number of increased cases that I found in zip. It's sort of strange, then that there would be such a sharp increase over the last two weeks versus the previous two weeks. The last nine days. I only see an increase in 19.. I do not know so right, so I mean it's based on data and there's a lot of feedback. Can people mute their lines tonight? This sounds like it's the unhealthy committee. Well, somebody else has to mute. I'm hearing a radio or something Maria. You have a second Mic open, Maria Luna. If you could please mute yourself, barbara yeah, why is she here twice? The Dave Maria Luna is muted. I want to know what that is check out check out some places. I do not know what you're talking about all right. Let me get out of here. Are you on two different lines? No, it does not have to be webex. You could mute your phone too if you're on the phone, maybe you're on the phone and your computer, no that's better. Okay, it looks like I think we have a majority of folks who are muted now, which is thank you. I appreciate it yeah, so I mean Steve. If you're checking the website pretty regularly, you will be seeing you know either increases or decreases in you know, testing rates and confirmed cases. So as it relates to your the districts, the zip codes in your district, as I mentioned in the last four weeks, there were those total number of cases and then the difference. So the percentage change is from the last two weeks as compared to the first two weeks of those four weeks. So I hope that clarifies things. So there is a downward trend in two of the zip codes, and then there is an upper trend in the other two which could change in the next two weeks as well. So yeah it seems like it could. You know it could easily go up and down, but on the positive side I do not detect any additional deaths. No, nobody I mean we've got more cases, but the number of people who have died from Covid-19 in all four of our zip codes appears to have remained stable, at least for the last month or so, and if we do not seem to have had any additional deaths which which at least is you know much better than where we were just a few months ago. Let me just ask one other question: there was a story that came out. I think just yesterday, showing that there was an uptick in the positivity rate in in various zip codes, including zip code 40, which showed, I think, seven additional cases which they said was a four percent increase. So what was it was without with those four cases in just one day I mean how did how did we get to a four percent increase? What was the significance of that report? You know I'm not familiar with that specific report, so I can definitely bring that back to our data team. I've been getting a lot of feedback from community boards and community members about why our statistics and our data are based on we're talking about rate based on a number of a hundred thousand per like per population or whatever, because each neighborhood in each zip code obviously does not have a hundred thousand people. So that number is often inflated to meet that 100,000 baseline number. And so I think that causes a lot of confusion, because the real number is much less than that, but the rate is much higher because it's using that 100,000 that you know that baseline number. So I think that does add to a lot of confusion for our data. I think we've requested to our data team, to like include like a chart, maybe on our website, explain the difference between actual number and rate. So I do not know that specifically that article that you mentioned, but I'm happy to bring that back to our data team so that they can clarify what all of that means. So again, I'm not a statistician. Is that what they call them or like a person who deals with like e and data? So I apologize that. That's not my background and I can't explain statistics better to you, but I do know that there is. You know, what's caused confusion among folks when they're looking at our data page is the difference between an actual number and then the rate. Well, what just seems strange. I have to say that you know I'm going to hear your report tonight because you're saying that in zip code, 40 there's a downward trend, because the story yesterday seemed to suggest that we might be at some kind of critical stage with an uptick in in the percentage of reported cases. Right I mean it might have been an upward trend for you know the previous couple of weeks, but then just in the last two weeks with the percentage of folks testing positive we're seeing it going back down. So it's really just about the last two weeks: we've seen a decrease in the amount of positive cases so that article might have gathered data from a few weeks back. I do not know so again. I'm sorry, I will definitely bring this back to our data team and I know that there is some difference between like the state's data and our data in terms of like when it's collected and given to us to add to our data. So if the state is if the state is providing some data, maybe it has not been produced to us yet, and so there is sometimes a lag in information, so I think I will definitely bring this article and this information back to our data team so that they can help sort of figure out where the discrepancy is I'll. I just I I'll forward the article to you. Okay, thank you. I just want to mention. I know I'm sure I know I have some questions other board members too, and once we're done, there are also some questions in the chat just fyi. My question was, you know in regards to the increase in the one zero three there's. No in one event in particular that that's related to right, I mean, obviously I know a lot of the uptick in Wisconsin and North Dakota is based on some bike rally. We did not have that, but was there any event that you're aware of that so yeah? I do not know. We do not have that information, which is why I asked if you all, are aware of anything happening in your neighborhoods right. If there's this one particular place where people are hanging out or if there's one building where no one's wearing, you know face coverings, if you all know and you're on the ground and you live in the neighborhood, and you see things that are making you uncomfortable and could potentially be creating a situation where there's an uptick in cases. Please let us know, because that's where we can deploy resources to whether it's educational materials, whether it's actual face coverings for folks to wear, I would say important. I would say just one thing I noticed, and it was like, probably about two weeks ago I live around the corner from Bennett, Park and Bennett. Park is often during the summer has parties, you know little birthday, parties or showers or what have you and I had not seen one in a very long time, but then I saw one a couple weeks ago, so I know you know that area, there's stationary picnic tables that people like to at least gather at you know yeah, and you know again when it comes to outdoor spaces. I think typically, where outdoor spaces are okay, as long as people do continue to do their social distancing and wearing face coverings around folks who are not your immediate family members, who've been in the same household with, but if you're having parties birthday parties in the park, I mean that still, you know, could elevate the chances of transmission to that group of folks. So it's really again just a matter of behavior and you know encouraging everyone to just continue to follow the guidelines that have been set forth because they have been doing us pretty well. So far up to this point, where we are now seeing these large gatherings we're seeing like venues where having parties indoors with no face coverings- I mean this is this- is really acrosss the board? It's not one particular group, it's really just. We all have to remain vigilant and diligent and disciplined about it, and you know we do not want to revert back to again to the beginning where everything had to be shut down, because I do not know if folks can deal with that much longer, so so yeah this might I do not? Can you hear me? I do not know if this has already been covered, but in Inwood Hill park there's been very little mask wearing very little social distancing. This has been throughout the summer. I mean it's. I would not say it's worse than it's ever been. It's been pretty bad. Since the beginning, we've made some efforts to hand out mass in the park and to educate people, but I mean basically every weekend it is just a super spread, and so I think, deploying specific resources to that park where the message is not getting through yeah. That's really helpful information, so definitely I can let the mayor's office know through the mayor's office of special enforcement. It's a group of city inspectors from multiple agencies where they're being asked to do work to go out to educate folks, but also to do you know the indoor, dining inspections, the outdoor, dining inspections, making sure that everybody is following these social distances guidelines. So you know anytime you're, hearing of a location that could be a hot spot. I encourage you to email, Steve and you can let me know or email me directly. I left my email in the chat so that I can let the mayor's office know that this is happening and that we need to direct and divert resources to those locations. Hi Tanya, I had my hand up. I did not. I was going to wait. Should we just jump in or do you want us to do you want to wait to acknowledge? I do not want to just jump in if you do not want that. So wait is Sally. You finished, I'm sure all right, so Tanya go ahead. Yeah. I wanted to ask you two things one. I wanted to ask you pauline and thank you for being here and sharing this information. We really appreciate you. What will be your protocol like once? Let's say we let you know right is what is going to happen after that, like what are the steps that you're going to? I just like to know what the process is in terms of outreach in terms of what you do once you get this information and then here and then two is no problem. No, and so two is there a way because a lot of times what I know, what I'm running up against and what some people other people running up against is accusations of targeting people right, and so we want to make sure I see a lot of gatherings by the way of lots of gatherings and where people are not masking up. I mean it's just chronic and I'm concerned about the house parties once it gets cold, it's too cold for them to gather outside they're going to take it inside because that's what was happening. That's what always happens around here. We have these large indoor parties. So how can are you all going to get ahead of that of what we call it messaging, where it's not the community being accused of targeting people? Is it going to be? How are you all going to get ahead of that messaging say that this is a you know that you all are asking people to do this, and you know so. I yeah those are my questions. Yeah. I think I think that's. Those are two very valid questions, so the first one in terms of process. What we've been doing is once I or like a member of our team who covers you, know external affairs for the office. If we get a complaint, we're asked to forward it over to the mayor's office of special enforcement in the mayor's office of community affairs that way they're aware of what is happening on the ground. You know a lot of times it's easier when it's a restaurant. That is creating an issue, because not only do we have resources that the state has had resources allocated for inspections of those industries right so for restaurants, specifically there's the power of the SLA and there's you know specific dedicated folks from the state and the city who could be deployed to do inspections and issue fines and do all of that and take away liquor licenses if they are creating a situation where people are gathering and they're, not following any of the guidelines for reopening when it comes to knocking down doors in people's homes. I do not know if that's going to be something that we're going to be able to do or even want to do, because that just seems like a little bit of an overreach. I mean this is just me speaking personally. I just do not think that we would have the capacity to go to individual house parties, but what we could do would be to work on educating, specific demographics and so earlier on in the summer when we were seeing young folks going out- and you know going to sidewalk bars, we really did focus a lot of our outreach on that population and the younger of the younger folks through twitter, through social media, really getting that messaging acrosss that just because they're young, and just because you know the impact to them, may not be as harsh. They still have that responsibility to protect themselves and to protect other people, and when it comes to this particular situation, where we're seeing clusters in certain neighborhoods, you know we're dedicating those resources to those neighborhoods and we're really trying to figure out specifically what you know. What people are saying on the ground level and we're coming acrosss a lot of people reluctant to get testing whether it's because they are still afraid of a test and trace and having contact tracers called them. You know people are very fearful of law enforcement, and so we want to make that messaging very clear that none of your information will be forwarded to ice. You know just because you test positive for Covid-19 does not mean it's going to impact your citizenship path. I mean all of these things we have to combat because rumors are rampant and the fact that social media is so accessible and a lot of people do not trust. You know, government, they get their information from all these other places, and so it's like a different way. We have to get regular information out, but then we also have to figure out where the rumors are, what they are and then combat those on the level in which people are receiving information. So there's always pockets of folks who are very disenfranchised from government who will never hear what we have to say, and so we really need to depend on our community partners and trusted leadership in the community to help us get that information and education out. So again, if you all have specific leaders, you know people like faith group leaders or you know- tenant leaders, people in the community- that people really trust, give us those names so that we can add them to a list of advocates who we can reach out to share this information and to help us reach those really disenfranchised people, because we know they're never going to go onto the ohmh website and get this information. Well, I think the next speakers on the agenda. I think it also help us address this point they're with the northern Manhattan improvement corporation. Do we have any other hands up from committee members? Yeah? Please can you can you wreck? He should be able to mute himself. I believe yeah, I'm a muted. Can you hear me okay? I just wanted to ask this question, because what I've seen up here- you're talking about SLA and enforcement of existing licenses and legitimate businesses, but what I've seen up in this neighborhood are parties that are just on the sidewalk. There's no license, there's no nothing and there is no social distancing and no mask wearing, and it's been going on. I mean there are other issues involved besides the Covid-19 thing as well, and none of those issues get addressed and- and I believe that something has to be done about that it. Could you know about that particular situation because we're talking about something that SLA or any of the special enforcer department of special enforcement? They can't do anything about that. There is no license to take away from these people. You know they're sitting on the street drinking and yelling at each other with no masks on, and it's been going on all summer long, and I think we've just been lucky that we have not had some kind of a flare- up at this point, but once a little bit of copic gets around and gets into the population with those kind of things going on it's going to spread like as far as I could see. So something has to be done about that, whether it's education, whether it's some kind of law enforcement, whatever it takes to try to keep everybody healthy. You know I and that's all I'm going to say about that part of the issue right now. Well, I think I think bernard you raised a very good point before pauline. Do you have any anything you'd want to say in response yeah? No, I absolutely agree. I think I think the complication is just finding that right balance between utilizing. You know law enforcement NYPD to regulate something that is not a law but really just guidance and regulation, and you know, over policing has been a problem in many neighborhoods and we do not want that to be an additional issue to plague a neighborhood right. So I think finding that balance has been something that the city is working really hard to do. But your point bernard is very well taken that there are certain pockets of the population, whether it's a specific age group, whether it's just people who do not believe that Covid-19 is a thing I mean this. Is this actually happens where people are just not? They do not care. What they're you know. Hearing on social media goes counter to everything that we, as a public health agency, is saying so like we are trying to combat all of those things, and I think it's a matter of education like we said really trying to identify those leaders in the neighborhood that can really get through to that population. Like I mentioned, certain folks are never going to listen to what the New York City, Health Department is going to say, and so we really need those partners we're not talking about young kids, either we're talking about we're talking about 30:40 50 year old people right and they're. Not they have jobs, they work. You know they're, like sort of like regular people, but they are on the street not wearing masks close up drinking the drunker they get the closer they get, the more they yell yeah. You know I mean we're playing with fire with the situation. You know it's going to stop because of the weather nice days, where they'll still be out there doing it and then maybe they take it inside. I have no idea about that. You know, but all right, let me move. Thank you. Let me move up. Did you notice what's happening? I speak. I do not see where you can raise your hand on this cisco system. Could I make a comment? Yeah go ahead. Okay, I would like to ask: I mean the point bernard makes and which certainly tanya has been a leader in- is that this excessive noise is a health problem, and I would estimate that, probably if you get the daughter yeah, and so I really want to say that I asked that probably 75,000 people in our neighborhood have been robbed of effective sleep and rest since approximately April. So I would like to know how much would it cost, or could we investigate that the police, the 34th precinct, be so the patrol cars be supplied with effective decibel meters, because one thing that holds them back from actually issuing summons or dealing with this problem is that they have to have effective decibel meters so that they can say well. This is a violation, so I would ask that you hold that thought until we get to the budget priorities later on the agenda, because I would say that would be a good thing. Yeah and Mary has a question. I'm sorry, Mary Anderson, okay, Mary go ahead. Thank you. I there was talk about you know regulating the you know the noise and element and all of that with the out with the outdoor dining. What I'm seeing at every almost every restaurant that has outdoor dining the tables are, on top of each other, there's no way they're six feet apart, there's no social distancing at all and nothing is being done about it. My understanding was that D.O.T was supposed to be regular. You know regulating this and doing inspections to be sure that they were complying with this regulation, but it's not happening, and I wondered if you know the Department of Health is able to do anything about that or work with BLP or I do not know right. So I mean that again is being coordinated under the mayor's office of special enforcement. Where again, like I mentioned, they are bringing inspectors from every agency acrosss the board to be dispatched to do inspections for restaurants in particular, so any restaurant can get an inspector from buildings or from fdny, or you know, any city inspector who has been trained to do. Inspection for outdoor and indoor dining could be dispatched to any location. So it's not just DOH mh instructors, but when it comes to restaurants, though they're still subject to their annual inspection, which we are resuming, and so they that annual inspection, where they get the letter grade, that will only be dohmh inspectors and those inspectors have also been trained to see if there are any social guidelines that are being violated. So you know, I think restaurants are at this point being pretty regulated, but we have we do hear of restaurants that are up pushing the boundaries a little bit and, of course we would love to hear that so that we can let the mayor's office know not even a little bit and it's almost every restaurant. In my area I live in I'm in the heights, I'm on 172Nd. Okay, I mean that's useful information for us to be able to share with them so that we'll walk up broadway from 170 seconds. Every single restaurant has outdoor tables and there's one or two that are okay, because they're only able to put like two tables outside, but the ones that are able to put you know a lot of tables outside they're on top of each other, okay and then they're going to be more enclosed because they're going to be allowed to put tents around. So you know all of the coughing and breathing and whatever that you're already on top of each other, is going to be exacerbated, okay, all right, anyone else from from the committee or the board. I think there was a rajiv who were you kicking the chat and Cheryl would like to ask a question. I believe so Shelby Cheryl Miller, all right. Can you unmute her or I think she should everybody hear me? Yes, okay, so in regards to what pauline was just saying before about elected officials, doing outreach and trying to educate people in the neighborhood okay. So I just wanted to say that I had called Mark Levine's office last week. I believe it was he's my council member and I raised this issue and what one of his staff told me is that he is trying to pass some kind of legislation to enforce this more because she told his representative told me that he has reached out to the community. He has done. Outreaches he's talked to he's, probably blue in the face and that there are still people that are just outright being obstinate and they just do not want to do it. They just do not want to wear a mask and they just do not want a social distance. I live on West, 165Th and Broadway, and when I go to the grocery store from my house to 160Th and Broadway, I see so much stuff that it's ridiculous bernard was saying before about people screaming in each other's faces, and I see this every time I go down to 160Th and Broadway I'll see people right in each other's faces screaming yelling talking loud one person is smoking and blowing the smoke in the other person's face. That does not have a mask on so you know it's not that the message is not getting out. People know governor Cuomo had said yesterday that this is already now beyond just handing master out to people. He said we've been doing this since February now it's time for the local government to enforce, and he said if mayor De Blasio, he did not mention his name, but I know that's who he was talking about if he does not want to step up to the plate. Governor Cuomo will take over because he's not going to have another issue like what he had before he's not going to want that and he's getting very aggravated. So I just wanted to mention that all right, thank you, cheryl sure anyone else all right was it was not there, a rajiv who sent a message saying he wanted to ask something Steve I wanted to. I also wanted to give a comment. Steve. I just want to point out it's 650. yeah. Okay, we need to move briskly through the rest of this agenda. We have not even gotten to the meat of this okay, I'm sorry all right, Julio! Thank you, Steve. I just very brief. I just wanted to thank Pauline Department of Health we're in the process of organizing any flu shots with elected officials and community- based organizations, and so we met with DOH thanks to pauline, to sort of align and share information of when these events are taking place, so that our community could be better informed when these events are taking place and educate the community about how important it is to get the flu shot this year, especially as we have two different pathogens, the flu and Corvette converging. So we're you know again just want to thank pauline for that. The city has also generously offered to provide some vaccine for our program and we're looking to see that's possible so again. Thank you. Pauline no problem, thank you and please, just let me know feel free to email me directly or email through Steve, all of the places of concern, and I will definitely reach out to the mayor's office, and maybe we can work together on a you know, day of action where there's dedicated resources to your community, specifically so that we can get that information out there and really change minds and hearts and hopefully get people to behave a little bit better. I appreciate it. Thank you. Okay, that's a great idea. We would love, we would love to work with you on the day of action. I would love to see that happen very good idea. All right. Thank you. Pauline again, we'll see the same time next month. Next we have the two resource: navigators from the northern Manhattan improvement corporation Alvin Estabido from the chest and trace program. I see Al Denise is Taina with us too. Yes, I'm here, oh very good. All right did you. Did you choose up to see who's going to go? First? Yes, I'm going to share this screen. I hope it works. Okay, it's my first time doing it on webex. Okay, you guys can see all right. Yes, I can see yes yeah. I can see it as well. Okay, perfect, all right, so the presentation can be trying to make it bigger, but, okay, there it goes. Okay, awesome, hi! My name is Aldenis Vito and I'm a research navigator working with music and, as I said, we have been looking forward to this meeting and having the opportunity to share some details about this program and what it is that we do and hi everyone. I'm Taina Marrero, I'm also a resource navigator, working with the test and trace program for Nimick, and thank you so much for inviting us so we'll get started. So you guys can learn a little bit more about what we do all right. So what is the test and trace program? So it's a public health initiative to fight Covid-19 so that where new yorkers can get back to school back to work, so that way the businesses and other organizations can reopen safely. The core is a group of doctors, public health professionals and community advocates working to reverse cloven 19 outbreak and protect our city. So how does the initiative work? The first step is to get a colvin 19 test. If you test positive you're automatically referred to the program. The second step is you'll, receive a call from a contact, tracer and they're, going to call and find out who you've been in contact with the third step is to take care. This is when you'll receive a call from a resource navigator whose job is to identify the client's needs during their isolation period. Right. So when you go to the website, New York, City, Gov, Forward, Slash Covid-19 test you can, you know, tell everybody neighbors that they can get a free test and what every week there's different mobile units, so they all they're always changing, but they usually have a few in each borough and pretty much. You know if you have cover 19 symptoms if you've been in contact with a confirmed case or if you know anyone who's working in a nursing home, a shelter or adult care facility, they should definitely go and get tested and all the tests are free, confidential and safe and does not matter about immigration status. Okay. So when it comes to the tracing part, the contact tracer, it's very important that when people see a phone call- and I know you guys mentioned it earlier when they see a phone call that says NYC Test& Trace- that they pick up the phone because most likely it's a contact, racer calling them to share that they've been exposed to someone who has you know has tested positive for cover, 19., okay and then once they do, that they're going to and do an intake and with the intake they're going to ask them all of the these questions on who have they been with the past few days. So that way they can reach out to them as well and collect intake for them. So they we've been having that department's been doing really well with you know, reaching out to people and getting in contact with the contacts, and just you know, making sure that they're staying home so, like I mentioned, take care is the third step during your isolation period, you'll have a choice of staying either at home or at a hotel, and, like I mentioned previously, this is when you receive a call from a resource navigator, and the purpose of this call is to find out what the client needs in order to stay safe and comfortable during their isolation period. Our most asked for resources are food medication, delivery and help paying for their utility bills. Additionally, now we have access to now Pal, which is the website that helps us find almost every resource available and offered in NYC, and it has been a great tool for us, because it allows us to send all the information directly to the client's phone, and it also makes our calls with the clients shorter, which has been great for them and also for us to be more productive. Also recently, the test and trace core introduced take care, kids and these daycare kits are sent to the clients, and the package includes enough personal protective equipment for a household of three to quarantine for 10 to 14 days. This includes a medical grade, mask sanitizing, Wipes, Hand, sanitizers, a thermometer and a pose exometer to help those who test positive for Covid-19 to monitor their oxygen levels, and then we also have been referring dynamic hotline. So, if you guys do not know about Nimik, we offer a lot of services from housing. We have a food pantry, the most common one that I feel that we've been helping with has been the benefits line. A lot of people have, you know, been staying home or they have not been working for many months and some people do not qualify for unemployment. So what we'll do is refer them to you know we give them the Hra Human Resource administration hotline, so they can call on the application or the website, so they can do the application online, but we also have them called the benefits hotline and even stuff like for immigration. We have certain days where they can call and speak to someone, and then they can ask questions to see if they're eligible to apply for the benefits that they're seeking and just a few facts about the program. You know we only. We know we only had 10 minutes, so we did not want to take up too much of your time. We do have a video on the Facebook page. That goes into a little bit more detail. So that way, you guys you know, can look at it later, but yeah. So we started this test and trace program with Nimik on June 1st right now we have a total of four resource navigators on our team and we do work Sunday through Saturday, so seven days a week from pretty much nine in the morning to nine at night. So we are out there as soon as we get the referral that someone has been contacted. We call them if they want resort resources. We call them right away the same day and, like I said so, nine o'clock at night. If we do not reach them, you know we call them a few times to try to get in contact with them and right now, we've helped about over 1500 people since the start of the program. So that's about 45 percent who live in the Inwood and Washington Heights area, the most of the clients on that we serve in the area a few in the Bronx and then occasionally we get Queens Brooklyn and Staten island. When we help out other Cbo's notice that most clients appreciate the daily check-, Ins and I'll be connected to the resources that they need. For example, we have clients that do not require any resources, but they just need someone to talk to or someone to answer questions for them. I've even had calls that the whole time well most of the time, I'm just listening to their concerns. I've had some clients that they live alone and most of their family are out of the state. So apart from you know, helping them connect to physical resources. I think part of our job is just to help them with emotional. You know support in general and it has been like one of the most gratifying parts of our of our job right. So we're going to move on to the question so we're going to try our best to answer your questions, yeah, all right, so, okay, so I'll denise to Taina, so you're not doing any of the act. The tracing you're doing the follow- up step afterwards, when people are isolated, you're reaching out to the to them to see what they need to make them so they'll be comfortable and have have the ability to to handle being by themselves or being isolated for ten to four exactly okay. So yes, that's correct! Okay! So now I understand, what's meant by the resource, navigator and and so really you're. There's no reason why anybody should resist talking to you because you're not you're, not asking them to disclose any private information or there's no reason for them to be fearful of talking to you, because all you're doing is giving them help right. Is that correct yeah we give them isolation, tips and help. I'm sorry. We do not take into account everyone's like immigration status or nothing like that. We do not ask those kinds of questions. It would make sense that whoever you reach out to is going to be responsive because you're just you're not asking them to disclose anything yeah, I'm correct some people be hesitant at the beginning. I think once we start explaining a little bit more about our roles and what the purpose of the call is, they do start opening up a little bit more to the idea of having someone help them during the time, and I think, just in general, some people are not open to the idea of receiving help from anyone that they know so. Yeah. I think us being strangers, helps in a way yeah. So most of our clients are definitely open to receiving the resources available right and they also the just to clarify the contact. Tracer actually calls them every day, so sometimes they'll say tell me. Oh. I already spoke to someone from your department, but I'm like well. I noticed that you know you request the resources and they're like oh okay, yes, no you're right! This is something different, so they call them every day just to monitor their symptoms and then give them the okay when they can leave their home, where our job is while they're home to make sure that they stay home like if they need food, we'll send them food. You know medication, delivery. You know. Some people need diapers things like that. So that way they do not leave their home if they can't afford to buy it. You know on websites like instacart we've found free delivery services, there's a lot of non- profits that have started that are giving. You know have volunteers that are doing the grocery shopping for absolutely free, but the true you do not have tracers or do you at nimic are traces. Are there any okay, all right all right now, I understand what your role is. I did not know that before that's great okay. Are there any questions from committee members from any members of the board or the public daryl? Are you checking the chat ah hold on a second, while we're doing that? I just want to thank them for doing this work. It's very important work. This is tanya from Community Board. Thank you for doing this work. It's vital and- and you know, and you know, helping people stay, feel safe and secure and confident. I know it can be scary coming down with this. You know virus and people who are alone, and so thank you for all of that, so yeah absolutely yeah. Thank you for the acknowledgement. Yeah, that's right, yeah, I think Sanji makes a good point. I mean you must be playing an important role just to reassure people that you know that they're going to be okay, that they can survive this ordeal right. They are stressed yeah. I remember at the beginning of it all at the beginning of this program. A lot of my calls were very like emotionally driven people were just honestly scared. They felt alone they were in complete quarantine. So if you take all that into consideration and then obviously receiving the a positive you know test result, it was a lot. So definitely I think our job has been very important during this time. Daryl do we have anyone else in the chat. There was not no questions in the chat. All right, very good, all right! Thank you so much! Thank you! Everyone! Thank you. Could you email the powerpoint to me? Please absolutely the Facebook videos I mentioned that we'll also send along the link to the video that Dana, I think, there's a kid that wants to get in on the action here. I do not know where that's coming from hey Janil. Are you with us Janil edwards? Yes, I'm still here, Steve all right. All right Jenelle is the community affairs Associated Columbia University Irving medical center hi everyone having a great evening. I'm sorry, you can't see me I'm having technical difficulties, but any information that I share. I will be sending in a follow- up report to Steve and he can then disseminate the information to everyone in the committee and to the wider board. So my report is very brief. I'll start with an upcoming event, we're having on October 14th from five to seven we're having the cymp election forum, we've invited a number of panelists a number of students from every school to ask what are the most pertinent and relevant questions that voters really should consider in regards to the upcoming election. This is nonpartisan and we do have experts from acrosss the aisle to provide a balanced or a wider range of viewpoints and we're really expecting it to be a great event. Again. It's October 14th from five to seven it'll, be on zoom. You can register or watch the live stream online really quickly. The url is neighbors.columbia.edu election I'll also send that to Steve and a follow- up along with the fire. Once it's been finalized, all right are you going to mention? Are you going to make sure that the person who speaks for trump does not keep interrupting the speaker for abiding? Well, I see you actually watch the the debate and we do not have surrogates from the campaign mute if you're, not speaking, please thank you. We're inviting health policy experts to shine a light on the issues that you know: okay, that's one, that's much better, very good yeah, so even balanced, helpful and hopefully informative discussion and the public will be invited to ask questions as well: okay, yeah. The second update Steve has asked about some information, so we weekly, Acrosss, Columbia, University, there's information available on who is being tested, or rather the numbers of who's being tested, acrosss, all campuses and that information is found at cobit19.columbia.edu againcova19.columbia.edu. So as of the week of the 21st to the 27th, approximately or exactly 2,988, people were tested, acrosss all campuses and at the medical center 608 people were tested, and there was one positive test that information is updated weekly. I am not in charge of that, so I do not have access to the numbers, but this is publicly available and you can see all the way back to June the data there and I'm sorry that 608 were tested during what period of time from the 21st of September to the 27th. That's the most recent data that's available on the site, and there was only one positive case. Only one positive: okay, all right are there any questions from the committee members any from the board members anything from the public down. Do we have anything in the chat? No, we do not. Okay, all right! Thank you, janil you're, going to send me something. Yes, I will. I definitely will all right. Thank you. All right have a great evening: okay, bye, okay! Next the is Geriatric Center, Betty Lieben, director of marketing and communication. Okay, hi everyone. Can you hear me? Yes, can you hear me? Okay, great? We are stable at isabel in the sense that we have had no nuclear preserved program. We are testing our screening, all staff members every day and testing everybody once a week. We call them the so any employee who works with Isabella is tested. Once a week we maintain a hotline from anybody with family, any family members who have relatives in Isabella. We are maintaining a hotline where family members can call in and get status reports on their loved ones. It's a hotline that is staffed by social workers who are able to respond in an intelligent manner as to the status. We are also providing window visits which are scheduled for periods of half an hour for family members who want to visit with the arms coming cold weather. We are investigating, obviously the potential of moving those visits inside, but that's going to really depend on the regulations that are provided to us by New, York state and the federal government, so we're very closely adhering to whatever the state and the federal government determined would be appropriate. Our community programs continue to function, but in a remote manner we have the we have three northern north Programs retirement programs in the community. We have a senior resource center, which provides benefit counseling, and we have the upcoming partnership with senior independence. All of those staff members are working remotely and are in touch with their clients through telephone calls, etc. What else can I tell you? We have equipment enough with equipment for our staff. We continue to monitor that, because homes we're very prepared for that and that's it. I will send you a report steve, so you can see yeah. The connection is was very strange, so I did not I'll need the report, because I did not pick up on everything and I do I do. I do want to point out that you know I've been checking the the state Health Department reports and the latest one from yesterday indicates that, as you mentioned, there have been no additional Covid-19 cases that isabella since the last report. From about two of them checked, I guess things are things are hopefully returning to normal and what is the? I think I can't believe I forgot. What's the name of the program that you have, the mutual Llamas senior citizen communities actually naturally occurring retirement communities, and are you still conducting that program? Yes, we are. We have social workers and nurses and so forth. What we can do is be in person visits because of coving, but we do stay in touch with all the clients through the telephone and the computer, knowing Webex and Zoom and so forth. So we're doing the best we can with the technology. Yeah. All right are any questions from the committee. Any questions from board members do we have anything from the public. Thank you. Betty all right. We're up to our discussion about the fy are 22 budget priorities. I said to everybody last year's list of Fy 21 priorities, and last year we had 10 expense budget priorities and we had three or four for on the capital side. So one we could, we could go through them, one by one. The first one for the committee and the which also became the first one for the board as a whole was to expand mental health services in the community, including the crisis, intervention and acute care for persons with severe mental illness, and I think Mary Anderson wants to speak on this topic. You're. Absolutely right. I heard you from the other room. I said this is my cue. We actually talked about this in our committee this morning and we were in agreement to leave this issue on your budget, help with the hope that you would add a statement, something that we came up with or something similar to it, so that the seniors would be included in this mental health need. The addition is especially seniors whose mental health and Social engagement have been adversely of impacted by Covid-19.. So well, you can email that to me right. Yes, I can okay, but do me a favor say it one more time, especially seniors sure enough, especially seniors whose mental health and Social engagement have been adversely impacted by Covid-19. That sounds pretty good to me. Can I hear what other committee members think about that? I agree Mary thank you for including other populations and, I think, definitely covey. I was going to say the same thing. Thank you Mary I was going to say. Can we include Covid-19 and mental health around covey, because people have been isolated? I do think grass seniors, but also others who might be impacted by Covid-19. You know we had the doctor who committed suicide right. You know and I'm not trying to be that person who says. But what about you know what I mean, I'm not trying to be that person, but I'm just saying that you know other people are also being impacted. So maybe we can include this way Mary. You do not have a problem with that. Do you I'm sorry, you do not have a problem with that. Do you no as long as we, you know, add seniors in there as well, because all right I hear that we have a consensus on that point. Okay, Steve, why do not we change it to those those of those just covered, related stress and isolation? Well, I do not know how many I do not know how many words were allowed, but I'll put in as many as I can wait and Kathy said: Grief counseling. I think that's really good. She put it in the chat, the grief counseling, what kind of counseling grief Counseling Kathy put that in the chat right? I guess my comment Steve. This is Sally. I do not know how to write. I think this is Sally. I do not. I do not see how on Webex to raise my hand, so I apologize okay go ahead. The needs for mental health services are for all populations. I think the people with severe mental illness are probably the most impacted because they have not had access to inpatient care, so I would not want to elevate one population over. I think that maybe if we had something to say, especially in light of this significant challenges posed to all populations by Covid-19, rather than point out specific populations with the elderly, I think it's happened with school children. I think it's happened with families that do not have support services. I think it's pretty much acrosss the board and I worry by favoring one population over the other, especially given that I work with people with severe mental illness, and that is desperately a need. I'd like to be able to acknowledge the work of our fellow committee, so I would like to let me try to work on this by the time of the General Board, Meeting or the public. We have a public hearing which I think has been scheduled for right for two weeks from now, we'll come up with some language, hopefully that you'll find agreeable. Okay, all right, any other comments on this one. Okay, number! Two excuse me: I have something else I just wanted to add. I agree with that with Sally, because you know I'm a retired psychiatric nurse, so I you know, that's who I worked. You know the acute population, but the problem is that seniors have not had sufficient mental health services. To begin with, in all these years, we've been trying to get some mental health services specifically for seniors, so we really want to get that addressed endless, it's even worse. It's even worse. Now there are more people impact with more seniors impacted yeah, I'm going to I'm going to work it in okay. Our number two priority was hello: yeah. Okay, number two priority was to increase substance abuse services, including opioid, Overdose prevention, education and funding for syringe, cleanups and collections. I found it interesting when we had the Ems Presentation last month that the Ems Captain told us that, during the open 19 epidemic, there had been a reduction in overdoses in our area, who I mean who's to say how long that will go on for, but are there any comments on the on what we should do about this one? I would say we keep it because I think the problem is there. I just you know we still do not have the impatient facilities that we need all right. Well, this would really address outpatient situations, but it okay. I do not hear anyone objecting so we'll keep it number three on our list was to increase HIV, AIDS prevention and treatment, services and lgbtq services in our community. This was number three on our list and number 13 on the boards list team. I would like to move up and see if we can move up. You see the number eight with the trash. Well, we did not get there yet hold on. I'm sorry, I'm sorry you're not allowed to jump ahead. Okay, see you later, okay, I want to jump that one ahead. Yes, but but not yet do you want to say anything about HIV AIDS? Keep it all right leave it keep it! Okay, yes, okay! Number four on our list and number 11 on the boards list: increased services to prevent and treat chronic diseases such as Alzheimer's, diabetes, cancer and heart disease in our community. Any comments on this one keep it. Okay, who said that Barbara. I think that all the non- code illnesses are as important, if not more important, because okay, very good okay, can we can. We include like- and I do not you know- maybe we have not gotten there yet, but how you know those recover. Those who've had Covid-19 and will have long- term effects from it. So maybe just adding that adding that in there and also daryl, but because of Covid-19 people are more susceptible who have some of these conditions, people who have diabetes, you know heart disease. You know, I would even say hypertension which in here that we left out, but I think hypertension should be included, but those are things that make it susceptible. Maybe we can include that language. It might help them to like move it up on there on the overall ranking. I do not know what did you just say? We should add hypertension, yes, okay! Well, that's called like Covid-19, you know as well as Covid-19 colon is not a chronic disease. It's not, but I think, there's people that are going to be suffering from the impact of it for a long time that yeah they need services that do not currently exist, but it also makes you more susceptible to Covid-19, though, if you have some of these conditions- and I think maybe we should say that you know but yeah okay, we could we could do we're allowed like another 25 words to explain the the request, but maybe what Daryl is bringing up should stand on its own as a separate item, because it's a new, it's really a new thought that that special services needed to treat to deal with people who were who are recovering from Culver. Okay, that that works too. The new phrase that increased susceptibility to Covid-19 excuse me, then you could use the phrase that increased susceptibility to Covid-19 conditions that increase susceptibility. Yeah, that's a good one, okay, but that, but that would go into our existing item. Should we should we should we have a separate one that just talks about providing services to people recovering from Covid-19? You know that's putting in a very long list and the shot to get things ranked high is to not have such a long list. Yeah, that's true too. Okay, let's say I was. I would incorporate it into number four all right. Let's keep going number five, which was number 20 on the boards list, was to provide funding to ensure that all local public schools have health clinics. Well, since the schools are closed, I will downgrade that for this year, all right, but I do not want to lose it reopened. Well, yeah, not so much. Not so much is it the promise that my friend is already happening, though I would keep it on keep it on, but put it lower of that already happening in progress or no. I do not think it is okay. I mean I heard about nurses and social workers, maybe not clinics like we say. I think it's still a priority of the borough president, but I think it's not yet been accomplished and I think it is important to keep it on is Julio still on the call. It does not look like good enough. No okay, all right number. Six on our list. Number 17 on the boards list was to increase staff to conduct regular noise enforcement, air quality monitoring and water quality testing. Yes, and then that one I would I would not. I would for number six and provide funding for decimal leaders to the NYPD for the 34th and 33th would not that be on, would not that be on the public safety request list. We can do it together with them. Yes, you know something you're right who said nationally sally yeah, but we can do that together with them, because you can not do noise enforcement without a comfortable meter. So but Steve you'll talk to curtis to see who should get it yeah, he has to get it because it's it's the police department that would have to buy them. It's a budget item for the police, we're the first ones to meet this month. So that's true, very good. Well, I would like that wording in there so that it does not get lost, and I do not like it. We can't we can't put it in all Steve is saying is that he will make sure that it's in curtis's, because we're not allowed to request that no okay number seven on our list and number 23 on the board's list. Is you increase pest control, efforts to eliminate rats, cockroaches, etc in our community, move it move it down, move it down. Okay, I say up, I want it rank high okay, I know, but I think it's become a bigger issue and will become a bigger issue with this outdoor dining. Yes, yeah. I want it in the top five top five. Well, okay. Well, he can we talk about the specific ranking after we finish. Maybe yes see they're not considered pest control, but did you see the story yesterday that we're now doing a special birth control effort with raccoons? I know, but I'm glad to hear it because I have to drive them all the time. Yeah we're going to we're going to be throwing a little package that look like like the ketchup packets in the frosted areas, where we know raccoons, hang out and hopefully they're going to eat them and they're going to be sterilized. You may end up seeing fewer raccoons. Where was I pest control? Okay, this is one barbara. I do not care what you say: Barbara this one belongs to the camp: five of increased transparency collection on commercial streets on weekends, in district 12.. Actually I do not want to say weekends anymore. I want to say every single day. Yes, I also I want this to stop for the they only put trash baskets supposedly on a commercial street, for example, there would be none on Bennett Avenue. Another avenue that's wrong. Could we also add something about recycling in here? Steve next item sally number, nine, which is thirty six on the board list- is to increase funding education and outreach on recycling, reuse and composting, as well as proper disposal of household garbage. Thank you Steve. You have not answered. No one has spoken to my comment that they only put trash baskets at certain commercial corners, and that means that, for example, on the Upper East side, you will find trash baskets on residential streets, but they do not put them on residential streets up here. So Bennett Avenue will not have a catch basket. Seaman Avenue will not have a task basket, even though there's very much a need for the Washington Avenue. Unless it's a commercial, I think seventh street will not trash incorrectly. I do not know have not. They said that it's just very costly. Well, I do not know how can I mean they're trying I live on a residential street. There are baskets on my street yeah. Let me look into that. May not be a budget issue, but let me let me look into that and that could be council member requests too specific. No, it does not make sense to me. Okay, number. Okay, that's number! Ten! I know that's number nine number ten was to create an educational campaign about the federal public charge rule to inform immigrants of their rights to obtain health services and other has benefits been dealt with. I think by a court decision and have you been staying up to date on this? The last I heard is that it sort of fell off the radar, but the last I heard is that they were going forward with that there was that executive order. I thought I read is that is that there was a federal court decision saying that they could not impose this rule. I would have to check Steve. I have to admit I do not know, I'm sorry, okay, why do not we both check before now and yeah and the public hearing? Yes, actually? No, we have to do it in the next couple of days, because I'm going to have to I'm going to have to say: okay, very good, I'll check tomorrow. First thing: okay and Steve- also, you know, I think, related to the one we were just talking about earlier. Littering enforcement that was brought up in the chat is that I do not know what the enforcement is for. There is not any, I mean, that's like what they have to catch someone in the act right, yes right, even though we used to have in the old days we used to have a sanitation police officer assigned just to our district. I do not know what happened to those officers. I think that's something else. We should look into what's our opinion, because you would know, I'm sorry go ahead. Yeah I just I do not know you might say this is not our area, but do you want to add when we talk about trash collection, that we add parks in there or is that out of our reach, no yeah? That goes to the parks Department that goes to the community? Oh okay, all right, no problem, but but when you go to the Parks Committee, the Parks Committee, hopefully is going to prioritize increasing the Parks Department movement staff that the parks Department lost, 1700 seasonal workers, many of whom have been doing a garbage cleanup during the summer wow. Thank you. I heard all about that: okay is okay, so we've gone through our priorities. Can we talk about adding things? Okay, go ahead, Mrs, Fisher yeah, I would say something about food has not that been. One of the biggest needs in our community is providing adequate food to people who are without during this pandemic, and I think we can comment on access to food. It does seem to be an environmental justice issue, but we're talking what's budget here. So what are we asking cruz? What do we need to do? We're asking the city to provide access to healthy food for populations that need, including you know, the elderly, including families, including those without so is that more funding for food pantries? Is that what you're? Specifically, I guess- food pantries food distribution? Ideally we're going to have something in there parks and cultural affairs about homeland some of the stuff we've talked about with the Washington Heights inward Food Council in terms of increasing access to farmable land, so we can actually grow healthy food. Okay, but but Daryl has put his finger on it. I think if we were to phrase it they would. We funding provided for food, pantries and and distribution sites that would that would yeah. I think that makes good sense. Sorry, there's no reason at least I do not know where the hand feature is here on my phone, but I was going to ask about that because I feel like maybe we might want to check with ariel considering that they might also put food on their housing and oh Human services pantries. All right, let me find out where that money comes from and which city agency yeah. I think it may be something that falls under human services, not under us. Okay, as long as it goes somewhere. Yes, okay, yeah all right. So it's like it's like the decimal meters as long as it goes somewhere. Okay, all right! So all right, so we have an agreement that mental health services will remain as number one on the list wait. Steve, can we add one more and making it kind of really a nice conversation around increased funding for targeted Psas around Covid-19 prevention and intervention services, perhaps increase funding, for what did I say: oh yeah increase funding for targeted psa on Covid-19 prevention and support services. I think, what's kind of like focused, at least for me- is really particular around like targeted, psa and interventions. There should be models for interventions, as we've had as you've seen like in the HIV epidemic and in other cases, and I think that touches on a broader issue of just Covid-19 in general and putting some sort of expense. You know budget item in there for that. Like Covid-19 prevention, you know communications targeting underserved communities which could not even include just masks. You know. Well, I do not. I think it's right to emphasize the engine as we've learned tonight, it's right to emphasize, I think, doing more educational outreach. I think that would be a good thing for us to do so public education, so I would not want to just mention Psas. I would want to mention an educational outreach campaign, including Psas. Can I just ask one question about that: I walked in late to her presentation, so I did not want to bring it up, but when she depends on community leaders, community organizations, elected officials and stuff that does not really work. What about people that teenagers pay attention to like celebrities? I mean why are not we getting people that they'll actually listen to influencers yeah? I mean well that well. That would be the point I think of the psa. The rest of it to me is just a bunch of noise that they're going to disregard like they disregard everything else and unfortunately it's not just teenagers. It's grown people who are not wearing masks. You know there was a word in there that you wanted to add. Sally's point sorry to Sally's point: it's really. I guess my point in bringing it up. It was not about, like just you know: mass free-, for-, alls education, flyering, free-, for- alls, because we know that does not work. It's really about. We have to have intervention models that do deeper work and not that, like surface you know event- based work if that makes sense. So that's why I was saying like as long as it. You know we can fit it in there. We do not. I do not think we have to specify the population but ensuring that they're that it is a targeted intervention for those who are. You know out of reach whose numbers are climbing, like we can kind of phrase that a little bit better, but it has to be something: that's a targeted model all right well, but an educational outreach campaign that includes Psas no yeah as long as it's hit in the Pandora stations of the people who need it or spotify. Whichever way, all right did I get a sign off from catherine. Yes, it's built Steve. Excuse me, I think you did yeah, okay, all right. So at the moment we have. We have 11 expense items as we're, adding this one and going back to the beginning. Now mental health services is going to remain as number one services do we want to do. We want to keep that as number two? Yes, yeah, okay, I know one's going to agree with me, but I feel I think number four probably could end up number two because we're in the middle of the Kovic thing crisis and I think that it takes on a new importance, all right tanya, since no one is going to agree with you. I will I'm just saying because with the kobe and we saw how people were dying and because they had these conditions right from Kobe, it makes people more susceptible. Yeah number do not say anything do not say anything more. You've already convinced me, okay, all right! All right! Do we have an agreement on that one yeah! I do not understand what is that? What are we looking for agreement on moving? What is now number four with additional language about how we're trying to deal with traditionally increased susceptibility to clover 19. we're moving that up to number two on our list. That's fine with me all right, very good, okay, okay, so number three on our list was HIV AIDS prevention and services. So that becomes number four. Then, at this moment it's number four number. Five would be a funding to ensure that all local public schools have health clinics. I assume we'll keep that, as for the moment, just put that down a little bit. I put that down a little bit. I would actually put the pest control above it has control above okay, so we're going to bump it down to maybe number eight or nine yeah. Yes, okay, I would like to argue for either the noise enforcement or for the Trash Basket collection. I mean, I think, and the noise enforcement has been the biggest issue this summer yeah, I agree, but the trash basket collection has been has been deployed, absolutely awful. So how about how about? If we make a noise number three and trans basket number four fine. I agree. Okay and then what's number five for after that. Is that HIV AIDS? Oh God? Can I just? Oh god happened? Yes, HIV AIDS is number five. Did we lose Steve, I heard, oh god, and then he was then I saw him moving. I think he that he did leave us he'll, probably log back no he's his thing is right: there is, he he's logged in oh shoot and he's unmuted. My agency got rid of webex yeah. I agree too, I've been going. I think we're only we're only doing it because there's two other meetings happening right now, oh okay, by the way, I think that's the only reason I put two comments in chat and it says telepresence is not allowed to chat and it looks like my comments were not recorded. I do not see my comments recorded. I have not seen a comment from you, no yeah, so are you doing it to everyone? Yes, but I do not know any other way yeah. I have not seen anything Steve. Actually, let me add a comment. I do not know. If she's on the phone, please call Steve on the phone hello Jay go ahead. Jay I was unable to open up both the priorities and the agenda and I'm not really doing a very good job of navigating Webex either. So I find this all extremely unhelpful. It is definitely more of a challenge that is for sure I opened up the the agenda and the my email, I'm holding it in my hand, in my iphone, while I have the meeting on my tablet that might help if you have both Jane, I just tried putting something in the chat. Well, what is it really does? Not you can? Oh, you can kind of see it. Okay. Can you? Can you hear me? Well, we thought you were dead Steve. What's up? Yes, you fell and you could not get up or something that was my phone died. Oh your phone's dead, not you! Okay, all right, yeah! Well, yeah! It's not it's! Not it's not one and the same, please! Okay! So the last thing I said was that I was proposing that noise enforcement be number three and the Trans Trash basket. Collection be number four right and I was about to say number five, which one HIV AIDS well. Actually I was about to say that the new item about increasing the targeted outreach for Covid-19. I thought that should be number five. I think, honestly, we can move trash down to number. What would that be? Six? The only problem is that's a huge public health issue yeah, you know, and I it's something take responsibility for, whereas the noise is really going to fall over to public safety in terms of getting that addressed, I just even though it is a public health concern. I just worry about how our streets look now and without really pushing this aggressively. How they're going to look. I somewhat disagree. I would. I would say that noise is a public health issue, exactly I will continue and we've had. You know. I estimate 75,000 people this summer, whose lives have been turned into questioning. I'm not questioning the solutions in terms of getting funding from solutions, I'm not sure what solutions we can get funded out of the committee yeah. No, I well. I think you make a good point, because what we're suggesting here is that that the noise enforcement be be provided by DEP, which is not really the answer to our question in our community with what happened under this problem. It's not it's not really a budget issue for DEP that, to that extent right, but it is, but it is, though, if DEP can also enforce, if also they also have noise meters. No, that's! No! Yes, true, but but the things that they enforce against are not necessarily the things that we're most concerned about that have been bothering us over the summer. Listen I'm not I'm a big support. You know I do not want to reduce. I do not want to. I do not want to downplay this for this issue at all, but but I would I just do not want to keep it as a high item on our list. But do we have an agreement, though, that this new item about targeted outreach on should be number should be number five? Yes, okay, excluding the head of HIV AIDS where's that yeah where's HIV AIDS, then so that would that would that would either be six or if you want to jump it ahead, is substance abuse it would be number six yeah. Six is good. All right substance abuse will be seven sure all right. So then we have all right. Now it's up to you, hello, yeah! Oh then, next on our list is either pest control or the health clinics in schools or education and outreach on recycling past control. I do not support pest control yeah. I agree with what people were saying about that. I see that now, yeah all right control, pest control is number eight okay. What was number three and four speed? What is number three four yeah now number three is another thing: is noise enforcement and number four trash basket collection, but actually those numbers one second one. Second, I actually now want to flip it. I convinced myself that that, since DEP is not going to be the primary enforcer, I would want to make that number four and move up litter basket. To number three. Did somebody say? Yes, yeah? That's, fine, okay, very good, okay! So now we're, where is it? Is that an issue throughout the district? I'm just curious, which one with the trash basket? Yeah, absolutely gross? Yes, number, nine on the list. Now it's either recycling or child health clinics come on. It's got ta, be child health clinics, okay and are there any parents, but I would change the warning because you know at a child. Health clinic refers to a children's aid society operation where, like, for example, they actually have a dentist on site and a whole deal. I think that we could say ensure that all local public schools have can we stay or is this optimally, this caving in optimally a health clinic for at least a licensed social worker and nurse? I like that, because I was thinking like it's really about access making, sure there's a nurse and a social worker. Well, there's a separate program to provide social workers for every school. But, okay, you know something yeah we'll do that: okay, very good and I'm going to find an adjective either comprehensive or multi- service health clinic right. We need to know nurse and build toward a comprehensive health clinic sounds good all right. Let me look at that. Okay, look at that see what you think: okay, very good, okay, so we now have our list. Oh no, we have the capital budget, the capital budget. We have three items number one on our list last year was to expedite the replacement of old water mains and sewer lines in our community, which has been going on. It was number 12 on the boards list. Number two was to provide additional garbage collection, trucks and street sweepers, which is number 13 on the board list, and number three was to install green infrastructure such as bio swales, to divert storm water from the solar system, and that was number 18 on the board list. Do we want to keep them in that order? I think so yeah the board. The board seemed to agree with that order. So why do not we just say with that order? Oh by the way, where all do we need more new water mains, the stuff up on park terrace is been completed almost. Where else is it a big pressure in the community to get more new water mains and sewer lines? Well, you know something. That's a very good question. My you know, I think, maybe the other side of the broadway won't the new rezoned area mean it unfortunately yeah. Well, you know some of you. Yes, and as a and part of that reasoning, I think provided for a a study that was going to point out where new water mains might be needed. We need to go back and revisit that, but let me look at that. Okay, if you remember years ago, when Stan Michaels was still a city councilman, I remember a long broedcast along with that one. You remember Steve years ago, when Michael was still city councilman along Broadway, along Fort Truman Park, like by where I am on hillsides. There was a long there, huge black pike that were laying there and then eventually got poking foot in the ground. Remember those big black pipes were those sewer lines or water. I do not know. I remember we had the most awful experience with the replacement of the water main along Kitten Avenue. It took forever, but I do not really remember those days, okay, so, but I'm just saying so, I think in the 80s, but I'm just saying I stand with city councilman in the 80s that these big I mean I'm telling you they were like two feet wide or more yeah, no yeah. There was a lot of things, so I'm sorry, I think we wrapped up the capital expenses. Do I hear a motion to accept our proposed list? I make a motion. Second, I'm sorry who, okay, who made the motion sally seconded by Daryl? Oh, you made the motion yeah all right, Betty and Daryl okay. So I vote. Yes, betty votes! Yes tanya. How are you voting tanya? Yes, I vote. Yes, Daryl votes! Yes, catherine, how are you voting? Yes, catherine? Yes, Sally wrote, yes, Barbara voces Jay. How are you voting? Yes, yeah? Okay, that's one, two, three, four: five, six, seven, eight yeses! That means that nobody's voting no and nobody's abstaining. Okay, very good. What about the oh? Do we ask the other board members who are not on the committee or when we do not? Oh god, yeah? Okay, very good, other board members. We have Mary and maybe Maria Luna. I vote yes, Maria. Are you with us? No maria? Okay, any other board members on the call Richard Allman that one Mr allman? How do you vote? Yes, Sir members of the public can't I do not have that capability. Okay, no members of the public should vote, and it's that oh okay, well, can we, if they can they indicate so in the chat? No, let them indicate if they're voting, yes, no or abstaining, and then you can, let me know bernard and our government voted yes, okay! Well, that's one! Yes I'll cut and paste it all and email it to you again all right! Thank you! So much. Okay. Next item on the agenda, we've got the freaking agenda here. Okay, agenda, all right! I'm still working on the resolution on fireworks, so it'll be on the agenda for the next month's meeting. I'm sorry about that! I could not get it finished for tonight. The old Business DEP service request. I sent you all the latest report for September. I can't believe it's. They already had this report completed today to send it to me, even though the last day of September was only yesterday so 623 complaints, the number one complaint for September running hydrants number, two complaint construction before and after hours, and the number three complaint was ice cream noise from ice cream trucks. Okay, the the city is back to to to raiding clean streets and sidewalks. The the rating for the rating for August for our streets was 92 percent, someone still rising, but the rating the rating for July was only 69.9 percent. I believe and in terms of sidewalks the forum for the first fiscal quarter. So this is July August, July oldest in September the rating was 98, and a year ago it was 99.7. We planted the Ryan health center. What maybe the one of the major health developments in our community in years has now opened it's a new facility at on Wadford Avenue, just south of 181St Street, if you're in the neighborhood, maybe you should drop in and visit, I'm going to try to get there as soon as I can did it open. What's that when did it open Monday? Oh, very good! This is a very significant development. Just our grants on the Ark. Excuse me: what's the progress on Ark Senior Center? Oh, I do not know. I think I think they said the end the end of the year end of the year. Okay, all right is there any other old business. Is there any new business? I have an announcement, we're not there. Yet. Okay, no new business, we're up to up to announcements. I recognize Mr Cochran, okay, just a quick one. Obviously we're now in October, all the committees are going through the budget cycle, also in October the traffic and transportation committee. Here's street co- naming requests and there will be one at the upcoming one on Monday to rename or to co- name 168th between Broadway and for Washington Healthcare heroes, wedding yeah. Let me just say about that. You know I still have an issue with the fact that the hospital has not been responsive to us and has not provided us with the basic physical information about the number of patients with cover 19 that they have been treating, and all this echoing going on. Excuse me this echo one going on. Oh echoing. Well I to me that's important information that we should have the basis for that resolution and there's two of you now Mary. I do not know why I do not know can't understand any of it but Steve. Yes, I understand what you're saying I think, there's a need to I to me: that's it's important that we get this information from the hospital and there's no legitimate reason why they do not provide it and it provided for the whole system, but yeah you're not specific to well. I think the board should I think the board could back up. I think the board should back us up on this request and I do not think we should let the hospital off the hook. So I mean I do not think that's the place for it, but I hear you well. I think, if we're going to declare it Healthcare Hero's way, we should know how many people's lives were actually saved, how many people were treated? What actually was the impact of what was being done in that institution and I do not want to see them up on a stage being glorified when they're being so resistant and not providing basic information to our board. I feel very strongly about this, so I think I think you need to talk to Ross and to well not issues with Ross, but I am going to have a follow- up conversation with people at the hospital. So I will let you know what happens with that conversation. Thank you, okay is is. Are there any other announcements all right hearing? None. I think we can it's now 906.. We can adjourn the meeting. Okay, all right, all right! Thank you, barbara you're, muted, good evening, everybody good night, bye-, bye, bye, everybody, okay, bye! Thank you! All yeah, daryl you'll send me the chat stuff right, hello. Yes,.",
            "summary": "There are so many people that we really need to do the right thing, for, and that really means to stay home if you're, sick, we're face covering when you're in public really do not gather in large crowds with people who are not your immediate family members, because we're seeing that this is as a result of this behavior we're seeing significant increases in cases, and We want everyone to go, get tested so that the data is as accurate as possible, and the reason why we want people to get tested is so that we can really go and mitigate and prevent these clusters from spreading into larger community transmission and where we have to revert back to the beginning of this pandemic.\nI mean we've got more cases, but the number of people who have died from Covid-19 in all four of our zip codes appears to have remained stable, at least for the last month or so, and if we do not seem to have had any additional deaths which which at least is you know much better than where we were just a few months.\nI've been getting a lot of feedback from community boards and community members about why our statistics and our data are based on we're talking about rate based on a number of a hundred thousand per like per population or whatever, because each neighborhood in each zip code obviously does not have a hundred thousand people.\nI think we've requested to our data team, to like include like a chart, maybe on our website, explain the difference between actual number and rate.\nWhat's caused confusion among folks when they're looking at our data page I have to say that you know I'm going to hear your report tonight, because you're saying that in zip, code, 40 there's a downward trend, because the story yesterday seemed to suggest that we might be at some kind of critical stage with an uptick in in the percentage of reported cases.\nI mean it might have been an upward trend, for you know the previous couple of weeks, but then just in the last two weeks with the percentage of folks testing positive we're seeing it going back.\nLet us know, because that's where we can deploy resources to whether it's educational materials, whether it's actual face coverings for folks to wear, I, would say: important.\nI, think typically, where outdoor spaces are okay, as long as people do continue to do their social distancing and wearing face coverings around folks who are not your immediate family, members, who've been in the same household with, but if you're having parties birthday parties in the park, I mean that still, you know, could elevate the chances of transmission to that group of folks.\nFar up to this point, where we are now seeing these large gatherings we're seeing like venues where having parties indoors with no face coverings- I do not know if this has already been covered, but in Inwood Hill park, there's been very little mask wearing very little social distancing.\nIt's, a group of city inspectors from multiple agencies, where they're being asked to do work to go out to educate folks, but also to do you know the indoor, dining inspections, the outdoor, dining inspections, making sure that everybody is following these social distances.\nThat is creating an issue, because not only do we have resources that the state has had resources allocated for inspections of those industries So for restaurants, specifically there's the power of the SLA and there's you know specific dedicated folks from the state and the city who could be deployed to do inspections and issue fines and do all of that and take away liquor licenses if they are creating a situation where people are gathering And they're, not following any of the guidelines for reopening when it comes to knocking down doors in people's homes.\nI. Just do not think that we would have the capacity to go to individual house parties, but what we could do would be to work on educating, specific demographics and so earlier on in the summer when we were seeing young folks going out- And, you know going to sidewalk bars.\nYou know people are very fearful of law enforcement, and so we want to make that messaging very clear that none of your information will be forwarded to ice.\nYou know just because you test positive for Covid-19 Does not mean it's going to impact your citizenship.\nHearing on social media goes counter to everything that we, as a public health agency, is saying so like we are trying to combat all of those things, and I.\nCertain folks are never going to listen to what the New York City, Health Department is going to say, and so we really need those partners we're not talking about young kids, Either we're talking about we're talking about 30:40 50 year old people They have jobs, they work.\nYou, know they're, like sort of like regular people, but they are on the street not wearing masks close up drinking the drunker.\nSo I would like to know how much would it cost, or could we investigate that the police, the 34th precinct, be so the patrol cars be supplied with effective decibel meters, because one thing that holds them back from actually issuing summons or dealing with this problem is that they have to have effective decibel meters so that they can say well.\nIf you know the Department of Health is able to do anything about that or work with BLP So I mean that again is being coordinated under the mayor's office of special enforcement.\nIn, my area, I live in Every single restaurant has outdoor tables And there's one or two that are okay, because they're only able to put like two tables outside, but The ones that are able to put you know a lot of tables outside they're on top of each other, You know all of the coughing and breathing and whatever that you're already on top of each other, is going to be exacerbated, okay, all right, anyone else from from the committee or the board.\nSo, in regards to what pauline was just saying before about elected officials, doing outreach and trying to educate people in the neighborhood So I just wanted to say that I had called Mark Levine's office.\nWe've been doing this since February now it's time for the local government to enforce, and he said if mayor De Blasio, he did not mention his name, but I know that's who he was talking about if he does not want to step up to the plate.\nAll of the places of concern, and I will definitely reach out to the mayor's office, and maybe we can work together on a you know, day of action, where there's dedicated resources to your community, specifically, so that we can get that information out there and really change minds and hearts and hopefully get people to behave a little bit.\nIt's a public health initiative to fight Covid-19 so that where new yorkers can get back to school back to work, so that way the businesses and other organizations can reopen safely.\nWhen it comes to the tracing part, the contact tracer, it's very important that when people see a phone, call, And I know you guys mentioned it earlier when they see a phone call that says NYC Test& Trace, that they pick up the phone because most likely it's a contact, racer calling them to share that they've been exposed to someone who has you know has tested positive for cover, 19.\nThey we've been having that department's been doing really well with you know, reaching out to people and getting in contact with the contacts, and just you know, making sure that they're staying home so, like I mentioned, take care is the third step during your isolation period.\nYou know support in general, and it has been like one of the most gratifying parts of our of our job: The tracing you're, doing the follow- up step afterwards, when people are isolated, you're reaching out to the to them to see what they need to make them so they'll be comfortable and have have the ability to to handle being by themselves or being isolated for ten to four You're, not asking them to disclose any private information or there's no reason for them to be fearful of talking to you, because all you're doing is giving them help.\nSome people are not open to the idea of receiving help from anyone that they know so.\nThis is something different, so they call them every day just to monitor their symptoms and then give them the okay when they can leave their home, where our job is while they're home to make sure that they stay home like if they need food, we'll send them.\nAll right Jenelle is the community affairs Associated Columbia University Irving medical center I will be sending in a follow- up report to Steve, and he can then disseminate the information to everyone in the committee and to the wider board.\nWell, I see you actually watch the the debate We're inviting health policy experts to shine a light on the issues that you know: Yeah, so even balanced, helpful and hopefully informative discussion and the public will be invited to ask questions as well: okay, The. Steve has asked about some information, so we weekly, Acrosss, Columbia, University, there's information available on who is being tested, or rather the numbers of who's being tested, acrosss, all campuses, and that information is found at cobit19.columbia.edu againcova19.columbia.edu.\nI do want to point out that you know I've been checking the the state Health Department reports and the latest one from yesterday indicates that, as you mentioned.\nFirst, one for the committee and the which also became the first one for the board as a whole Was to expand mental health services in the community, including the crisis, intervention and acute care for persons with severe mental illness, and I.\nWe actually talked about this in our committee this morning and we were in agreement to leave this issue on your budget, help, with the hope that you would add a statement, something that we came up with or something similar to it, so that the seniors would be included in this mental health.\nI. Think the people with severe mental illness are probably the most impacted because they have not had access to inpatient care, so I would not want to elevate one population.\nSo I would like to let me try to work on this by the time of the General Board, Meeting or the public.\nThere are more people impact with more seniors impacted I'm, going to work it in Okay, number.\nIt's not, but I think, there's people that are going to be suffering from the impact of it for a long time that yeah they need services that do not currently exist, but it also makes you more susceptible to Covid-19, though.\nWe're asking the city to provide access to healthy food for populations that need, including you know, the elderly, including families, including those without so is that more funding for food, pantries?\nI would actually put the pest control above it Has control above Yes, okay, I would like to argue for either the noise enforcement or for the Trash Basket collection.\nI mean, I think, and the noise enforcement has been the biggest issue this summer.\nThink you make a good point, because what we're suggesting here is that that the noise enforcement be be provided by DEP, which is not really the answer to our question in our community with what happened under this problem.\nWon't the new rezoned area mean it unfortunately, Yes, and as a and part of that, reasoning, I think provided for a a study that was going to point out where new water mains might be needed.\nIf we're going to declare it Healthcare, Hero's way, we should know how many people's lives were actually saved."
        }
    }
}