{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UCeY0bbntWzzVIaj2z3QigXg",
            "title": "November 2020 Public Safety Committee Meeting",
            "publishDate": "2020-11-10",
            "shortDescription": "",
            "lengthSeconds": "1:40:44"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "NXdISVCgda4",
            "fillerWordCount": {
                "uh": 161,
                "um": 340
            },
            "readTimeFullTranscript": "53 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "order": 30,
                "violence": 29,
                "case": 29,
                "crime": 25,
                "cases": 24,
                "information": 23,
                "police": 22,
                "victim": 21,
                "report": 20,
                "defendant": 20
            },
            "wordCountSummary": {
                "case": 10,
                "violence": 9,
                "police": 9,
                "defendant": 8,
                "cases": 7,
                "reports": 7,
                "protection": 7,
                "victim": 6,
                "order": 6,
                "attorney": 5
            },
            "fullTranscript": "Put on the chat, can you hear me? Hey Charles I, hear you, okay, perfect yeah I decided I logged in audio from my phone, but no problem. I was just I'm just like sending you an email, yeah cool, I, appreciate it too. I got the other ones as well. From the 28th I mean it was the 32nd yeah 28 days prom, they was at the meeting this morning. They said they would but I still did not receive anything. Okay, cool I mean but no worries and stacy looped him in two. As far as the meeting so hopefully we'll have a rep from 28th on but yeah. So it's all good I know that, like I said, the main thing is we're going to I want to really start on time, at least so for the sake of Monaco, because they have their slotted presentation. Okay, so I know I'm about to message him now and let him know that we're going to start like probably about 6:35, all right, no problem, all right cool hello. Can everyone hear me yeah? We hear you Charles, okay, perfect, okay! Well, let's go ahead and start good afternoon or good evening. Everyone thank you for attending the public safety meeting here for October 21st we're going to start this at 6:35. Shatiki is a recording. Yes, I see it's recording perfect, so I want to go ahead and start because we have. We have special guests that that are going to be doing a presentation, domestic violence, presentation by the Manhattan Da's office, Mr, Mark Monaco and miss paredes and I apologize if I pronounce the last name incorrectly. So can we go ahead and unmute them and just allow them to start their presentation, sure is Mark Monaco and Anilsa. Yes, I see both of them around Yep floor is yours good evening everybody. My name is Mark Monaco, I'm an assistant district attorney here at the New York County District attorney's office. Thank you all for having me here today tonight. I hope, you're. All well also with us, as mentioned, is nilsa paredes from our witness aid service unit, hello, everyone. How are you so I am going to figure out how to share my screen with you all. So you can see the powerpoint slides. Just give me one second mark: do you see the chest screen function at the bottom? Yes, I got it all right. You guys can see it now, yeah, okay, great all right. So, as I mentioned, I work as an assistant district attorney here at the Manhattan office and I wanted. We wanted to come and speak to you tonight about domestic violence and the relationship with the criminal justice process and there's a few goals for today's presentation, one being to provide you with a basic overview of how domestic violence cases are treated in the criminal justice system. From the point of arrest to the point of disposition, as well as explaining our role here at danny, the district attorney's office, as well as the New York City, Police Department, and the role in these cases between my office and our Witness, Aid, Services, Unit and so I encourage you all during the course of this presentation that you feel free to jump in and ask me any questions and I'll be happy to answer. As best I can I apologize, I just checking one email from one of my supervisors, but feel free to interrupt me at any time, and I will answer questions as best I can so just to start the quick note about jurisdiction, so jurisdiction, meaning whether or not we have the ability to prosecute a case here in Manhattan. So because we are divided by counties in New York City. We only have jurisdictions jurisdiction over cases that occur in New, York City, specifically in Manhattan. So we do not cover Bronx Queens Brooklyn staten island, with some exceptions, depending on specifics of the of the case, but each county in New, York, prosecutes cases differently with a different set of rules and office policies and states as well, whether New Jersey New, York Pennsylvania. They each have their own penal law statutes and ways in which they handle these types of cases. However, the police department covers cases in all five boroughs, so their policies are fairly consistent amongst the boroughs. However, they work with us and within the policies we have here in Manhattan, as they may differ from county to County. So as a basic definition of domestic violence, we define it as a pattern of coercive and abusive behavior to gain and maintain power and control over another person. With that, the key of the this definition being that power and control function that one person is exerting over a member of their family or an intimate partner and some examples of that component are physical abuse, verbal abuse, emotional abuse, financial abuse, sexual abuse, unwanted communication, animal abuse. The spectrum of how this is done is pretty broad and it covers we're able to cover a lot of different areas within power and control under the umbrella of domestic violence. So it's not just typically what we may think of as the verbal and physical abuse. It covers a lot more and those are often a lot of our cases are not cases of physical abuse but of the other examples given whether it's emotional, financial, unwanted communication there's just various different types. So it would beg to ask the question: why is domestic violence, a public health crisis? So in 2018 we compiled statistics on domestic violence cases here in New, York City, and we saw that the New York City Police Department, responded to over 200,000 calls related to domestic violence and all those different varying capacities that we discussed on the previous slide. That works out to about 551 calls per day, on average, with a total of 283,000 domestic incident reports being prepared so or dirs. So what any time there is an arrest or a call, even if there's not an arrest for domestic violence. The Nypd's policy is to have one of those dirs prepared by the person making the call or making the complaint, and sometimes it's a cross-complaint with two, which means both parties are complaining against the other. But anytime there's a DV case that comes in and the NYPD responds that document should exist. So some more statistics on average a woman will leave an abuse, abusive relationship seven times before she leaves for good and that's according to the national domestic violence hotline statistics and the number of domestic violence. Injuries requiring medical attention is higher than the number of injuries from the combination of rape, muggings and accidents combined. So this all just go towards our belief that domestic violence is in fact a public health crisis just to discuss a little bit about reporting domestic violence within the criminal justice process. There are multiple ways in which a case ends up in our office or comes to the attention of the NYPD. Calling 911 is a primary and probably the most commonly understood way of these being reported, but there's many more ways. An individual can seek help in these types of situations, one being either walking to or calling any of your local precincts. Any every precinct will take these as walk-ins as phone calls for the non-emergency numbers. There are domestic violence officers assigned to every precinct in New York City, so they can also report it directly to my office to the district attorney's office. We also have a witness aid unit here in on in on hogan place downtown, but there's also an office, a witness aid services unit office in Washington Heights, as well as in Harlem. So individuals from the community can walk into any of our offices. Call any of our offices to report any crime that had occurred. Any situation that they need to seek help for. Also the city has family justice centers that we work very closely with there's one here at the downtown office at 80 Center street, and so they can also make reports there to the social workers that work there or any of the support staff as well as third party calls. So family members and friends are often the ones that are making either the NYPD or our office aware of these situations. And finally, there are domestic violence hotlines that individuals can reach out to make these reports and then the idea being the whoever it is they go to will connect them to whatever resources are needed if it's an emergency to the police, if it's just reporting a crime that had occurred in the past, notifying either the NYPD or our office and then- and we investigate it from that point forward, if the victim does choose to call 911 as their route of reporting the crime, what will happen is NYPD will send officers to the location anytime. Somebody calls 1-1-1, you may, if you've ever experienced, that the first question they ask is you know where are you before? They even ask you what's going on, and so the idea being, whenever a 911 call is made, officers can get that location and respond as quickly as they can and then a victim's going to be asked to describe what happened. That's what goes on that domestic incident report that the NYPD is required to have the reporter fill out any time a domestic violence call is made it's the officer's job at that point, to determine who was the primary aggressor oftentimes they're able to do that and they if they will then arrest the person who they believe to be the primary aggressor? Sometimes it's a harder decision to make, or sometimes both people involved had been an aggressor, and it comes then to our office, and an assistant in my office will then take a look at what the officers have taken from the report and make a decision at that point on who, if we can at that point who we believe the primary aggressor was they'll, also collect evidence such whether it be photographs can be closed. It can be a whole number of different things, anything that they believe is relevant to the crime being reported. The police will arrest the batterer if on scene or will, if they're not on scene, will look for that individual to try to execute the arrest. At that point, for DV cases, the NYPD has a mandatory arrest policy, so if they have, what we would say is reasonable cause to believe that a crime has been committed. It is their policy and it is the law that the defendant must be arrested. It is not a discretionary situation, so that's that goes along with what once they determine who's the primary aggressor and they believe that there's reasonable cause that crime has been committed, they're going to make an arrest and they are required both by law and by their own internal policy. So what's the role of the prosecutor and so the people of my office, what are our role in domestic violence cases so once an arrest is made, the first stop it's going to make the paperwork with the officer to come report is the complaint room which we call the early case, assessment, Bureau or ECAB once in ECAB, the case will be assigned to a prosecutor and then the police officer will be interviewed by the prosecutor and then the prosecutor will reach out to the victim to speak to them directly. That's going to happen on the night. The case is brought to us or the day the case is brought to us, and so that's going to happen on every case where we have the ability to contact the victim, we're going to reach out to them that night many times it's late at night, and you know I'll call and apologize for the late hour, but we do think it's important to reach out right away to let the victim know that there's someone looking into this and that there is someone determining what the appropriate next steps are. If the defendant is willing to speak to us, we would speak to them next, and that will happen again that first night and after speaking with the officer with the victim with the defendant. After reviewing the paperwork, we'll make a decision on what charges are appropriate based on what was reported to the NYPD and what we've learned from the victim. In addition, IDAS are trained to draft specifically domestic violence cases and what we're drafting is the accusatory instrument, it's also known as the complaint, and we follow a vertical prosecution model, meaning that the assistant that gets the case when it comes in is the assistant that will take it all the way to whatever the final disposition is. So that's where it starts out. Ecab. Is that first place where the where you get the case and you figure out what's going on? What are the appropriate charges? You draft the complaint and then we finally send it to the complaint room or the court. We send it from the complaint room to the arraignment court for the defendant to be arraigned by the judge, so most charge DV crimes, the most common charges we see are assaults, criminal contempt, which are violations typically of violations of the order of protection and aggravated harassment, stalking charges, criminal obstruction of breathing or strangulation menacing, which menacing involves threats or weapons being shown. While a threat is being made, threats to the phys physical harm or safety of the individual or their loved ones, endangering the welfare of a child as well as harassment is also a charge which is not a crime. It's a violation. So it's classified a little bit differently, but it's all it's a fairly common charge in domestic violence cases once the case is drafted and it goes to arraignments. The defendant is then appointed an attorney. Everyone is appointed a court appointed attorney who will then represent the defendant during that arraignment process and possibly through the life of the case, but at the very least for the arraignment, a bail application may be made by a prosecutor if it's a bail eligible charge and then the defense counsel also has the ability at that point, to make an argument for against bail. If it's a case where the prosecutor's asking for bail- but ultimately it will be the judge that will evaluate that bail determination based on the likelihood of the defendant, to return to court as well as past domestic violence history. So what can mark we have? We have one question, I'm noticing it says from Mr Perkinson. It says how much thought is put into circumstances of the crimes in individuals. How much thought is put into to the circumstances of the crime and individuals. Is that the question? Yes, I'm not sure exactly if I understand completely I mean as far as charging. If the question is whether or not what charges are we do, we speak to the victim. We hope to learn what their situation is at that time and we're going to make we're going to, especially at the very beginning, we're going to charge what we believe is appropriate based on what's reported, so we're not going to we're not going to really negotiate or barter with the victim to decide what the charges are. We have an ethical obligation to charge what is appropriate so if an assault is reported, we're going to charge assault and underlying crimes, we we're just going to base it off the information. That's given to the NYPD at first, as well as our conversation with the victim, so I hope that answers the question. I'm not sure if I understand that, if you're referring to whether or not an arrest is going to be made, there's no discretion there once if there's reasonable cause. If we believe that a crime has been committed and it's a domestic violence crime, there is no discretion other for the officers they have to make an arrest, and a lot of that has to do with we just we may get a very basic understanding of the circumstances on that first conversation, but we really need more time. We need more time to investigate, to follow up, to truly understand the full circumstances, and it's only then that we'll be able to. Maybe there are there's always the ability later on to make change things, whether it's charging, whether or not we need to do it to dismiss a case or make changes to orders of protection. There is discretion later on, but at the beginning we just have limited under information, and so we make the best choices and we can to do what we think is appropriate. Thank you. So at arraignment, once we make that application, the judge will do one of three things. You could either the defendant will be released, that's called ror bail can be set, monetary bail could be set or remand in very limited circumstances, meaning the defendant will be held in in pre-trial detention without bail, that's the least common and the most and the highest bar to meet for either the request for Remand or the judge to order it. There is also always an order of protection requested. It is usually a full order of protection which lasts temporarily for six months and if and then there are circumstances where it continues to be renewed. The other option would be a limited order of protection, but a full order of protection is the most common. Based on what I was saying, the limited information we have. We usually believe it's appropriate for a full order. Protection, which is the judge ordering the defendant to have no contact with the victim at all. Whether that's third party or direct contacts phone calls text, messages, emails, social media, anything you could possibly think of that. The judge will order that individual not to have any contact. There are caveats for those that have family court matters where we would then subject that order to be edited or changed by a family court judge who has more information, then. Finally, then the defendant's given a date to return to court, and that would be the end of that next step, the arraignment process. So speaking as we just talked about the orders of protection, that's order is signed by the judge at the arraignments, who has determined after a fact-finding proceeding that an order is necessary for the protection of one or more parties. So based on the facts in the complaint and the information provided by the ADA at the time of the arraignment, we make the requests for the full or limited temporary order of protection. That's and the judge ultimately, is the one who will sign it that can happen at criminal court. It can also happen in family court and, while the case is pending, they're described as temporary because they are in fact just that temporary until there's a final disposition and then, depending on the disposition, there will usually be a final order of protection that can last anywhere from six months to many years, and those final orders, just like the temporary ones, can be full stay away as I described or limited and the limited being that they can have contact with that person. They just essentially can not commit a crime against that person, which is something they're barred from doing anyway, but it's just an additional layer of protection or security that you may describe it as to ensure that the defendant is abiding by that order. So what does the order do? I think this is some of this I got a little ahead of myself. This they ordered the order. Is a court order that the defendants stay away from and have no contact with the protected party stay away from places associated with that protected party, their home, their work, their school? No phone calls no text messages, electronic communication, no committing of designated crimes against the protected party. This is what it looks like itself. This is a blank order of protection that has not been filled out and what you'll see is there's a there's, a portion in there that tells us that the victim can not in any way violate the order only the defendant can. So the text reads that this order of protection will remain in effect, even if the protected party has or consents to have contact or communication with the party against whom the order is issued, the order of protection can only be modified or terminated by the court. That means the protected party can not be held to violate this order, nor be arrested for violating this order. It is the court's order it does. It is not. It is requested by my office. It is it can at times that family court be requested by the victim, but it's the court's order, and only the court can change the terms. So after the arraignments, the IDAS who've been trained on domestic violence, cases will then contact the victims in ECAB, as we've discussed they, but afterwards they'll try to meet with the victim in pre-Covid times and I do not know what the future holds for any of us, but we would meet with that person in person and I. Think we try to do that now as best we can in person we've also during this time incorporated video calls like this zoom call as well to do the best we can to just put faces to names and just to speak to that person face to face, even if it is through a computer screen right now, but we think that that's very important, but also because when we bring someone down to the office, we're able to connect them to resources. So in our downtown office there is a witness aid service unit. That's staffed here, there's another one in Harlem and there's another one in Washington Heights. They are here they're, usually here and there I believe there are some people here and I know so could probably speak a little bit better to that. Even now, I think there are some people in the office to meet with victims, to connect them to resources, to provide the copy of that order of protection to explain it to talk to them about whether or not bail was said and what that means or when the defendant was released, to talk about what's happening with the case, but also to get what's called a supporting deposition or a corroborating affidavit signed with, which is the victim swearing to the authenticity or the veracity or the truth of the information they provided to the police. So that's everything that wasu gets to help us with or and is able to help us with all of those things and they schedule appointments for us to meet with the ADA. They offer services they offer safety planning. So that's a big part of trying to bring them down after arraignments is to connect them with Wasu so that Wasu can assist us and the victim with all of the things we need and to connect them with all the resources that are available to them. So some cases come in at the misdemeanor level. So at the misdemeanor level, as opposed to felony level, so misdemeanors being crimes that are chargeable by one year or less felonies are crimes that could result in a prison time of one year or more. If Baal is set on a misdemeanor case, the criminal procedure law requires us to get that supporting deposition within five days from arraignment. So that's what this means when they say: Cpl, Bell versus ror. If bail is said, if the defendant is held in, we have five days to get that sworn statement from the victim to say what I told the police. What I've told the district attorney's office is true and that's the defendant has the right to be released if we do not have that within five days. In addition, the defendant has a speedy trial right and that's in New York state defined within our criminal procedure law as well and on a misdemeanor. It's an a misdemeanor one of those that's charged by up to a year in jail that that's 90 days, quote-unquote 90 days and I, say quote-unquote, because it's not 90 physical days, it's 90 chargeable days, but that's there's some technical laws that explain what days get charged to us. What days do not, but ultimately, what's what it means is that for misdemeanor cases we need to bring the cases to trial as quickly as possible, and if we do not, the case would be dismissed on a b misdemeanor case is charged by only up to six months in jail, so attempted assault is a classic be misdemeanor after domestic violence cases that time period is only 60 days, so felony cases same thing. It's instead of 170 70, it's 180 80. it's six days from arraignment, not five but same thing. We need to present it to a grand jury within six days for a grand jury to hear testimony and make a decision on whether or not we've presented enough evidence to move forward on felony charges against the defendant and similarly like misdemeanors. All felonies also have speedy trial time. But it's 180 days for a felony possible sentences, so this is I was just bringing this up, so felonies are prison terms of one year or more, and they have order of protections for up to eight years, misdemeanors it's up to one year in jail, as well as orders of protection for up to five, if it's a violation which is not a criminal conviction, so that harassment charge that we talked about, which can just be verbal threats or those can be covered with by orders of protection by up to two years and actually can result in jail time of up to 15 days. Another disposition which happens in some of our dvd cases are family adjournments in contemplation of dismissal. So, typically, what happens? Is we ask if we're, if we think the appropriate Dis appropriate disposition? Is a family acd? It's a situation where the defendant meets the terms set forth and agreed to by both their attorney and our office and themselves. If they meet all those terms and remain arrest free for a year, the case will be then dismissed or sealed. As long as there is no violation of the order of protection which lasts for the full one year period of the family, acd as well as no arrests on related matters, so just to give you a little bit of structure of how the our resources are divided at danny at there's at our office downtown. There is a special victims bureau, which is dedicated to domestic violence, elder abuse, human trafficking, sex crimes, child abuse cases, as well as the witness aid service unit. That's all under the umbrella of the special victims, Bureau, and it's all located at our downtown office on at on hogan place in Harlem. We have that witness aid service unit. We have some legal staff there, as well as well as our community partnership unit and that's also the same resources we have available in the Washington Heights Office. So, just speaking a bit more about the witness Aid service unit a bit of an overview. As we talked about a little bit there, their goal is to assist the victim in understanding the criminal justice system to help to guide them through this process and that relates to providing court related services to provide social services, clinical counseling services, advocacy and support. The goal is to enhance the prosecution of cases by assisting the IDAS on their investigation of the case, as well as by providing support to victims to rebuild their lives and so the Harlem office. This is a photograph of the Harlem office and the director there is Linda Jones Janae and that's over at 163 West 125Th Street, the phone numbers on the screen, as well as the hours and the time, and then this is our Washington Heights Office with Jocelyn Manaya is the director there and I can provide I, can flip back and forth with this for the address and the hours and the phone number for anybody. That wants to take it down, but that's pretty much. It there's some more phone numbers here for you as well, but, like I, said I'll I can flip back and forth between these. If anybody wants to take these down, but there's a phone number dedicated for the special victims bureau, the Witness Aid Services Unit, this 9040 office will connect you to the downtown office as well as the domestic violence hotline here at our at danny. But does anybody have any questions? I can stop sharing for right now. This way you can see the chat. Does anybody have any questions? I'll look at the chat, but if anybody wants to unmute themselves to ask any questions, I'm happy to provide some answers and then I yeah, hey mark it's Ruth, R murphy I, put a question in the chat, but I'll just ask it. You said that a since an arrest is mandatory in all circumstances, there's no discretion and given that there may be limited understanding of the relevant circumstances, what happens if you're? If your office decides, then our prosecution is not warranted? Is the record of the arrest expunged? Yes or whatever it depends? It will be dismissed and sealed once we decide that it does not warrant prosecution. So when I say that there's a mandatory arrest requirement, that's only in the cases where we believe there's reasonable cause, so we believe the charge is the Char the allegation made. We believe it's truthful and we believe it's a crime. That's when we have no discretion if NYPD responds to a call- and they take a domestic incident report and they see that a crime has not been committed. They are not going to make an arrest. They will take a Dir, a report that domestic incident report, but they won't make an arrest. Sometimes they leave that decision to us. They are unsure or they believe that a crime has been committed and they bring it to us in ECAB. That first step that same day, the defendant is arrested, and there are times where, when we review the information, we do not believe a crime is committed and we will just decline to prosecute it. At that point and the arrest will be closed out and voided. There are times as you've as you're, suggesting where we do at the time of the write-up believe that a crime's been committed and arrests will then be made. It'll go through the arraignment process, but then we will continue our investigation and for many different reasons, we may decide at that point that we can't prove the case. Maybe so we think it happened, but we can't prove it we're still going to dismiss that case. Those are last resorts on cases where we believe that it's, what was alleged has actually happened where we believe a crime has actually been committed, but believing we can either can't prove it or we learn some circumstances that make us determine if it's not warranted, we're not warranted to prosecute it. We will, in those situations dismiss a case when a case is dismissed with it goes that order of protection, that's that is expunged or extinguished rather at that time. So we are careful when we make those decisions, because the order of protection is important is an important piece for the victim to make sure that they have something there. That's not just them requesting that someone not commit a crime against them, but it's the court ordering them not to do it so I hope that answers your question. So in short, it could be dismissed the first day it could be it could not. The arrest could not be processed by the NYPD or later on. We can decide to dismiss a case and then yes, it will be removed better. That would be removed from their criminal record for things like background checks at jobs or school. Things like that, NYPD will still have that document of the report being made, but they'll also have the information that the case was dismissed. Okay, thank you any other questions. Okay, thank you. Mr Monica. That was a great presentation and I think that one of the questions was. Could we be able to get a copy of it? I think they responded back so and also to let everyone know who's participating in the the meeting today this is being recorded as well, so you can always we're going to post so you'll be able to review and watch the presentation again, but thank you again. Mr Monaco course my pleasure nelson, if you want to introduce yourself, okay, I just wanted to add a little more as to the services that the witnesses services unit provides. I know mark touched on it, but primarily we like to discuss the safety with our clients, making sure they're doing everything to maintain their safety as well as assisting them with any safety transfers or advocacy that they might need in the community or to get away from the community. We also do, as Mark mentioned, do have the Washington, Heights and Harlem offices. At the moment, the Washington Heights Office is open, mondays and wednesdays from nine to five and the Harlem office is open, tuesdays and thursdays from nine to five as well. The their phone numbers are being answered all days of the week. Those are just the two days of the week that each office has in-person advocates as well as any other assistance that anybody may need. Okay, perfect. Thank you. So much is it. Is there any questions regarding what was stated trying to just give everyone some time if they want to type look, if you take yourself off mute, pastor, Ramos, we can't hear you hold on. Let me let me send her a message she because she's talking about it, we can't hear her yeah. We sorry that when you log in it gives you an option that says join with audio I do not know if you press that button, you may have to go out and come back in and when you go out just hit, join with audio yeah I. Think, that's it charles all, right! Well, thank you guys for having me I. It was my pleasure to give the presentation and I'm wish everyone to well and hope everyone's safe and healthy thanks again mark I, appreciate it all right. You all take care thanks. Charles. Are you still on the line? Okay. Well, I do not hit Charles. So the next agenda item we have is Lincoln square legal services, as I'm Jackie Prosky on the line. I am I'm not Jackie Prosky, but I'm going to be giving a little presentation in her stead. Okay, you need to do you need to share your screen. No I do not have I. Do not have any thing to share no problem. Okay, so my name is Dylan Nelson Epstein, I'm a law student at Fordham law at the Criminal Defense Clinic and I'm on a team. That's representing a client who's up for parole in November, and I'm here today, because we're seeking letters of support for our client's release and we believe that a letter from the community board would be extremely helpful because you represent the community. That was most impacted by the crime that our that our client committed and also is kind of adjacent to the area that he'll be released into so first I'll just like to say a little bit about our client I know, I. Think Jackie sent out an email, so you might have gotten some of that information, but I'm not sure if everybody's heard it first off our clients. It's been a real treat kind of getting to know him over the course of this clinic and he's a just, a great guy with a wonderful sense of humor, and it's been also really heartbreaking to kind of read about the parole denials that he's faced since he's been up for parole, I believe almost 10 years ago. So he I'm sorry a little bit so, first off all he was convicted of serious crimes. He was sentenced to 31 years to life, for possession of a cro, controlled substance and murder in the second degree of a police officer and he's spent four decades in prison for those acts and during that time, in prison. He's really worked really hard on himself and he's consistently expressed that it's something that he's very remorseful about and- and it is kind of that he wishes that he could turn back time. But given that he can't he reflects on the seriousness of his crime that he took someone's life and that he took someone's father like a father away from their children which really haunts him, because he never got to know his own father. So a couple more details he's currently 62 years old. He spent two-thirds of his life in prison. He committed his crime in his early twenties and there's been some cognitive science research that shows that your brain is not fully developed until you're about 24 or 25, which can partially I mean. So it does affect the the impulsivity and kind of thought process of somebody at that age. But, despite that, he's never tried to use any of that as an excuse, and he always takes responsibility for the acts that he's committed. He's been able to maintain significant ties to his family, even while he's incarcerated for such a long time, and even with some of his family members, his grandchildren, his children, I mean his grandchildren and now great grandchildren who were not around when he was incarcerated, he's been able to get an education while he was incarcerated, he's gone through a number of vocational and therapeutic programs that have kind of focused on the areas that he had struggled with in the past and he's always received kind of excellent commendation on those on those remarks saying that he's a great worker and that he's taking it very seriously and that's kind of led him. He took a part in the youth awareness program for like a youth crime deterrence program and that was really impactful for him. That he's come out of it kind of deciding that down the line. He really wants to focus on helping young people in his community to not go down the same path that he did and sorry he has maintained a very clean disciplinary record while he's been incarcerated, which is very difficult to achieve. He had some substance issues in the past, but has for his entire time that he's been incarcerated for the past 40 years he's he has not failed. A single talk, screening and he's been in sort of the procedurally generated risk assessments he's been cited at very low risk for recidivism. So and if you have any questions about that or anything about to talk to, please feel free to jump in Dylan. What is the gentleman's name? I think so. I had talked to my supervisor about this, and since this is a public recorded session, I was going to not reveal that information so that he could maintain some privacy, at least in a sort of public setting. But of course, once if you decide that you do need to or would like to write a letter on his behalf, then we'll share that information with you today, I mean one second Charles: do you have the email that was initially sent off for this presentation? Charles, are you there? The this request came in I'm actually looking for the email now I know what's sent to the chair of the public safety because he invited you to present tonight. I know. Can you guys hear me I hear you now hear me? Oh yeah, so just let you know that we received it and speaking to Madam chairs. This is going to have to be forwarded up to the Ec meeting, but yeah I received the initial email that has the detailed stuff and I'm going to circulate that amongst the board members of the public safety of board members, but but yeah we have that. So this is going to have to be circle. I mean brought up to Ec, where, like I said his name and everything else will be disclosed. Now. Let me ask you a question: is this? Is this going to be up for a vote tonight? No okay for Madam Chair we would have to this would be a vote for Ec and I. Think we would have also have to contact the madame Borough President's office as well. Okay, thank you. So the next thing I'm going to talk a little bit about the letter and kind of why we're looking for this kind of letter. So in the past our client has been denied parole, I think he. This is up. I, think he's about to be up for the seventh time so he's been. The board is cited on numerous occasions, significant community opposition to his to his release, but we know that a lot of that opposition comes from sort of form, letters that have been sent out from from these websites from the police, Benevolent, Association and- and there are thousands of them, but we believe that they do not necessarily adequately represent the community. That is really involved because we've run several tests and you can send them. Basically, you just type in your name and you hit send it sends they all have the same. They all have the same. I'm sorry a little bit interfaced. They all have the same text for the most part, and so you can send you just put in your name, and you can send them more than once and you can send multiple submissions from the same computer. So we do not actually know how many of the letters are authentic community opposition. A lot of them include language. That is pretty vulgar. Some of them mistake some of the facts that indicate that people do not. People who are submitting them do not really are not necessarily engaging with the specifics of the case, just that there was a police officer involved who was killed and- and so that's another kind of reason that we're bringing this up is that the idea that he would be denied parole continually because of the act that he committed, as opposed to the sort of strides that he's made along the way and the person who he's been able to become throughout his incarceration I think it's significant to say that when he was first sentenced, he was not sentenced to life imprisonment. He was sentenced to 31 years and then the possibility of parole, which is to say that at that point the board should check in with who he's become and decide whether or not it's in the community's interest to to release him. Oh one question I do not know if you've already responded to this, but what, if any, community opposition have you all faced or experienced so that the that is, the community? Opposition comes in the form of those of those form, letters from the police, Benevolent association that have kind of come in and come in, and you can go to the their websites they're, really just you type in your name and they'll, send sends a letter off to the board, so I see in the chat that somebody's asking. If we're requesting letters from other organizations. Yes, we have. We've received several letters of support, one two of them specifically: we've received letters of support from state Senator, Sepulveda and State Senator Rivera who've kind of emphatically stated that they believe that he should be released, that it's clear that he's been rehabilitated and has taken opportunities. This is a quote. I'm sorry. It's clear that he's been rehabilitated and has taken opportunities to better himself, while he's in prison citing such things as that and we've also received I'm sorry, I'm just going to I'm just flipping through some notes to see the other letters that we've received, but those are two significant ones here. Yeah we've received a letter from Father Mcshane from the from Fordham and from reverend Butts from the abyssinian baptist Church all right. Thank you. So again, board members asked we'll circulate that email correspondence that was sent to district office and was I was included as well and as well as the other chairs that are on this call. This is going to be pushed up to the executive committee, so this will be brought up in detail further detail. Let me see I think there's another question. He said that you mentioned that the individual will be returning to the community adjacent to ours, which community or is that in the packet, I'm not sure whether that's included in the packet yet so basically he's I looked up the borders of this community that and it ends at at the top of the Park Central Park, and he's looking to be released onto the upper West side, okay into the investment board, member Bitterman, okay, all right cool Charles! Thank you! So yeah charles I do not know what you can see. Kevin has his hand raised. I do not know if you want to speak Kevin or if your question was answered or if you know no sorry yeah that would be I was putting my question in the chat I. I'm not a public safety committee member but I am a member of the executive committee, and so I just was trying to use this opportunity to get additional information. So thank you, dylan and also just for Clarification Dylan. Technically, he would be if he was paroled. He would be paroled to community board nine. He said you said the West Side Mm-Hmm above upper West side above 1010th street, above no on the on adjacent to the park, so I, I'm sorry I did not look at the map of the of the different community board districts, but that's Community board. Seven! Okay, thank you! So have you have you reached out to community board seven as of yet so we have I'm actually not sure, because we have several teams working on like reaching out for letters, but one of the reasons that we reached out to Community Board 10 is that I believe this is in the area where the incident where they, where they're accidental, so what we'll do dialing is I'll circle back with jacqueline as well. So by the time we have our Ec meeting of Donna and Kevin we'll be able to have further and detailed information as well, but yeah, because I know that he's actually substituting for jacqueline, because she was the one that is that sent out the information and provided more details. So we can, we can find out those things and any other questions that board members have I can make sure that we get those answered prior to the Ec meeting. Okay, all right Donald! Thank you! So much. You know I appreciate. I know you were nervous man, but you did good. Thank you very much all right. Thank you so and thank you board members too, for the additional questions as well. So let's go ahead and just move on for a second time. 28Th precinct is their representative on. If we can mute them or if you're going to meet yourself good evening, everyone Lieutenant caleb special operations, lieutenant for the 20th present Hey lieutenant how's it going I'm doing well doing well. So we just wanted to just allow you guys a chance to provide the the council report. The council report, I'm still Tom Stack Comstat report, constant report got it all right all right, let's see so you want the 20th day or you to date. Statistics. Oh yeah, just the 28th, this all right, so you're date for murder category where negative, 100 zero versus one. As far as the rate category we're up two we're 200 increase two versus zero, the same time period last year. Robberies are up slightly for the time period. 14 versus 13 for 7.7 percent, increase, felonious assault, we're up 72, 19 versus 11. burglaries are also are also up. Nine versus seven for twenty eight point: six percent increase and grand large needs are down for 39 28 versus 46 at the same time period last year. I'm sorry grand large needs the grand lars means. We we're significantly up seven versus zero. Was there a particular street or corridor? That was a spike in or do you know? What is that even something that you know it's kind of all over the place? It's primarily scooters and e-bikes, but they're classified as grand large new autos, okay I will say this. There are a few. There are a few cars involved in this particular spike, primarily the cause being up people leaving the car unattended with the with the motor running, but it the there's, no particular corridor that that's really affected. It's kind of all over the place. 116. notably, is it's one of the corridors that that's that's, taking that taking a big hit whatever, as far as like the scooters and things like that, Manhattan Avenue is a big issue. Morningside also has a few hits one thing too. With this report it would it be possible to send it out to city, so we can circulate that that to the community cause, we have the 30 seconds report and we plan on doing the same. So what exactly do you need? Oh just a this is a copy of the com report that you're that you're you're siding off of okay yeah. We do not. We have the 30 seconds, but we do not have yours, so we wanted to circulate that amongst the the community. We have another question, a question from pastor Ramos. It says NCO upcoming meetings, question where the upcoming meetings I do not have that information in front of me. That's normally like with everything going on now we have to get clearance prior to booking a particular venue for those but one, but once those venues are determined that information would be disseminated. You know, via you know, social media, some social media and word of mouth. That they'll be advised. Okay, all right, perfect. Let me see all right well. Is there any questions from the community for in terms of 28th, you can either write in the chat or you can unmute yourself, Kevin I see you have a question: yeah I'll Sir. Thank you. Lieutenant for your information. I am curious regarding the 28th precinct's response to what I'm hearing of increased package thefts from lobbies and buildings. This is not a new occurrence, however. I'm receiving some legitimate inquiries from constituents around lack of investigation, follow-up and police reports are being filed, especially when they're coming from one particular location that I'm aware of where multiple police reports have been filed in the last month and a half building on almost four consecutive years of repeated incidents of packaged thefts. I'm curious if you can give any insight on you know what the precinct is doing in response to package thefts and how constituents might get some action on investigations for police reports. So is your question in regards to response time, or is your question in regards to the investigation that's conducted there after the crime has occurred? Well, officers are responding swiftly to police reports being called in. I'm hearing that, however, once the reports are filed, there's no follow-up on investigation, including examples of where residents are providing the direct com. You know contact information for building security, who's waiting and willing to participate in investigations, but management companies from what I'm hearing are not in a position to do anything with security footage unless there is an investigation, that's been initiated from the NYPD and I and I and I know this firsthand from a number of people that have filed police reports, like you said within the last like month and a half, but one residents in particular has had numerous police reports filed over the last four years and the 28th precinct has not been responsive to these reports, so we know we're entering the holidays right now. It tends to be a time when the city there's a lot of package deliveries. We know that package thefts happen. It's inevitable, however, when there's an acute number of occurrences at particular residencies. It seems to me that there's a reason for an investigation. What we're hearing- and this is particularly happening on the Fredericks Boulevard Corridor- again, I'm sure- what's happening throughout the district, but what constituents are seeing is people literally following the fedex, the laser ship and delivery trucks and hand trucks up and on the boulevard and they're entering buildings. You know five ten minutes after packages are being delivered, so it seems to me that there's a need, for you know, action on police reports being filed and also, possibly you know, additional foot patrol trafficking on certain boulevards. If there are or streets if there are, in fact, an increased number of police reports being filed well, I assure you I wish I had the resources to provide additional footprint, but in terms of investigations, I will say this once a police officer generates a report. It's now referred to the detective squad. I can't speak 100 intelligently as to how they prioritize petty larcenies, which is most likely what these reports are generated, as but in terms of felonies versus misdemeanors, which is what you know, federal Larceny is those things are less prior I do not want to say less important, but in terms of priority order, you know the detectives contending with you know a spike in violent crimes. You know sometimes those things fall to the wayside, but as far as an investigation, those things do need to be conducted. I'm not quite sure what what's going on there. As far as like your constituents feeling like there's no follow-up but I could inquire about that and see if we can improve upon to detect as well, but it is technically a separate entity from the precinct so I, I'm sorry and understood also there's degrees of severity of crime and response from NYPD. That's completely understandable, wow. It's just this particular building that I'm aware of you know, there's been sufficient documentation and from what I'm understanding, there's also a willingness for a management company to do something, but they can't do anything without you know an initial investigation. So let me ask you this: can you disclose the location you're referring to I? Think I can work with our district manager to maybe follow up with you directly on that, but I think that that's this you know particular residents they've shared information with us in the district office before so. I. Think that maybe that's the way we should proceed is just follow up offline and try to see if there's some action, yeah gotcha but I appreciate this is my first public safety meeting and I'm grateful to be here. Mine too, you guys both are doing great one more question for you lieutenant from board member Gil Donna Gill. She says what is the 28th plan for 110 through 114th Linux to Saint Nick with the increased drug use and trafficking. You said 110 to one well that that's an ongoing issue. That's an ongoing issue! I, my personnel that you know respond directly to me, they've made you know significant touches over there. Obviously narcotics they have their ongoing investigations over there. Unfortunately, you know if it's not large scale, it's very difficult to keep these keep these criminals in these drug dealers in long term and that's out of our hands. That's you know that's within the purview of the district attorney's office, but we make arrests over there. We make what we consider considerable seizures and, unfortunately they're not staying in. So it's cyclical. It's a you know like a revolving door. These criminals are getting arrested and they're right back out there. You know in a couple days, if not one, but that does not mean that you know we're going to stray away from that. We're going to continue to do what we do. My officers as well as the Narcotics Bureau will continue to do. What we do. Try to you know put together, maybe large-scale probes and try to go federal, but I mean we're trying yeah I do not know I appreciate your efforts, appreciate your effort. So that was the question she wanted to notice. Clarity and one more of a follow-up is two she said: is the citizens program and the police academy still in effect, and how does the citizen get selected? Not at this time? You know. Obviously, senior citizens are vulnerable individuals, and you know, given the current climate with the department, has kind of put that on pause at least for now. Okay, if I may just a follow-up to the issues at frederictors Boulevard that I'm aware of that are coming to me. You know the reason I think that we're encouraging an investigation is because we're wondering if there is a correlation between the narcotics use and sales happening within the area as well, where the thefts are linked to possibly you know similar activity so I that that's where I feel like an investigation might be revealing and help understand why the significant consistent number of package thefts is happening from unattended lobbies and, what's being done with the merchandise, that's being stolen from lobbies, so I, that's where I feel like an investigation might be helpful. Well, I will agree with you that I do think. You know these thefts are crimes about opportunity and likely these are you know, drug users who are looking to steal packages hack them. You know to feed their habit, but I do not think that is based on the question that Donna Gill asked that I do not believe that they're one and the same in terms of the drug dealers, but I do believe that you know a lot of these steps are being enacted by drug users looking to feed their habits. It's a correlation, it's a larger issue, it's a larger systemic challenge and circuitous kind of challenge, but it, but it is yeah, but thank you. These were thank you for your response to the questions and I'll work with our district manager here to do some follow-up, full disclosure. This has come up from other board members in other parts of the district. So it's not I know it's not unique to Harlem, it's not unique to our community, but I think just understanding the steps after a police report is to understand. So thank you. Thank you, yeah. Thank you. So much lieutenant. Is there any other questions for detective in our district service cabinet meeting this morning? They said that they're taking it serious, they would like to have photographic evidence or video evidence. So if you know the building management would be able to submit the videos to them, they said that would help them try to catch the perpetrators. It said that if there's any members in the community who feel like this is an ongoing pattern and they witness certain patterns, if you could let them know what the patterns are, so they could look out for it. So I think it's a matter of starting the dialogue and having that communication and part of the communication means that the 28th preset attends the public, Safety committee meetings and I. Thank you guys for joining also joining our district service cabinet meeting. So we can get the the messaging out, but as far as prioritizing it, they said they would take it this serious as any other crime and go based on the evidence that they had so I. Guess, that's good news and a good place to start yeah. The constituents that I'm hearing from shatik are saying that their management company can not hand over video footage unless a police investigation is initiated so that that's the key. That's the missing link yeah. So that's what we need to get that clarity from and that that's what it sounds like that's the gap so yeah. We need to get that clarity and Kevin, like Kevin mentioned before we'll circle back with the district office and and like I, said, get the more details and lieutenant will definitely touch bases with you on the 28th right. So, like I said we can work on it. So I appreciate you for your report. Is there any other questions for? Oh and also just let you know the board members saying thank you for coming. We appreciate your time. Please remind the officers on foot patrol to wear their mask absolutely so all right. Thank you. Lieutenant going forward going forward for the rest of the agenda. Is there a representative from the 32nd precinct on excuse me? So could you? Oh I'm sorry, mari yeah, this is Mari. Moss I was trying to I, put a question in the chat and so I guess I have to verbalize it, but I would not. Let me I'm like. Actually I'm double tasking right now. But my question is the domestic violence awareness question? Yes, this is the message awareness month, okay, you know no, it's answered in the chat. It says Mari check out our victim resource page and she sent she sent it directly. Yeah I'm looking at the video, so I was not in the chat when that was put up, but I did not know if the comp statin numbers like I feel like those numbers need to be separated out from the other numbers that you know when it says assault or whatever, like domestic violence, is a standalone issue really and I think it needs to. You know, there's a way that they can separate those numbers out. So we can look at those more closely. We have a lot of organizations in our community that focus directly with domestic violence. Like warm, you know, and several aisha say, cool Street, corner resources. We have a number of organizations that look and directly deal with those numbers, so I really want to make sure that we take those numbers out in the Comm Stats and make sure that we focus in on those issues as well. Okay, thank you. Thank you all right. So is there a representative from the 32nd precinct on I do not believe so. Okay trying to put the 37 because they submitted their report so I wanted them to touch basis with it and we're definitely we'll start the you know to get the representative yeah. We yeah we informed the 30-second precinct as far as the meeting so and I know that we received their report. Let's see I'd like for them to read it off because they can break down the numbers, but we have this that we have the 30 second precincts report and if you guys have questions or anything that that you that you were, you know expecting to ask the 20. Sec I mean the 30 second precinct. Please send them in the chat, so we can compile them and then what we can do is we can send that over to our NCO for the 30 second, but I can read, I can read the stats if you'd like I, have the 30 seconds. Oh you do perfect. Can you could you? Could you please? Okay, no problem, all right. So for the 28 days they are down 66 percent for for murders, one versus three for rapes. They are even two versus two for the same time period. Last year, their robberies. They have a decrease of 43.5 percent 13 versus 23. felonious assault, they're, also down 12 percent 27 versus 31. the burglaries they have a slight spike 16 versus 14 for a 14 increase. Their grand larcenies are even at 26 versus 26 and they have a slight dip in their grand Larceny autos at three versus four for 25 percent, decrease I can't expound up on that. I'm sorry, yeah I know I understand that yeah. If any questions from the community or board members, please just like I, said shoot them in a chat or if you want to like I, said, shoot it in a compiled email and what we'll do is we'll make sure that it's sent over to the NCO. So we can have a response and then ensure that there is a participation for next month, so they can. They can touch basis on that as well. Okay and I appreciate you so much lieutenant for doing that. No problem, okay, let me we're going to go ahead and move on for sake of time. The next thing shitty, could you go ahead and post put up the district needs form and share that if you could share it essentially right now, you guys we we're in we're compiling requests for our district needs statements. All of the committees for CB10 are doing this. What we have is an actual task force where we have representatives from each of the committees that are compiling this information. Our next meeting for the task force I believe is this weekend, is la. This Sunday is the last meeting because the district needs statement has to be submitted at the end of the month. So I appreciate, pastor Ramos for stepping in to to assist and be the Rep for public safety and I'll be helping her with this as well. But what we did was we created a Google form for for pretty much input regarding public safety needs that you all see within our within our our realm. So if it's a real, simple form, if you could, if you could it's connected to the to the agenda so once if, when you click on the hyperlink, it will take you out of out of the agenda into a Google form if you could submit that put whatever you need. If you need to submit multiple, you know forms, that's absolutely fine. Supporting document documentation helps what I'm hearing from Mr Clinton Josh Clennan who's, leading over it he's stating that one of the biggest things that we have to focus on is is really just the point of budget request, because we do not have many requests to make for public safety, though we have obvious needs that that we've identified so we're trying to get the detailed numbers of what we need. You know to so that we can request that, because what we've seen in the past is that when we submit you know broad district needs statements without those numbers. Without those details, we get these responses, these generic responses and when comparing it to other boards that submit, we notice that there that the more detailed they are with their request. That's how they're able to get the funds and the proper things into their community so we're taking a whole new approach and I thank Madame, Chair, Cicely Harris for like I, said for approving this and allowing us to do this. But as far as board members public members, please share that that form, and so we can try to get as much information compiled that we are. You know, on top of what we already have. Oh there's somebody in the chat. Let me see, okay, so is there any questions or anything regarding the district needs form the Google form? Okay, perfect, all right, so stacy wow, like I, said we'll that's been circulating around and you and I will touch bases and also with Josh. So we can see exactly what's going to be needed on our end. But yes thank you for forgetting it. If you click on that hyperlink shatique, yes, so, as you guys can see on this forum, it's literally you just put your email address. You name your organization address if possible, and then you're able to just write in like I said what are? What are the district needs for the areas of public safety and you can also upload up to five document supporting documents. So if you have pictures or any of those things that could help, you know, if there's if you have a chart or graphs or whatever you think that could assist with this portion of it, you can submit that those documents and that's the form that you use so and please circulate that piece, but that's pretty much it, though so as far as the district needs portion on the agenda as far as old business I have just covered 19 communities concerns or if are there any you know concerns as far as what's been going on and the current status of New York City now or if there's anything you guys are seeing as far as just people not wearing their mask or suggestions. Please feel free to use this time to speak. You can unmute yourself. I would just say that encourage people to wear their masks because we've been seeing spikes in certain areas right now. Our infection rate is hovering around one percent and you have other places in the nation like I. Think Florida is around 12 with no infection rates so that we do not want to move backwards and we've. You know, we've come so far from about 800 deaths in March, so maybe about 10 a day now. So we do not want those to spike. So I just encourage everyone. If you have not already just to continue wearing your mask and you know practice social distancing continue to wash your hands. It's your flu shot. Jacquez I, see you so we'll definitely make sure that you have I'll. Give you a chance checklist perfect. Let me see I'm just going to go ahead and move on. That's pretty much. It there's announcements at the end. I'm trying to pull up this agenda. You guys are doing five things at once: yeah, okay, so just announcements, I see Madame Chair Harris is on the on the line. Could you unmute yourself? I wanted I did not know if you wanted to just touch basis. Regarding the public advocate letter in support of our CB10 resolution for the exoneration five exhibit I know she can try. Yeah I just wanted to I did not know if you wanted to just make a just a quick response regarding the announcement for the the public advocate letter and support for our CB10 resolution. Oh yes, exactly five exhibit yes, so we have been going around and doing our presentation. We had one at CB6, Monday and then CB4 yesterday, so we are continuing to do the presentation which debuted at our last board meeting we've gotten a public. A letter from the public advocate Jemima Williams. Thank you. He adjoins already we've gotten gail to give a letter and I believe we are doing outreach right now to the officials to make sure that we are getting their input. I just saw the letter yeah, so Satik has it up now for everyone to see as far as the public advocates letter of support. So no that's that. Thank you certainly so I just wanted to I did not know if you wanted to make comments on that, so it seems that we're still we're still going around to the various sports, but we're it's obvious that we're gathering a lot of momentum with this. Yes, well one of the reasons. Why is that we do need the input from the boards around the park to go ahead, and so that's like five boards, but when we looked at the magnitude and what we were doing and what this really means for social justice, not just in Harlem but in Manhattan as central park, is a huge focal point of Manhattan and of the city. Battleborough President Gail Brewer wanted to make sure that we were getting input from not just uptown but from the home borough. So this is a complete resolution which will be reviewed, I believe at the December meeting for all of the board signature input and one of the reasons why we do want all the boards to give input elected officials or any organizations out there to give a little support, because when we go to the design commission, they really look at how many support letters you have and what they're exactly saying. So it's important that we have these support letters when we go forward, especially the agencies, mayor's office and agents like that, okay, perfect! Thank you! So much. Let me see the next announcement that we have yes, this announcement I just want to let the board members who are on know that we have general elections coming up, November 4th. There was a memo that had been sent out. As you all know, I'm on the elections Committee and we're compiling based on the time process that was listed in the memo, so you should be receiving anyone. Who's select who's submitted their nominations, they'll be receiving the follow-up documentation soon. So I just want to just remind board members who are on that. You know we have general elections or officer elections for our upcoming board meeting and it's going to be different. It's going to be via zoom, so we're going to be doing a different type of format. So just please be sure to keep up with that with those correspondence. The last. Oh, not the last thing. Second to last, because I know there's another announcement. Last announcement I have is for this slow walk. I received that there's going to be a slow walk on October 31st at noon. That's hosted by the naacp mid Manhattan branch as I know, is they're also working with anes Dickens office. So the flyer that is to be created is still in process, but once we receive that we'll make sure that the district office receives it and can circulate it amongst the community, if you guys, you know have not already or if you want to you know. Definitely this is the time that you can look into early voting leading up to this election. This is a big one, but we definitely will be doing a slow. A slow claw I mean slow, walk on the 31st and Charles I know you go ahead. Officers as well, yeah CB10 is one of the sponsors we're sponsoring it as well. Yes, oh yes, the Community board, tennis sponsors well, I do not have the flyer because well they do not have not created a flyer. So I do not know everyone that's on there. But yes, those are the big three but I. Think there's other organizations too, but, like I said it will be circulated in advance. So I'm just waiting on that jacquies did you say you had an announcement to make yeah? Excuse me. I just want to make this very quick, so we can get off and go the rest of our night, but I did include my contact in the chat box. So folks have any questions or concerns reach out to me directly. I did just want to give a brief update on Saturday this past Saturday October 17th. We had a gun buyback at Bethel, Gospel Assembly and in total we recovered 48 firearms, which included 19 revolvers, 17 pistols, five other starter pistols, an air gun, four rifles, one shotgun- and we just want to say you know thank you to all the community leaders and the community advocates who are able to really get the word out in such a short amount of time. This gun back this gun buyback actually represents the largest total firearms recovered. So far so I know Queens had one Brooklyn had one Bronx is going to have one, but so far this represents the launch, the largest firearm recovery. Thank you to everyone that shared this especially CB10 and just to finish, it is domestic violence awareness month so outside of the lovely presentation that we were able to give earlier, you can also find resources for DV, particularly on our website Manhattanda.Org victim resources. Not only do you get access to our DV hotline, but we've also included DV resources and some of our DV partners. That's all I've got. Thank you so much. Thank you. Thank you. Thank you. So much are there any other announcements from the public before we adjourn you can unmute yourself all right. Well, thank you all for participating in the in this committee meeting I appreciate you all so much and thank you 28th precinct for stepping in for 30 seconds for the report. Again, you guys will be searching we'll be circulating information and please make sure that you look into the chat and take down that contact information. We'll also make sure that it gets circulated from the District office and Kevin like I said. We need to definitely touch basis with with shatek, so we can circle back with 28 all right, but thank you all again. It's let me see what time it is. It's 803, so we're going to adjourn at 803. good night, everyone! Thank you all right, goodnight, you guys be safe, goodnight.",
            "summary": "We have special guests that that are going to be doing a presentation, domestic violence, presentation by the Manhattan Da's office, Mr, Mark Monaco and miss paredes.\nSo, as I mentioned, I work as an assistant district attorney here at the Manhattan office and I wanted.\nWe wanted to come and speak to you tonight about domestic violence and the relationship with the criminal justice process and there's a few goals for today's presentation, one being to provide you with a basic overview of how domestic violence cases are treated in the criminal justice system.\nThe point of arrest to the point of disposition, as well as explaining our role here at danny, the district attorney's office, as well as the New York City, Police Department, and the role in these cases between my office and our Witness, Aid, Services, Unit and.\nAs best I can I apologize, I just checking one email from one of my supervisors, but feel free to interrupt me at any time, and I will answer questions as best I can so just to start the quick note about jurisdiction, so jurisdiction, meaning whether or not we have the ability to prosecute a case here in Manhattan.\nThere are domestic violence officers assigned to every precinct in New York City, so they can also report it directly to my office to the district.\nThe city has family justice centers that we work very closely with there's one here at the downtown office at 80, Center street, and so they can also make reports there to the social workers that work there or any of the support staff as well as third party calls.\nIf it's an emergency to the police, if it's just reporting a crime that had occurred in the past, notifying either the NYPD or our office and then.\nIf the victim does choose to call 911 as their route of reporting the crime, what will happen is NYPD will send officers to the location.\nWhat goes on that domestic incident report that the NYPD is required to have the reporter fill out any time a domestic violence call is made it's the officer's job at that point, to determine who was the primary aggressor.\nIt's going to make the paperwork with the officer to come report.\nOnce in ECAB, the case will be assigned to a prosecutor and then the police officer will be interviewed by the prosecutor and then the prosecutor will reach out to the victim to speak to them.\nYou, know I'll call and apologize for the late hour, but we do think it's important to reach out right away to let the victim know that there's someone looking into this and that there is someone determining what the appropriate next steps are.\nWe, send it from the complaint room to the arraignment court for the defendant to be arraigned by the judge, so most charge, DV crimes, the most common charges we see are assaults, criminal contempt, which are violations typically of violations of the order of protection and aggravated harassment, stalking, charges, criminal obstruction of breathing or strangulation.\nEveryone is appointed a court appointed attorney, who will then represent the defendant during that arraignment process and possibly through the life of the case, but at the very least for the arraignment, a bail application may be made by a prosecutor if it's a bail eligible charge and then the defense counsel also has the ability at that point, to make an argument for against bail.\nUltimately, it will be the judge that will evaluate that bail determination based on the likelihood of the defendant, to return to court as well as past domestic violence.\nThere's, always the ability later on, to make change things, whether it's charging, whether or not we need to do it to dismiss a case or make changes to orders of protection.\nProtection, which is the judge ordering the defendant to have no contact with the victim at all.\nSo, based on the facts in the complaint and the information provided by the ADA at the time of the arraignment, we make the requests for the full or limited temporary order of protection.\nWhile the case is pending, they're described as temporary, because they are in fact just that temporary until there's a final disposition and then, depending on the disposition, there will usually be a final order of protection that can last anywhere from six months to many years, and those final orders, just like the temporary ones, can be full stay away as I described or limited, and the limited being that they can have contact with that.\nThey just essentially can not commit a crime against that person, which is something they're barred from doing anyway, but it's just an additional layer of protection or security that you may describe it as to ensure that the defendant is abiding by that order.\nThe IDAS who've been trained on domestic violence, cases will then contact the victims in ECAB, as we've discussed they, but afterwards they'll try to meet with the victim in pre-Covid, times.\nTo just put faces to names and just to speak to that person face to face, even if it is through a computer screen right now, but we think that that's very important, but also because when we bring someone down to the office, we're able to connect them to resources.\nEven now, I think there are some people in the office to meet with victims, to connect them to resources, to provide the copy of that order of protection to explain it to talk to them about whether or not bail was said and what that means, or when the defendant was released, to talk about what's happening with the case, but also to get what's called a supporting deposition or a corroborating affidavit signed with, which is the victim swearing to the authenticity or the veracity or the truth of the information they provided to the police.\nWhat I've told the district attorney's office is true and that's the defendant has the right to be released.\nAnd if we do not, the case would be dismissed on a b misdemeanor case is charged by only up to six months in jail, so attempted assault is a classic be misdemeanor after domestic violence cases that time period is only 60, days, so felony cases same thing.\nWe need to present it to a grand jury within six days for a grand jury to hear testimony and make a decision on whether or not we've presented enough evidence to move forward on felony charges against the defendant and similarly, like misdemeanors.\nIf, it's a violation which is not a criminal conviction, so that harassment charge that we talked about, which can just be verbal threats or those can be covered with by orders of protection by up to two years and actually can result in jail time of up to 15.\nThere is a special victims, bureau, which is dedicated to domestic violence, elder abuse, human trafficking, sex crimes, child abuse cases, as well as the witness aid service, unit.\nThe goal is to enhance the prosecution of cases by assisting the IDAS on their investigation of the case, as well as by providing support to victims to rebuild their lives, and so the Harlem office.\nI'll look at the chat, but if anybody wants to unmute themselves to ask any questions, I'm happy to provide some answers.\nThings like that, NYPD will still have that document of the report being made, but they'll also have the information that the case was dismissed.\nI, think they responded back so and also to let everyone know who's participating in the the meeting today.\nI, know mark touched on it, but primarily we like to discuss the safety with our clients, making sure they're doing everything to maintain their safety as well as assisting them with any safety transfers or advocacy that they might need in the community or to get away from the community.\nHe was sentenced to 31 years to life, for possession of a cro, controlled substance and murder in the second degree of a police officer and he's spent four decades in prison for those acts and during that time, in prison.\nGiven that he can't he reflects on the seriousness of his crime that he took someone's life and that he took someone's father like a father away from their children, which really haunts him, because he never got to know his own father.\nOnce if you decide that you do need to or would like to write a letter on his behalf, then we'll share that information with you.\nBut we know that a lot of that opposition comes from sort of form, letters that have been sent out from from these websites from the police, Benevolent, Association and.\nSo again, board members asked we'll circulate that email correspondence that was sent to district office and was I was included as well and as well as the other chairs that are on this call.\nWe have I'm actually not sure, because we have several teams working on like reaching out for letters, but one of the reasons that we reached out to Community Board 10 is that I believe this is in the area.\nIf you can give any insight on, you know what the precinct is doing in response to package thefts and how constituents might get some action on investigations for police reports.\nWell, officers are responding swiftly to police reports being called in.\nI know this firsthand from a number of people that have filed police reports, like you said within the last like month, and a half, but one residents in particular has had numerous police reports filed over the last four years, and the 28th precinct has not been responsive to these reports.\nI, can't speak 100 intelligently as to how they prioritize petty larcenies, which is most likely what these reports are generated, as but in terms of felonies versus misdemeanors, which is what you know, federal Larceny is those things are less prior I do not want to say less important, but in terms of priority order, you know the detectives contending with you know a spike in violent, crimes.\nYou know that's within the purview of the district attorney's office, but we make arrests over there.\nIf any questions from the community or board members, please just like I, said shoot them in a chat or if you want to like I, said, shoot it in a compiled email and what we'll do is we'll make sure that it's sent over to the NCO.\nI did not know if you wanted to just make a just a quick response regarding the announcement for the the public advocate letter and support for our CB10 resolution.\nI just want to let the board members who are on know that we have general elections coming up, November, 4th.\nThe flyer that is to be created is still in process, but once we receive that we'll make sure that the district office receives it and can circulate it amongst the community.\nWe'll also make sure that it gets circulated from the District office and Kevin like I said."
        }
    }
}