{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCxzvNYT-17mjYJMuDzGx7AA",
            "title": "Budget Priority Ranking Public Hearing",
            "publishDate": "2020-10-22",
            "shortDescription": "",
            "lengthSeconds": "2:08:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "Nzk8t65MrhU",
            "fillerWordCount": {
                "uh": 319,
                "um": 214
            },
            "readTimeFullTranscript": "79 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "item": 65,
                "capital": 53,
                "funding": 49,
                "budget": 47,
                "expense": 39,
                "minutes": 27,
                "survey": 27,
                "priority": 26,
                "health": 25,
                "services": 24
            },
            "wordCountSummary": {
                "funding": 15,
                "item": 12,
                "services": 11,
                "budget": 10,
                "capital": 10,
                "health": 9,
                "priority": 7,
                "housing": 7,
                "expense": 6,
                "public": 5
            },
            "fullTranscript": "Do whatever you want we'll be we'll be okay, how many we got so far, nobles one two, three, four: five: six, seven, eight people, eight people on time on the board. Eight people on time. Okay, I'm nervous, hey sally how's, it going all right. I missed you the other night. Oh wait! You did trash pick up yeah. I wanted to see what had been done in the day since we did our big river suite, because that was a huge event. Oh wow, how many people showed up to that over 50 families, a girl scout uptown, dreamers yeah, we had a million people. That's amazing! That's great! Well, it's not that many people we had eventbrite to pre- register through and then some people do not really read through when it's on facebook. They won't read through it. They'll just sign up there, but between the two of them we did not have anywhere. If I assumed they were all different, we were probably at half that size wow. That's amazing! All right! I'm Mariella, hello! One question: do we have a Mariella Graham and a Marielle Ali? Or is it one of the same person, no different ones? Yes, okay! What's the house behind you wayne it's a picture of a house they took out on at Martha's, Vineyard Oak Bluffs? Oh neat. I thought it was a Buddha Joint, Martha's vineyard, all right, yeah shout out shout out tomorrow. I did not get there at all this year or last year last year, when I thought about going, it was like literally the end of the season and that's what happens when you do not pay attention to the season yeah. I went last year. It was great, but this year of course, obviously it's just complicated, so no yeah. So the two, let me say, hi to the new fault: Mariela, not Ali, but Graham Ms, Era, Santiago, Liz, Leo, Jimenez, Mr, Jimenez hi, everyone good evening, hello, my eyes are so bad, I'm using magnifying glass. I guess the more critical question is how many attendees do we have. I mean we want members of the public at this public hearing the total 17 folks. We have yeah, but only three of them are attendees yep. So you know 14 people who are not on the board maureen collins. Thank you, Clark filled him up. Probably outreach for this hearing is about the one of the few things we do. Not very I mean one of the things we do not very well at all. It's also early too 6:30 is usually pretty tough. Usually 6:45 is when people start rolling in just because work and things, although so many people are working yeah exactly from home, that they should be able to connect more easily because they do not have to travel. I mean when it comes to me. I'm back- to- back meetings, because I'm not working at the office that it's so packed in and by the end of the day, I'm like 10 minutes behind period yeah. I just find it that you know. If I were at work in some cases, you know just the amount of time it takes to get from home to work or back and forth. Sometimes that cuts into things, whereas I'm commuting from my bedroom to my living room, it's a little easier. You know what's funny wayne, so my daughter goes to kindergarten at Ps187 right, acrosss, the street from us, and the only people that are usually late for school are the folks that live acrosss the street. So it's like one of those instances where, even though it's so accessible and quick like I went to high school with a guy and someone else in the in the class, went to junior high school with him, she lived acrosss the street from the school. She was late every single day. I can relate hello, everyone, hello, hey curtis! Can we talk about Arielle's beard for a second? When did you grow a beard? Bro? Probably already the fourth of this past few seven months? Oh wow yeah, it's nice good job. I like it yeah. It looks good. We got tired of your of your of your babyish good looks yeah, not that bad, but he just looked like a little boy like the little boy. Look like one of those bad boys. Is there an order by the way, but I met the thirtieth precinct NCO next to the meeting right now and it's not just seven. So I was wondering if there is an agenda I think Catherine's going to get it in a second, but we're going to be keeping a very strict timeline tonight. Of course you know all respectable, but definitely a strict timeline, because this is not a general board meeting. It is a special session but say what it's only 6 34. oh yeah, because we start at 6, 30., 6:30, right yeah, we'll give it a few more minutes yeah before we get started yep, but no one will be short- changed on time because of a late start, we'll find other places to make that up I'll be on mute until my name is called. So if I do not respond just scream cool and when you see the agenda curtis, I think that we have. We have your order on there. So you'll see exactly when you're going to be able to speak okay from a quorum perspective. I think we're good yeah. I believe we are good here, so we're going to call the meeting to order right. How many do we have 18. and growing so 19? Now, that's not for them, though. That's right! Half of 50 I mean 26 we're not voting or passing a resolution. That's right! Yeah, it's not a okay. We do not have Quorum, but we have more than we have had in past years. Yeah, oh yeah. Oh yes, and I'm seeing all of the committee leads, I think, are here already where's Mary, because really that's the that's. The most important thing is making sure the committee leads are here to speak for their budget orders yeah. I do not see Mary, although we're not voting, we are supposed to have Quorum. Otherwise, it's not an official meeting. We generally do not have Quorum for this meeting, which is unfortunate, but it would be ideal if we had Quorum. But you know this is a public hearing and for a public hearing we need 10 board members. In that case we're good. We are good, oh, let's, just let's get started, we started up Wayne. Thank you for throwing that bone at me right. So we just have to remember that you know it's not a committee meeting, it's not a board meeting, it's a public hearing and for a public hearing. We need ten board members today I learned yeah they're made into order call to order right. Let's cultivate a tour, I am walking, so I literally stand corrected and I'm having time all right, 636 folks, the most joyful of our of all budget rankings, meetings that I've ever attended, so we're going to switch it up a little by sort of like making it more informational towards the newer members and those of us, and I'm going to include myself, who do not necessarily comprehend the entirety of what the budget ranking process is, and it's important so we're going to knock it out in three sort of like breaking it down into main objectives. One is just to inform the members, especially the normal members, what that what the should be pointed priorities purpose of the process, we're also going to create an opportunity for the committee chairs to educate the public on the items, including ranked, and we're also going to explain our fellow board members and how to submit those rankings, especially in this now technology world of ours, the zoom world, how we're going to do the voting, the electronically and so forth. So the first thing first, is you know what really is a budget hearing and how do we conduct it? I'm just going to kind of like something that it really I'm going to use it, for my own experience is that I needed to understand. People need to understand the difference between a capital, expense and a expense budget right. Capital expenses again are something like Street, repaving, Street furniture, dark runs, public bathrooms, computers and so forth, and anything that's over 34:35, 000 and above is a capital expense now expense account expense budgets is so the same as an operating account sort of like the things that you do for on paying rent electricity and insurance. So I wanted. I want to establish that from the beginning, the difference between a capital, budget, capital budget and an expense budget item. I want to get that out of the way. There are other things that Ebenezer I wanted him to since he's the more it's I do not think he's the more experienced, but maybe Wayne and Liz are probably from the group, the people who have the more experience during this process. So I wanted a bit easier to go over a few points briefly couple of couple of minutes and Wayne and Liv is more than welcome to chime in and help us all through this process even easier. Thank you, Mr chairman. Yes, the budget ranking this public healing that we do is a city charter mandate, part of the budget ranking of the city of New York. That is that this process is described in the city charter and it's good to know that this process of the budget allocation lasts for 13 months. So what we're doing now? This process, that the we call the public heating for us is part of a 13-month process that is started in June this year and now we are planning for the fiscal year 22.. We are in fiscal year 21 this fiscal year, 21 is started, July 1st of 2020 and on July 1st 2020 conclude a period of 13 months planning for the fiscal year 21.. Now we are planning for fiscal year 22, and this process has started in June this year by having the local budget consultation, where the community board can have a consultation with the city agencies asking what they need et cetera, et cetera. Then we have the citywide budget consultation where the 12 community boards in Manhattan and the 59 Community Board citywide meet with the city agencies asking what they need. What is the recommendation? What they need, then we come to this process today with the committees they ranks the priority of they need base on the last budget, based on what we have dealt during this year for the complaints we have from the residents, the needs that we see- and now during this few months, September and October, you in your committee, discuss the budget and you did the ranking according to your committee, okay, this is our the committee recommendation, for this is our priority. As a committee. Now it comes to the full board, but to get the information from the also to get input. So I said from the residents. Okay, this is what are the committee's recommendations and now we're going to rank as a full board. You know what going to be the first item from for the for the war as the need identify us in it, and that was going to happen tonight by the voting. You know people are going to vote according to your conscience, you're going to vote now you as a board member going to vote for me number one is probably what is number five in the transportation committee. You have to say in a number. This is my priority because it's where I live or maybe for me number one- is the one for the business, etc. You going to decide your own conscience. What should be number one number two number three among all the capital recommendation that we have from the ten committees and also you're going to rank what is most important for you from the expenses that have been listed by the committees, then we're going to do a tally, we're going to do a survey and we're going to do a process where we're going to sub every voting and then we're going to divide it among the people who participate and then we're going to have the final ranking and really is like a lottery is really going to happen. Who has the majority vote at a particular time of the items, and also I need to bring to your attention that for the last five years, this process has been unified in one process under the city planning agency. In the past it was a separate process with the OMB, the office of Budget and management, and also the city planning. They have two parallel process. One process the OMB was to have this. The ranking and the city planning had a separate document that they called the statement of this street needs. Now, in the last five years, this two process has been unified in one and now we have the statement of community needs and community board budget requests. That is an estimate. What they're trying to do now is basis or based on the based on the budget allocation from the community board, we're going to infer in the innovative and also in the estimate of this, we need what are the most important items for the Community Board, and it has a process that we have been working Eliza and I we have been working for the last month and a half putting this together and by the end of the month, we should have the report always completed for fiscal year 22.. This is at the end of my contribution and I lesser to get away. I do not know if he's leased or is willing to improve. Yes question sally, I think we're going to yeah sure we're going to have a Q&A, but go ahead, sally we're going to yeah. My question is: how is the input from the consultations with the city agencies? How is that filtered back to us? I've been on the community board for what four years I've never heard feedback from the consultation to the committee. Before we do our rankings, I mean now it's too late, but that would be helpful. Well, it's a process that happened. I usually attend those meeting and the process has been simplified a little bit by question and I send those questions to you guys. Every year it happens that most of the time you know people do not pay attention to it, but that's the way it goes. So we have these rankings or this consultation. We receive the questionnaire answered with the agency and I send it to you guys. Okay, I've just never received it and it's never come through a committee. I'm just curious because a lot of times, when those guys present they present like power points or whatever that explain to us where they are at any point in time, and I'm just saying that in the future, that would be useful information to provide back to members and I've never seen it. Dcp has been extremely very outward. Very collaborative we've had two or three meetings with Chris Pollack and I think the other guys Gentleman is Julie Hernandez, so they are really for the first time that I've been involved, trying to make an effort to get not just the staff and the chair and the executive people are just committed chairs, but do not want every single board member to understand the process and the follow- up is also critical. The way that things are being set up now differently. I do not know if ebenezer can testify to that, but this is the first time that I'm sort of like more involved, but I see a difference in as to how the city is more involved in making sure that we all get are part of the process and the follow- up, which is just as important as the process itself just to follow up on Sally's point. Typically, there is a document on. I do not recall what it's called, but it's the city's response, and I remember last year we had it because we were comparing the land use, priorities, the board's ranking and then the city's response, and so the city might say this is something is done and we agree or disagree with it so this year I did not see that, but typically sally that document yeah I've seen that one, the city's response. Okay comes back to us and you know they're telling us either. You know, go back to your councilman and ask for money or money on this or we can't do it. Something like that. Okay committee chair here, I'd like to disappoint this liz, ritter parks and cultural affairs. I do not know what happens on other committees, but on our committee we have a representative from the Parks Department and presumably we would have representatives from the other agencies that are relevant to other committees, saying these are what our priorities are and explaining why they think one particular project or program is more important or less important than other projects or programs. So we had representatives from several of the cultural institutions talking about advocating for their priorities and the parks Department explaining sort of what their priorities were, and that was part of the discussion that we had in our committee. I would like to think that someone from the MTA or the precincts or what have you are attending traffic transportation, public Safety, Et, cetera, Et, cetera, okay. It would be nice to have you okay and Chair Bueno. I just want to keep us on time. Yeah. I was just going to say that, okay, before we move on, is there anyone from the public or our board who needs any type of clarification before we move on to the next agenda item? This is the time because I'm like Barbara does, I have my hand raised. Are you seeing the raised hair? I can't no. I can't I can't even just go for it. Barbara go for it, okay, yeah, because I raised my hand all right, a question. When does when we put something up as a budget item many sometimes I see that it gets. You know a number, a file number a budget number from the city. Sometimes it does not. When does it qualify or what part of the process is it when it actually gets that budget number? I can answer that. Thank you liz. So that's something that's assigned by OMB once we submit our our rankings to OMB, so the items that are new do not have a number when they're submitted for the first time the numbers sort of carry over from year to year, but the last couple of digits of the number are the fiscal year for which the project is so the number of the project is going to change every year. You know last year they would be Blah, 21 e for expense or c for capital this year, once they get submitted. Those will change to the same Blah, 22., okay, but that's assigned by OMB, okay Barbara. Getting that number from OMB just makes it easier to track because it's a lot easier to type in a 10 digit number than to type in a 15 or 20 word description of what the project is. So it's easier to just track and follow, but it's not a particularly meaningful number other than indicating that OMB is aware that we have added it as a priority and carrying a descriptor of what fiscal year it's in and whether it's a capital project or an expense program. Okay, thank you. Thank you. I would like to add a little bit more yesterday we had a conversation with the city planning regarding the budget number and is the budget number that is assigned after we submitted to city planning state identifying that request and is still there until that request is fulfilled. If you change the wording of the request of the of the reason why it will be considered a new number traditional. However, this year they said if the awarding was changed a little bit, but it's still being the same request or very similar request. They will ask they ask her to keep the same number that we had for last year: okay, cool and with this I'd like to yes, wait. I have my hand up because I have to actually I have to mention something before all of this. In regards to my ability not to be able to vote in this process as last year, I brought up this issue where I thought that, due to my position in the DOE that it would be almost advent, it would not make sense for me to vote because of stuff that I know so. Steve Simon in that same meeting thought the same thing for his position at the parks Department we reached out to the Mahan Borough's President's office and they investigated and confirmed that both Steve and I can't actually rank and vote in these things. So I am here to listen and see how everyone does, but I can not submit a voting later on cool and in the forum it's mandatory for names, so we'll make sure that your name is not on there. Thank you, yep great thanks omar for the clarification, so catherine yep all right awesome. So as some folks who know on this call in previous years, we would you know, have this sheet in person rank sometimes there'll be a million mistakes and you know because new items may be added or language might be shifted and it would be tallied by hand and so for better for worse. In this virtual world we get to use surveymonkey, and so it makes the process faster individually for us to Rank. I think it's also more enjoyable, but that's just me, and it also makes it easier for the office staff and for the team to basically export it and no longer tally it, which liz as secretary used to do so thumbs up for that, and so I just want to be able to explain really quickly how we're even approaching this and then we'll move on to hearing from committee chairs, I'm the former secretary it's on oc. Now, yes, so lucky her now so anyway. So this is just a quick screenshot of the link that everyone should have received. Chanel sent it out twice today and then it's a really simple survey monkey, and so you can either vote on either right, we're doing both capital. So essentially it's two question: you're ranking your capital projects and you're ranking your expense items, and so you can either numerically enter it right. So you click on the two arrows you'll pick the number or you can drag and drop them in the order again of what's the highest priority to the lowest priority based on our district needs, based on your experience and your thoughts and blah, and so that's essentially how we do it. You know we have great attendance today. We know that not all board members are present, so there will the this survey monkey is going to be open for the next 48 hours, and so that also allows for folks who are on our board, who do not feel as comfortable with surveymonkey, who will basically our board office is going to do some outreach and compile that right. So, if folks do not feel comfortable with surveymonkey they're able to do it on paper and they will email it to Ebenezer and Ebenezer, and the office team will also reach out to folks as well. So we know folks are not present, we'll reach out, make sure that they see the survey monkey. The good thing is that this meeting this hearing is being recorded and on Facebook. So folks, who are not able to join in, can just re- watch it and listen. If anybody has to hop off also so that'll work, I think that's as best as I breezed through process. You have a hybrid approach, surveymonkey easy open, till Friday 8 pm, and you can also print it. If you want to be, you know using paper and email it to Ebenezer at the office, yep all right cool. So that being said, we really want to use the time today to have chairs offer some really cool highlights about their committee's rankings. This is the order, but we're actually going to switch to public safety since Curtis shared that he has another meeting so I'll. Let you take it away and each chair has two minutes and then we're going to have a space of three minutes for Q&A from members of the public and nobles is keeping track of time. Yes, and I will be as respectable as possible, you can always ask me how much more time you have, but please respect the five minute limit, because we're trying to be fair to all chairs- I'm sorry, Martin Collins raised his hand like five minutes ago. Thank you going to get around to the I spoke to Martin and he's going to get around to the Q&And a I already promised him this time. He just needs to kind of like let the process fall through a little all right. Okay, so thank you all right, so Curtis catherine, I just I have my hand raised. Oh yeah Mary. Is it go ahead? Maureen because there's a problem with my list on the expense budget? Okay, so we'll get to that then yeah. If you want we, I won't take out your time. Tell me what the issue is and I can fix it in real time on the survey. There's the same item twice: there's one missing: we removed it from the survey linky but link. Sorry yeah, you might be looking at the Excel Sheet Mary. The survey link has the duplicate removed, but if there's one missing, let me know during your time and I can fix it and then I'll. Let the time start after cool. Well, you know I'm having trouble going back and forth between, because I printed out the expense budget that Chanel had posted, but I can't print out the capital budget item. You know items all right, so I can't I can fix it. I can fix it at your section and I won't take it from your time. Is that okay, all right anybody else or police give her? No I'm confused or give her a call very confused. All right all right go for it. Curtis go ahead! Sorry about that! I am actually at the 35th precinct. You see me right now. I'll be brief. Excuse me, can you hear me we can hear you curtis I'll, take it off, I'm in the private section. Can you hear me now? Yes, it's rather low. Okay, all right! It's rather low okay volume. Is that better, it's getting there just try and we'll. Let you know if there's an issue, but I can hear myself I'll just I'll go in the hallway. This has to be better. Okay. Thank you. So thank you all very much. I'm going to be very brief. These are our six items for the public Safety committee. Many of them are the same items as last year. We did change a few of the wording based on our last this past year. Continue Curtis, sorry, yeah, okay. So the first item is to expand domestic violence and anti- sexual harassment, programs and training. That is the same item as last year. No change. The second item was to expand implicit Bias mental health training for officers. We felt that was extremely necessary and appropriate, considering the calls to provide external services and additional support to the precincts when they have non- emergency calls, such as mental health issues. So that was a really important item for us. That's why we ranked number two number three was to have, instead of advocating in previous years, we've advocated for additional officers at our precincts. We felt that it was important to advocate for mental health, our clinical professional staff as a part of the precinct internally at the precincts, and the fourth item was to expand public education programs. This is a byproduct of all the conversations we've had over the past six weeks. Six months. Excuse me with fireworks. So the NYPD and fdny attended my meeting, and they did talk about efforts they have in place for next year. That includes public education programs. So we wanted to show support for those sort of initiatives to have awareness campaigns they'll be outside talking to people about the impact of fireworks, Et cetera in our community. So I thought that was a really good addition to our to our list. That's the new item as well, and then the fifth item is to increase funding, to support the issues addressing and corrective violations in regards to the fire potential fires at in housings and other places. We added the word restaurants because we felt that, with the advent of outdoor dining, that we wanted to show support for additional funding for initiatives and efforts that would help curb or mitigate potential risk involved with electrical. You know gas and etc propane tanks and roofs and electrical tanks, heating tanks outside during these crazy cold months and the last one is the speed camera issue. We want to choose support, as we did last year, speed cameras in particular areas. We did not so console as a committee blindly saying, speed, cameras and humps. We added we added the last year with only one precinct. Actually, so we added the 34th and 33rd, and we put in a parenthetical in areas where there is a substantial amount of drag racing and or that's because of speed or disorder issues. We do not know the exact location just yet, so we would love to have an opportunity to make a recommendation on the exact streets. We do feel like it's a little bit dangerous to give authority to have influx of cameras acrosss the district, but we do feel like it's necessary, but in particular areas where there have been a substantial amount of complaints. So that's it for that section. I'll go to the next area now yield the rest of my time for questions yup. You have two minutes for questions curtis, okay, so this is the number one item was. Obviously we had 17,031 complaints on the seller for noise complaints, but we also felt that it was important for the system to be upgraded. We had it. We had this item listed last year to upgrade you know one, but it was not as descriptive as this. One of the things we've noticed over the summer is that there is not a language capability, so we want to make sure that we are able to have a 301 service that includes spanish language as an option in other languages as well, but for our community we wanted to make sure we have. We were advocating for spanish language capabilities in 3- 1- 1. The second item is the same. As last year decibel readers, there was. The third item is from last year, light Tower, and this is just the light tower that the NYPD would use in events. You know if they, if they were out doing a you, know particular area in the evening hours or they had a they set up something it's a removable tower. It's not a tower. That would be in one location for extended periods of time. If there's like an evening block party or something of that nature, that's what the removable light tower would be used for then. The fourth item is a continuation from last year, a bariatric stretcher. This is used for people who are a little bit larger and can't sit on the traditional, normal size, stretcher. This is for in fdny, and then we have the two argus cam argus cameras. These are cameras that are able to actually capture the faces of individuals. We've noticed that when you see these images on television and acrosss the city of people who are committed to crime, you can never see their faces. So the argus camera is a higher quality camera that we should be at least providing to our precincts if we expect them to do their jobs. And the last item is the all- terrain vehicle. This was an item that was also carried over from last year, but this year one difference is that we have received. We received the issue a few weeks ago where there was someone in the park and they that they, the NYPD and the fire department and medical facilities, then they're not able to get into certain parts of the park. They would use the atv vehicle to access whatever the person in need is located. So those are our items. I'm happy to answer any questions about those we're at 5:30 right now for folks. Other folks like please try to stick within the five minutes in terms of descriptions or three minutes and two minutes of questions, but we can open up for a minute of questions. I know you got ta run if you need to have a very quick question. This is liz. Yes, so I see that and thank you. A number of your items relate to sort of public safety enforcement in parks or their parks issues, but to really public safety, which is why they're, not in my committee there and yours- did. Your committee have the opportunity to talk at all about cameras in parks which needs to be through the public safety and through the pd, because it requires the NYPD to install the equipment and to monitor it, because that's not something parts has the capacity to do. We did not talk about cameras in parks at all this year. Okay, no, can you add that in can we add that in for the board's consideration? Yes, you can totally add that in do you think we should add it in under the item where we have cameras now I actually think because they're linked, although there's traffic cameras versus their but although they're different kinds of cameras, I would suggest putting them together in one item: okay, great, perfect curtis: we can. We can add that yeah, okay, guys we're at seven minutes right now, yeah we got ta keep moving and I will say we have 48 hours to fill this out. So if you have follow- up questions for curtis, oh yeah call the person Offline right. Thank you, Catherine Committee, which is the next committee, and I heard the change Curtis I'll connect with you Offline to update the survey on that. Yes, so next up is parks and does not, if you're going to start with capital or expense, I can share it. Can you do me a favor and have another committee go next so that I can hop off of my phone and onto my computer sure just give me a second. I can go back up my landis wayne, you ready sure, so, I'm going to begin with expense and then move to capital. Okay got it so the the land Use Committee had only one expense and one capital item for last year's budget, and we were pleased that the board as a whole ranked each of those items in the top five and feel they are still relevant and made slight tweaks and resubmitted them for the upcoming fiscal year. So, on the expense side, we asked for additional planning staff to work with CB12 and local residents, and this is the change that was added to update Cb12, M's 2007, neighborhood planning and land use, study and formulate a community- based neighborhood preservation and zoning plan for Washington Inwood exclusive of any work undertaken in connection with Edc's inward rezoning. Last year's request did not specifically reference updating the planning study that we undertook with the assistance of city college in 2007, that is by far the most extensive planning study done for the neighborhood, much more extensive than anything done by EDC. So what we're saying is, in addition to formulating a current plan. We should begin by updating that plan and have it inform what we do moving forward and just the last part of that one of the OMB responses was they were taking zoning as partially responding to this request and we're making it clear that we do not consider the work that EDC did on the inward rezoning as being responsive to this request. That was not a neighborhood preservation plan and that did not at all take into account anything that was in the 2007 study, which we did share with them before they understood their study. So that's the expense item for land use on the capital side very minor tweak. It calls for the allocation of capital funds to support a development initiative in Washington, Heights and Inwood, whereby vacant city owned lots and buildings are packaged in one or more rfps dedicated to scattered site, infill, affordable and the word affordable was added this time before it simply referred to infill residential projects, for which affordability is defined by the area median income of current CB12 residents, and I will say that this is something that is not limited to CB12. At the recent Borough board meeting the chair of CB9 pointed out that there are city- owned buildings in the district that are vacant that could go towards affordable housing but they're sitting vacant. So this is something that we might want to talk to our you know other boards, but we're saying that there are vacant lots. The city owns their vacant buildings they've been sitting for years, let's put them in an RFP, let's allocate capital funds, so they can be affordable and let's get them developed. So we can begin to address the dire need for affordable housing in the community, and those are the two land use items you have about a minute and a half for questions. I see a bunch of hands raised, but I'm not sure if people put their hands down. Anyone want to answer a question. No questions hearing none next nice job, Wayne, all right next committee, then thank you back to parks, I'm ready! Thank you for your indulgence and thank you Wayne for being ready, so I feel like they're, all my children and I love them all of these projects. Parks and cultural affairs typically has more projects than any other committee and more than several committees combined. This is be this. There are two reasons for this. One is that, unlike every other city agency, the Department of parks and recreation does not have its own capital budget, so 100 percent of the capital projects have to go through this process. The second thing- that's really important to keep in mind, is within community district 12 about 40 percent of the land in community districts. 12 is parkland, so if you think of it from that perspective, it's actually appropriate for the majority of our projects to come from this committee and for this board to rank to highly rank many parks projects, because this is the only way that parks sort of gets its funding in terms of the actual projects. There is not enough time for me to go through all of them. You can read them on your own. They are all important, even if they're not important to. You, might not think that barbecuing is important to you, but there are many people who do not have houses in the hamptons who can not go to the suburbs. They rely on the recreational facilities of parks and recreation. Many of the projects relate to accessibility in bathrooms. Either retrofitting existing comfort stations or adding new ones there's a lot of basketball. You might think basketball, not my thing or I'm not a child or who cares or why are not we playing golf or some other sport do not vote for yourself. Keep in mind what other people need keep in mind the powerful testimony of people throughout this com. This community, who, year after year, attest to the importance of bathrooms, of ball fields of basketball courts and of many of these other amenities. That, as I said, may not be important to you, but they are important to your neighbors. So that's the capital piece I will put in a personal pitch for the least glamorous, but I think most important thing, which is just repaving the paths you can't. You watched me walk to this meeting through a dark park and I was able to do that because the paths are paved in terms of expense programs. I do not have it handy, but we really have in these Covid-19 times a desperate need for more funding for programming and for more funding for arts and culture, more funding for staff to maintain parks because they are more heavily used and keep in mind. The Parks Department has gotten a 14 budget cut. That's my report. I think I have about 90 seconds left. You have two minutes left and and expenses about Catherine just pulled them up. Thanks are there questions? I have a question I'd like to say something: I'm going to take an angel's question. First, you want to go through the expense budget. First, that's fine, or did you because that's what I was going to hit? No, I mean I did not. I mean all of the expense items are pretty self- explanatory. So the one change is that the native american African Burial grounds used to be a capital project and we had attached to that the building of some kind of structure in which programming could take place so that made it a capital program, a project now that we've removed that out- and it's really just about like signage and curation and maybe something with Q codes. That is not a capital project, that's an expense program and that's why it moved from capital to expense and that's why it's new, even though it's really not new, but it's new as an expense item and what's your question because we only made it was going to be in regards to that particular project. Liz, I'm sure you remember when I was with the state senator yes, I do great. So there we had conversations with the dartmouth, the Dikeman Farm House. I believe there were funds allocated as well to be able to do some type of capital expense work here where a physical memorial could be built out. Let's talk offline, if you want so that, maybe we could do some follow- up and because I know we also involved Assemblywoman Carmen De La Rosa's office. That would be great and yes, let's talk and Barbara, I think we got about 15 seconds left so make it fast. I overlooked. One of the projects highlighted is to at the Loftus Playground build a special needs playground for the autistic for the blind for all special needs. Children. We have no special needs playground in north of 96th street. It's a it's a crying need and the Loftus playground is uniquely suited for that, because it's a little bit below street level. It's quieter, there's also grassy area immediately. You know next to it already has bathrooms available, I'm sorry to interrupt Barbara a little bit over time. What's her question, she's plugging a project, that's important to her. All the projects are important to everybody and they are all pretty self- explanatory. So with that, I yield my time, which is thank you Liz Catherine, yeah, Steve Simon, yes, Steve, Simon, Health and Environment. Oh, very good, oh wait a minute, I'm so sorry. I need this five seconds to say that we're also the Cultural Affairs Committee. There are a number of related projects, including the one that the committee and the aggregate ranked number one which is funding for the hispanic society and many improvements there to make it accessible. But anyway you just vamped for Steve. You like give them some time, go for it steve. You want capital or expenses to be shared. First put up the expense. First, all right, starting your time, steve all right, so the health and Environment Committee has the 11 expense items number one which has been our number one priority for the I think, the last six years and during that period has been the board's number one priority several times is to expand mental health services in the community this year, we're at the urging of the committee on the aging we're emphasizing the fact that these services are needed, especially for seniors and others, whose mental health and Social engagement have been adversely impact by the Covid-19 crisis. Our second priority is to increase services to prevent and treat chronic diseases such as Alzheimer's, diabetes, cancer, heart disease and hypertension, conditions that increase susceptibility to Colvin, 19. and Covid-19 is a theme through many of our priorities. Our third priority is to increase trash basket collection on commercial streets in district 12, fully restoring the Fy 21 budget cuts, I'm sure, as many of you have noticed, our streets truly looked trashy because of the lack of reduced number of pickups okay caused by the budget cuts. Some of the the budget cut, I understand, is being restored in part, but what we're urging here is that it be fully restored. The fourth of a priority from our committee is to increase staff to conduct regular noise enforcement in the community, especially at night, air quality monitoring and water quality testing in our community. This in part, is a response to many of the complaints that our board has heard this summer about noise issues. This would not satisfy all of those problems or respond to all of those problems, but it would show at least in that our board does consider noise to be a very significant issue. Our next priority is brand new for this year and again derives from the cover 19 issue. It is to increase funding for a targeted educational outreach campaign for Copenhagen Prevention and support services in underserved communities such as Washington Heights inward. Our next priority is to increase HIV AIDS prevention and treatment, services and lgbtq services in our community. The next one is to increase substance abuse services, including opioid, Overdose prevention, education and funding for syringe, cleanups and collections. The next one is to increase pest control efforts to eliminate rats, cockroaches etc in our community. The next one is to provide funding to ensure that all local public schools have multi- service health clinics with nurses and social workers. The next one is a repeat from last year: increased funding for education and outreach on recycling, reuse and composting, as well as the proper disposal of household garbage in our community, which which, if, if done effectively, would help reduce some of our problems with overflowing trash baskets on especially on commercial streets and the last one is to create an educational campaign about the federal public charge rule to inform immigrants of their rights to obtain health services and other benefits this rule has been. An injunction has been issued in federal court against the enforcement of this rule, but it is only in effect during the Covid-19 crisis, 19 crisis. So once that crisis is is diminished. This will once again become a an issue that many of our residents are going to be facing ebenezer. I would want to point out that these last two items are not new. They are, they are repeats from last year now, if we could go to the Capitol list, it kills me to say this steve, because I love you so much, but you got a minute left my friend well, thank you nobles. Well, the the our capital list is basically a repeat from last year. The first one is to expedite the replacement of old water mains and sewer lines in our community. A lot of work has been done on this issue in the last two years, but we still have in several areas some old water mains and sewer lines that do need to be replaced and our other two items are to provide additional garbage collection, trucks and street sweepers with snow plows and to install green infrastructure such as bioswales to divert storm water from the sewer system and and then we have one, which is an old item which you do not have to rank, which is because it is funded in the city budget, although I do not know where, if it's moving at this point, but it's to construct a new garage on the lower on the west on the lower on the east side, the Midtown East, so that its trucks can finally be relocated from our garage on 215Th Street. Thank you I'll. Give you I'll give you a few seconds for a question. Does anyone have a question for Steve all right, catherine back to you? Okay, next up is concerns for the aging so Mary. This is this. Is yours right, yeah, the capital we'll start with something yeah, because I promise you Mary. We can make a change if you needed it. That's outside of your time. The duplication is not in the survey monkey. So it's fine there. I know the exact one you're talking about, but you said you're missing an item. I took a look at the Excel sheet and I'm not finding one, that's being missed, but the Excel sheet might be the issue. Okay, it's under the expense, but I'll do the capital first, the first one. It's actually a change of wording, so it should probably be new yeah. That should be new ebenezer right because we changed the wording on it. It's kind of the same thing: system- wide upgrade of CB12 area to improve access to connectivity and Wi- fi. Originally that had been to improve access, connect to connectivity and Wi- Fi in senior centers, but with the Covid-19 and all of the zoom meetings and expectations. That seniors will. You know log into a number of things in the and you know and at various venues we would like to consider that all of Cb12 M area be updated as far as connectivity, the second renovate existing or build replacement, senior centers, that's necessary to comply with ADA and diff to regulations. There are still some senior centers that are not ADA approved, and that is part of the addictive regulations, and it also prevents people in the area of those particular senior centers to take advantage of what they offer. Third is provide funding to construct, affordable, accessible senior housing. We can have affordable senior housing or we can have accessible senior housing, but not both so we'd like to improve that funding. Okay and we can move to the expense budget items and get it on the screen. Okay, let's see two three yeah see the second and third one same thing so on the Excel sheet, it's duplicated, but on the survey monkey, it's not so it's fixed where people need to vote, except that there is a third item that you know is not there and that's the one I was asking for. If you give it to me, I can add it to the survey right now: okay, ready, I am increase funding to expand services at senior centers in Cd12 M to include hiring additional social workers and program coordinators, comma, adding meals, comma extending hours, comma increasing per male per meal reimbursement rates. Can you repeat that one more time just to make sure I have it? Okay, increase funding to expand services at senior centers in Cb12 M to include hiring additional social workers and program coordinators, adding meals, extending hours, increasing per meal reimbursement rates noble's. Just actually here number two item ranking item in last year's expense budget. So, if there's any other qualification, I can just send it to you. Send it to me if you could all right. Thank you. That was last year's number two, her last year's number two. I have a fast typing hand, but I did not catch all of it. So yeah shoot it over to me. I did not. I did not count that towards your time. Mary, but I'll start your clock back up now. Is that cool? Okay, all right? Okay? So the first item increase access and outreach to healthy cultural, appropriate food for seniors with medical needs and that's a revision from last year, because we wanted to include culturally appropriate food number two increase: the expansion in the program, expanded in- home services for elderly persons, funding to provide affordable home care, including sliding scale reimbursement. Some of the agencies are outrageously expensive in terms of getting home care, especially for for those that happen to have a bit of money and have to self- pay number three increase funding to expand services at senior centers in Cb21 to include hiring additional social workers and program coordinators, adding meals, extending hours increasing per meal reimbursement rates. This is actually, let's say, all right. Number four increase funding for transportation for seniors by restoring prior City Council funding and expanding access and outreach. The funding for transportation for seniors has been decreased. So we need to get that back up so that there can be sufficient transportation. Increased funding for naturally occurring retirement communities to support, currently unfunded mandate for nursing hours, we'd like to see these norths as they're known as continue, because they provide some greatly needed services and areas to allow seniors to age in place and number six other than personal services. Funding for replacement, furnishings, non- capital and senior centers that need are as needed. Some of the furnishings in the senior centers are in a pretty sad state of affair, but the funding is not there to be able to improve the problem, and that is it cool and we're at five minutes 30 seconds. But I'll give you one question. If anyone has one question, I have a quick question about the Nork item. What do you mean by supporting the currently unfunded mandate for nursing hours? What does that refer to? Well, there's no specification in the norcs to you know provide for a sufficient number of hours of nursing services. There are a lot of things that the elderly need. You know what those new works. They need blood pressure checks they need. They need things that they would not necessarily need to go to a clinic or a doctor for blood pressure checks. You know those that are on blood pressure, medication just to have their blood pressure checked periodically. They need, you know, explanations about their medications, they need advisement about. You know whether they ought to go to a doctor or not, if they're having some issues, but you know the it's a catchy sketch can in terms of how many hours that they can fund a nurse to be available, and it's not full time. I have your updated question from Eleazar Mary I'll, definitely add it to the survey monkey, but but yeah catherine keep it moving. Thank you. Mary yeah can I just say one quick thing sure shout out to Steve for including the seniors and the mental health services needs. Thank you Steve. That's why I love them, go for it Katherine all right, awesome, just so! Housing's next audio you're, next, just really quickly for members of the public, feel free to use the Q&A as each chair presents and after we go through each committee chair, we're going to open it up for new items because, as you're noticing, some of the items that folks have raised in the previous months are on here already and we'll start with the expense. Oh actually, do you mind if I start with capital? Okay, great so good evening, everyone I'm happy to provide essentially the items that we've put forward: there's a total of six on the capital, seven on expense. What you'll see on the sheet is that we've continued to keep four items. I also just mentioned the fourth item, specifically being providing funding for the construction, affordable, accessible housing for seniors. The additional two items that were added were really based on previous year's expense items. We've provided increased funding for aep and ppp programs for the preservation and rehabilitation of distressed buildings in Cd12 M, and also added an additional item of providing internet access and publicly available spaces, including hra service centers. From what you'll see in the top three items, they are really sticking to what we said in previous years, trying to ensure that the affordability is still our key goal here for the fiscal year, 22 expense items. What you'll see is that we've kept roughly about four items from increasing funding for free legal representation in housing court. We have seen both the limitations as well, not to mention the greater need for this very service, and so we want to make sure that was the top we've asked for providing funding for the home based program in Cd12 M, providing more funding for food pantries, which was brought forward to us by our health and Environment Committee Chair Steve Simon. Thank you and we've also included some items in relation to supportive housing for Lgbtq youth, increasing the funding for more HPD housing code and DOB building code inspectors increasing really what is educational resources, letting tenants know about what their rights are and also providing for the creation of a fund to aid in the upgrading of an electrical system in buildings. What I would say in defense of this is that, although the issue affordability has long been of such great concern in Cd12 m, the pressures of affordability have fallen the hardest amongst many of our fellow neighbors, who are the most vulnerable. Yet some of the most dedicated allies who have served with us throughout these past seven months. In the midst of the pandemic, many have lost their jobs, have had their hours cut back their businesses closed for good and now even face the need to traverse finding work in completely different employment sectors or to seek out an early retirement. The reality of such harsh truths gives us the means to understand that for far too many affordability is far too out of reach when incomes have historically kept dipping, and although declining at this very moment can and will continue to rise, much higher within the next few years. If we do not attempt to construct not just more housing but housing that is better equipped to address the needs. That's not in such as just described. The lack of economic security in the face of financial downturn reminds each and every one of us that our communities endeavors to be a place for everyone must follow by action, paying critical attention to those who are most vulnerable and must have resources allocated so as to ensure it can remain in Washington, Heights and in wood. With that, I'd like to pass along my time to Martin Collins, who was asked to speak a little bit more to his concerns on the issues before we go quick question: a quick observation, capital budget item three in aging and capital budget item 11 in housing and human services is the same, and I would recommend that they be combined to one of the other, which means the board gets another item to vote on, as opposed to splitting votes between tasks that are the same, also Ariel. I have a quick comment or question if I may just because there's the time, could I still pass that along to mark collins? If I can ask my question afterwards, I paused your time for that interjection. Ariel no offense Wayne once Martin starts I'll start it back up but sally. Let's keep the questions for after Martin if that's cool. Okay! Thank you. Martin we're at three minutes 30 seconds, roughly just to give you an idea of what you're working with here are we acting on Wayne's suggestion as soon as we get through the procedure here, he Ariel did pass it towards one minute and thirty seconds and there's more cool: go forward: Martin, okay, on the capital budget, providing funding for the construction of 100 permanent, affordable housing based on community district 12's average median income to not-, for-, profit organizations and community land trust that are partnered with not- for- profit developers is essential. It's the housing human services number one capital budget priority. I think it should receive the Community board's highest recommendation. Thank you. Thank you, barn and yes, I'm so sorry wayne your question. It was not a question per se. It was an observation that we have a duplication between the aging committee and housing and human services the same, and so we know that technically there is a cut off on how many expense items we get and how many capital items we get, so it should be in one or the other, which then frees up a slot for something else to get into the list. Great yeah, I was going to just add to that. I'm like I do not know. If there's a preference in terms of if it's listed under aging or listed on their house, we can just remove we'll, remove it from the survey monkey and from the one which one do you want me to talk about. I would like you to just whatever is higher in the ranking. Just keep that one out of the two. We have not ranked them yet and we you do not want to rank them while they're both on the list yeah. I said it. I said: that's what I had in my hand for now yeah I say for now, and then we'll figure that out what I'll just say it was on the ranking last year it was about 48., I got it yeah I saw it. So what would you like for me to do on the survey so we'll just pick from the committee ranking which everyone's hired in committee? Oh okay, cool, yeah, I got you got it so Arielle you have about 40 seconds, left yeah, I think Ali, I'm sorry Sally did you have a question yeah? Are we going to? Is there anything included, and I apologize because I can't see the expense list right now, but directly addressing homelessness serving the homeless population, given that we do not have housing for them or given that needs might come up like portable showers, portable toilets, that kind of stuff the home base is specific homeless people without homes, yeah home bases is specifically one of the areas in which we've, at least in my time, serving in city government. I've specifically referred many people, that's where they can actually be connected. It's kind of a one. Stop in many senses for a lot of aid. Okay, could I just throw in since senior since affordable senior housing is the number three item in the aging committee and the number one item in the housing committee. I respectfully request that it be removed from aging and just go as housing and Human Services Committee's number one item so that we're not pitting two committees against each other, for what is essentially the same thing. Is that good for you, mary, it's number four on it on the housing committee. I'm sorry! I thought it was number one, no huh different item. Ah, okay, so it's number four out of six for housing and it's number three out of three for aging. So could somebody just flip a coin and tell nobles duke it out on the side and tell locals what to do? I do not think anybody else really cares. All right, Ariel, I'm going to take it from you. Unless you know. Ladies first, is that cool? I'm good here? Thank you! Sweet I'll! Take it from you! Thank you, liz all right, catherine, wait does Steve. Do you have a question for audience on because your hand is up? Oh sorry was that to me yeah I was asking because I just thought your hand went nuts. Oh yeah my hand was up on this issue. We just resolved okay, all right, so we are moving forward. Then Steve take your hand down I'm working on it, I'm working on it and there are a couple of people with their hands up. Oc, Omar and Tanya have their hands up yeah. We have a Q&A, we have the time, so please so does debbie. Here. I do not see anybody. I do not see her all right so you're next and I have the expense sheet up. So it's easier to start with the expense stream. Okay, are you ready? Yes, hello? Okay, it's me right, Faye yep! We can hear you all right. Thank you, hello, everyone, okay! Yes, I would like to start I'm going to start with our expenses expensive budget. Let me see something I also want to see mine. Okay, as you can see, on the first Jesus right yeah on the first item that we have for our expense. Actually, let me just take one step back so on the expensive budget. We have seven items and then on capital, we'll have 13.. But let's start with the expensive item number one priority for our committee is provide funding for to improve the connectivity option of internet oops. Sorry about my camera, let me see if I can hold on please yeah funding to improve the connectivity options of internet Wi- fi services for the student industry. Six, as we already witnessed throughout this pandemia. Still, you know, students are having you know a lot of challenges trying to especially families that can not afford paid. You know for the services I so we consider this is to be our one priority because from that actually depend the student. You know the outcome of how the school year is going to get them full for them, and I think that having the proper connection also brings some kind of peace of mind, not only understood, which is the most important. You know, at least for us, but as well for their parents as well. A lot of parents are unemployed and you name it. There is tons of problems, so our second priority, as you can see, is the need of mental health problems. We are asking to provide funding for community- based organizations to help finally, youth and children and neo- mental health assistants and affected by Covid-19 in our district exclusively. I understood- and I heard that some of my colleagues as Steve, I think, has something similar, but I do not know it's, I'm not sure if it was as specific, so we had layout in our second priority and where we just precisely are asking for family youth and children and mention you know the coffee, especially people that has been affected. You know, or families, by the Kobe 19.. Our third priority is the needs for ipads and chrome's. I mean chromebooks and industry sticks, but there was one of the spellbreak specific requests that we have for this school, I think, is Ps Ps128 in which they are saying that they were short for 200 mixture of you know, 100, ipads and also 100 chromebooks. Our former priority is the needs for Esl and ell programs in our district, meaning provided funding for second language speakers, learners and also for people with other languages as well all industry six. So I think this year, unlike other years, I think we're really being very specific, asking for all these kind of fundings and assisting just for our district, but also for the school district. Our number six priority is child care programs. I think this is something that is very important: providing funding to increase child care in this 312 to help children develop essential skills like, for example, social and emotional communication, skill, which is so much needed in this time that we are you know facing with this pandemic, so they also will need the they need to succeed in school and live as well. I guess looking at the emotional aspect, which you know the outcome, that this will have when, hopefully, all this pandemi, you know stay behind us so hopefully providing all. This funding may bring some peace of mind and stability of mental stability, and yes, last number seven is the youth suicide prevention, which is something that we've been advocating all along for years and years as Steve has been. A committee also has been advocating for the same, but in here we are asking for suicide funding for suicide prevention programs in district 12 for families and teen and shelter experience in isolation and dealing with grief during Discovery, and I think a lot of kids like they had lost their parents. Relatives grandparents as well- and we know all that- but I know how to stretch on this because we do not have a story. So if I may, please, let's go to capri capital expensive now, please, yes and our capital expenses. As you can see, our priority number one is for Ps28. We are asking here industry six, why funding to install civilians system security camera in at the entrance and the axis of Rasco students? Environments needs to be protected. This is something that way back to 2017 to like, if I'm not mistaken, in 2000, yet 2017 when I used to be a bcc we'd be asking for the and these and I've been granting still. Thank you, Mr Vice President, I'm sorry one! Second, thank you we're at six minutes. So I do you have any last words. I'm sorry. It's set against that no worries we're at six minutes. So do you have any, like last words to kind of sum up your capitals by any chance all right, so you know what it's all on the screen. People can read it and all we're asking is just to my last word on this. Is I'm going to ask my colleague to be kind general rating, as I'm going to try to be kind as well, so we can get at least number one number 23 when they, when the, when we do the one overload ranking, that's it so the rest is on the screen. People can read it and so forth, so I have to stretch any questions. I just want to say thank you for your championship of the youth yeah. Thank you. I have two quick questions. Who is this? Do we have Wayne noble? Can you do one because I can give 30 seconds, but we got to keep it already have something fair yeah, because you can also follow up offline. We have 48 hours. The point is this is another case where the aging committee's Wi- fi item, which is in capital, which seems to be broader than youth and education's expense item. So the question is: should a Wi- fi request be in capital or expense? So we need to clarify that and I think we need to eliminate one of them and go with the broader one is asking for connectivity community wide and one is only focusing on connectivity in the schools, but schools would be covered if we did the one that was community- wide. But the critical question is: should this be in expense or capital, and one of the ways we lose items is: if we put it in the wrong category, so community- wide is definitely going to be capital. Wi- fi, if it's a narrow scope, might be expense and wayne is absolutely right about always going for the broader and not the more narrow. The give me give me a second. I mean yes, okay, please answer so we can move on and I give an answer and nobles. You can move forward sure. So we have the choices to make a broader meaning in the whole district online. Specifically just for this way ask so wow! Well, I, if I read it correctly, I think you're saying what Mary is saying: system- wide upgrade on CB12 area to improve access to connectivity and Wi- fi. That's one issue and I think what fay is saying that she wants access to outreach. What is it? No, I understand what brain I understood. What was proposing is just to keep the either to keep the the broader aspect. You know the in the whole district or just are we? Oh, I actually want schools are part of the community, so if we have an initiative that is community- wide, the schools are covered. Well. Why do not we just say in some language that says, but what happened? What I wanted to say is that this past summer, and even since the pandemia started at school in particular, you know- and now more than ever, hey it's more than schools that have the connectivity issue, everyone that has to work. So I'm sorry, I'm sorry to jump in. We do have to keep it moving. Sally also has a question when it comes to your point of clarification, wayne you're completely correct here and clearly Liz. You know seconded that. But the thing, though, is that like can we make this decision offline? I will change it on the survey monkey and then we can keep it moving sally. I think yes, this is my question. It seems like many of the expense items are targeted specifically to one or two schools where the problems exist. District- wide air conditioning facilities upgrades et cetera. I do not know if I'm looking at capital expense right now, but I wonder why we targeted 128 and 28. Specifically, when certain of the problems I know are disrequired- and I would definitely say this is a question that could probably be answered offline and if they want to give me some changes, yeah but send them to me, I wanted to say something that is highly important. Our community or our district has started on 155Th Street and ended in 218.. The district school is starting 137 and go up to 210, meaning that if we only concentrate in our district, we're going to then leave a school that had already you know and 137.. This is part of our district school. No CB9 would take here all right. I'm saying we can you please, because it's not fair to Ariel. It was not fair to lose. It was not fair to Curtis. Thank you, so I really want to keep my work. Thank you, catherine. Can I raise a point. I have a point to make way. Wait. Sorry, we have four more committees yeah. I really want to keep this fair. We want to keep it going. We know folks have been patiently holding their hand up, let's honor everyone's time right. Let people move through their presentations and then we can just go back. Thank you. Vice chair all right, so next up is Domingo. I Wanna start off with capital. So basically what we? What we're seeing is you hear me? Yes, you're all set. We can hear you domingo you're on Mute. Now, though, there you go all right cool. So basically, what we're seeing is the lack of infrastructure when it comes to the business, the business sector within our society well within our community board. So a lot of the suggestions on the committee were based on a lot of addressing not only infrastructural but more pipelines of communication, which seemed to be there, but it was kind of sort of like facade- ish. So basically, our first recommendation was business training, capacitation hubs, in addition to the service already provided by SBS and up to and including personal coaches and resource navigators. So once we, what we noticed during Covid-19 is that there's too many people saying the same thing, but a lot of the resources get lost in translation. You know so being able to have the adequate personnel to be able to explain what the resources are and how to connect to them is going to be ideal. Moving forward, weatherproofing for outdoor dining, safer street initiatives and plaza investments was more aimed towards the city planning. You know, as we understand what we were seeing during a pandemic is the potential of being able to be better organized when it comes to outdoor, not only dining but outdoor activities in infrastructure and business subsidies to support the optimizing of outdoor dining. So now that we are dining outdoors, there should be some either micro grants or grants accessible to businesses to be able to make a transition, as they engage in this new world of life during covenant and after hopefully, and funding for a new facility for the Washington Heights Corner project, which is actually not new. I just did not find the number, so that's not a new project, but I think that being able to encourage spaces in a location which is equitable for all is important in order to be able to deal with the situation that our community is experiencing with drug usage, etc. We should not abandon them just because of that and now over to his noble, I think he wants yep and as she switches over as she switches over at three minutes. Oh we're good! Oh cause! Oh, I thought you. Oh, I thought Catherine is handling, I'm sorry, my bad, oh good, and then we, our first rank, was funding for Business Committee, virtual and physical resource guide for new and existing businesses. Information is key regardless of the times, and I we felt that it was extremely important to as volunteers and as people who give recommendations at a city level to be able to have a hub where we could share resources with all the businesses and everybody directly. That's directly impacted by our committee, spanish health inspectors. That's ongoing situation that our community is experiencing. You have inspectors that go that do not necessarily speak the language, etc. So more investments on that virtual organizational chart of role and responsibilities by city agencies. We want to know who's who so, when we get the information we already know who to identify as such marketing support for businesses, which is ongoing, is not new and educational campaign on potential impact of in inward rezoning on businesses, and I would like for the rest of the time if anybody in the committee who's on would like to chime in feel free to do so, and for this piece you have about 45 seconds any questions domingo. Could you could you clarify in it's the capital, the first one where it says business training is? Are you talking about building a business, training center or funding business training programs? I think it's much more on the center being able to build a center. That's able to do that. We could specif. We could be more clear yeah, because if it was funding that would not be capital right and also the third item, where you're talking about business subsidies, business subsidies would be expense, not capital. That's correct: we'll switch it over okay, I will send me those changes. Can you email me? Those changes, domingo and I will add them to the survey monkey. All right. Thank you are we moving? Are we moving next to the next one yep? No, I have not I'll have a question all right, we're at five minutes 30 seconds. So, whoever it is. You got 30 years older. It's way over, so we'll, okay, cool catherine up to you. So next up is debbie. Okay, guys, just one more thing, I think what I think the first sentence I said when we first started- is that we wanted to flip the switch. I really want to encourage the no, the newer members or those of you who have a question so that you guys get inclusivity here. I know that we have experienced people that we love their contributions, but we also want this process to be as inclusive as possible. That's the comment I wanted to make so do not be afraid, just ax axe away ready for me: yeah go ahead, debbie we're on Capitol Hill, okay, the capital. There have not been a lot of changes to what we focused on the past. I would just highlight that the first item we have about accessibility in in the subway system is one that we even talk about. It's such a such a paramount issue for everyone who uses New York, City Transit, but certainly in our district- and we talked about even making this our only capital priority, but we just decided to rank it one and keep some of our other things and which were rehab on the a train stations at 181 and 168, and the one train at 207Th Street. So this stuff is, this is pretty self- explanatory, pretty straight up and the Ind Irt indications are a test of how old you are, but we can flip to the expense now and on this spend side, you'll see we. There are some changes to some of the things you might have heard from this committee in the past and we tried to better align. You know what we hear from the committee and from the community and what we're sort of responding to throughout the year and align that with these expensive items. So it starts with a general sort of increased funding that relates to maintenance, cleaning security. All those things that definitely have been diminished, I mean granted cleaning in the subway is really going well right now, for obviously a not good reason but the other items you know, we've lost a lot of services and stations next fairfares I mean this is an interesting one, because if you'll remember the community board, when Aisha took this on a leadership role of getting the community board focused on this excellent program, which offers half- price metro cards to people. This is one of those places like many parts of the budget that are on the chopping block with the dire budget situation. So Fairfares is proposed to be getting cut. I think in half it obviously was already insufficient to the need. So that's you'll see that here and then when next we have two traffic studies on two areas again that we talk about a lot. One is a whole area from 165Th Street going north on Fort Washington in front of the hospital, and you know we just your city, buses are getting hung up, people are getting hung up, it's a complicated place because obviously a massive hospital is there and then the other 207th, where I'm late, because I just came from there and listened to community members talk about the situation over there, but this is one that also Richard. Allman has taken a lot of leadership on making sure that it stays on our radar, and I do not think I need to sort of explain to this committee sort of how complicated that spot is, and then we just have, as you can see, just sort of the general potholes and one thing we discussed with Mary Anderson sort of again it sort of crosses in aging, as well amongst other things, but we've gotten lots of new crosswalks and more pedestrian friendly, curb cuts, except sometimes they do not connect to the street. So you actually end up with this like big crevice, and so that's it all right. Awesome. Thank you! Debbie. We have a minute for any questions yeah, so we're actually going to start a Q&A, because that was our last committee presentation Perfect, I forgot licensing, does not have items, and so we're going to go in order, as Elisa mentioned folks who have not necessarily spoken up and new members, so we have Tanya, Marielle and Danielle before we go before we go to Q&A for Debbie, her expense item, the second one on fairfares. Are we missing a word or phrase? It says, restore you know, funding at least two, and then it stops. Oh, let me pull that up from yeah. I do not know what happened there. I think it said more. It was probably a column width thing, I'll look back at my source document, thanks, Wayne, okay, and when you find out debbie you can cut in at a nice point. Let me know and I'll update the survey monkey in real time, okay time to go on yeah two things I do not know if curtis is still is he on again, but he I asked him. I think it was an important point. Oh good. Thank you Curtis. I think what you had answered to me was an important point. I think it should just be on public record. In terms of, I know that you, one of your items, was to address, expand implicit bias. You know training, and I wanted to express that this is whether this would be impacted by the federal government, particularly the executive office, barring funding from any federal anybody receiving federal funds from offering like anti- races, that type of training- and I think, that's important, because if we're asking, you know NYPD to do something if they're getting part of for the federal funding. I just wanted to know how that would be impacting. You know that goal because it seemed like it would adversely impact that goal and then the second point I wanted to just wonder how we are getting these budget things to the public, so they can see, because I think it would be very hard for people to see this like first in the meeting or something and then try to make sense of it to even ask a question or even know how to ask a question or even understand what any of this is, because even some of us are on the board and we've seen it. We have a lot of questions, so I just wanted to know what how you know how we're you know how that's being done in terms of in advance getting that to people so that the public actually can be in you know, making form you know have informed questions. I have my hand raised, and I have a similar comment is about the training or about the actual for the general public yeah I in past the public has actually testified. This is a public hearing, I'm just wondering when we're going to hear from the public. I mean you can stand up soon as the board members stop asking their questions. Okay, so right now, that's why I called stacks of Marielle and Danielle to move into the general public and Catherine addressed that earlier on Sally and it's happening as we speak. It's getting prepared, I'm just a little concerned. It's all good, I might turn around and then I'll connect Offline in terms of the process, because and Curtis did not even respond to my question, so I know he did not. I had asked the question, so I know that I just that's what I said we can connect offline in terms of the process. I do think you're right. It's confusing. This is actually my first budget hearing because I never knew it was a special meeting. So there's a lot of changes we could make and I think, with changes that we made to the website and the fact that it is through surveymonkey. We can get it out to the public sooner but you're right in terms of like the goals that every month the committees are meeting to, discuss these items and are actually bringing forth what committee? What has been brought up all year right into the budget, ranking and priorities, and I think we can so just and just briefly, I do understand the issue and the complexity with the federal now new policy or executive order, I think it is worth, is worth keeping on the list. Just in case there is any sort of state or city funding that would trickle down that's my response. Have we been following the chat, catherine we're going to get around to that? Yes, we are following the chat and the less the board. Members talk the sooner we can hear from the public, so I respectfully request that my colleagues hold their tongues, so we can get to hear what the public is saying because there's a public hearing. Thank you. Thank you. So we're going to allow the two new members to speak, which is Marielle and Danielle, and we're going to the public my hand is also raised. Thank you. I sell you on you check out. You thanks, catherine, so just wanted to first. Second, the what Steve mentioned earlier, the I believe it was under the expenses how three different committees had put Wi- fi and if there's a way that we can combine that, but I would something I would stress, is within combining it making it quite specific to state to include public schools, Nursing Homes public spaces, something to that effect and then my second point would be- and I think it'll you know be addressed in the section later when we open it up to members of the public is how just out of for my own knowledge and for everyone else on the line. How are we or how are committee chairs and committees in general scanning? What other funding is available? There was a comment in the Q&A where it says here some of the council members allocated all their capital funds to internet issues in public schools. I'm just interested in the process. You know have committee, you know in finding out, what's already being funded before putting things through this process, all right thanks all right, thank you and I can answer those some of those questions. Offline, Maria. Thank you all right, Danielle. Everybody so this is for I guess this is regarding the traffic and transportation items I mean I guess for Debbie. I did not see anything on there. The issue with safety, especially when there's low visibility at night and when there's inclement weather, it's very difficult to see, and I had proposed like installing reflectors or something that would make it easier to see where the lanes end also the question of lighting. So I'm just wondering if it's possible, I was looking at the items and it looks like maybe it's possible to expand the last one, the one that speaks to potholes and pedestrian crosswalks. Potentially, we can expand that to include funding for the highways specifically lighting and reflectors for safety. Thanks. Is that a yes daddy? I'm sorry, I can barely hear danielle, but if she was saying like why do not we wrap? In the issue of lighting, which I mean she highlighted one of the more severe instances but to her point it's also a broader issue. I think that's a great idea to wrap it into that last item and the expense as she outlined. Where we talk about potholes. We talk about proper crosswalks. I do not see. Is that okay? Can we do that because yeah we can do that. What would you like to add to it just add more lighting. I do not know if you heard the whole thing debbie, but it was not just about the lighting, but it was also about the reflectors or something that can make it easier to see, because at night it's really hard to see with the lights from the oncoming traffic. You can't really see straight very easily, and so I think, having reflectors in addition to an additional lighting. Well, maybe we could just say visibility. I do not need. I do not like getting too like overspecified. It was like whatever bucket, I think, we're saying like fund it. So maybe the word visibility, okay, yeah. So what I said is visibility and measures. I just added visibility measures, all right, good reflectors, etc. Yeah cool! Thank you thanks, Daniel great, so we're going to pause on board members like some new board members have raised their hand. Finally, my word so I know Maggie Clark initially said I'd like to have folks from the public. If you can just raise your hand, use the raised hand function at the bottom of the Snd list. Thank you, alexander. I'm sorry, I'm just the only other board member left. No there's four more! I got you though Aisha I got you. There was four more all right, so I'm going to have maggie send a lot of talk. Go ahead, Maggie! Yes, I'm unmuted! So I like the idea of Decibel meters and calibrators for every officer in the 34th and training to go with it. I've asked the 34th on a number of occasions whether they have these and they do not another point: park's capital, there's a west side greenway that is partially finished. I understand they have the rest of it on the the books. You know to go down to the little red lighthouse from where you know from Dyckman Street, and it would be nice to finish that because then there would be a water level route that would go all the way from the battery up to Dikeman Street. We need to go further north, but at least get that gap finished maggie. I just want. I just want to let you know that's what that project. That's called Lighthouse link, that's what that project is. So thank you for clarifying that for people yeah, I you know you rushed through because you did not have time so I did not see it. I've also mentioned there are a couple of other issues and apparently they're not for this evening, but there are other issues that the public has an interest in the ring garden got 50,000 grant from the borough president three years ago and OMB is preventing us from using it, and you know the community board could be helpful in helping to release these funds to the to the garden. In addition, participatory budgeting, three years ago, one of the items that won was street trees for Inwood, and there was supposed to be 75 and I think they planted five, and you know. I hope that sorry about that. I hope that this can be fixed Liz. Thank you maggie. What we'll do if you can drop your email if you're comfortable with that in the chat or just send it to us and have some folks follow up on those two other items? Thank you yeah. I just wanted to say it's a clarification on the ring garden that she mentioned the 50,000 that was actually awarded by the state senator at the time, so you actually have to go through the current state senator to access the money. It's not the royal president that was Senator Ali awarded that money and just make a quick announcement for the public members. You guys have two minutes to speak, but also within that two minutes. If you have a pointed question for one of the chairs and their items, please make it because the two minutes also covers their answer just to keep it moving. Thank you, okay! So Alex! Oh, I guess Alexander got his items spoken on, so we'll go to Cheryl, Miller Charles. You have to hi good evening. Everybody! Yes, I'm here! Can you hear me? Yes, okay, great okay, so you saw my question in the chat. I wanted to direct something to curtis. If he's on here still, I think when he was giving his presentation earlier, he said about the speed cameras like he's, taking down like certain areas that possibly need them, I'm right on West, 165 and Broadway, and everybody knows that Morgan Stanley children's hospital is right over here on the corner and the dirt bikes are just flying up and down broadway all night long. I'm hearing the cars drag racing and everything- and you know you- have people coming out of the hospital working in the hospital. You have a lot of pedestrians over here. This is a very high traffic area as everybody's familiar with, and I think that the speed cameras are very vital. The speed cameras and the speed humps in this particular spot over here I've been living here. 14 years they have been in the past a lot of accidents over here now, compounded with the dirt bikes and the drag racing cars. It's forget it, so I think it's very important to the speed cameras and the humps to be right here on West, 165 and Broadway. I do not know if there are already speed cameras over here, but if there are not, there definitely needs to be a speed. Camera. Okay, we'll make sure curtis gets that. No, thank you so much I got it noted. I did not see you there last but not least, is Alexander and then we'll go back to board members who've been waiting, hello! Everyone! Thank you. So much for letting me speak very quickly. I appreciate all of your commitment to upper Mahan and all the needs that we face as a community in from social to housing, to transport and everything. But I do want to point out that culture is very limited up, uptown and well not limited. Actually, it's quite rich, however, we're the small voice because we are not making daily changes to people lives, we're a long-, lasting change in people's lives and the hispanic society is the largest arts organization or cultural organization. Upper Manhattan and we've been we're in buildings that are over 100 years old and we are trying to make ourselves the hub of culture and got a good gathering place for the residents of Manhattan and the city keeps on changing the regulations. Of course, right now, with the tight budgets and restrictions going on, we were blocked out of getting any funding for capital improvements and we feel that we want to be the place to grandparents to bring their children to a place, to go good haven for them to go, bring their kids to their grandchildren too, and hang out and see experience something and it's ongoing challenge when culture is regulated to not to be crucially a social importance. And so I just want to speak out and say that you know we make a difference in people's lives on a daily basis as well- and I know it's not immediate transformation or immediate existence or you do not see it on a daily basis. But we are part of the fabric and culture needs to be supported equally as traffic lights and whatnot. You know this. The upper Manhattan culture arena does not get its fair share of the city funding because we are not on fifth avenue and we are not, and you know we have city council members who allocate their funds and, of course, property. They are likely funds this year to the schools to create infrastructure for internet, but without their support. We have a challenge in getting our fair share of the city, support to make a difference to our community, and that's all I have to say it's. You make a difference and remember culture. That's all! I have to say thank you Alex and for folks that need to know the hispanic society's line item is on parks and cultural Affairs, Capital, Catherine yeah, so we're going to head on back to Community Board members. I saw Eda put board members also two minutes, and if you have a question you want crosstalk all within the two minutes, but we'll have to keep this moving, so we actually yeah. We only actually only have three so we're going to do three and then we're going to move on. Oh. If we have three people, then we can do three minutes each one yeah, so aisha. Yes, my question is to debbie, with the traffic and traffic transportation request for funding to do a traffic study on 165Th to 170th. The reason why I am questioning this is first of all that exact area was an area that I advocated for a large swath of the community that took issue with the Haven Plaza being implemented because of the issues that were already existing, so to say that we now need a study, because it's being exacerbated, is due to negligence on the part of this board in doing that, and additionally, allowing the bikes to be added on 169th street, which we were promised would not happen. That parking would not be eliminated further. In the discussions about the Haven Plaza, it was stated that there would be continued oversight on that area, so that we would be able to determine whether the interim Plaza should be a continuing project or whether it needs to be removed due to impact to the community. So why would there need to be funding for more traffic studies when they're supposed to be studying it on an ongoing basis that funding could be going to something else for the community instead of for an issue which, by the way, the studies that were already existing were done by a private contractor for Columbia University, not by the D.O.T and the study was denied, the the community was denied the opportunity to review the study before the vote happened. So basically, the information in the study was not even paid any attention to so I need to know what is the justification for that line item so Debbie. You have 30 seconds to answer this or you can take it Offline and have a more in- depth conversation. No, I think we've done this movie enough times, so this actually does not relate to anything having to do with the pedestrian Plaza. This sort of, I think the committee, and probably those that have been on even longer than I have we just keep bumping into patient aging education. This won't count towards your time. Please go on mute, whoever that was all right debbie. So the this issue is really you know. The m4, for example, can get just entirely stuck in that 150, 165th 168th and just the way people are pulling into the driveways at at the hospital, and you know there's cars parked and deliveries and pedestrian, drop- offs and all the hospital stuff, and so it's mostly about that. There's some issues related to the armory and this one this one's complicated, because it does include you know again, it includes a hospital concludes the medical center. It includes the MTA. It includes, like it's cool. That was the idea about it to say that we've done this movie already is rude first of all, but to say that it's nice who's up next catherine who's up. Next, we have sally fisher. Three minutes, I'm going to hold my comments. Okay, all right! Thank you! Next up is Steve. Is that the last one see? That's it all right, so I'm going to call it a day. I did not Steve. Can you hear me? We can hear you now man, we got you. Okay, I'd like to appeal to faye that we eliminate the duplication between our two items about mental health needs, and, if you I would, I would not want to see the board members divide their votes between these two items, because I'm hoping that we'll be able to keep mental health at the top of our priority list once again. So if I think we can resolve this, I could easily just add to my item reference to families, youth and children, and so we can have one combined request for increased mental health services. I can do that for you right now, but just tell me this is expense right, yes, and what's the what's the actual line that it says, I'm looking at a lot of stuff, I'm sorry! What's the actual? What does it say? Well, it's why it has Fae agreed to this. No, she has not. No. I was trying to type that I'm about to exit. I think it's okay, but I'm wondering also that if it's some way we can show, because every year I'm losing most of everything that has to do with health, and you know I would like to show that we also are on that issue as well. You have to like, yes, I'm sorry you're what you're losing what on health, no, that in previous year, I noticed that I have to oh. I should not speak aside, but my committee have to give up other you know. Other item based on the same. You know thing that it has to do with health, and I would like to show that our committee also is advocating for those issues as well. If you do that well, I think we, I think we have to look at this on a broader risk from a broader perspective, in terms of the board as a whole, and let me interject, let me let me allow me to interject, because I know you and Wayne have already made your points. Faye, of course, is saying. I would also like to advocate so we're going to have to figure out a salomonic way that no opinion gets over superimposed over other people. Let me let me let me finish my point so something that can be resolved of line. I think that we've all known each other long enough. Let me just kind of like well, I think we're missing a point. It's not a matter of superimposing anything we're working on board rankings. So if the board feels that mental health is high priority, it should not be a pull between pay. We should be looking at what are the born priorities. I agree with you, I'm not disagreeing here. I understand, but if I, if I you know on behalf of my community, can't keep that item especially the way we phrase it. I would appreciate that if it's not, then you know what the majority said. I will go for it, but every year, when we go through this, I notice that when it comes to health idol, we have to give up- and you know that could be- that could be because it more appropriately belongs under the jurisdiction of the health committee, but also the Youth Committee is advocating for the youth as well. But how do I understand we're not going to repeat back and forth? We cut it off for other folks. So the item that you both have listed are broad and also does specified of families. We can look at it and they both also include affected by Covid-19. Yes, so we're comfortable with having it be won at the end of the day when we put it in the survey monkey, it does not come up if it was health and environment or if it was yes, it just comes up as a ranking internally. We know that what a committee proposed the language is inclusive of families and not necess. So I think it's the same item. I just need to know yes or no. The language is comfortable and we can do it offline via email. As well, yeah, okay, so Faye do you agree at keeping some language just a different community, all right, I'm going to we're good all right, so really quickly! Catherine. What would you like me to do on the survey monkey, because I was kind of lost in between that just keep going after the words after the word seniors insert families, youth and children- and this is on yours, steve of course, and remove from mine the two words and others. Okay and after seniors insert families, youth and children got it and then remove phase from it. Yes, we're done thanks all right. Folks, I want to say: wait. May I say something please well. I think that what's really important to consider here is that faye is a consistent and strong advocate for youth and schools and Steve is a consistent and strong advocate for health and mental health in the community and that, ultimately, we're ranking the board's priorities, and I think that this item continues to enjoy a very high ranking in part, because Steve consistently stresses how important it is and in part, because Fae consistently stresses how important it is. So I would like very much for us not to think of it as being phase item or Steve's item of it, but that it is the board's item and that it's a strong priority and the fact that it happens to come out of one committee or the other does not say anything about its importance and does not say anything about the respective advocacy I think having more right. I think we get it it's important, but it's coming out of Curtis's committee. That does not mean I do not think it's important, so there zero disrespect to you Faye or your committee. Your advocacy is part of what strengthens our work as a board, and I do not think that's awesome. Thank you so much I like you guys will nobles and catherine. We have two guests, nelson and dino. All right Natalie would like to say: if they're going to be able to say a few things and then just you guys, your wish, we can oh call them meeting for a journey okay before we get there elias just sure nobody knows what this is. Actually it might be either debbie or liz. Please take a look at the Q&A there's, an item that might be potentially new, so look at it and we can move to Nelson. I just nelson from the Manhattan ball president's office. I just want to clear clarify one: can you hear me? Yes, okay, so I just wanted to Clara. I just wanted to clarify in the beginning of for the minutes that the minimum movable property request is fifty thousand dollars, not thirty five thousand dollars just for it reflects your minutes or your record, and then on one or two occasions. A couple of comments were made about consummates budget, all going to schools with capital funding, and that is not true. It's the focus try to focus on school and technologies, as is the Borah president, but it's not. The entire amount has not gone to schools. Only just wanted to clarify that piece so and that's just for the record what we will like to know. They know they mentioned, but we're not trying to find another. How many kids out there? That's, not a set number and also not all the schools are completely wired, so those are sort of. But I just wanted to clarify those two points. That's it great. Thank you. Nelson Eliasa was there somebody else who said that no? That was just Nelson. I wanted you to because you get you guys did not know him prior. So I just wanted him to do his clarifications and now just get to the Qa, and then we can call them unified german. So it's 8:30. You know we did not want to kind of prolong this. Considering it's going to be a couple number of days there is. I want to just highlight again in the Q&A around visibility and on the bike paths by the henry Hudson parkway. I see. Barbara has a hand on right. Now we just kind of want to in summation discuss the changes that are going to happen on survey monkey and the time frames again so Barbara. Is it related to an item or process or not? I can answer any process, questions for sure and catherine. You had said something, and you said my name and the new item and I did not catch it. If you could just repeat what you said, the Q&A has a bypass item. That's that's within the parks, and I answered that part. The lighting item. That's a Dod thing, so I defer to debbie on that. Okay and then I think we dealt with that. Okay. Thank you. Sorry about that. Will the Excel spreadsheets be updated to reflect consolidations and re- circulated. That is an eliasa question, but I'm going to say it's a yes! Well, that's a process, question yeah that is okay, yes, yeah! So gathering nobles yeah. If look, I've been updating the survey monkey in real time. I have everyone's changes and I can go back through them if you'd like, but we can use that in lazar. You can update the Excel sheet or catherine update the Esl sheet. However, you need to yeah. We have an open dac that we can also make our own corrections so yeah, okay, all right nobles. Is it safe to say folks can vote tonight, or should we ask folks to hold off until tomorrow morning, I would probably say hold up till tomorrow morning, just in case there are offline conversations that happen or people sit on something tonight and then want to send a change or something tomorrow morning, but also folks like. If you want to take a look at the survey right now, you can still access the link, just do not vote and if you see something that needs adjustment, we're not adding new items. First of all we're just like adjusting and word smithing. If we need to like we can do that. Just email me, but you can look at it now, just to just a fact check just in case okay, so Katherine the link. Everyone has it like noble, said, make sure you please put your full name on it, do not want to repeat the school and then again you can rank them either drag and drop or put the numbers if you feel more comfortable, doing it via paper and emailing it that can be circulated tomorrow and you can just send it via email to Ebenezer. So we're having the office collect all the information and the survey monkey as well, and so, like I said at the beginning, it will be open for 48 hours we'll and now I also would just reach out again in what would be Thursday evening Friday morning in case you know kind of the response rate's a little bit lower, so the office is going to reach out. I do see Mary with a hand up. So what and the thing is yeah no one gets left behind we're all going to walk through this process. Let me we're going to all walk through this process together, that's one! So we're going to call this mini for a german. Can I get a motion? I did not see you. Mary Miri was recognized by catherine, but we can probably into my bad my bad. I just want to know if we're going to be, how will you know who needs to get the stuff printed out? I mean I can do the survey monkey, but not the way it exists, because it's like two pages of stuff, so I need to be able to improve my you might have to buy that paper and then put it on the survey monkey nobles sure like if they're not aware, if you wanted to print it out Mary. What I would say is that so you do not want to do it. Let's talk offline, I can help you out, Offline I'll, shoot you an email and then we'll connect. Is that correct? That is why I asked whether the Excel spreadsheets would be updated and recirculated, because people could use that as sort of a working document and when they mark it up, they can then go into survey marquee and do it right, yeah, and so that's right. So tomorrow, that pdf, that excel document can be recirculated so folks, who would rather do it on paper and then enter it manually in survey just will hold off until tomorrow, when you receive it cool on the word thing, just let you can email nobles and myself, and you know we'll keep track of that. Yep Catherine not only has a clarification point of clarification or some observations to make. Yes, just I won't take much of your time, although I'm very glad with the outcome here and thank you for your service, but in the discussion with regarding allocations to the ring garden, I just wanted to clarify that there is an allocation from the rural President's office to the green garden. That Maggie was referring to. That would be something totally separate of any allocations that may or may not have been given by previous or current state senators, so it was not an either or but since it was said here on the public record, I wanted to clarify it. Thank you great motion to return. I second it. Thank you. Second, all right thanks everyone. Thank you, eliezer, just real quickly. I'd like to speak could Steve Simon. Are you still on? Yes good? Could you please contact me about this ring guard money, so we start to get this straightened out. I've been trying to reach you and it's been difficult. You know it's just zoom or whatever it's been difficult. So can we talk on the phone tomorrow and try to straighten some of this out yeah? The issue is not with OMB. It did it's it's more difficult than well, it's a different issue. What can we talk tomorrow? Can I call you: where are you at the office or home? Where are you I'm in my yeah? You can reach me in my office tomorrow afternoon. Oh, you are at your office. Okay, great I'll, call you there and speak to you there and just see what the difficulties are. Okay, great thanks! A lot glad you do not call between one and three: oh you have a meeting. Okay, I'll call you, after.",
            "summary": "So we're going to switch it up a little by sort of like making it more informational towards the newer members and those of us, and I'm going to include myself, who do not necessarily comprehend the entirety of what the budget ranking process is, and it's important What that what the should be pointed priorities purpose of the process, we're also going to create an opportunity for the committee chairs to educate the public on the items, including ranked, and we're also going to explain our fellow board members and how to submit those rankings, especially in this now technology world of ours, the zoom world, how we're going to do the voting, the electronically and so forth.\nWe are planning for fiscal year 22, and this process has started in June this year by having the local budget consultation, where the community board can have a consultation with the city agencies asking what they need et cetera, et cetera.\nWhat should be number one number two number three among all the capital recommendation that we have from the ten committees and also you're going to rank what is most important for you from the expenses that have been listed by the committees, then we're going to do a tally, we're going to do a survey and we're going to do a process where we're going to sub every voting.\nWho has the majority vote at a particular time of the items, and also I need to bring to your attention that for the last five years, this process has been unified in one process under the city planning, agency.\nWe need what are the most important items for the Community Board, and it has a process that we have been working: Eliza, And I.\nSo they are really for the first time that I've been involved, trying to make an effort to get not just the staff and the chair and the executive people are just committed chairs, but do not want every single board member to understand the process and the follow- up is also critical.\nI do not know if ebenezer can testify to that, but this is the first time that I'm sort of like more involved, but I see a difference in as to how the city is more involved in making sure that we all get are part of the process and the follow- up, which is just as important as the process itself just to follow up on Sally's point.\nI do not know what happens on other committees, but on our committee we have a representative from the Parks Department and presumably we would have representatives from the other agencies that are relevant to other committees, saying these are what our priorities are and explaining why they think one particular project or program is more important or less important than other projects or programs.\nIt's easier to just track and follow, but it's not a particularly meaningful number other than indicating that OMB is aware that we have added it as a priority and carrying a descriptor of what fiscal year it's in, and whether it's a capital project or an expense.\nYou can always ask me how much more time you have, but please respect the five minute limit, because we're trying to be fair to all chairs- He just needs to kind of like let the process fall through a little all right.\nA number of your items relate to sort of public safety enforcement in parks or their parks issues, but to really public safety, which is why they're, not in my committee, there and Your committee, have the opportunity to talk at all about cameras in parks which needs to be through the public safety and through the pd, because it requires the NYPD to install the equipment and to monitor it, because that's not something parts has the capacity to do.\nSo, the the land, Use Committee had only one expense and one capital item for last year's budget, and we were pleased that the board as a whole ranked each of those items in the top five and feel they are still relevant and made slight tweaks and resubmitted them for the upcoming fiscal year.\nIt calls for the allocation of capital funds to support a development initiative in Washington, Heights and Inwood, whereby vacant city owned lots and buildings are packaged in one or more rfps dedicated to scattered, site, infill, affordable and the word affordable was added this time before it simply referred to infill residential projects, for which affordability is defined by the area.\nWe can begin to address the dire need for affordable housing in the community, and those are the two land use items you have about a minute and a half for questions.\n12 is parkland, so if you think of it from that perspective, it's actually appropriate for the majority of our projects to come from this committee and for this board to rank to highly rank many parks projects, because this is the only way that parks sort of gets its funding.\nFirst, all right, starting your time, steve, all right, so the health and Environment Committee has the 11 expense items number one which has been our number one priority for the I think, the last six years and during that period has been the board's number one priority several times is to expand mental health services in the community.\nThis year, we're at the urging of the committee on the aging We're, emphasizing the fact that these services are needed, especially for seniors and others, whose mental health and Social engagement have been adversely impact by the Covid-19 crisis.\nNext one is a repeat from last year: increased funding for education and outreach on recycling, reuse and composting, as well as the proper disposal of household garbage in our community, which which, if, if done effectively, would help reduce some of our problems with overflowing trash baskets on especially on commercial streets and the last one is to create an educational campaign about the federal public charge rule to inform immigrants of their rights to obtain health services and other benefits this rule has been.\nA lot of work has been done on this issue in the last two years, but we still have in several areas some old water mains and sewer lines that do need to be replaced and our other two items are to provide additional garbage, collection, trucks and street sweepers with snow plows and to install green infrastructure such as bioswales to divert storm water from the sewer system And, and then we have one, which is an old item which you do not have to rank, which is because it is funded in the city budget.\nYeah see the second and third one same thing so on the Excel sheet, it's duplicated, but on the survey monkey, it's not so it's fixed where people need to vote, except that there is a third item that you know is not there and that's the one I was asking for.\nOkay, increase funding to expand services at senior centers in Cb12 M to include hiring additional social workers and program coordinators, adding meals, extending hours, increasing per meal reimbursement rates.\nJust, actually here number two item ranking item in last year's expense, budget.\nSo, the first item increase access and outreach to healthy cultural, appropriate food for seniors with medical needs; That's a revision from last year, because we wanted to include culturally appropriate food number two increase: the expansion in the program, expanded in- home services for elderly persons, funding to provide affordable home care, including sliding scale reimbursement.\nSome of the agencies are outrageously expensive in terms of getting home care, especially for for those that happen to have a bit of money and have to self- Pay number three: increase funding to expand services at senior centers in Cb21 to include hiring additional social workers and program coordinators, adding meals, extending hours, increasing per meal reimbursement, rates.\nIncreased funding for naturally occurring retirement communities to support, currently unfunded mandate for nursing, hours, we'd like to see these norths as they're known as continue, because they provide some greatly needed services and areas to allow seniors to age in place and number six other than personal services.\nBut you know the Can in terms of how many hours that they can fund a nurse to be available, Can I, just say one quick thing sure shout out to Steve for including the seniors and the mental health services.\nYou're, next, just really quickly for members of the public, feel free to use the Q&A as each chair presents and after we go through each committee, chair, we're going to open it up for new items because, as you're noticing.\nWe've provided increased funding for aep and ppp programs for the preservation and rehabilitation of distressed buildings in Cd12 M, and also added an additional item of providing internet access and publicly available spaces, including hra service, centers.\nWe have seen both the limitations as well, not to mention the greater need for this very service, and so we want to make sure that was the top we've asked for providing funding for the home based program in Cd12 M, providing more funding for food pantries, which was brought forward to us by our health and Environment Committee Chair Steve, Simon.\nYou and we've also included some items in relation to supportive housing for Lgbtq youth, increasing the funding for more HPD housing code and DOB building code inspectors increasing really what is Educational, resources, letting tenants know about what their rights are and also providing for.\nWith that, I'd like to pass along my time to Martin Collins, who was asked to speak a little bit more to his concerns on the issues before we go quick question, a quick observation, capital budget item three in aging and capital budget item 11 in housing and human services is the same, and I would recommend that they be combined to one of the other, which means the board gets another item to vote on, as opposed to splitting votes between tasks that are the same.\nHe Ariel did pass it towards one minute and thirty seconds and there's more cool Martin, okay, on the capital budget, providing funding for the construction of 100 permanent, affordable housing based on community district 12's average median income to not, for, profit organizations and community land trust that are partnered with not- for- profit developers is essential.\nIt was an observation that we have a duplication between the aging committee and housing and human services, the same, and so we know that technically there is a cut off on how many expense items we get and how many capital items we get, If, there's a preference in terms of if it's listed under aging or listed on their house, we can just remove we'll, remove it from the survey monkey and from the one which one do you want me to talk, about.\nIs there anything included, and I apologize, because I can't see the expense list right, now, but directly addressing homelessness serving the homeless population, given that we do not have housing for them or given that needs might come up like portable showers, portable toilets, that kind of stuff the home base is specific homeless people without homes, Home bases is specifically one of the areas in which we've, at least in my time, serving in city, government.\nLet's start with the expensive item number one priority for our committee is provide funding for to improve the connectivity option of internet oops.\nFormer priority is the needs for Esl and ell programs in our district, meaning provided funding for second language speakers, learners and also for people with other languages as well.\nI think this is something that is very important: Providing funding to increase child care in this 312 to help children develop essential skills like, for example, social and emotional communication, skill, which is so much needed in this time that we are you know facing with this pandemic, so they also will need the they need to succeed in school and live as well.\nIt's such a such a paramount issue for everyone who uses New York, City Transit, but certainly in our district- We talked about even making this our only capital priority, but we just decided to rank it one and keep some of our other things and which were rehab on the a train stations at 181 and 168, and the one train at 207Th Street.\nYou, know what we hear from the committee and from the community and what we're sort of responding to throughout the year and align that with these expensive items.\nThe second point, I wanted to just wonder how we are getting these budget things to the public, so they can see, because I think it would be very hard for people to see this like first in the meeting or something and then try to make sense of it to even ask a question or even know how to ask a question or even understand what any of this is, because even some of us are on the board and we've seen it.\nWhat has been brought up all year right into the budget, ranking and priorities, and I think we can So just and just briefly, I do understand the issue and the complexity with the federal.\nIf there's a way that we can combine that, but I would something I would stress, is within combining it, making it quite specific to state to include public schools, Nursing Homes public spaces, something to that effect My second point would be- You know be addressed in the section later when we open it up to members of the public Are we or how are committee chairs and committees in general, scanning?\nThere was a comment in the Q&A where it says here some of the council members allocated all their capital funds to internet issues in public schools.\nThank you for clarifying that for people I've also mentioned there are a couple of other issues and apparently they're not for this evening, but there are other issues that the public has an interest in the ring garden Got 50,000 grant from the borough president three years ago and OMB is preventing us from using it, and you know the community board could be helpful in helping to release these funds to the to the garden.\nSo I just want to speak out and say that you know we make a difference in people's lives on a daily basis as well- We are part of the fabric, and culture needs to be supported equally as traffic lights and whatnot.\nI have to say thank you Alex and for folks that need to know the hispanic society's line item is on parks and cultural Affairs, Capital, Catherine We have three people, then we can do three minutes each one My question is to debbie, with the traffic and traffic transportation request for funding to do a traffic study on 165Th to 170th.\nNeeds, and, if you I would, I, would not want to see the board members divide their votes between these two items, because I'm hoping that we'll be able to keep mental health at the top of our priority list once again.\nRight, yes, I think it's okay, but I'm wondering also that if it's some way we can show, because every year, I'm losing most of everything that has to do with health, and you know, I would like to show that we also are on that issue as well.\nYou know thing that it has to do with health, and I would like to show that our committee also is advocating for those issues as well."
        }
    }
}