{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCB4 - Business License \\u0026 Permits Committee",
            "publishDate": "2020-11-11",
            "shortDescription": "",
            "lengthSeconds": "2:39:35"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "O6AxjiozTF0",
            "fillerWordCount": {
                "uh": 467,
                "um": 359
            },
            "readTimeFullTranscript": "89 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "space": 82,
                "music": 65,
                "floor": 51,
                "hours": 49,
                "license": 45,
                "liquor": 44,
                "cover": 42,
                "street": 39,
                "roller": 37,
                "building": 33
            },
            "wordCountSummary": {
                "music": 27,
                "space": 25,
                "liquor": 13,
                "license": 13,
                "floor": 11,
                "cover": 10,
                "doors": 9,
                "roller": 8,
                "premise": 6,
                "bar": 6
            },
            "fullTranscript": "The other coach here, Bert Lazarin, is having problems joining the meeting, but hopefully we'll be able to join soon. I want to remind everyone that, pursuant to the city, regulations that allow us to meet on zoom, this meeting's being recorded, it's also being streamed, live on YouTube and a recording of it will be posted on YouTube on the community board 4 website, as I think you all know, this committee hears applications for liquor licenses and sidewalk cafes. We we will go through the agenda as listed I want to alert everyone that agenda item 8,745 9th avenue has postponed. They will not be heard tonight. So, if anyone is on here for just that item, we will not have any discussion of it tonight. The way we proceed, we call each agenda item. We ask the applicant to make a short presentation. We have some committee discussion and then we open the meeting up to any comments from the community in the public. The way that'll work when an agenda item comes up that you're interested in. If you are only in the meeting, is an attendee. Please raise your hand or text Nelligan's, art or in the chat indicate you'd like to speak. You will then be moved into the meeting as a as a panelist, so we can see and hear you just a couple other things. This committee will make a recommendation to the full board which meets on December 2 and at that meeting the full board will also vote on all of these items. The full board then makes a recommendation to the state liquor authority. We have no power to grant or deny liquor licenses. All we can do is make recommendations one way or the other. Now, with that I think we can get started, we'll start with agenda item, one which is an alteration application for 164. Ninth avenue now is the applicant here. Yes, the applicant for 164, ninth avenue, milk and hops, or here Brian Frederick, says Attorney, okay and Mr winter as general manager, I apologize, I seen that very poor connection to the extent you are unable to hear me so far, we can hear you fine, okay, very good. Do one of you want to tell us what you're seeking here right? So it's just a it's a very straightforward it it's a very straightforward modification of the license. Current currently there's a beer license in place. The establishment essentially serves as a offering craft beers. The establishment would like to expand its offerings to wine and certain spirits, whether it's cocktails or otherwise, it's sort of been. We lost him, yeah, I guess I can take over sure, so yeah in part, we do craft beer and cider as a tavern, slash grocer, and we would like to include a small menu of spirits, like you said, as well as wine for customers to further allow more customers to enjoy the experience when they're here that either have any particular allergies to beer or just do not drink beer right and I'm sorry, I lost my connection, my apologies, I'm having trouble connecting like I said, but essentially there's the main points. There are no changes to the hours of operation. The establishment does not plan on changing the hour, the hours of operations or essentially the the theme which is sort of a relaxed, neighborhood establishment, as opposed to more of a traditional nightlife sort of bar okay. Before we get to the committee, I just want to clarify some things about your the stipulation form on the first page, you said, you're not making any operational changes, but I think to be clear. We should say you are and that you are moving from a beer and wine license to to a full on-premise license: okay, otherwise, the form sort of unclear as to what you're, seeking to do right. My apologies I understood operational morph to yeah. No, it's a little ambiguous. It's the first time, I stumbled on that too. I looked at your prior form and the occupancy numbers on page two were very different on the the original application. For example, you had the cfo as at 17, and now you have it at 16. 16 seems really low, but and then you know you had originally, you had five tables with 25 seats. Now you have six with 16. I. Do not know if these were changes. You intended to make looks like we lost your lawyer again, I realize it's a technical question. Do you did you? Do you know anything about the capacity numbers on the form? So the capacity numbers for the first part I think we're before both of us had started working for milk and hops. This is based on the original department of buildings number of 16, which can be found through the website. As of 1928. There are since then I do not know what the original seating chart was, but, based on what you said, we have originally indoors before Covid-19, where seven low tables and three high top tables, which can see different groups of those different sizes that relate to our occupancy. Okay. Well, so that's what confuses me about the numbers on the current form. You have your cvo at 16. I, do not see how you could have had that many tables. If that's really your capacity and the certificate of occupancy right and I apologize, I lost connection again there was. There was some confusion about the level of occupancy and I did not have sufficient time to research. The issue, okay, I, to the extent we're able to request additional time to amend it to reflect the correct certificate of occupancy, which you know we believe, is far greater than 60 yeah sure. As long as you can get it to us in advance with full board nelly, what's what's what date should we give them for getting us? The corrected numbers hold on one second, I will need it by November 23rd. Okay, can you can you do that? You lost him again? Okay, I'm very sorry. I think I should dial in at this point, I'm just I was just looking for the dialing information, I'm very sorry, I having a computer problem. Sure so I we're suggesting getting you getting us the corrected occupancy numbers by November, 23rd, November, 23rd, okay, I will thank you. Okay, you want to continue, or should we wait for you to call in I'm just trying to look it and look for the calling number? Usually this computer is pretty stable. I do not understand. Let me ask you another couple things yeah. On page four of the stip form, you said no to the question about whether you'd close doors and windows when there's music inside right. Obviously you know given the question. We prefer that, because we did, you agree to it last time. Do you remember that I do not recall, and the issue is that I was not. The I was not assisting in preparing the original application to the extent to the extent there were existing agreements in place that were inconsistent with this currently prepared application. We have no objections to reverting back to what was originally included in the in the original application. There are no objections there. Typically Mr winter can explain in more detail. It's it's generally just bad yeah. So the reason that we have windows and doors open is to comply with covered regulations, allowing all that airflow, the doors that we do have are I guess accordion style, those both slide out. So it fits up the entire wall, which I believe is 15 feet or so, and the amount of speakers that we have is for. We do have a sound system. We do play music at a level that is only really heard indoors and not outdoors the only way to do an outdoor and hear it would be in. We would not want that because of the people that live above this building, so we comply with sound and any calls or anything related to that have not happened because we keep it within the indoor space. Okay. Well, we can see. You know how the how the committee feels about that when we, when we discuss it and then the last thing which I think is also just a wording thing, there's a question about whether you're going to have a canopy- and you said yes by canopy, we mean those things that have holes on the sidewalk. The things that a lot of apartment, build houses have I assume you do not have one of those right. You just have. No. We have an awning attached to the building. That only goes out about five feet at its max and can angle up and down no legs all right moved. We do have a full-size tent, okay, but yeah, but again this is talking about instead of the canopy and the sidewalk. So you do not. You do not have one of those. No, then yeah. Okay. So I'm going to change that answer on your form to no okay Bert, you Wanna take over right. Guess we can't. We can't hear you for some reason: okay, my apologies. I'm trying to call it again yeah! You can hear me now. I'm I do not know. I'm talking about I was talking about Burt co-chair who's. We have on the screen, but we can't hear all right Nellie's before I get to the committee. Is there anyone from public want to speak about this I? Do not have any hands raised, okay, anyone, anyone who's watching who wants to speak? Please raise your hand electronically or put something in the chat. Inga did you have your hand up? I did I did I I'm trying to find out, because this did not look like a change that it is and one of the things I was going to say. Is they have way more than 16 or 17 people in there it does occasionally get a little noisy and they already have a wine and beer license. So they're looking for hard liquor, correct yeah did they did not do any real outreach to the community because I did not get anything. I'm one of your neighbors. Sorry, our license is just beer and cider. There is no wine allowed Frank. Can you confirm that me the current one yeah? Ah, because is not it typically wine and beer and ciders included? Now it looks like what they applied for well. Nellie might be able to help, but there's a thing on our forum that says type of alcohol beer and what they called it was eating place. Beer Ellie. Are there just beer licenses? Do you know? Yes, there are okay, so they have a beer license and they're looking to add wine and hard liquor. Is that correct? Okay, I think you know I mean honestly, let's just make sure we're on the same page, you're looking for a full on-premise license right. Yes, we're looking for a full on-premise license, but not to the extent of a bar with multi-level top shelf, a few bottles of wine for any person that wants to have a glass plus a few to sell and a small cocktail menu I.E that mixed drinks that we already set plus. If somebody wanted any particular alcohol with the soda, we can still accommodate that, but we're not trying to become a nightclub bar all right. Sorry, right, yeah, no I, just I think that the community does not know this based on the application and, yes, they do have their doors open. And, yes, it has been noisy at times and I. Do not I do not know that they did a lot of outreach. I do not I do not I did not get anything. I would have. I would have a problem with a full liquor license a wine and beer I would be fine, but full liquor. I would have a I. Have a problem. I think they should not go to a full liquor. Is that because is that? Because I've noticed hey guys, I do not think they reached out to anyone and the application says that it's a much smaller place and obviously if their certificate of occupancy was what it should be. I was going to bring up that they are way over their certificate of occupancy. Pre-Covid and I do not pay as much attention now during Covid-19, but because of the tents everywhere, but I. I'm sorry, I, wonder if people think it's a smaller place and just like to see so sorry this is this. Is this is Brian Frederick's? Can everyone hear me? Yes, okay, my apologies to the extent anyone did not receive outreach. I apologize, I believe that I sent an email to everyone that was included on the list to reach out to to the extent additional outreach is necessary and to learn more about the plans. We're happy to provide that and you know to to extend the time for another meeting. That's perfectly fine. We're happy to spend as much time as needed for any outreach. Okay, so and I apologize if it was not received, but I believe I attempted to send an email to everyone on that was on the existing. That was on the existing list that was provided to us hey. This is Rob, can I jump in for a moment. Sorry I had my thank you my hand up forever. No I I've been panned for a while too go ahead. No I know tough to do this all as one person so I have some factual things to check. So you indicated that the occupancy is not what it is, and that's fine I understand that. But then you, you indicated that you currently have seven low table and three top table right. Is that what you said? Yes, okay, so the number of tables on the application is wrong as well. It says six, but it's going to be seven and three: it's going to be ten right, yes and therefore the number of seats is probably wrong as well, but I do not know. Overall, it's just based on it's. A lot of I came into this kind of at Covid-19. So a lot of the information and everything from prior applications are new to me, so everything that we have now is Covid-19 related yeah. But no that's exactly my point. When you do an application, it's not about Covid-19. It's about the way you normally or operate and then you have the Covid-19 is a separate issue. So what we need here is all the real numbers and not covered numbers. Absolutely that's the number of chairs and tables that I can right so they're right, so the tables were indicated as six and 16 seats and that was per the diagram that was provided. The applicant just told us that the number of tables was 10. so I, I'm now questioning all the numbers I'm lost, and what about the bar hold on hold on inger? So you know I'm just questioning all the bars you have a bar, but then it's a service bar. Do you have a real bar right? No, I'm I'll defer to Mr Winter, but my understanding and in my visits there it's not a traditional bar, it's more of a sort of a service area, type of bar, not a standard type of bar at a minimum. You need to redo all your numbers. You know what is inside okay, what other tables? What are the sheets and it can not be covered related. You know you do not get a license based on Covid-19 number. That's not the way it works. Right, I understand. Did I, hear you right that you were willing to sort of postpone and you know get the numbers right. That's yes! That's it! That's what it sounds like, so it and I'm sorry, I cut out so many times really I apologize. So so we need the updated co. We need updated numbers to to to reflect the seats and tables and then also and also additional community outreach correct. Those are the three sort of not I'm not finished, so you may need more yeah Brian, let's wait! Okay, so let's listen right! I just wanted to summarize what I missed so far, okay right! Okay! So now you mentioned that you want to sell some alcohol, so what you're going to have a takeout window or people can come and buy the setup right now is a we have our 25% capacity, which would be four people which we have not really been doing. Indoor dining because of that number, which we will figure out. What our actual occupancy is like stated before, but with outdoor dining people can come, walk up to the bar and purchase a drink from the bartender and then walk back out to their seats, and so with the to go aspect, we have fridges with beer cans as well. No I'm not asking all this question. I was asking yes or no do you have a to go operation and it seems that you're saying yes, okay and then you are saying that operation is inside people go inside to the or they stay outside in the orders through the window they no everything is walk in. So it is all indoors, okay, all right. So that was a good question now. The last question is you mentioned your garage door essentially, and you know Ingo is saying this is people can hear you, and so you know the reality is that the law says you can not have amplified music if you have windows and doors open. So that's the law, so you need to find a way that nobody can hear anything and if you sell more hard liquor, it's going to be louder. So you need to convince us when you come back, that the setup is going to be quieter than it is today and that you are really going to close those that door. Okay, understood so and going back to a point that I, missed and I do not mean to hold everyone up here, but is it the suggestion of the community board that a beer and wine license would be more agreeable as opposed to a license, a full of full license with spirits as well? I think they're always more agreeable because, as christine said, you know, we found that the noise level and you know tends to go up with the with full liquor if you're postponing a month. Maybe the thing to do is to get a sense of the community. You know like I could not tell if Inga, who was a committee member who lives who lives, hey, bro can I say something yeah, no rob we'll get just. Let me just answer that and I'll get back to you. I have not forgotten I do not know if Inga is sort of opposed to a full liquor in any circumstance. Or would you help it to talking about it? But let's, let's hear from roblox and then you can think about that Rob go ahead. I just wanted to echo what christine already said about the numbers, Covid-19 and non-covet, but that was said: I am a neighbor I go past milk and hops several times a week, I every time I pass by during the summertime when they've had their like doors, open I've never heard any music leading out and I go by there. All the time. I really think that they're great neighbors I think they're very sensitive to any bleeding out. As I said, I I've been passed there a ton of times and I've never heard any bleed out. If there was anything at the bar, it did not come out onto the street I think they do a great job and you know minus the whole number situation. You know I really feel as if you know everyone has their own boat, but we should pass them given a full liquor's license. It's not like this is going to be a bar or club they're, just trying to create additional revenue anyway. That's my piece! Thank you. Thanks and I apologize for not seeing your hand up and I also will point out that Rob's one of our bigger enforcers of doors and windows being opened with music flaring out. So it was interesting to hear that from him like Brian as his hand, yeah I just wanted to echo what what Rob said. I think the hours are extremely reasonable and I would be in support as long as they clean up their application a little bit and come back next month in full support. Okay, Brian, are you saying you want to vote on it this month or have them come back? I'm okay with I'm okay with voting this month, but if some applicants want to do some want some more community outreach and the apple applicants. Okay with it, then I'm okay with also waiting but I could go. I, guess I, guess the reason I'm sort of on the fence if the numbers were clearer, I think I'd be okay. Voting on it, but I think I agree with Inga that, with these numbers out there it's sort of hard for the community to know you know what what's what size and operation it really is because I expect the numbers are closer to 50 or 60 than 16. Anyone on the committee have thoughts. Should we should we have them come back or christine dinga well, I! Think I'm deferring to the community who lives around. You know that establishment if they feel strongly one way or another I, I'm not living strongly. I'd love to know the numbers, but my guess is that it's going to be the same numbers that they were before right. I, do not think they are increasing the attendance, so you know: can they do community outreach from here to the full board meeting that sounds good yeah, yes, yeah I would be agreeable to that. You know this that we need this city. We need the occupancy and they just need to know that the doors have to be closed when there's music on, because when you add hard liquor, it's going to get louder yeah, I'm all for that as well. So hi this is Carrie. My hand's been raised too. I also live in the neighborhood. If you can hear me and yeah I want to say that I feel like there's, been a really big difference on that block between Covid-19 and pre Covid-19, and I've had no issues with these neighbors for as long as they've been here and now it's just very crowded. So it could be that there's some confusion, I think around. You know the amount of people who are out on the sidewalk, etc now versus them, so I would hate to turn them down. For you know what might be just sort of an extra amassing of people around the tented areas up and down, you know: Ninth Avenue right there thanks well said I apologize. If people could just speak up when they want to speak if I, because I can't sort of monitor all this at one time, so please feel free to just to speak up so Rob I mean, were you suggesting we? Let them keep the windows open with music, or should we go? Do you want our usual step to be the usual I would default to the usual, but personally, I've never heard any music larry coming out of them at all, and they said it was on when the doors open, which is really unusual, and I'm the first pitfall to complain about this and I- do not see an issue, but it default on everyone else. If you know they have music going on in the bar. Yes by all means it should be shut. You know, but if I can't hear it, you know it is, but yeah I think we should move along with this and in the meantime, have them do outreach, okay, Brian and are you? Are you, okay, with that agreeing to the changing your answer to the stip, about keeping the doors and windows closed when his music and then and sorry? That's me, Brian fredricks I! Just I'm sorry, oh yeah, right, yeah, I apologize, yeah, that's fine! Those are the usual stipulations now just to be clear on one point: we're happy to do additional community outreach. Clearly we need to provide some additional information, but I only have mainly emails that I originally sent so just resend some of the same emails there's something else that I can do. That would be more. You know targeted to reach the right people here, London Terrorist Association, but there are very few associations. London terrorists may be one of the few in lower Chelsea. Oh okay, I see that London terrorist tenants, Association yeah, there's the Chelsea block association. Yeah I would do this right. I see that too okay yeah I'll try to I'll try to find some phone numbers too, because I have Miss Gonzalez I copied her on all the emails that that I did send emails and he could have went to spam or something or you know not. Everyone looks at all their emails, so I apologize I will continue on with the outreach, provide the updated information and then we'll consider you know the whether it's just wine or beer or full spirits included and again, you know none of the hours are going to change here. The we do not expect any significant change to the environment, but we definitely understand the concern here about the potential for increased noise as a result of hard liquor. Okay, so let me summarize and Brian Frederick's. You obviously should wait until you have the right capacity numbers before you. Do the additional community outreach? Yes, sir? Yes Sir! Yes, all right! So this is these. Are the changes I've made to the form we made clear on page one that they're seeking a full on-premise license. We've changed the answers to keeping the doors and windows lap can close. All those and windows when music is played inside they're, saying yes to that, both on the building design and the outdoor items page. And then we have two additional steps: they'll submit corrected, occupancy numbers to the CB4 office by November, 23rd and we'll do additional community outreach with the updated numbers before the full board meeting, which is on December, 2. okay and just to be clear. Regarding one point: to the extent a decision is made to perhaps just go to beer and wine only and in light of the other testimony regarding you know, milk and hops acceptable noise levels. Would this stipulation still be in place where we'd have to close the doors when music is played? Or would we have some leeway in that regard? No, the stipulation is the stipulation is in place and if and that's the rule and if no one complains it's probably because you are doing good per the rule and if nowhere hears it's fine, okay, yeah. So the reality is you're not supposed to hear any music on the sidewalk. That's the goal, and if you do not, if no one hears music on the sidewalk or across the street, people are not going to complain about it. So you we like to have this rule that you just keep the doors and windows closed, but you know right: you can manage it to keep the music off the sidewalk that that's the goal. Okay, so also right, okay, I think we're going to have a motion for the full liquor. You can obviously pull it back. You know you can just let us know, but do we have a motion for a full upgrade to full on premise with the other modifications I mentioned, I would like to make a motion. I will second, okay, all in favor hi hey closed any present, not eligible all right, so this committee's recommendation is for a full on-premise license. If you want something less than that, if you could, let us know also by the November 23rd. That would be great okay. Thank you very much and my apologies again. Thank you all right Bart. Can we hear you yet I do not know. Can you hear me yeah I can't yeah all right, I apologize, it was just I had to go to I. Do not know it does not matter. Okay, hello, everybody! You want to go back to calling the agenda yeah we're on section two. Now new liquor wine, beer insider licenses we're up to number two 338 west 39th street. Do we have the applicant here? Yes, I'm here, I'm also on with with our attorney Frank Paulillo hi, everybody hi Frank, how you doing guys? Okay, do the presentation sure so my name is Hila. Kehati I've been a food beverage restaurant operator for just about 11 years now, with five establishments all Manhattan based. We are applying for a wine beer and liquor license for a new hotel called Pistana Cr7 located on 39th between 8th and 9th avenue. We are offering a full restaurant breakfast lunch and dinner, very small bar, which is also part of theme lobby space occupying the hotel and yeah we're hoping to apply for beer. Wine and liquor license a few questions for either you or Frank I, see that your form says no outdoor space, but I see on the floor plan that there's a something called outdoor patio I. Think so, yes, that that's that's actually not a space that is permissible for guests to use according to their current. You know the current department of buildings, so if and when that space ever was open to use by hotel guests or our customers, we would of course go through. You know, frank and the proper channels to make sure we updated the application, but as of now, guests are not even permitted on that outdoor space, let alone to eat or drink. Okay. So there's no outdoor, frank, okay, so, but just to be clear, so we can put on the stip form. There'll be no use of the outdoor patio by members by members of the public, and if we change our minds, we'll come back and yeah and kind of question you changing your mind. It's the buildings department, so continuing the theme about confusing capacity numbers page two of your forum. You had 14 tables and 39 seats, but when I look at the floor plan, at least in the breakfast area, you have 12 tables or 11 tables and 24 seats. So are there more tables somewhere else? I could not see them on the floor plan. Let me pull it up, so I'm looking at the same document one moment yeah. Also, let's see here- oh I, see okay, so the floor plan you're looking at too the space is still under construction. Frank, please feel free to chime in, but the space is still actually being built, so the floor plan as in the positioning and the number of seats at these small tables might have to change ever so slightly the floor plan that we have that you're looking at I'm not sure how that's dated yeah, frank, you're, right, there's 11 tables in the breakfast area, but then there's three small tables with like club chairs next to them. Where are they on the opposite side of the breakfast area, where it says lobby and lounge area? Oh okay, so those are those clears. Those chairs have tables we'll have tables in front of them. Those gray round things are tables. Oh those, okay, I was looking at the top of the floor plan. Okay, so your numbers are right and is this? Is the alcohol service only on the first floor or is there room? Is there room service or mini bars or is room service? Healer? No mini bars? Well, yes, I do not know, no, not we're not planning on it. Yeah. Okay, it's a hotel liquor license Frank, so obviously the guests can bring their drinks throughout the hotel. Yeah no I was just asking what your plans were operationally. I assume. That's why it's at 6:30 in the morning? Yes, okay, that's all I have birds, okay, I just want to say: I do not have a split screen, so committee people, you're going to have to be very and I looked in the chat. I do not see anybody in the chat. So if you want to speak, I can't see if you have a raised hand either neither visually nor in the chat, so you're going to have to be very gracious with each other. Okay go ahead. Christine jump in I have two questions. One is about the hours your kitchen is going to close at 11 pm, even though you are doing room service, I would have expected that it would last much more and then the operation and the music continues until 2 A.M. So well. The confusion comes from the fact that it's not going to be a full kitchen. After a certain point, we'll have food available during all hours of operation, including room service food, but because we're just opening and we're hoping that Covid-19 is behind us, we're starting slowly with the menu. So the late night menu was started, I think it was 11, regular yeah, so we have what we call late night limited menu that starts at 11. We're actually doing that menu, not just until 2 A.M we're actually going to be serving 24 hours. Food service. At the hotel available for guests packaged salads, sandwiches, Sushi, all kinds of takeaway items. We have a few different menu buckets, one of them is the main menu. Then we have what we call the bar appetizer menu that will be served until 2 A.M, and then we also have an all-day menu which will be basically layered on top of that all right and what was the retail use there? You said there was a retail use in that little community, it's new construction and it's been under construction for almost two and a half years as far as I just got involved about a year ago, so two and two to two and a half years under construction, I'm not sure what was there prior it was explore. Manufacturing yeah forget about it, yeah building that was demolished yeah. It was completely ground up. No frank I think it would be helpful to put in the steps somewhere that there will be food served. You know 24 hours a day. You know hila I do not even think it's a big deal to amen, I think that we're not being disingenuous. We amend the application right now and leave it open too all right. Whatever you want, I'm just you know we. That would be the better way to do it. I think. Just let's do that, because I do not want to I, do not want to hold them to being serving food 24 hours a day. You know that was not our intent to confuse. We thought we were doing the right thing, but yeah all right, so we're going to change the kitchen hours to 2 A.M across the road and then that's fine anything else christine. No anybody else on the committee have a comment. Question yeah, I, give rich Rob here, I noticed on the plans that you've got a meeting space event space you're not going to have any promoters come in or do any special events that might be like dj or lounge, music or any impersonators, or anything like that right. No, that's a great question, I'm sorry but frank just to chime in here the meeting space is not an event space. It's just a meeting space, the interior diagram I, just you know, I, it's a beauty room and it's not even space. So that answers my question so yeah it does not look like you're going to be bringing promoters, that's all exactly and it's seller level as well. So it's a seller level, space and I think we're only planning on a dozen or less folks who will be able to be able to sit around a conference table in that room. It'll, be a v equipped, not really conducive to a cocktail party or an event of any sort. Okay, I just wanted to make sure double check. Okay, thank you. Okay, any other committee member, oh I, just have another question: there. Are you planting trees in front of that hotel? You love trees, that's a great question! I do not know the answer. I'd have to ask the hotel operator the Gm, but I can find out for you yeah. That would be good. If you can, we also he'll let the op. The owners know that this is something the community would like would like to see. Sure yeah, they're, very they're, very nice people actually and I think we can all use a little more green, so, okay, thank you. I'm going to jump in I was the only thing I was going to ask for were trees and thank you christine, and thank you for looking into that, because it is important, oh especially on that street. That's! Yes, definitely that was the only comment. I had thank you, yeah, our actually our main office, where I've been for nine ten years now is one block away on 38th street, so yeah the whole. The whole area could use a lot more. A lot more greenery and I live on 38th street on the same block. So oh, do you? Oh so you're not you're next door to us in our office building yeah. So you know, you'll have I just got one more thing to jump in real, quick, the outdoor space. It's not going to be used at all by guests. Tell me that it is not wired. No sounds no tvs! Nothing like that out. There correct nothing. As of now what I understand from the hotel, the doors are actually. First, the doors are locked. We can't even open the doors because we do not want guests. You know roaming out there and it's not I believe a means of aggress and then they are actually putting a lot of trees back there just to make it visually appealing, because you can see the patio area from our interior dining space, so they just do not want it to be an eyesore. So there's no sound system, there's no TV screens, just shrubs and little trees sounds nice. The way we like outdoors I'll tell you I'll tell them to kick them out to the front instead, maybe yes, in addition, okay nelly, do we have anybody signed up to speak from the public? No, thank you. Do we hear a motion? First Frank. Do you want to summarize the steps right, you're, mute, Frank, we're changing the kitchen closing hours to 2 A.M across the board and then just to sort of confirm what we've been hearing about the outdoor space, we'll have two additional steps: there'll be no use of outdoor patio by members of the public and there'll be no music or speakers in outdoor space. Okay, thank you. I'd like to make a motion. There is a second all. Those in favor opposed abstaining, not eligible, okay. Well, thank you. Good luck. Thank you. So much good to see you late for late night, snacks. Now that we're open take care. Everyone stay safe. Thank you number three 857 ninth avenue. This we've had one comment: unless there's more nellie, we have had one comment about noise. That might be an issue about that seems like this. Space is located in two adjoining buildings, forming one cult, residential co-op and it seems like there's a space between the two buildings. You might describe it as an alley, though there are windows and that the windows tend to stay open and transmit lots of noise to the residents above the applicant here. Michael Kelly is here for the applicant I like you on the phone. If you could just give me one second, I'm trying to see if Joaquin can speak hold on Joaquin. Can you unmute yourself? He seems to be having a problem with it. There's a few issues with some applicants being able to join I'm trying to figure it out hold on one second here is your activity is right there. The problem may be that it can't unmute or something because he's on mute now, yeah hello, oh hi, everybody, okay, we can hear you now. Oh, can you hear me guys? Yeah, nice, okay, perfect yeah. We had issues connecting with the zoom, like many other members, I believe so hope we can not get disconnected. Let me, but thank you for having us guys. This is an on-premise liquor. License application for Lotus Manhattan co-op they'll be doing business as the Goat House, located at 857, 9th avenue between West 55Th and West 56Th street, and the premise formerly known as Kilo. We did notify in our with the West 55Th Block Association. We did not hear from them. Kilo was opened in March of 2011, with a restaurant wine license the applicants owned and managed La Pocaria at 1626 Second Avenue, with an on-premise liquor license until it closed in December 2019. The applicants did come before you in September 2020 for their other restaurant at 623, 9th avenue and were approved for an on-premise license. The applicant did send me a letter that they sent to the community board because they were notified about a name. They were using on the side street. They were using Mr Barrows and their name was supposed to be La Poparia. The restaurant goes from the main block to the side street and they were using this name because the main restaurant is not open yet and they thought that'd be all right. I explained to them that they did stipulate to use the one name, so they are going to change that sign and probably by November 23rd when you have the full board: they're a full service restaurant, with a full kitchen open from 12 P.M to 12 A.M Monday through Thursday 11 A.M to 2 A.M on Friday and Saturday 11 A.M to 11 P.M on Sunday, there's, five tables with 12 seats and an eight seat bar same as our predecessor background music. Only no bottle servers, promotional events, corporate events outside promoters or delivery, bikes, they're a little too small, so basically they're a small cozy restaurant that will have excellent food. If there was a problem in the past with that window. Being open, we would stipulate to keeping that window closed. All the time and I would talk to Joaquin about putting some kind of sound proofing on it. This way the window would be totally cut off, and hopefully nobody would ever hear us Michael just to finish with the other location, the 623 9th. It's not just that it has a different name, but the the awning on the Side Street also says South american wine bar or something like that really suggests it's a separate place, so if they could just make all the signage consistent, so it does not look like the concerns we've been hearing from the community. Are that it's? It looks like a separate establishment. Yes, I spoke to him about that and he understands what the problem is with that, so the other stat sign will be changed to Le Pokeria. Okay, the other thing is we get an email from someone who lives in the co-op, I guess either right above or yeah 857, who said you did not do any outreach to them. Is that right? We included the West 55Th Street Block Association, on our questionnaire that we sent to Nellie but true, but it's strange to be opening in a presidential building and you do not reach out directly to the people right upstairs I mean they're going to be the people most affected. Not everyone belongs to block associations yeah, and what did you try to reach out to anyone in the building? I have tried to a couple of tenants and they were very welcoming. We will do that asap once we go ahead with this. We will let them know before, of course, but yeah they were very welcoming one of them. One of them is a restaurant yeah right. So I do not like her. We can. We can reach out to the person. That's concerned, okay. Well, let's see what I have two emails, but if we'll see if the people speak, when we get public comments and otherwise I'll summarize, these I have one question about the leasing. Is there any issues about the leasing yeah? The person where subleasing from FEMA took over the lease from 9Th Avenue holding in 1999. Pima and 9Th Avenue 99 Well Pima, took over the three commercial stores Pima and the landlord are having some type of landlord tenant dispute that we're not involved in, and we do not wish to get involved in. It has nothing to us. The lease given to pima allows subleasing. That was basically what it was for. Pima took over the three commercial spaces and they took those over to least amount and landlord is the landlord the co-op or is it something somebody different Ninth Avenue Holding is the landlord so and the Ninth Avenue Holdings is a separate entity? Is I? Guess that's not the question. The question is: what is the relationship between Ninth Avenue, Holding and the building itself? Is it? Is it is it? Are they the owner of the building and everybody inside the building? Is co-op or whatever I mean a rental? What is it that answer? I do not know the subway Sir Pima was supposed to be on this call. I do not see them on it. So if you want to reach out to the building above, are you going to reach out to a managing agent? Are you going to reach out to the landlord to 997 you're holding I mean how are you going to reach if it's a co-op? Is there a co-op board right, no I know I, I'm just trying to figure yeah. Are we all yeah right, good questions christine, thank you and if there's a co-op board, we could reach out to them and we could reach out to our neighbors. We can leave a flyer in the lobby with our phone number to have them. Call us! Yes, okay, I'm sorry can I interrupt my kelly. What is the person's name that you're looking for manny, okay, no okay, I, just wanted to see if they were listed as an attendee? Yes, okay! Michael! Can you just take me through this least thing so who owns the space? The owner in space is ninth Avenue holding company okay in 1999, Ninth Avenue, holding company leased, the three commercial spaces to Pima is subleasing to us. Okay has been subleased in these three spots since 1999. okay, and does that work is actually also the one running Kilo restaurant. He is the owner and does the ultimate landlord have any rights to approve or veto sublises, not for what I'm reading, but the pima did notify the landlord about a month ago that they had a new tenant coming in and Pima has not heard back from the landlord okay Nellie have we heard any more about the landlord issue? No okay, because I guess nelly had a communication from a lawyer today, we're not quite sure for whom indicated that the landlord might have objections to a full liquor license in this space that maybe someone will speak in the public session, but that's sort of all we know about it right now. Are they? There are board members for I see with this board members mate 57? Why do not? Why do not? We are you done Mike? Yes, okay, how about reversing this? And let's hear from the co-op people first, because if there's a serious notice issue yeah, we might ask them to come back next month. I'd like to hear from some of the 857 board members: yes, can we identify them hurry? Yes, the first person I have is a veronica I'm going to give you permission to speak Veronica. Yes, can you hear me we can hear you? Okay, are you? Are you the one who sent us the email? Yes, the one that was addressed to Jesse and nelly yeah, okay, so I was previously on the board. I am not this year, I used to live in the apartment, and now I just go back there now or whatever, but my concerns was I could give some insight so manny, I'm the owner of and logo and a logo or slash Kilo he's been in the lease negotiations with the board. The co-op board for I believe the past three years and it says never really gone anywhere and one of the tugging points was a liquor license again. There was no finality in that's in on that issue, but as a private president, it was my concerns was just that when Kilo was still operating at the place, the windows were open there and like there was a lot of spillover noise from the patrons. In addition, the and I pointed out my email too, that there were complaints of noise. It's just like rises over because, like it's an older building and there was not a lot of renovations or sound attenuation efforts and I know that next door there is rise, but they also had the same issue and they did a lot of sound attenuation. So there's not there's no spillover noise on that situation and they've actually done a lot of efforts to manage the crowds whereas Kilo had not. So I'm a little bit wary of that same situation with this new establishment, and our concern is my concern is actually that residents have voiced concerns about the noise about the state of the exhaust that was just placed on the roof. The exhaust system fan and no logo has not really addressed them. They were really just went unheard. So my concern is this: like this liquor license so Kilo previously, just had a wine and beer license, but a full-blown liquor license will definitely impact negatively impact the quality of life for the residents, because I think it's also just like a different, whereas like a wine bar is a little bit calmer, but a liquor license might not, and it's also I'm a little bit concerned after hearing what Michael Kelly had said about the applicant that they were not, they did not fully comply with the stipulations of their previous approval and also looking at their previous restaurant. It also just seemed like the applicant had experience with a more lively establishment, and I'm not sure if that will transfer over to this celebration, because, like again, I have not gotten any information about this, except for that one post that no public notice, that was on the Kilo storefront itself, no other outreach, and it's just like today, processing all the information right before the meeting. Thank you, Veronica I have one question: please: what is the legal relationship between the co-op and their retail spaces? I'm sure so the co-op there was a like 99-year lease that yeah I do not know who did it? There was a 99-year lease. That's signed over the three commercial storefronts to Pima, which is owned by manny and manny is now sublease subleases, those so the co-op leased the retail spaces underneath it all the retail spaces am I not following you, I'm sorry I was it was cutting out a little bit. So the co-op like back in the 80s or something a different board when it was incorporated as a co-op. The sponsors gave a lease two for all the commercial spaces to manny and then manny. It was like a standard boilerplate redmi lease and that so manny is the. While he leases the space from the building, he yeah he leases the place from the building, but then he's subleases it out to other tenants. Let me try to. Let me try to clarify on that. Please veronica. What you're saying is that the lease the lease for the commercial space when they pay the lease they're, paying it to the sponsor they're, paying it to manny. Okay and manny pays it to the sponsor. Manny pays a separate type of fee schedule based on like the I understand, but who means he then pays a separate amount to the co-op or the co-op? Okay, when you're, not speaking, we're getting a lot of background noise and I. Think it's coming from the people on the phone. Okay, one other question Veronica! So, aside from seeing the sign, you did not hear anything from the co-op board or you know your neighbors or anything in the building. I heard nothing except for like I, think I saw some chatter I. Think I was just connecting with some of my the fellow residents in the building and I just heard from the co-op president that, like we that there's a that there's a meeting tonight and we're like what's going on. This is the first we've heard of it and, like it's just been a lot of like hecticness, trying to figure out what's going on. Okay, thanks, thank you nelly other people from the community. Yes, next I have Jason Kleinman hello. How is it everyone hi Jason, welcome? We did get your email as well. Thank you I, you know. Were you able to get the photo that I sent? No I did not see a photo a photo a short while ago. What I find you know the photo shows the windows about which I'm concerned it's the windows that leak the noise, and it also gives you a good view of the interior space between 855 and 857, 9th avenue. Yeah I see it now nelly just sent it to us. So look I mean that's the view outside of my window. You'll see like so many other people living in Manhattan I do not get a lot of natural sunlight, at least not from that particular window. The space between the buildings is probably like five or six feet wide, and you know since 2011 there's been noise spillover because Kilo has not consistently kept those windows shut and Mike. You know when you were speaking earlier about providing a stipulation that the new sub-tenant in that space keep those windows shut to me, I'm a little wary of that as a stipulation for the following reason. You know we're in the co-op and manny is our tenant. We do not have a relationship with Joakim and manny for years has been saying that you know he would keep that window shut and I. Remember like five years ago. Just talking with him are you? Are you finally going to go to the hardware store and do something about those windows? They would say. Oh yeah I have I, have the nails we're going to get it done, but then, as recently as last week, you know I was down there in my pajamas. You know 10 o'clock at night saying guys come on close the windows. You know you got five people, you got five people in the bar yeah, you know the front door. The front wall is an accordion style wall. You really do not. These windows do not provide any ventilation and though they've always been good about shutting the windows. When I ask I, do not want to have to live my life, you know going downstairs and asking them to shut those windows. I just want them to board them up or something. That's all. I have to say. Thank you. Thank you. Jason Ellie. Anybody else I see manny is here. Yes, he is. Does he want to speak? Yes, he does. Can you hear me yes, yeah I mean a lot would said. If there's any particular questions, anybody wants to ask I, think that would be better as opposed to you know. I mean I am the prime tenant. I am subleasing. We did have various conversations with the board. I offered them to take out restaurants completely. They did not want that. Well, we offered them more money. They wanted. You want liquor, you got to give us more money. You know it's two sides to the story and it's not a simple story to tell I emailed their lawyer, Arthur on October 8th that I potentially have a lieutenant I followed up with her several times. I did not hear back when I heard today that somebody made a representation that we do not have the legal right to you know. Sublease the space I had my lawyer reach out to her, and she told my lawyer that she does not know what's going on she's, not in the loop, but you know I've been waiting and waiting and waiting for them to get back, and you know and I told their lawyer on October 8th. We have a sub-tenant and I just do not hear back from them. So it's a it takes to the tango and I'm here, I'm always here. I do not want problems. I've offered various solutions, it's usually a money problem, and you know that's all I really have to say. If anybody has any questions, I'm here, okay, thanks, manny you're welcome. Thank you very much. Anybody else nelly, yes, I have two more people. Okay, I have Mike Ward Mike. You can mute yourself y' all here. Can you hear me? Okay, we can hear you I just want to echo what Veronica said in the very beginning. Regarding the notification report, member and I lived here in the co-op and there was no. There was no notification whatsoever to those of us who live here. I saw the notice posted on the front of key little on Friday, but there's been no email. There's been no posting in the building. Many's been here for a long time. He knows how to reach us if he needs to do so. That was not done so it's hard for us to kind of look through an application on the fly and give you proper questions at the last minute. But I do have a couple questions about the application itself. It says 74 inside which I thought which baffles me with a total of 20 for seating and 54 standing up. This space is tiny, so that does not make much sense to me. Like Jason, said the air shaft between 855 and 857. That's where the noise travels from the ground all the way up and the windows are open and the voice comes inside the residential space to it. One of our neighbors thought. Noise was coming from an apartment last week and you should hear it three floors up in her apartment. It was not coming from the residential apartments coming from Kilo with the windows that were open. The application says it's not in Clinton, we are indeed in Clinton for zoning purposes. It says music is that inside or outside, because it's not specified on the application. It says current plans are on file with DOB. They are on file with the Ap for a food store, not for a restaurant. The other survivor talked about was the noise. The issue is we're next to rise, which is a bar itself, which now sells doritos to call it a restaurant because of Covid-19 and they've got outboard seating, which is fine, which makes sense. But if we're going to have many try to have an outdoor cafe, which it's not this, it's not big enough for out outdoor cafe. Are we going to have 74 people on a Friday, Saturday and Sunday or Thursday whatever night? It is also in front of the building causing more noise pollution and disrupting the making it disruptive for our neighbors and, as for manny, there's been a lot of back and forth with various sports. For various reasons, the prior boards were not on board with a liquor license in general, and a lot of the shareholders here in the cup were also on board for liquor license, because every restaurant bar on this block has a liquor license, we're in it we're surrounded by liquor licenses. Thank you. Mike can I answer a few of the questions, one more one more person, then one more Dina. Yes hi. Can you hear me hi, I'm also a shareholder in the building, I'm on the board, I'm Secretary of the board, I'm probably just going to reiterate basically what everyone else said: I do live on the side of the building where the air shaft is where the window is always open for Kilo and the noise just echoes so loud. It literally sounds like there's a party in your own kitchen. All night people will sit on the stairs of the entrance you can't get in. They wait there while they're trying to get into the place like Mike said we have ryze right next to us, which is just insane amounts of people just like sitting on the floor. Just all over the place, no board member at all was notified of a change of tenant or a possible change of tenant. We have a management company who is not notified either of any change of tenancy. There's an email a month ago sent to our attorney that just barely says that manny may have a possible offer and he is contemplating taking it. I do have that email, but that's all that was said. So we were all shocked when we saw the notice on the window for this meeting and as Veronica said it's, you know, it's super hectic all of a sudden, because we knew nothing of this. Potentially these new tenants could be great for the community. Maybe they spoke to a few renters that are in the building, but I mean we have a chain of like 20 people. Nobody knew about this. It's a shame. This potential tenant can be great, but the reputation that this building has with the landlord has or the tenant I should say, has caused shareholders just to cause uproars in these buildings, and we do have two buildings that are attached with this air shaft. It's also eight five, ninth avenue that shares it with them, so that adds on more people that are just hearing this noise. Thank you, Dina nelly anybody else. Yes, we have one other person. Okay, we have oh hold on Oliver hi. My name is olivier. I'm the treasurer of the co-op so on the current board and I can also say that we had no notification whatsoever and, as Dina said you know, there is this email that our lawyer sent to us where many was mentioning the possibility of a consideration of a new tenant, but that's actually not at all a notification of, or even you know, a request for an answer or comments, or you know any feedback, so I do not think that's appropriate to say we've been notified. The second thing is that there's been a record of I would say, maybe a recklessness with pima. A few years ago we had to trip and fall I mean they had a trip and fall incident out of their steps, and so the circumstances that they were not properly insured. So this created financial damage for the building, and the other thing is that a couple of years later, you know the steps, were you know in disrepair and they just left them alone. The another issue that came up is they had for a few years, a sidewalk cafe, and in order to have that sidewalk cafe approved they, provided. You know planned on the sidewalk that we're not actually reflecting the situation of the sidewalk. They were obstructing. You know a fire exit, and actually we did have a fire last actually two months ago in the building, so I think these kind of issues are to be taken seriously, and you know obviously there's been also food safety issues with is another space that is also released by by Pima. So in general you know we are very cautious about. You know any any further risk that you know the community would be put at and obviously having a you know, full-blown like a license is more risk. Thank you. I do not know how you feel, but I'd be very reluctant to approve this tonight. Given you know that the co-op who's both the ultimate owner of the space and the people who live above it all just found out about this and not met with the applicant, which you know, may improve the applicant's chances, but I guess I would be inclined to strongly urge the applicant to postpone a month. The applicant would be doing that would be postponing for next month. Okay, Mike and you've spoken with your clients. I believe they would agree with me without okay and you'll agree not to file with the SLA in the interim. Absolutely okay, so Nellie will get a fork to you tomorrow and if we can leave our number with nelly tomorrow, so we can get in contact with the co-op members if they can call in and get it from her we'll leave the number. Okay, you, your people, know exactly manny knows exactly the co-op number right. Okay, then we'll we do not have to be involved in that. Manny is right there and he knows the co-op yeah. Okay, people on the from the co-op who spoke is there? Is there one of you who wants to be sort of the contact person for this? Maybe one of the people on the board either olivier or you have the secretary of the charger right there are they still with Us. Dina is not olivier, still is no one has a hand raise or anything. Oh Mike, Ward does and Dina yeah Dina hi guys Mandy's been in contact with all of us for quite some time. He knows exactly who to contact. He purposely does not so well we're strong, we're, not mediators in any kind of internal dispute. That's natural function here. Our function is here to hear applications for liquor licenses, but we strongly suggest before we go ahead with this, that you guys get together and talk some more I'd like to make another suggestion before they go further manny it's time to take your to close. To put a wall on that window in the back before you do anything because I do not think you're going to get anywhere until you have absolutely built a wall on that window. So it's not a nail and it's not a hammer. It's build a wall. Okay, thank you christine, so Mike you're going to make sure everybody speaks and you'll get back next month. Yes, thank you. That is a hand Rob up Rob. Just to echo what green steam said. Yeah. The only way that you're not going to get sound is brick that thing right up. I've got three other points: I just want to bring up real quickly, one of them the bathroom kudos on the handrails according to the diagram, is that a pocket door that is the door for the bathroom, is the attorney still there or the owner manny. Can you answer that question since you're yeah there is, there is a pocket door right now. Yes, okay, see how there's a pocket door just a suggestion. Could you please on opposite of that door? Put two or three hangers for accessibility hooks that are chair level, so people can utilize them, seeing how there's nothing on the door. The other thing is, you look like you've got enough space to have an internal vestibule. That would be your best way to go, but also the steps you have there. It's not exactly ADA. Do you have a ramp for people with a chair, so they may get in if I'm not the operator. So I can't answer that question about Iran. Okay! Is there anyone here? Who can no? Many? If you are the person who is listing the space? This is your space. You need to fix this. Yeah I am the prime tenant. I do not have you know. The sub tenant is the one that has the physical access to the space and is operating if they need help still needs to be ADA compliant and every time you get a new person in it should have been a while ago. All I'm saying is that if you can't be ADA compliant, you at least need to have a ramp in and you need the ramp. You need a handicap. You do a lot of people who are handicapable will go right by see the steps and not come in. If you had a little sign with a person in a chair to show that it's ADA accessible, you'll actually get more foot traffic per se from people who are handicapable because they'll go oh, you know they have the means of me getting into this restaurant anyway. Thank you, okay, I would also suggest when you come back to us that the question was raised about capacity, you have seating for 20 8 at the bar 12 at the tables, but capacity is 74. so we probably want an answer to that. That's the letter of no objection, that's why letter of no objection says 74 or under so that would be the legal capacity. It would be impossible to get more than 35 people in there. That's what I thought from that here in the description, so Veronica had a question veronica. Yes, this application will trigger the 500-foot rule, but and I apologize for those of you. Who've heard me say this many times before, but to be clear what the 500 foot rule is and does the 500-foot rule says if there are three or more existing full liquor licenses within 500 feet of a new applicant than a new liquor license can only be granted if there's a finding that the new liquor license is in the public interest and there has to be a hearing which is now being done on paper in front of an administrative law judge who makes a determination whether it's in the public interest or not then often goes to the which then goes to the SLA commissioners. So it is not an automatic veto. All it does is sort of arguably tips the presumption that there'll be a license and sort of puts more burden on the applicant. Unfortunately, what exactly? What is the public interest has never been clearly defined in one place. There are various court cases out there saying what is or is not what is not enough on its own to be the public interest, but the rule is yeah. You know is tribute here. Okay, so we'll see you all next month. Next month, okay, thanks all thank you all number four 20 Hudson yards niz non at Hudson yards Llc. Do we have the again? It's you again, that's why I was wondering why you are still there. Hopefully, this one's a little easier motion should be on the phone there's an on-premise liquid license application from is known at Hudson, Yards, llc and located at 20 Hudson yards unit 401b. On the fourth floor, it's between 31St, 33Rd, Street, 10th and 11th. Avenues probably know what it is. This is a space formerly occupied by belcampo, who had a on-premise liquor, license we're a full-service, Mediterranean Middle, Eastern, Restaurant background music, no outdoor seating. Obviously we'll have the same seating as our predecessor, 25 tables, 66 seats, nine at a food counter and 12 at the bar they'll only be one liquor license. The people sitting at the food counter would not be served alcohol over the food counter, but a server can bring that to them. They'll have the same hours. 8 am to 1. Am Moisha has a few other places some in your community board. He has known at 161 West 72nd street, since 2019 has an on premise: liquor, license Miss known 75, 9th avenue from October 2017 to present cream line, same location, Chelsea, music hall, same location and also ball gonzo at 511, 9th Avenue. Okay, Michael is anyone involved with this connected with the restaurants in the skyline hotel. Most recently was this ha salon H.A.S.A, not that I know no one's showing up on my paperwork, because it's the okay, yes, because the reason I ask is bar gonzo I think shared ownership at one time with that restaurant is anyone from your client on the phone moshe. Let me text him. Okay, he should be on the. He was on the phone before and Michael I. Do not think it matters particularly to me, but the prior hours, the hours for the prior establishment were actually a lot shorter. They were 10 and 11. Closing, at least according to this step. Form with us is what the moore wants us to have. So if they're closing earlier we're going to be closing earlier, okay, we'll be open later than tomorrow, all right, bert I do not have anything else. Anybody from the committee remember I, can't see your raised hands. So if you have something say yes and go ahead, yeah so bar gonzo I do not know what is the relationship with bargonzo, but they did pretty much everything wrong. So I do not care because it is on Hudson yarn and that's fine with me, but it was really a disaster right and Michael. The reason I mentioned this restaurant in the skyline. They converted from somewhat sleepy Tex-Mex thing to this. What they were advertising as a major party restaurant, completely redid the interior without letting us know, I do not know if they filed for an alteration with the SLA or not, but there were major changes to the interior, so you know they're at their extent, there's overlap of ownership. I hope you pass on that. There are I, guess trust issues based on you know both what happened to bar ganzo and at the skyline. Well, I think Moshe is more interested in now. In the Miz known brands he's also opening one up in the mall in Brooklyn. I. Think he's going more of the way of these restaurants yeah. But you know the people I mean people are not brands right. This is the way you act, so the trust is with the person not with the brand. Yes any other, but person on the committee is this. Twee I have a minor question here. No question: thanks, I'm taking the lead of what people are saying about tables and and the graph I'm trying to get back to the spot. The graph on page I think it's after eight of nine, they show the 25 the 25 tables, and then they have nine seats at the food counter and I see seven little circles there for the food counter and it's all it's all real cramped, so I do not know I mean everything else seems okay, except for that section. So the question: is it seven or nine I mean because the drawing shows in seven and the writing shows nine everything else is drawn to the right numbers. It would be. Nine I could amend the plan. If that's what it has on it, but it would be nice at the food counter. Okay, that was a very impressive catch. Yes, really, okay, it alluded christine and me like two big seat counters. It boosts the seekers. Right can I. Just so can I just clarify, so the hours are extending or decreasing at each of the hours we got from the mall uh-huh. So if the mall is closing before 1 am, we would obviously be closed before 1 am okay, because what we have for belcampo was eleven and most of the weekend, 11 to 11 on Friday and Saturday, and now they're applying for eight to one so they're extending the hours. If the rule is open. If the mall is not open, we would be closing if there's no but wait a minute. I mean do not. You know whether the mall is open or not. You are going to rent the space for me. The way it is now I do not think the mall knows if they're open enough yeah right. These were the mall. These were the hours we were given by the mall okay, so the mall wants to stay open later in the future, I mean it's in Hudson yards frankly. I do care right, but I just wanted to clarify that they're planning to stay open later, yeah. Okay, thank you. Okay, any other committee members with questions. Do we have anybody from the community nelly? No one! Okay! Do we have any steps here? Frank! No, there's no I do not see any change any necessary changes. I mean you have to have to modify the plan to show the numbers. Oh you're right, but I do not think we need this yeah I. Do not think we need to stick for that Michael. Can you get us that by November 23rd, the new one abstaining present not eligible? Okay? Thank you, Michael. Thank you see you next month, you next month right number, five 442 west 33rd street between 9th and 10th odc elemental. Llc! Yes, can everybody hear me yeah Max? How did you guys lose the Hudson yards exclusive? It's news to me. I got some calls to make after this meeting. That's right! That's right! Hey it's a big city, you know there's enough to go around. I just want to make sure all of my people are here. We have drew Chopra I, see him. There stay muted for now. Warren just everybody knows. What's on your list, there is Warren Edcock, that's actually Josh Cohen. Do not ask me how that happened and Warren has dialed in the number ending in zero. Two four, so I do see everybody here as panelists so good evening. Cb4, my name is Max Bookman. For those who do not know me, I think I see familiar faces. All around I have a pretty fun one tonight. This is the midnight theater and so with me is Josh. Cohen Josh is a well-known Brooklyn restaurateur he's very active in the north Brooklyn community, both in the restaurant community, but also just generally as a community resident there. He is, he does philanthropy. He volunteers. I. Think most interestingly to you folks, is that he is a member of Brooklyn community board one's liquor, licensing committees and he has been for many years. So he knows exactly what you all go through every month with liquor license applications, and he knows the types of concerns that you have and if any of you think that your job is tough, spend the night at Brooklyn community board one's liquor, licensing committee as I have done, which is and then you'll really know. Tough with him are his partners drew Chopra and Ward Nat, Warren, Edcock and so to locate ourselves here. This is Manhattan West, it's brookfield's project, just east of Hudson yards. Everybody knows where it is 9th and 10th 31st to 33rd street. So far in terms of liquor, licensing at Manhattan West, you've seen the Sbe Sam Nazarian Food Hall, which you approved a few months ago next month, you're going to see the pendry hotel. There's a hotel license there and this month is their really centerpiece place, making establishment a restaurant and theater combination. So if you have our materials in front of you, you know page 22 of the pdf shows you where we're situated in the Manhattan west, complex and from a quality of life standpoint. It's really an excellent situation because we're not located on any one street our main entrance and exit. The only way for people to come in and out is on the plaza, which is essentially what 32nd street would be, but there's no entrances or exits onto any streets. So here's the concept, it's a it's a three-in-one there's it's an all-day cafe on the first floor, opening at 7 A.M every day, and that's where people walk in if you're not going to the cafe, then up the stairs brings you to a landing and then on one side is a full-service restaurant. That's going to be open! Seven days a week with real restaurant hours serving an excellent food menu which we've attached and on the other side is a theater. The theater is a 189 occupant theater with 168 seats, 72 tables, and you can see it's like a dinner theater, there's not only seating arrangement but there's tables where people can eat at as well, and so what they? What their idea is that, if you look at the Broadway theater experience, you want to go out, you know for dinner and a show on Broadway, generally you're, going to a restaurant somewhere else. You're finishing your you're rushing through your meal, you're finishing your meal, so you run to the theater. You can get into your seats on time at intermission. You get fed some. You know, stale pretzels or something like that and then, when the show is over, you are rushed out of the theater and onto the streets. So what they're trying to do is put everything all under one roof. So it's you can have your dinner at the theater. You have your dinner at the restaurant. The show is right across the hall. You can continue eating and drinking while you're, watching your show and when the show is over you're not rushed out because they're going to be open a little later after the shows are over so that you can continue. You can have dessert, you can mingle a little bit and then you can leave when you're ready to go. So that's the concept. We did a significant amount of outreach, not only because this is a an important element of Brookfield's Manhattan West project, but also because of Josh and his team, and they understand the need for outreach, and so they retained Siri Casiro's office and Pete Kraken Dallas, who did their usual thorough outreach job. They met with representatives from every elected official. We had a pre, we had meetings with with all of the lock associations, Julia Campanelli. We we briefed Frank and Bert on the concept as well, and we've generally gotten positive feedback from the folks who we've spoken with. So that's all I have really have to say for now other than that, it's you know the steer. You know it goes without saying, but I'll say it anyway. Obviously, theater is in a tough spot right now because of Covid-19. This was a. This was planned long before Covid-19 I mean New. York City could always use new venues for creative performances. Creative arts comedy music things of that nature. We think this will be an excellent place. Making addition to the neighborhood. Obviously, Covid-19 creates an additional urgency to make sure that we're doing what we can so that this important element of our city's cultural landscape can recover. So with that we're happy to answer any questions. I just want a flag for the committee in the step application form there are several enthusiastic letters of support from various institutions and individuals. Both in support of this venue and Mr. Cohen is one from the actors fund that came from Barbara Davis who's, a former member of CB4 there's one from the 34Th Street partnership, one from the Hudson yards Hell's, Kitchen alliance from Bob and fodo who's, the former district manager of Community Board, four, it's a very small world here and a couple others from the north Brooklyn chamber, episcopal church of the ascension and a member of Brooklyn community board, one. The other thing I should say Max did not mention. Was they had a bunch of discussions with a local resident, Julia, Cappanelli and I? Think one of the things you've agreed to is all shows are going to end an hour before the closing time of the venue. That's right! That's something that Julia was very interested in and after some back and forth, we've agreed to accommodate that. So the step will be, all performances will end no later than midnight. Sunday to Wednesday and 1 am Thursday to Saturday Right Max. The purpose of that to remind people is that everybody will not be departing in a mass mob. All at once. People will have an hour to distribute themselves between the venue hanging out some people going immediately some people hanging out, and so there won't be that kind of a crowd on the, in the plaza on the street. Looking for cabs, going to the subway all at once, yeah and if I could just jump in I'm sorry guys. I would have a letter from Julia too, but she's dealing with the family emergency in Florida right now and I just chose to leave her alone. This was a request she made of us that we're carrying through in our absence Peter or Max. Is there anything else, Julia wanted that you did not agree to just that. We would deal with atmospheric haze when she gets back from Florida just so there's there was a question about you know our use of that prop device. You know that in some shows there's to make fog and she had some environmental questions that we'll address later on with her yeah. The other thing I should mention just to follow up on what Max said and Bert said about exiting is that the entrance and exit to this place is actually not on a street. It's on to the Central Plaza Courtyard in the middle of the development, so people will come out there and then can head in different directions. So it's not even like everyone leaving is going to necessarily end up on the same sidewalk or even the same street avenue or you could take the breezeway through straight to 10. yeah and that plus, what that plus, what bert already mentioned, which is that, in addition to people having multiple directions that they can go and they're, not all leaving at the same exact time, so there won't be this mad rush of people, not to mention the fact that the theater itself is not even that big. It's as I said it's a 160 seed, theater all Right committee. Any committee members have questions comments. Yeah hey go ahead! Go ahead, go ahead, Rob I! Just on your application. It says see something for hours. Where are your hours, it's at the end yeah! So, oh, you could not find it in all 180 pages that we gave you yeah it's having a little difficulty, I just sort of it's easier. If you just stick the hours on the application for us, it makes it a little bit more convenient, yeah, fair enough and the only reason Rob why we did. That is because the the cafe and the restaurant have slightly different hours, but so our hours are for the restaurant. You can find it on. It says: method of operation. It's the it's one of the attachments in there. I know there's a lot so for the let's start, with the cafe for the cafe. It's 7 A.M to midnight, Sunday to Wednesday, 7 A.M, to 2, A.M Thursday to Saturday the restaurant and the theater are noon to 1 am Sunday to Wednesday noon, to 2 am Thursday to Saturday, okay, so the tables outside what are the hours for those, because you've got the eugene right across the way, which is residential, good call, Rob and I should have mentioned that we have a very small little outdoor seating area. That's going to be associated with the cafe generally for daytime use, we'll close that outdoor seating area at whatever time that you normally require us to I. Think it's eleven o'clock with no music or anything else out there. There's no outside sound, coming out to entertain your outside. Cafe, people right, no, not at all it's so there's no operable windows or french windows, or anything like that, and it's really just a few little kind of like the parks. Like the seats you might see at bryant park for people you know to have some bad amount of outside, mostly during the day, so yeah, okay, I, just get concerned about the hours past really ten o'clock during the week. That's all! Okay! Thank you! Whatever yeah, whatever your normal request is for outdoor space, we've agreed to okay, christine yeah that sounds very exciting. I was wondering- and we are now talking about after the recovery right when everybody start to make money again whether we could have some opportunities to invite some underserved people from schools from the neighborhood and get them to you know attend some of those representation and yeah. If you had a program like that, it would be very nice yeah christine. Not only is the short answer yes, but I. Think Pete can give you a little longer answer as well, because they've already actually given that some thought yeah, so christine we've already started doing some of that. Josh has like I had to stop on all of his philanthropic work in Brooklyn he's already. We've already had conversations with parody productions, which is in the Times Square area. The schools were happy to work with. We could you know on a broad scale. We could work with brookfield and arts brookfield yeah what we want. What do we want to? Do? I'm sorry, but very smaller, tenants and I know this is writing Josh's Dna and it's something he's actually looking forward to working. You know with children houses, the Hudson bill, the Elia Chelsea and the other major projects we have in the neighborhood and really kind of outreach to them and give them some opportunity to to attend. Now he wants to send us a list we'll start working on that yeah we're absolutely open to all of that. Yeah that'd be wonderful. We really appreciate that yeah. It's really great thanks. Okay, anybody else, yeah I got one more question here. What is the need for a dj or live music if you're going to be a restaurant with the theater with background music, maybe in the restaurant and good question? So the theater is, you know, although we will have you know, broadway shows performances, we've partnered with Wagner Johnson production company, which are tony award winners. To do you know, productions they're also from time to time, have a musical performance live music performance, seated, of course, at the at the theater. So that's the live music component to it. Dj was something that we did discuss with the neighborhood stakeholders. When we did our outreach. The idea there is for, on occasion in the restaurant to do a sort of you know homage to the old school supper club, where we would have dinner and some light dancing in the restaurant, or you see me in the in the cafe area downstairs, which is a very small space so that that's the dj piece of it. Okay Cp course also your neighbor. We are literally, our new offices are right, smack behind you in the lofts. Who are you I'm sorry? Who is that that's Rob, Walker yeah? What he's saying is? Can we see before's offices- oh okay, right next door to ours, they're in the loft building, which I believe is like 424 or 436? They'll have their eye on you? That's great, hopefully, you'll be you'll, be guests of us. Okay, anybody signed up from the community nelly. No one has a hand raised okay. Thank you frank. You want to summarize. If we have any steps here, yep there's just the one additional step that all performances will end no later than midnight. Sunday to Wednesday and 1 am Thursday to Saturday no, and those times are an hour earlier than the closing time of the venue. That's right! Okay, they've answered that question. Already the usual hours 10:11. you know what I know it's not going to be good. What would be helpful is to have one of those pages we have you know for the hotels where we have multiple locations. It's an attachment three in the submission we've made yeah, not quite because you do not have the you do not have the outdoor cafe there yeah, so I would complete that Max. Can you revise that one page and just put yeah I mean it was? To be honest, the outdoor cafe was so minor. It was almost an afterthought, which is why we did not want to clog up the you know the with too much information, but it's a fair point and will will revise to include the hours of the outdoor cafe. Everybody else. Thank you. Yeah! No problem. Okay, do I, hear a motion. Promotion to approve opposed abstaining present, not eligible. Thank you, good luck and he's the CB member. He should know. Thank you. Thank you. Everyone good goodnight! Thank you. Okay, moving along number, six 113,117 west 24th street. This is a new hotel, Chelsea 24th street manager. It's on the north side of the street between 6th and 7th. Yes good evening, members always good to see you again, I apologize that I'm not appearing by a video I do not know quite what's wrong. I think it's on my end, not sure, but it's good to see everyone I'm joined here, I'm the attorney for the applicant and I'm joined here by Gary Maynard mastered you cut out. If you're still speaking, we lost you. Are you there mastin Nope nelly? Do you see the telephone up there? No, he just muted himself. Did he say that there was someone by the name of Gary. He was about to say someone else was with him because I have someone listed as an attendee. That's name is Gary. I'm going to move them over, see who appears no I. Think his connection is just gone. Gary nope! Maybe you want to move to the next subject: Gary! Yeah! Yes, can you hear me? Yes, are you the applicant? Yes, I am yes, I'm the general manager. Madison is the attorney okay Gary. We seem to have lost contact with your attorney. We can take the next item and circle back to you. If that's okay, yeah, that's fine I'd! Rather him present I figured that okay yeah. Okay, then we have just let everybody know number eight is postponed until next December because they need to meet with some members of the community. So we have only the last one is number seven 348 West 52Nd street advanced Aerospace, Llc Natalie I, see that Justin Buchanan is on the application in his attendees. He probably should move him in okay, that's okay! I'm just going to speak for both of us. That's, okay, all right and you are I'm Eric. Einstein I've been before this committee a bunch of times, I. Think some of you know my face: justin and I own and operate hardware on 10th avenue between 47th and 48th streets. We've been for you more recently for the former dry cleaners. Next to Amy's bread on 9th avenue for which you granted us a 4 am license that deal did not go through. It changed Kansas several times and looks like they are looking to sell the building and not to us. So, for now at least, that deal is dead coming before you today in we're looking for a deal on what was therapy bar on 52nd street between 8th and 9th, that is a long-standing gay bar that closed in April they packed up and left at the beginning of Covid-19. They turned in their keys and we are trying to take it over renovate it and keep gay bar in the neighborhood in that spot. Similar operation to what therapy had in terms of the Cfo does not change we're not doing anything major structurally on the inside. It's really trying to freshen it up and open it up as a new venue. One thing that I do want to point out, because I know that it's a touchy subject for this committee is that we would like to replace the carriage door, which is now a closed glass window. Divided window divided sideline window with french doors so that we can have better ventilation, especially during Covid-19, but the hours of operation will be till 4 am just like they were previously. We have a long and I think good track record in this community board and in this community you know, I attend the meetings. The Block Association meetings for hardware on a monthly basis with Elka who is I, consider a friend now, among others, including Jd, and you know we did a full outreach to the list of people that we were given by this committee and I spoke with Steve Bolita for a while, and he is okay with this application. He sent in a letter saying that he was as well. I do not know if there's anything else that you received in addition to that, but Outreach was made and and Steve seemed okay with it eric a couple things. The way you filled out the form I take it when it's. Yes, no and you x out. No, you meant your answer. Is yes, correct? Okay, you x'd out live music, but you know, given that you're talking about having live performance I think it's probably better. If we keep that in okay, there have been debates about whether lip syncing- you know high performance and so I'd recommend you restore that which we can do for you, okay committee, this I thought that was more like. Are we going to be a you know, an open, Mic kind of a cafe law type thing and that's not what we're doing yeah, but you are not going to have at least lip syncing performances and possibly people right therapy. That's right, fireplace they're predated the stip form, but I'm virtually certain. They had a 4 am license, and then this is the email we got from Steve Bolita, the chair of 49 54 block Association I spoke with Eric. We discussed his application in our last block, Association meeting I know of no complaints at his venues. Eric is a member of our Block Association and always works with the community. We only received positive feedback from those that attended our meeting and no complaints about his application. We feel confident that Eric will be a good addition to our neighborhood. That's all I have that's a high recommendation. I just have one question: where did you get advanced aerospace, llc I just make up some silly names and I'm creating these companies so and I have them sitting. There's always one. That's not in use for the next thing. Okay, I just did not know if you were from Seattle or where were you coming from I do not know I'm from the upper west side. Any questions from committee I can't see. So if you have anything, go right ahead, Stephen if Steve Bolita approved it, I'm good me too I make a motion. There's one person with the raised hand, okay hold on yes, hello, so I used to also go to therapy back when I was still open. So I'm excited for this bar to stay open. Okay, thank you and thank you for hanging in there and offering this boy. Usually people only stay if they're going to have bad things to say so and he's not a plant I do not even know who he is so. Thank you. Okay, Rob you're, going to make a motion. I was going to make a motion to accept these based upon our terms and conditions. Second, all those in favor, aye, abstaining, present uneligible looks like it passed. Thank you have a great night. Good luck! Masten! Are you back the fastest four o'clock approved? Yes, oh my gosh hi good after good evening. Members. Can you hear me? Yes, okay, I hope it continues. I apologize, it's great to see everyone again, I, I'm having trouble with the video as well as long as audio continues, that I think that'll. Suffice, I, I'm of course the attorney for the applicant I'm joined here by Gary Meda, the general manager, as well as Al Firestein, who is a sound expert. They conducted a sound study for us regarding the outdoor areas, which again this is a little bit about the application. This is an application for a hotel license full on premise: liquor. There are two well, there are a couple spaces where alcohol will be served on the first floor. There is a lobby as well as a dining area. Then there were out front on the south side of the building, I believe on 24th street. There is a what's called an arcade area, it's an outdoor space that will have a roll of cover, but the roller cover is intended more for weather, as opposed to sound because as I think Al will talk about the sound I do not I do not believe is an issue in the front area, there's also dining space. On the second floor and the interior of the second floor, that is, that also leads to a terrace which would be covered by a roller cover. However, based on the sound study it's intended for to be covered by a roll of cover, which would again also help with weather sound as well. However, after conducting the sound study, it appears that even the even with the roller cover open, if you will sound, does not appear to be above the ambient levels that as tested so but again, Al will talk more about that. In his finished study, the there would only be recorded music both inside and outside and again the study was performed considering that type of music in that space and I can get into further detail or take questions or I can turn it over to Al. So he can elaborate on the sound study and his results for those spaces. Okay mastered before Al starts. So on the second floor terrace, are you saying you are going to keep the roller cover closed all the time or you want to have it open or what's your position? Oh I'm, sorry, you were breaking up Frank. Could you say that again, second floor terrace? Are you going to have the roller cover permanently closed? Well, I apparently am still having difficulty hearing you guys, Gary I do not know. If you can hear me Gary, can you answer the co-chair's question? Yes, we I mean. Obviously we would like to have that space on the second floor be available to be open during the nice weather season. I think that's the whole point of it and I think Al, you know, can speak to the sound levels that are that are not going to be intrusive at all, but no, the intent is really would be to have that during the warm season to have that available to be open, so burn and I did a zoom. Video tour of the space and Bert's actually walked around there a few times in the past couple of days. We have for people not aware this is on the north side of 24th street close to 6th avenue immediately to the east of the hotel is a small building and then a very new large high-rise residential on 6th avenue across the street. Immediately on the south side is another hotel and on its west side is a office building wework type of office building and behind them is another hotel on the 25th street and some mixed residential and commercial buildings and some small old residential on 25th street. What concern me and it's a mixed neighborhood in terms of residences commercial space, probably predominantly commercial I, did not see any signage, announcing that you're applying for a liquor license, and now maybe you sent it to the buildings personally delivered it. But I was just my concern. Was you had enough space on the billboards on the on the you know the enclosed Walkway in front of the construction? You have lots of signs up for different reasons. Building permit signs could very easily have put up announcement for the community board. Blp and I did not see any right, and when we talked at the small meeting we had, we also suggested you put it on lap posts and other things, so the neighboring buildings could see it yeah they were. If I can interject I personally posted eight posters on lampposts, as well as the the facade of the of the construction site. There are eight different postings on lampposts, along 24th street, between seventh and sixth. In fact, on each corner of sixth and twenty fourth and 7th and 24th a street street light Post it has postings. There are a total of eight scattered around that were put on there on Friday. Well, just maybe they did not last the week. That's very that's a possibility because I was there yesterday and today Gary did Dude. Sorry, I'm sorry bernie they're, not there today, right, wow, yeah, because I know I think we even have photographs I mean if you said it, you did it. That's. Okay, no I, think photographs are good, I mean looking at. One of this is tweet. Looking at one of the other applications they had the sign posted, then they taped to it like in Am, New York with the date on it, and for that very reason, I have no doubt that they that they did not I'm sure they put it up. Yeah, oh yeah. We certainly did so. If you have those photographs, that'd be great yeah, oh sure, I do I, do and I sent them to mastin, but I can resend, okay and Madison. If you could send them on to nelly. Thank you Mastin or Gary. Did you ever? We have several calls into several agencies on the zoning questions we talked about. Did you find out anything more so I'm getting about every third word, but are you talking? Did you mention zoning? Yes, yeah, the receiving of the hotel, the zoning where you're going to be placing yeah as to whether a roll of cover is permitted under the zoning laws out front and does it increase the floor area ratio or not? It's a considered interior space. If it's permanently enclosed, again hearing only pieces, the short answer is no I have not been able to find out from a zoning perspective, if that is an issue in particular out front, I. Think the out the second terror second floor. Terrorist is okay, but you did raise a good point that out front. Does that create an issue? My understanding, of course, is no, but still working on confirmation. Okay, Chris christine the issue we have- and maybe you remember, is you know all these hotels had to be built with this setback that we do not like, but those are quiet. So my question was: if you put a roller cover thing in that setback, space I remember, does that somehow contravene right. I, remember that but I have a few factual questions, I, I'm not sure I'm following the application. So on the page, which is essentially three of nine, which is where you showed the different spaces and the capacity and it's all very helpful now when I get to the hours, it does not look like you have answered the question: can you take us through that on the space floor, lobby, public space, dining kitchen? Is that open 24 hours a day? Maybe gary? You can answer that because, obviously, last time, what space are you referring to so in Ins Indoor, the dining space, the intent is to be open from six A.M, serving breakfast lunch and dinner from six A.M until two A.M, the bar being open until 2 A.M, that's the interior space, okay and all right. So now I'm looking at the enclosed outdoor arcade, slash dining space right first question is on this one you are going to put an enclosed. You are going to enclose it or not. The intent is to use this roller cover for more for weather than anything else. Okay, so this one will have the world cover. All the times, not just yes, perfect time, okay, that's correct, and then what are the hours on this guy? So this but not closed all the time, correct, Gary! Well, it's it! This is the entrance to the hotel. So the area this space is obviously open. It's not it's never going to be locked. It's the entrance to the hotel. The activity in the seating area of this outdoor space is to have it available until until probably wait, 10 pm, we are still confused about the definition of this space. When you say it's enclosed our door. What does that mean? The space is enclosed because of just for weather, so that people can sit there and enjoy a container. It goes to the outside. That's the entrance right! That's how people will enter the hotel through this space. They will enter through this space, so it's itself will be covered yes and there will be, and there will be glass or windows or whatever in the front right. Yes, okay, wait! Yeah! Now I'm not confused. I thought this was a roller covered space. It is so is the roller cover going to be kept permanently closed. On the first floor on the fir on the first floor, I believe the plan is to keep it permanently closed. Yes, so we'll just put that down as a deal. Okay, yes, now the hours of that space is from where to where. If it's the entrance, it has to be 24 hours right, yes, but to be able to serve food and drink in there we have to post hours. So you can't. We can not be sir having people sitting out there to serve food in all at all hours. Our intent is to close that area to serving food and alcohol at 10 p.m. Okay, so, therefore, the operation is 24 7, but the food and drinks is from when to when win well from 6 am because technically breakfast starts at 6 A.M, so people want to eat out there, so 6 A.M until 10 p.m. Okay, so that's the food and drink part of it got it. Okay, I'm getting closer here now, public space for dining interior I. Think I'm getting that. But what are the hours on this? Guy first level, you're talking second level second level again: 6 am until 2 am interior inside okay, all right and then now we come to number two second level public space for dining, and that's where you just told us that the terrace would be with roller cover during the win winter, but would be essentially open during the summer. Yes kind of okay got it. So what are the hours of operation of that space? So we would. We would ideally like to have that with the same hours of operation as the indoor space, so from 6 A.M to 2 A.M. However, we're willing to concede on the hours of the outdoor space if it's an issue. So if we have to concede down to midnight or 10 P.M, then that's what we'll do okay, so you would be ready to take the same hours that are available currently in our sidewalk cafe, which is 10 and 11. I we would I mean. Ideally, we would like to be able to use the second floor longer. But if it's an issue, then we go with the same hour. We understand that so 10 and 11. Okay and the other floors, we do not care really about it. So now. Thank you, I'm much clearer. This is much clearer now yeah the entrance christine is all these hotels, yeah they'll have like tables and chairs out there for coffee or whatever they're serving, but it's the entrance of the hotel. Yeah people walk right through the difference. Here is they're having a cover so can I interject something here, burt the way, I understand it in the front. What I call the the front? Arcade dining area? That's got a roller cover, but it does not cover the entire frontage. It covers about two-thirds of the entire frontage. The entrance to the hotel does not go through the roller cover. It goes to the right side of the roller coaster. Oh yeah I got it. Oh okay, so it's not right down the middle yeah I got it. So this is on one side and the other side got it yeah. You can see that on the floor plan, okay I do not have the floor plan in front of me thanks. So it looks to me that if I, if I summarize, that it looks to me that the open issues is, you know whether well, whether it is open the whole time and whether what are the hours of operation when it's open and I think we are on level two because I think on level one. We do not care too much about that, and then we have an issue about vestibule, where you say you are going to have a vestibule if you have a vegetable and if it's on your property line, it's fine, but if it's on the site, where is the vestibule Gary, the Vestibule christine? Is that I think it's that little area you see where the do? You have the floor plan? No I. Do not I'm not looking at that right now, oh okay, so the door from the street goes into this area, a small area that seems to have three doors, opening from it and going various yeah, but they are saying storm and closure, so I do not think they are going to have a storm enclosure right. I do not know the answer to that. Looking at the blueprints here, if I was facing the hotel and sixth avenue is to my right, the entrance is pushed back and then once you go through those three doors, there is a little vestibule and then it's sort of kind of on a 90 degree angle. It's where you have these like glass doors that open and close. No, that's what so I think I think as a stipulation, you may want to say that it's the storm enclosure only on their own property or something like that. You know that sounds good. Given this design, that's where it would be well, that's it I mean you know it's christine. The other issue is music in the roller cover spaces. I believe we have only recommended approval of places with roller covers that were on the low level permanently closed, no music, 10 and 11, and even the doors had to be closed at 10 and 11. You know to keep the music from inside getting out to the roller cover space. Yeah I personally think that first and second floor music are, you know, problematic, even having an open space is not consistent with our guidelines or where we are concerned, but so yeah this is math and I was you know, I I'm joining by phone here seems I. Think everyone can hear me and certainly understand your concern, but the you know, respectfully. The studies show that the sound just is not an issue, so you know that being said, you know I think I, think it's a little or another good term, but but I think it certainly would be appropriate to allow some music to at least you know recorded background in the spaces. If the sound studies do permit that type of sound right but faster as we've as we talked with you I guess it was last month at least my concern is that you know I have not been able to. We have not had one of these in the district yet to know if how well they work right and what we do know, because this terrace is in one of those you know doughnut oil spaces where sound bounces around. We do know they're problematic without a roller cover, so we you know we're being cautious and I guess what my personal view would be that we, you know you have the usual steps we've been asking for and if it turns out that the thing works well, if you come back and we can modify them, okay, yeah I mean again. That's just my that's just my view, so you would say Frank that the music is only when the roller cover is on I would say they're all my vote would be the roller coaster's going to be closed. All the time, there's never music, at least in the second floor. Space roller cover space and that space is evacuated is empty at 10 and 11. right, which is what we did with last month's hotel and I've done as far as I know. With all of the recent second floor, recent rear yard, terraces yeah, I'm in agreement with that, at least at least. Initially they could come back if necessary once they open, I, agree, hey I just want to add a few things in here: real quick guys. If it's okay, looking at the building, granted it's their plaza and it's pushed back but to the right adjacent, that's still a residential tower right there and yeah. You could do sounds from inside great, but if they're still I mean from the way that the blueprints are showing okay, you have got a glass wall in okay, first of all, when the designs are submitted, having them like not finalized and shaded is sort of kind of a bad education to us. You know we'd like to see things that are, you know, set in stone pretty much, so we could say: hey do this, do that it looks like the shelter around. It looks like that's actually, a permanent wall, the enclosure for the Exterior arcade, and then you've got an emergency exit which is right by where your delivery area is now in between the restaurant on your first floor level and that enclosed area is actually a glass sliding wall. So if that is not open, if we could have it where there is like no music or nothing playing when that wall is open between the two, if there's going to be any opening at all and then, if you're, looking at the building that Northwest corner there's all residential in that corner, and even though it's second floor you're going to have people looking out their corner hearing that seeing that, so, if we could, as everyone suggested, have a permanent roll down, also have no music out there at all. Okay, I'm done well, you know, I again, you know respectfully we're willing to you know. I think agreed to be because this is a new sort of concept to test it out for at least a year come back if everything works well and hopefully be afforded. Some opportunity to you know expand whether it's you know open the roller cover during certain hours or what have you in accordance, of course, with the sound study that shows that the sound is not an issue, but so I think we're willing to do that as far as restrictions out front, you know again, it's really that in particular is not that I and Al I mean if you could elaborate a little bit about I. My understanding is that the sound out front is even less of an issue that even the roller cover really itself is not required at all. It's more. You know that the applicant would like to use it to provide shelter from the weather. Okay. First of all, it's my understanding that the roller cover would be closed in the front, the arcade in the front arcade. On the first floor, however, if the same limitations to music are applied as I've recommended for the second floor, rear terrace in both places, music and voices will not be an issue for anyone on 24th street, on the north or south side of 24th street or in any of the buildings. In the back on 25th street, and the reason for that is that, first of all, you have to understand that the roller cover is not the same as an open terrace, it's very different when the roller cover is open, it's not all open, it's actually less than 50 percent open because of the way in this particular design, the top slide the panel slide and telescope, and because of that, when Sound goes through an opening and then expands into a larger opening, the sound is reduced automatically by half immediately now. I do not want to interrupt, but it's getting late, I think they've agreed to keep it closed, so I do not think we need to talk about sound when it's open or partially okay. Well, in that case, just let me remind you that the study showed that open or closed if the music is kept at a background level which I've defined as 80dbc measured three feet from any speaker. There is no issue with it open and certainly not with it closed. If you look, you'll see it's below the ambient level with the music as well in the nearest residential window. As well as way below, with it closed way below so there's no question, that'll be no problem for interior music, especially if it's closed, okay and I think the most likely yeah. So members would you would you be willing to take a little bit of a chance and allow background music in the area while it remains closed? I would definitely please and I think if we say that it's enclosed, even though I understand it's a roller thing instead of a wall and they are going to respect those hours, and we may want to say also that the music certainly stopped at 10 and 11. I think there is some space for experimenting with. On the on the first floor, giving the music I do not know about the second, because the second floor has so much exposure to residential. That I would not want to take the risk of there. I just have a question to my fellow committee members and you know, as I'm trying to learn. This did did not we vote on something very similar last month and we voted that there was no music and speakers had to be facing internally and the roller cover had to be closed. The entire time right, yep correct that was a high. Was that yeah right now, that's what that was highest. 20 high 24th street and yeah I was the 42nd, but then also where are all the where is there was a whole group or earlier there was a whole group of residents who came and we are very agitated about it. So where are they agitated about this application? No, it was not about this application christine, oh, no, I'm confusing! I'm sorry! This is like the third hotel in three months, yeah Kerry, Answer, question I, believe the applicant has agreed to basically everything that the applicant last month did. The one thing being discussed is that this applicant has a first floor front. Roller cover space, which last month's applicant did not so in some sense that there is not direct precedent for that, because I think the issues are a little different when it's on the first floor and in the front so I think the open question is whether we want to allow them to have background music in the front first floor roller cover space. So we agree that the second floor will have sort of the same stipulations as the previous application that we heard and sorry could you just tell me what the hours are again for the for the ground floor. I'm sorry, yeah, the the roller cover space is 6 A.M to 10 p.m, and then the internal first floor. Lobby dining is 6 A.M to 2 A.M. That is way too long. Can you imagine waking up on a Sunday or Saturday at 6 A.M with people out there and you're residential? You do not want to hear that this is the lobby. Well, you won't. You won't know. This is a Rob. This is the lobby. I mean people are going to go in and get oh I thought you meant the second floor in the bathroom. Sorry we're talking about that right. I mean I'm well you're, not I'm yeah, I'm good with the background music. On the first floor, yeah from six to ten and eleven on weekends, our standard hours could I just interject for some I wanna tell you something you were mentioning about the the hyatt hotel in my report. I just pulled that up. Perhaps the reason why everything was supposed to stay closed, because in my report I said everything has to stay closed on, that roller cover. I have two charts both show closed roller cover and I'm reading from the report. The roller cover top and sides will remain closed. Just wanted to clarify that yeah. It's different. It's different from this job, a different situation, but we've also. This is probably our fifth roller cover, so it's it may be our fifth roller cover, but none of them are in operation. So we have no track record right yeah, which is why we with the with the 24th street we did in my opinion. You know try to really be a reasonable with the exceptionally reasonable, with the with the members and the and the committee and agreed to no music outside, even though with the eight speakers. This start. The study shows with the eight speakers. It still was fine, but we want to be a good neighbor and not you know and work this out. So I understand there was precedent, but we intentionally like said okay, you know we work together. Yeah we got ta, try to frank where any background, music or no music in the first front row of cover space. Where are you from really on the fence? I guess you know I, I'm hearing Rob's concern. You know, part of me thinks it's on the sidewalk facing the street, but I'm hearing Rob's concerns. So you know, and particularly with it, opening at 6:00 A.M. You know if the road cover, for whatever reason does not work. It has a potential to be disruptive but well if it does not work, we're going to hear about it very quickly yeah. So let me let me float a motion. I'll do emotion based on what Frank said, which is new everything we have said before and then no music on the first floor, and could we get a sense of the committee here? I would I yeah no music anyway, yeah I had music on the background music. On that first floor, me too, I have no problem with that. I'd be fine with that yeah. I'm with you did you just say: you'd, be fine with background music in the first year in the front of the building, I'll be fine with it, but I would prefer reduced hours. But that's just me. Okay, all right and remember, right street is another hotel. So let's do a motion about that. Okay, we're waiting for buildings right there and the residential building is to the east facing sixth avenue. The entrance is on 24th street I. Think we got it. Let's do a movie, okay, I think I. Think I got to read this and master. You can have me right. I want to make sure you agree. Yeah I can hear you okay, so these are the additional steps. Any storm, including will be placed only on private property. The two outdoor terrace spaces will be completely enclosed on roof, and all sides with roller covers roller covers will be kept closed at all times. There'll be no speakers and no music or amplified sound of any kind in second floor. Roller cover enclosed terrace space in first floor terrace, enclosed roller cover space. There will be background. Music only applicant agrees to implement all recommendations of revised acoust of a crystallog report and all doors and windows. Opening to roll cover and closed terrace spaces will be kept closed after 10 P.M Sunday to Thursday at 11, P.M, Friday and Saturday, and then on the step form and Madison. If you could do a revised version of that page, three, that's the chart of every space, okay, so and Gary. We went through this with Gary, so the in the hours column we want the hours for food and drink and what Gary told us was the lobby. Indoor lobby on first floor is six A.M to two A.M the first floor. Arcade Roller cover space is 6 A.M to 10 p.m. Both of those have background music, the second floor, dining interior is six A.M to two A.M and the second floor. Roller covered terrace is 6 A.M to 10, P.M or 11 P.M on weekends, with no music, okay and then on page four. Just to be consistent, we want to answer yes to the questions that say: you'll keep all the french doors and such clothes whenever there's amplified music inside or after 10 and 11. Okay, all right was the best real, quick Frank. Did you say hello hold on wrong. Ryan is talking I'm sorry yeah. Did you say that the back patio opens at 6 A.M? That's what they asked for I! Think that's too early with the residents. Okay, nine yeah! But it's going to be closed. It's going to be closed with the roll of cover, but it does not matter if you're still going to get noise bleed off no matter what a bunch of people out there eating in the morning hold on Gary. Are you? Is that okay? If we make yes, absolutely that if you, if you need 9 A.M, we'll go with 9:00 A.M, that's not right! Gary! Thank you, Rob did you have something else, so were you going to make that same plate? No I just wanted I, know speakers and outside sounds I was just qualifying that by saying no monitors or no monitors with sound like watching the game. Oh TV monitors he's saying outside so you want to say, music, slash, sound I, do not know okay, but we said no speakers and no music or amplified sound of any kind. I think that covers TV screens. Okay, I want to make a motion. Second, wait. Let's hear her motion first yeah and the motion is everything that Frank Jones: yes, she's, okay and mastin you and Gary you're, okay, with everything. I read: yes, sir okay, so we have a motion and a second all in favor, aye opposed, nay, and one opposed abstaining present, not eligible I think we did it, that's right, all right and Gary and mastin. If you could get us that new chart by November 23rd. Oh absolutely, okay, get that here this week, I think we do I hear a motion to adjourn. Yes, no one wants to talk about outdoor dining. Yes, we just need to do the form right. Nearly right, yeah I was kidding all right thanks. Thank you, everyone. Thank you good night. Everyone.",
            "summary": "This committee hears applications for liquor licenses and sidewalk cafes.\nYes, the applicant for 164, ninth avenue, milk and hops, or here Brian Frederick, says Attorney, okay.\nWe get to the committee, I just want to clarify some things about your the stipulation form on the first page, you said, you're, not making any operational changes, but I think to be clear.\nI, looked at your prior form and the occupancy numbers on page two were very different on the the original application.\nYou said no to the question about whether you'd close doors and windows when there's music inside right.\nWe would not want that because of the people that live above this building, so we comply with sound and any calls or anything related to that have not happened because we keep it within the indoor space.\nYou know how the how the committee feels about that when we, when we discuss it and then the last thing which I think is also just a wording, thing, there's a question about whether you're going to have a canopy.\nI'm trying to find out, because this did not look like a change that it is and one of the things I was going to say.\nOkay, I think you know.\nYes, we're looking for a full on-premise license, but not to the extent of a bar with multi-level top shelf, a few bottles of wine for any person that wants to have a glass plus a few to sell and a small cocktail menu I.E that mixed drinks that we already set plus.\nNo I, just I think that the community does not know this based on the application.\nDo not think they reached out to anyone and the application says that it's a much smaller place and obviously if their certificate of occupancy was what it should be.\nI, wonder if people think it's a smaller place and just like to see.\nI apologize, I believe that I sent an email to everyone that was included on the list to reach out to to the extent additional outreach is necessary and to learn more about the plans.\nYes, okay, so the number of tables on the application is wrong as well.\nYou know you do not get a license based on Covid-19 number.\nOur actual occupancy is like stated before, but with outdoor dining people can come, walk up to the bar and purchase a drink from the bartender and then walk back out to their seats, and so with the to go aspect, we have fridges with beer cans as well.\nOkay, understood so and going back to a point that I, missed and I do not mean to hold everyone up here, but is it the suggestion of the community board that a beer and wine license would be more agreeable as opposed to a license, a full of full license with spirits as well.\nYou know like I could not tell if Inga, who was a committee member who lives who lives, hey, bro can I say: something.\nI every time I pass by during the summertime when they've had their like doors, open, I've, never heard any music leading out and I go by there.\nAnd I also will point out that Rob's one of our bigger enforcers of doors and windows being opened with music flaring out.\nIt was interesting to hear that from him like Brian as his hand, yeah I just wanted to echo what what Rob said.\nWe need the occupancy and they just need to know that the doors have to be closed when there's music on, because when you add hard liquor, it's going to get louder.\nI would default to the usual, but personally, I've never heard any music larry coming out of them at all, and they said it was on when the doors open, which is really unusual, and I'm.\nYou know they have music going on in the bar.\nAre you, okay, with that agreeing to the changing your answer to the stip, about keeping the doors and windows closed when his music and then and sorry.\nThat's the goal, and if you do not, if no one hears music on the sidewalk or across the street, people are not going to complain about it.\nYou know right, you can manage it to keep the music off the sidewalk that that's the goal.\nOkay, so also right, okay, I think we're going to have a motion for the full liquor.\nWe are applying for a wine beer and liquor license for a new hotel called Pistana Cr7 located on 39th between 8th and 9th avenue.\nSee, that your form says no outdoor space, but I see on the floor plan that there's a something called outdoor patio, I.\nSo if and when that space ever was open to use by hotel guests or our customers, we would of course go through.\nYou, know, frank and the proper channels to make sure we updated the application, but as of now, guests are not even permitted on that outdoor space, let alone to eat or drink.\nFrank, please feel free to chime in, but the space is still actually being built, so the floor plan as in the positioning and the number of seats at these small tables might have to change ever so slightly the floor plan that we have that you're looking at.\nI just want to say: I, do not have a split screen, so committee people, you're, going to have to be very.\nOne is about the hours your kitchen is going to close at 11 pm, even though you are doing room, service, I would have expected that it would last much more and then the operation and the music continues until 2.\nI noticed on the plans that you've got a meeting space event space you're not going to have any promoters come in or do any special events that might be like dj or lounge, music or any impersonators, or anything like that.\nAnd I think we can all use a little more green, so, okay, thank you.\nThen they are actually putting a lot of trees back there just to make it visually appealing, because you can see the patio area from our interior dining space.\nFrank, we're changing the kitchen closing hours to 2 A.M across the board and then just to sort of confirm what we've been hearing about.\nWe'll have two additional steps: there'll, be no use of outdoor patio by members of the public and there'll be no music or speakers in outdoor space.\nThere's, a few issues, with some applicants being able to join I'm, trying to figure it out hold on one second, here.\nLicense application for Lotus Manhattan co-op they'll be doing business as the Goat House, located at 857, 9th avenue between West 55Th and West 56Th street, and the premise formerly known as Kilo.\nWith a restaurant wine license the applicants owned and managed La Pocaria at 1626 Second Avenue, with an on-premise liquor license until it closed in December 2019.\nThe applicants did come before you in September 2020 for their other restaurant at 623, 9th avenue and were approved for an on-premise license.\nIt's, not just that it has a different name, but the the awning on the Side Street also says South american wine bar or something like that really suggests it's a separate place, so if they could just make all the signage consistent, so it does not look like the concerns we've been hearing from the community.\nHe is the owner and does the ultimate landlord have any rights to approve or veto sublises, not for what I'm reading, but the pima did notify the landlord about a month ago that they had a new tenant coming in and Pima has not heard back from the landlord.\nBecause I guess nelly had a communication from a lawyer today, we're not quite sure for whom indicated that the landlord might have objections to a full liquor license in this space that maybe someone will speak in the public session, but that's sort of all.\nAnd I know that next door there is rise, but they also had the same issue and they did a lot of sound attenuation.\nThe quality of life for the residents, because I think it's also just like a different, whereas like a wine bar, is a little bit calmer, but a liquor license might not, and it's also I'm a little bit concerned.\nAfter hearing what Michael Kelly had said about the applicant that they were not, they did not fully comply with the stipulations of their previous approval and also looking at their previous restaurant.\nYou know when you were speaking earlier about providing a stipulation that the new sub-tenant in that space keep those windows shut to me, I'm a little wary of that as a stipulation for the following reason.\nWhen I ask I, do not want to have to live my life, you know going downstairs and asking them to shut those windows.\nHi, I'm, also a shareholder in the building, I'm on the board, I'm Secretary of the board, I'm, probably just going to reiterate basically what everyone else said: I do live on the side of the building where the air shaft is where the window is always open for Kilo and the noise just echoes so loud.\nMike said we have ryze right next to us, which is just insane amounts of people just like sitting on the floor.\nSeriously, and you know obviously, there's been also food safety issues with is another space that is also released by by Pima.\nOur function is here to hear applications for liquor licenses, but we strongly suggest before we go ahead with this, that you guys get together and talk some more I'd like to make another suggestion before they go.\nYou look like you've got enough space to have an internal vestibule.\nHe has known at 161 West 72nd street, since 2019 has an on premise: liquor, license Miss known 75, 9th avenue from October 2017 to present cream line, same location, Chelsea, music, hall, same location and also ball gonzo at 511, 9th Avenue.\nThat I know no one's showing up on my paperwork, because it's the okay, yes, because the reason I ask is bar gonzo.\nI. Do not think the mall knows if they're open, enough.\nOkay, so the mall wants to stay open later in the future.\nI do care right, but I just wanted to clarify that they're planning to stay open, later.\nFolks, is that he is a member of Brooklyn community board one's liquor, licensing committees and he has been for many years.\nHe knows exactly what you all go through every month with liquor license applications, and he knows the types of concerns that you have and if any of you think that your job is tough, spend the night at Brooklyn community board one's liquor, licensing committee as I have done, which is.\nIf you look at the Broadway theater experience, you want to go out, you know for dinner and a show on Broadway, generally you're, going to a restaurant somewhere else.\nOne of the things you've agreed to is all shows are going to end an hour before the closing time of the venue.\nIt's not even like everyone leaving is going to necessarily end up on the same sidewalk or even the same street avenue or you could take the breezeway through straight to 10.\nSo, the tables outside what are the hours for those, because you've got the eugene right across the way, which is residential, good call.\nThat's, going to be associated with the cafe generally for daytime use, we'll close that outdoor seating, area.\nWe are now talking about after the recovery right when everybody start to make money again whether we could have some opportunities to invite some underserved people from schools from the neighborhood and get them to you know attend some of those representation.\nIf you're going to be a restaurant with the theater with background music, maybe in the restaurant and good question.\nOh okay, right next door to ours, they're in the loft building, which I believe is like 424 or 436.\nOne thing that I do want to point out, because I know that it's a touchy subject for this committee is that we would like to replace the carriage door, which is now a closed glass.\nOkay, you x'd out, live music, but you know, given that you're talking about having live, performance.\nWe going to be a you know, an open, Mic kind of a cafe law type thing.\nOkay, I just did not know if you were from Seattle or where were you coming, from.\nThis is an application for a hotel license full on premise: liquor.\nIt's an outdoor space that will have a roll of cover, but the roller cover is intended more for weather, as opposed to sound because as I think Al will talk about.\nOr I can turn it over to Al. On the second floor, terrace, are you saying you are going to keep the roller cover closed.\nWe would like to have that space on the second floor be available to be open during the nice weather, season.\nOkay, no I, think photographs are good, I mean looking at.\nMy question was, if you put a roller cover thing in that setback, space, I remember, does that somehow contravene right.\nIt does not look like you have answered the question: Can you take us through that on the space floor, lobby, public, space, dining kitchen.\nOkay, so, therefore, the operation is 24 7, but the food and drinks is from when to when win well from 6 am because technically breakfast starts at 6 A.M, so people want to eat out there.\nOkay, I'm, getting closer here: now, public space for dining interior.\nThen now we come to number two second level public space for dining, and that's where you just told us that the terrace would be with roller cover during the win winter, but would be essentially open during the summer.\nIt's, where you have these like glass doors that open and close.\nI believe we have only recommended approval of places with roller covers that were on the low level permanently closed, no music, 10 and 11, and even the doors had to be closed at 10 and 11.\nYou know to keep the music from inside getting out to the roller cover.\nYeah I personally think that first and second floor music, are, you know, problematic, even having an open space is not consistent with our guidelines or where we are concerned, but.\nBut I think it certainly would be appropriate to allow some music to at least you know, recorded background in the spaces.\nIf that is not open, if we could have it where there is like no music or nothing playing when that wall is open between the two, if there's going to be any opening at all.\nYou're going to have people looking out their corner hearing that seeing that, so, if we could, as everyone suggested, have a permanent roll down, also have no music out there at all.\nYou know that the applicant would like to use it to provide shelter from the weather.\nI think they've agreed to keep it closed, so I do not think we need to talk about sound when it's open or partially okay.\nAnd, they are going to respect those hours, and we may want to say also that the music certainly stopped at 10 and 11.\nI just have a question to my fellow committee members and you know, as I'm trying to learn.\nRoller cover space, which last month's applicant did not so in some sense that there is not direct precedent for that, because I think the issues are a little different when it's on the first floor and in the front.\nThink the open question is whether we want to allow them to have background music.\nIn the front first floor, roller cover space.\nYeah, the the roller cover space is 6 A.M to 10 p.m, and then the internal first floor.\nYou know: try to really be a reasonable with the exceptionally reasonable, with the with the members and the and the committee and agreed to no music outside, even though, with the eight speakers.\nIt still was fine, but we want to be a good neighbor and not you know and work.\nYou know, part of me thinks it's on the sidewalk facing the street, but.\nArcade Roller cover space is 6 A.M to 10 p.m. Both of those have background music.\nWe want to answer yes to the questions that say: you'll, keep all the french doors and such clothes whenever there's amplified music inside or after 10 and 11.\nSo you want to say, music, slash, sound I, do not know okay."
        }
    }
}