{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCFr3sz2t3bDp6Cux08B93KQ",
            "title": "MCB4 October 2020 Transportation Committee",
            "publishDate": "2020-10-26",
            "shortDescription": "Wednesday\\nOctober 21, 2020\\n\\nAGENDA\\n\\n    1. Presentation: Department of Transportation to Present on Citi Bike Expansion and Infill\\n\\n    2. Committee Discussion/Vote: Pier 79 Ferry Expansion\\n\\n    3. Committee Discussion: Sidewalk Maintenance\\n\\n    4.  Discussion: Bike Safety on 8th Avenue\\n\\n    5.   Committee Discussion: The Improving Helicopter Safety Act of 2019\\n\\n    6.  Committee Discussion/Vote: Statement of District Needs and Budget     \\n          Requests\\n\\n    7.  Old/New Business",
            "lengthSeconds": "2:58:48"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "ofiPj8zrqtU",
            "fillerWordCount": {
                "uh": 331,
                "um": 629
            },
            "readTimeFullTranscript": "108 min read",
            "readTimeSummary": "15 min read",
            "wordCountFullTranscript": {
                "bike": 94,
                "street": 72,
                "sidewalk": 43,
                "parking": 41,
                "block": 39,
                "thanks": 36,
                "bikes": 36,
                "system": 35,
                "stations": 35,
                "lane": 32
            },
            "wordCountSummary": {
                "bike": 23,
                "street": 18,
                "sidewalk": 14,
                "bikes": 12,
                "cars": 12,
                "parking": 11,
                "lane": 10,
                "stations": 8,
                "space": 7,
                "program": 6
            },
            "fullTranscript": "So hi everyone Dale Corvino co- chair of Manhattan, community ward, 4 transportation, planning committee. This is our regular October meeting we're going to follow the agenda. That's been posted and also make time for all the new business. Afterwards. This meeting is a public meeting. It's been recorded and transcribed all right, so we're going to go over the agenda items and just a reminder to how it works. The committee will have a discussion and we'll open it up for comments from the public. We also have a presentation tonight from the DOT, which I think is first up, so I'm just going to go around just for speed sake. I'm just going to go around and mention all the committee members that are present. We have. We have janine from Cb4's office who's, our facilitator. We have Gwen Billig Jeffrey Lefrancois. We have Brett firfer. We have christine bertay the co- chair. We have David Warren, we have David Solnick, we have Martin treat. We have Raksha Muth, I'm going to butcher your last name, Raksha Muthu Kumar. Now we have Sarah Appleton and I do not see any other current members. Oh pete, right Dts is your altar: okay, so as they filter and we have colleen chatter goon from D.O.T, and we have a couple of other presenters from D.O.T, okay, so first item on the agenda, let me get the agenda is dot's presentation on CitiBike expansion and infill in our district. So Colleen are you leading that hi? My colleagues will be leading that? Okay? Oh here's, the presentation! Thank you! Janine! Thanks to me, janine and thanks dale. If we're ready to go, I I'd be happy to kick it off by all means. Thank you Jennifer and if you could just introduce yourself and your colleagues absolutely hi everyone good evening, I'm Jennifer Santenez, I'm Dot's Manhattan deputy borough. Commissioner, I wanted to thank Community Board for Jessie Dale, Janine and committee members for having us on tonight. I'm joined by my colleagues, lily, Gordon Covid-19, Brian, Parrott and Caitlin Toner from Dot's bike share program as well as Colleen chatter goon from the Manhattan office, who many of you also have the pleasure of working with so last year, DOT embarked on our five- year phase three CitiBike expansion alongside our partner lifts, and this is going to double the size of the bikeshare system, triple the number of available bikes in the program and since CitiBike launched in 2013, new yorkers and visitors have turned time and again to the CitiBike system as a healthy, safe, fast and affordable transportation alternative and, as the city continues to reopen now in a Covid-19 world. We believe that bike share will play a critical role in getting people around the city and back to work so phase. Three expansion in Manhattan started this spring and I will let you know lily, go into a little bit more detail into what we've done so far, but as the bikeshare system grows into new neighborhoods ridership into the existing service area is going to grow as well. So, in order to support the demands of a larger system, we're going to add what we're calling infill capacity into CB4. So I wanted to thank the committee again for giving us the opportunity to present- and at this point, I'd like to hand it off to Lilly from the bikeshare team to walk us through tonight's slides. Thank you thanks Jennifer and thanks again for having us. As Jennifer said, my name is lily. Gordon Covid-19 and I'm with the bike share group at DOT. So we can go to the and the thanks. So, as many of you are familiar, CitiBike is our largest bike share system in north America. It's a network of shared bicycles intended for point-, to-, point transportation, and it offers increased mobility and convenience really just adding to the suite of transportation options that new Yorkers have. The system operates, 24 7 and you do not need to worry about bike, storage or maintenance, which is a huge plus in New York, where we have such limited space in the system is a public private partnership between the city of New York. The DOT is responsible for planning, outreach and oversight, and our partners at Lyft are responsible for day- to- day operations, equipment and maintenance. Please, as Jennifer mentioned, the system has grown since launch we launched in 2013 with about 6,000 bikes at 330 stations in Manhattan and and downtown Brooklyn, and then expanded beginning in 2015 farther uptown and into Queens and deeper into Brooklyn, with 12,000 bikes at 750 stations and we're now in the midst of our largest expansion, what we call phase three, which will cover the entirety of Manhattan, bring us into the Bronx for the first time and deeper into Brooklyn and Queens, adding about 35 square miles to the program. Please again, as Jennifer mentioned, the system has been hugely successful. We have over 107 million trips to date and the bikes are used on average about five and a half times per day, so that it's a really heavily utilized system. We see about 70,000 trips in per day in peak riding months and over 90,000 trips, sometimes over 100,000 trips, on our busiest days in the summer spring summer and fall. We have over 170,000 annual members. So while we know there are a lot of tourists and visitors that use CitiBike, it's also the program is really grounded by by annual members by who are mostly New, York New Yorkers, please so Colvin 19 has obviously impacted every part of the city and CitiBike is no exception. D.O.T and Lyft's response has really been to prioritize rider and employee safety. So we've done a couple of things. The first is cleaning high contact areas on all the bikes when they're returned to the depots. These include seat posts and handlebars baskets things like that, as well as disinfecting bikes when they're docked at high use stations near hospitals and the crews are using social distance practices in the field and while handling bikes and then the other key piece is the critical workforce membership program which began in March, where Lyft and in partnership with the city was able to offer free member annual memberships to essential workers. So we had about 20,000, essential workers sign up for that program and start using CitiBike as a safe and healthy way to commute during the pandemic. Please- and you can go to the so I'm going to talk a bit more about expansion and infill phase. Three is composed of these two pieces. Expansion and infill and expansion is when we bring CitiBike to new parts of the city and double the geographic size of the system, so we'll be adding about 32,000 docks and 16,000 bicycles in the dark blue area, which is about 35 square miles on the map. Infill is where we add new, add additional capacity to the existing service area, which you can see in gray, on the map we'll be adding about 16,000 docks and 8,000 bicycles in the 33 square miles that already contain almost 30,000 docks. So why is infill part of the phase? 3 expansion as a CitiBike grows? The system will draw more bicycles to its core, so CitiBike rider gravity, as we call it pulls bicycles to the centers, which is similar to other transit modes. Riders, move towards the central business districts and demand for bike shifts throughout the day. Just like subway demand looks different in the morning going into Manhattan and then switches in the evening. So info will help a larger system to function. This will support increased demand from the phase three service areas, folks on the outer part of the system coming in as well as help us meet existing unmet demand when riders can't find a bike or a dock in the core. Already, this will help us improve rebalancing and overall system operations, keeping the system as efficient and useful for riders as possible. So a bit about our timeline. Unlike the expansion process, infill, it's going to work a little bit differently, so doc distribution will be based on writer, demand for more capacity and we're really trying to be responsive to the trends we see in rider data. It's going to be a four year, ongoing rollout of new stations and expanded stations and the areas of highest demand will receive the most stocks. So, as I said, it will be a rolling installation and we will be covering multiple community boards at one time coming back to community boards over the course of the following years, and the iterative planning process will help us address changes in demand. As the system expands, so we can be really responsive and as efficient as possible. Please we have a few different ways that we want to do this infill project through our design toolbox, so the first is to add new stations, and the second is to expand existing stations by adding new docks to stations that are already on the ground and then the third is creative design solutions like 3d bridging which you can see here on in this photo, which will allow us to have stations that are both on the sidewalk and road bed. So, right now we can have stations that are on the road bed or stations on the sidewalk, but we do not have the ability to sort of jump. The curb you can see the yellow piping and this photo is an example of what we hope to do with 3d bridging, which will help us be more efficient with space. So the planning process is going to be a bit different from the expansion planning process. We are looking for community feedback on an iterative basis. We have an online feedback portal which has almost 900 comments to date in the service area. Folks telling us where they'd like to see more capacity and we're also responding to requests from riders and stakeholders throughout the service area. We do pretty detailed station citing, so we use ridership data along with technical, citing criteria to identify feasible locations for expanded and new stations. Then we have our community notification process where we notify property owners adjacent to newer expanded stations, notify the Community board and key stakeholders prior to installation, we'll be installing new and expanded stations and conducting ongoing monitoring and responding to any concerns that come up. So I'm going to walk through the new stations we're proposing for community this community board. We have five new stations which you can see in the blue dots on the map. The first news station is on 8Th, Avenue and West 27Th street, which will be on the east side of the street on the sidewalk. The second new station is West, 35Th, Street and Ninth Avenue on the south side of the street in the road bed. We have two new stations on this slide: the first West 44Th Street and 11th avenue on the north side of the street in the road bed and the second West 50Th Street and 10th avenue on the south side of the street in the road bed, and then we have West 54th street and 11th avenue on the north side of the street, also in the road bed. I think that, yes, that concludes the set of new news stations. We're happy to take questions again. Thank you for your time and we'll turn it back to you to. Let us know how you'd like to handle the questions. Thank you lily we'll take. Can you just okay, we'll take questions and comments from the committee members? First. Are there any questions? I do not see do we have any questions? Yes, christine. I have a question: can you expand on the one at 27 and 8, which is on the sidewalk? What is the context there and why is it on the sidewalk sure I'm going to hand it that over to my colleague, Brian Perette, who can speak more about the station specifics sure all right? Thank you very much and thank you for your time. Yeah. The specifics on the station at eighth and 27th that'll be on the sidewalk. It's a pretty small station only about 21 docks, so it's really only going to take out about 60 feet and it's a rather large sidewalk behind fits. I believe it's the Kimmelman center. I might have that wrong though, but it's behind an fit building near one of their loading docks. So why do not you put it in the in the park parking line? That's certainly something we could evaluate. We chose the road bed for that specific location just because it was an extremely large sidewalk and in a specific spot it would preserve metered parking for loading right. But you know whenever you put something on the sidewalk, the people going to the lane, to the parking or from the parking right on the sidewalk, and it's not something we want to encourage, especially because you are just acrosss a large complex with a lot of seniors. So as a rule, we are generally opposed to the sidewalk sighting. For all of those reasons, thanks christine, I think that's noted and Brian just to hop in. If I may, we have been coordinating with the Fip Intergov Group, because I know that there is upcoming construction, we're having these conversations with them, just to ensure that there is not an overlap with their plans for staging along eighth Avenue. But, as Brian said, we could potentially look at. You know whether the road bed adjacent to the site is feasible, but we did identify this location because it was quite a rather wide. You know yeah, but what everybody's missing is. Why does not just the thing is that you know once you have that you have people riding on the sidewalk to get to the station and that's not something we want to encourage and we have in general in our neighborhood we have put always the bike: the parking in the parking lane. We do not need so much parking, we're, especially on the back of that area. There is no need for parking and deliveries, so we really would like very much to put that station in the street bed. That's something we'll evaluate for sure yeah. I think, especially since we've seen with Covid-19 we've seen less compliance rather than more compliance when it comes to sidewalk writing and by the way, a lot of what we did not used to see before a lot of CitiBikes on the sidewalk, which is upsetting so the bottom line is we do not want it on the sidewalk right. It's not janine. I see committee members with their hands raised. Do you see them in the order that they raised them? It shows up that way. Dale. Yes, I believe it's David Sarah, Jeffrey and Brett. Oh, I see it's just it's just I gotcha okay David's up next hi. I agree. I agree with christine with that, but my first of all, thank you all for coming and being here, I have twofold question: one is we need more electric bikes, so hopefully you'll be getting more of more of the electric bikes, and you know I think it's great that you're putting these in the area, especially if you put them on the street, but the thing is: if I, if someone's going to commute, let's say they work in the area but they're commuting from Coney island, these CitiBikes are useless. You still have. That means. If you want to avoid coving, you do not want to go on a subway you're, going to bring in your private motor car. What is your plan for building CitiBikes out in coney island, because I mean it it's just for us in Manhattan and just parts of Brooklyn and a neighborhood here and there thrown in what's your connectivity plan and what and what and like if you, if I'm going to buy from Coney island to my office or to my work, I need electric bikes, so I mean what's going on with all that sure yeah, that's a great question so, first on the electric bike, so Lyft is continuing to add new electric bikes to the fleet. Of course they can go anywhere in the service area, but we're seeing more and more every week and to the point about the expansion. So right now we have our phase. Three expansion, which will bring us to about half of the city's population, will be within the city, the service area. Of course, we will not be getting all the way to kunion with this expansion, but I think you know our long- term goal is to provide alternative transportation options for all new yorkers and something that we're certainly thinking about. How can we reach more people and provide more transportation options, particularly in the time of cobit as possible? But it's a great point something we're constantly thinking about. I think, because of Covid-19, you should really reconsider that and hasten your plan for expansions on both, even if we have to get subsidies from the city or something else, because this is this is the time where we've got to really move on this. It's not like normal times thanks. I hope you consider that or tell your bosses thanks, David, I'm going to move on to the next question, which is from Sarah and by the way I just want to mention. We have a couple of new committee members who have joined us or who recently joined us. Viran and Colin are here as well. Did I miss anyone else on the committee? No okay, so Sarah thanks I'll, be brief. Lily. Everyone thanks for the presentation, just wanted to quickly reiterate what christine said and being opposed to it on the sidewalk, but also just want to offer like a rider perspective. So I love to be bike. I'm a frequent rider, but not only do I think that you know having docks on the sidewalk is dangerous for pedestrians. It's actually a pretty bad rider experience. I do not know if you've heard this on other feedback channels, but for the exact reason that you're either having to dangerously navigate through pedestrians, or I have to actually get off my bike and walk it usually like halfway through a block which is a real pain, so just wanted to also offer that perspective thanks. Sarah next up is Jeffrey just two points. I hope that the committee adopts a letter to fundamentally always oppose any taking of sidewalk space for the purposes of another mode of transit. Besides people on feet, we have lots of roadway that needs to be repurposed and reoriented and, as you've heard from other members, this needs to be prioritized. Not only is it illegal to ride a bike on a sidewalk, putting a CitiBike dock on there prioritizes it Jennifer. I know you've heard me mention this before, because we've talked about it in my professional cap with gansevoort street issues and having a sidewalk station there, but this is significant, given the fact that when the city begins to bustle again, our sidewalk space will be precious and we need to prioritize people as much as possible in terms of their feet and then bikes and then very small space leave for cars. Separate from that, I guess I just wonder what informed the placement and if I missed that I apologize, I did walk off for a second. What informed the placement decision for these specific stations we were looking at, where we had some network gaps and really just like the available space where we could fit stations. I mean, as we mentioned, like infill, is looking to cram more CitiBike into an area, that's already quite dense with CitiBike. We did look at our feedback Portal to see what kind of comments we had received about placement but generally like we were looking at where we had some decent network gaps and where we felt like stations would really address demand. Okay, thank you. I'm really excited about it by the way, but you know pedestrians thanks Jeffrey can I ask committee members who are not speaking to please go on mute, we're having some interference and I'll next recognize. Brett. Thank you. So, while we've got all these stocks going on the street and that this is really a partnership between the city and city Bank, it's not just about CitiBike, it should be about a public amenity. So, right now we know it's not just that ridership for CD bike is up. We also know that bike ownership, especially around here, is up, and you just try to go to a bike store and buy one you'll see the market has driven all the prices up, as I'm biking around a lot more this summer, especially but just in general, getting to a grocery store running errands. One of the big challenges that we have biking around within the city, not just going to the more enjoyable bike, passes, finding a place to lock your bike up. One thing I would be very interested in seeing DOT implementing with this expansion of the CitiBike program is taking another look at the bike stations and seeing, if there's an opportunity that, while we're in the street, where is it, which is a great place to park, bicycles, to incorporate free bike parking racks for nine CitiBikes, so that way, riders that are that are doing one better than CitiBike, which is owning our own bicycles and maintaining them ourselves will also be part of the amenities that are that are happening to us. Has there been any thoughts or discussion towards incorporating non- CitiBike parking stations once we're already going in and taking these parking spaces for bike parking brett thanks. So much for that question, it's a good one, and it's something that the agency has certainly been discussing. You know that there we have city racks right, which are the hoop racks as well as we have our bike corrals, which are typically sleds. That host like four to six of like the U- racks, and we have been talking about potentially installing these types of bike facilities, alongside CitiBike stations or coming up with some other creative solution to, like you said already just you know, firm up that roadway space for cyclists as well. So we'll keep you posted on our plans, but that certainly is an interesting and great idea and something that we've been talking about internally as well. Sorry back to christine. Thank you, Jennifer yeah. I thought about the second question. When you did your expansion, I mean: have you mapped your extension over the profile of poverty and racial profile of the city, East New York? What neighborhoods, which are really underserved, have are going to be served by this expansion? Yeah, that's a great question and I think something that we have been looking at with renewed eyes over the past several months. So one thing that we've seen in the past is that for the system to operate successfully, it has to be contiguous. So we do not want to create an island of service in a place. That's not connected to the rest of the system that will not work for riders and also not work operationally, which of course creates this tension of wanting to serve riders in low- income, communities and communities of color and wanting to reach them as quickly as possible. While going through this sort of arduous slow expansion process, we are, as we expand, looking to conduct as thorough Outreach and engagement in the neighborhoods we're reaching. So this year we reached we're in the south Bronx for the first time and in addition to making sure that we're doing our due diligence and our planning process and providing a service just as good as the one we've been providing in Manhattan, also making sure that we're doing outreach and education around our low- income programs. We have partnerships that provide discounted memberships to NYCHA residents and snack recipients and wanting to make sure folks know that those are available, and also just doing cyclist, cycling, education, so that people understand this is a system that works for me. I can use CitiBike. I can use my own bike. These are the rules of the road, all those kinds of things, so we're looking, I think, at trying to figure out how to maximize those opportunities, how to expand even to folks who are low income, but are not nitro residents or snap recipients and strengthening our partnerships with local community groups and local cycling groups that are already entrenched in their neighborhoods and understand the needs of their constituents. But thank you for that point in question. All right, and now I see David. I see you pete, I'm going to get in the clock, I'm going to go to David First David, Solnick yeah. I would just kind of like to follow up on Brett's suggestion about putting the bike putting bike parking associated with these docking stations. I mean I mean for two reasons. One is you know, sort of reiterating what christine said is when you put bike track on sidewalks, you just send a message independent of the width of the sidewalk. You send a message that bikes are permitted on sidewalks, but the other thing is the bike. Corrals, which are in the streets are not going anywhere because DOT is requiring those to be maintained and insured by private businesses nearby, and you know few want to do that, and so if there was bike parking associated with the docs, presumably the maintenance and insurance would be connected with the docks and not, and it would not require public business private businesses to participate in this. In this you know citywide plan, so you know, there's lots of good reasons why putting bike parking associated with the CitiBike docks would be would be a brilliant idea, and you know particularly considering that your current program for putting him in the street is not viable because of the way it's established been established, thanks, David I'll go to pete and then Colin. Thank you for the presentation. Let me see if I'm on Mute I'm on okay you're out there yeah. Okay. Thank you for the presentation. My my question is regarding the the breaking mechanisms on in the bikes. I had an individual complaint to me, or you mentioned to me that the bikes were not stopping on time, especially when they pressed on the the the the part that stops the bikes or makes an attempt to stop the bikes. I'm not sure if the braking mechanisms are functioning well and I like to know how often these braking mechanisms are checked. Yeah thanks for that question, so the all the bikes are serviced. I think it's at least one once a month. Brian might know more specifically and then once a month and then there's also a function. If you are, if you experience any difficulty with the bike, if there's problem with the brake, if there's a problem with the seat post, adjuster anything like that when you dock the bike, there's the ability to there's a little button. That looks like a wrench on the dock and you can press that button which will take the bike out of service for other riders and also signal to the operations team that it needs to be looked at. So you know, hopefully I'm sorry to hear that that's been an experience and definitely encourage folks to hit that wrench button if they are experiencing that problem and if it's something a more sustained issue, certainly something we can talk to the operational team about as well. Thanks pete I'm going to go to Colin and then Birin yeah thanks so much for the presentation and for the work that you guys are doing I'll keep I'll keep my remarks brief. I do want to echo the previous comments about. You know the preference in this community and at least in this committee and this community board would be to take space from cars instead of pedestrians when it comes to placement of racks or docks. I also I saw today on twitter a mayor's management report, graphic that showed that fiscal year 2020 was the lowest year for installation of new city racks since 2010 20,2009 to 2010 that fiscal year, which is disappointing. Given that there's so much you know, of course, we've seen such a bike boom over the past seven months, at least so. Just to echo those two comments. My question is a little a field. I do not know if you guys can answer this tonight, but I'd be interested. In speaking sorry, my new puppy is making some noise in the background, but I'd be interested to speaking to speak with anybody about any service chain. Any changes in patterns travel patterns that you all have seen overnight in the one to five am hours while the subway has been closed, particularly you know whether any CitiBike trips or whether people, who are you know in lower income communities in nature communities, essential workers, whether they're, whether they have strong access to CitiBike during those hours I'd like to. If you, if you know, if you've seen any interesting, you know travel patterns that you can talk about tonight, that'd be great or else I can get somebody's contact information and speak to you after that. Yeah. That's it's a really interesting question. I do not know off the top of my head, but I'd be happy to look into it and talk about it further thanks lily, so we'll go ahead and follow up with some additional data and details on that question Colin. But to the second question- or I guess your second point about city rack installations over the last year, I will say that Kova definitely put a halt, as one would guess to a lot of our non- essential work for some time, but our public space unit has been working on our bike recovery plan to essentially kind of cover areas city- wide, where we are installing additional bike, parking facilities and capacity to help with this increased demand in cycling. Thanks for that question, Colin, that's interesting, viren, just kind of quick questions, echoing everyone else's concerns, I'm just going to add a couple of items. Lily did mention discounted, bypasses from NYCHA residents. Do you have a kind of comprehensive plan for working? In conjunction with you know, there are 347 locations that NYCHA owns throughout five boroughs. So is there any kind of comprehensive plan for within your expansion plan? That's question number one and, along the same token, are there any sort of programs that CitiBikes has with public schools yeah great question. So, within the service area, we have a policy of placing at least one night, a one CitiBike station at each NYCHA facility. Of course, there's some very large facilities where we have multiple. But it's our policy to make sure we have at least one at every NYCHA facility in the service area, and we have partnerships with NYCHA. So when we're doing our outreach and our planning, we go to tenant association meetings and things like that. To the question about schools, we have a number of so CitiBikes. You have to be at least 16 to ride a CitiBike. So it's one factor for school, rider, school age, kids riding we have a number of programs with Lyft, one of which is called partner keys where we provide access to CitiBikes at schools or other community groups, maybe like a ymca, something like that where they can organize rides and then provide free rides for the participants. So often that will include young people. We also have a program called CitiBike for youth or lift up, which is a partnership with the ymca and Lebron James to provide low it. I think it's free or discounted memberships to riders between the ages of 16 and 24.. Thank you. Thanks Erin. I think if there are no more questions or comments from go ahead, christine follow up on the school really great question. This is I mean, do you have a systematic, like you are saying we at least put a station for each night show. Do you put a station on each school street? That's a good question. I do not think we have as a sort of part of policy around schools as we do around Nycha's with the way we plan the system. We aim to have a very high density of stations per square mile and so you're, always within a three to five minute: walk of a station within the service area, but in terms of specifically placing them near schools, it kind of depends on the relationship with the school itself, and often schools have a lot of different operational needs that can limit our the feasibility of putting stations. So there's loading and docking and teacher parking things like that, but as much as possible. Yes, I think we're we look to place stations near schools and any really large amenities, so school museum shopping, plaza anywhere, where there's going to be a lot of activity and people coming to or from we want to have a station there. Okay, thank you. Thanks, I'm going to open it, I'm going to go to Carl Wilson from Speaker Johnson's office, and then we have at least two questions from public Carl hi everyone evening, DOT ncb4, just a quick question. Any of the sites that identify do they disrupt any current outdoor, dining setups, and you know how is that con taken into consideration now when selecting sites for new racks, hi Carl good evening I'll, let Brian I see and muted. So please go ahead. Brian yeah! None of none of these sides would conflict with open restaurants or outdoor dining setups. It was certainly a consideration we looked into when we when we signed these sites and we'll frankly continue to look into as outdoor dining is becoming a more permanent fixture in New York, City yeah, another another wrinkle, okay, I'm going to Allen. Thank you another wrinkle, dale and reason to take up more space from cars for cyclists. Anyway, sorry, I'm going to go to Alan Oster Allen. I can read out your question if hello, yes, please hi several of these of these racks and thank you for expanding the one on West 22Nd street, better to have the racks there than the cars, even though some folks on the block were a little upset that they saw so many bikes. But thank you very much when I think it went from 40 to 70 or 72 or something like that, but unfortunately, a lot of the bike riders seem to feel that the racks are a place to leave their coffee cups, uneaten lunches. All of that stuff gets left behind where we are there's a parks department right next to the park. The Parks Department does its best to keep the sidewalks clean. We have members on our block that clean around the bike. Racks, but parks departments should not be cleaning the bike racks. The city is CitiBike required. I know they used to come around and spray down the bikes once in a while. I have not seen that happen in a long time, but- and there are other areas in our in our location, 20th street between 10th and 11th is a large bike rack, where there's no one there to really clean up around the around the ranks and I'm sure there are other areas also and on your presentation, page 11, I think, showed the Iraq's one in the sidewalk one in the street with some debris around it. So why is not CitiBike required to come around on a regular basis to clean around these bikes? Thank you thanks. Alan, thank you for the question and specifically the comments on those two locations. I'll take those back to Lyft and ask them to have them addressed. Citibike is required to clean the racks twice a month, so that is like the power washing that you're familiar with. But yes, with these two spots, I can definitely ask them to take a second look. I think with Covid-19. Our internal inspection system is maybe not as robust as it used to be so cot is missing these locations and would normally ask lift to address them more promptly. But yes, twice a month in these two locations, we can definitely have them. Take a second look at if I can just follow up on that, I assume there's a license agreement, there's a some sort of agreement where they have responsibilities. Is there a lease or something or is there an agreement coming due that they we could have them instead of just hosing down the the bikes that they're required to come not twice a month, but once a week we clean the bike rack at least once a week, if not more because it happens to be a very heavy location, gets a lot of. Why not have them put garbage cans out there? They can put their. They can put their phone number and an emblem on these things, and perhaps we can get the block associations to coordinate we'll you know empty the cans and put a put a black bag in, so the garbage is really starting to to really accumulate, and personally I'm getting tired of cleaning up for a company that is hopefully making money on this. Otherwise they would not be here, but so, let's see what we can do, I think maybe getting garbage cans would be a good step. But let's see thank you thanks, Alan Roberta can you go live, or else I can read out your question. Roberta's roberta got it. Okay, thanks, I'm very concerned with enforcement and how enforcement will be modified for adding these new bikes. It has become more and more dangerous for pedestrians, especially elderly people, to get their you know, bikes are on the sidewalk more and more often it's not so much CitiBikes. Although I've seen those I mean, I had a neighbor sent a note on Facebook that she was caught in a crosswalk the other day when a group suddenly appeared it was a group that were you know, was a protest group, but they were all on bikes and finally, she was standing in the middle of this. She could not move. There were hundreds of bikes. There are three cops on scooters. Who just did nothing and finally, a guide came to our rescue and helped her out of that and get to the sidewalk. I mean she's, elderly, and you know she could have easily been killed or badly hurt and I've seen that every day I can tell you when I'm walking the dog there are bikes on the sidewalk and other than screaming at these people. I do not know what we can do, but if you're adding all these bikes, I'd really like to know how you're going to enhance enforcement so that the streets are safe so that pedestrians and other cyclists, I mean the cyclists, who are abiding by all the rules, are in as much danger as the pedestrians. Thanks for your question, roberta thanks yeah, so I think as we're seeing this you for it well. First of all, you know the rules of the road are on every single CitiBike on the handlebars, so all riders are reminded of them. Second of all, I think you know, as we are experiencing this big bike boom, we're seeing a lot of people who have not ridden in the city before and are perhaps less familiar with the rules of the road. So I think it's a reminder that, in addition to enforcement, that we need to have a renewed sense of education, we have a lot of some of our typical education components like on- street teams and going to schools going to different businesses to educate people on how to safely ride a bike and what the rules of the road are. A lot of those have been. We've had to change our operations for them due to Covid-19. So I think it's a great reminder not only about the need for enforcement, but also the need for education, and you know, I think, the as well as looking to place stations in the street as much as possible, which we appreciate your support with not every area is as supportive as taking roadway space for CitiBikes. So it's something that we're also contending with in other areas as well. Can I ask a follow- up to Roberta's question: does your mobile interface have like basic instructions for riders on riding safely in New York, or should it the city, the CitiBike app yeah? I believe it does, and I know, there's been some renewed conversations around rider training and having folks go through a quick demonstration or a quick set of slides on their phone about rider safety and rules of the road, but something we can look into yeah, I'm just I'm just looking now and I do not see anything especially vivid or robust on the interface, and I think that would be a good place to get some basics down for for visitors. I think I see also Brian Weber has his hand up ryan hi. Thank you. Can you hear me a little louder? Hello, yes, okay, great hi, I tuned in a little bit late, but Brian weber, a public member, a resident of West, 36Th Street and the co- chair of the very nascent 36Th Street Block Association. I just wanted to thank CitiBike for reinstalling. The rack on 36Th, Street and 9Th. Avenue did not know that it was coming back, but residents are very glad to see it reduces the number of cars that double park on that corner next to other cars. Now we just have cars double parking next to CitiBikes, which is a little bit more tolerant and we're going through some rough times on 36, due to other reasons. So we really appreciate your return. So thank you. Thanks Brian, I see one more attendee who's got his hand up or their hand up it's. I see them identify as diagnostic in the interface yeah. Sorry, it's Susan Numeroff. How are you today hi everyone? Hey! Thank you all for being here and you've been doing such a great job through the pandemic, and I really appreciate it. I have a couple of questions. I'll sort of Piggyback on Alan is how we can get information to the block associations when things change addition, subtractions etc would be really greatly appreciated. The bike racks on the that are proposed. Are they proposed on streets that have bike lanes and, for instance, the bike lane on 20 seconds? I mean the bike rack on 22nd street, which was expanded to 70., and we do have a lot of residents that are unhappy with it does not have a bike lane, which then creates major chaos. So we've got bikes coming on sidewalks on 10Th avenue, we've got bikes coming up, Ninth avenue in the wrong direction, so it's an accident one day ready to happen. I've taken a couple of videos of it. I'd really like to understand how we got to 70, and maybe we need a bike lane on 22nd street. If we're going to have this major investment of bikes on that lake on that street, otherwise, maybe to shorten it and put bike lanes on 20:20th street and 21st street, they there seems to be a lack of enough bike lanes on those other streets that do have bike lanes and we've got to support our bikers, we're setting them up for failure and possible injury when we do not have enough lanes. So that's my other question. Thank you. Thank you. I can answer at least I know 54th where we proposed the station and I think 44th have bike lanes, though they are just standard bike lanes not protected or any kind of enhanced infrastructure. We do not call that bike lanes. We call lap paint. Yes, there is paint, that's Jennifer Jimmy, of course, thanks Brian and so Susan, just to speak a little bit more to you know your request, your suggestion of adding in a bike lane on 22nd 20th street. I saw Jeffrey clapping at that suggestion as well. You know, of course, we DOT is willing to look at you know those types of requests and proposals. Should the board bring us a formal request, so I'll put that out there. I think christine and Dale already know that. So thanks for your support of like infrastructure, acrosss, the city, okay, thank you. Thank you, Susan. Thank you. Jennifer. I see no more hands up. I think we have fairly exhausted this subject and we need to move on to some other topics on the agenda. I'm happy to make a motion. Dale. Yes, go ahead, Jeffrey that the board applauds and welcomes the infill in CB4, but would like the 27th and 8Th Avenue Street sites to be reconsidered and placed on the bed and not the cycle, and I have some addition to that. I heard that we also want to ask for parking adjacent to the stations. That's right parking for non- CitiBike, docks, non-, CitiBikes and then, and then we ask for more regular cleaning of the stations. You know at least once a week and enforcement of enforcement slash education, as we usually ask do. I hear a second on this motion: okay, okay, so all in favor of this motion, hi. Are there any no's or any abstain? Abstentions. Okay, great. Thank you so much to all raised here, Melanie Brian, oh no! This is melody as a raised hand. Is that did you miss that, or did we miss that I just I just saw it melody? Did you have a comment on this topic or yes, am I audible? Yes? Oh I just wanted to add. This is also great. I just wanted to add that West 22Nd also has a pretty significant station on 8Th Avenue West, going from 8th to 9th, and it's been expanded. A lot, so even paint would be great there. Bike lane would be even better. I have an open street between seventh and eighth and anything would potentially remove parking would be welcome. Great thanks, melody. Okay, we've we've voted on the motion. We're going to move on to the next subject. I believe we have a presentation from our friends at the EDC on the pier 79 ferry expansion. Is that correct and thank you to D.O.T for their presence? Yes, thank you. Thank you. Thank you. Thank you once again appreciate it. I did not get a presentation from EDC to put up, but if you have one available, I can please send it to me and I'll put it up quickly. Oh, give me one second, I thought we sent that over to you give me one second, and I will send it over to you now, but first we can switch reductions and then we can move from there. Sure enough. You could also introduce yourself and your team, but hi. My name is ratty, I'm with corporation and I'm here with and I'm with the government community relations team. Here I'm joined today by janine, I think James Wong just sent it to you. I think James Wong would like to be made a presentation he's also added to as a panelist. That would be helpful, since he will also I'll send them over awesome. Thank you, but I'll turn on the camera briefly, but I'm ready, I'm with the economic Development Corporation good, to see a lot of you all again. I know it's been a difficult seven months and months and not the transportation available, and today I'm joined by James Wong, who is the head of our ferry system, but I'll? Let him say hi in maybe a few words. First, hey good evening, everybody thanks for having us. I have a couple of slides, some of which I believe a couple of folks have seen before. I do know that we had a couple of specific questions which I've included towards the end of this that were questioned mostly related to access to pier 79. In sort of access mode, so I'll speak to those in the last slide of this presentation. If we go to the it should just take me, five ten minutes so I'll provide a little background just again for everyone with two slides and also an update on where things are, how we've been reacting with Covid-19, we'll talk a little bit on the expansion update, specifically how it affects we'll talk about everything, but also the specifics of where we are for service. That will be starting at pier 79 next year and then, as I had mentioned, speaking kind of directly to some of the three questions that were provided to us in advance as they relate to access considerations. So as I've mentioned in the past, for I believe it was the larger community board, so NYC ferry just for everyone's awareness is a system operating with 150 and 350 passenger ferries. Throughout the city we have seven day year- round service that does fluctuate with the seasons but which has consistent peak service throughout the year. Our general operations are roughly from six to 10:30 pm with a few specific areas where we do start a little earlier for some of our further out routes and, depending on the different Route Peak Service headways are anywhere from 20 to 60 minutes, and that has a lot to do with the ridership demand that we see on each different route. We are matching the subway fare, which is an important element as part of NYC ferry, and it has been 275 since we've opened and we are on a separate ticketing system from MTA. So there is no free transfer. However, we do have our own mobile ticketing and real- time service alerts available through the NYC ferry app. What you're seeing on the right here is our current system, which actually has had a number of small changes since we launched and reflecting some of the changes that we've made during Covid-19, including the reconfiguration of the lower East side route and changes to the story route as well slide. So in response to coded, we of course, like all agencies, require masks on board and they must remain on board while they are there. While people are there even on the top deck in general, pretty frequently, I do notice that we have pretty good mass compliance around the around the system, which feels pretty good. We have limited capacity on board to accommodate the ability to create social distancing so to allow people to stand or small groups to stand six feet apart from one another. All ticketing has to happen in advance, and so we you do need to use the app or a ticketing machine, and we have seen increases in usage in the app and, of course, frequent cleaning and hand sanitizer available on board all vessels. One of the things that's not written here but which is exciting, is that we are seeing a strong return in our ridership. So we have seen a steady increase and recently as high as 60 to 70 percent of ridership from last year is actually riding now, something that shows us that our recovery for our slice of the ridership of the transportation modes in New, York City, is starting to see that recovery, and so we're excited to see those numbers come back. We're keeping a close eye. Certainly, as we go into fall and cooler weather to make sure that at least proportionally we're seeing the same levels and trying to get people on board and moving to help support the city slide, so to talk a little bit about the 2021 expansion. So of course, as you know, the route that will be serving Midtown West, pier 79, is the same George route. This route connects from Saint, George and Staten island to Battery, Park, City and also to Midtown West. So it makes those three stops. We will also be expanding to coney island with a new route that serves Coney, Island and picks up Bay Ridge from from the south Brooklyn route. And, of course we also have the frog's neck expansion on the sound view, route, which will add a small trip over the over the water there, but will actually provide a lot of benefits to people who are living up in the throgs. Yes, so just to give folks some scale as to where we are what has transpired over the last several years. So we announced in 2015 that we were going to be doing this and opened in 2017 with the launch with several routes. The full system original system was completed in 2018, which is also when we started an expansion feasibility study and began community consultations at the time, including broad invitations to elected officials, community boards and the public about requests for sites. In 2019. We released our planning study and also began an environmental review with the announcements of new routes that were going to be that we're going to implement and that environmental review did wrap up in August of this year. So things are moving along. The draft Eis came out in January. There were comments that works. We had an original date that got extended so that we could accommodate some of the additional time needed, of course, due to Covid-19 and ultimately, the final eis was completed and released in August of this year in terms of infrastructure and launch we're in the permitting phase. So we are now working on getting our permits organized and I apologize the there's a typo here, but it should be that construction at St George, which is the only new landing for this route, is expected to start in early 2021.. Our goal is to launch the Saint George Route in summer of 2021, so that is something that we are still on track to do. We look forward to and look forward to, starting so, of course, there's the part of the 2021 expansion and as it relates to pier 79, of course, the the areas within CB4. So this is an existing ferry terminal, mainly surveying New, Jersey and Manhattan- based trips, so the Cross River trips on the Hudson. This would be a service. That's added to an existing landing with no new construction. That's involved locally, so we'll be using the existing ferry terminal. It is located. You know, with Hudson river park, adjacent and adjacent to the West side highway at West, 39Th Street. Our plan is to have service in the peak approximately every, with two to three landings per hour. So this is not service. Every five seven minutes. It's service every 25 to 35 minutes depending on the season for peak off-. Peak periods will also have a lower service, as it goes like I've mentioned by season. Nyc ferry vessels do have some differences compared to some of the other vessels that are more common on the Hudson river. So we do have newer vessels. Everything was purpose built for NYC ferry, meaning that we do have lower emissions, quieter vessels, a more stable ride, which is generally noticeable when you're on some of the longer hull routes, and also one of the things that we think is important is that we're also creating less weight than some of the older vessels just because technology has improved and designs have improved on catamaran style vessels in the harbor please. So the three things that were brought up in the questions that were sent to us were kind of about key access modes, m42, SBS and coordination with the existing operations. So, first of all, I'm very aware and know that there's been long- standing challenges with access modes at pier 79, as it relates to the bus system. That waterway has and I've been talking to them about it, because we are a pretty small player in this world in terms of the total amount of service and the total amount of ridership. So they are definitely the incumbent and we have to work with them to see. If there's anything, that's going to happen in the future, and I do think there are some opportunities there, but in terms of what we expect. So first of all, there are changes to travel behavior that are working in our favor and by in our favor I mean that waterway has shared that the proportion of ridership that is utilizing the shuttle buses is down from 95 to far less to far less than half. I do not have the exact numbers, but they said far. Fewer people are using the shuttle bus to access the pier 79 area, either to or from the landing which, from a local perspective, is good information, because that means that fewer people are creating demand for those buses to come back to a full system. Right now, Waterway is operating. I think it's about 15 or 20 percent of the normal buses that it operates in terms of frequency at pier 79. in term. So those changes are good, they're, a good indicator for us, because in general, most of our riders walk and bike to landings a good, a high percentage of them, and we hope to see something similar here and with people using it for local destinations. That is a good thing for us. That said, we do intend to make shuttle buses available to our ridership. Previously, we've said that we intended to either start our own shuttle bus system or to leverage the one. That's already there right now. We are still negotiating but planning to leverage the existing shuttle buses so that we do not have to increase or add any new bus service to this area. Understanding the constraints that are already there we're trying to avoid any, adding or exacerbating the issues that exist in terms of and then, of course, there will continue to be the existing walk bike, CitiBike just north and other pickup and drop off access modes for taxis, ubers and other things that are available. I personally have not been over to pier 79 in the last couple of weeks, but I did hear also from some of the operations folks there, but they've also not seen a dramatic increase in the Uber and Lyft Pickup area, which is also promising again towards the. How are people getting to and from the landing in terms of m42 SBS. So, of course, the m42 is a straight shot. Acrosss 42Nd, Street and terminates two blocks. North two blocks north of the pier 79 area. There had been some question as to what are we doing with it, which I was not actually completely sure. I understand the full breadth of the question in terms of rerouting or sort of changing the routing of the bus route. That's a little bit outside of the immediate scope of what we're doing. However, if there is an active request or a process, that's underway related to sort of changing where the MTA is taking that bus route. We would, of course, be welcome to are happy to talk about that or have a conversation as to whether or not we would be actively advocating for that as well. If there's something else that I'm missing in terms of you know, what does it mean with respect to m42 SBS and how it relates to pier 79, I thought we should just have a quick discussion if there was something more specific. Finally, in terms of existing buses and operations coordination, so I do have an ongoing conversation. That's been happening with the trust with waterway, having some conversations with city DOT. I certainly have learned that there is a as many bureaucratic things are, a very complex ownership pattern that involves the state, City trust, EDC and waterways, interests all collaborating in the area immediately in front of pier 79.. So, of course, with something that is that complex? It's no surprise that there's been a lot of challenges in sort of moving things. That said, having spoken to waterway and encouraging them that, while we are interested in working with them, they're also interested in making sure that they're being good good stewards of the area and making keeping the promises that they've made. I understand that they had previously committed to- and this was sounds like at the beginning of this year- maybe last year- that they had committed to working with the trust for putting flag people traffic flag people at the intersections during peak times for this, for the calendar 2020 year and going forward. Of course, Covid-19 happens, they're private enterprise and they're hurting tremendously, and so that did not happen this year. In addition to having far fewer actual traffic movements. However, in speaking to them, they are still committed to doing so next year and sort of finding the times that it makes the most sense to bring traffic flag people and to put them at the two intersections that are needed in terms of other operations. From what they've told me, and I'm of course happy to hear from others, it does sound like they have done their best to move certain operations and some of their pickup and drop off to pull things a little further down south, because that had been part of some the earlier conversations with the trust, but that obviously looks very different in a Covid-19 world than it does when things are at sort of peak service. And finally, you know there was a mention- and this is something that I do not have fully have my arms around as EDC. We are just the least administrators at pier 79. We are not the sort of core planning entity, that's going to be creating long- term plans or visions for the area. That is a joint effort between, as I said, certainly, city, state, dots and and the trust which all have interests in the area. But it does sound like there continues to be both an interest and a need for some long- term visioning in terms of how to recreate access points here, which is, you know, a longer and bigger capital planning, process and project. So, having spoken to waterway again in presenting our interest in working with them, saying that we want to make sure that they're being good to the community was a conversation that they're eager, if not you know, eager to participate in whatever public studies are happening. I do not believe at the moment there is an active capital planning process for this area, but did want to leave note that you know from our perspective, you know we're happy to encourage waterway to participate in that to encourage and work with the city in any way. We can, but also acknowledging that this is a pretty tricky area just given the overlapping jurisdictions that do exist. So with that I'd like to pause and go through questions, I know I jumped through that pretty quickly. So, of course, can go back to any areas that we need a little further discussion. Great. Thank you so much james. That was very thorough and I appreciate you digging into those questions. I'm going to turn, first, of course, to Jeffree Francois, who is our resident West side, Ferry, Booster, Mr Chair. I believe it's queen of the ferries is the oh nickname, but I'm down on it. Thank you Dale and Hi James. Thank you for this and thank you for addressing these questions specifically thrilled to see. There's discussions happening with New York City Transit around the 42 connection. Did you EDC is considering its own shuttle bus. Did I hear that correctly? We were previously talking about and the Eis considered that we would either start our own small circulator or leverage the existing buses. That waterway has so we have. We are still in negotiations, but we are reasonably confident that we are going to be using the existing waterways shuttle so that we do not have to add new buses to the area. I definitely think that we would be much more supportive of using existing buses absolutely, but would also use this moment to recognize that waterways is actually in a bit of a violation of their lease, given the fact that they use the area for parking and layover, which has become a problem in particular at night time and Jeffrey. I just want to. I want to acknowledge that I know you said this from the beginning, which is we support use of existing ferries. As you can understand, for the sake of our public process, we can not emit waterways to doing anything without having real conversations and an agreement between the two. So that's why we had to have the two options there, but leverage. This is new information to me. I think, unless I missed it last time, so I'm really happy to hear this and we're happy to help. I think push this along because we're all about you know streamlined Multimodal Node points, and this would do that agree with the flagpole factor. The flag people factor would that be something EDC is a part of encouraging. Are you saying that's ongoing conversations between waterway, the trust and the city, so the buses are and the lease is waterways. We are asking to participate a little bit in what they are doing, and so it is, you know, from a strictly who's involved perspective waterway is got buses and the trust has been a pretty vocal supporter of trying to get people who are providing flag traffic flag people there. So it is sort of a conversation between them. As someone who is going to leverage our work with them, I am able to at least call their attention to this and ask what's going on, for which they've given pretty positive indications that, yes, they actually had intended to this year. Of course, Covid-19 created both a decrease in usage and a financial hardship that they've been struggling with, but they are still committed to and then plan two for next year. So this is my final question. Who would EDC be signing a lease with EDC does not sign a lease with anybody, because you would get a landing slot license, which is an administrative tool that allows us to pull into pier 79.. Will you be? Will any boat storage? No? Our vessels are stored at our home ports in the east and got it where you have all the stops too. I guess, and the Ocean Queen Rock Star, there's more than one fairy queen. You know there's several stops missing along this west side route. As you know, this is a boon for staten islanders and a bit of a burden for Cd4. So we look forward to stops as we've requested at other parts along the West side in the future. I do not have any other questions Dale. Thank you christine yeah. Thank you for this good presentation. You mentioned at the beginning that a lot of people are not using the the buses. So what are they using? So that's a really good question so because we do not have operations there, I'm not on the ground as of yet I will be spending more time. Obviously, once we get started in my conversations with the people who are there on a more regular basis, what they've said is that yes, of course, the total slice of people who are using the ferry and the terminal is much smaller, but what they are surprised by is that the proportion of those people using it is even smaller for bus access, meaning that, since people who were using buses were generally going towards places further north, this is a lot of people from New Jersey we're coming in, and we're willing to take that link and then take buses that go closer to the in the 50s. It makes us think that more people are willing to walk from pier 789 because, as I said, they do not see this huge increase in Uber or shared rides. They think people are walking and biking to areas that are closer. That's like a very, very much a hypothesis. It is not a proven thing, but their decrease in bus ridership compared to their ferry ridership is what's giving them the sense that people are moving a lot more locally than they are going in and going. You know they have retained, essentially the local customers and they have lost the faraway customers if local, if the difference between local and far away is distributed on their bus routes, then yeah, I think that's what it sounds like and the bike station. The bike share station is located where it's on the immediate north end of the property. So when you come acrosss on 39th street, if you're looking at the water, it's on the right hand, side, okay and there is a crosstown 39th street bike, Lane being built as we speak, so that should increase the volume of users of the bike lane of the bike option. I do not know that. That's great yes, so you have crosstown now 38 and 39 38 to come in and 39 to to leave, and I think that should encourage that, and maybe a good signaling sign signage would be a good thing to do to say you have a protected bike lane so and 42Nd. I could not really understand what you were saying. Are you talking to MTA to try to get the terminal to move over or not? No, what I was saying was, I did not fully understand the question that was sent to us was: how are you coordinating with m42? I guess that's the question is: are you talking to them? Are you encouraging that? Are we we're not in sure okay? So we talk to the MTA when we talk about coordination generally, the proximity of this is not, and because it's a terminal, we have not actively been advocating to move their terminal to pier 79. Where there's already active. You know bus issues, as is if there was a more specific request that maybe I'm not understanding I'd, be happy to you know. Well, the more specific requests is that you know the N42Nd is very clean energy, etc. The buses of the waterway are really ugly, polluting buses and they are duplicates of the m42, because the m42 was not effective before, but the m42 has since then be converted to a semi- sbs. You know kind of the red, the red carpet, you know bus, and so the performance is much better than it was before. So, for those two reasons, I think there would be value in trying to move people to cross with the m42n and reduce the number of buses which are going acrosss town as a shuttle instead of the m42nd. So I think I think that's something that we should pursue. I think, if I'm let me say what I think, I'm hearing just to make sure that I I've understood it sounds like you're saying that the in order to leverage the m42 SBS for ferry riders, I think you're, suggesting that there be the terminal, be moved to be in front of pier 79 displacing the buses, some of which go acrosss town, but many of which go in many directions, not served by that. I'm not saying displacing. In addition to I mean you know, and I hope it will, you would displace some of those additional buses. That's all okay, so I'm not suggesting that you displace the other buses, but I think you offer an additional option sure. So I guess on this one. What I would say is that you know we're happy to help and be an advocate for something this one is a little tricky, as I had mentioned, because the overlapping jurisdictions mean that this is actually not our call. This is not like our thing to push. It is really something that I do believe we would want to lobby MTA for who would reach out and ask you know: does it make sense a operationally for them, given that it would have to increase the run times and the routes for them to make that loop? And then you know something that we can be. We would think through and understand the impacts that it has not only you know to New York Waterway, but you know how that would impact everything else, but we would be happy to. You know, understand that, and if it's a movement, that's going and requires advocacy, better, understand that and all right and then finally do you have any work going on with Hrpt many hrp is there to discuss to improve this. I mean I know that this area is one of those that was supposed to be funded. For an improvement by the trust, the capital project, and so it was to be supposed to be put in the queue of a number of improvements, but now that we have a new, a new work, a terminal in a sense is it an opportunity? Do we have an opportunity to move that work up and make this area a little more friendly and a little more a little prettier than it is today? I guess I'm going to refer defer to Rashi to speak to capital planning within the trust, as it relates to what I was saying earlier is I have heard rumors of you know there is a planning process. I have not been able to pin down or see if there's any active capital planning process for the area in front of pier 79, whose jurisdiction is not the trust but actually like a mix of a few different layers overlapped, and I think noreen is here as well. Maybe dale you can ask noreen to respond to that noreen sure hi, everyone Rashi is is basically on to talk about all things ferry, but that particular question christine. I can try to answer. Yes, the area from 29th to 44th street is kind of the last big, not yet in process fully plan planning zone for Hudson river park, aside for our river research and education center down in Tribeca, and it is in the queue and we have been working on an RFP for that area, which is pretty complicated given all of the transportation and other uses that have leases and lots of issues and I'm sure it's an issue. You know when we finally get a designer on board for that area. It's something we're going to have to be talking with you all about, because I think it's probably a zone that would be addressed almost in phases, because there are more open space opportunities in some areas and in some areas it's really more like enhanced, vehicular, passageways or pedestrian passageways. But basically the funding for this area is Quasi identified as city and state because of Covid-19 and the city and state financial crises. We do not quite know yet for sure when we will have access to that funding. There are already a couple of big projects in the queue in this neck of the woods. It's obviously pier 97, which we are still planning to start construction on next year and further south at scans aboard those areas are already basically finishing design and we expect to be doing construction bidding. This area is not as far along and we're still talking with the city and state about this, so I guess christine. You know that, because there's no physical construction that's needed for this. It does not really change our equation for that part of our overall park project other than the transportation issues that you're all engaged in talking about and how to make them work as best they can eliminate as many vehicles as possible, etc. While we are still working on trying to you know improve the park physically in this sound did I answer your question kind of the best you could yeah best. I can because it's a Covid-19 informed answer, I'm afraid. Okay, all right I'll, go back on Munin away, bye everyone. Thank you. Noreen christine. It sounds like based on the James's response on the on the m42. Would be somewhat on us to advocate for those changes? What do you do you think so yeah? I think. So what do you think Jeffrey? I agree yeah one of the one of the concerns, though the more it's like. We have to consider sort of encroachment on the park here and are we going to encroach upon anything that could be otherwise park if we're going to transfer a terminal or a terminus for the 42., you know. Is there a trade- off here? Is there you know, I think the trade- off is more going to be with the the waterway buses than with the park. I mean you know if you had a 42 there. I think in the in this day and age, people would take that more than I mean my preference is to eliminate the waterway buses entirely exactly yeah, I'm going to take a couple more questions from our committee members, Viren all right, James! Thank you. Thanks dale, it's very quick question. There used to be a very I might be totally wrong, but there used to be a ferry from West Harlem to Ps79. Historically, are there any plans? Sort of for expansion northwards so there have been the story of ferries in the city has depending on which decade we're talking about, has been usually described as a series of fits and starts, where a lot of private entities tried to do a lot of different things. Some have worked some more successful than others, and we really had this game changer three years ago, once we got started with NYC ferry. I know there was a brief service that I think I think it was waterway briefly ran a service a couple years back trying to get people from a little further north, and so that might have. I do not know that it went as far as like Dikeman Street or certainly did not go up to dykman, but, like I think, 125Th, and something in between I'm not super positive. If that's the one you're talking about like historically I'm sure there were different kinds, we find out we're facing links all the time. I'm talking about the one that you just mentioned: 125Th street yeah, so that one, I believe, was like a private venture that they tried to make it work and it did not pan out. I think that was a couple years back in general. Some of the challenges we've seen with trips within Manhattan and specifically trips that are competing with pretty active subway lines, is that it's hard to plan to attract ridership. That's going in a north- south pattern, given the number of subways that are doing, you know pretty close to the same thing, and so making ferries competitive at scale has always been really challenging. For us, this is definitely experimental in terms of making a connection on the West side between loreman and Midtown. I know waterway for different services has versions that do it through New Jersey, but really for us, as you guys know, I mean a main draw for here is the connection between points in Manhattan and Staten Island. Thank you, David Warren hi. Thank you quick question. A few times I've been on the ferries- and I do not know which ones but they've always charged extra for the bike and bike parking's always been tenuous on the ferries. So will they better bike, storage and possibly are they're going to charge an extra fee or not charge an extra fee? Because you know if you want? Oh, I do not tell them. I guess that's a hint, but that's my questions and I look forward to the ferries. Thank you thanks. So, yes, we do have a one dollar surcharge for bikes. I'm asked this question a lot and the real. The very true answer is that it's a very double- edged sword. We have a. We have a system that needs to run on time and bikes happen to be because of how they are. You know interacting with the fair themselves. They do take up physical space and they do take a lot of time to board and unboard. So it is a weird challenge. I understand that I would love for it to be super easy to get bikes on and off to solve a first and last mile problem. The way we do generally work around this is by really encouraging and working with D.O.T to get CitiBike stations as close to the ferry landings as possible working with D.O.T to get bike parking that our bike racks near the landings as well, and then, of course, for those who are bringing bikes on board we're happy. We encourage them, but there is the one dollar fee on that that is involved as part of it thanks David. Are there any questions, any further questions from committee members? Otherwise, I'm going to move to the public. I see Brian Weber, a public member. Our public member has his hand up hi. Thank you, Dale. Is there any future in which the West side will be connected to the east side in Brooklyn by a ferry you know as a west side resident. I do not have much use of getting to staten island, as I do to getting to points East and points in Brooklyn and Queens for that matter. So why is the ferry going to staten island and only stopping in the one spot on the West side? Sure? So briefly, the? Why is that the travel in order to be travel time competitive and to get into terminals where there's still ample capacity? It was not possible to make a stop both on the east side and continuing on to the West side and to make its way up to the destinations that we wanted to in order to make it travel time competitive with both the Staten island ferry and the existing one train and other options that are there. So that's the sort of you know whether that feels right or not. That is the sort of background as to where why that is the way it is in terms of what can happen in the future hard to predict. I would say this that fairy landings are naturally very intercompatible. They allow changes to happen. We've created a number of changes on the East River, just in the last couple of months and some that are coming up in the next few months, and you know we did. We started our expansion planning study our feasibility study. It was basically a month after we finished launching all the original routes, so only to say that there's definitely a future. There's definitely changes that come out of these at the moment and for this expansion we are committed to the routes that we've talked about and that we've put out in the public and are building towards right. Now, thanks James, I have another attendee. It's they're only identified as calling user five with a hand up. Can you identify yourself, hello or if you can't, you can put your question in the Q&A and we can read it out here: we've gone here: can you make it your volume a little louder? This area is not as far along and we're still talking with the city and state about this, so I guess christine. You know that because there's no physical construction. That's me. This sounds like a recording of Noreen's comments. Previously yeah Noreen's gone, and this is for some reason. Yeah I mean, let's just mute, that call in user five yeah you mean. Can we okay? Someone did ask in the chat. Where is the ferry stop on 14th and 23rd Street? I'm not sure if they're talking about east or west side, but on the east side we do have a stop at coraliers Hook and Steinstein Cove Stevenson coves at 19Th, Street and Avenue C. If there's one on the West side, forgive me the West Side Community Board. I think you know that the ones that I, the landings I have already built are the ones I can talk about the ones I have not you'll have to forgive me. We identified the appropriate peers on the West side. When you know the time comes, so all right. Well, I think we're we have no more hands up. So are we? Are we going towards a motion here or are we just going to? You know, absorb this information and take it upon ourselves to move forward as we see fit? Is there a motion coming out few things I would flag. Dale sorry is to encourage exist. I think we need to figure out if we want to encourage the 42 to move. If that's the case, we want to encourage them to use the 42 and not the existing waterway ferries. I think that's a discussion for us to have with MTA right yeah, I think so yeah. I do not think we just. I understand Jeffrey, so the 42 is a paid service versus and your thought process is that the 42 sits there more empty than some of the waterway buses is. That is that what the thought process is or is that always the spot where the where folks access the bus? The real the real thing in question? I just want to make sure I'm pretty clear. You had the point about efficiency. Christine was that the point was that the waterway bus was created because, first of all the m42 was far away and second because Crossing town on 42Nd Street with the m42 was just a no starter right. You could not go acrosss the street, so this was resolving two specific problems. So now the m42 is very efficient, acrosss town, so that problem is going away, and you know- and if we were going to move the terminal closer to the ferry terminal, then there would be no reason for people to use the waterway. I guess I do want to just flag- and this is really just as information purposes, not advocacy or as a position for the city, but noting that the m42 SBS has a separate fare system from waterway and waterway bakes into its pricing. The fact that they're providing this last mile service, of course there are, I totally understand we wish their buses were cleaner, a little more efficient or run differently or more efficiently, but just to acknowledge that there's that difference there yeah get it. So I do not know that we are in a position to push one way or another at this point on this project, and I do not know that we- I personally do not think we need to have a resolution. I think it's a good update and we can go from there and I could not agree more. I think this was a fabulous update and we can talk to MTA and other relevant partners right. Thank you both for your presentation and your your answers to our questions and we're going to take it to the next agenda. Item which is sideways have a good day have a good evening. Everyone. Thank you. So thanks for having us for certainly I know I feel like my internet is freezing, but thank you for having us and janine. Thank you for all the community and Jeffrey. We did receive your other letter and we will be responding to that. Just needs some time to actually get the information thanks that it is in receipt and we are working on it. I appreciate it thank you and now on to sidewalk maintenance, which is a discussion I, which I believe christine will lead yeah janine. Can you can you put up the document? I sent you by email yeah, so so this is. This is a reflection really about the way we have been going about doing our business in transportation and some observation, and then I'd like to open it to a discussion. You know over the last 15 years, this committee has been very successful in transforming the streets one project at a time and yet after the last six months, I wonder why we still need to fight the same battles over and over again and when I think about equity and entitlement as a street user. I wonder if we have the proper allocation of public space and public mind as others, and if our taxes are being used to address our needs as public users. So in terms of transportation, I think, although the marketing has changed, I think the fundamentals have not, and I think New York City is still putting the people at the back of the bus, and I wanted to give you some of the examples I have identified so from a standpoint of real estate. We do not have liquidity in real estate and space and time which you know what. Why is the pace, the space reserved to pedestrian impedance when we are the largest trade user? Why are the DOT engineers continuing to put drivers flow ahead of pedestrian safety? And I'm saying that, because this week I had a discussion with an engineer at D.O.T and they still told me that they needed to check whether there was enough space and flow for the cars. You know. Why are the pedestrian restricted to the sidewalk and crosswalk when we have started to do it up to the destinations that we wanted and while we use the roadway requires permit and payments except for parking when so many activity, private activities are permitted to encroach on the sidewalk, with no permit and no cost, and although we support covered 19 for small businesses, why would we let permanent open dining privatize the curve? So that's the first set of questions. The second set of questions is: we have no equity in dollars or service level. Can you move up a little bit yeah? So the question I have is: why does not the city not maintain the sidewalk, although it's being used by the largest group of taxpayers, our tax go to pay for maintenance and car space if the same space is converted from car use, which is parking to pedestrian use, why would the city not ensure or maintain it any longer? So this is like real discrimination right. It's like the space is used for car and the city maintains it the next day it's used for pedestrian. The city does not maintain it. If the same space goes from being used for car parking to bike parking same thing, why would the city refuse to insure and maintain it? Why is the DOT budget virtually no dollars for pedestrian most is dedicated for vehicle and roadways. Why are there so many signs for a car, nearly none for pedestrians? Well, there are thousands of traffic agents, but nearly no pedestrian crossing agents, and there are so many parking agents regulating the parking lane, but nearly none to enforce obstruction or sidewalks. Okay, why is the city sweeping the roadway? They have all this machine to sweep the roadway, but not the sidewalk. Why is the city clearing the roadway for snow, but not the sidewalk for pedestrian? Why did the pilots know at the curb and the stops and the corners, but not in the middle of the roadway, and why so much of the sanitation budget is dedicated to roadway and cars and not sidewalk and pedestrian? And then we have this third section, which is we do not have equity in access and rights. Can you move up a little bit right, so jaywalking is criminally punished. Even the street design no give no way to cross the street. If you have 25 cars and drivers to gather on the roadway, they do not have to ask for a permit. It's called congestion, but pedestrian and cyclists have to ask for a permit and even on the sidewalk pedestrian, have to ask for a permit when people chant industry demonstration, when car screams and Yell Honk in the streets it's normal and when marchers block in the street, they go to jail, but cars block the traffic and it's no problem. So when I put this whole picture together, I say: well I mean: should we be trying to address that in a more fundamental way than you know, winning one little one little corner at a time? What should we be doing? What should we be doing different that we have done in the last 15 years? And you know I do not know the answers I mean I just wanted to open the discussion for everybody to chime in and give their thoughts and see whether we could design a program we could go forward with to ask for different things. You can take it down. Thank you christine for that provocative brief. I see. David and Veren have their hands up David Warren hi. Yes, thank you christine. I agree with you 100. This is like you and I, of course, are on the same page, I'd like to add something unless it creates more confusion than I'll withdraw it, and that is on the sidewalks. The permit for scaffolding is so Lim, it's so broad. They you pay a small amount for a permit. It can be there for years, my building on 34th street. I think has had the per the scaffolding there for five years and I do not see that anytime soon within removing it. I've actually asked the managing agent and he's just you know it's a good. That's a good stuck his middle finger at me. I mean not literally, but I mean you know so I mean so I mean, I think also we can deal with the. Maybe we can get higher prices for the permits which would help the city maintain the sidewalks and give it a finite time, and if they do not comply with that finite time, they even get in a more increased fee. I'd like to make that as a friendly amendment David, I think that's a good example of how pedestrian space is just neglected or overlooked in these instances, and I agree it should be a part of this discussion- viren christine thanks for that, and then I have a lot of things to say about this. I think what I'm going to do is I'm going to write to both of you and then we probably can take it up as a further conversation next time around, but fundamental issue that I have is, irrespective of many sort of problems that we have about sidewalks. If you look at it historically, there has been totally uneven distribution of street space between the pedestrian and the cars 27 of New York City's roadways of our cars pretty much, but it's for a very small percentage of the population, because car ownership, as we know, is much lower in Manhattan and other parts of the city compared to Outer. You know compared to auto boroughs and suburbs, so I think now, with curvat 19 situation, claiming part of the parking lane for expansion of sidewalks could be some. You know one of the fundamental issues that we can raise with the city, and maybe there is a sort of you know a little more positive receptivity as far as that is concerned. So that's one of the biggest problems that I said I see the other part is obviously everything that christine talked about the decriminalizing pedestrian behavior, equitable sort of proportion, proportionate sort of investment from the city, not only for maintenance of the sidewalk but improving the quality of sidewalks. The sidewalks are, I do not know it goes back to 19th century, so to speak, especially in Chelsea zone. Where you are in some places, you have only two feet or three feet wide sidewalks later on the sort of quality of the sidewalk itself. So I do not want to take up all the time for the you know of this meeting, but I have a whole list of items that I would be happy to email to the coaches, great okay, thank you, Aaron David, Solnick yeah. I just want to say what a brilliant list that was, I mean yeah. You know we work on this piece meal and but christine you've put it all in one place and when you do that now that you've done that it's extremely powerful and you know I really think the document itself needs to get legs. First of all, because you know I mean Big Lakes New York, Times lakes, right an editorial in the New York Times, and you know I'm not even sure the best way to do it, but you've that, just by putting it all in one place and the way you've categorized it. It's a very powerful argument- and I think you know we need to do this beyond the CB4. Not just this is not obvious. Obviously these are not local community board issues, they're city- wide issues, and so maybe even you know this may not even be the correct forum. For that I mean I absolutely agree with that David. I also like the idea that the impacts of this built- in inequity are very evident in our neighborhood, despite our efforts, but then they can be. You know pointed to as an example of the wider inequities. That's happening, citywide how we keep ourselves. You know local and then go beyond the borders of our district. I think it's. It's is an important discussion in this I see Colin. Did you have your hand up? Are you no more brett all right yeah? I mean there's like a lot that can be said on this. I can. I can, if I had the time I'd go, build a little soapbox to stand on it, but you guys did not know the time after I finished it. So I mean, I think, there's just a few key things I would just raise so one. I think these are all things that we in the committee have all been fighting, and you know we had a moment where you know we had an argument once in our committee meeting about thinking D.O.T about making a change to 41st to 9th Avenue- and you know I was like we can't we, you know we can. We can thank them for putting it in, but we should not be so over the top of it because people someone had to die before they did that like there, it's reactionary and that's just the reality. We live with a lot of challenges. There are so many competing interests, so yeah I mean scaffolding yeah. I keep complaining about that scaffold that's over. Well, the scaffold is newer than the dent on the sidewalk on on 29th and 8th avenue. What is it going to take for someone to fix that? Sidewalk? That's been dented and broken, since you know at least the last 20 years. I've lived in there, but you know in 20 years. It's always been that way like what's wrong like so you know, and in that same block we have a concrete ramp that was built by the Dunkin donuts that they put in probably illegally for the construction and just left it there. It's not even an ADA compliant ramp. I mean it's, these things happen and it's just you know it's a lot of. It's really what it comes down to is our neighbors, not compliance and there's just not enforcement and it's you know. It comes down to elected officials, the open, dining, the outdoor dining legislation that was passed. You know we can debate that for a long time here. If we want there's a lot of really good things in that legislation, for the sake of the city for but there's also so many gaps that are going to have so many unintended consequences, so it's going to it's so you know. Maybe we just need to nominate someone for our committee every four years to run for mayor, and you know that's how we take care of our problems. You know I'm going to I'm going to say something. That's going to come. You know a little bit on the other side. I think one of the challenges that we've always had as a committee is with the occasional outlier, which has been very rare and usually in that extreme we are a committee that does tend to have consensus towards alternatives to the automobile for transportation. We rarely get that voice inside of our committee. That speaks on behalf of someone who lives in our neighborhood and commit commutes out to long island on a regular basis where there is not good public transit access. You know people that are not making a lot of money, but that's their job, that's their career, and I can give you a lot of examples of my of my neighbors so because we do not have that voice inside of our committee, we're kind of giving sermons to each other, and so I do not think we're sympathetic to all of our neighbors. I think we should get a little more of a diverse voice on our committee to help give us the other the other side. So when we are, you know when we are pulling our hair out over things that we think are failures, I think sometimes we it would help if we had someone who can remind us that what we think we're failures, we're not failures for everybody, and some of our neighbors are actually better off when things do not go the way our committee votes. So I think we do need more of diversity, diverse opinion on our committee, but the and the last thing I wanna I wanna suggest because it's more tangible and something I think is something we really can do, especially since we do get interns and other you know, there are other volunteers, I think in the neighborhood that could help we're constantly saying this is what we want. This is what we need. This is what our neighbors say. There are really good survey tools and mechanisms out there to to help us document in an objective way. What the actual opinions are. So when we get up and say this is what we think we need. This is what we want. You know, what are we basing it on? I think there are. There are some good survey tools out there? Maybe the borough president's office can help us implement some of these and roll these out. I'm sure if we pitched it the right way, they might even want it for the entire borough, but- and I think it would be great if we can find an outside third party that could help us implement it to make sure that we're not biasing our own surveys that we're really getting good public opinions, because once we have, that would also help us direct our energy towards what our community really wants. I think it's, okay, that you know we do have people that have a good deal of expertise on our committee generating a lot of these thoughts. You know christine your observations, you know very you know, thought- provoking observations and it takes sometimes a certain focus and attention on transportation issues to recognize some of those contradictions and judgments that the city makes almost by default, but not really thinking it through. But I think, if there's a way to find objective data and we're confident in our stance on a number of these things, the data would prove it and if it does not prove it, then we should learn from that as well. So I'm going to I'm going to get off the soapbox, I did not build and let someone else be thanks for not building a soapbox, Sarah and then I'll go to Veron yeah thanks christine, as others have said, it was pretty striking to see all these points laid out in the format you did, and so this kind of question suggestion is partially from my own edification. Has this committee ever you know, worked in tandem with other transportation committees as neighboring community boards, or you know even community boards, acrosss Manhattan, because I imagine that you know other folks have some of the same issues, desires, concerns and that maybe, if we are trying to think strategically and tragically about how to be, you know more impactful, going forward, there's an element of scale and then joining forces if there's some common principles or even just policies that multiple of our community boards in Manhattan agree that they want to support that could be a more powerful community, proactive communication to someone like D.O.T to practically say you know, this issue has come up multiple times. We as ex- collection of community boards, would like this to be adopted as agency policy has anything like that happened in the past, and is that something we would consider we have done it with some specific community board, sometimes but not systematically with all the boards in the in the world for sure, so that it's a very good idea to go that direction. Do we have some of those relationships? Already? I imagine Christina, oh yeah, we do. We do very good. We have very good relationship with a number of them with CB7, CB5, CB2 and CB6 and less with the others I'm going to go to I well, I saw more hands raised, but now that people lowered their hands right, okay, any committee members have any more fearing. Did you have a follow- up, yeah, just a couple of quick things? I think this drives back into sort of larger issue of streets redesigned. I mean we're talking about bike, bicycle dogs and talking about taking over parking lanes. So I think it goes into that little. You know a bit more comprehensive approach to it. I would suggest so it's not just simply about sidewalks, but it's about streets and how do we sort of either claim part of it or make them more equitable? So, in other words, what I'm saying is it starts with the sidewalk, but you know all the other pieces of it yeah. It's really about the streets. I mean the intent was to discuss the street and to tell you the truth is that you know the level where I'm discussing now is more of hey. I mean embedded, it's just like. We have had the discussion about, you know black lives matters and racism, etc and say it's really. All those decisions are deeply embedded into the organizations right and here what we have is deeply embedded in layers and layers of the city are a discrimination against the people, essentially whatever yeah, I guess in other people, so you know it's, it looks like the whole city is functioning for the cars and the drivers and not for the people, and you look at all these layers and you see that all everything is slanted. Everything is biased, and you know it seems to me that unless we get to a higher level and say wait a minute, are we really going to put the people first and what does that mean? So the top level would be okay, let's decide we're going to put the people first and streets are for people, and then you have to change all those things yeah, and these are all the things you should be changing. Do we agree with that and to me that's the question. The question is, you know I mean everybody's is looking in their teeny tiny box and they are not looking at the big picture, which is where we put. Where do you show the leadership and where do you show the leadership to then the employees of the agencies can say? Okay. This is my priority right. It's like not putting stuff on the sidewalk. I mean. Why do we still have the discussion for Christ's sake very quickly? What I was trying to say is that it actually is a much bigger issue. It's not simply about sidewalks, and it's about it's about smart streets, about exactly the streets. We're not talking about just sort of we're talking about people we're talking about people regardless of color cast or whatever have you. I just the one of the reasons why I did not send the entire document. I did not want to discuss the entire document here with. You is because I have sort of expanded, this sort of scope of it and I would be happy to share with everyone at a later date, but we actually did a urban design studio at Columbia, University called smart streets and that actually got looked at comprehensively, not simply on the surface, but also sectionally, in other words, what happens below as well. So I think it's a it's a pretty interesting conversation, but I think it needs to be shaped in such a way that the committee can actually make an informed decision about it. Well, that's the that's the question I'm putting it on the table and I realize it's in no shape at this point to be acted upon, but I just wanted to open the discussion and then we can continue and then maybe break it down into pieces where the committee could take decisions, but I realized we are not there yet and but I really wanted this is our share that idea? This is our start. Thank you, Aaron Brett did you have a follow- up yeah, just because I do not want this to be all about. You know doom and gloom and despair, so I'll remind christine where she has changed the entire city's transportation system in that, in the way that a little river becomes a grand canyon. So you know my rock collection. You know when we first when I was first on the committee starting back in 2008, we did not have any red turn arrows. We did not have those split signals anywhere, and that became something I started asking like. Well. Can we put this because you know we had, especially when the bike lane in Ninth Avenue was coming in, and so we were suggesting red turn arrows because of the danger of people crossing green light, green lights. You know you took up that mantle and then, when you became board chair, you had a much bigger influence, city- wide on these things and D.O.T kept hearing you talking about it over and over again, all right, not just about christine it's about it started with our committee, I'm my hunches. The entire city has got these split signals everywhere, especially in Manhattan, and it started, I think, with our transportation committee's discussion so and the bike corrals we started with the bike routes. We started. We started a lot of things. What I'm saying is that we need to go beyond what we have done. You know that's all, and we want to challenge ourselves to find a smart way to go beyond and so that that's what is on the table for ourselves for local changes as well as universal. Okay, I just in the interest of time everybody I think we're going to wrap this. So, thank you all for your spirited discussion of this topic and we're going to move on to bike safety on Eighth Avenue. Do we have do we have? He was right there kelly, hi everyone, so I did prepare like a little powerpoint just to organize my thoughts, but I'll start with introducing myself. So I'm Kelly Kapka, I am a civil engineer- actually focused on transportation and highway design. So it's interesting that I'm here to talk about a bike accident that I was in a couple weeks ago, but I work by Penn Station, especially with Covid-19. I have been using CitiBike to get around more often than the subway, and so I've been riding CitiBike to and from long island city, which normally takes me down first and second avenue, but there's one particular day here where I was running errands over on the West side and ended up taking eighth avenue up and if we go up to the so basically I was in a bike accident on 8Th Avenue. I was riding north on the 8th avenue in the bike lane. There was a truck also going north on 8th avenue and at 45th street it was turning left. The truck turned left. While I was still going straight. The truck basically turned right in front of me. I actually hit the side of the truck. It did not hit me. It could have been much worse and a split second in either direction. I ended up with a bruised knee, that's it thankfully, but it even before this accident happened. As I was riding up, 8th avenue and, like I said, I normally take first or second, I was thinking to myself. I'm never riding up 8th avenue again. It feels so unsafe, like there are just pedestrians everywhere, especially port authority, bus terminal. It's a huge mess, heavy traffic with all the buses, of course, and everyone going over to the tunnel and the street dining here. A lot of times is not curb adjacent because the bike lane is next to the curb, and then you have the street dining kind of in the parking lane, which is between the bike lane and the traffic. So as a cyclist, you kind of get funneled in between the dining and the curb and you're kind of at the mercy of whatever pedestrians step out in front of you or or turning traffic, which can't see you, which is what happened here so like I said I was heading north. The truck was turning. It did not yield. We did not. Neither of us really had the time to react and if you see the picture pointing at the corner there where it happened, I took this right after the it is really hard for anyone to see past the street dining. You have a conflicting movement there. You do not have any signs that warn vehicles of the bike traffic conflict, you do not have split phase signaling or any other indication of you know you need to yield to anyone in the crosswalk or the bike lane I mean we had a green light and the truck just floored it through the turn. So if we go on to the I'll walk you through a couple more pictures here, so this is kind of like the perspective from the bike lane I'm standing. This is taken right at in front of the street dining area so looking north and if you go to the this, is kind of the driver's perspective. You really can't even see the bike lane at all I mean, obviously they might see a little bit wider angle than what the picture shows, but it's a really good indication of how the street dining just really restricts the sight distance here and, like I said, there's no split signal. There's no signs warning of the bike conflict. I think. If something is not addressed, then there could be more accidents that maybe you know, result in more serious injuries. So if you go on to the all right yeah, this is just looking west, so you can see the street dining area is pretty large and they were just constructing it. I do not really know what it looks like today, but it's probably only gotten more filled in yeah yeah. You can see how it goes pretty high and they have the ceiling on it and everything all right and then, like I said, I'm a civil engineer, so I had to kind of brainstorm some problems and solutions here. The main thing I think that could be addressed relatively quickly would be the line of sight obstructed by the outdoor dining. This probably is not just at this intersection. It's got ta be relevant all over the city. For some reason, it does not seem as bad on first and second Avenue, but I think there are just less density of restaurants over there, but really, if you like, if somehow the committee could recommend, I do not know who's issuing the permits for the street dining, but just some sort of limit on how close they can get to a corner where there is a conflicting turn movement that would probably help just keep everyone a little bit safer. The second item here driver unaware of the bike crossing, which I kind of already mentioned. You can add bike lane signs. There are a ton of them on First, Avenue and Second Avenue, and then just overall. It's a really heavy traffic conflict. I do not know if you guys have studied 8th Avenue and the bike lanes. I mean I'm sure you have based on everything you guys have been talking about all night, but there there's a lot that you can study. There are a lot of potential solutions without all the data. I can't recommend anything specific, but it was just obvious to me even before the accident, that there are issues on 8th avenue that need to be addressed and then once I collided with the truck I was like well that just proves it like. Luckily it was not worse and actually pete was there pete Diaz was there. He helped out with everything again. Thank you so much pete for like keeping a cool head. He witnessed everything and kind of made sure I was okay and the truck driver really did not care what happened when he got out of his truck. He looked at the truck to see if there was any damage. He did not ask me if I was okay. Another thing to note there is, I was riding a CitiBike and those bikes are heavy. It was hard to stop. I knew I was going into the truck like a split second before it happened, but I could not stop so. I just chose to collide with the truck so that I would stop you know rather than swerving, and getting stuck underneath or anything like that. So that is my story. My solutions, like I said, I'm kind of basing it off of my experience with first and second Avenue, and I won't take up any more of your time. It's just it's just an example of an issue which I think you guys are already aware of yeah. Since then I sent the information from from pete to DOT and they told me that the construction, the dining, is not compliant with their guidelines. It's too close to the corner and they are revising the guidelines for long term and they are going to make them more stringent, that's wonderful, yeah, because with code everything yeah. The second thing is, I think we know the DOT is supposed to come back to us with a study of the rest of the Eighth Avenue okay, so that should be at the next present. Next meeting, okay and finally, I personally would be very happy to ask them to put a split phase because we told them many times that split phase is probably the best way of it really is yeah. Just basically you have to slow down and we know it works, and so I would be happy to to send a resolution covering those three things: kelly, I'm glad you're in one piece. I look forward to you in the next cycle, joining CB4 and joining our committee. Yes, it was very evident from your presentation that particular I mean these permits were given, so catches catch can and it was like such an economic emergency for the restaurants, but I'm glad to hear that they're changing and it's not as close to the sidewalk. I also think wherever there's an end cap towards the intersection, there should be a requirement for like clear signage regarding the bike Lane hidden frame like you have the even without the street dining you have the full width of the parking lane in between the turn and the right yeah, some standardized graphic, that's required of the restaurant. To have you know a warning to drivers that there's a hidden bike lane, I think, would make a lot of sense in that specific instance and then that, of course, that goes for a lot of places in the city so Christine I would say. Maybe we can recommend that you know like thank the DOT, for we got it. Okay, point of information. There is a an office city office, special enforcement, it's osce and they deal with coordinated response for the requirements for the the new outdoor restaurants and stuff, like that. So it's a specific because it deals with multiple agencies. It deals with DOB if the structure's not built right, it deals with DOT, it's called ose is the ackerman and it's officer special enforcement. Okay, thanks David, I'm going to go to Brett and then Colin all right, yeah. Thank you. I think Kelly I think dal was trying to sell you a membership. So just remember it's free, so it's really cheap, but no I'm going to and I'm going to try not to get too emotional about some of these items. I was already kind of you know getting a little upset over some of the legislation that passed so quickly as christine and Dale can tell you, as I was spamming them with email on this issue, so I'm going to kind of detour a little bit from the specific location, and I think what this really is. This is just another sign that I'm hoping you know next agenda next, the next month we will have an opportunity to really dig into this whole open dining issue, because legislation went out so fast and the biggest omission in all of it is probably keeping the it's not putting the community boards. It's part of the review process, just like we review, have historically reviewed the applications for sidewalk cafes. This is essentially the sidewalk cafe, but expanded things that we are good at have experience with, because, like any community should know their streets and their sidewalks, you know we would have our. We would have flagged their plans for all the things that they were not doing with that outdoor dining, we would have pointed out that they were not compliant. You know the barrier was less than that was less than 15 inches. It was less than 8 feet from the crosswalk all the requirements that we are all studying and know. We could have flagged it before they could have built it transportation issues. We would have identified the daylighting we're constantly talking about daylighting in our committee, that that's why the foot requirement for the crosswalk is there that outdoor dining clearly does not have that, and I do not you know, and even the permit that they should have gotten should not have permitted. That particular use, and the other thing that I will point out. That is a great example of what not to do for everybody's safety is that dining is straddling the bike lane for anyone, who's bicycling those bike lanes near those outdoor dining. You never know when somebody's going to get up and go acrosss it. It's happened to me a couple of times couple close calls and the garbage that collects in those bike lanes by the dining is out of control, and it makes also the bicycling very dangerous. So I think they're just a lot of these issues, that if this is on the agenda next month, you know we might have to clear the rescued agenda, because this could probably take my slot alone in an hour just to talk about what I'm finding but but so yeah. I mean thank you for bringing this out. Those images, I think, should help give us momentum in dealing with that outdoor dining, because I think it's what happened with you over. There was really what can happen from a transportation standpoint for the bicyclists. This is before we even start talking about the pedestrian issues and ensuring the clearance on the sidewalk thanks Brett Colin yeah. I just wanted to chime in, and I mean you do not need me to echo this, but I am going to echo this that I bike on 45th and 8th. I live down the street on 45th and 10th Avenue, so I'm I see this intersection a lot and I too have noticed that it seems like this. One, in particular, is a is a touchy intersection. I've you you're biking down and you can't see. I mean even as a cyclist, I'm looking and I can't really see cyclists coming north. You know I'm sure nobody on this in this committee ever is on a bike and runs a red light, but I always look both ways just in case, and I mean there have been some close calls when I've had the green going west on a bike. So I definitely think that this is a is a is an intersection that needs attention and yeah I mean it. Just goes back to the importance of these split phase. I mean all along 8th avenue. There are a number of areas of potential conflict between at cars, turning left and bicyclists on the bike lane that need to be addressed, and so you know thank you so much for bringing this to our attention, and I think that this is definitely that's something that DOT needs to take a look at thanks, Colin, so do we do we have not do we have an action on this or are we just? We still have the calling user five he or not. No, that okay, yeah yeah. I would suggest a resolution where we write to DOT and we bring up the issue and the you know the way Kelly essentially outlined it, which is that the distance I mean the visibility is very bad at this intersection with and without the timing, it's even worse with the dining, and we recommend you know that the dining be pushed back and probably be pushed back even further, when there is a turn lane for when there is a turn, a left turn or a right turn when it is in the turn right and then that we put back split phase, I mean you know, I think split phase makes a big difference and we at them we had in their toolkit the warning sign. You were talking about Dale, you know that could be put and to Brett's point about keeping the lane it's the bike lane itself unobstructed, yeah. Well, the problem we have with that is that a lot the design which has been approved should not be covering the buffer Lane and they all cover the buffer Lane right. So normally the idea was, you know you are in the parking lane. If you come out of the dining, you are in the buffer right, you're feeling the buffer Lane, except that everybody took over the buffer lanes right and then now, when you come out- and it happened to me today when you come out of the restaurant, you are in the in the bike lane right, and so I think that there is a massive issue of enforcement which is not going to get better until you know middle of next year and then, after that, they have to decide how to enforce all those things that, like sidewalk cafe, were enforced. You know, but we know that between now and then everybody's going to just look the other way so Christina's outlined in motion. Does it have a second? I exactly? Does he have the first? I'm not surprised, I'm at first I'll make the motion and someone else has seconded it. Okay, it was doing it. Okay, christine said it so we'll save time. Whatever christine said, is the motion? Okay, all those in favor of this eloquent motion. Thank you Kelly for coming this way, we're saving you so much, and if you will you say that we are saving you a seat from now on, you did not bargain, for that. Did you can't leave I've been a staff member on these meetings before when I worked for city of Arinda, oh yeah, oh you're welcome. I've done my time. Okay, I'm going to move on quickly to the next item, which is helicopter safety, one second, just to kind of keep it on the recording. Is there anyone against or abstaining or peony? For this title, sorry, yeah are all the votes. Yes, for that motion, are there any abstentions or no's who dares, but we also need to hear from the public. We need to hear from public comment. There's no publishing public comments. Okay, I neglected to identify or recognize the elected representatives that are here aside from Carl from Speaker Johnson's office. Also, we also have, let's see we have emily from Linda Rosenthal's office. We have, I thought we had. Oh, we have Matt from Assemblymember Gottfried's office and we have Maya Burlo from Senator Hoylem's office. Maya are you speaking on the helicopter legislation? Is that Maya who's speaking janine? So I'm I did not get a response from anyone, but I can transfer her over okay. Otherwise, we can like summarize, the legislation or have who is the all right. The helicopter legislation is federal. It's nadler's office. Oh sorry, oh coming through your office, or there are we are. We are talking about some local helicopter legislation, but that is not fully out there in public yet, but the legislation that's listed on the agenda is federal. Okay, we did have a member of the community who brought this to our attention with I'm sorry, I'm blanking on who that was my melody. Can you speak on this issue? You have to bring her over melody is melody. I think it's identified as melody. I think she has yeah there. What would you like me to say I mean I can tell you that it's federal yeah and tell you that the helicopters come for the most part from New Jersey they over the weekend. They flew 87 sorties over Chelsea. Oh my gosh. I can not concentrate anymore, so I'm I do not know exactly how to make a good presentation, but I can tell you it's impossible: they take a route that goes up the water and then over the top of the park circle around the reservoir very often then come down the east side and cross Chelsea. So this is nice. They then go. This is fly. Nyon fly New York on Sightseeing, yes, and it's for it's for a tourist to take shoe selfies, take pictures of their feet with unlaced shoes on sometimes no laces at all yeah and a friend of mine called it crack for instagrammers yeah. We live in an in an enlarged instagram track these days, yeah, okay, so just we just wanted to make everyone on the committee aware of this legislation. Aware of the issue, of course it is. Thank you melody. It is problematic in that it is disturbing the residents of the district and it is not a a vital transportation. That's being addressed, it's a sightseeing enterprise. Of course it is a business and but the legislation that is going forward, I believe, would limit the number of sorties or at least limit, but the legislation would actually keep tourist helicopters from going over Manhattan at all. I thought I thought that was already the law that tourist helicopters could not go over Manhattan. That was the tourist helicopters from the the heliports that we have along the river, our teleports okay, but with it we have no control over what comes from New Jersey and do we know? Do we know where that company is based? I believe it's based in Kearney carney, yes, but they also leave from Linden and from other places in New Jersey. Nothing good has ever come out of Kearney ai, not it the truth, I'm sorry! No, why do not we send them? That's not true. They have great scottish irish food. They did you. Why do not? We send a letter to the elected officials over there? We can, if you look at the coalition partners, the senators have both signed on. I do not know about the representative, but the governor is not on board the governor of New Jersey Right Murphy, so maybe we can write a letter to the governor and say you know. I mean if we do not mind that you have helicopters, but they should not be over Manhattan. Other community board CB7 has signed on CB2 is going to look at this next month. I'm going to sign on to what signed on to back the legislation resolution supporting this legislation, part of the coalition, that's behind the legislation. We could do that too, but I would go one step further and send a letter to the governor saying this is this is really a major issue for our community? Would it make sense to field a joint letter from affected community districts? Well, I guess if we each individually sign on the legislation that works the same way anyway. Thank you so much for looking at this, because those of us in the flight path are losing our minds. How come they did not? It did not exist before. Is this a new company? It's a company that was in New York, but at this point, moved to New Jersey when they were when they were kicked out of New York. That's my understanding, they're exploiting a loophole. That's right! That's right! They designed the loophole and now they're exploiting it right, and that was actually said when the first legislation went through, which I think was 2016 was that well, these people are just going to move to New Jersey and they promptly did that and of course, during the the lockdown, everything was quiet and now they've come back full speed and we still do not have the companies who were disallowed from flying from our little heliports are also not they they've been sued and are paying 250,000 but they're still not obeying the law completely okay. So the ask is to sign on the legislation that that's it yeah. I mean, I think it's always good to write the governor, but it would probably be good for a bunch of community boards to write the governor, because there are a number of us who were in this flight path. They also circled the statue of Liberty and the empire. State building has a contest and the winner of the contest will get a free flight. Nyc go, which I think is the tourist arm of the city is partnering with them. It's that's ridiculous. It's out of control yeah, all right. It's not! Are there any salient comments from the committee members? Otherwise I'm going to go to Alan, Oster Alan, all right all right! Thank you! Thank you, Dale and as a Chelsea resident I'll echo melody's comments, but to follow up on Dale's comment of the loophole is basically from what I understand and perhaps in the legislation there's two sets of flight patterns over our city, one that's controlled by EDC for all the charter flights that have to come in and one that's for. Basically, the tourists which is mandated by the federal government by the from by the Faa. So that's where it's got to change, so it yes they're in Jersey but they're following federal guidelines and that's where it has to be addressed thanks Alan all right. So is there a resolution emerging? Well, I have one more question since melody is saying that they have a partnership with empire state and with the New York City go. Should we send a letter to these people and say you know: do you realize that it's the they are breaking the law in New York City and then you are partnering with people which are doing that. It's not clear to me that they're actually breaking the law as it stands, though yeah I do not think ever. I do not think they're breaking though they're following prescribed, Faa they're a nuisance to the we can say, they're a nuisance to the residents of our district nuisance and they're hazard. But that's about you know. I thought unless you get, you can get the federal government at some point to change the flag patterns. Well, they're, following the they're pulling the loophole, I thought, like Christine, said that you could not fly into Manhattan for safety reasons. You know you know what, if a helicopter crashes over such a land population, so I'm startled that even the federal government would allow these flights into Manhattan. I remember the Pan Am building a hundred years ago. They stopped the flights, so I mean we should also contact, though the because they need goodwill, the I forgot the people who own the empire sibling they should be contacted along with whoever runs the I guess, the mayor's office. He runs the tourism. My understanding is: if the mayor took money from these people and is not going to do anything okay, but at the minimum we could have a resolution to support the legislation you know. So is there a motion on the floor? I make the motion, but I would still as a pro forma move include the mayor, even though he might have taken money. Okay, can I see Varanas seconding or do you have a comment Karen? Well both. I think we should also include governor Cuomo, because Henson River Park state all right. The description right do we have all in favor, okay, so it's been seconded all in favor aye, any opposed any abstentions present not eligible anybody flying a helicopter right now over the city. Okay, the last item before all the new business is the discussion of budget. I think has everybody weighed in on yeah: go ahead, christine we're done. We're done good! Okay! Thank you. Okay! So we're going to open it up to new business and I believe there's there are two items. Yes, we have one about with a health kitchen, Hudson yards alliance, bed- yeah! Oh, yes, let's, yes for 30.! That should be a quick one yeah for 30Th Street, yeah. Okay, so is somebody addressing that? Or should we just briefly summarize, there's somebody what's her name, that's what Patty is the petty, I'm bringing patty over? Give me one: oh she's, here, Patty's here, right, hi Patty. Can you hear me? Okay here you go yeah. Can you hear me now? Yes, okay, hi everyone. So I have an item of new business that I would like to put before the committee for anyone who does not know my name is Patricia Maltesos. I work for the Hudson Yards Health, Kitchen alliance, we're a business improvement district and we are within CB4. We go from 30th street to 42nd and 11th avenue to roughly 9th avenue. So the item I want to talk about today is adding some green space to 30th street between nice and dire avenues. So if you could go to the I'll show you so this is the area that I'm talking about it's 30th street between ninth and dire there's, a number of Ddc construction project, sort of storage areas on the site, some on 31st street some on 30th- and we found out recently that Ddc will be turning over a portion of this area to DOT, meaning it will be paved and you know back into regular use. The specific area is on 30th from dire to ninth, so it's the eastern portion of this orange. Can you move the pointer to the place patrice patties is discussing I'm sorry Patty. Where could you mention that again, yeah sure it's on 30th street between our and ninth? So it's the right side of the screen yeah that area there so that a little further over to the right janine? Oh this one here yeah that yeah that Orange area there yeah. So it's about half a block long! I mean a long block long and it's a little around two lanes. I would say it's sort of hard to tell on this diagram, so the bids request is when Ddc paves this would be to add or allow us to add planters as a greening space instead of turning a portion of it over to vehicular traffic. We see this as a really congested construction, heavy block, and we would like to do a little interim greening before we could work through a longer term plan where we would you know, do other types of enhancements, but for sort of the foreseeable future we'd like to do something- and we see this as an opportunity since D.O.T is about to take control back over this portion of the street. So the bid would be definitely available to put together sort of like a design plan or meetings with stakeholders or you know, financially contribute any of the above we're just looking for support from the community board to be able to start moving forward. Does anybody have any questions or other comments about the request? I wanted to add that the building at the bottom is the. What is it called the Farley building? No, the Morgan Post Office, the Morgan Post office, but it is five stories of that are being converted to a commercial building. So this whole area is now is in one or two years will be. You know active with a lot of a lot of pedestrians or commuters coming in coming out, etc. So this is not just the back of the post office anymore. It's much more of an active area. I have a question patty. Why is the I mean if a lot of, if the purpose is to green much of this? Why pave it? Why not leave areas open for you know in- ground planting? I think that could be a great longer term solution, but we're just trying to deal with the DOT deadline. They said in a month they will be giving this sort of back over to the D.O.T. So we thought of a plan that was pretty quick to implement and planters are pretty quick, but yeah in- ground plantings are more permanent. Green spaces is the long- term. I think that's the long- term vision, but if they paid it, then you got to unveil it. I mean yeah, pave it, for I mean, would not you make it have a plan up front so they do not have they do not end up paving or at least leave it for now you know leave it. You know just not do anything until the bid has a plan and then and then they can. You know pay according to that plan yeah. We want to take the opportunity because we do not want it to revert to vehicular traffic and for people to sort of get accustomed to such a huge expanse of you know, traffic lanes. We want to sort of take sort of take a lean back visually that it's a green space and eventually make it better for pedestrian or other use. Is it paved now? I think underneath yes, yeah, underneath it is it's torn up, but it's yeah they're, just it is paved. It's paved and messy. It's paved already, so they're just going to put a topping on it. Yes, yeah and then they are going to paint lane of traffic and instead of painting the lane of traffic, we're telling them painter Lane, where we're going to put green and then okay right, oh yeah, thanks hi Patty, so a great idea, it's like right by the spur the highline spar it's going to be. It is already a major access point for the high line, given that it I do not think it gets a lot of daylight there with the spur at the end of the day blocking late afternoon and the Farley's kind of lacking the the post office blocking all the good daytime sun most of the year except the summer. You know people have a lot of you, know art and culture or experience with a highlight, maybe like a public art, display there long term. So you do not have to worry about sunlight, and you know something that might be a really cool gateway to the high line. Just throwing that out there. That's yeah, that's a good! That's a good suggestion for the long term. You know vision for the space. The high line has an art program right. Maybe you can definitely do yeah buy into that. Well, you know anything is better than the lane of traffic yeah. That's my motion, yeah. I think we're generally supportive of this and like make a suggestion about, like potentially partnering with highline for an art program component right, but the more green in this area. The better do we have a motion. The support I mean we support the bids. Okay proposal and Martin is second all those in favor aye, okay, you're, unopposed. Anyone peanutty great! Thank you. Thank you. Everyone do we have a the representative from the Winston school aviva from yeah, or is it Paul from the from the book I'll transfer Paul over okay, hi Paul? This is regarding 16th West 16th street. We had some back and forth between the dot's interest in providing the street for outdoor school use and Paul can fill us in on where we're at once he goes live Paul. Can you hear me? You went I'm really here, hey Paul here I am great. I wanted to show my video there we go here. I am here. You go quickly. Can everyone else go mute so that I can because we're I'm getting a little static, so Paul can speak. Okay, how's that you know I'm going to do this hang on how's, that is that good, yeah? Okay! Thank you! That's better good! My wife was on the computer over here and it's just background anyway yeah. So we, the woman from the Westport school, uploaded a an email to a neighbor who said: does anybody know anybody on 16th street that we could talk to and then that kind of copied to me so I have not actually talked to them to the school. Yet it looks like D.O.T has said they can use our block for outdoor recreational activities and they can close it down to parking cars during those periods. The whole thing is just unplanned a morass. We're there's mixed feelings on our block about whether we want to welcome them or not, but not under the current circumstances. It's really hard to imagine how this would work with the current street cleaning plans of once a week. People park their cars and do not move them for five or six days if, with a three- day notice that they're supposed to move their cars because the school's going to be using the block they're not going to move their cars, then what happens? Is the city tow them or do they get tickets or the whole thing we do not understand? I'd like to, I talked to Matt Greene he's willing to sort of sit us down to talk with the DOT and with the school. What we're thinking is if we could close off if we could deny all parking during school hours, however, the school wants to define them at one end of our block every school day, then the school should have access to that section of the block on a regular basis. Without oh we're going to be there this day or that day, and we got to move the cars, we're not going to move the cars in order to get the space. What are we going to do just consistent spot on our block every school day during whatever hours the school wants no parking and just set it up. Like that, then they can close up, and I argue that it should be at the west side of this end of the street because they can block the traffic right there. So the traffic does not come down the block. They only have to put a barricade that went into the street because maybe they'll come down the other end because they do not know about it, so it makes it just convenient. It should make it more convenient for the school and it makes it more convenient for the people in our block and it makes it safer for the kids, because they'll have a larger area to play in and also that's the near end of the block. Where there's less construction, we only have five or six construction projects on our block the further down. They get the more there's going to be trucks, backing up loading stuff scaffolding, the let me show you guys so anyway. Matt Green is orchestrating that discussion between us and I think that's the next step, all right great. Well, thanks for giving us that outline yeah, it was evident from all the correspondents that the stakeholders were not engaged in the process at all janine. Can you just check, I think, you're saying that maybe one of the call- in users is from Winston. I thought that was the person who was Avica so was Aviva and Sandy were supposed to join for tonight, but I do not see them on the the attendees list. Okay, let's color in user five, not one of you, no okay! No, so I mean. Can we help you with this Paul or is it something that you want to see how the how Matt's stewards it? Let's see how Matt Stewart's it? Okay, we should. You know to the extent you can job on D.O.T to be flexible in their arrangements here. That would be useful, but other you know like you'll be so what we'd like is for DOT to put up signs and say no parking on these particular spaces between seven and three f. Whatever the school wants, I do not think maybe Paul, maybe you could just send christine, and I like what you do outlined as what you see as the best solution right now, so that we are aware and can advocate in you know when we're called upon. I wrote that block today, based on because I heard this was going to come up several things. One is roberta brought up the safety of the children with all the construction, so Paul answered that portion. I guess that partially, but also, I think, there's an experimental loading zone that was put there. So how will this affect the loading they may have to move the learning zone for the residents on that block? I think I do not know if this is a good block for the. I do not mean to insult you. I do not think it's a good block for this to for this to be open streets for the school. So if it was adults and people just got going by that's another situation, but for school children, they need a lot of supervision with all the traffic and all the stuff that's happening on that particular Block Winston says they were going to provide all that supervision. Their alternative is to go to 17th street. Where and D.O.T says they can't do that because of the parking garages there. Another alternative might be 18th street, but 18th street is a wider screen, gets a lot more heavy traffic than even we get we're kind of sympathetic to Winston's problem. Okay, my concern is also about the loading zone, because I think that people so DOT may have to move that it needs to be organized. What is this loading zone? You are talking about, there's a temporary loading zone and two sections on our block. That's parking, okay, but yeah, and one of those would be at that near end of the block. The construction is to the to the left to the construct most of the construction. The construction is east in the middle eastern end of the block do not. They need all the trucks to go through the street anyway. Well, if they go through, the trucks are usually there early in the morning and late in the afternoon. Oh during the day you know the school is supposed to be close. School has said. If somebody comes down the block that needs to be there because they live on the block. The schools pull the children aside and let the traffic through okay, so I mean there was no. There was no perfect solution. There was no perfect solution. Send us a note, that's a good idea! Dale! I will do that yeah. Please send us an outline of what your question is, because it sounds like the only decent one right now right. I think with that, is there any other new business? Then I think we are going. I think Roberto Roberta had her hand up. Oh I'm sorry and diagnostic as her hand, up with a couple of things number one. The construction starts midway on the block. That's number one: we have the irt substation the reason we put those loading places on the block, the traffic we had, so that people could get deliveries and it would take some of the traffic, so it would not block the traffic coming down the block. We have a lot of seniors on this block, who are with walkers, who are walking cane and walking slowly and if you're going to put tents up, and if this is going to be on the sidewalk, let them do the sidewalk on 17th street. There are other. I do not know why they always wind up coming back to 16th street I'd like to see what number one they did not contact us. We did not hear anything about it number two. As far as I know, they did not contact you all about it either number three. They did not give us a report as to why 18th street is not viable or 17th between sixth and fifth, this is a highly residential block. We've had all these construction sites that we have been living with for the last couple of years and the stupid bus that we had. So I do not know whether the D.O.T has something against us or what, but what they always say. Let 16th street do it well, not this time around, not the last time and not this time. Honestly we're going to put up a major fight about this. I mean the kids should have a place, but they should have a safe place. I mean half the time. I do not know where to go with the dog, because on one side we have all this jackhammering and on the other side we have more construction, there's no place to walk. So where are these kids going to go? Okay, diagnostic one other point: could I make please briefly the we had submitted two plans for open streets on our block, which we never heard about from D.O.T, okay and then all of a sudden they say oh yeah, but we could put a school like we can put school exercise ground in this block, so I mean Dot's lack of communication here, yeah just appalling. What about diagnostic diagnosis? Hi, it's Susan umarov? How are you I'm sorry? I do not know why my ipad says that, but anyway, because we own laboratories at one time I'm addressing today, because there seems to have been a letter that CB4 had written to gail Brewer in November of 2019 regarding the kiosks that are on 8th avenue and their request. I'm sorry is this a new item? Yes yeah! Okay, have we are we? Are we we're closing the we're closing up on 16th street? Then, okay, please go ahead. Sorry, I'm sorry! No! I thought you were dressing 16th street, but please go ahead. Okay. So there was a letter that was addressed by CB4 to gail Brewer, requesting for the removal of the link stations on 8th avenue on July, the 13th of 2020 Gail Brewer wrote a letter to Jessica Tish about the link stations on eighth Avenue, but also included Cb4's proposed alternative site which would be put on 10th avenue. There's a bit of confusion, as we have not seen any official letter that came from CB4 asking that those kiosks on 8th Avenue be replaced on 10th avenue. So at this time the community is concerned that surrounding 10th avenue between 14th and 23rd street. Regarding the new link stations, there seems to be an oversight to what is actually happening in our community on 10Th Avenue and the lack of outreach to our businesses. Schools, restaurants and residents needs to happen, and at this time, there's a group of galleries, building developers, schools, businesses and residents. That would like to speak to this matter, shifting a problem from one neighborhood to another neighborhood's, not the answer, and we request for Cb for at this time to review the recommendations of moving the kiosks to 10Th Avenue. I have more, but I think, everybody's tired, so I want to take that so then. What happened, then, is that we said we wanted to remove them. The people of Eighth Avenue the blocks. There said we wanted to remove them. Gail Brewer came back and said. Well, you know if the agreement we have with DOITT and the links is that when we remove something, we tell them an alternate. The people who came from Eighth Avenue came to propose that told us that they were. They did a an outreach and a survey on 10Th Avenue and they gave us the alternate location and so yeah. Let me let me finish that let me so that's what we did. We proposed those because the person who was in charge, including Pam Wolfe, which usually is pretty thorough in our outreach, gave us those information. Now, if you are not happy with those location by the way, nothing is happening right now. Right, yes, that I agree with, we do not have. We do not have confirmation, we do not have denial, we do not have anything. Nothing is happening. So if, if those locations are not good well, you know you should send us a letter and say we totally oppose those locations and tell us where you want them to be well. We do not want to push anything to any other place, that's a problem and we can't function without having a location, okay, but just to back track on the conversation about 8Th Avenue, 23Rd Street was documented on 23rd and 10th with photographs and was spoken about at a police block meeting and also with Pam Wolfe, and it was decided at that point that they would not discuss the 10th avenue issues with the kiosks that we they would start first with 8th Avenue. So I'm not quite sure where that change happened. In the meantime, I have documentation and photographs of what has happened and what's happening now with the streets. We have three restaurants and a school on one of the proposed streets, which is 22nd and 23rd street, which is just a half a block from a kiosk. That's already in existence a block from there. We have a catholic school, we have the park and then we have nursery schools and the next Kiosk goes in front of the galleries, and they have also said that there is something they have outreached with DOT proposal for the installation of fine art sculptures on that street to revive the gallery block there. No, I hear you, I hear what you're saying I'm just saying. The only thing we can do is that if you send us a letter saying you do not want this location, we would like you to tell us where this should go, because that's the problem we have well. That's just. I do not know if that would be the. I think we have to discuss the kiosks as a situation of a problem in the city, and I do not propose to tell you kiosk in the city for years, and I can tell you we have done every possible thing to reduce the numbers we put in our neighborhood and including many meetings between Gail Brewer and DOITT and Lynx. So this is. This is something on which we have spent an enormous amount of time. Again, I mean send us a note and we'll take it from there. Okay I'll have letters from all the people in the in the neighborhood. You can send them and then we can bring this up again, but thank you very much for your time. Thank you good night. Thank you. Thanks all right twice that I think we're going to do a journey. Thank you. So I have a second on that. Second, what a monumental meeting! Thank you all. Thank you all. Thank you. Thank you. Thank you.",
            "summary": "I'm joined by my colleagues, lily, Gordon Covid-19, Brian, Parrott and Caitlin Toner from Dot's bike share program as well as Colleen chatter goon from the Manhattan office, who many of you also have the pleasure of working with so last year, DOT embarked on our five- year phase three CitiBike expansion alongside our partner lifts, and this is going to double the size of the bikeshare system, Triple, the number of available bikes in the program and since CitiBike launched in 2013, new yorkers and visitors have turned time and again to the CitiBike system as a healthy, safe, fast and affordable transportation.\nThree expansion in Manhattan started this spring and I will let you know lily, go into a little bit more detail into what we've done so far, but as the bikeshare system grows into new neighborhoods ridership into the existing service area is going to grow as well.\nSo I wanted to thank the committee again for giving us the opportunity to present- Covid-19 And I'm, with the bike share group at DOT.\nThese include seat posts and handlebars baskets things like that, as well as disinfecting bikes when they're docked at high use stations near hospitals and the crews are using social distance practices in the field and while handling bikes and then the other key piece is the critical workforce membership program which began in March, where Lyft and in partnership with the city was able to offer free member annual memberships to essential workers.\nThis will support increased demand from the phase three service areas, folks on the outer part of the system coming in as well as help us meet existing unmet demand when riders can't find a bike or a dock.\nIt will be a rolling installation and we will be covering multiple community boards at one time coming back to community boards over the course of the following years, and the iterative planning process will help us address changes in demand.\nWe have a few different ways that we want to do this infill project through our design toolbox, so the first is to add new stations, and the second is to expand existing stations by adding new docks to stations that are already on the ground and then the third is creative design solutions like 3d bridging which you can see here on in this photo, which will allow us to have stations that are both on the sidewalk and road bed.\nYou know whenever you put something on the sidewalk, the people going to the lane, to the parking or from the parking right on the sidewalk, and it's not something we want to encourage, especially because you are just acrosss a large complex with a lot of seniors.\nWhy does not just the thing is that you know once you have that you have people riding on the sidewalk to get to the station In our neighborhood.\nI think, especially since we've seen with Covid-19 We've, seen less compliance rather than more compliance when it comes to sidewalk writing and by the way , a lot of what we did not used to see before a lot of CitiBikes on the sidewalk, which is upsetting so the bottom line is we do not want it on the sidewalk right.\nThank you all for coming and being here, You know, I think it's great that you're putting these in the area, especially if you put them on the street, but the thing is: If I.\nIt's, just for us in Manhattan and just parts of Brooklyn and a neighborhood here, And there thrown in what's your connectivity plan and what And like, if you, if I'm going to buy from Coney island to my office or to my work, I, need electric bikes, so So, first on the electric bike, so Lyft is continuing to add new electric bikes to the fleet.\nI'm a frequent rider, but not only do I think that you know having docks on the sidewalk is dangerous for pedestrians.\nYou've heard me mention this before, because we've talked about it in my professional cap with gansevoort street issues and having a sidewalk station there, but this is significant, given the fact that when the city begins to bustle again, our sidewalk space will be precious and we need to prioritize people as much as possible in terms of their feet and then bikes and then very small space leave for cars.\nOne thing I would be very interested in seeing DOT implementing with this expansion of the CitiBike program is taking another look at the bike stations and seeing.\nIf there's an opportunity that, while we're in the street, where is it, which is a great place to park, bicycles, to incorporate free bike parking racks for nine CitiBikes, so that way, riders, that are that are doing one better than CitiBike, which is owning our own bicycles and maintaining them ourselves will also be part of the amenities that are that are happening to us.\nWe have partnerships that provide discounted memberships to NYCHA residents and snack recipients and wanting to make sure folks know that those are available, and also just doing cyclist, cycling, education, so that people understand this is a system that works for me.\nAre the rules of the road, all those kinds of things, so we're looking, I think, at trying to figure out how to maximize those opportunities, how to expand even to folks who are low income, but are not nitro residents or snap recipients and strengthening our partnerships with local community groups and local cycling groups that are already entrenched in their neighborhoods and understand the needs of their constituents.\nIs you know, sort of reiterating what christine said is when you put bike track on sidewalks, you just send a message.\nYou know citywide plan, so you know, there's lots of good reasons why putting bike parking associated with the CitiBike docks Would be, would be a brilliant idea, and you know particularly considering that your current program for putting him in the street is not viable because of the way it's established been established, thanks, I had an individual complaint to me, or you mentioned to me that the bikes were not stopping on time, especially when they pressed on the the the the part that stops the bikes or makes an attempt to stop the bikes.\nThat looks like a wrench on the dock and you can press that button which will take the bike out of service for other riders and also signal to the operations team that it needs to be looked.\nYou know the preference in this community and at least in this committee, and this community board would be to take space from cars instead of pedestrians when it comes to placement of racks or docks.\nBut to the second question- Or I, guess your second point about city rack installations over the last year, I will say that Kova definitely put a halt, as one would guess, to a lot of our non- essential work for some time, but our public space unit has been working on our bike recovery plan to essentially kind of cover areas: City- wide, where we are installing additional bike, parking facilities and capacity to help with this increased demand in cycling.\nWe look to place stations near schools and any really large amenities, so school museum shopping, plaza anywhere, where there's going to be a lot of activity and people coming to or from we want to have a station there.\nAnd, we'll frankly, continue to look into as outdoor dining is becoming a more permanent fixture in New York , City Thank you another wrinkle, dale and reason to take up more space from cars for cyclists.\nI can read out your question if hello, yes ,, please hi several of these of these racks and thank you for expanding the one on West 22Nd street, better to have the racks there than the cars, even though some folks on the block were a little upset that they saw so many bikes.\nIt has become more and more dangerous for pedestrians, especially elderly people, to get their you know, bikes are on the sidewalk Although I've seen those I mean, I.\nI do not know what we can do, but if you're adding all these bikes, I'd really like to know how you're going to enhance enforcement so that the streets are safe so that pedestrians and other cyclists, I mean the cyclists, who are abiding by all the rules, are in as much danger as the pedestrians.\nIn addition to enforcement, that we need to have a renewed sense of education, we have a lot of some of our typical education components like on- street teams and going to schools going to different businesses to educate people on how to safely ride a bike and what the rules of the road are.\nThink it's a great reminder not only about the need for enforcement, but also the need for education, and you know, I think, the, as well as looking to place stations in the street as much as possible, which we appreciate.\nDoes your mobile interface have like basic instructions for riders on riding safely in New York, or should it the city, the CitiBike app I know, there's been some renewed conversations around rider training and having folks go through a quick demonstration or a quick set of slides on their phone about rider safety and rules of the road, but , great hi, I tuned in a little bit late, but Brian weber, a public member, a resident of West, 36Th Street and the co- chair of the very nascent Avenue did not know that it was coming back, but residents are very glad to see it reduces the number of cars that double park on that corner next to other cars.\nI'd, really like to understand how we got to 70, and maybe we need a bike lane on 22nd street.\nYes, there is paint, that's Jennifer Jimmy, of course, thanks Brian and so Susan, just to speak a little bit more to you know your request, your suggestion of adding in a bike lane on 22nd 20th, street.\nWe DOT is willing to look at So thanks for your support of like infrastructure, acrosss, the city I think we have fairly exhausted this subject and we need to move on to some other topics on the agenda.\nI have an open street between seventh and eighth and anything would potentially remove parking I believe we have a presentation from our friends at the EDC on the pier 79 ferry expansion.\nWe have seen a steady increase and recently as high as 60 to 70 percent of ridership from last year is actually riding now, something that shows us that our recovery for our slice of the ridership of the transportation modes in New, York City, is starting to see that recovery, and so we're excited to see those numbers come back.\nEverything was purpose built for NYC ferry, meaning that we do have lower emissions, quieter, vessels, a more stable ride, which is generally noticeable when you're on some of the longer hull, routes, and also one of the things that we think is important is that we're also creating less weight than some of the older vessels just because technology has improved and designs have improved on catamaran style vessels in the harbor please.\nFirst of all, there are changes to travel, behavior that are working in our favor and by in our favor Fewer people are using the shuttle bus to access the pier 79 area, either to or from the landing which, from a local perspective, is good information, because that means that fewer people are creating demand for those buses to come back to a full system.\nThey are still committed to doing so next year and sort of finding the times that it makes the most sense to bring traffic flag people and to put them at the two intersections that are needed in terms of other operations.\nIt does sound like there continues to be both an interest and a need for some long- term visioning in terms of how to recreate access points here, which is, you know, a longer and bigger capital, planning, process and project.\nI. Definitely think that we would be much more supportive of using existing buses absolutely, but would also use this moment to recognize that waterways is actually in a bit of a violation of their lease, given the fact that they use the area for parking and layover, which has become a problem in particular at night time and Jeffrey.\nWhat they've said is that yes, of course, the total slice of people who are using the ferry and the terminal is much smaller, but what they are surprised by Is that the proportion of those people using it is even smaller for bus access, meaning that, since people who were using buses were generally going towards places further.\nYou know they have retained, essentially the local customers and they have lost the faraway customers if local, If the difference between local and far away is distributed on their bus, routes, I think that's what it sounds like and the bike station.\nThink that should encourage that, and maybe a good signaling sign signage would be a good thing to do to say you have a protected bike lane so and 42Nd. Are you talking to MTA to try to get the terminal to move over or not?\nIt sounds like you're saying that the in order to leverage the m42 SBS for ferry, riders, I think you're, suggesting that there be the terminal, be moved to be in front of pier 79 displacing the buses, some of which go acrosss town, but many of which go in many directions, not served by that.\nYes, the area from 29th to 44th street is Kind of the last big, not yet in process fully plan planning zone for Hudson river park, aside for our river research and education center down in Tribeca, and it is in the queue and we have been working on an RFP for that area, which is pretty complicated given all of the transportation and other uses that have leases and lots of issues.\nIt's, something we're going to have to be talking with you all about, because I think it's probably a zone that would be addressed almost in phases, because there are more open space opportunities in some areas and in some areas it's really more like enhanced, vehicular, passageways or pedestrian passageways.\nThat's going in a north- south pattern, given the number of subways that are doing, you know pretty close to the same thing, and so making ferries competitive at scale has always been really challenging.\nAlthough the marketing has changed, I, think the fundamentals have not, and I think New York City is still putting the people at the back of the bus, and I wanted to give you some of the examples.\nWhy are the pedestrian restricted to the sidewalk and crosswalk when we have started to do it up to the destinations that we wanted and while we use the roadway requires permit and payments except for parking when so many activity, private activities are permitted to encroach on the sidewalk, with no permit and no cost, and although we support covered 19 for small businesses, why would we let permanent open, dining privatize, the curve?\nIt's called congestion, but pedestrian and cyclists have to ask for a permit and even on the sidewalk pedestrian, have to ask for a permit when people chant industry demonstration, when car screams and Yell Honk in the streets it's normal and when marchers block in the street, they go to jail, but cars block the traffic I mean I just wanted to open the discussion for everybody to chime in and give their thoughts and see whether we could design a program.\nThere has been totally uneven distribution of street space between the pedestrian and the cars 27 of New York, City's roadways of our cars, pretty much, but it's for a very small percentage of the population, because car ownership, as we know, is much lower in Manhattan and other parts of the city compared to Outer.\nYou know compared to auto boroughs and suburbs, so I think now, with curvat 19 situation, claiming part of the parking lane for expansion of sidewalks could be some.\nSo I, think we do need more of diversity, diverse opinion on our committee, but the and the last thing I wanna You know.\nOkay, that you know we do have people that have a good deal of expertise on our committee generating a lot of these thoughts.\nIf we are trying to think strategically and tragically about how to be, you know more impactful, going forward, there's an element of scale and then joining forces if there's some common principles or even just policies that multiple of our community boards in Manhattan agree that they want to support.\nYou know it's, it looks like the whole city is functioning for the cars and the drivers and not for the people, and you look at all these layers and you see that all everything is slanted.\nWe put this because you know we had, especially when the bike lane in Ninth Avenue was coming in, and so we were suggesting red turn arrows because of the danger of people crossing green light, green lights.\nThe entire city has got these split signals everywhere, especially in Manhattan, and it started, I think, with our transportation committee's discussion so and the bike corrals.\nA lot of times is not curb adjacent because the bike lane is next to the curb, and then you have the street dining kind of in the parking lane, which is between the bike lane and the traffic.\nIf somehow the committee could recommend, I do not know who's issuing the permits for the street dining, but just some sort of limit on how close they can get to a corner where there is a conflicting turn movement that would probably help just keep everyone a little bit.\nSecond thing: is, I think we know the DOT is supposed to come back to us with a study of the rest of the Eighth Avenue So I would be happy to to send a resolution covering those three things.\nHave you know a warning to drivers that there's a hidden bike, lane That goes for a lot of places in the city Maybe.\nThis is before we even start talking about the pedestrian issues and ensuring the clearance on the sidewalk thanks That I bike on 45th and 8th.\nYou, know, I'm sure nobody on this in this committee ever is on a bike and runs a red light, but I always look both ways.\nThere are a number of areas of potential conflict between at cars, turning left and bicyclists on the bike lane that need to be addressed, and so you know thank you so much for bringing this to our attention, and I think that this is definitely That's, something that DOT needs to take.\nAnd so I think that there is a massive issue of enforcement which is not going to get better until you know middle of next year, And then, after that.\nI'm, not surprised, I'm at first Did , you can't leave I've been a staff member on these meetings before when I worked for city of Arinda, Okay, I'm going to move on quickly to the next item, which is helicopter safety, one second, just to kind of keep it on the recording.\nThey designed the loophole and now they're exploiting it right, and that was actually said when the first legislation went, through, which I think was 2016, was that well, these people are just going to move to New Jersey and they promptly did that But they're, still not obeying the law.\nWe send a letter to these people and say you know: Do you realize that it's the they are breaking the law in New York City It's, not clear to me that they're actually breaking the law as it stands, though I do not think they're breaking though they're following prescribed, Faa they're a nuisance to the we can say, they're a nuisance to the residents of our district nuisance and they're hazard.\nThis is the area that I'm talking about it's 30th street, between ninth and dire There's, a number of Ddc construction, project, sort of storage areas on the site, some on 31st street, some on 30th- We found out recently that Ddc will be turning over a portion of this area to DOT, meaning it will be paved, and you know back into regular use.\nWe see this as a really congested construction, heavy block, and we would like to do a little interim greening before we could work through a longer term plan where we would you know, do other types of enhancements, but for sort of the foreseeable future, we'd like to do something- We see this as an opportunity since D.O.T is about to take control back over this portion of the street.\nYet, it looks like D.O.T has said they can use our block for outdoor recreational activities and they can close it down to parking cars during those periods.\nI. Do not think it's a good block for this to for this to be open streets for the school."
        }
    }
}