{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB14",
            "channelId": "https://www.youtube.com/channel/UCxCfoSInadl-4i3F70zDt1A",
            "title": "Community Board 14 Public Hearing",
            "publishDate": "2020-10-22",
            "shortDescription": "Public Hearing\\nCommunity Board 14\\nBrooklyn\\nWednesday, October 21, 2020\\n6:30 PM",
            "lengthSeconds": "2:55:40"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB14",
            "normalizedName": "Brooklyn Community Board 14",
            "twitterName": "Brooklyn Community Board 14",
            "youtubeChannelName": "Brooklyn Community Board 14",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_BAkpXTYFoKdHVRvswVgtg",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "oi53rrCC_DA",
            "fillerWordCount": {
                "uh": 471,
                "um": 448
            },
            "readTimeFullTranscript": "92 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "units": 59,
                "building": 57,
                "housing": 51,
                "clients": 33,
                "shelter": 28,
                "years": 28,
                "project": 27,
                "speakers": 23,
                "member": 22,
                "concerns": 22,
                "hearing": 21,
                "neighborhood": 21,
                "percent": 20,
                "conditions": 20,
                "plan": 19
            },
            "wordCountSummary": {
                "housing": 13,
                "units": 12,
                "building": 10,
                "plan": 7,
                "shelter": 7,
                "project": 6,
                "work": 5,
                "concerns": 5,
                "developer": 5,
                "street": 4,
                "location": 4,
                "concern": 4,
                "neighborhood": 4,
                "years": 4,
                "developers": 4
            },
            "fullTranscript": "And Matt are we waiting for other members of your there's yuri? Are we waiting for other members of your team to begin or can we? I think we can get started now and I think other folks. If other folks should jump on to answer questions later, then I'm sure that could that could happen, but it's 6:30, I I'm all about being prompt, so I think that's great okay, that is great. Then then, Mr chairman, take it away all right. Thank you and thank you Matt. I certainly appreciate that this public hearing is called to order at 6:31 on Wednesday October 21st 2020, virtually via Webex. The purpose of this hearing is to hear public testimony by community members with respect to a plan by the New York City Department of Homeless services to open a 200-bed general population, men's shelter at 21, diora pool place, Brooklyn New York, operated by the black veterans for social justice. Members of the public were asked to pre- register by to speak by becoming the pre- requested speakers or aspect of name whether they live in the district and their organization. If they are representing an organization. Those speakers were asked to also provide their addresses email for the record members of the viewing the meeting on YouTube and would like to comment on this issue can email. I n F O info at Cb, 14, Brooklyn, brooklyn.com and those emails will be collected for the record. Please include your name address and organization, if applicable, in the emails. Members of the board, who are participating in this hearing via Webex can use the icon to raise his or her hand or ask to speak in the comments on the webex screen. Please, when you speak clearly state your name prior to giving testimony. We are joined by representatives from the department of Homeless services and black veterans for social justice, and I would just like to acknowledge the presence of Jelani Mashariki, who is the regional director of shelter operations for black veterans for social justice of Course Assistant. Commissioner, I believe we are expecting at least Yuri Sanchez, Sonja, Russell and Daniel Nicholas. So at this time I'm going to ask DHS assistant, Commissioner Matt Borden, to begin this presentation. Thank you so much chair, Powell and thank you so much sean. It's good to see you both again virtually we're here tonight to talk about the shelter that's set to open at 21 various place, to be clear. We announced on this site just to start about this site. We announced on it back in 2019. At that point, we thought it was going to be opening in 2021. Now it's 2020 and we're looking. We think, probably that the site won't open for another two years from now this there's. Obviously the pandemic has played a role in slowing a lot of things down, including this site. So just so everyone's aware, when we're starting talking about this site, when it might open, is not for a couple years away, and I promise and we're committed to certainly having conversations about this site previous to it, actually opening so good to see everyone virtually. My name is Matt Borden. I'm an assistant commissioner of the Department of Social services and the job that I have for the city is to go around and talk about the work that the agency does certainly in regard to homelessness. Part of the mayor's turning the tide plan, which we announced back in 2017, was what was basically to sort of for the first time, come up with an actual framework on how to create a shelter system that would be both beneficial for communities and for also for our clients and really rethinking the way that we've done it and that and that and that plan had four pillars, and the first, of course was prevention right. So, of course, previous to this administration, under the Bloomberg administration, there was a program known as advantage advantage, basically provided vouchers for folks that were in shelter to have an apartment which makes a lot of sense. Unfortunately, back in 2011, the money for that program was pretty much unceremoniously cut. Not surprisingly, all the folks that were living in apartments using the vouchers were sent back into the shelter system. We saw a real spike in homelessness, so one of the first things that this mayor did when he came into office was figure out. How can we bring that program back or a program like it? So we can make sure that folks that are going to be re- housed within our system actually who are in our system, can actually find a place to be re- housed and I'm happy to say that we've actually re- housed more than 150,000 new yorkers during this time, which is pretty amazing. The second part of it, of course, was prevention, making sure that people on the front door who are at risk of becoming homeless did not become homeless, so we've actually helped more than a hundred thousand new yorkers keep their homes. We've expanded legal access and legal assistance through our first ever in the nation right to council program for evictions and we've actually seen evictions. This is pretty remarkable. We've seen evictions by Marshall's drop by more than 40 percent since 2013.. Obviously, right now, evictions are halted, but previous to Covid-19. We had really seen a lot of improvement in that regard and then, of course, we were, you know, had a whole section regarding street homelessness and then, finally, we were talking about transforming our approach to Shelter and we wanted to phase out more than 200 shelter sites that did not meet our standards, including closing down more than seven percent of Giuliani Europe cluster programs. While we at the same time, we wanted to announce an opening, 90, new shelters and thus far we've announced 74 74- 21 durian place is one of those with solid providers established non- profits that are running those sites that are going to provide excellent care for clients who are in these sites and as well as be good community partners, because it does not matter how well a shelter does its job if it does not have a good relationship with the folks around it part of also the work that we're doing is really trying to advance an early in advance whenever we can, and so previously, under the previous administration, the shelter would open up and the night before folks would come in, and it was terrible. This plan that we've incorporated we're trying to give communities as much time as possible and, as I said in this case, we're more than a few years away so right when the shelter does open its doors. Two years from now, we can make sure that we have a real communication in place between the neighbors between the shelter between the city to make sure that, as soon as the doors open folks can be greeted with in a hospitable nature, we can make sure that any kind of kink can be worked out before the doors open, and so that's basically, why we're here we're very excited. I'm very excited to be working again with black vets for social justice. They operate a number of sites throughout our system. They do a fantastic job and it's a pleasure for me to hand this over to Jelani and let him talk a little bit more about the work that they're going to do and their vision for this specific site and then, of course, we're happy to answer any questions that folks may have so Jalani. Please take it away, however, this works yeah. Am I good you're good, all right, cool good evening? Everyone. Thank you very much chairman. Thank you very much community board for team members and those that are listening and those that are online participating. I'm the regional. My name is Jelani Mashariki, I'm the regional director of shelter, operations for black veterans for social justice. Currently, we've been in existence for over 40 years here in central Brooklyn, servicing, not only veterans but also our homeless individuals, and we provide a multitude of services. One of the services that we provide is temporary housing for our for our clients. Currently, we provide at different sites currently at the sites that we provide. We have different programs, we have an independent living program which we help clients move into independent living and we house clients through various different housing subsidies or non- subsidies, that's available to them, so that will be going on a dairy place during a place which we're very excited about, and clients normally clients wake up in the morning. They are this programming daily, independent living program, mental health programs, wellness programs, housing programs, job readiness, programs, different programs and workshops that we have available for clients and then they eat lunch. Then they go back to the programs or employ if they're employed there they'll, let they leave for the day to go to employment. Clients do not lay around they're actively involved in the services that we provide on a daily basis and we've continued to provide these services throughout the current sites that we have after lunch. They continue to attend workshops or leave the facility to link with other providers and resources that we connect them with on mostly job development, employment opportunities or housing, or anything that deals with their wellness or their health care. At that point about five o'clock residents I have dinner and then some recreational activities and workshops continue in the evening is a 10 p.m. Curfew or residents must be back in by 10 P.M unless they are working. If they're working a late pass is extended to them to help them facilitate their working, their clients will also be saving and Bvsj has done an excellent job of housing, clients and back in the permanent housing. So we're very excited about this opportunity to collaborate with the community and and work with the community board so that we can be active participants in servicing the clients that will be their derivate place. Okay, thank you both before we move on to to take questions and comments from board members I just wanted to mention or to acknowledge, hopefully the presence of bridget Mcbrian from the jewish Board of children of family services bridget. I hope you're here. Yes, I'm here great, thank you for joining us and, of course, Stephanie tomlin, who is executive director for the kings theater. Thank you also for joining us and I'm expecting to hear from you, hopefully in the in the public session, and here thank you. You're quite welcome our assembly member Robert Carroll, I hope, has also joined us. Bobby are you? Are you there, but I do not see the assembly member is here yet we are expecting. Oh okay, yeah, hopefully you'll, be joining us shortly and inaudible President Eric Adams is also will also be joining us if she's not already here Sean has she joined us. Yes, she's here, okay, thank you. Thank you for joining us. Also, you know. Did you have any comments on behalf of the borough president at this time, not at this time, but I will have an announcement to make on the second item. Okay, thank you for the opportunity to speak sure. So at this time. If I could also add a little bit of context to some background on this site before we move to the board questions, would that be okay? Absolutely because, as Assistant commissioner Borden noted that this originally was brought to the to our attention in 2019, although I think it was December 2019 to be fair, but we had a preliminary meeting about the location and voiced some concerns about the Sp about the specific location. We made it very clear that CB14 accepts and is willing to engage positively in our responsibility to host a homeless shelter, but we did raise questions and maybe we'll hear more about them about just regarding the location of this site, adjacent to the theater and basically on the theater's loading dock, and we made sure that there was communication between the theater and DHS and the applicant as well as and bridget. Bridget. Mcbrion is here representing the jewish board, but that because they host a facility at 19 degree place, which is a facility for people with mental illness. So we were concerned about the interaction of those three entities, and this really, you know in such great proximity to one another and also expressed the concerns that, while residents all over the city, have a responsibility toward our brothers and sisters who are street homeless. This was a lot to bear on this particular community. And so I think, we'll hear a little more from DHS about their efforts to engage the neighbors in greatest proximity to the site, as well as the theater, the bid and and the other facility. Because there's also, we talked about some concerns regarding crime in the area and the number of times 9- 1- 1 is summoned to this very specific block and not only the concern from the community point of view, but whether or not this was optimal for the 200 men who will be living temporarily at the at the shelter. So I just wanted the community to know that those concerns are already on our radar, although we will certainly hear from you as to your perspective on it, and I also just wanted to make sure that the community understood- because I do not know if this has been made clear enough. The department of homeless services figures out what their site is first and then lets the community know. So there was no community input on this location other than Dhs's willingness to hear what our concerns were and attempt to mitigate them, and I can let them speak more specifically about that. I just wanted that all on the record thanks. Thank you, sean, okay, hearing that any board member who would like to speak. Please raise your hand and Sean will acknowledge any hands that are raised. We have Gail Smith, Ed, Gayle, Smith, Ed, Sure Gail by all means Gayle Smith. Okay, thank you. I just unmuted myself sean. Perhaps this is a question for you and the information you provided was very helpful. I was able to check off some of my questions, but one is: are there any other homeless, shelters or shelters of that ilk within close proximity to the plan won it for 21 durian? Well, DHS might want to chime in on this technically. The community board 14 does not have a single shelter in the district. This is our first shelter. We do have the safe haven that is run by by breaking ground. There are things like domestic violence, shelters and that sort of thing, but for as far as homeless shelters this will. This will be our first. There is a shelter that is run by black vets for social justice, so we have the benefit of having experience with them and knowing that they run a really tight ship and they've been great with the community right acrosss the street on our border. At Coney, Island, Avenue and and Turner place near Beverly Road, so I've seen them in action. I know that they're great with the community. I have no, you know questions about this provider, it's just specifically the location, and I hope that answers your question gail. We do not have a homeless shelter in the district whatsoever. Okay, so thank you and just the other. I know you mentioned that there would be 200 men temporarily there. What is the length of say? What does temporary mean? I guess that would be for one of the other folks sure Jelani. Do you want to talk about the average language? Yes, so the average like estate is between anywhere between 90 and 120 days. We try to assess the client. Part of the process is assessing the client when they come in the door and then immediately are working with them to establish what their housing plan is and what their housing path is, and usually typically it's anywhere between the 90 and 120 days, they were able to place clients back in permanent housing. Thank you. You're welcome man, okay, other board members who might have questions or comments. Please raise your hand to be acknowledged. Arden present, I do not know if you'll remember, but I'd attended. Some of the meetings is this might be me: hey, barney, hey you're, good thanks very much. I remember when we'd been having the discussions, you had said that there's a lengthy procedure whereby the client would be asked to move to another facility out of curiosity in the entire term that you've now been open there. How many times does that happen? Are you talking about non- compliant clients, yeah sure that has not happened a lot, but we've had clients there that we had to transfer that were non- compliant with different rules and regulations of the facility. It has not been a lot excessive because we move out clients. We do a good job of moving our clients and servicing our clients. So when the clients see that they're actually being supported, sorry when the clients actually see that they're being supported, the conduct usually changes when they have a good provider, that's servicing them. So we have not had a lot of clients that we had to transfer out, but we've had some and that usually happens immediately. Dhs does a good job of responding to our issues that we have with clients and supporting us we're moving them to facilities that can service them a little bit better. That may be a little higher need. Okay, great thanks. I just remembered it had been a topic of discussion at our various meetings, so I just wanted to sort of a follow- up on what I sure good to see you again brother. You too, thank you. I think Glenn Wallin was next okay, Glenn Moreland! Thank you. I'm curious as to what your staffing will be: the 24:7 type of staffing facility and what kind of security do you have a set up? Yeah. That's an excellent question: Glenn good to see you my brother, Excellent question. I like the shirt I have one similar. I was about to put it on this evening. That's why I said that. So that's an excellent question. So we have operation staff and residential aides that are 24 7. around the clock facility around the clock seven days a week. We also have our case managers, so here I think we'll have about ten case managers we'll have about three housing staff there to help house the club, clients we'll have about 20 residential aides and then we'll have some drivers and then security, wise and we'll have about six operations. Seven operation staff, 24 7. security wise, will have, I think, 10 security between 9 and 10 security, plus a security supervisor around the clock. 24:7 will have we'll have about 70 cameras that we have located throughout the building and to give us access to the perimeter of the building all sides of the building. So we can monitor outside activity, and we also will be doing our perimeter patrols around the around the facility and around, and this is where we work together, where, if there's some hot zones in the neighborhood that you would additionally want us to control we'll do that too. This is where the collective worker responsibility comes in. Thank you very much. Thank you. Glenn. I think Florencio is next hi. Oh hi Ed good evening, Mr, Martin, Masharky Mashaariki. Sorry, yes, hey florencia! I do not know if this question is for sean or Miss Matt Brian, but Sean I was. I just wanted to know. What's the age of the residents at 19, Juliet and today in the news they were talking about, ins was sunset park. Is that where it is where they were, students and women who were being harassed so but Mr Jalani? You did mention about having patrol and cameras and I guess you'll run a tighter ship so, but I also wanted to know Sean. Do you know who knows the age of the neighbors? I'm sorry! That's for me. Sean! Yes, no! There's, no outpatient services at 19 area. It's entirely residential! Okay! Thank you very much is your hand still raised from earlier. No, this is a a new question. What are the protocols for ensuring compliance with the Mtm curve view? Oh okay, cool? So so, if you do not, if you are not able to make it black for the 10 P.M curfew as a client in DHS system, you are given a seat and if we have available beds there inside our lobby or a designated area inside the facility, basically a waiting area, and if we have available beds, we give you back your available bed after finding out why? What was the reason why you may have become late, because there's different reasons why people are late and we just want to document it so that we know so that we can build a supportive service plan to help the individual. And then, if we have no more vacancies, then DHS sends transportation to transport the client to another facility where they may have vacancies. There seems to be a pattern of not following the curfew guidelines or are there any protocols? Oh yes, that is kind responsibility. So if we, if a client does not seem to follow any of the policies or procedures that we have in place, then we have oversight mechanisms to be able to bring the client into compliance. And if the client still does not want it to be into compliance, then we speak to we constantly communicate with DHS about non- compliant clients. If it's not a code of conduct issue to see how we can best help the client and bring them into compliance, so we try to increase the services for them as long as it's not a code of conduct issue, because if it's code of conduct, then we would have them transfer to another facility for higher need, but if it's, if it's something that we can see and work with the client on to get them into compliance, that's what we like to do. Thank you. Thank you. Sean note that we have not seen a schematic of the actual building and you do not need to. If you do not have it now, that's fine, but we just want to make sure that we get that so that we can talk about any concerns that there might be about. You know loading bays or anything like that yeah. I do not know yeah. I do not. I do not I'm not in possession of that schematic, but we're certainly happy to find out more about it. Thank you and gail, assuming you're done, can you lower your hand? Please Greg Alvarez has his hand up greg. Yes, hi. Can you hear me? Yes, great yeah, just following up on Sean's question, just wondering if there is a construction schedule based on the work that will be done just to have an idea of what the disruption might be during the course of that? I know that this. I know that no construction has started on this site and I do not believe that any is scheduled as of yet I do not have a. I do not have a firm time on when that construction is going. My guess would be that it would start sometime in 2021, but I do not have a. I do not have any kind of time. July do you have any more involved in that excavation and pre- construction work has begun at the site. Yeah, I'm not I'm not familiar with with that. Okay. Okay, thank you. If yeah, if there is a way to communicate that to sean it'd, be appreciated, yeah we can yeah, we can find out from the developer. We do not. We do not actually enter into the equation until a building is completed and then blackfest actually operates it. So the developer is responsible for creating the building, creating all the you know, making sure that it's appropriate, so we communicate with DOB about this stuff, but I can certainly find out more about it. Thank you, glenn Wallin. Yes, I'd like to follow up on that. As to the scope of work, you know how much disruption will there be in the immediate area of the building as a developer is working on it inside and outside? So, as I understand that you do not have that information now, but I would appreciate it if you could get to us whatever information you can. Thank you sure- and I believe that is oh sorry, I was about to misspeak and Godet has a hand up yeah, and then you know the board. Members want to hear from the public as well, and there are some public speakers go ahead, and can you hear me? Yes, okay, great, so it's thank you very much stephanie for weighing in it's totally appropriate that the excavation and initial work is done, because the concrete would have to cure prior to the winter when other exterior envelope issues can then be addressed. So you can then continue your work inside to move the project forward. But again I do concur with other members who have requested the plans to be presented to the board, but thank you so much appreciate it. Thank you, Ann Sean. I think you were making comment. I was just saying that I believe that the board members that all that might be all the questions from the board members and the scale, has another question, and then we write, if not, if so, go ahead. Otherwise we have public speakers, okay, just before just before we move to the of the comment period. I just wanted to make a brief statement. You know indicating that matters of civic interests and announcements of public events are invited. No partisan political appeals or advertising of for- profit enterprises are permitted. Any speaker period will be permitted to speak for up to three minutes and may not receive additional time from another speaker. The intent of the public commentary is to permit the board and community a chance to hear diverse perspectives on public issues. Accordingly, speaking time will be assigned first to speakers to groups than to speakers addressing different issues and finally committing to additional speakers on an issue from a single group. So, having said that, we can now move on to the first registered Speaker, Sean and- and I believe that Stephanie Tomlin Stephanie, if you wanted to speak on behalf of the theater or I also want to acknowledge that Stephen Arenberg is here from the theater as well sure hi everyone, I'm Stephanie Tomlin, I'm the general manager at King's, theater, 27, Flatbush avenue. We had a previous meeting to this one, so my concerns are really still the same. We have operational concerns there being a supportive housing. You know we're alive and you thanks. Load- ins, as early as 4 am 6, am events that go anywhere from 12 midnight to sometimes 2 am and 3 am our patrons queue from our front door around what is now the bank, but that bank is scheduled for demolition all the way past the jewish forex housing facility to where the homeless shelter is. We already have issues with panhandling and harassment. Instances of you know inappropriate activity and other kinds of harassment that we're already dealing with. So we're hopeful and we're certainly hopeful. That will not be the case this time around we have. I did have a question about show days. What is the security plan for the homeless shelter when Kids Theater has? Your curfew is not until 10 P.M, I've noted, but our door times are as early as sometimes six o'clock and seven o'clock so plan for security, for when we have patrons, who are kids sure. So what I would say to you is what is your current plan for security as the general manager of kings Theatre? How do you currently secure your residence? Are your customers, and I would also say that so the way that we operate is we do perimeter patrols, and so we would be patrolling. We would work with you all to make sure that there's a relationship there so that we can get over anything operationally to make sure that your customers are well taken care of and our residents are taken care of and protected. So it goes both ways. So I would definitely, as I stated before, in our previous meetings. I definitely look forward to working closely with you all and the jewish board to ensure that we have great relationships and that we can secure the area by working together. But we do perimeter controls okay, it's something that I'd like for you to give some thought to independently of our plan. Of course we are and, as I said at our meeting before we're happy to- and we will be good neighbors as we've already been with construction, but it's something that I'd like for you to give to independently assess as well as you know, liaising with your neighbor in the jewish world, because I think that we all have some improvement that we can do, especially with another neighbor and 200 men who are trying to get together and get on their feet and everything that we're doing to everything that we can do to support you. As I said you will, but it's something that I want you to give some thought yeah sure. So currently we operate in high high active areas and we do an excellent job of that of working with our neighbors. So we're not foreign to that, and so you know, I look forward to continue working with you all and all of the institutions, that's in the area, so we can collaborate and be of service and I just need to throw a shameless plug towards Jelani. This way I mean, as I said, I do this work. Acrosss the city and I've never not seen a situation where geek, where black vets has gone into a community and to a site and not fully impressed the elected officials and local community board in terms of the work that they're doing and actually act as the model for other sites in terms of how they specifically how they operate security. I've. Never you know the professionalism of all the folks that work for them remarkable, so I feel very comfortable for them in this spot. I think they're going to do a fantastic job, and I think that they're going to be a great community partner and I've said I can say that unequivocally yeah and thank you man. We do have a 24-hour hotline, not highlight operations, number that you that anyone from the community will be able to access to report if they believe that there's a resident, that's engaged in some activity. That's that is not supposed to be happening, and so that, if there's some support, that's necessary immediately, so that we can respond to so not only will we be doing outside perimeter checks and are engaging with the Community board and our and our collaborative partners in the neighborhood, but also we do have a 24-hour operations number so that we can respond to immediately to any issues, and I just like to correct one thing: I spoke about savings, client savings and so clients would not be saving with us. They saved with the city with DHS and the city of New York in it in the income savings program that our DHS has for our all clients in the shelter system. Okay, do I still is it still my turn? Is this still my time please go on? Yes, okay. I was wondering if there had been any thought given for our last conversation about just the way that kings operates and are there any concerns or thought with regards to how we do business and the nature of our business and how that might interact with the work that you guys are doing at the shelter. Has there been in any given additional thought given to that in terms of, can you be more specific just in terms of timing? More than anything, the loading dock is really the area that will most affect you guys and given the fact that we'll be loading it at different hours, it will be noisy when it's noisy all the things that we talked about in the last meeting. Have you guys given any thought to how we can be good neighbors to you and your man, because it seems like this yeah? I think that we can speak to it more. I would have to see actual. I think that we can continue to have a conversation on what it is, but I actually would need to see it in action. So maybe, when you guys are start to operate again, you can let me post it and I can see and come by and witnesses and then say hey. This is how this goes. Okay. Now I understand how this goes so then we can have further conversations. What is the stephanie? You know, you've got like you've got 30 seconds left because it's a three minute timing on each on each speaker. Okay, what is there? Has there been any thought or are there any concerns with the fact that they're going to be two construction projects going on concurrently and next door to one another? What's the work on that? That's a that's a DOB issue in terms of when it comes to building construction, so the community board will jump in on that nature, with DOB that there'll be permanent coordination and in street opening coordination. So I'll circle back to you on that Stephanie and I think that Ehs and Jelani simply forgot to mention their intention to ensure that there's a community advisory committee attached to the shelter so that the stakeholders can, of course, yeah absolutely yeah. I'm sorry! I did not define that as that, I'm sorry sean, but you definitely there's. Definitely a community advising board and we'd be in constant contact with stakeholders, community stakeholders so that we can currently continue to. You know you're going to have good conversations. Yeah neighbors local elected officials are meetings that are scheduled on a regular basis, so that folks can figure out how to both problem solve issues that may come up in a shelter and then also figure out ways to help support that shelter and help support the clients that are in it. Who are you know some of our most vulnerable workers who really need a lot of extra tlc and so so yeah. So obviously we would love to have local representation they're smaller. They have to be about 15 or 20 people because, as we all know, usually about 12 man yeah. Well, as we know, it's meetings, the there's an inverse relationship between the how many people are in a meeting and how effective they tend to be sure we try to. We try to keep it tight well, just to close out and round out my time as I mentioned at our meeting before, and this sentiment will not change. We are committed to being good partners and giving you whatever support that you need. We just ask that you play nicely in the sandbox and we certainly will as well, and I think that communication is going to be key on this, because it's going to be it's going to be a crowded block and I do not think anybody is under any misconceptions about that. Let's not kid ourselves, so I remain available jalani. We did exchange numbers at the last meeting, but certainly if you are in me- and I think that we should talk early and often so that once we reopen and once you guys open in 2022, it's a smooth and seamless transition sure I totally agree. I totally agree with that and having existed for 40 years as a community based organization, we pride ourselves on communication with the community and service in the community and as an organization of color, we pride ourselves on those things so definitely well. Thank you. Thank you so much we're about to move on to to the next speaker, but just before we do, I just have to exercise the chairs to a couple of things first dimension or to reinforce or echo what Matt said earlier. Looking black veterans, I have only heard wonderful things about the organization and what it's done in other areas. I have heard nothing negative and that's saying something you know I've heard nothing that negative at all about the organization. I have a question Jelani you mentioned perimeter, have you made any overtures or you know, established or reestablished any relationship with local precinct sure? So that's part of the cab, the precinct actually was at our meeting at our initial meeting, and so we actually deal with them. I believe, if I'm correct Sean at at Celine House also, and so they overlap sometimes, and so we definitely our collaborative partner with the precinct, and we look forward to them continue to join our meetings. The NCOS, I think we met last time at the at the initial meeting that we had and I appreciate those great words Edward, and we continue to try to do great work. It's challenging out here, but we're committed to our people and if we, if we make a mistake, it's a mistake out of caring not of trying to do people so all love, all always love and doing the work to support the people. One last thing is we hire from our community, and so we will be hiring from the local community to hype, a local community and in central Brooklyn and East Flatbush and canarzi, and all those areas to support and give opportunities of employment opportunities to individuals that live in the media vicinity of the shelter. So it's also economic support to the community and one of the things that we do when we open the shelter. We support the businesses, the local businesses, because there's so many people in the shelter, especially not just the clients, but the staff to have to go eat. Lunch have to go, buy things for their family. We are economic generator. Also, sorry, just to jump back in one more thing. I do not think you've been recognized by the chair. You can't just jump. There's another public speaker yeah, I believe, is Nevada Kibi on the call Ms kiby. Yes, I'm going to call. Did you have any questions or want to make a statement? I know you're a close by neighbor there. Yes, I am, and it is definitely congested in this area, to say the least. I am concerned with construction and the impact that it that is going to be on this area, I'm right on Beverly road. So to say the least, more than likely a lot will be coming down this block or coming back through this block, as you only have a few ways in and a few ways out how we all going to address that and the second part of in having we have such problems with the on the other side, with panhandling and such stuff. I know you said that y' all have run a tight ship. They do have to come in and out of the premises. So is it that y' all are more or less going to be policing the folks? So if I may speak, we do perimeter engagement, we like to call it where if we see clients hanging out and we can identify it's our clients, we engage them and let them know that we have a good neighbor policy. They actually have to sign a good neighbor policy, and so we also promote our clients to be active in the community. That's where the collaborative efforts with the cab and the community institutions come into play so that residents understand that, though this is temporary housing that they're being temporarily housed in the community, and we want to be benefits to the community and not issues. So we engage the clients and let them know that there will be no loitering here as per a good neighbor policy, but also, more importantly, let's be supportive. So, whatever community gardens or whatever our actions, the Community board, has and activities we like to be involved with them and have our clients involved in them so that they are supportive of the community and those rounds are done and those rounds are done hourly the perimeter patrols. One last question you know said in terms of that, if they're late, they can lose this pot. So am I to understand that this is more or less going to be a rotating bed system where it's not the same patrons. That's there on a regular basis, but as much as various people are coming in from time to time. No, it's not it's, not a rotating system. However. There are controls in place so that people actively that are actively homeless are able to access a bed. So usually there's not a lot of people that are violate curfew. I mean do not meet curfew, let's say it like that. Do not meet the 10 pm curfew, but when there are DHS controls the capacity and so there's a lot of homeless individuals. So we have to make sure that there's enough space for them, but typically anywhere between five guys to 10 guys the most on, let's say a Friday Saturday night in the summertime in the winter time, it's usually about two or three people, unlike that maybe Volley curfew, for whatever reason, so maybe I'm not making myself clear on ongoing. Is it going to be the same persons that are going to be at this site or are there going to be different faces that basically we're seeing on a daily basis? So so typically a resident stays anywhere between 90 and 120 days, because we like to move them into permanent housing in those points. So there are, there becomes vacancies, and these vacancies are then filled. So it's not it's not like. Oh 25 new clients show up every day. No, it does not. It does not work like that. Okay, you fancy. Thank you. Thank. You is Viola Parker on the call. Okay, I do not see. I do not see or hear her, but I look forward to introducing you all to miss Phoebe and Miss Parker. You know in the near future. They will want to be active in the advisory. It's Mary Mass, Miss Mass. Are you on the call? Did you wish to speak hi? This is Mary. I think that my questions have been answered. Okay, great, thank you for joining us and please keep in touch with the with the community board, as this rolls out absolutely thank you and I do not have any unless bridget Mcbrien wanted to make any additional statement from the jewish board. I did not have any other members of the public who had pre- registered. So if there's somebody else who wanted to speak, you better get your hand up, because I believe the chairman will move us on to the next hearing shortly I'll, just I'll just allow a few seconds for anyone who would like to speak. Who has not had an opportunity to raise your hand. I do not care. Okay, then we're you know we do not require. I do not. We think we require. You know any meeting of board members for any approvals or anything so sean. If I'm right, you can advise me on this. I think we can conclude this hearing for the record. I do not think the department of Homeless Services is asking us for anything, because they are moving forward with this plan, but I suspect the board might want to get a letter out to DHS sort of memorializing, some of the some of the commitments that were made, and especially the Community Advisory Board, and we'll get that right, look forward to seeing that letter. Excellent Matt. Thank you. Thank you. Thank you. Thank you both thanks. Thank you all. Thank you. Everyone thank you. Yuri Sanchez from DHS who's, always just so honest and responsive, and so this this public hearing is concluded at 7:29 pm and in about one minute, we'll move on to the next public hearing. Okay, this public hearing is called to order at 7:30 P.M on Wednesday October 21st, virtually via Webex. The purpose of this hearing is to hear public testimony by community members to a uniform land use review, or you like euler review application to the Department of city planning submitted by 1600 to 1620 realty corporation. The application is for a zoning map amendment for an R6A, a c 2- 4 to a r 7d, slash 2 c 2- 4 district and a text amendment to map a mandatory, inclusionary housing area with the project site. These applications would facilitate a mixed use: development with ground floor retail and 85 dwelling units at 1620, a pardon me at 1600 to 1620 cortelli road between East 16Th and east 17th streets. This is euler number C180496, Z M K and n 1:8 0 4:9, 7, z, r k members of the public were asked to pre- register to speak by emailing. The Community Board Office pre- registered speakers are asked to state their name whether they live in the district and their organization. If applicable. Those speakers were asked to also provide their addresses by email for the record members of the public who are viewing the meeting on YouTube and would like to comment on this issue. Can email info or info at 16:14, Brooklyn, DOT com and those emails will be collected for the record. Please include your name address and organization, if applicable, in the emails members of the board, who are participating in this hearing via webex and use the icon to raise his or her hand or ask to speak in the comments on the webex screen when called upon. Please clearly state your name prior to giving testimony for this hearing. We are joined by the applicant's representatives from Sheldon, Lobel Pc, Richard Lobel will begin the presentation and introduce others who, on this team richard are you with us? I am. Are you able to hear me? Yes, excellent. Thank you good evening, Community Board Members, Chair Powell. Thank you for having us and to district manager. Sean Campbell. My name is Richard Lobel, I'm from the law, firm of Sheldon Lobel and we're here tonight, representing Tony Dola, who you may know as the owner and proprietor of the market on an application for rezoning and the entire applicant team is here to ask answer questions to go over the proposal. We've got Amanda Ianati from my office as well he'll be sharing her screen. We've got Victor Feletti, the Project architect, Max Meltzer, who is our environmental consultant, so we really want to be able to provide comprehensive hand answers to any questions that are requested by the Community Board. Before I begin with our graphic presentation, I would just ask Tony who's on the call. So, just briefly for a couple of minutes just talk about his background at the site and then I can go into the technical nature of the rezoning. So tony yes good evening, everyone I'm happy to see everyone safe and well. We we've been in this location in this community for like 26 years since 1995, and for the years you know we have, we have ran the supermarket to the best way we can. Throughout the years we've been getting a lot of offers from developers just to make it clear we're not developers we are owner of the supermarket and we just know we're just the grossest. But you know throughout the years we get offers from developers they wanna they wanna, develop the site and, and they wanna do different things. One of them is to keep the supermarket there or make it bigger and most likely they will make it smaller. Maybe they will remove it all together. You know we decided me and my friend to pursue to do development there and to really do something: that's beneficial to the community, which is a larger supermarket, that we even currently have and have affordable housing. Even in addition to the rental. You know it's not luxury apartments, we're building there. It's rental apartments, that's very much in the community, and you know in Brooklyn, and I believe, even and now even more important to do such a project because a lot a lot of developers like abandoning you know, plans to do any investments in Brooklyn and in New York City, all together, but we are sticking it out and we're staying there and we want to invest in the community. We've been there for 26 years and we want to stay there for 25 years. At least you know my kids want to come and work in the supermarket. We want to continue benefiting the neighborhood and the community. Thank you very much. Thank you Tony. So, with the chair's permission, I think Amanda Iannotti would share her screen and we can walk through the proposal by all means. Amanda can you do it? There you go excellent. Is that full size on people's screen? No yeah, no nowadays, okay, great, so the rezoning is a 1620 quartz board rezoning, which is on Quartel U supermarket on East 17th and Cortel U and rezoning area would be being between East 16Th and east 17th. So take a look at the zoning map, and what do we immediately notice about? The rezoning first is that the current zoning district on the map for this site is r6ac24. An R6A is a residential district. A c24 is a commercial overlay district, so the rezoning here, which would be the r7dc24, maintains the same uses as could currently be found on the property the rezoning before and after or the property before and after the rezoning would allow for ground floor commercial use with residential above. In fact, our 6a zoning districts permit floor area ratios ranging from 3 to 3.6. So you know it would be a sizable building, albeit not the size of the R7A or R7D, but it would be a sizeable building to be built as a as Tony mentioned. He explored as of right options here and his goals were, among other things, to keep the supermarket here and to potentially create some affordable housing, and in order to do that, there's already an r7a district to the to the south of the site. In fact, you can take a look right now. The zoning map and the R7A district already encompasses a tiny corner of the site, but in truth, in order to make a mixed- use development here work, particularly in light of the fact that supermarket is a low- margin. Business. It's very challenging, as Tony can tell you from a financial standpoint to stay open, particularly given many of the competing services that are offered now. The idea here was to rezone this to an R7D, so you can see on the map before you, where the R7D district would be located. An R7D here is particularly well suited for this location. Why is that? You can see from the larger map that courtill you road is an 80 foot wide street and the site itself is bounded by East, 17Th and Quartel U being a corner which allows for greater Street access. The frontage itself is bounded on three sides by each sixteenth and seventeen allowing for street access to the entirety of the lot frontage. In addition, a wide street is often looked at by city planning as being appropriate for additional zoning density, and so the R7A immediately to the south of the site here has height limits that approach 95 feet. The proposal right now for this building would be at 102 feet a mere seven feet taller than the R-78 district already existing and along part of the property to the south and southeast. You can take a look at the zoning map here. The land use map, which has the numbers filled in for buildings along East, 17Th Street here, and you can see some of the larger buildings, the six and seven story buildings. So Amanda you can keep going so here's the proposal, as you can see, from the dotted area and on the map. The R6A with a c24 overlay would now become an R7D to a c24 or overlay. Importantly. This is also a point for city planning in that R7D, with the c24 overlay mandates ground floor, commercial use. So, although, as Tony said, certain individuals approached him about purchasing the lot and purchasing the lot area, the truth is that the proposal right now at an r7dc24 would require non- residential uses on the ground floor. It's a zoning district which basically ensures that you'll have continuity of a commercial corridor which is important in an area where Cortelli road is a major commercial thoroughfare. You want to have active business here. You want to contribute to that, and so the r7dc24 is a way is one way to ensure that continues Amanda. Do you want to just run through the these plans? So here's an illustrative drawing of the building, and admittedly this is an illustration. We have been working on more elaborate materials which demonstrate a finer building, design and we'll be happy. You know to to generally propagate those to the area, but right now what city planning asks you to do is just do a model of what could be built there. So this is a model of what could be built. This is a an 85 foot tall building, it's roughly nine stories. The building is set back at the at the top Uppermost story. Amanda, can you continue so here's just to take a look at a lot, as is always the case with city planning rezonings, we include other lots in the rezoning area and here the three adjacent lots along Cortel U were seen as appropriate, given the fact that they have the same prevailing conditions they're, both located on wide streets. They have access to transit. The lots themselves have mixed ground floor, commercial with residential use above and East 17Th Street again front. Some of those lots and by the way in case I was Mistaken, East 16th is adjacent to our property. E 17th is on the other side of the block. So Amanda, can you continue? So here are the zoning calculations and I'm happy to run through those, and so is victor who's here by the way, but essentially what you have is a 14,000 square foot lot, which produces roughly 84,000 square feet of the total development. The ground floor would be roughly 9,500 square feet of commercial development which would result in the store or tell you market and additional commercial square footage. The existing square footage of the ground floor courtesy market is roughly six thousand to sixty five hundred square feet. That would slightly increase under the proposal. We included the old number and the proposal, but that would slightly increase to between 7,500 and 8,000 square feet for the market. There would be some additional square footage, roughly 1500 to 2,000 square feet left over for additional local retail, and there would be a ramp on the ground floor which would go down to the cellar providing 44 parking spaces. Residential lobby would also be located on the on the East 16Th street frontage. You can see a typical apartment layout here in the calculations. We include the rough numbers on what a proposed unit layout would look like, and that would result in roughly 85 units. The breakdown would be roughly seven studios, 52 one bedrooms and 26 two bedrooms, so you can just see an illustrative layout and illustrator rendering. So why do this? It's important to note that in desiring to stay here, Tony needed basically the building above to subsidize the the food store. There's a you know, it's a one- story, ground floor supermarket right now and again, this is not. This is a package. The idea is to provide a project to the community that the community feels benefiting the community as a whole. So what do you get here? You get the supermarket, which would be an enlarged supermarket and would still be able to provide cost-, effective groceries to the surrounding area. You have residential units generally and importantly, you have affordable units so of the 85 units projected to the site. Roughly 22 of those units would be affordable units in the same unit mix and on the same floors as the remainder of the units, so in calculations you'd have roughly two studios, roughly 15 one bedrooms and roughly five two bedrooms. So this is really seen as important here, because when we looked at the R7A zoning before much of it created and docked and becoming doctrine after the 2009 Flatbush resolution was a mandatory, inclusionary housing district, and so this basically carries with it a requirement that 25 to 30 of the units will be affordable. This is no small thing. This is basically something which is written into the zoning law becomes part of a restrictive declaration recorded against the property and is required of the site in perpetuity. Not only are units created generally, which, from what I understand will relieve housing pressure in the area generally allow for additional new units and allow, for you know, potentially adding to the to the additional residential units in the area and the ability to relieve some of that pressure. But importantly, the affordable units will be geared towards on average 60 percent median income. These are you know, modest income levels. 10 of these income levels will be available to families with 40 AMI, so this is really allowing for some serious, affordable units to reach the area. We note that in community board, 14 generally roughly greater than 50 percent of households in the Community Board of rent burdened, meaning, if defined by 35 or more of their income, is spent on rent. This is something which is larger than the city as a whole and is larger than in Brooklyn as a whole. This is a you know. This is an area which can use additional residential units to relieve rent pressures generally and specifically, for the ability to do affordability. So with that, we would love to hear the board's comments. We're happy both Tony and I, as well as the team, to engage in any specific questions, and we look forward to sharing this with you. Thank you so much Mr Lobel. So at this time, well, Sean has assembly. Member Carol joined us, yet no ed, no okay! So at this time we will sean did you did you want to make any statement before we take questions and comments from board members? No, I think you should go straight to board members and I might jump in with them. I appreciate Mr Lobel's homework on our rent over burden rate, but if Greg Alvarez is still on the call, because I know he had to jump off to another meeting, if you would, if you would let him go first, if he's even still here, I do not see him right now. Absolutely are you still with us? Okay, sorry about that he is not, but he did a good deal of work sort of looking at this plan. So I appreciate his guidance on some of this. So go to your other board members. Okay, boy board. Members: please use the icon to raise your hand. If you would like to speak comment in any way you have hold on Glenn Wallen, Glenn Wallin. Yes, I'm here. I just like to say that I was at the original presentation and I think that this is a benefit to the community and I am in favor of it. Thank you. We have. We have a long list of other of community members and I'm sure that even board members who are leaning one way or another would want to hear from you know the point of hearing from the public before a final determination, and we can begin to call them and in order that they signed up, so they do not necessarily have to raise their hands right now, because I have the ones who are pre- registered and I'll call them in the order that they registered. When you want me to begin doing that sean, yes yeah, I just want to ask one question say who you are before you speak? Yes, I missed the plaster I'm from the Community Board member, and I just want to know this building that's being projected at this time. I noticed on the map that the three adjoining properties appear to be three- story, tight buildings. How do those neighbors feel about what's going on? Well, that's the they're signed up to speak speech, so I think you're going to be hearing a lot about how they feel about that. In other words, I have to wait. Okay, I will stand by. Thank you all right. Are there any additional comments or questions from board members? Please raise your hand. Martin has his hand on pardon thanks very much Ed. I was at the original meetings as well and I on the board of the Prospect Parks Health Association, and I know you know there is some concern amongst those of us in relatively adjacent landmark districts that such development of this scale and needless to say, you know, landmark types were always concerned with design. It is somewhat out of context with so much of what many of our landmark districts have been striving for. So I would just say that I have heard this from others in my particular district and other adjacent ones, and I won't be surprised if you hear a fair bit of that from the speakers you've signed up. We thank you for your comment and I would note two things. The first is that the R7A immediately adjacent to us allows for 95 foot tall buildings, and so this is marginally taller than that building, but importantly- and I think Tony- and I talked about this because he's been through it on this- we've been actually at this for now, probably close to three years, and one thing that he wanted me to convey- and he wanted to convey was that the lasting legacy that he leaves from the building is very important to him. This is somebody who's been in the community, obviously for over 25 years, and- and so you know we- what we like to say is the proof is in the pudding to the extent that there's a further and more extensive conversation with the community as well as stakeholders as far as design and what they feel is appropriate, with appropriate setbacks with appropriate, dormers, etc. We're like so happy to engage in that conversation that you know I mean Tony can speak to his own opinion. But that's what I understand and I believe that's what that's what he said to me as well: okay, just one question, so I know you mentioned that the 22 units you know will be at the various 60 and 40 percent of AMI. What will the market rates be? Tony, I'm not sure whether or not I know that you've been in discussions, but I do not know whether or not you have any final numbers on the market rate I mean this is I do not. I mean I'm not at that point too. I mean it's not like we. I just do not know yet look what we have not you know. I do not have these numbers, but I mean Richard. You gave some statistics about Cd14 overall, and I can tell you that the median rent on a two three bedroom apartment in the district is 1600. According to the furman center, recent movers are paying a median 1700 and zero to one bedrooms, produced one bedroom or 1320. So it's kind of not that different than what the rental units for our family size that would typically be in a two three bedroom apartment at 30. Ami is well with the exception. I'd be interested to know the difference between the market rate and the and the affordable. When those are set. Excuse me for once, can I just ask what date what year those figures are from? Please identify yourself. Sorry, it does not benefit a public hearing. That's from the firmament report. 2018.! Thank you Jen, but right now this period is for board members. I know I'm sorry. I just wanted to hear that information. Okay, Carl Henry has his hand up Paul yep, hey folks. Can you see me? I can hear you excellent awesome, so Mr Lobel and Tony and the rest of the team. Thank you and so yes, my first question: I'm sean and some other, and it sounds like Barton alluded to that already. I was interested in knowing if the team had figures on what the market rate was at for those apartments, and then you know seeing what the delta was between that versus. I think what I forget, what department it is in the city that would have the AMI tables listed. You know for studios all the way to three bedrooms, so I was wondering if you guys had the information on those deltas and, if not as soon as you guys did, would you be able to share that and then my second question too, is at this moment in time. Do you have a projected timeline in terms of when you know, project this project to start and then complete, and then that ties into my third question? But that's my second question. Okay, so I'm going to start with one and two and they then maybe would defer to victor the project. Architect on three would be happy to get to do a pro forma with market rate units. I think Sean talked generally about move- in rentals and such just so everyone is familiar with the amis. For you know, two people in a one bedroom you'll be looking at thirty. Six thousand four hundred in rent in in AMI adjusted median income. Sixty percent would be fifty four thousand six hundred and eighty percent would be. Seventy two thousand eight hundred, so those are just income levels for a one bedroom. We can also, you know, provide the more detailed information, as is provided by by HPD with regards to those affordable units. With regards to the projected we're talking about projected construction schedule. Was that correct? That is correct? Yes, okay, victor can you can you discuss basically to the extent that a determination was issued in spring of 2021 on the rezoning? What would be like a projected construction schedule? Victor, Felletti, Project architect, construction- would take somewhere around 18 months, two years to complete got it. Thank you very much for that and then the reason, and so the reason I asked that is to tie into the third one where I'm I believe you had mentioned earlier. Mr Lobel. If I heard you correctly that as part of the zoning regulations right that mandates the percentage of units that have to be devoted to various levels of AMI- and so you know we're in the time of Covid-19 and no one knows how long the impact will be, and so the concern I do not know if it's a concern, but the question I have is if we find a situation where, after the building has been completed- and it turns out that you know the developer and the building are having a hard time filling up. Those units for people in those amis is that a hard rule in the zoning regulations, that percentage of units must be filled with AMI or is there some sort of flexibility? We do not know at where. If you know x months after the building is complete and why percentage of those units are not filled, then someone could basically take those units out of the AMI block and sell them at rate. So it's a good question. So the the amis and the affordable units are actually tied to zoning, so they're in the zoning resolution. There's a restricted declaration entered against the property, there's an administering agent, so there's a local nonprofit which has not yet been selected but which would administer all the affordable housing. Those basically enter into those units enter into a regulatory agreement with HPD. The owner does not control the disposition of those units. To this extent that there's some modification going forward by HPD that would be likely to be governed by their office, but as far as coming off those amis, it's not something that the owner would be able to necessarily engage, and I would note that you know typically on many of these buildings, there's a waiting list for those units which often numbers hundreds or thousands. So we would be looking forward to that. I can't make any representation about whether or not they'd be able to reduce the analysis. Thank you very much. Okay, thank you. Okay! Are there any other board members who would like to speak to this subject and is not a board member and Godet and then Stephen Cohen and Godet? Yes, can you hear me yes great? Thank you yeah I had to call in. I could not get any audio on my computer, so I understand the the way back and forth from the community and I'm really interested in hearing some of the comments from our public speakers, but to Barton's point. The landmarking and other contextual issues do not exactly extend that card down to the Cortalia Corridor. It is if this is absolutely a very bulky looking rendering, but it's a rendering, so it's not carved in stone and the AMI does sound like it would be well suited to bring in heated housing. So there's the aesthetics, but there's also when you look at the possibility of losing the possibility of losing a supermarket, they have so they have lost leaders but their spoilage staffing other, and I believe they said that they would be looking to do local hiring so there's an increase in jobs which particularly appeals to me. I think this is something that we need to hear more about, but it sounded like it's a you know: it's something that could move forward, and so I'm not. I have not really thought one way or the other until I hear more from the public speakers, but I think it's well considered, although it is a giant project for that corridor. So it's more a statement than a question, so thank you. Thank you, Steve Cohen. Sorry, thank you chair. My question was for that 18 to 24 month period during which there will be construction. Is there any estimate at the moment how long the supermarket's going to be out of commission during that time? Is it going to be the entire period or will it be able to remain open during at least part of that period? So well, I'm sorry who's who spoke not Steve. That was me victor, okay, so sure victor, please, okay, so we we've spoken with the owner extensively about this and the goal is to keep the supermarket open. That's in some form, whether it's a hundred percent open or maybe it needs to be reduced in size during some point. But the goal here is to always have a supermarket open during the entire construction. Yes, I do I actually patronize that store known as key food right now. I've been patronizing that particular location for over 35 years. It's always been a very small store. It has since that time been expanded. However, many people in the community utilize that store, so it is extremely important that there is availability for abuse by the community if this does occur, I do I did have some other questions, but I am more concerned about hearing what the community at large has to say. Thank you. That's much appreciated next next board member. I do not see anybody outside no one else. Okay, so then we are going to move on to our public section and just before we do something I have to read. This brings us to our public comment period. Habits of civic interests and announcements of public events are invited. No partisan political appeals or advertising of for- profit enterprises are permitted. Each speaker will be permitted to speak for up to three minutes and may not receive additional time from another speaker. The intent of the public comment period is to permit the board and the community a chance to hear diverse perspectives on public issues. Accordingly, speaking time will be assigned first to speakers from different groups than to speakers addressing different issues and, finally, time permitting to additional speakers on an issue from a single group. So, having said that, Sean we can proceed with the list of public speakers. Harry bubbins was the first member of the public who signed up and I believe he's go ahead. Great thanks. So much and let me say all the information and links and from the board and staff were more clear than I've ever seen. Another community board. So that's a testimony to your leadership. There, I'm testifying today as part of respect Brooklyn, a neighborhood- based coalition for sensible development and historic preservation. We strongly oppose the proposed spot up. Zoning of 16th coeur Eu Road and over 250 people signed a petition on respect Brooklyn.Org opposing the spot up. Zoning, let's be clear, affordable housing is welcome in community board. 14. out of touch spot- up. Zonings are not the mayor's mih real estate friendly approach to creating affordable housing has failed and should not continue to be forced in our neighborhoods through the fatally flawed process. The site was part of the 2009 Flatbush rezoning already the subject of much deliberation by the community board. It was very specifically rezoned at that time, from an r6 to an R6A, with an overall increase in allowable residential, far to simply erase all that work and consideration to gain approval for the massive up zone is unnecessary and wrong and nothing is stopping the owner from developing a 40:50 or 100, affordable housing development under the existing zoning. As one board member pointed out, any kind of financial analysis and review should be provided to the board. If you are going to consider this with this application, the developers seeking to build 87 percent larger the proposed building would have an far of 5.6 compared to the existing, far F3 and up to 45 feet higher than the currently allowed height limit. We believe that an even larger building at this very significant primary location neighborhood would have a detrimental impact upon the character of the neighborhood. Also approving this one spot up. Zoning and the other lots will serve as a terrible precedent and signal to every developer and real estate interest to come and further eviscerate the existing zoning. Dozens of lots just on this road alone could be subject to such spot up zonings in the near future. Of course, some landlords might like that we're huge supporters of the local grocery and laundry and cleaners, but a new store at this location would not justify the up zoning there's a lot of other concerns. In addition, there's some serious environmental concerns that have been inadequately addressed by the application in the hazardous waste section, the location served as a dry cleaner since 1934, and only stopped on- site processing. Recently, the applicant admits, in their environmental assessment the presence of five mysterious barrels with up to 100 gallons of potentially toxic cleaning, chemicals on site waste, dry cleaning fluids being stored in the back of the facility and the presence of an old 275 gallon fuel oil. Above ground storage tank, despite this alarming discovery, the apple can share no sampling of soil, water or air, and share no lab results to check for broader contamination that could place the community at risk. Only a phase one site assessment was done, not a phase two assessment, which would include such sensible testing and analysis. The neighborhoods undergoing what we and many others see as detrimental changes to its character with displacement and over development. Despite claims by the applicant that there's no due development since 2009 rezoning over 200 new building permits have been filed in the board alone, 16 new, I just looked while we were listening, 16 new building permits were filed this year, some just in September down the block. 1921 court of View Road was destroyed the 100 year old, baptist church and that's just a harbinger of other things happening in the neighborhood. We continue to push for expanded, landmark and historic district protections as one board member pointed out. We need to do and we do not think you should allow zoning to increase the size by 85:87. What is the existing zoning already allows? We call on you to reject this application. Thank you very much. Thank you. Harry. Do you represent an organization, I'm part of represent or respect Brooklyn? I do not know if I represent them. I work with them. Thank you, respect, Brooklyn.Org, okay, thank you. So much. Thank you! Speaker Mr chairman. Are you going to ask the applicant to respond to each question or do you want to get through some questions and then have them respond? We have just so. Let's get through set expectations. We have 16 registered speakers tonight. I do not know if all of them will speak, but that that's how long my list is. Certainly in that case, let's get a few under our belt and we'll allow the the applicant to respond. Then, is that cool with you Richard? That is totally cool sean in that case, the next speaker is a Karim Gay Karen. I do not see that name anywhere, okay in the interest of time, I'll move through these quickly and if somebody gets passed over because they did not unmute quickly enough, then just put a comment in the chat. We'll get back we'll circle back to you, nicole job Bailey, Quinlan, Sinead wadsworth. Oh, that's too bad! I wanted to show off that I could pronounce that name right, hey Jen Berkley! That brings us to yeah Sean, let's pause them and allow the the applicant to respond to that question. We've gone through quite a few names here: yeah. No, that's great! Judd! Berkley! Hang in there one more time. Thank you chair and thank you sean a lot to unpack there. So I'd like to actually start with Max Meltzer Max is from Acom environmental consultants. I believe he's on the line and conducted an environmental assessment statement review which numbered over 180 pages. So Max are you able to talk a little bit to some of the environmental issues around the site? Richard? Yes, I can everyone hear me. Yes, very good. So I'll start with, I guess the one of the technical analysis, sections that was called out was the hazardous materials section. Yes, you are correct. Only a phase one was permitted to be only a phase. One was completed and included in the environmental assessment statement, but you will note in a section 2.72, which is the conclusion of the hazardous materials section. We do make note, as you said, of some of the potentially hazardous concerns that we found on the site and we do propose. E- designations on the property to address said recognize environmental concerns in connection with the property, and those designation would call for a phase two environmental investigation to address those concerns, and that would include soil sampling and remediation determination and protocol. So all of that will be addressed. It just is not required for the purposes of a seeker, environmental assessment, but there are eight designations written within the eas, which make note of some of the things that you pointed out and do and a phase two environmental assessment. A phase, two environmental site assessment will in fact be required to remove those e- designations before a building can be constructed thanks Max. So I think that addresses some of the environmental concerns. The E- designation is a small e, that's placed on the zoning map and essentially for construction to proceed at a site. The applicant has to remediate to the satisfaction of the mayor's Office of environmental remediation before being able to pull permits, so it ensures that the site is appropriately remediated, thus addressing some of the environmental concerns. Some of the other terms that I heard were spot zoning just to be clear. This is not a sponsoring, so spot zoning is illegal and many people say okay, so you've got one large lot. Three, smaller lots. It's only four lots. This is an illegal spot zoning, so I actually had the benefit of arguing this yesterday in the first department of the appellate division on a priory zoning case, a spot zoning has nothing to do with the number of lots involved in the result. So a rezoning can involve one lot and not be a spot zoning and can involve 10 lots and be a spots only. The issue is whether or not it's part of a well- considered plan and a well- considered plan is basically defined in the case law, as one which is has concerns of the community and looked at the concerns of the larger area, as well as the city and seen whether or not this proposal addresses those or whether or not it's just for this one site. So what basically, what we would hold here is that the affordable housing that's created on the site, the opportunity to add not just commercial to the site, but mandatory commercial make sure that stays a grocery store. A retail store make sure that stays a commercial corridor is something valuable and would mitigate against any claim of spot zoning. We admit that this building is taller and bigger than what you can concurrently build there. That's right, I mean there's some discussion about the fact that it is an inclusionary housing R6A which allows you to get up above the three. It allows you to get up above the current maximum height of 70 feet, but it is a taller building than the r78 of the reel. But what we would say is this: the r78 of the rear allows for a 95 foot height limit if it's worth it to the community to have a building which potentially is seven feet taller in exchange for 22 additional, affordable units in the community and the ability to keep a grocery store that is so important and has such low margins that it will be in danger of leaving. Otherwise, then that is part of the project. Then that's part of the deal. If it's not, then we go home, but the idea here is that this is not a sponsoring. It is part of a comprehensive plan and we're hoping again that we can be viewed favorably in consideration of the entirety of the time. Thank you, Mr Lobel. Thank you. Mr chairman. Yes, we, yes, so this is the flash again from the Community board. I wanted to ask Mr Lobel. He keeps on using the word affordable housing. I did hear some numbers before about the apartments themselves, but what are what is the charge for affordable housing? Is it really affordable housing or we're just calling it such so? First, I would just ask Ms Ayannati, or do you have a rents in front of you Amanda Richard we did put. We did put a link in the chat for anybody who wants to open at the the HPD link is in the chat right now and it was sent to board members along with the reminder, so that information should be pretty accessible to people. Okay, so, and just there's two things, I would note about the affordability again. We know it's late and we've got people commenting at forty percent AMI, which is ten percent units, a one bedroom and I'm using one bedroom because there's studios to choose, but a one bedroom would go for seven hundred and seventeen dollars a one bedroom and sixty percent ammo would go for eleven hundred and forty dollars and a one bedroom at eighty percent. Ami would go for fifteen hundred and seventy dollars, so rents range from 717 to 1143 and above, but it's important to note the following, because I heard what Sean said and obviously you know we just rent burdens and such, but what's the difference between these units and market rate units and it's not just what price they come out to market at because oftentimes in communities. There won't be a lot of spread between those, but these units are affordable, not for 20 years or 30 years, but for the life of the project. They are tied in by restricted declaration by zoning law. It's basically they are affordable forever and so the rent disparity. Once you get two years five years ten down the years down the road, the city regulates these rents, such that they remain at very low levels and are able to be affordable, whereas the market rate rents are not so are not so restricted. So it's kind of important to note that affordable stays affordable forever and at the at the 60 percent AMI. This is an average of 60:10 of those 25 of the units are at 40 AMI. We want to get low affordability and maintain low affordability, just a follow- up question. I'm sorry if I did not hear it maybe earlier I had started to ask questions earlier about the three joining properties. I believe it's what it was west on Beverly right there. Those copies are three are three stories: how do those neighbors? How are you affecting these neighbors by building such a cool building in your property? So I won't speak for them because I know Sean mentioned that they signed up for the comments, but I will speak about them. The rezoning encompasses those three lots. Those three lots would be converted from the existing R6A with the c24 and they would also be included within the R7Ds2 form c24. Should those buildings wish to remain in perpetuity with their existing uses, they would be totally legal in the event that they sought to redevelop those properties. They would have additional development rights and would be able to build up on those properties. So it's basically like they're part of the rezoning. They get additional square footage if they so choose. If they choose not to, they remain at the site and basically you know would be able to remain in perpetuity yeah but you're, assuming that those neighbors have developers that want that. But if that's not the case, then you're affecting them negatively monetarily, the current building at our site could go up to a height at a minimum of seven stories. Under the current R6A inclusionary certain under certain inclusionary rules, they would be able to go up to 80 or 85 feet, but even assuming seven stories there's they would still be covered. If a developer bought the site tomorrow and put up those buildings as of right, they would still be you know they, it would still be. It would still be towered over. I yeah. Thank you. Now, let's move on with a response from the public who Jen Jennifer Berkley good evening. My name is Jen Berkley I've lived in a neighborhood for close to 10 years at 422, East 17th street, directly around the corner from 1620 Cortana road. I'm here tonight to present my own views on the proposed rezoning, as well as the perspectives of members of the 416 and 422 East 17th Street Tenant Association. I worked as a tenant, organizer and affordable housing advocate for more than a decade and now work in affordable housing preservation at Hud. So I'm well aware of the actual the need for actual affordable housing in Flatbush and Ditmas park. I understand the petitioner sees the proposed development as an opportunity to utilize his property to the fullest extent possible and enjoy the substantial example financial opportunity. This presents. Unfortunately, the parameters of mandatory inclusionary housing mih for short for all of you out, there fall short of actual affordable units for folks, with incomes, more aligned with the majority of individuals and families who live in the immediate surrounding area. Many of Cb14's remaining rent stabilized housing units are in this area, roughly between the blocks of East 16th and the Community Board's eastern border between dorchester and church avenue. Our neighborhood has been hit hard by the devastating economic impact of Covid-19 with many residents fearing what happens when evictions resume in January. I mention this because I am concerned that the addition of more expensive housing will increase displacement pressures in the neighborhood, as well as the potential for the displacement of long- time, businesses that serve the community. I do not doubt the rents that you have quoted just now, you know, are in alignment with what folks would pay if they were to be in a rent, stabilized unit in the area. However, the current rents are, as you probably are aware in the immediate area are significantly higher than that. You know more than probably at least triple. I understand that the petitioner is able to build as of right, so there will be change on this block. You know be that as it may, I have a couple of things I wanted to mention that I'd like you to take under a consideration. Street parking is already sparse in the area, especially even just after 7 pm, a petitioner needs to incorporate parking into his plan. The area can not afford to accommodate an influx of neighbors with cars, speaking primarily about those who will be paying top dollar to live in the new building. There needs to be consideration for increasing the size of the sidewalk along the property line, as well as adding streetscape improving the condition of the sidewalk there's. Also significant gutter related issue in that block. Specifically, anyone who's walked down that block after heavy rain or a big snowstorm knows that there are lakes forming on the edge that solely needs to be addressed. I know it's somewhat of a community board issue, but we'll also raise it here tonight. Other infrastructure improvements someday we'll all go back to taking the subway to work and when we do the platform on Cortelliu is so narrow that it can't hold even 10 more people at rush hour. This building will provide a huge Inc influx of you know, paying customers, and I really think a consideration needs to be taken to make some infrastructure improvements along this along the subway platform, possibly also the overall condition of the subway station. That's the extent of my comments, I'm here tonight. Thank you for the opportunity to speak. Thank you. John you're, welcome next Speaker Sean say it again, sean sorry. I had you cut off Eileen Mcgill, either Miguel Miss Miguel. Can you hear me? Yes, oh hi. Yes, all right, so I have lived in the neighborhood for 20 years. I am a home homeowner and we have struggled incredibly to stay in our home. It is everyone walks through this neighborhood and enjoys the victorian homes and they are so expensive and difficult and we are not ceos and Cfos, and I have battled these battles with zoning before and come to these meetings, but it just does not matter. They go ahead and approve them and you're, taking away sky and you're taking away air and everybody's like well, it's so benevolent it's not benevolent what Tony's doing Tony's, making money and Tony's going to have the grocery store still and I'm sorry, I'm also my husband and I reactivated the Beverly Square East Block Association. That goes for four blocks from 16:17 18 19.. We are highly impacted by this quartal U is very backed up any time a truck is making a delivery at key food traffic gets backed up all the way down the block, and you can't get back to your house. I do not understand why they can't build it within the limits that are already there, because you just keep going above and beyond above and beyond, and 22 units is not going to make any difference in the housing problem in this neighborhood, and there is a major housing problem in this neighborhood, my husband volunteers, at a at a food pantry and during covent now the line goes down. The block and people stand six feet apart for hours waiting to get a little food. 22 units is not going to make one bit of difference everyone's making money, you're taking away sky. It's not right. Thank you. Miss Mcgill, Next, Speaker Sean is darlene bowers darlene bowers for the spowers. I do not see the name. Oh sorry, she was there a minute ago, then we'll move on to Christina Giorgio, hello, hi. Good evening. I live in the neighborhood and I do all of my shopping as much shopping as I can do on cortoliu by Brooklyn local, and I am very concerned about this proposed upzoning sort of just echoing what my last speaker and my neighbor shared. It's really perplexing as to why there is any need to build larger than what is already as of right. That already is a behemoth structure that will obviously impact the neighborhood not only from a sort of contextual standpoint, architectural standpoint, but you know pedestrian traffic, car traffic and then, of course, you know the impact on the subway platforms, which is already a harrowing experience to be on that Cortilliu platform. I can only imagine what it's going to be like when this is developed, but to build it larger. There is absolutely no justific justification for that over and over and over again, you hear affordable housing used as an excuse to basically line the pockets of developers. This particular grocery store. You know it's great to have a grocery store in the neighborhood. It's certainly not the only one, there's other grocery stores on the block. Of course, the co- op is pretty much right, acrosss the street. You know I agree. It would be good to see some improvements to that key food. You know to the extent there's going to be changes there, but there's this idea that you can't keep the grocery store. You can't do the affordable housing unless you build far in excess of what's already allowed there I mean that is just not credible, and if the developer owner wants to make that assertion, he should have to lay out the financials to establish that, because the impact on our neighborhood is going to be. You know permanently affected for the worse. So I str. I stand strongly against this up zoning and I- and I will share that- I am a member of respect Brooklyn. Thank you. Thank you. Miss jojo. Would the applicant like to respond now. I would thank you, chair Powell, some of the discussion. I would start with Jennifer's comments with regards to street parking, so the project right now proposes 44 spaces below ground and a couple of things that are important to note, to the extent that there was an as of right building, you know there would be you know there would be fewer units there would be. You know the spaces may not be as numerous the ability. One of the abilities for us right now is because of the nature of the project we're going to be able to provide 44 spaces which is over and above what would be required under zoning. Victor can probably speak to this more, but there's a requirement with regards to the residential units of, I believe, 50 percent, which, given the layout of the building, allows us to actually generate additional units above Us parking units above and beyond. What would otherwise be required. So we're trying to do our thing and our keep our responsibilities with regards to streets parking. I can't make too many representations with regards to improvements in the infrastructure. I can tell you that looking at the streetscape is something which can be done in the course of our planning and our construction so again, happy to hear the comment happy to incorporate that into the plan. Importantly, here with regards to two comments that were made on the two subsequent speakers, one with regards to sky and air and the other with regards to these units being quote a drop in the bucket. I do not know how you bring affordable units to an area with a shortage of affordable units unless you pre approve projects which require affordable units, to wit, the R7A which was created, did two things: it codified a lot of the existing buildings to the rear and south and southeast of this property at their existing six and seven foot stories, but as far as the creation of new affordable housing units, which would have been allowed under that R7A with bonuses that was really not accomplished here. So the idea here is: how are you about the program these units would be created and I'm, my understanding is that the area needs them. So the other thing I'd say is again and reflecting some prior comments with regards to light and air and the sky the as of right, building here again 70 to 80 feet. You know it's not something which is feasible for Tony to do, but it is feasible for someone else to come in and build a 70 foot to 80 foot building merely by filing permits at the Department of buildings. So yes, there is an additional 10 to 15 feet that is created by this project, but like to say that we're robbing sky and air because there's a one- story building right now is completely blind to the fact that there are as of right options here and with regards to food pantries. I would note prior speakers that noted that this key food is an affordable food option, an affordable grocery for people in the area. It should be factored in and should be an important part of this project into the community. So I do not know how you make that claim with regards to the prevalence of food demand and not recognize that Tony's doing something for the area. Thank you, Miss Flo Bell. I just would like to mention here that with subsequent speakers, please state your name and organization prior to your testimony. Next speaker, please Ed, quick before I announce the next speaker. I just do want to note for the record that, because it's come up a couple of times, the Community board has reached out to New York City transit about the Cortelia road station and asked for a station capacity report. Apparently they do not do those, but we've noted that concern and also use some of the development in the area as leverage to try to push the point that the Community board has made since it was demolished, the return of the B-22 bus and I'm sure developers would want to be on board with us trying to expand or return some of the mass transit that's been in the community and the next speaker is Timothy sudweeks. Yes, this is building live just a moment. I think you were muted or something we missed, or at least I missed everything that you just said. So, let's let's get this straightened out, so we can really hear your your entire testimony currently unmuted. I think there's a bad connection too. I think bandwidth might be low. Oh okay, can you hear me now? Yes, Mr Cedric's, you might want to turn off your video. Sometimes that will help with the audio. Can you hear me now? Yes, but I do not hear you now, okay, so I I'm the president of the Board of 417Th Street. This is the building that lies pretty much directly behind this new development, I'm in an awkward position, because I'm an architect myself and so is my wife work on affordable housing projects, acrosss the city and I'll, be honest to say that some of them are a lot larger than this project. That said, you know I'll come to that later, so you know: we've lived in neighborhoods since 2013 in Brooklyn for 20 years. You know we're brought to this neighborhood because of the bars and the vitality of the restaurants and things the life of Cortelia road. So you know we're not we're not NIMBY- ism here we're for you know we're for 14.. My wife is working on projects in north Brooklyn. One of my projects have been one purchasing queen's height extensions with you know we're asking for. We also hide extensions, but we try to give something back to the community. You know here you're saying that it's 21 units it's affordable out of 85., it's 20 percent. It really is not a lot. I do not get too much into that, because I think that we had already discussed that. So you know we understand that. There's a financial worship developers to increase the size of the bulk, what we call the bulk of the building thing, but you know here it really is out of character. Most builders are seven stories. A building, seven stories, the buildings to the north on the sort of commercial strip are three stories and then it's around single family house houses. So you know if anybody complained and they live in a single family house, you I would say, but on the other side it really does not affect you right. It affects the people that are directly close to it. So you know here you're saying a nine- story. Building is 102 foot is you know? I want to say respectfully to the lawyers here because I may be working with you in the future that you know it does seem a little ingenuous to say that you know you're not robbing light, because you know on every project that I've worked on acrosss the city. We really did look at light. We really did try and engage with the community. We did light studies, you know we looked at shadowing and you know for us. You are actually robbing light. You know nobody approached us. The value of all of the units on the rear of this building will be dropping by a minimum of fifty thousand dollars. People are already leaving that affects our building. It affects that community, and so you know also the I think the diagram showed the plan A9. I believe it was on. You know, he's hit 102 foot, but as many people realize that that's not the height to the top of the actual building, that's typically the rooftop height and you'll notice that 102 foot is below the actual bulkhead on the corner. So it's not 102 foot, it's probably more, like 110, maybe a little bit more on the corner, so I just think that people should be aware that there, so you know I understand that there's not so great to meet in New, York City and it's something that's always real with me, but the re is an issue with designing buildings that are, in my opinion, as an architect that are essentially giving to one group and taking away from another, and here you are literally taking away. So you know a few things already mentioned. Talking is already one issue: there's not enough parking here. If you could just wrap up please. So, whenever we're asking for something from a community, we will typically give something back you're producing a building, and I would expect that a minimum if you will be doing something like zone green here. That does not seem to be much and for people who are into you know get more affordable, housing 25. Thank you. Thank you. Mr subways. Thank you for your testimony next speaker, please. The next speaker is Whitney. Payne, hello, hi go ahead. You have three minutes. Okay, hi I'm Whitney payne and I live in the dentist park area on the corridor in Cortelli. I've lived there for about 18 years now and a resident of Brooklyn going back to 1992 and obviously so. You can see that I've seen the change wave through downtown, where I used to be in Fort, Greene and gentrified out into the Flatbush ditmas park area along the way I transitioned into being a real estate agent, and I pulled the rents and the rents. The current market rents I put in the chat. The studios were 14 to 16.50. The one bedrooms were sixteen hundred and nineteen hundred the two beds are sixteen hundred those are that's an Anomaly. Sixteen hundred to twenty eight hundred and the three beds were 2000 to 29.50 is what I pulled. There may be some higher and there may be some. You know, anomalies for the new developments that have come up. That are, you know, they're, just priced out of out of everyone's pocket like no one's able to afford. I get people all the time asking me to give them the taj mahal for the amount of money that, when you know 40 times the rent that I'm looking to get them an approved application. So I do not think that the market rents are going to make this attractive to anybody in the neighborhood and just as the architect spoke previously and mentioned that you know, there's a give and take between the community and what the developers want. Hopefully- and I have not seen that in the last 20 some odd years, but you know, I know that in East New York, if a developer wants to go there and build, they have been challenged with 50 must go to AMI and then the other 50 can go to market. So that may be something that is a negotiating that can be negotiated between the community and the developer. If this project gets the green light and I or if it has to still be at that 25 percent, perhaps that the building would not be as tall, perhaps they can reduce the footprint. I mean not the footprint but reduce the height of the building. To satisfy the community, everybody else already stated all my other additional issues: parking, transportation, crowded, sidewalks. All those things have already been addressed, so mine is basically will deal with affordability and the fact that 25 percent, just as or 20 that 80:20 is really just nothing and I'll turn it back over to you guys. Well, thank you. Miss Payne, and I certainly appreciate your you know, you're, not continuing to repeat what everyone else has said, and I would urge us. The remaining speakers to you know try to avoid going over the same thing. That has been already said. If you have something different to to add and to offer, please do so, but not just you know, continuing to go over the same thing at this time, I'm going to ask the applicant to respond. Thank you, chair again, cognizant of the committee's time and wanted to get through quickly. With regards to the speaker's comment with regards again to the adjacent buildings to the rear, the property has a small portion within an existing r7a which can go to a height of 95 feet. That is a small portion with most of it being within the R6A that can go to between 70 and 85 feet, depending on, if there's a qualifying commercial ground floor so again a bill. Let's just say that a building will be built here. I it's hard to say that for the seven and six story, buildings in the rear that they will not be impacted. If the one- story, grocery store, stayed in perpetuity, you are right. It would not impact your light in air, but it's it just can't happen on this site, and so this is where we find ourselves and we basically find ourselves at a point where, even in as of right, development models we're at the height of our buildings in the rear. Again briefly to the affordability, we do projects that are 100 affordable on a regular basis. Probably you know at least a good third of our projects are 100 affordable. Most of those projects, though, have city financing, particularly HPD or HTC financing. This is not that this is basically not seeking any city subsidies, so the requirement by mandatory inclusionary housing 25 to 30 percent that will be provided. There was a comment that it was 20. That is not the case. There will be upwards of 21 to 22 units and again we look forward to these conversations. We look forward to providing additional information. The conversation actually obviously continues to the Brooklyn president city planning and the council. This is an iterative process. We're taking all this in. We want to make modifications to our design. We want to really listen to this and like have these discussions. Tony is a local guy. He's not he's not my usual client, you know he's not a developer per se. What we'd like to do is basically discuss this with him and come up with some additional options for the community. So look thanks to everyone for everything. They're saying I just sometimes like to correct some missed statements on the record. Thank you, Ed. Thank you, Mrs Lobel. Next Speaker Sean. We have two more members of the public who have pre- registered to speak and who are also present, which is important for speaking, and then we also have enough from the borough president's office who wants to make an announcement afterwards. So if we can go in that order, it is Julian Hirsch and then Rachel Kasparian. Thank you. Miss heart three minutes each go ahead. Julie Hirsch! I do not see that name Sean! I do not either anymore. That brings us then to Rachel Casparian Rachel Shane, common okay. I will just quickly state for the record that gabby alter a resident of Cv 14 did provide written testimony. I won't read it, but it was opposed to the project and the objections were size of the building, that there was that the building could already be developed for a number of houses, and there were environment and contamination assessment concerns voiced in that opposition as well. Okay, all right, and so let's move on. Do you want? Do you want to go ahead and announce the borough president's public hearing on this hi Sean? This is peanut goose. Would you like me to make the announcement yeah please thank you for your patience tonight. No problem, that's what we're here for so I want to announce that our hearing on this item is scheduled for Tuesday November 10th at 6 P.M and it will be a remote hearing and I will share public notice with the login and call in information very shortly. I will say that we intend to have this as the first item on the agenda to maximize the public's opportunity to participate and to speak and as always, we are accepting written testimony. We've already received quite a bit to ask Eric at brooklynbp.nyc.gov. Testimony can also be sent directly to myself and I believe you have my email address as well. Thank you so much Mrs. Thank you all right, so board members who are present you we've heard from the public now. As you know, it is our time to reach consensus on how to proceed with this matter. So I'm raise your hand. I'm listening to comments. Ed Steve has his hand up Steve, please. Before I get into substance, I just there's someone named Rosa in the chat who said she had a question, so I do not know if you Mr Chair wanted to allow that, but I just wanted to bring it to your attention. Sure we'll allow that what's my name: Rosa, yes, hi, it's Rosa, Waldron hi Ed, oh hi, Rosa. How are you I'm good thanks? I just have a couple of questions. One is well. I guess you answered it if there was going to be an additional hearing and I have the date now, but in terms of the environmental impact study, I was not clear if there's more to be done in terms of checking the impact on broadband and electrical drain or use of resources in the area, because you know, as you know, with Covid-19, when people more people are working from home, there have been issues of connect connectivity. So I'd like to know where exactly are we with those environmental impact studies and as well as waste Management, Et Cetera, Et Cetera, Mr Lobel? Would you address that? Please yeah I'd actually defer to Max on at a minimum on the waste management question and then can discuss the remainder Max. Are you still? Oh yeah? Can you hear me? Yes, all right great, so with regards to stormwater Max you're, not coming in clear, I can't hear him. I think we've lost him huh. We have him back Max. We can't hear you we're missing all of that Max, so Rosa I'll, just I'll answer briefly. So this city looks at waste. Management and Max is referring to stormwater, which was another topic which was raised and which is part of the environmental review and they look at the margin between what could be built at the site and the proposal and the results here was that they were. You know the margin was such that no additional impact study would be required. Having said that, the building itself and Victor who's the project, architects and speak to this- has waste management facilities on site, and you know, as would be typical in a modern apartment building, but I also think you're, probably a little bit more advanced than the city is with regards to broadband and internet access. They actually that's, actually not an impact category that they require us to. Having said that, and you know again being familiar with the project architect and other developments they've done, I know that that's something that they pay attention to and that the buildings that they've designed have been updated with modern facilities with regards to broadband, not only for building residents, but so as not to provide a further drain on the surrounding area. So it's something that I know is happening and is being looked at is anything with renewable energy being included in this. If I may, ask that sure victor? Can you just talk a little bit about the energy code and whether or not there's any renewal renewable energy considered? Well, this would be required to be in compliance with the 2020 energy code. The building would be designed with you know, higher r values, and you know the most efficient heating and cooling systems available at the time and as far as renewable energy, we would have to provide all the areas allowable for for solar on the flat roof. So provisions would be made for solar panels on the roof. Should they should the owner decide to put them in place. All of the facilities would be in place for solar energy on the building. Thank you. You're welcome. Okay, thank you. Rosa. Does that answer all your questions for now and I'll? I could follow up if anything else comes up after the meeting or another day. Thank you. Okay. You're welcome. Okay board members. Let's huddle, please raise your hand, let's wrap this up. I think Steve had the floor. Yes, you know. After hearing from community members, I'm still involved, I'm still inclined to start the project. I agree with Glenn's brief remarks earlier. I do think we're in need of affordable housing. I think this project provides that I think you know rather than rejecting this, and then you know waiting you know and for another developer to buy it and we still end up getting a tall building and maybe not getting the affordable housing units. I just do not see how that benefits the community going that route and maybe losing a supermarket in the scheme of things. So I have not heard you know the alternative from the community. If we reject this, what the you know, what the positive outcome is. That's my standpoint. Thank you. Steve Glenn how's it going Max Glenn. Yes, thank you just a couple of comments back when we re- zoned the northern half of community board 14., I'm the one who initiated that process and was very much involved with it for four and a half years until we finally accomplished it, which did put a 3x over all of the individual housing. But my comment is to the people who are in the neighborhood. Now we've tried very hard to get everyone involved in this and we had no involvement whatsoever from Beverly Square East. So whatever zoning exists at this point that you may or may not be happy with, there was an opportunity to speak up in the beginning. It's gone. The other comment I have is that any change. Well, almost all change has good components and bad components, and the question in my mind, is always: is it more good than bad or more bad than good and I've walked? That area looked at the way the sun is going to come acrosss and where the shade is and Et cetera, Et Cetera, and I think this project is significantly more good for more people than it is bad for a few people, so I must fall on the side of advocating for it. Thank you. Thank you for your comments. Glenn. However, I just have to mention that as long as community board 14 is in existence, there's always an opportunity for for community members to speak up and to be heard and considered next Speaker. Oh Henry, Carl yep, I'm yep, I'm here I just had to unmute myself. First, I do have a question, and so since the mandate for having affordable units is written in the zoning regulations, there was a community board. There was a community member who had mentioned in other areas of the city. You know, there's been higher thresholds for the percentage of units that are affordable, and so currently it looks like it could be 31. If I understand right because it'd be 21, I think it 40 and then maybe 10 at 60 or the reverse, and so the question I have is it possible for the developer and the architect to discuss, and then let us know if they can raise that percentage of affordable units or is this it? Mr Lobel, can you speak to that? I'm going to go. Thank you for your for your question. Carl Henry, what's written into the law, what's written into the law is 25 to 30 affordability, 25 required would carry with it a requirement. Excuse me of 60, AMI and 30 would carry with it an 80 AMI, which basically just means that the more affordable units you provide, the higher incomes you're able to do it at it still retains certain lower averages, but the averages get higher. You know again. We work on a lot of projects. We work on a lot of 100, affordable projects, probably in the last two years, maybe more 100 affordable than regular and- and I do not know whether or not this is that kind of deal. You know the in districts where council members have requested 50 affordability. I think you either get HPD funding or you do not, and when you're, when you do not get the that funding, you basically can't make it work from a financial standpoint. So the kind of the thing I would defer to without you know not trying to avoid the question, is we're happy to take that conversation internally, but I would also say that it's an important conversation for us to have with the council member, which is council member eugene, because at the end of the day, the council is the one that decides on the levels of affordability. So oftentimes. You know people will express to the council member their opinion as far as levels of affordability and that will come into play in that discussion so again happy to discuss it internally. Can't really give you anything at this moment, but we can tell you that 25 to 30 is a minimum and that you know and that there's an opportunity there in certain instances to go higher. Yes, thank you. Mr Lobel Carl did that sufficiently address your question. It did because it did thank you very much for that Mr Lobel, just because I attended that Robert's rules, but you know I always forget if it's a motion or an amendment- and I forget if this is the right venue, but basically given the guidance that Mr Lobel shared, what I'm wondering is for next step. Instead of making a decision in this one, can the next step be that community board 14? I do not know if it would be community board 14 who sets up the conversation with Council member Eugene's office or, if community board 14. Does it in partnership with you know, Mr Lobel and his team and tony, but I'm wondering if the next step can be setting up a conversation with CUNY Board, 14, Mr, Lobel and Tony, and I'm council, member eugene and then basically saying hey. You know here's this proposal, given the regulation. This is what we have council member eugene right. What are your thoughts on this? You know: are you cool with this 30 percent, or do you want this higher and then see what comes out of that conversation? Ed? May I jump in there of course, a couple of things we I reached out. I reached out a number of times to ensure that the council member would attend tonight or have a representative here. So I'm sorry that they're not here but Carl- remind my board. Members too, since a number of issues have been raised, remember that this is a recommendation that the board is making so any recommendation. We want to make that the approval can be conditional upon a closer look at affordability or what else came up tonight, I'm ensuring that advancing the resiliency and sustainable energy and stormwater management. Also, we did not talk about this tonight, but assuring that for the affordable housing, it's community board, 14 residents who get preference in the lottery or, however, that's handled, but there's a there's, a residential preference in the selection of affordability asking the applicant to include an endowment for the tot lot. Since we are the last of all 59 community boards in terms of green space and now you're, adding people. So that's going to actually make us even lower than last in terms of the percentage of people who live more than a quarter of a mile away. So there's a so there's a lot of things, carl that we do not the this is not the end of the conversation and those recommendations can or conditions on the recommendation to approve or to not approve. You know unless these things are not met or approved conditional upon these things. However, the board wants to work it that all can be done in the decision. Thank you Sean. Thank you for that Sean. Thank you for that. Ann has her hand up and Gadette. Now we can hear you, oh great, so actually sean took a lot of my questions out, which would include the residential preference, the green space at streetscaping, as well as the the fact that we are advisory right so, but I guess to further the thought is I hear concerns about light and air. Well, I agree that those are issues it is on. The apartment side of the Leighton Air is complained about by some of the residents on the other side of cortelia road toward dorchester and mentioned from the landmarking to Glenn's point the landmarking. That was not able to be done, although it was, the zoning was redone to Glenn's point the 3x over the housing. So the R7A is only a bit taller, but it does retain the commercial corridor and this seller has- or this developer, who holds this space in part, is looking out for his own interest as a commercial space and retaining it as an ongoing food supply, which was mentioned earlier by another board member that local people do support this key food, and this would allow them to expand the space, offer some affordability or offer some off street parking, but to continue on as a supermarket, recognizing that supermarkets do not have much profit margin in them. It is. We can get into what the discussion of the balance of the the annual median income versus the ratio of that to the affordability. What the income band is to the amount of the affordability, and that's probably for to be. I would hope that Sheldon Lobel's company, Richard Labelle and the owner of the property, who is the petitioner here, can arrive at some better answers or some answers prior to that 11:10 borough hall zoom meeting, so that there is a better understanding of that, because, basically, whatever the support is whatever council member eugene recommends to the community from his city, council position is what will be approved. So we have this opportunity to influence some of those dynamics, but I do not see that an R7A here which is slightly higher with a tiny bit of shade for an ongoing food source where it can become a food desert. We do not have a lot of. We have the co- op there, but we do not have a lot of other food sources for neighbors and that's of concern. So when balancing what the AMI to the mandatory inclusionary housing are, I think that I would like to hear better or some answers by or prior to that meeting and although it's advisory only I'm leaning toward preferring this, but I'm concerned that the mix could be a little better. But please recognize that whatever the the AMI is the more the less affordable it is the higher that AMI is they're going the more the more units, the higher that AMI or it needs to be scattered, acrosss that spectrum, so it needs to work for whoever is doing the project. If the finances are not intact, then the project will likely not go forward and it will be sold as a development site, and so then we lose the the supermarket. So that's what I have to add. Thank you. Anne Barton, Martin Prasant, thanks very much, I'm afraid I'm going to have to step to the other side of that, I'm going to have to say that, as currently presented in light of the objections I've heard from the public this evening and personally over the last year, I would have to say that, as currently presented it not sufficiently considerate of neighborhood and, to my mind, the increase of the amount of affordable housing would be critical to earning at least my own personal approach. That's it thanks. Thank you, Barton who's. Next, give me a second. I do not see anybody else. I do not okay, anybody else. Okay, thank you. Oh wait. Sorry Glenn just raised his hand, I'd just like to say I have no problem with putting in our recommendation that they consider some of the issues such as the possibility of increasing the affordable housing. Maybe adding one or two more units would be really nice, so certain conditions could be added to our recommendation. I'd be in favor of that. Thank you. Thank you. Thank you glenn. You know it. I have to try and arrive at a consensus here, just a second Mr Plotzker. It's important that we try and arrive at a consensus on either disapproval approval or approval with conditions or something I mean I've heard from people who have spoken. I mean it appears so far that you know from the speakers who have spoken, that we're leaning towards approval is that approval with conditions is that you know whatever? What is it I mean, and you know other board members. Are you going to weigh in on this or you know? Where do we stand? Yeah? Okay, sorry, hello, okay, who do you want to go to next Ed yeah? This is, this is Gail. First of all, this was extremely productive and informative, and just to cut to the chase, I am for approving with conditions. I think that there were some very important and necessary conditions for us to move forward, but all in all, I think would be good for the community, but the store has to be there. Thank you, gail. It's v, plotzkar yeah. I just wanted to say what what a little bit about gail said what storm said before I think, if it is going to be approved, we need to take into consideration the neighbors and therefore conditions I think, are our warranty in this particular case. Back is free and ted and again yes, so I'm for approval with conditions, and those would include the earlier things mentioned plus it was stated that I believe Leed certification is sought at the time. These items are on the board. I'm not suggesting that, but it was mentioned by the by council that solar panels are being roughed in. Is there a reason they're not being included? I would like to see more sustainability as well as greening in that area. So with conditions, thank you very much. Thank you. Anne, of course, you know in including solar panels is, you know, that's an option of the developer and you know the owner. I mean it's not something that we can. We can say you must do. However, you know we of course, as you said, can make a make that recommendation to them all right. Would you like me to do to reiterate the conditions that I took notes on as the conversation went just what I was thinking? Yes, the wording of these conditions will have to be tightened up, but so this is just conceptual and then it will be tightened up in order to present at the full board meeting for the public vote on tonight's consensus right. Yes, okay, so I have to go too crazy. I heard a request to review the possibility of increasing the affordability in terms of numbers of units. I heard at least implicitly a request for a shadow study. I heard several iterations of a recommendation to ensure or increase environmental efforts, greening the building and greening the community itself through streetscape, and it's been said before the idea of endowing the tot lot or another local green space and to demonstrate an effort to maximize the sustainability of the building through projects such as solar panels, Green, Roof, etcetera. What I miss, as I recall there was also come some concerns about. I do not. Maybe you mentioned this streetscape sidewalk and parking. You know if I do not recall if the applicant mentioned whether they were including 44 parking spots below the building below grade parking spots, 44.. Okay, all right all right, Steve has his hand up Ed Steve, please. I think one other thing that was mentioned by someone was the the fact that the subway entrance and subway platform is tight. So I do not know if there's anything that we could do about having the developer. You know talk to you know whoever, or you know pressure. Whoever to you know do some sort of expansion. We could ask the developer to support our efforts. I think I think it's more using the development as leverage vis- a- vis transit than using transit piece of as leverage for the developer, but yeah, but yeah that's been on my mind, a lot in the fact so I'll work I'll try to work that in Steve and would be next and Mr. So the residential preference for the apartments, I think, was something that was mentioned a few times so if that could be entered in and the solar panels by the way Mr Lobel mentioned, I did not pluck that out of the air that was mentioned, that it was being roughed in, but it was left to the petitioner to in to actually to actualize them or not. So the great things like the tight lot in green spacing on the sidewalk and pedestrian, creating a wider sidewalk. Those were suggestions from the public speakers, but it was mentioned by the council for the petitioner for the solar panels that they would be roughed in so they could be. So those would be the two things I would mention, but thank you very much sean. It sounded pretty complete to me and it's you know: let's see, let's see how it goes. Carl, oh call yep. You guys can hear me right, yeah, okay, cool, so I have a I apologize. I have a silly obvious question, and so with with the option of approval with conditions, I understand the board makes a recommendation and then you know the board would vote on that recommendation. And so the question I have is: if the board went down the route where we did approve the recommendation of approving this site with conditions and then in the future, we find out that you know for reasons whatever they may be, that those conditions can not be met in some fashion, then does this mean that the project will still go on, or does this mean then that the whole group you know would come back to the table and go hey when the board had put forth its recommendations for approval? It was on the condition that these things were met, and you know for whatever reason. Some number of these are not met, and so we have to reconsider the board's recommendation. Would that happen or if the board goes down the right over? It goes down the road of approval of recommendation and we move forward. Then, if any of those recommendations are not met, the project would still move forward. Okay, I'm going to ask the district manager to address that community boards are advisory. So what whatever the borough president recommends, they may adopt some of the conditions in the recommendation. They may add they may take some away, but that's the next step in the process of the public hearing at the borough president's office and the the book kind of stops at the at the council members, so I'm actually about to type into everybody. I'm sorry that we can't return back to the con to the public for additional comments at this time, taking notes of what's in the chat, also we'll still, we still have an inbox for any emails. You want to send and we'll continue to process additional input, even though we're not going to do it tonight, but I will encourage you to get a hold of the council member because that's who's going to. Ultimately, you know have power in this decision because we are just advisory. I do not know if that really answers your question Carl, but that they can do or not do with our suggestions what they what they wish. As this goes through the process. No, it does. You did answer that question. Thank you very much for that. Thank you, Carl and thank you sean. If there is no more discussion by board members on this, it appears that we that we've arrived at consensus to approve with conditions I think Sean has spelled out those conditions and whatever she missed has been. You know brought up. So you know correct me board members if I'm wrong, but I think our con. You know that we've arrived at consensus to approve with those conditions and those conditions will be properly spelled out by the district manager and our staff and we'll make that recommendation to the General Board at our next meeting. Casino New Board member hands, unless Carl is your hand still up or is that a new raise? Okay? Oh, I see no other board members that okay. So then, that, as stated, it is, is what we'll do that will be our recommendation to the General Board at at our next board meeting. Thank you, Mr Lavelle. Thank you to all the applicants. Thank you for thank you board members and members of the public who have contributed. This has been, I believe, a productive hearing and again our role is advisory. I would suggest to you that you also attend the board president's hearing and to sort of follow up with this, but, as stated, our recommendation will be made to our board at our next General Board meeting again. Thank you all. This concludes our public hearing at 9 23.. Thank you, Sean, for all your help, Sean! Thank you. Everybody! Everyone! Good night, everybody good night, everyone nice to see you good night, take care. Hey there, bro, hey John Marie! You.",
            "summary": "Purpose of this hearing is to hear public testimony by community members with respect to a plan by the New York City Department of Homeless services to open a 200-bed general population, men's shelter at 21, diora pool place, Brooklyn New York, operated by the black veterans for social justice.\nMembers of the public were asked to pre- register by to speak by becoming the pre- requested speakers or aspect of name whether they live in the district and their organization.\nSpeakers were asked to also provide their addresses email for the record members of the viewing the meeting on YouTube and would like to comment on this issue.\nPart of the mayor's turning the tide plan, which we announced back in 2017, was what was basically to sort of for the first time, come up with an actual framework on how to create a shelter system that would be both beneficial for communities and for also for our clients and really rethinking the way that we've done it and that and that, and that plan had four pillars, and the first, of course, was prevention.\nWe had really seen a lot of improvement in that regard and then, of course, we were, you know, had a whole section regarding street homelessness and We wanted to phase out more than 200 shelter sites that did not meet our standards, including closing down more than seven percent of Giuliani Europe cluster programs.\nWe at the same time, we wanted to announce an opening, 90, new shelters and thus far we've announced 74 74- 21 durian place is one of those with solid providers established non- profits that are running those sites that are going to provide excellent care for clients who are in these sites and as well as be good community partners, because it does not matter how well a shelter does its job if it does not have a good relationship with the folks around it part of also the work that we're doing is really trying to advance an early in advance whenever we can, and so previously, under the previous administration, the shelter would open up and the night before folks would come in, and it was terrible.\nDo a fantastic job It's a pleasure for me to hand this over to Jelani, and let him talk a little bit more about the work that they're going to do and their vision for this specific site and then, of course, we're happy to answer any questions that folks may have so Jalani.\nBut we did raise questions and maybe we'll hear more about them about just regarding the location of this site, adjacent to the theater and basically on the theater's loading dock, and we made sure that there was communication between the theater and DHS and the applicant as well as and bridget.\nWe talked about some concerns regarding crime in the area and the number of times 9- 1- 1 is summoned to this very specific block and not only the concern from the community point of view, but whether or not this was optimal for the 200 men who will be living temporarily at the at the shelter.\nWhat was the reason why you may have become late, because there's different reasons why people are late We just want to document it so that we know so that we can build a supportive service plan to help the individual.\nThe developer is responsible for creating the building, creating all the you know, making sure that it's appropriate, so we communicate with DOB about this stuff, but I can certainly find out more about it.\nYou know how much disruption will there be in the immediate area of the building as a developer is working on it inside and outside?\nWe will be good neighbors, as we've already been with construction, but it's something that I'd like for you to give to independently assess, as well as you know, liaising with your neighbor in the jewish world, because I think that we all have some improvement, that we can do, especially with another neighbor and 200 men who are trying to get together and get on their feet and everything that we're doing to everything that we can do to support you.\nSo, we're not foreign to that, and so you know, I, look forward to continue working with you all and all of the institutions , that's in the area, so we can collaborate and be of service This way, I mean, as I said, I.\nAcrosss the city, And I've, never not seen a situation where geek, where black vets has gone into a community and to a site and not fully impressed the elected officials and local community board in terms of the work that they're doing and actually act.\nIf there's some support, that's necessary immediately, so that we can respond to so not only will we be doing outside perimeter checks and are engaging with the Community board and our and our collaborative partners in the neighborhood, but also we do have a 24-hour operations number so that we can respond to immediately to any issues, and I just like to correct one thing : They saved with the city with DHS and the city of New York in it in the income savings program that our DHS has for our all clients in the shelter system.\nThat's, a DOB issue in terms of when it comes to building construction, so the community board will jump in on that nature, with DOB that there'll be permanent coordination and in street opening coordination.\nI. Do not think the department of Homeless Services is asking us for anything, because they are moving forward with this plan, but I suspect the board might want to get a letter out to DHS sort of memorializing, some of the some of the commitments that were made, and especially the Community Advisory Board, and we'll get that right, look forward to seeing that letter.\nPurpose of this hearing is to hear public testimony by community members to a uniform land use review, or you like euler review application to the Department of city planning submitted by 1600 to 1620 realty corporation.\nThe application is for a zoning map amendment for an R6A, a c 2- 4 to a r 7d, slash 2 c 2- 4 district and a text amendment to map a mandatory, inclusionary housing area with the project.\nThe Community Board Office pre- registered speakers are asked to state their name whether they live in the district and their organization.\nThose speakers were asked to also provide their addresses by email for the record members of the public who are viewing the meeting on YouTube and would like to comment on this issue.\nPlease include your name address and organization, if applicable, in the emails members of the board, who are participating in this hearing via webex and use the icon to raise his or her hand or ask to speak in the comments on the webex screen when called upon.\nWe we've been in this location in this community for like 26 years since 1995, and for the years you know we have Throughout the years we get offers from developers, they wanna, they wanna, develop the site and, , that's beneficial to the community, which is a larger supermarket, that we even currently have and have affordable, housing.\nIt's rental apartments,, that's very much in the community, and you know in Brooklyn, And, I, believe, even and now even more important to do such a project because a lot a lot of developers like abandoning you know, plans to do any investments in Brooklyn and in New, York City, all together, but we are sticking it out and we're staying there We want to invest in the community.\nHe explored as of right options here and his goals were, among other things, to keep the supermarket here and to potentially create some affordable housing, and in order to do that, there's already an r7a district to the to the south of the site.\nThe zoning map and the R7A district already encompasses a tiny corner of the site, but in truth, in order to make a mixed- use development here work, particularly in light of the fact that supermarket is a low- margin.\nThis is really seen as important here, because when we looked at the R7A zoning before much of it created and docked and becoming doctrine after the 2009 Flatbush resolution was a mandatory, inclusionary, housing district, and so this basically carries with it a requirement that 25 to 30 of the units will be affordable.\nThis is an area which can use additional residential units to relieve rent pressures generally and specifically, for the ability to do affordability.\nWe have a long list of other of community members and I'm sure that even board members who are leaning one way or another would want to hear from.\nAnd, then the reason, and so the reason I asked that is to tie into the third one where I'm If I heard you correctly that as part of the zoning regulations right that mandates the percentage of units that have to be devoted to various levels of AMI- And So, you know we're in the time of Covid-19 and no one knows how long the impact will be, and so The concern I do not know if it's a concern, but The question I have is if we find a situation where, after the building has been completed, and it turns out that you know the developer and the building are having a hard time filling up.\nThis extent that there's some modification going forward by HPD that would be likely to be governed by their office, but as far as coming off those amis, it's not something that the owner would be able to necessarily engage, and I would note that you know typically I could not get any audio on my computer.\nZoning, let's be clear, affordable housing is welcome in community board.\nIt was very specifically rezoned at that time, from an r6 to an R6A, with an overall increase in allowable residential, far to simply erase all that work and consideration to gain approval for the massive up zone is unnecessary and wrong and nothing is stopping the owner from developing a 40:50 or 100, affordable housing development under the existing zoning.\nWe're huge supporters of the local grocery and laundry and cleaners, but a new store at this location would not justify the up zoning In addition, there's some serious environmental concerns that have been inadequately addressed by the application in the hazardous waste section, the location served as a dry cleaner since 1934, and only stopped on- site, processing.\nA phase, two environmental site assessment will in fact be required to remove those e- designations before a building can be constructed thanks, Max. So I think that addresses some of the environmental concerns.\nThe issue is whether or not it's part of a well- considered plan and a well- considered plan is basically defined in the case law, as one which is has concerns of the community and looked at the concerns of the larger area, as well as the city and seen whether or not this proposal addresses those or whether or not it's just for this one site.\nWhat we would hold here is that the affordable housing that's created on the site, the opportunity to add not just commercial to the site, but mandatory commercial make sure that stays a grocery store.\nWhat we would say is this: The r78 of the rear allows for a 95 foot height limit if it's worth it to the community to have a building which potentially is seven feet taller in exchange for 22 additional, affordable units in the community and the ability to keep a grocery store.\nBut it's important to note the following, because I heard what Sean said and obviously you know we just rent burdens and such, but what's the difference between these units and market rate units And, it's not just what price they come out to market at, because oftentimes in communities.\nMany of Cb14's remaining rent stabilized housing units are in this area, roughly between the blocks of East 16th and the Community Board's eastern border between dorchester and church avenue.\nI mention this, because I am concerned that the addition of more expensive housing will increase displacement pressures in the neighborhood, as well as the potential for the displacement of long- time, businesses that serve the community.\nCan't do the affordable housing unless you build far in excess of what's already allowed there I mean that is just not credible, and if the developer owner wants to make that assertion, he should have to lay out the financials to establish that, because the impact on our neighborhood is going to be.\nI would start with Jennifer's comments with regards to street parking, so the project right now proposes 44 spaces below ground and a couple of things that are important to note, to the extent that there was an as of right building, you know there would be you know there would be fewer units there would be.\nUnless you pre approve projects which require affordable, units, to wit, the R7A, which was created, did two things: It codified a lot of the existing buildings to the rear and south and southeast of this property at their existing six and seven foot stories.\nThe other thing I'd say is again and reflecting some prior comments with regards to light and air and the sky There is an additional 10 to 15 feet that is created by this project, but like to say that we're robbing sky and air because there's a one- story building right now is completely blind to the fact that there are as of right options here and with regards to food.\nThey do not do those, but we've noted that concern and also use some of the development in the area as leverage to try to push the point that the Community board has made since it was demolished.\nThe return of the B-22 bus and I'm sure developers would want to be on board with us trying to expand or return some of the mass transit that's been in the community, and the next speaker is Timothy.\nThis, is the building that lies pretty much directly behind this new development, I'm in an awkward position, because I'm, an architect myself And so is my wife work on affordable housing, projects, acrosss, the city And I'll, be honest to say that some of them are a lot larger than this project.\nThat does not seem to be much and for people who are into you know, get more affordable, housing, 25.\nSo I do not think that the market rents are going to make this attractive to anybody in the neighborhood and just as the architect spoke previously and mentioned that you know, There's a give and take between the community and what the developers want.\nThe project, architects and speak to this- has waste management facilities on site, and you know, as would be typical in a modern apartment building, but I also think you're, probably a little bit more advanced than the city is with regards to broadband and internet access.\nFirst, I do have a question, and so, since the mandate for having affordable units is written in the zoning regulations, there was a community board.\nThere was a community member who had mentioned in other areas of the city.\nYou know, there's been higher thresholds for the percentage of units that are affordable, and so currently it looks like it could be.\nIs it possible for the developer and the architect to discuss, and then let us know if they can raise that percentage of affordable units, or is this it?\nWe work on a lot of 100, affordable projects, probably in the last two years, maybe more 100, affordable than regular and- You know the in districts where council members have requested 50, affordability.\nWe did not talk about this tonight, but assuring that for the affordable housing, it's community board, 14 residents who get preference in the lottery.\nAs an ongoing food supply, which was mentioned earlier by another board member- that local people do support this key food, and this would allow them to expand the space, offer some affordability or offer some off street parking, but to continue on as a supermarket, recognizing that supermarkets do not have much profit margin in them.\nOkay, I'm going to ask the district manager to address that community boards are advisory."
        }
    }
}