{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB6",
            "channelId": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "title": "Manhattan Community Board Six - Full Board Meeting",
            "publishDate": "2020-12-10",
            "shortDescription": "",
            "lengthSeconds": "3:01:50"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB6",
            "normalizedName": "Manhattan Community Board 6",
            "twitterName": "Manhattan Community Board Six",
            "youtubeChannelName": "Manhattan Community Board Six",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "twitterHandle": "@cbsix",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "Ok94tkLx2HY",
            "fillerWordCount": {
                "uh": 469,
                "um": 329
            },
            "readTimeFullTranscript": "104 min read",
            "readTimeSummary": "17 min read",
            "wordCountFullTranscript": {
                "ballot": 39,
                "shelter": 38,
                "state": 31,
                "vaccine": 27,
                "housing": 27,
                "legislation": 23,
                "business": 22,
                "shelters": 22,
                "neighborhood": 22,
                "council": 21
            },
            "wordCountSummary": {
                "shelter": 14,
                "services": 9,
                "housing": 9,
                "state": 8,
                "land": 8,
                "ballot": 8,
                "opening": 7,
                "pandemic": 6,
                "health": 5,
                "funding": 5
            },
            "fullTranscript": "All right are we all set up. I am set myself, I, don't know about Cuddy or Jesus with their recording, but the slideshow is set up, we're good to go all right. So welcome everybody to the December 9 2020 flow board, meeting of Manhattan community board six, my name is Kyle died and I'm the chair of Community board six. This meeting is being called to order at seven pm tonight we are joined by Secretary Sema Shaw District manager, Jesus Perez Assistant, District manager, Cody Osterman and Community associate Brendan Burke in order to conduct an efficient meeting tonight, I want to discuss a few ground rules. The first is that no one may speak until granted the floor board members. If you have a question about board business or wish to make a motion, please raise your hand through zoom. If you click on the participants icon, the participants panel should appear and you should find the raise hand function there. If you still have technical difficulty, you may click the chat, icon and relay your difficulty. Just a reminder. The chat function should not be used for CB6 business or questions about agenda topics. No conversation side conversation should be taking place in the chat function. Any remarks should be made on the record by raising your hand, through zoom chat should only be used to alert us of any technical difficulties you're having or to state in writing information such as an email address that was already stated aloud on the record during the meeting once a member is given the floor to speak, I will identify you and you can unmute yourself so that you can speak as we all know, we are required by executive order to create a verbatim transcript of this meeting. So please keep questions and comments succinct and generate into the discussion for the members of the public who are attending tonight in lieu of submitting a speaker slip to speak in the public session. You can register to speak in the public session by using the q and a feature of zoom, please post your name affiliation and what topic you wish to speak about. This needs to be done by 7:15. Some of you already confirmed with our office to speak. Please still include your name affiliation and topic in the Q&A section so that we can ensure that you are here so the agenda for tonight's meeting was distributed ahead of time by the board office was posted online and appears on the screen before you. If there is no objection, we will adopt the agenda as stated board members. If you object to adopting the agenda, please raise your hand through zoom all right, seeing no objections. The agenda for tonight's meeting is adopted. We will now take attendance by roll Call board members. You can unmute yourselves and answer present when your name is called hi. Everyone welcome to tonight's board meeting since I will not be able to see you if you could just you know, verbally share that you're present. That would be great Kyle Attide present Asia body present Martin Barrett President Elvis Barroso Rossen Joan Barenbaum President Matt, Bondy, Claire, Brennan, President, Jim Collins, here Dan Divine, Dan, futuristic, Rick Eggers, here Charles Fernandez present Andrew Gross present Adam Hartke, President, Molly Hollister, here page judge here, Yousef Khalid, you soon John Keller, here, Abigail Cruzmark, Present, Anton, Mullner, Anton, Mallner, Avita Matthew. Here: Sandra Mckee here, Wells Magaly, Richard, Mintz, hair present Philip Napolitano Kevin O'keefe President, Rishma, Frank, Scala, Lawrence, Share, Present, Ann Seligman, here Lucie Lou, Sean, Sherman, President, Sandra, Sherrod, Sandra, Letty, Simon, present Susan Steinberg, here, Andrew Suresh, here, Mark Thompson, here, Der Donk, President, Brian, Van, Duvenhoven, President, Ronnie, White, Ronnie and Claude Winfield. Here. Thank you. We have Quorum Seema. This is Yusuf by the way I joined late. Okay got you! Thank you. That's Hema same with Dan Divine sounds good. Thank you all right! Thank you. Are there any other people who joined after the roll call, okay and just a reminder if we can all remain on mute as we speak, I'd greatly appreciate it. So to begin the public session, our office has had conversations with Nyu Langone on their work. Regarding a Covid-19 vaccine, I've invited Nyu Langone to come today to speak to us for a couple of minutes on their work. So we are now joined by Dr Angelica Kotkamp from the division of infectious diseases at the people of medicine, who will be speaking about Nyu Langone's Covid-19 vaccine trials. Dr Kemp are you here today, Jesus Cody. Do we know if he is here just give us one? Second, okay: why don't we give her a few minutes? And while we sort this out and go to the next speaker, I see that the doctor is a co-host. Okay. I do want to make sure we get this presentation done before we jump into other public comments. All right, so we'll move on to the elected looks like she's ready to speak. Okay, perfect timing, look looks like there's an audio issue: okay, so I'm just going to move on to some of the elected officials. Once we figure out that audio, we can jump back to the doctor's presentation. All right so holding our meetings over Zoom has allowed us to speak with more of our district elected officials and for them to join our meetings each month, something that we're all very grateful for so to be respectful of everyone's time and the fact that our electeds do have multiple meetings to attend in a given night. We're asking that the reports be brief and that you're refraining from duplicating what other electeds have already said. So, first up can we elevate council member Kalos to a panelist. Please give his report he's rejoining as a panelist. Now, okay, perfect, give me one. Second, I'm parenting right now, no problem good evening disaster averted. We needed our book Perfect welcome, council member I see the borough president is here: did you want to go first? Go ahead, I'm fine! Thank you very much. Thank you for everything. I want to thank this board for taking a principled stand on supporting the homeless and what you've been and I want to. Thank your chair for the statement that he put out and just we work very closely with our borough President Gabriel, to provide additional services, particularly on the east side and parts of the city that we are able to do more and to do our fair share. So I just want to thank you as a board, your board chair and our borough president. Before Thanksgiving we had a hearing, the mayor has cut our non-profits retroactively and we are demanding that he returned the money at the hearing. I called the mayor a liar, because it may be true that the mayor told folks that it was going to be a right sizing when it actually wasn't. Our brother, President Kyogre has been helping on this and trying to get our non-profits their funding back. Also, just as we were thinking about Thanksgiving, we were thinking about the fact that, where other people see a dead city with ten thousand bacon apartments, I see ten thousand bacon apartments that could actually house the ten thousand families in our homeless shelters. Only ten thousand. They make up thirty five thousand New Yorkers, and we could house them in these apartments tomorrow and just to be honest, we're spending six thousand dollars a month. Housing a homeless family in a shelter and I can tell you that, no matter how expensive your neighborhood is Midtown upper east side, you can get a two bedroom for less than six thousand dollars in this city. We worked with Gail on a letter to get the outdoor dining set. Gail is a sponsor of the legislation, I believe which we actually passed into the law to make outdoor dining permanent, we're working on making cultural streets available for folks as we get back to the pandemic. In the second wave, we've been fighting with the mayor because he put out a press release, saying we had enough N95 masks when we're actually 30 days short to supply and dangerously so we're getting reports of people rationing at public housing. Sorry, public hospitals, if you know, if you are a doctor or health care professional and you are being asked to ration- and you do not think you are safe- please reach out to my office, coronavirus coronavirus.com. We will work with you on your institution to get you N95 masks from the stockpile. If you are a city employee, there is a separate stockpile and we will get you the materials you need from masks to bodysuit the gloves. There's no reason anyone should be rationing and we are working with vendors to try and get locally sourced locations while we're trying to deal with the whiplash of reopenings and closers we're not getting the mayor's version of remote learning, which is called Learning. Bridges. We've worked with the borough president and other elected officials on the east side to get 200 Learning Bridges sites on Roosevelt Island. So if you need Learning Bridges sites, we're working with real estate developers, child service providers and parent organizations to just get these spaces connected Gail put in about 750 for a new playground in the neighborhood we did about 2.5. We have new playgrounds, we're opening and I think those are the big pieces. We have a holiday party coming out. First fridays we'd love to have help you- and we mentioned this at the Borough Board, but we'd really love to partner with Cv6 to identify cultural institutions, health institutions nonprofits who could be doing their part for elections. We only have one site in CB6 for early voting. That's not enough! So, let's work together. Let's identify locations, let's force the board of elections, to open more early vote sites and I believe you are the folks who can help us make it happen. Thank you all right. Thank you! Council member, I'm actually part of that working group. So thank you for inviting us and I look forward to the first meeting. Are there any questions for the council member all right, seeing none very easy night for you borough, president Brewer, would you like to speak now or during the borough president's report? I'll be quick, I think it'll be just me and nobody else because of time constraints. I know that Brian Lafferty's on Kyle. Thank you, I'll be quick. I do want to hear your doctor I just want to echo, not to repeat, but the Karen was terrific. Today on the call about the Renwick hotel, it's going to be a challenge. I think we were all thanks to the call organized by councilmember powers. We will all chip in I'll just leave it at that to make sure that it's successful if it goes through and I, think it will. The MTA is coming up with hearings. If there's some suggestions in addition to what we are going to be asking for, let us know also on transportation, helicopters and I, assume that there are complaints to Jesus Perez and the board as well as others. We have a lot and way up on 311 nothing coming out of the heliport in your area or in board forest Heliport, but New Jersey. They have about 50, heliports airports and the helicopters are coming from there. So we're going to meet Mid-December with the New York folks, the Faa, the Eastern helicopter organization, etc. Then we're going to in January February meet with New Jersey we've been in contact with all the elected officials in New Jersey. We don't have a lot to stand on even congressman Nadler tried some time ago to work with them and they're very cooperative, but they don't get the complaints. I have somebody complained the other day they were running early in the morning and such apart for one hour, a tourism was just hanging over the park. Looking at the sun come up, that is from New Jersey so and there's a wonderful article if anybody's interested in Gotham gazette with regarding this topic from Julia Vertilla Martin, she spent time out in New Jersey. So I'm just letting you know something that we're focused on again. I've done it before we're gonna keep trying I. Think being careless was talking about the child care seats, Manhattan lost 550 of them. They went to other boroughs where now the city says, oh we're giving you pre-k free case not full day, and so we are fighting to get those back. It's not appropriate. We have plenty of low-income New Yorkers who come to Manhattan to work who are low-income and we need the head start. We need the full day. We do not need just pre-k, so another fight that we're on last year, I put in about 50 million dollars for DOE devices. I think I might have mentioned this we're getting closer, but we still don't have the money and every single discussion from parents at every single discussion, whether it's two six five any board Cec school discussion is about the lack of devices, so here's 50 million dollars sitting in the bank we're trying to get it out of DOE, OMB and SCA letters calls it has to do with. You know different ways from a cart. This is an individual device. The kid should be able to take it home, they're working at home, so long story short we're fighting it we're gonna win, but it's taken a year and a half just to get the money after much discussion. I'd only want to get into it. I think I keep talking about this public realm discussion. This is the concept of somebody, perhaps next administration being in charge of our streets. I've been working with Times, Square alliance, the great Tim, Tompkins and others, and again I think you have been discussing it in your committees and I would love to get ideas. I did count. 24 agencies who work on the streets, I added them all up, I made a list we'll send you a copy of the letter. If you haven't already gotten it that we're sending to the mayor and we are going to keep focus on it, you know that February 1st, all of the applications for community board for current members and I hope you reapply as well as new members are due. We are you know, despite the challenge, with working with past budgets, we move forward with the next capital budget and we had last night a fabulous discussion with all the schools in Manhattan about how they apply for funding and we're doing something similar with all the nonprofits who want to be part of an information session tomorrow, December 10th at 11 A.M, it's all on our website or in our newsletter and I hope you all get our newsletter, because if I say myself, it's very good. We are working on an affordable task force for affordable housing, I should say an affordable housing task force and coming up with some ideas again, perhaps for the future. But we have to have something very specific. As to a goal- and it may not be the top idea for board six, so there are 700 hotels in the city and they're about 63 64 housing homeless. At least a lot of hotels are going to be in trouble, not all, but some and perhaps at the silver lining, to work with the non-profit community and the city to purchase some for quality, maybe senior housing, that's a feeling that generally fits with hotels, religious task force we're working on for what can happen to the buildings. Please weigh in on governors island. It's not exactly in your area, but it is the city's area and I'd love to have your input. Thank you very much. Thank you for President Brewer. Are there any questions or comments for the borough? President from our board members or the public? We do appear to have one a question from Deborah Ferrone, whether the borough president is assured that we have the types of provisions for the Renwick that were found missing at the Lucerne site, such as safety and outdoor space. Debra was terrific today on the call organized by the council, member and I think Deborah. Thank you, I think I made it clear. You've got to work with the non-profits in the area. I heard that they were working with one in terms of the street homelessness but I. There are others and they need to be part of the discussion and what I heard about on-site you heard the same thing is that people go to the provider, help or otherwise that they were working with before I need more information and also I'd like to know specifically. Aren't there more events, I'm sorry more programs on site. That's what worked at the Lucerne on-site programs in collaboration with neighborhood organizations. In fact, I mean guided Riverside on the West side came through, they are paying 40 full-time jobs as a result of the effort, and if the mayor hadn't been so whatever they would have done more so I hope that answers your question and I appreciate it. Thank you. Boro president I do not see any other questions or comments, so thank you so much appreciate it. Thank you before we move on is Dr Khadkamp on. Are you able to present now hello? Can you hear me now? Yes, we can hear you yes and we can see you but now you're on mute again, you'll need to unmute yourself. Can you hear me now I can hear you okay, great. Thank you good evening. Everyone, it's a pleasure being here, thanks for hosting us, I am coming in a representation of Nyu Langone and I would like to talk to you about our projects with the vaccine center. So I would like to share my screen and that way I can talk about the vaccine. I prepare some slides for you. So let's do this share and I hope I'm good to go. Can you see this screen with the copy vaccine trial? We can see the presentation. Thank you. So thank you again. I work really we're very committed to the community with our work with vaccines. We really believe community is essential for us and, as we are all aware, it has been a very important topic for vaccine trials and now, with poor vaccine distribution and as working with the vaccines, we face many challenges that are coming from many parts of the community. Things, like fear, uncertainty, isolation and mistrust, and it's our job to address all these concerns, to validate them and to provide education. So we can all be well informed about what this topic around vaccines and about the vaccines we call it involved. Our job is to primarily provide education, answer, questions and then to provide information. So people know how to reach us if they would like to hear more about our project in general. A vaccine is a very good thing that helps our bodies to recognize stranger things or foreign bodies. So, in the case of coronavirus, the idea with having a vaccine is that we are preparing our immune system to recognize this foreigner particles like a Corona virus. So when we teach our body who is the enemy in this case talking about the enemy as the coronavirus, our body will be prepared to fight it at the moment it sees so in a way, a vaccine will help us to get. If you want a picture like this, like an army ready to fight it, and whenever our body recognizes the coronavirus particle, then it will be very easy for it to fight it before the Covid-19 can actually infect ourselves. So this is a very common principle for many vaccines, and this is basically what all vaccines do. They teach our body to recognize foreign things and in terms of Covid-19 and vaccines. When you put together a vaccine, you are not actually constructing the virus by itself. So, as this picture illustrates very well the fact that the Covid-19 vaccine includes, in this case a wheel and the different parts of the bicycle, that doesn't mean that you can put together a bicycle with these three little pieces. So it's in the same way the coronavirus we're just using the dna for some of these vaccines, just the Dna of one of the proteins of the coronavirus that we're not really using the whole bio. So we're not going to try to reproduce the virus in a person's body. So why a vaccine is important. It is important from the public health perspective. We want to decrease death and serious disease as much as possible. We want to preserve the functioning of society and I think we have seen this year how society has been dysfunction in many ways, not only from the economical perspective, but there are many other issues that are just like out of control because of lack of control of the actual pandemic, reduce the extra burden of the disease as having people already facing disparities, and also to increase the chance of everyone to enjoy healthy and health and well-being. We all want to go back to times when we didn't have this problem with that. So why and these vaccines are affected, you can see in the left side infections like bacteria, polio and measles, and you can see like coming from the left to the right how the curves of the epidermis with these diseases was going and then, with the introduction of the vaccines, you can see the number of the cases that were reported went down. We believe this is the case for the Us and for the in this case, for the whole book blog that we can curve the coronavirus and we can slide it down with vaccines like it has been demonstrated many times with other vaccines. So right now we're working with the vaccine of Astrazeneca. We completed our studies with the physical vaccine and then we're going to move forward with another vaccine that is coming from Sanofi we're looking for people that are interested to participate that have they believe they have some chance of acquiring Covid-19 and we're looking specifically at those communities and people that have some underlying medical conditions that have greater chances of exposure because of their job or simply because of their underlying medicine conditions and people older than 65 in general. But we're trying to include a wide variety of people in our child just to remind people. So we know that the existing companies are creating a lot of doses for the Us and for the globe, but not even if they had like infinitive capacity. It will be enough for us so just to put in perspective and modern fights that have doses for 22.5 million people in the U.S by the end of 2020, and that's only seven percent of our population and the U.S population is 0.3 billion. The vaccines are only enough for four percent of the global population. Definitely a big, a very important topic, so vaccines don't take life vaccinations. Do we want to create education and generate trust in the community with that I and my presentation, this is a picture that I think is important to remember. This is in Roswell island in Manhattan, the New York City smallpox hospital, and now it's just these worlds. We want to be like that. Okay, thank you. So much and I will leave some information for you. So you know how to reach out to us we'll be happy to provide more education in the future and with that I'm going to stop my screen and all right. Thank you so much Dr Khadkamp and to everyone else at Nyu, Langone for all of your great work and dedication to obviously something that's very difficult and in many ways unprecedented we're going to continue the conversation with you. Of course, I know we're discussing with our new health committee ways that we can work best together moving forward and to have you know more detailed and ongoing presentations on data as we get it. So I do appreciate that partnership and we all look forward to continuing, particularly in getting accurate and reliable information out into the community. So thank you so much. Are there any questions or comments from members of the board or from the public on the presentation we just received I see that Senator Hoyleman said that he participated in the Pfizer vaccine at Nyu London. So thank you for that. All right I do not see any other questions or comments. So thank you once again, Dr Khadkam for this wonderful presentation, very informative presentation, all right. So moving on back to the elected officials report I was a good segue, Senator Hoyleman I'd like to take the floor. Thank you. Thanks. Kyle great to be here great to see everyone. Yes, I did participate in the Pfizer vaccine trial at the Nyu vaccine, Center I, have to say the nurses and the researchers. There were incredibly informative and took good care of me, I'm pretty sure I, I'm pretty sure. I got the vaccine and not a placebo, since I did have some mild side effects, but they went away pretty quickly and I would say it beats dying from Covid-19. So to the extent we can share information about the safety and efficacy of vaccines and the important part which is while this vaccine was ramped up quickly. The FDA and the professionals at the NIH didn't cut any corners and I know the Nyu vaccine. Center can confirm that and their safety trials. So that's going to be a very important message: Kyle that we need and the community board needs to get out to the general public as we ramp up. Distribution of the vaccines and, frankly, distribution is a very key question and you know I support efforts by this, the city and the state to ensure that the most vulnerable communities receive the vaccine first and that in particular, communities of color, which have been most you know, hardest hit by Covid-19, received priority. So looking forward to you, know, fighting our way out of this and ensuring that the vaccine is as widely distributed as possible. Just wanted to also mention that I have carried over the years a number of bills in Albany to make it a requirement that school children receive vaccines and protect everybody, because it's not just about protecting yourself. It's about protecting other people, and even if you get a cove 19 vaccine, you still may be able to actually carry and disseminate the virus. So it's important that everyone, even if they have been vaccinated, continues to wear, masks and practices. Social distancing, Sam Vasquez from my team, is on the phone with us on the zoom I just wanted to thank him. I introduced a bill this week that we're calling Sami's law Sammy Cohen Eckstein was a young man who was hit by a speeding truck and died as a result, just a few months before his bar mitzvah, and so we're naming this legislation after him, which would allow New York City to lower its speed limit, believe it or not, Albany controls, speed limits for the city of New York shouldn't be that way and there's a mandatory minimum streets have to be 25 miles per hour in the city of New York. The city has no control over that in 15 miles per hour in school zones. We want to lift that completely and that's particularly important during this pandemic, because we've seen the explosion of automobiles, pedestrian and cyclist use and outdoor dining. So we need to allow the city to be able to tailor speed limits for particular streets. Statistics show that for every mile per hour that you reduce speed, you save about three percent lives lost in fatalities. So it's very important that we continue to press this and I hope we can get Sami's law passed in Albany this session. Speaking of the session, we may be going back before the end of the year. I know my colleagues will be speaking about it too, but the big question on the table is revenue. Do we wait until the federal government comes through, or do we try to raise revenue now, or at least have a contingency plan for that? I'm? Certainly in the latter camp as I know, most of my colleagues are in Manhattan and we have a number of proposals out there to raise revenue, we're looking at massive deficits at both the city and state level and billions of dollars. We're not gonna, be able to do it all ourselves, but we need to understand what we can do in the state of New York, because cutting essential services, you know, like homeless, shelters like mass transit, like public schools, is just unacceptable, so I'll be working on that with my colleagues in brighter news. Councilmember powers and I negotiated a relief for small businesses at grand central station with the MTA. It's a shared sacrifice model that we instituted whereby the small business owners will be paying in rent a certain percentage of their receipts, and that's so important because you know foot traffic has slowed to almost non-existent on some days in grand central it seems, and so we need both the landlord, in this case the MTA and the tenant to pay a little and in Fact Council Assembly member Harvey, Epstein who's I know on the zoom and I have replicated that type of shared sacrifice. Model for a bill called the save our storefronts legislation and Harvey and I are gonna, be pushing that in Albany to save our small businesses, we're looking at like a third to half of our small businesses. You know basically being extinguished due to this virus and if we're going to see them through this second wave they're going to need our support and I. Think it's important that the state step in and do that and then one more item last week was World Aids Day and on that very somber day. You know for many people, this pandemic is not their first rodeo. Those who have suffered Aids and HIV I introduced a package of bills with a number of my colleagues, including assembly member Dick Garfield, the chair of the health committee that would institute what I'm calling universal Prep and pep and prep is pre-exposure. Prophylactics and pep is post-exposure. Prophylactics and they're. Basically one pill a day: drugs that can block HIV transmission. We want to make those drugs as widely as available to as possible, particularly to young people in communities of color. You should be able to go to a pharmacist and get pep without a prescription. You shouldn't have to require pre-authorization by your insurance company, and your insurance company should be required to pay for pep and prep, and that's what we're going to do with our legislation and I just wanted to say. I wish everyone. You know I had the happiest of holidays, I'm pretty confident that 2021 is going to be a better year than 2020 was and just want to thank the community board for all their effort, and particularly my colleagues for their partnership on and so many initiatives to get us through this pandemic, including food distribution to food distribution and the allotment of PPE. To so many of our neighbors who are struggling. Thank you so much Kyle all right. Thank you. Senator I knocked on wood for 2021. yeah right. How could it be? Worse is my question. That's not fine. I have two questions for you. Adam is first senator want to applaud your efforts on lowering the speed limit. I wish you the best of luck and I hope it happens. Anecdotally, I there was a very fast car going down. Park Avenue I was shaking my fist in the wind being like. Ah what a jerk here it is and then Lo and behold a flashing light appears and it was a speed camera. You know that was able to make this person's day a lot worse and mine a lot better. So, thank you for your continued effort and support for red light and speed cameras here in the district and here in the city could use a lot more. Thank you cool. Thank you. Yeah I have a bill Adam. Also that I carry that. Would we call it the furious act. It's fighting urban racing in our streets act named after that classic film, fast and furious, which would allow speed cameras to operate longer than just school hours and hopefully catch a bunch of these drag racers and you know jackasses who are using our streets. As you know, the Indy 500, so I hope we can have more speed cameras because it also, you know, reduces a lot of frankly interface with NYPD and stress on them and on different communities. So the more we can do this through cameras, the better. Thank you, Jim Collins good evening, senator hi. How are you I wanted to raise the issue you mentioned that so many small businesses will be losing their leases and going out of business that allows for many of the chain, restaurants and chain businesses to come in and gobble up leases quite cheaply. I'm wondering if you would support the notion of zoning that allows for designated small businesses to be cleared in that area. It's called formula business, zoning I, don't know if you're familiar with the concept it's been adopted in San, Francisco and a few other places, but what it does is it allows the certain blocks to be set aside or certain spaces within blocks to be set aside and used only by businesses that are not chains, not Mcdonald's, not chase Manhattan, not Walmart, Etc Walgreens in our case, and I'm just wondering if you would consider that as an option to preserve small businesses, small retail businesses, particularly in small restaurants within certainly in Manhattan and perhaps elsewhere, yeah Jim. It's a great question formula. Retail zoning is something that the borough president has actually pioneered by the way I've grown so fond of Gail's brother, photocopy machine or printer, because I see it almost every zoom meeting, I'm gonna miss it. If we ever go live again, but Gail did that on that boys side in fact, Jim I carry legislation. S8570 would love you to take a look at. It authorizes the city of New York to Institute formula retail zoning throughout the five boroughs. I will continue to advocate for that. I totally agree with you on the on its importance. Actually, my colleague, particularly in this environment, yes, my assembly colleague, Harvey Epstein, carries the version in the other house, so we're working on that I also carry a bill that was highlighted in the New York Times. They had an op, an opinion piece this weekend on saving small business and it would institute a vacancy tax if a landlord pushes out a tenant and the space remains vacant over a certain period of time. We see that again and again stories of small businesses being forced out and then the space is shuttered for months or years drives me crazy. I know it does you too, so we need to create a disincentive and that's why I'm sponsoring that legislation as well. Thank you, though, it's a great question right. Thank you senator appreciate it. Thank you. Next up is assembly, member Harvey, Epstein and just again, I encourage everyone to be short and sweet. We do have a robust public comments. Section thanks. Kyle I can be really short because Brad talked a lot about my build already. So I don't need to talk about some of those I'll talk about two things: one is our youth councils opened up applications for membership? So, if you know people between the ages of 12 and 22 who live or go to school in district 74, we're excited to have additional application. Applications for members you can reach out to my office or their applications are available online we'd love to have more young people really do really interesting. Things have been leaders in our city on really issues around student metro cards, getting rid of the half price Metro cards, environmental justice issues, we'd love to have more I'm having my Youth Council town, Hall, January, 12th, I, hope some folks can join us and hear about the issues going on for the 2021 legislative session. The last thing is I know: Brad talked about upcoming session, maybe next week and the things that we really need to talk about is revenue. People know we have a 14 billion dollar deficit, even if we do get federal relief as we're hearing Congress may or may not provide that it won't cover the debt that we have. We really need to raise revenue or we're going to see cuts across the board. 20 cuts in education cuts to CUNY cuts to non-profits. The governor's already held four billion dollars back, so the goal is really to get back and to add revenue. My mezzanine debt bill, Brad's Pieter, Terre Tax high income earner tax. We need to do that now. If we don't do that, New York is in serious fiscal trouble, New, York, City and New York state, so I hope you'll all be out there supporting the raising the revenue, the eviction moratorium, the helping the small businesses, because we need it now more than ever. Thank you all right. Thank you. Assemblymember! Are there any questions for the assembly member from the board or from the public? All right, I'm not seeing any. Thank you all have a good holiday you as well. Next up we have assembly member court thanks Kyle good evening to all I know. It's been a long agenda, it's just the start, so I'll be brief, especially because Brad and Harvey both covered so much of the area that I wanted to on revenue. The assembly, member, Epstein and I were in the same conference and working on the same issues. The one issue that I wanted to talk about. That's of great significance and peril at this point is the MTA and our train and subway system. Historically, if you look at the quarter century of disinvestment by the legislature in the MTA capital program, which is the vehicle for the funding of the buses of subways, our problems with funding predate the pandemic, but the pandemic has exacerbated structural deficits within the MTA, its capital plan, its long-term borrowing and its inability to meet needs. Three weeks ago, I wrote an op-ed talking about the need to raise revenue for many purposes, but the specific purpose is that the MTA finds itself essentially in a death spiral in part not of its own making because of the pandemic and the loss of 70 or thereabout of its customers and some of its best customers best buy those who buy a monthly metrocard and who are critical to the sustainability of the system. So I know it's been talked about by my other colleagues in state government and the multitude of reasons why we need new revenue, irrespective of what happens at the federal level but of acute problem is the bus and subways with potential layoffs of the MTA service, cuts, delays potentially in track and signal work on the Lexington line, which I and my other state colleagues fought for to ensure in the most recent capital plan. This could have devastating effects on both the system itself, the track work and the ability to have any recovery, because I assure you the recovery when it comes will be stunted if people can't get to and from work in a timely fashion. As we rethink what it is to go to work in the Midtown business district and elsewhere, so to keep in mind all of the reasons why we need new revenue both from the federal government but also in and of itself at the state government, the funding of our buses in subways is really on the line and in as perilous a condition as I've seen in my 10 years of office. So that's not really a happy note to end on, but it is the truth and with that I wish everyone for those who celebrating happy Hanukkah and Happy holidays to all of you. Thank you very much assemblymember. Are there any questions for the assembly member from the board or from the public all right? Seeing none. Thank you. So much next stop. Do we have Katie from Council member Rivera's office, all right, I don't see Katie from Council member Rivera's office. Let's move on to Madeleine from Senator Kruger's office, hi, everyone, it's Madeline from Senator Kruger's office Kyle. Thank you. Senator Krueger, thanks Community Board, six for their leadership with homelessness, while representing the community regarding the Renwick hotel, like Senator Kruger's. Colleagues have mentioned, the members are spending much of their time preparing for the upcoming legislative session, which could be at the end of this year or the beginning of the new year and, as a month has passed since the big election Senator Kruger is hosting a Senate roundtable on elections, this Friday to discuss legislation to improve the design and operation of the New York City Board of elections. So the roundtable is Friday at 10 a.m. The public can tune in through our Senate website. We have a lineup of testimony from board of elections, folks poll workers and many other involved in the city election process. Our office is still troubleshooting with many constituents about unemployment, so if you or someone you know is facing problems with the state, Department of Labor feel free to reach out to our office, otherwise happy holidays and let our office know if we can help you with anything. Thank you very much Madeline. Are there any questions from the board or from the public for Madeline from Senator Kruger's office? All right, I'm not seeing any. Thank you very much thanks. Let's go is Katie from Councilmember Rivera's office here or is the council? Are we waiting on the council? Member, hey, Kyle, I, think we're waiting on the council member I know she had another meeting, but you know where's the board, so we'll wait for her. Okay, no problem. Thanks. Let's move on to Taylor from Congresswoman Maloney's office hi, my name is Taylor. I'm from Congresswoman Carolyn Maloney's office. This week the congresswoman released a statement on why she will be voting against the Ndaa her bill. The corporate transparency Act is likely to be passed in an upcoming vote before this congress is over her legislation for a Smithsonian women's museum was passed unanimously in Senate Committee, which is uncommon right now, and she voted alongside colleagues to pass the marijuana opportunity, reinvestment and expungement act along with colleagues in the New York delegation, Congresswoman Maloney pushed for an emergency MTA funding. She joined Manhattan small business owners and demanding crucial Covid-19 relief, including her Pandemic risk Insurance Act. On the oversight committee, the congresswoman called the heads of Purdue and Sackler pharmas to a hearing on their role in fueling the opioid epidemic. She is seeking accounting of political appointees and career positions. She issued a subpoena regarding mistreatment at the Irwin County Immigration Detention Center, and held a hearing to examine the risk to an accurate and complete census. Count, that's just some of the stuff going on. As we finish up the 116th Congress, our office is still working on a bunch of constituent casework issues. Tomorrow is the last day for us to be allowed to submit an inquiry to the IRS for anyone who hasn't received a stimulus payment, so you're still waiting on that and want an inquiry. Send me an email and I'll, get it to the right caseworker. After that it can be claimed on your next year's taxes. We're also still working on folks. Sba loan requests. So if you know of any small businesses, who've applied and not gotten their funds yet again reach out. As always, you can get more information on our website or social media subscribing to our newsletter or sending me an email and that's all I have for you tonight. Thank you, Taylor! Are there any questions or comments from the board or from the public for Congresswoman? Maloney's office there seems to be a question from a member of the public. Oh hello, let's see there, it is Mr Philip Chenko. Would you state your question Mr Philip Chenko? Would you unmute yourself and state your question? Yes, okay, can you hear me now? Yes, yeah I got a question the one bringing up to privatize MTA to for New Yorkers, who can buy the bond or some kind like shareholders, it's probably more financial and more making sense. The university can be on MTA, not asking every time funding or like stand in government funding because will be more common sense if all New York city can be on the MTA and not just wasting money. It's like money hole. It's a huge budget, get wasted for MTA. Okay, thank you for that comment. Our electeds are on they'll, take that back to their offices and to their representatives. So thank you very much for that. Moving on I'd like to welcome Patrick from Council member power's office, hello, thank you for the introduction. So I don't have many updates, but this will just serve as a introduction. My name is Patrick Hill, I'm the new community liaison for Community Board, six in council member Powers Office. I've met a few of you so far, but I'm very much looking forward to working with the rest of you together in the future. Just an FYI it Sarah Newman, who previously was the liaison for CB6, is still in our office. She's just been promoted to our legislative director, so she's still working for team powers. Fortunately, it's a pleasure to meet you all. Virtually I do have a few general updates, I'll move through quickly, just in regard to Covid-19. You know our office is still monitoring the state of the coronavirus and keeping track of the infection rates as we deal with the second wave of sorts first wave second wave, and we continue to ask that all fellow New Yorkers continue to follow. Cdc and Department of Health guidelines to stay safe, continue to wash your hands regularly, wear, masks and practice social distancing by staying six feet apart. Our office continues to partner with the wonderful organization ace, which has proven to be an invaluable resource for our community. Ace is a supplementary cleaning service that performs spot cleaning locations that have not been attended to by DSNY or other agencies. You can submit requests for spot cleanings to our office, should the needs need arise, we'll submit. The request to ace should be noted, though, that this is not a replacement for the wonderful work that our colleagues at DSNY and other the other responding agencies do on a daily basis. This is generally meant to help deal with some of the areas that DSNY is unable to deal with, due to the large amount of work that they have on their plate. In regards to a quick legislative update, we are working with the mayor's office, other council members and state representatives to address solitary confinement as Friday Councilmember powers in his role as chairperson of the Criminal Justice Committee will be chairing a hearing specifically dealing with how to address and solve solitary confinement. It's a long-standing issue well documented that solitary is harmful. This will be an opportunity to hear from all stakeholders to help figure out a path forward for ending solitary confinement. Lastly, our office is organizing a virtual fundraiser in conjunction with New York cares and room to grow for this year's toy and coat drives. I will post links for both of those drives in the chat and I'll make sure to send over? You know relevant information, including the flyer to the staff at the community board, so that can be properly disseminated if people do reach out. Looking for the information, if you're able to please consider making a donation to those in need and, as I said, I'll post those links to the chat, if there's any issues or concerns that anyone would like to follow up with our office on, please feel free to reach out. I'm still gaining my bearing so hearing more about some of the issues that you guys have been working on with Sarah. That I may not know about yet will be very helpful. I'll post my contact information in chat as well, but thank you for the opportunity to speak and I just want to wish everyone. A happy holidays, thank you very much Patrick and welcome to CB6 we're glad to have you. Thank you. So much are there any questions from the board or from the public for Patrick, since he is new, we should ask him all the questions drive by fire. Yeah sing, none man, you're good Katie- is the councilmember joining us. Yet, if not, we can start the public comment connection and the council member can speak when I give my report I can't see who's on here. I, don't know if you can see. If here doesn't look like she's joined yet but Kyle you do still have brace from Assemblymember Gottfried's office and I believe Michael Stinson's on the line as well from the comptroller's office. So let's move on to Brees from Assemblymember Gottfried's office. Hi. Thank you. Can you hear me good evening? Everyone can you hear me? Yes, great happy holidays from Assemblymember Gottfried I'll be very brief. His he introduced legislation that would require Medicaid recipients or applicants when receiving an adverse determination to be notified of their consumer health information. Their consumer health advocates contact information, which is already the case for people with private or non-profit insurance, and that was signed into law on December 2nd. He was very pleased it's another piece of legislation relating to health care that he sponsored in the Assembly Senator Hoyleman sponsored it in the Senate. It would require increased consumer advocate representation on the health and health policy, Planning Council, which is a very important state body. Most states have them. It is the body that, for instance, ruled to allow Beth Israel to consolidate its facilities and move relocate, and previously it had only very limited representation for consumers less than all the surrounding states of New York. That bill passed both houses where governor he's required to make an up or down determination on signing or not signing it by December 15th. We hope to report back to you then and I think that is where I'm going to obviously shares the previously mentioned concerns on budget raising additional revenues, protecting the MTA from these doomsday budget cuts and a lot of other issues, but I won't go into those at length, happy holidays, everyone and Congratulations Kyle. On your elections, chair, I, have to admit I thought your voice was Jesus Perez last month and so I failed to congratulate you, and let me do that belatedly. Now happy holidays, everyone. Thank you so much. It is an honor to be compared to Jesus's voice. So I think that is a compliment. Are there questions or comments for Assemblymember Gottfried's office from the board or from the public? All right, I'm seeing none. Thank you. Do we have Michael Stinson from the comptroller's office here Michael? Are you on okay I, do not see him and I do not see Council member Rivera as well. So just let us know when the council member joins and we'll let her speak at that time. But now we'll move on to the public members of the public section who want to speak. We've had some people confirm in advance, so I will go through those individuals first and then Jesus. If you can confirm with me who has signed up through the Q&A feature, I'd greatly appreciate that before we begin just to set the ground rules, each member of the public will have three minutes to speak. This is not a public hearing section or a Q&A section or committee business section. This is an opportunity for members of the public to speak on an issue that is important to them, so we'll begin with Deborah Ferron from Murray Hall, as we give you the floor to speak. Please of course introduce yourself your connection to the district and the topic that you would like to speak on. So first up, Debra, okay, I think am I unmuted. Yes, I can hear you wonderful, I, first of all want to thank the community board for their time and their dedication. All of us are very appreciative of all the work that you do. We understand it's a challenge to make judgments on so many issues from traffic patterns to homeless, particularly when you have day jobs. The homeless issue is one of the most serious ones we face right now. It's fraught with heartbreak detail implications too difficult for any one committee, member of CB6 to be able to grasp on their own and therefore it's an issue, that's too complicated for anyone to give a nod of approval or condone. So if we don't speak out and ask the right questions, we're condoning that this is the right thing and that we should have the Renwick turned into a shelter for Murray Hill. While you may not yay or nay. What you can do is say something when you suspect something is wrong. The decision made earlier by CB6 before today's letter was sent to accept without question that the Renwick should be turned into a shelter was based on no facts. Andrew Gordon admitted at the last DHS meeting that they were working on the fair share information, but according to law, that should have been done way in advance of the site. Selection. No one questioned this, and if you had an idea of the number of shelters in the area, maybe you would have. We know that our politicians had no idea and no one had looked at the infrastructure issues to see if we could even support the homeless. In this way, we all know about the disturbances at the Lucerne citizens were allowed to be brought in, and now after the back and forth of legal decisions, they will likely be pushed out. These are human lives for whom we need to have compassion. These are not chess pieces, not decisions. You should feel comfortable, condoning imagine if you lost your job and became homeless. You're told you'll be put in the shelter, but it's a shelter, that's an old hotel. It wasn't built to be a permanent living space for 350 people to stay on a consistent basis and you're placed into a neighborhood with several shelters already, including one down the block. What do you think your access would be to the fire department, the police, Department and New York City infrastructure? Absolutely none of this has been considered. We welcome shelters in Murray Hill. We welcome them so much that we are overrun with shelters, including the 850 bed Bellevue men's shelter. The Renwick would be one of nine shelters in Murray Hill. Some of those are permanent. Others we've been told, are temporary. We have replaced our small businesses due to Covid-19 with haphazardly placed shelters. Why are our neighbors upset? We were given little to no notice that this was happening. It was poorly communicated and we were given inaccurate, fair share information that has now been updated and will be updated again because the city has said that they didn't have the right figures and at a November 16th meeting we were told that it was a done deal and in fact we were told that quote sometimes when you give people enough warning and they have enough money and time they fight it. Well, I'm not certain yet that that's what the city did was illegal. We are in the midst of figuring that out, but not opening the process for public comment. How do you mean this? Is that the time that is the timing, all right, two more sentences, yeah Deborah, the three minutes are up and wherever that beeping has come. Please I'd like to finish one sentence: I'll, let you finish one sentence, but we can't go on any further than that. We've heard the expression that the only thing necessary for the triumph of evil is that good men and women do nothing and I know a few of you personally and I won't believe that this is the case with you all right. Thank you. Debra appreciate that I do want to make a point of clarification before we move on to other speakers just so that we have the proper context for all of the public comments. Cb6 first of all does not have any say in the sighting of shelters at all, and as a result of that, we have not taken a vote on the shelters as all at all, so there has been no decision by CB6 to place or not to place shelters, because that is not within our jurisdiction. So I don't want it on the record that point of clarification and for future public comments that we have for today, Jesus who do we have next. The next person on the list to speak is Kristen Kliegerman, who is representing the group Save Murray Hill, and she is speaking on the opening of a new apartment, homeless, shelter in our district Mississippi. But Councilmember Rivera is here: I was wondering if she could speak does she have to go anywhere? Because can we save this for the section where I'll give reports and we can have her lead off just because we started the public section already and I just want to get through this yeah? Unfortunately, I have to get her to another meeting. After this it's been a busy night, but I know she wants to talk to the board and make sure that she talks public session. We don't want to interrupt it any further, because I know the speakers have started right. I can come back next month. No, we need to see you before the holidays, so go ahead. You have the floor, I'm so sorry that I'm late, it's just been. It's been a really busy weekend and I just want to congratulate you Kyle. This is pretty cool. Congratulations. Thank you met a few years ago. I knew that you would be very involved in the community and I have to thank Molly Hollister who's, the best okay, so I'll just be very brief. You know why I'm very late today is because I mean we've had non-stop hearings in my role as the chair of the committee on hospitals. I've had quite a few hearings throughout the pandemic, but most recently we just had one on vaccines. We had Pfizer testify. We had the city testify all the agencies involved and so by December 15th. If you haven't heard we'll start to roll those out and of course there are tiers for certain people as to who is going to get the vaccine and it should be readily available and we're going to try to do that operating with you know, with equity in mind every time I guess I just wanted to also just thank you all I know you were talking about Copa the community opportunity to purchase act, which I think is going to be really important, coupled with community land trusts and, of course, trying to figure out how we can support people experiencing homelessness. I think this is one of the many kind of multi-pronged ways that we have to address this kind of the roots of this crisis. So you know that's just some of the things that I'm working on I don't want to take any more time. I already feel pretty good. So I'm willing to do that. Brad's here too, and so I wanted to thank CB6 for all of your work, because you have had really honest conversations and you're always having those conversations, understanding that the systemic injustices are really rooted in racism and classism. And unfortunately, sometimes you see those responses from people who don't want to face those conversations. So I want to just thank you for your courage and your honesty and everything that you have done, and especially for particular community board members who have taken leadership on that I I've. There are many of you I don't want to single anyone out, because then you might know who my favorites are, but this board has been really instrumental in pushing some issues forward and again, really looking at it through equity, so whether that's transportation or housing or small business support. That enables me to be a better council member to be able to use the work that you're doing all of the recommendations that you put forward the resolutions, your ideas, even on the sidewalk extension thing on third Avenue, which I'm totally down with this, is why I look forward to coming to CB6. So with that I'll just leave it there I hope everyone has a happy and healthy and safe holiday. I know it's gonna, look and feel very different, but just know that you know we'll get through this and we've done all right so far, I know there have been some losses and I think we're on our way to being in a much better place. So I'm just thankful that we could do it united. Thank you. So much council member, we extend the same best wishes to you and your family and your staff. So thank you so much are there any questions for the council, member from the board members or the public all right sing? None! Thank you! So much Jesus. Can you hear me? Oh sorry, there's a question from a Felix Guzman asking. Can Copa and Land trust initiatives be spoken about by Ms Rivera a bit further, so asking about Coppa, okay, I could I'll give you I can't take too much time, Mr Guzman. So I'm going to be really brief, so the community opportunity to purchase act, I think you'll might be speaking about it tonight. If you haven't already- and forgive me, I, don't know the agenda, but it's given the ability for some of our non-profit entities to be able to purchase land and develop truly affordable housing. That's the end goal of the bill. You know. Typically, when you have a vacant land or land for sale, larger corporations are able to buy it because they just have a more sophisticated operation and though we find that when you have a non-profit entity like Cooper Square, Mutual Housing Association, once they have that land they're managing, it has been proven to stay affordable with both residential and commercial spaces, and so they also have a community land trust. It is the model that we're using across the city and what I've been able to do in the council was secure, unprecedented funding for organizing for community land trusts and so they're. Using the Cooper Square model. There are community land trusts across the country. There is a very large successful model in Vermont I think when probably Bernie Sanders was mayor of Burlington, but the point being that we have our very own in our backyard in district two, and so there are other ones being developed in East, New, York, the Brownsville bedside area, Chinatown, east Harlem, albario just closed on actually purchasing land and, of course, in the south Bronx. So we have a few groups that are working towards that under the leadership of the new economy project, and so what we've seen is that with clt with the clt model, having the Copa legislation accompany. That would I think be a really a great successful way of making sure that we have affordable commercial and residential space. So that's kind of the point of the bill and the organizing I hope that gave you some more information. You could always contact my office and we could break it down for you a little bit further. We have not gotten a hearing on Coppa, yet I am kind of you know, demanding that we get that in housing and buildings as soon as possible. So I'm hoping to have some good news for you, maybe in the new year all right. Thank you, council, member. All right, let's see one more hands or Q a's, so Jesus can we return to the public comment section. The next speaker is Kristen Kliegerman, who represents the organization, save Murray Hill, and she is speaking on the opening of a new permanent homeless shelter in our district Ms Kleegerman. You may state your question and thank you for your patience. Yes good evening. Can you hear me yeah? Thank you Kyle. Thank you board for letting me have some time to speak tonight. My name's Kristen I am one of the founding members of Save Murray Hill. We were founded in 2017 when the MTA proposed a ventilation plant to be built under Park Avenue. We were curious about the project and did some research on it and found out that the entire project was based on old 30 year old data actually, and due to some of our challenges of that large government agency, the project was cancelled and we were very pleased with the results in that the unnecessary project was not built fast forward. Three years in middle of last month. Middle of November is when we learned about the shelter to be built at the Renmick hotel when we listened to the CB6 meeting that discussed that the committee meeting that discussed it and we listened to Matt Borden- be unable to explain how the shelter location was chosen. We became concerned. You know you lose your trust in an agency like DHS, when they can't explain how that location was chosen. Since that time, we've spent our time hours. Looking for facts, submitting a FOIL request meeting with politicians and have come up with a lot of interesting things, I'm going to share two discoveries and then one observation and that'll be all the RFP process that is used by the department of Homeless services allows that department to negotiate with distressed property owners, most often hotel owners. This process has no transparency. We, the citizens of New, York City, don't have any idea who's offering their buildings to the department of Homeless services and what kind of deals they are striking. As a result, the locations of shelters in New, York cities are based on real estate deals, not necessarily on need, it's kind of stunning, if you think about it, and to that point my second fact that we discovered was that it was perfectly illustrated when we said show us the data, how the Renwick hotel is the perfect location for the department of Homeless services. We were told again by Matt Borden that they were going to work on the paperwork. They were going to work on the fair share document and they will be showing it to us soon when it was completed. You know three weeks later: it was full of errors and omissions, and the data that this document was based on is five years old. It is nothing to do with the world today in Murray Hill the counts were off, the data was leaving things out. Oh sorry, Covid-19 is a reality and we're weary of change and we're looking for facts. Thank you very much all right. Thank you, Kristen Jesus, who do we have next up? We have Melissa Cohen, who is a resident of Murray Hill and speaking on the opening of a new permanent homeless shelter in our district. Thank you, I'll. Keep it a consistent theme. You guys can hear me. Yes, we can great okay. So I'd really like to thank the community board for allowing me to speak on this issue. It's my first time ever speaking on one of these calls, because it is an issue that I feel really strongly about. I'm a long term Murray Hill resident I've lived here for over 20 years. My husband for over 25. we've raised our teenage daughter here, and the change in our neighborhood in recent years is really palpable and it's due in no small part truthfully to the number of homeless, shelters and homeless population in Murray Hill and the surrounding neighborhoods of Kipp's bay and Midtown. South and I really want to start off by saying that my objection to the addition of a permanent homeless shelter at the Renwick in no way stems from a lack of compassion for the homeless population or from a feeling of NIMBY-ism. It's actually quite the contrary. My concerns around the shelter are twofold one. Our neighborhood already bears a disproportionate burden in housing, the homeless and, secondly, I truly, don't believe that home hotel rooms are a good permanent solution to homelessness. I believe that the first public speaker really I mean she couldn't have said it any better. She really gave fantastic facts to demonstrate that if I may, I just want to give a couple of anecdotes to explain what some of the residents of Murray Hill are facing. I no longer feel safe, walking in my own neighborhood after dark, and no one should feel that way about where they live. I've had multiple encounters with homeless people in the neighborhood when they are aggressively panhandling, with everything being contactless nowadays. I often am not carrying cash, but a polite apology and a smile often does not work. I've been followed. I've been yelled at I've been made to feel very unsafe if I don't give people money. I recently had a man facing me walking backwards to make sure that he stayed in front of me blocking my path. Continuing to ask me for money and berating me with language that I'm certainly not going to repeat here, but it actually took another passer by intervening on my behalf, to get him to leave me alone and the second anecdote would be about a month and a half ago my daughter needed to drop something off at night at a friend's building. We stopped about halfway there just to text a friend to clarify where we were leaving the package and as we were, waiting a homeless man with his mask hanging completely uselessly around his neck approached us before I could even register what he was doing. He was leaning into my face tried to put his head on my shoulder and, of course, I moved away, and he began to spew extremely explicit sexual instructions. To me, this again was with my teenage daughter standing next to me, grabbed her arm walked away as fast as I could, as he cackled at us, and continued to scream things at me. Luckily, he didn't follow us, but obviously we were both left quite shaken. The area surrounding I know I'm out of time. I just want to say that the area surrounding grand central is already a magnet for the homeless and adding another permanent shelter. A block away is only going to exacerbate that situation, so thank you. Jesus who's next up is Maggie Darcy. She is a resident of Murray Hill and she is speaking on the opening of a new permanent homeless shelter in our district hi. This is Maggie yes, I I've been living in this neighborhood of Murray Hill for 20 years, I've been living in the city for 40. I lived through the de-institutionalization of people here in the 80s and what that did to the homeless population. My two concerns are these: compliance and safety who, from the city, is legally responsible for oversight of this shelter who, from the city, will be making sure residents core and security guards comply with safety regulations and treatment regimens for the residents on an ongoing basis, not just this December and January, but for the next year, two years, five years in my experience, living in a HUD building at one point, I discovered that over time the regulations were no longer being enforced by the people who were supposed to be enforcing them. The security guards in the building and the people managing them. I am very concerned about the safety in this neighborhood I also have a business in this neighborhood people come to see me and I am concerned for their safety. Also, we are in a pandemic. How is the city and core going to enforce protocols to protect the residents workers and our community from Covid-19? How are they going to handle testing exposures and illness in that facility and what happens if there's an outbreak at the shelter and will the community be informed and how will they handle it? That's it! Thank you all right. Thank you, miss Darcy, all right, it does look like there's a question from board member Jim Collins all right Jim. Are you there all right, yeah, I'm here, I just need to unclick I wanted to suggest that these folks, who are time limited because of our time, limits that they compile whatever they've they have in mind. Some of them appear to be reading their statements. I would ask that they submit those written comments to the board office. If there's no objection all right. Thank you Jim. Yes, we will oh yep now. Anyone who submitted who spoke publicly today, if you can send in your written work as well that'd, be greatly appreciated. Next, up on the list is William Leeds, a resident of Murray Hill speaking on the opening of a new permanent homeless shelter in our district, hello, Community Board. Can you hear me yes, okay, great well, thank you for your work and for the support in the neighborhood I. I've lived and worked in the neighborhood in Murray Hill for over 30 years, I have a an office on 40th street and very close to the shelter about a half a block away, and this is in no means NIMBY-ism I actually lost my brother to homelessness and not having a proper place where he could live and thrive, and so I'm acutely aware of what goes on in these shelters and clearly from the previous like I, would say. Melissa Cohn made it very clear. Our neighborhood and I've seen this I've been here over 30 years. In the last couple of years, it's just been increasingly dangerous with people panhandling urinating in doorways I mean everything that is so undesirable and a solution has to be found. So it's quite obvious that when a neighborhood can't handle the homeless that we already have, how can we accept more homeless? It just doesn't make sense, and on top of it, that location is on the border between residential the zoning. There is both residential and commercial. So across the street, you have large office buildings, therefore giving the homeless a large degree of autonomy that they don't really need. The homeless needs support. These people are going to drift around the neighborhood into the little parks that we have in the little areas and the big areas which are these large buildings, such as 101 and many other places that don't really have support I, mean homeless, need a neighborhood that starts to recognize them, know them and treat them as human beings. These people are not going to thrive here, they're not going to do well and a better place has to be found, and this is not in any way that I don't want in my backyard I want in my backyard when I can help them, but when I already can't help the people that are there and they're not complying with masks, etc. These good meaning homeless, people who are going to be at the Renwick are going to be mixed in with the people who are already here and are somewhat fairly aggressive. So it really doesn't make sense- and you know I just want to make that statement. I'm an architect I deal with people all the time. I want to help people I want to create the right environment for people to thrive, and this is not the situation that's going to occur at the Renwick, and it's not going to be a positive thing for the neighborhood or for the city and I just want to make that statement and I appreciate what every the community board can do to help out the neighborhood and help out, particularly people like Melissa Cohn, who spoke of the dangers of the neighborhood I mean these people. You know I can tolerate them. I lived with somebody who had those issues, but my wife feels threatened. It's just not the right situation. Thank you very much and appreciate it. Thank you bill all right. Next person on the list is Peter Harrison, who is a resident of this district and is speaking on the opening of a new permanent homeless shelter in our district hi good evening, everybody Happy Holidays Kyle. Congratulations on the collection. Thank you. I just want to say thank you to everyone on CB6 who has come out vocally and supported homeless, New Yorkers and the need to be housed safely during a pandemic. I particularly want to apologize for the members and staff members in Cv6 who've been attacked personally for their support. I. Think that's a disgrace and I appreciate the comments from CB6 and electeds condemning that action. I just want to say that you know I've heard certainly from folks tonight in good faith and elsewhere about this issue across the city. Getting tied up about process I think we can all clutch our pearls about process for any agency with the city and scratch and see that there's problems with transparency and communication, but the reality is even if there was a great process and great communication chances. Are you still wouldn't want a additional shelter in your neighborhood and I? Think that what we have to remind ourselves about here is two things one is we are in the state of the pandemic at the moment, and we need folks to be housed safely, even if, just temporarily, we had a terrible fire at middle church downtown where a homeless shelter for women was destroyed, that's a very acute crisis, but these men and women are under this kind of pressure already and second of all, I understand the concerns about. This is not a permanent solution. I've someone that's worked with the homeless for many years and advocated for housing policies that would solve this for many years. So what I would say to everyone here in good faith, who is opposed on whatever grounds good or not against a shelter, is to think about being proactive about permanent solutions, support politicians and policies that actually solve this problem by creating enough supportive housing and permanent, affordable housing. Carlin Rivera was just talking about community land trusts and Bernie. Sanders I was a part of that research project for the New York City, Community, Land trust. There are solutions on the table right now in the city, live on the state level, the federal level. So please I encourage all of you to come to those meetings to support those policies where the folks that do need the services for mental health for addiction for job training can get them. That's going to take more sacrifices from all of us. So if all of us can agree that a shelter in a hotel during a pandemic is not a permanent solution, let's work together on making sure that permanent solutions are enacted and passed and I encourage everyone very specifically to participate in the tax, the rich campaign in Albany right now to get funding from the wealthiest members of our community to pay for permanent housing and other types of supportive services that is on the table literally right now and I encourage everyone that has objections to the shelter to take part in that action. Thank you all right. Thank you. Pete am I supposed to speak already. Kyle you're, muted I just got unmuted, but I wasn't introduced, yeah Jesus. So can we introduce the next speaker? Okay, so I just introduced myself, then I guess I just hold up Mr Guzman, you are after Mr, Philip Chenko, we're gonna go to okay yeah. So let's go to Mr Philip Chenko first and then Mr Guzman will speak right after okay hi. My name is Vitali Phillipchenko. Can you hear me? Yes, I'm a business owner like I understand like people doesn't like it homeless or whatever, but it's never be same because people, nobody live on the street. They don't understand, what's happened, one solution to creating a job like I'm business, owner, small business owner. I'm talk to each one company who delivered stuff for restaurants for Badaga stores. Problem is now with spark conservation, and all this rest and occupied is parking spot for commercial vehicles. I understand they have to survive, but we like a moving company owner delivery. Companies still get a tickets parking violation. I would like to get less parking tickets and I create more jobs, because every time I spoke in homeless person, I said like hey. If you want to get extra money, please come by, you can work for me, but I can not get more employees because problem with the park consideration every time, I'm working any kind delivery, any kind, moving customers, residential commercial move. We got a parking ticket because no way to find the legal parking spot. How are we going to create the parking jobs if I got every time the tickets I have compensated so one of them solutions homeless to create a job? That's what I'm offering like essential business. We have to find out what we have to do with parking violations. People have to move, people have to eat, they people have to deliver it. That's what my main concern to get the big solutions solve the small solution. That's it all right! Thank you! Mr Philip, Chenko! All right next speaker is Mr Felix Guzman, who is a community organizer with vocal New York speaking on the opening of a new permanent homeless shelter in our district, hello, everybody. So my name is Felix Guzman I am formerly homeless, formerly incarcerated, I, say that, because I understand the stereotypes of what a homeless person looks like or might be, I'm actually I was actually homeless as a result of my building being turned into a shelter as a the cluster site, fiasco that De Blasio created and I'm also a former resident of a single adult men's shelter that was housed in a hotel, the red line Inn. That was that the shelter provided for that was pro core services, which is the current provider. That is to be looking to offer services at the Renwick. Now this hotel is being proposed as a shelter for families which I'm, which I was just told, would include possibly the elderly and adult sons or parents with adult child with disabilities. Now, as a formerly homeless, individual I understand that the shelter system is a failure. However, from personal experience, core pro services actually provides resources. They provide referrals to employment. They provide referrals to training, to recap, recovery, oriented services to mental health. They actually are an agency that is proactive. In fact, if you were to look up any of the score cards for repairs and or talk to any of to members of the homeless, organizing community, you would actually hear that pro core services is actually one of the better providers, as is project renewal which is taking the city by storm. With the what's happening over the Lucerne hotel. We have seen the moral failures of shelters being placed in areas where the resources aren't in house and within walking distance, with the amount of money being handed over to shelter providers and the lack of accountability attached to taxpayer monies, which are subsidizing, said, shelters. We are failing the homeless and the city of New York's residents. All shelters should have resources available within walking distance, a phone call away a stone's throw away every person in a home, every homeless person in shelter could be placed into an apartment if we were to actually allocate the funds away from just throwing them at shelter providers and looking to provide affordable, safe housing. We're talking thousands upon thousands city government should be creating shelters with exit points, meaning that safe and affordable housing should be the entry points into society. Instead, what is happening is that home the homeless are being treated like throwaways and made to feel like they should be grateful for just having a roof over their head. Now we have seen how shelter provider project renewal has taken it upon itself to retrofit the Lucerne hotel with recovery oriented services on site. This was all possible because of the coming together of the concerning compassionate residents of the Upper West side, including, but not limited to the Upper West Side, open hearts initiative. I can tell you that what is happening on the upper West side is not just for show. We have folks who are holding spiritual workshops, providing meals, clothing, work opportunities and more. The Renwick hotel is located in the grand central area and not too far from times Square, which makes this accessible for all families involved. As a former resident of core pro services, redline and I can tell you that this agency, this organization, is not just about the money, their staff members treated me with respect, honor and dignity. Recovery, provide referrals and I believe that or pro services is the right agency for this, and we should also touching on what someone else said about taxing the rich I do believe in that as well. So, if we're gonna look at shelters as an option, let's look at having providers that actually are about to work and actually care. Thank you and this concludes our public session speakers list all right. So thank you to all of our public speakers tonight. We hope you continue the conversation working with our board in partnership and at our committee meetings. So thank you very much so we'll now move on to the adoption of the previous meetings for board minutes. The minutes from the November 12th board meeting were distributed to board members ahead of time by the board office. If there is no objection, we will adopt the minutes from that meeting board members. If you object to adopting the minutes, please raise your hand through zoom right now, all right, seeing no objections. The minutes from November 12th for a board meeting are adopted. They will soon be available on the CB6 website. So now I'm going to give a brief report, as I mentioned at our November full board meeting. One of my first priorities is to reorganize the board to make sure it's more efficient and also to make sure that we interact better in the public sphere and with the community as a whole. So at our executive committee meeting last month, I discussed with the chairs of our board some ideas. I had to reorganize some of the committees that we had, so I'm just going to run through some of that housekeeping. So the first thing is the 197A Standing committee or the working group is no longer a working group. It is now a standing committee, we've renamed it to the strategic, Community Planning Committee and have appointed Wales Magali as the vice chair. Building on that Basa, we have reformed that name to business affairs and licensing to better reflect the work that it does. Health and education has been renamed to youth and education. The Parks Committee is now environment in parks. It will still be overseeing cultural affairs and landmarks, but the rename is to better encapsulate the work that they're doing and I've pulled out and created a new committee called Health and human services, which will be chaired by Elvi Rosso. I've tasked her with leading a lot of the outreach and partnership on the work on the vaccine and Covid-19 and working with our hospitals and other organizations within the community. So I want to congratulate all of the new leaders on our board and look forward to the work that we're going to do together next up, I'd like to discuss something that I hope to never discuss again, which is the letters that were received by members of this board last week, as many of you saw, I immediately put out a statement that first of all backed the work of our community board members but, more importantly, condemning actions like this is something that was not only cowardly, it's despicable and when you send anonymous letters that target people and not an issue. It's absolutely disgusting and there's no tolerance for that whatsoever. So I was very happy to see that immediately our local elected officials- and just you know numerous people throughout the public stood in solidarity with our community board members at the time it was only a few it has grown since then to a couple more and so to see the solidarity that we've seen from our elected officials, particularly the borough president's office who's, been handling this in the legal work on it and elevating it appropriately. We want to, you, know, send our things to them as well, but the larger statement that I want to make is that you know behavior like this will never be tolerated. You have the backing of your chair, you have the backing of your board staff and you have the backing of the rest of the board and the community as well, and so, as you go out and discuss tough issues as you go out and create resolutions on tough issues, you should always feel comfortable to discuss those in an open, democratic process. So I want to thank the members who were unjustly targeted by this. For the work that they have been leading and the work that they will continue to lead and that they will always have the support of us behind them and I was able to connect with each of them, and I'm happy to report that everyone is doing well and are stronger than ever and more committed to the work than ever before. In my conversations with them, I told them that this is a demonstration of the good trouble that they're getting in so I appreciate. All of that and their work in the spirit of letters you might have seen that we sent out a letter to DHS about the shelter issue in our district. This letter was specific about the issues that we saw in the fair share analysis. We saw discrepancies, we saw inconsistencies and, as a big part of their own decision making process. We wanted to ensure that, if we're following proper protocol, if we're following proper process, that the information and data must be up to date and accurate and reliable, and so we had a call earlier today, that was spearheaded by council member Powers office, where we brought together. Members of the community, we brought the relevant stakeholders, DHS elected officials, and were able to discuss the issues that we saw in this, and the public had their opportunity to discuss it with them as well. The big thing that I would like to highlight is that there are some inconsistencies in the way this issue is talked about again, as I mentioned at the beginning of this meeting. Community Board, 6 and no community board for that matter, or elected official, actually has a say in this process. So the inconsistencies that we've seen in the harassing letters, the false information that CB6 made some decision on this matter is absolutely false, and the proposed the proposal for the shelter is that it will be renovated to address the needs of the individuals that are being served so to think that it's remaining a hotel or in that capacity is also inaccurate, and the last thing I want to mention is that the letter also reestablishes our and reiterates our values to people who are in need who are in support and, in this particular case, the homeless. As many of you know serving on the community board, we do not just represent the house in our district. We also represent the homeless and people who pass through this district as well, and so throughout our work. We are always going to maintain our values, we're always going to maintain the representation of all people and not just a select few, and that will always be the current of the work that we're doing and so I want to make sure that is on the record and that we are vocally saying that, and that was also included in the letter as well, and that we appreciate all the work for people on the ground who are working with these populations, who are working with people in need and providing them with the services they need and that the community board is always open to people of all voices and to partnership. And one of the great things I. Think from what we heard earlier today is that everybody can agree and has offered partnership and has been on the record, offering this partnership as well. That a lot of the work that needs to be done is on long-term sustainable solutions, particularly with affordable housing in our district and with social services that address root causes, and so I was happy to see that even people who are not happy about the selection of this particular site as a shelter are willing to partner up to ensure that we can increase, affordable housing in our district and provide people with the appropriate services that they need and so building on that. Of course, we've heard about the time that we're in this season the holiday season and so building on those two issues. I'd like to encourage everyone again, some people on the board have already done this, but for everyone to continue to make donations to our local, temporary and permanent shelters, we have an email donations at Cbsix.Org, where we can coordinate donations to the appropriate shelters, and this is in our weekly emails. It's on our website about what type of items are needed and great to donate to these shelters. This is the time where we really demonstrate compassion and giving, and we want to show that that's what we care about and what CB6 has always been about. So I want to thank everyone. Who's already done that and encourage everyone in this spirit of this holiday. To continue to do so, and then last but not least, I want to remind everyone that applications for joining the community board are open. If you are up for renewal, you will receive an informative email from the board staff, letting you know that you are up for renewal and I also encourage everyone to inform people that people can join the community board as well. Of course, it is a competitive process, but I want to make sure that one of the things that I promised coming into this new leadership role was to really you know, conduct outreach on engaging with communities and people who aren't necessarily represented on community boards, particularly with young people. We have high school slots that are open for people who are 16 or older I want to make sure that we are encouraging our local youth to be engaged with this work. As well as underrepresented communities, and so this is really the time to encourage people to inform people and I hope that you do so, and that is all that I have on my end for the report. So thank you and as far as the district manager report in the interest of time since we've got a lengthy meeting, I'll wave, my report tonight all right. Thank you. Jesus! Next up we have the treasurer's report. My report's super brief. None of the numbers from last month have been changed. I'm just going to read out. Otps is 140,659. That figure contains 110 0.185 of our street fair money. We have a balance of 30,274 left of the remaining city, money that given us, we have a normal drawdown of personal services budget and we have prepaid our rent for the year. Does anybody have any questions all right? Any questions? Thank you Brian! So next up we have the borough president's report. Brian are you there Brian Lafferty Sorry about the previous Brian I? Believe Neil already gave the report yeah. Okay, so we'll move on from that. So we have now arrived at our committee reports for each committee that appears before the screen. Please deliver your report and just to reiterate the ground rules that we had before. No one may speak until granted the floor board members. If you have a question or wish to make a motion, please raise your hand through zoom I can't see everyone's screen, so I can't see if you're physically raising hands. So please do it through zoom again. The chat function should not be used for board business questions or side conversations. Any remarks should be made on the record by raising your hand through zoom, and you should only use it to alert us of any technical difficulties that you're having when a board member is given the floor to speak. I will identify you and then votes for resolutions will be conducted by roll call. And, lastly, again we are required by executive order to create a verbatim transcript of this meeting. So please keep your questions and comments, succinct and germane to the discussion. So again we are using a digital ballot. Cb6 staff is going to post a link to the ballot in the chat. Please open this ballot, select your name from the list of board members and select your vote on each resolution as it is presented, do not hit submit until later in the evening after the final resolution has been presented at the end of the meeting. Once you have indicated all of your votes on your ballot. Only then should you submit the ballot. You will not be able to submit the ballot unless you vote on every single resolution. If you plan on abstaining, please select abstain and then final votes will be announced after the second roll call. So please stick around for that and if any part of our voting procedure is unclear, please raise your hand through zoom, and we will address your question so. First up we have health and education or youth in education now from John yeah hi, thanks Kyle and first of all, I'd like to share the health and Education Committee say I'm delighted with the change I. It's something I actually lobbied for very soon after I became chair of the health and Education Committee. So I'm delighted that we can have a greater focus in the committee I'll be very brief, because there has been so much turmoil in the schools that we could go on all night, but basically the elementary schools are back now middle schools he's going to try to get back sometime in January and the chancellor last night said. High schools would come back later. The things that are interesting right now to people are: what are the plans for admissions to middle schools and high schools? Public schools and the chancellor has said that he will let us know by the end of the year what that plan will be, and then the other question on people's minds is what's going to happen with the specialized high school admissions test, whether it's even going to be held and last night at his town hall, which we announced at our committee meeting, the chancellor said that he's going to let the science be his guide as to whether there will be a specialized high school admissions test this year. I'm going to basically just stop there, because what I want to do with the new committee as constituted is define a role for a community Board Education Committee with so many different advocacy groups at work in the city right now. How can we distinguish ourselves and what unique value can we add is what I want to have on our agenda, so I'm gonna I'll stop there. Unless there are any questions all right. Thank you, John! Are there any questions from the community board for John All right, seeing none next up, we have the strategic community Planning Committee, thank you Kyle, and thanks for the new name and the committee status, we had a really good meeting last week and discussed a lot of our ongoing work, mainly around the msbi site and the Perlman Place website, which was launched or which was announced in the CB6 newsletter last week as well. We are going to be sending out some more announcements and targeted emails to elected officials, stakeholders, community organizations and such and trying to organize a set of potentially collaborative and joint meetings going into the new year, which I'm working on I'll. Be doing some outreach and hopefully working with you Kyle on that as well on some strategy around that and hoping to have issues and topics to focus on some of the things that came up today, especially with affordable housing and health needs, will be main focuses of that, but that's all I really have to state for now. There's a lot more work to be done going into the new year. All right! Thank you, Kavitha! Are there any questions for Kevitha from the community board all right? Thank you. Seeing none! Let's move on to budget and government affairs, so we didn't have a meeting and will not have a meeting in December. The next meeting will be in January it'll, be chaired by Rishma Patel, so you can be guaranteed that it'll be shorter than any meeting that I would run there. The last we talked, of course, it's up to a wrestleman. What the agenda is going to be at that meeting last we talked we were talking about the election experience and how that can be improved. Maybe we'll get some people in rely on her involvement with the league of women voters and a variety of other sources. The other things that are coming up, though, are we're expecting adjustments to the adopted budget, so that would be adjustments. The budget in the current fiscal year could come before the end of this month. I think the hints are already coming out, whether they've been official or not, and then the preliminary budget for 2022 is scheduled for January 15th, though we frequently see delays, it may not be till the end of that month, so we'll be talking again about the budget going forward. That preliminary budget is when they respond to our budget requests that we made just recently and the other topic. We want to look into whether we have time right now or in the next couple months or have to wait. A little bit is revenue sources. There was a recent independent budget office report on and I think they do it every year, but they've expanded some ideas for how we can get revenue, which I think is something we've overlooked. We've always looked at what informat? What money? We want to spend and not offer any suggestions on where we think the revenue could come from. The IBO is a particularly responsive organization, and they can they frequently will have people come to our meetings, so we hope to get to that probably February March time frame and that's pretty much it. If you want to know more about January, you can contact reshma. So that's it all right. Thank you. So much Rick appreciate that. Next up we have business affairs and licensing hi Claire. Are you unmuted? Can everyone mute their zoom? Please background noise and comments, Claire I think yeah I think you're having an audio issue because it says you're unmuted, but I can't hear you know what we'll do. Let's just move on to the next committee and then we'll come back once you've. Maybe you want to log in and log out again or log out log in we'll try. That is this. Can we move on to the next yep housing, homelessness and human rights Corrine? Thank you. Kyle I think housing and homeless has taken up plenty of time today. I'm sorry about that. I, just Jeffrey Selen, one of our public members is, and me worked on a resolution in support of the legislation that council member Rivera just mentioned. Called Coppa and I am going to give the floor to Jeffrey to talk about a little bit more and this both a and b kind of fit together and Jeffrey will explain why. Okay, thank you as thank you, Karen. As a councilwoman Rivera mentioned earlier this evening. The community opportunity to purchase act otherwise known as Coppa would provide qualified nonprofit, affordable housing developers such as community land trusts Clts, to have a right of first refusal by requiring building owners to notify HPD and a list of qualified entities when their buildings will be listed for sale, at which time these entities would have the opportunity to submit a first offer and then an opportunity to match any higher competing offer. This statutory right of first refusal would also help these non-profits and clts by providing them additional time to secure and develop the funding necessary to make these competitive bids and this resolution, which I guess is not upward. We are we putting it up or it's just the members have the resolutions before them. The resolutions are were sent ahead of time. Okay, important thanks Cody and this resolution urges the City Council to pass and the mayor to sign the community opportunity to purchase Act. Thank you Jeffrey and just to confirm it would still be a competitive bid correct. So this provides a right of first refusal and a right to match. It gives them advance notice. It gives them a right to make a first bid, but the market will still be able to proceed as it would, with the caveat that the Clts and non-profits would have a right to match the highest bid. If the market is such that that's not feasible, then the market will, you know, take its course, but it does at least allow a writer first refusal and right to match the highest competitive bidder right thanks and you want to explain b and how it ties in with a or before we go to b, because we have to vote on these singularly. Are there any questions for Jeff or Corrin on 5a Jim I, see your hand up yeah that was standing. The good intention behind this resolution, I swore an oath to support the constitution of the United States and the Constitution of New York state and both of those have an equal protection clause and that equal protection clause applies not only to individuals. It also applies to corporations because, as Mitt Romney once told, Us corporations are people as well. I, don't understand why these community land trusts or anyone else should have a right of first refusal given by legislative fiat I think it's unconstitutional on its face and I'm not an attorney. But if anyone you know were to look at the plain language of the New York State constitution, it would seem to violate the state constitution as well as the federal okay. Thank you for those comments. Jim I won't be voting for it. Okay, thank you. Are there any other questions or comments on 5a, because we do have to vote on this before moving on to 5b? So if anyone wants to call to question or make a motion 1 5a, please do so I'll call the question all right. It's called a question by gene that seconded by anyone. Can you hear me yet? Yes, I can hear you Claire yay all right, so we will now be taking a vote. So please mark your vote on your digital ballot for this resolution and please do not hit submit so those of you who are not using the digital ballot. We will ask for your vote verbally during the second roll call. So please take a couple of seconds for that and as they're doing that Corrin do you want to and Jeff do you want to talk about 5b sure five b is resolutions supporting the expiration and non-renewal of a law authorizing annual tax liens sales in 1996, the city enacted a tax lien sales law enabling the department of finance to collect tax revenue by selling liens and unpaid property, water and municipal taxes. The sales occur annually, although this year, due to Covid-19 the 2020 sale, was postponed multiple times as I understand. It has not happened in 2020. The law expires at the end of this year and the thought behind allowing it to expire is that once the current, the way it works is that the tax liens are sold to a private trust and then the private trust, which is managed by Bank of New York Mellon. Then that was part of a private investors and they, the fear, is that can charge interest of up to 18 and that it is, has a disproportionate adverse effect on smaller properties and smaller income earners. About half of the properties of several thousand properties about half of them are one to three family homes and disproportionately of those are neighborhoods of color. The caveat here, though, is that at the time, I was just as a matter of disclosure should mention that when the committee did vote on this, there was no bill that had been offered by the City Council in relation to a reauthorization of this law. That has happened actually yesterday and actually today, I think this afternoon. So there is a law that, with regard to reauthorization it's in committee, and my understanding is that, from the from what I've read so far, that there are portions of the new reauthorization law that would attempt to address some aspects of the adverse effect on lower income. It would prevent the sale of the tax liens on qualified for households with less than 150 thousand dollars in Inc, with the value of the housing of less than 250,000 would not be eligible for sale in the first year. But one of the in support of the allowing it to expire has been for an example of the clt that had been mentioned. I think earlier, Cooper Square had purchased in the early 90s before the enactment of the tax lien sales law had been able to purchase numerous buildings in the Bowery area and from foreclosures on from tax liens and this by allowing this to expire. The hope is that this would allow organizations like the clts to continue to do that, which they have not been to do significantly all right. Thank you, Jeff very thorough. Thank you. Are there any questions or comments for crane or Jeff on this and I see your hand up yeah I just have a minor technical thing which, notwithstanding whatever the city, might do I. I'm not gonna, wait and hope that comes out. Okay, I just noticed that in the where oh hi Ann you just went on mute in the where or in the resolved. There's a word missing and I still so I can look at it and you keep going in and out of mute. Just you know, I should be unmuted now right, yeah in the reso in the, whereas it is missing a phrase it's after in the it needs to echo. It should be it's missing. Instead of it just says, supports and urges the city council I think we want to say, supports the exploration and urges the city Council to not renew, which echoes the name of it and otherwise. The word supports is just kind of hanging there. Yeah and also I would, with regard to verbiage, now that there is a reauthorization bill, it and I, don't know what the proper procedure is. So forgive me yeah. You know it essentially would be to urge to not pass the reauthorization act which, at the time that we had drafted this had not existed, and the point is well taken regarding the supports of probably Nida I think we just I think somehow that language needs to match more. What we're saying, particularly in light of this new news, I, don't think it changes the sense of the rezzo so fully that it. You know we can't be voted on, but sorry, I'm an editor. Thank you. Anne I mean can I, as the chair make a motion to change the last therefore, or do I have to wait for another member to do that because I agree, we could change that. Not quite sure about the procedure here is this could give us more clarity if it's a edit rather than a change in purpose? Does that need to be re? You know emotion on that yeah we could submit if you could submit the new wording in writing, that that'll be fine, and maybe just a quick vote who hands on zoom just to cover our bases from the from our committee. No from the board on the board: okay: first can the exact language be stated for the record. Well, if I, if you can, allow me a question so Ann, what was the suggestion regarding the sports until I knew about you know what you just said: I would have said supporting the expiration and non-renewal, but since it's well, we don't know that it's not going to expire, because the reauthorization hasn't passed right. So maybe we should just leave that, but just do the edit and your edit and right because- and that also makes it echo the name of the resolution, which is I. Think always the useful thing. Yes, thank you. So the yeah, the entry of the words the expiration and urges yeah expiration of sports expert. I'm sorry, I'm no I think you're right. It probably wouldn't be supports the expiration of comma and urges the city council not to renew yeah comma. The tax lien would that be I have no problem with the split infinitive. However, so this is b it kind of just raised the point of information granted, so I would assume what Ann just said and what we just did was a friendly amendment and the committee takes it. You don't really have to vote on that addition. Okay, yeah that sounds about right. Is that right? Can you do it correct? Technically, no, once it's been presented to the board as a resolution, it no longer is the property of the committee. It's a property of the board, so only the board can make the amendment, but it's been our policy to allow such edits so I mean take your choice. Well, I mean I. I'm happy to make a motion to make a friendly amendment, and maybe it doesn't have to you know, be a whole vote. It can be a if there's any objection to this. The way we do adoption of the minutes and stuff. You read my mind right. Okay, so Ann has made a motion to a friendly amendment and seconded by Brian. If anybody objects to that, please raise your hand all right. Seeing none. So is there a call to question? Doesn't? Is it necessary? Oh, thank you, Rick. No, it's okay, I appreciate it. You may go do if there are no further questions. You may go directly to the vote without asking for the call of the question. Okay perfect. So let's just call this to oh yeah I just wanted to add that we did some research and there's about 30 properties that would fall under this tax, lien sale right now, unless there's an intervention and one of them is an empty lot on second avenue and 36th and 37th- and you know again with the Copa law. You know that would be kind of a perfect location for affordable senior housing as opposed to market rate housing. All right, thank you! Karen can I right. Oh whoo, Rick yeah, you yeah the! What troubles me is the, whereas it says the properties on the lien sale could create a pipeline of properties that could be directed towards permanently affordable housing. So there's no guarantee that anything that comes of this is actually going to go to affordable housing. Yes, how do we make Sh? Has that been considered? And what did the committee think of that? Well, I think that's where the Copa law comes in. That's why that's where it ties in with a where then affordable housing providers would have first right of refusal. I mean you can't guarantee it. I mean this is of you, know land the land of the free, and you can't just gonna, take a piece of land and do with what you wish so, but you know just because we want it to be affordable. Housing I mean that needs to, but definitely together with a which, by the way, I noticed that Katie from Rivera's office offered to address Jim's question or concern at any time that he wants to. Do. I'm happy to hear it now. I mean I, don't know it, I'm not a legislative nor a constant constitutional lawyer, but you know I, think that's why a and b kind of tie in together, but there's obviously no guarantee it's just that it's almost you know assured that it goes for a cut road, a cutthroat market rate in investor who has if it gets sold in an option. There also was I. Guess, anecdotally, that the observation that the Clts like Cooper Square, have been able to buy a large number as I understand it I think it was in the 30 or something properties in the early 90s in the Bowery that were foreclosure properties and they as I understand it, had not been had not done that since and the clts have indicated. That is part of the reason, but that's but true, that's mostly that's somewhat anecdotal and not guaranteed, but there is a sense that this would provide a potential pop pipeline for those types of organizations. Kyle. Could we get a recapitulation on how to get to the ballot to vote because I'm not seeing that sure can the okay, so the board staff just re-entered the link into the chat function, so you should either be able to click on it or you might have to copy and paste it depending on the computer and browser you have. So please put that into your browser. The ballot should open up for you, sorry Kyle. Could we get a reading of what the Lang the final language was? That was edited sure Jesus. Can we pull that up coming up as edited so the I need my magnifiers. Sorry I can read it out loud for you, the expiration, so it now says therefore be it resolved. The Manhattan community board supports the expiration of and urges the city Council to not renew the tax land sales law. What happens to the property if it's not sold, if you can't sell it for a tax lien, what happens to the property? What's the next step, the city retains ownership of it, as it does, probably as it does prior to the lean sale and, ultimately, the city would essentially foreclose on the property as part of its tax collection process. But the thought is that the city it allows the property owner tax. You know tax hour greater opportunity to work out a payment deal with the city than it would once the tax once the sale commences. I was under the impression that they would not so much for closes that they would put a lien on the property so that the owner could not sell it without clearing the lien, but I don't know for sure. Is that not correct? You know my understanding is and I'll admit, I'm not an expert in that regard, but my understanding is that the that, ultimately, this would lead to a foreclosure, potentially a foreclosure. Just proceeding on the for the unpaid taxes. All right, I see there are some other, so I do want to get to that b. I see your hand up. Yeah I just want to do I. Think we've had a discussion. I'd like to call the question. Second, is that seconded by Adam, all right, second by Adam right, so we'll now move to a vote. So please go to your digital ballot, we're on 5b. We had to skip four so please, your previous vote should have been on 5a we're currently voting on 5b. So please mark don't have the digital ballot. Oh, are you on? Did you were you able to click on the link or copy and paste the link into your browser? It should be in the chat function, so I'll work with Lou on this, but for everyone else who has it open? Please mark your vote on the digital ballot for this resolution, but do not hit submit and those of you who are not using the digital ballot. We will ask for your vote verbally during the second roll call. So please take time for that and Lou you should in the chat box on zoom. If you click chat, so you can see the comments that are being made. There should be a link that the board staff has sent out. It's the most recent chat and you should be able to click on it. It's an error table or you should be able to copy and paste it into your browser. We can ask Lou his vote at the end of the meeting. Yeah Zun is just going to say if force comes to worst, we'll just we'll, do it verbally at the end fair enough perfect. So in the interim, let's go back to business affairs and licensing. So that is items four and hear me now: yep, perfect, okay, sorry, nine months into this, you would think I would have my audio sorted. Sorry about that, and thank you for coming back to me. So we had a pretty brief meeting, which was great. We saw two businesses they presented about their new licenses. You see the resolutions in our digital packet. If anyone has any questions. Thank you. Kyle welcome back to doing resolutions thanks to Kyle for doing those, but does anyone have any questions about either of those and see your hand up? Oh where's, your hand not up or it was up, but it's about C and it's oh okay, like literally a one word, typo, okay, yeah, so we'll just do a and b for now, and also by the way, I noticed everybody that now that we have a new chair, we don't say bundle anymore, so I know I was waiting for someone to say it, but I kind of bundled myself. So don't worry about it. Everyone, I'm gonna, move on soon, but I'll try to resume it. Thank you looking forward to that see no questions, I'm going to move it to a vote. Wonderful, so everybody! This is for Fi or sorry for 4a and for 4b. Please mark your vote on your digital ballot for this resolution, but do not hit submit and those of you who are not using the digital ballot. We will ask for your vote verbally during the second roll call, while they do that, you want to talk about five or four c. Yes, so this actually came out from a public or a member of the public who joined our last full board meeting. If you all remember, Daniela Schill came to talk about this bill, so she just kind of elaborated a little bit more to our committee and thanks Genie for writing this resolution. I, don't know if there's anything that she wanted to add or Ann. You had a question yeah, it's just a typo, it's even smaller than the last one in the it's well, it's in the fifth, whereas it says subject to rules set, but the feds and I think that's just supposed to be set by just okay, yeah we'll make that change. Are there any other questions? Thank you for your fine tooth comb. Seeing no further questions, I'm going to move it to a vote. Wonderful! So please return to your digital ballot and go to 4c and please mark your vote on your digital ballot. Through this resolution, do not hit submit I'm sorry, I'm having a technical thing. Can I ask a question: oh sure, go ahead. I'm sorry, I didn't I should know better I agree. I should know better by now. The what I don't understand is the resolved says that you're urging our congressional representatives to support state bills and I don't get that I. Don't think. That's a proper resolution format the and there's also I. Think in paragraph no that's the on 4c. It was just I, don't understand who this is being directed to and what action they can actually take. I guess yeah. So this is a. There are two separate bills: the state Senate Bill and the state assembly bill. So we're urging our representatives I guess. Well, if you're urging our state representatives, that's fine, but it's stated that we're urging our congressional representatives, so we should change it to these state representatives. Okay, if you, if what you say yeah, if that's what you intend thank you, or should it you're absolutely right. Rick, and should it include both the federal and the state level, since there is federal legislation only if the federal legislation is noted. Yes, it is in the next to last. Whereas okay can we say elected representatives? Wouldn't you cover everything? Yes, good suggestion, Sandy our elected representatives, perfect. Thank you Cody for doing this, so I guess we're voting as amended, which are those two small changes on the resolution. Thank you. Language be changed to members of the assembly and the New York State Senate to support so I think Lew that they just did it collectively as elected representatives rather than highlighting one specific or the other. But members of the congressional delegation have only the same impact on this as any other citizen that we're urging our elected representatives in Albany to a particular course of action. I think we ought to focus our point of view to them. Okay, so yeah, so just to tidy this up. So in the resolve. If we're talking just about State Senate legislation, it should only be the state Senate, but if we're also asking them to do, you know S3697 and H.R 668 that we should include that in the resolve as well. So it would be something to the effect of urges members of the assembly and of the New York State Senate to support s7290 and 8764, as well as our congressional representatives to support the previously mentioned bills. Does that make sense? Leave the congressional delegation out of it, because it distracts from the point of what we're doing we're calling for state action by the assembly and the New York State Senate. So we ought to focus our resolution to them. Specifically, no I agree Lou, but I'm asking them if they had meant to also include the federal legislation as part of the resolve, which is what I'm trying to get some clarity on hi. This is genie. I wrote. The resolution I would strike congressional yeah I agree with that genie, so yeah I think. But then we have to say our state representatives exactly as Lou stated yep members of the assembly and of the New York State Senate, so I need to add a clarifying question speed, because snap is a federal program and it looks like there was legislation introduced in the Senate in the house. It doesn't say that it was passed. So do you need that enabling legislation to do anything in the state, I'm not sure, I, understand the question. The federal government issues, this the establishment of federal guidelines for snap, okay and the bill says your resolution says that there's a Senate version and a house version. It doesn't say that it was enacted. So my question is before you can enact something on the state level. Do you need federal legislation? No, this is a. This is separate from that. So the federal funds, snap, the state- does have administrative expenses that they, the state funds, the administrative costs and they can make some decisions such as expanding into using snap for restaurants. So it's a separate legislative act on a state level, without federal legislation, without federal Elect without federal legislation. Although there is some federal legislation about this, I have not I didn't study it, but there is some federal legislation about the specific act about the expansion, but we were looking into the state level rather than federal. Now, I understand that I'm just questioning state authorities and I without federal backing those they could do it right now. There are three states that have already passed this, so New York would be the fourth do you have any other questions? No I was just wanted to make sure we were within the structure of this snap program. Alright, so I'm not seeing any other questions, so I'm going to move it to a vote. So everybody please go to 4c on your digital ballot, mark your vote on this digital ballot for this resolution, but do not hit submit and those of you who are not using the digital ballot. We will ask for your vote verbally during the second roll. All call and clear: do you have a report? I am tired and going to waive my report tonight. Thank you for that early holiday present. Next up we have land use Adam everybody good evening. We have one item that we'll be voting on this evening is a resolution of object to the proposed zoning for the coastal resiliency city-wide zoning text amendment when known as the Euler number Et cetera it's on the ballot presented by department of City planning. So this was an item that we were supposed to hear back in the spring I believe, but it was delayed until the fall due to the Euler pause in short department city planning has proposed an amendment to update and make permanent temporary 2013 flood resiliency Zoning Text amendment to encourage long-term resilient design across the city's one percent annual flood plain and expand it to allow buildings that are in the 0.2 annual chance floodplain. This is a citywide amendment and applies general lessons learned that DCP has learned. You know essentially the eight plus years since Sandy and their general outreach and other sorts of communication efforts during that time, and so DCP presented to our committee in a public hearing on November 23rd. This was our first digital Euler answering questions directly related to the impacts that we had here in CB6, which are in the resolution before you. As a point of order, after the hearing, the committee voted on the resolution of no objection unless- and so this is pretty standard- we've done this in the past on previous resolutions, no objection unless and then we list our issues. But, however, you know the authors of this resolution, you know getting more information from our land use, consultant, George, James and you know other sources of research. Basically, we've decided that you know it's better to be to change the box of which we'll be checking, and so that's the object unless and so with. That said that this is a second sterner language that allows for our concerns to be elevated more in the resolution than the text, and so with that said, we'll need to elevate or excuse me we'll need to make a motion to bring this resolution. The one before you to the board. Excuse me to the floor to vote on all right. So is there a motion? I'll call the question all right, thanks I'll! Second, it excellent. Thank you all right. Sorry, just a point of clarification who seconded it I heard gene and then I'm not sure b. Thank you, okay, thank you. So let's move it to a vote, so please go to your digital ballot. Please mark your vote on your digital ballot for 6a and do not hit submit again. Those of you who are not using digital ballot will ask for your vote verbally during the second roll call. Do you want to continue with the report? Adam? Yes, please I'll, be very brief. I'd like to think with the recent resolution that you've voted on, but not submitted. I'd like to thank the authors of Sandro of Kavitha of Sandy and the editor Ann and the work from Cody and George change. You know this was the first few lurk we've had in some time and you know they really rose the occasion. They really dug deep into did their homework and it really presents itself within the resolution. So thank you very much for all your hard work. So at the meeting there was another item that we spent. So in addition to the public hearing, we also got an update on ESCR, and so this feels like a lifetime ago, but it was only two weeks ago. So we have good news this evening: Chris Collins from Solar one sends us an email and so, in short, they've reached an agreement with EDC that allows DDC to access the solar one site and then also provides an additional funding of 9.4 million dollars moving forward with their building. And so basically, this means is that EDC is going to hope to start demolition of the building. I think in 2021, and their staff will then move into a trailer and maintain their presence in the park during construction. And so again would like to thank the board or excuse me like to thank the members of the committee for really specifically Larry for really pushing this issue, and it's glad to see that there's some resolution of that- and you know, especially in favor of you- know great allies and solar one additional ESCR news I was thought gene when he got went first, and so he would have spoke to most of it, but instead I get to steal some of the thunder. So anyway, we had updates from the team and, if you're not aware, they've begun construction. You know around the solar one site and they're going to be in construction earnest throughout the mega site as well and so you're going to see updates both in physical, signage and stuff, like that, if not already but very soon- and this is around solar one and other sorts of things, and so the Good News here is that you know our friends at waterside and the electives helped push to make sure they asked or levy the track. Around Ashley Levy will remain open for the immediate future, which is great, and so with the mitigations and the construction and the other sorts of things. If you haven't already signed up to receive alerts about this big project, we encoura I encourage you to do so on the SCR website. They send out weekly updates to kind of let you know what's to what what's going on. Well, we provided comment and feedback which gene will speak more in his report, but there's any issues that you see. You know please alert the board office and we'll work with the project team to provide further clarity. Long and short is that you know it's a bumpy ride and it's only been three weeks in and there's already been some communication issues so we're all in this together and we'll get through it, as we can two other things for our excuse me, one other thing for a meeting next month helicopters. The borough president spoke to us earlier in the meeting. You know we hope to address this in potentially in our January meeting and with that said, we're not having a December meeting we'll be meeting in January. So thank you all for your time and wishing you and your family very happy holidays all right. Thank you. Adam I see a question from Jim yeah Kyle, just as I admit it to raise it as a point of order. It's actually now a point of information, since we already did it once a committee submits a resolution for passage, there's no need for anyone to introduce it or to call a second on it. That's been our practice in prior years. So, okay! Thank you all right. So thank you. Adam! Let's move on to transportation! Okay, it's been a really long meeting. So why don't we just skip this part? No I! Guess not huh all right. I'm sorry about the complexity of the rezzo that you people have before you, but it's. It follows from what Adam was saying. Some of us have been working on ESCR for four and five years now, but the agencies that are involved in this project have not because things changed drastically about two years ago and everything went by the boards that we've been working on and so basically in a lot of ways, DDC and DOT, which are the lead agencies on a lot of this, are playing catch up, which means we're playing catch up with them. So a lot of the two and a half hour meeting that we spent that the committee heroically suffered through and asked pointed questions about during is about that catch up and the Avenue C Bike Lane that you've got in front of you is a small part of that. The Rezo is obviously not just about that. It's about the expanded detour and possibilities for ways to get people to get past. Bikers pedestrians joggers to get past the construction as it moves through its different phases, we know very little about how that's going to work actually. Yet the first phase is already unfolding before us. As Adam said, the northern half of Scico Park has been taken over by Ddc's contractor pedestrians and bikers can still squeeze through, but the bikes will be prohibited nominally from going through there as of next week, according to what they told us at our meeting on Monday. This is the I. This is the example of how little notice we're getting about how things are happening. So the pushback from the committee about this was sustained and strong. Dot and DDC both heard the message. They've already modified stuff, this Avenue C Bike Lane, was something that got pushed forward. Let's say as a result of the pressure that's been exerted. I'll also share that on Friday, before the transportation committee meeting I had a meeting with D.O.T and the management of Stuyvesant Peter Cooper and the management expressed their support for the positions that we outlaid that we laid out in this reso. They also were disturbed by the fact that there was very little concrete mitigation and that what mitigation there is sending people very far West to get around this situation. Their fears include, like ours, include stuff. Bikers will get to the 23rd street, then suddenly start cascading down these the sidewalk on Avenue C, which already has two bus stops and people use it. So we need to straighten this out and we will eventually it's gonna, take some time but they're already moving this movement to put in, as you see from the complicated reso movement, to put in an extension for the bike lane on Avenue C to 20th street, which at least connects people up to a two-way protected bike lane. There we urged D.O.T to expand their map for the detour to include already protected bike lane streets like 12th and 13th street in the East village, rather than sending people down Houston Street, where there is no protected bike lane as yet they're going to build one in the spring. So it's a lot of moving parts, we're trying to stay on top of it and we're basically trying to get ahead of the bus instead of constantly being behind it and I. Think more and more, they are cooperating with us reluctantly at first, but they're now engaging us, so I think we'll have at least some success. It's not going to happen right away, we'll get pieces of it before the spring, but because of weather and everything else and planning it's going to take. Probably until the spring for these pieces to come together, the weather will help us avoid a lot of the key problems that way, hopefully because the usage of this of the shore front will probably drop during the winter, especially once we start to get snow. If we do so, that's the outlook on that. Are there any questions about the reso I know it's complicated again. I'm sorry I want to thank Sandy for doing heroic labors. On the first draft of this we had the meeting Monday night. She got me the Rezo draft on Tuesday night and I got it to Brendan this morning. So the committee also like I, said two and a half hours worth of intense debate and questioning and a terrific performance. So you know I want to thank everybody for that. Any questions all right, I'm not seeing any questions. So, let's just move it to a vote. So everybody please go to your digital, this resolution. This is 7a and make your mark for this digital ballot and do not hit submit again. If you're using the digital ballot, it will ask for your vote verbally during the second roll call, all right. So as people do that, do you have a report? Gene in a second I have to vote. Okay, I'm back yeah I do the ever popular sinkhole is actually moving along according to schedule. They plan to finish it by the end of the year. They seem to be on target. I spoke to the former construction crew last week and he said they were fine. The MTA bus line is back running as of early last week, so the people at waterside are happy. They can now get places without having to go way out of their way and find a bus. Stop so that's good, and that's really about it for the report. Let me just mention that upcoming things that we have that we're going to be looking at, because we are the public realm that Gail Brewer mentioned. We have a lot to do with that. So you heard Third Avenue come up, we're going to be looking at ways to try to repurpose, either a parking lane or a travel lane on Third Avenue to use an extended sidewalk between roughly 26th street and 32nd street, because the number of restaurants there and the number of pedestrians there clash, the sidewalks are too narrow to handle both things. People are crowded, they feel intimidated. We need to get them more. Space. Third avenue does not need all the travel lanes or parking lanes that it has so we'll be looking at both sides of the street trying to figure out which ones work, which one works better and figure out what we can do to give people an additional space, especially during Covid-19, especially to get to restaurants, especially just to get around the neighborhood, while people are enjoying eating out, we've got DDC and DOT. Of course, coming back in January to present us the update, because we're like land use, we're gonna have them in every month until we get on the same page and figure out. What's going on and they've been kind enough to agree to that and we're going to be looking at stuff like the whole foods on 57th street, one downtown just started doing cargo bike deliveries instead of trucks and we'll be looking at ways to facilitate that and also examine, while we're doing that, whether we can talk about how the folks are paid have them have training to use the cargo bikes stuff, like that, it's ancillary issues that aren't so ancillary for the people who use our streets. So we've got that kind of thing going on and then there are easier lifts like supporting Brad Hoyleman's bill to give the city a little more home rule about things like that and audio enhanced pedestrian signals for people who have sighted difficulties, especially around the hospital zones. This is something that DOT is starting to roll out and we want to jump on it as quickly as possible because they're necessary, especially starting in those zones, so we'll be looking at a range of things like that. If you're interested come on by last time, we had about 80 people signed up for the meeting, so you know we encourage big crowds thanks you gotta unmute yourself, no I said yeah. Thank you. Gene I was just gonna say that I think you need to focus on more things, but I appreciate it next, not all going to happen next month. This is for, let's move on to parks. Thank you, Kyle. Okay, let's start in the Stevenson Square historic district see 238 East 15th street to a townhouse. This used to serve as the home to the catholic missionary sisters of the immaculate heart of Mary. The resolution you see crafted by Ereshma Patel is of no objection to a restoration of the front facade of this townhouse and a new rooftop edition not visible beyond 250 feet from the townhouse and a replacement of a wire railing, not part of this resolution, but fun fact inside the home there will be a pool in this restoration. What's the question? Yes, all right, just seeing no questions, let's move to our ballot, so please go to your digital ballot and mark your vote for this resolution. This is 8 a and do not hit submit and again, if you're, using the digital ballot, we will ask for your vote verbally during the second call, all right and then Kevin. You can start to talk about 8B. This is 211 east 48th street, otherwise known as the Lascaux House. This is a former studio in a residence of Architect William Lascaux, that's known as our city's first modern structure residents, I should say the first modern residents with this home was the first in New York to build a home with glass blocks in part to make the home more fuel efficient. We present this resolution of no objection. Word Smith by Mark Thompson, for a certificate of appropriateness for interior and exterior modification proposal includes restoration of the building surfaces and removal of small non-original rooftop elements. The existing terraces in the rear yard will be altered to remove non-original material while reusing some original elements and the rear facade will be pushed back approximately six feet to add additional interior space. It's said to resemble a grand piano alterations would not be visible from any public thoroughfare and would make the property more functionable for the new owners or functional by the way all 11 committee votes were in favor of this. Thank you Kevin any questions or comments all right, seeing none, I'm going to move it to a vote. So everybody please go back to your digital ballot for this resolution. This is 8 b. Please make your mark. Please review all of your votes that you have indicated a vote and now you can hit submit once you are done ready. Oh now, we can now you can yeah and Kevin. Do you want to do you have a report to share while people are very brief, the long unused 800,000 allocation from then council member Mendez to renovate the album playground on 2nd, Avenue and 29th street the MTA had later rejected that renovation request, but Council member Rivera's office reports drum rolls that the project is moving through the MTA channels and should be resolved. Discussions will recommence with the city, Parks Department, Happy holidays to everyone. Thank you, Kevin all right, so everyone please continue to finalize your ballots and submit those. Do any members of the board have older new business? If you do, please raise your hand right, saying: none I do have some words that I would like to say. This is our last meeting of 2020. We began this year sitting next to each other and doing board business and we're concluding it on Zoom and obviously the world has changed. Our city has changed, our neighborhoods have changed, and so I want to first and foremost thank the board staff for all of the work that they have done it borders on miraculous, if not miraculous, itself, to be able to transfer all of this work remotely to continue these conversations and our efforts seamlessly as we've, you know, continued to remote programming and so I want to first and foremost. Thank them. I also want to thank the board leadership. The previous executive committee, as well as the current executive committee, that's come into leadership for all of the great work that everyone has done through this entire pandemic and then, of course, each and every one of you. This pandemic has affected each and every one of us in ways that you know we can never fully express or quantify or describe, and so to continue this work of being part of this community board of focusing on the future of our district to remain optimistic in times that are pessimistic, really speaks a lot to the character and devotion and commitment of each and every one of us, and so I want to. Thank all of you for continuing the work. It has not been easy, but we have continued to do it. We've continued to focus on people in need. We've continued to demonstrate our values and I. Think that is a remarkable thing. I think that is the definition of a community board, and so, as we conclude the year, I want everybody to take the time to rest to re-energize and to take time for the things that need to be taken time for, as we begin in 2021, they were going to hit the ground running. There's a lot for us to do as we've heard from all of the committee chairs and of all the issues that we've faced, and so you know I'm looking forward to that energy. I'm looking forward to that passion, I'm proud to lead the board in that charge and take the time at the same time, to reach out to one another I would normally we would have had some holiday celebration at the board office around this time. I talked about it with the board staff to see if we could do something virtually figure that everybody's doing something virtually whether it's work or you know any other engagements that we have and figured the best way is to hope for the best next year and do something in person once things finally settle down and hopefully get better, but in that meantime I hope that everyone continues to reach out to one another for partnership to check in on one another, because, as I mentioned, you know this district. This board is home for us, and that means that each of us is family, and so, let's take care of it. Let's support each other and move forward together and I just want to thank everybody and express that in the holiday season, as we wind down the year, all right so has everyone submitted their ballot now, Sema will continue with the second roll call. So members, please stay on the line. Hi everyone. If you have not submitted your ballot, let me know, and I'm happy to take your votes on the phone on the Zoom, Kyle Present and I'm submitting my ballot. Okay, I'm asean President and Martin Barrett President Alvi, Barroso, Madison, Joan, Barenbaum, Joan I. Think I saw you here all right, Matt, Bondi Matt, then sorry about that. Okay sounds good Claire Brennan, I'm here Jim Collins here, Dan, Divine, President, Jim I do not see a ballot yeah, I'm sending it right now: okay, great, be Trista's mom, Bryson, Genie Dinafrio, here Rick Eckers, yeah, Charles Fernandez, here Andrew Gross. Okay, thank you. Have my ballot Collins got it I see it. Thank you. Adam Harkey, you're, Molly Hollister, here H judge here: Youssef Khalid, Youssef, John, Keller, President, Abigail, Cruzmark, President, Anton Mallner, here Kamitha Matthew, here, Sandra Mckee, here, Wells Magaly, here Richard Mintz, here, Roger Schneier, President, Kevin, O'keefe, President, Rishma, Patel, Sorry Present. Thank you, Matt Roberts yeah, I'm here Jane Santoro, here, Frank Frank's, not here Lawrence, Cher, President and Seligman and I believe Dan is here yeah, I'm sorry, I! Don't know why space bar didn't work: okay, great Luciki, here, President Lou! Do you need any help filling out your ballot or are you have you submitted I? Think I submitted it correct, perfect, right, I! Think I see it. Thank you, Shawn Sherman, President Sandra. Oh yeah, he's not here sorry about that guys, Laddie Simon, President and Happy new year. Everybody you too Susan Steinberg here Surish, here, Mark Thompson, here, Corinne Vanderdonk, here, Brian Van, Neufen, present, Ronnie White and then before I actually call Claude. I do have a question about Jim I think you potentially might have mistaken your ballot. You submitted two responses for one of the questions: I, don't know a 5b Jim selected two options. If Jim wants to collect I'm in favor, what was 5b was on the lien sale yeah, I'm opposed. Okay, you selected opposed end of stain, so I'm removing absolutely! Oh! No! Actually, I'm sorry excuse me. I did make it abstain. Pardon me, I forgot, yes, okay, abstain. That's been recorded! Thank you, yeah, all right, Claude Winfield, just to close out roll call, I'm here great and I'm happy to give the vote count so for 4a. That vote passes 41 in favor, zero abstain, zero, nine entitled 4b 41 in favor, zero opposed zero extensions; zero, not entitled 4c 39 in favor; zero opposed two abstentions: zero, not entitled. So sorry, all three of those pass five, a 32 in favor, five opposed four abstentions: zero, not entitled that ballot passes; 5b 32 in favor, three opposed six abstentions and zero; nine not entitled that passes. 6A 38 in favor one opposed two abstentions: zero, not entitled that passes. Seven. A forty in favor, zero opposed zero abstentions. One nine title that passes eight, a forty in favor zero opposed one abstain, zero, not entitled that passes, and finally, eight b, forty in favor zero opposed one abstention: zero, not entitled that vote passes. Thank you. Everyone happy new year. Thank you! So much. If there are no objections, we will adjourn the meeting seeing no further business. The meeting is adjourned at 10:02, P.M, Happy holidays. Everybody here happy.",
            "summary": "Any remarks should be made on the record by raising your hand, through zoom chat should only be used to alert us of any technical difficulties you're having or to state in writing information such as an email address that was already stated aloud on the record during the meeting once a member is given the floor to speak, I will identify you and you can unmute yourself so that you can speak as we all know, We are required by executive order to create a verbatim transcript of this meeting.\nThe agenda for tonight's meeting was distributed ahead of time by the board office, was posted online and appears on the screen before you.\nI want to thank this board for taking a principled stand on supporting the homeless and what you've been.\nThank your chair for the statement that he put out and just we work very closely with our borough President Gabriel, to provide additional services, particularly on the east side and parts of the city that we are able to do more and to do our fair, share.\nGail is a sponsor of the legislation, I believe, which we actually passed into the law to make outdoor dining permanent, we're working on making cultural streets available for folks as we get back to the pandemic.\nSo we're getting reports of people rationing at public, housing, Sorry, public hospitals, if you know, if you are a doctor or health care professional- and you are being asked to ration.\nAre there any questions for the council member all right, seeing none very easy night for you, borough, president Brewer, Would you like to speak now or during the borough president's report.\nThere's some suggestions in addition to what we are going to be asking for, Let us know also on transportation, helicopters and I, assume that there are complaints to Jesus Perez and the board, as well as others.\nI've been working with Times, Square alliance, the great Tim, Tompkins and others, and again I think you have been discussing it in your committees.\nYou haven't already gotten it that we're sending to the mayor and we are going to keep focus on it, You know that February 1st, all of the applications for community board for current members and I hope you reapply as well as new members are due.\nAnd they're about 63 64 housing, homeless, At least a lot of hotels are going to be in trouble, not all, but some, and perhaps at the silver lining, to work with the non-profit community and the city to purchase some for quality, Maybe senior housing, that's a feeling that generally fits with hotels, religious task force, we're working on for what can happen to the buildings.\nThe same thing is that people go to the provider, help or otherwise that they were working with before I need more information and also I'd like to know specifically.\nEveryone, it's a pleasure being here, thanks for hosting us, I am coming in a representation of Nyu Langone and I would like to talk to you about our projects with the vaccine.\nAnd I think we have seen this year how society has been dysfunction in many ways, not only from the economical perspective, but there are many other issues that are just like out of control because of lack of control of the actual pandemic, reduce the extra burden of the disease as having people already facing disparities, and also to increase the chance of everyone to enjoy healthy and health and well-being.\nOf, course, I, know we're discussing with our new health committee ways that we can work best together moving forward and to have.\nAny questions or comments from members of the board or from the public on the presentation we just received I see that Senator Hoyleman said that he participated in the Pfizer vaccine at Nyu. All right I do not see any other questions or comments.\nSo that's going to be a very important message: Kyle that we need and the community board needs to get out to the general public as we ramp.\nAnd, frankly, distribution is a very key question and you know I support efforts by this, the city and the state to ensure that the most vulnerable communities receive the vaccine first and that in particular, communities of color, which have been most you know, hardest hit by Covid-19, received priority.\nWe're not gonna, be able to do it all ourselves, but we need to understand what we can do in the state of New York, because cutting essential services, you know, like homeless, shelters like mass transit, like public schools, is just unacceptable, so I'll be working on that with my colleagues in brighter news.\nA shared sacrifice model that we instituted whereby the small business owners will be paying in rent a certain percentage of their receipts, and that's so important because you know foot traffic has slowed to almost non-existent on some days in grand central it seems, and so we need both the landlord.\nActually, my colleague, particularly in this environment, yes, my assembly, colleague, Harvey Epstein, carries the version in the other house, so we're working on that I also carry a bill that was highlighted in the New York Times.\nWe have assembly member court, Thanks Kyle good evening to all I know.\nIt's been talked about by my other colleagues in state government and the multitude of reasons why we need new revenue, irrespective of what happens at the federal level but of acute problem.\nWe rethink what it is to go to work in the Midtown business, district and elsewhere, So to keep in mind all of the reasons why we need new revenue both from the federal government but also in and of itself at the state government, The funding of our buses in subways is really on the line and in as perilous a condition as I've seen in my 10 years of office.\nLet's, move on to Madeleine from Senator Kruger's office, hi, everyone, it's Madeline from Senator Kruger's office, Kyle, Senator Krueger, thanks Community Board, six for their leadership with homelessness, while representing the community regarding the Renwick hotel, like Senator Kruger's.\nColleagues have mentioned, The members are spending much of their time preparing for the upcoming legislative session, which could be at the end of this year or the beginning of the new year and, As a month has passed since the big election.\nThe corporate transparency Act is likely to be passed in an upcoming vote before this congress is over her legislation for a Smithsonian women's museum was passed unanimously in Senate Committee, which is uncommon right now, and she voted alongside colleagues to pass the marijuana, opportunity, reinvestment and expungement act along with colleagues in the New York delegation, Congresswoman Maloney pushed for an emergency MTA funding.\nThe university can be on MTA, not asking every time funding or like stand in government funding because will be more common sense if all New York city can be on the MTA and not just wasting money.\nMy name is Patrick Hill, I'm, the new community liaison for Community Board, six in council member Powers, Office.\nYou know our office is still monitoring the state of the coronavirus and keeping track of the infection rates, as we deal with the second wave of sorts first wave second wave, and we continue to ask that all fellow New Yorkers continue to follow.\nIn regards to a quick legislative update, We are working with the mayor's office, other council members and state representatives to address solitary confinement as Friday Councilmember powers in his role as chairperson of the Criminal Justice Committee will be chairing a hearing specifically dealing with how to address and solve solitary confinement.\nLooking for the information, If you're able to please consider making a donation to those in need, and, as I said, I'll post those links to the chat, If there's any issues or concerns that anyone would like to follow up with our office on, please feel free to reach out.\nAnd, I, think that is where I'm going to obviously shares the previously mentioned concerns on budget raising additional revenues, protecting the MTA from these doomsday budget cuts and a lot of other issues, but I won't go into those at length, happy holidays, everyone and Congratulations Kyle.\nYes, I can hear you wonderful, I, First of all want to thank the community board for their time and their dedication.\nIf we don't speak out and ask the right questions, we're condoning that this is the right thing and that we should have the Renwick turned into a shelter for Murray Hill.\nWe know that our politicians had no idea, and no one had looked at the infrastructure issues to see if we could even support the homeless.\nIt was poorly communicated and we were given inaccurate, fair share information that has now been updated and will be updated again because the city has said that they didn't have the right figures and at a November 16th meeting we were told that it was a done.\nThe next person on the list to speak, is Kristen Kliegerman, who is representing the group Save Murray Hill, and she is speaking on the opening of a new apartment, homeless, shelter in our district Mississippi.\nAfter this it's been a busy night, but I know she wants to talk to the board and make sure that she talks public session.\nYou were talking about Copa the community opportunity to purchase act, which I think is going to be really important, coupled with community land trusts, and, of course, trying to figure out how we can support people experiencing homelessness.\nYou know that's just some of the things that I'm working on I don't want to take any more time.\nSo I want to just thank you for your courage and your honesty and everything that you have done, and especially for particular community board members who have taken leadership on that I I've.\nI don't want to single anyone out, because then you might know who my favorites are, but this board has been really instrumental in pushing some issues forward and again, really looking at it through equity, so whether that's transportation or housing or small business support.\nSo I'm going to be really brief, so the community opportunity to purchase act, I think you'll might be speaking about it.\nTypically, When you have a vacant, land or land for sale, Larger corporations are able to buy it because they just have a more sophisticated operation and though we find that when you have a non-profit entity like Cooper Square, Mutual Housing Association, once they have that land they're managing, it has been proven to stay affordable with both residential and commercial spaces, and so they also have a community land.\nThe next speaker is Kristen Kliegerman, who represents the organization, save Murray Hill, and she is speaking on the opening of a new permanent homeless shelter in our district Ms Kleegerman.\nLooking for facts, submitting a FOIL request meeting with politicians and have come up with a lot of interesting things, I'm, going to share two discoveries, and then one observation and that'll be all the RFP process that is used by the department of Homeless services allows that department to negotiate with distressed property owners, most often hotel, owners.\nWe, The citizens of New, York City, Don't have any idea who's offering their buildings to the department of Homeless services and what kind of deals they are.\nAs a result, the locations of shelters in New, York cities are based on real estate deals, not necessarily on need, it's kind of stunning.\nIf you think about it, and to that point my second fact that we discovered was that it was perfectly illustrated when we said show us the data, how the Renwick hotel is the perfect location for the department of Homeless, services.\nWe have Melissa Cohen, who is a resident of Murray Hill and speaking on the opening of a new permanent homeless shelter in our district.\nSo I'd really like to thank the community board for allowing me to speak on this issue.\nAnd I really want to start off by saying that my objection to the addition of a permanent homeless shelter at the Renwick in no way stems from a lack of compassion for the homeless population or from a feeling of NIMBY-ism.\nContinuing to ask me for money and berating me with language that I'm certainly not going to repeat here, but it actually took another passer by intervening on my behalf, to get him to leave me alone and the second anecdote would be about a month and a half ago my daughter needed to drop something off at night at a friend's building.\nShe is a resident of Murray Hill and she is speaking on the opening of a new permanent homeless shelter in our district.\nWho, from the city, will be making sure residents core and security guards comply with safety regulations and treatment regimens for the residents on an ongoing basis, not just this December and January, but for the next year, two years, five years in my experience, living in a HUD building at one point, I discovered that over time the regulations were no longer being enforced by the people who were supposed to be enforcing them.\nNext, up on the list is William Leeds, a resident of Murray Hill speaking on the opening of a new permanent homeless shelter in our district, hello, Community Board, Yes, okay, great well.\nI. Mean homeless, need a neighborhood that starts to recognize, them, know them and treat them as human beings.\nNext person on the list is Peter Harrison, who is a resident of this district and is speaking on the opening of a new permanent homeless shelter in our district hi good evening, everybody Happy Holidays Kyle.\nI just want to say thank you to everyone on CB6 who has come out vocally and supported homeless, New Yorkers and the need to be housed safely during a pandemic.\nI just want to say that you know I've heard certainly from folks tonight in good faith and elsewhere about this issue across the city.\nAnd I, Think, that what we have to remind ourselves about here is two things one is we are in the state of the pandemic at the moment, and we need folks to be housed.\nWhat I would say to everyone here in good faith, who is opposed on whatever grounds good or not against a shelter, is to think about being proactive about permanent solutions, support, politicians and policies that actually solve this problem by creating enough supportive housing and permanent, affordable, housing, Carlin Rivera was just talking about community land trusts and Bernie.\nPlease I encourage all of you to come to those meetings to support those policies where the folks that do need the services for mental health for addiction for job training can get them.\nIf all of us can agree that a shelter in a hotel during a pandemic is not a permanent solution, let's work together on making sure that permanent solutions are enacted and passed.\nAnd I encourage everyone very specifically to participate in the tax, the rich campaign in Albany right now to get funding from the wealthiest members of our community to pay for permanent housing and other types of supportive services.\nAll right next speaker is Mr Felix Guzman, who is a community organizer with vocal New York speaking on the opening of a new permanent homeless shelter in our district, hello, everybody.\nIn fact, If you were to look up any of the score cards for repairs and or talk to any of to members of the homeless, organizing community, you would actually hear that pro core services is actually one of the better providers, as is project renewal, which is taking the city by storm.\nWe are failing the homeless and the city of New York's, residents, All shelters should have resources available within walking distance, a phone call away a stone's throw away every person in a home, every homeless person in shelter could be placed into an apartment if we were to actually allocate the funds away from just throwing them at shelter providers and looking to provide affordable, safe, housing.\nYou continue the conversation working with our board in partnership and at our committee, meetings.\nSo I want to congratulate all of the new leaders on our board and look forward to the work that we're going to do together.\nAs, many of you saw, I, immediately put out a statement that first of all backed the work of our community board members but, more importantly, condemning actions like this.\nAnd, just you know numerous people throughout the public stood in solidarity with our community board members at the time it was only a few it has grown since then to a couple more and so to see the solidarity that we've seen from our elected officials, particularly the borough president's office who's, been handling this in the legal work on it and elevating it.\nBig thing that I would like to highlight is that there are some inconsistencies in the way this issue is talked about again, as I mentioned at the beginning of this meeting.\nThe inconsistencies that we've seen in the harassing letters, the false information that CB6 made some decision on this matter is absolutely false, and the proposed the proposal for the shelter is that it will be renovated to address the needs of the individuals that are being served so to think that it's remaining a hotel or in that capacity is also inaccurate, And. The last thing I want to mention is that the letter also reestablishes our and reiterates our values to people who are in need who are in support.\nSo I want to make sure that is on the record and that we are vocally saying that, and that was also included in the letter as well, and that we appreciate all the work for people on the ground who are working with these populations, who are working with people in need and providing them with the services they need and that the community board is always open to people of all voices and to partnership.\nOf course, It is a competitive process, but I want to make sure that one of the things that I promised coming into this new leadership role was to really you know, conduct outreach on engaging with communities and people who aren't necessarily represented on community boards, particularly with young people.\nThis ballot, select your name from the list of board members and select your vote on each resolution as it is presented, do not hit submit until later in the evening after the final resolution has been presented at the end of the meeting.\nPublic schools and the chancellor has said that he will let us know by the end of the year what that plan will be, and then the other question on people's minds is what's going to happen with the specialized high school admissions test, whether it's even going to be held and last night at his town hall, which we announced at our committee meeting, The chancellor said that he's going to let the science be his guide as to whether there will be a specialized high school admissions test.\nI'm going to basically just stop there, because what I want to do with the new committee as constituted is define a role for a community Board Education Committee with so many different advocacy groups at work in the city right now.\nThank you Kyle, and thanks for the new name and the committee status, we had a really good meeting last week and discussed a lot of our ongoing work, mainly around the msbi site and the Perlman Place website, which was launched or which was announced in the CB6 newsletter last week, as well.\nWe are going to be sending out some more announcements and targeted emails to elected officials, stakeholders, community organizations and such and trying to organize a set of potentially collaborative and joint meetings going into the new year, which I'm working, on, I'll.\nBe, doing some outreach and hopefully working with you Kyle on that as well on some strategy around that and hoping to have issues and topics to focus on some of the things that came up today, especially with affordable housing and health.\nThere's a lot more work to be done going into the new year.\nI think you're having an audio issue because it says you're unmuted, but I can't hear you know what we'll do.\nI, just Jeffrey Selen, one of our public members is, and me worked on a resolution in support of the legislation that council member Rivera just mentioned.\nOkay, important thanks Cody and this resolution urges the City Council to pass and the mayor to sign the community opportunity to purchase Act. This provides a right of first refusal and a right to match.\nI, don't understand why these community land trusts or anyone else should have a right of first refusal given by legislative, fiat, I think it's unconstitutional on its face.\nThe law expires at the end of this year and the thought behind allowing it to expire is that once the current, the way it works is that the tax liens are sold to a private trust and then the private trust, which is managed by Bank of New York Mellon.\nI think we want to say, supports the exploration and urges the city Council to not renew, which echoes the name of it and otherwise.\nDefinitely, together with a which, by the way, I, noticed that Katie from Rivera's office offered to address Jim's question or concern at any time that he wants to.\nThe, Manhattan community board, supports the expiration of and urges the city Council to not renew the tax land sales.\nWe will ask for your vote verbally during the second roll call, While they do that, you want to talk about five or four c.\nLanguage be changed to members of the assembly and the New York State Senate to support.\nThen we have to say our state representatives exactly as Lou stated yep members of the assembly and of the New York State Senate, so I need to add a clarifying question speed, because snap is a federal program and it looks like there was legislation introduced in the Senate in the house.\nYou, know essentially the eight plus years since Sandy and their general outreach and other sorts of communication efforts during that time, and so DCP, presented to our committee in a public hearing on November 23rd.\nI'd, like to think with the recent resolution that you've voted on, but not submitted.\nWe, know very little about how that's going to work.\nYou know I want to thank everybody for that.\nIf you're using the digital ballot, It will ask for your vote verbally during the second roll call, All right.\nIf, you're interested come on by last time, We had about 80 people signed up for the meeting, so you know we encourage big crowds.\nGene I was just gonna, say that I think you need to focus on more things, but I appreciate it next, not all going to happen next month.\nYes, all right, just seeing no questions, let's move to our ballot, So please go to your digital ballot and mark your vote for this resolution.\nThis is 8 a and do not hit, submit and again, If you're, using the digital ballot, we will ask for your vote verbally during the second call, all right and then Kevin.\nOur city has changed, our neighborhoods, have changed, and so I want to first and foremost thank the board staff for all of the work that they have done it borders on miraculous, if not miraculous, itself, to be able to transfer all of this work remotely to continue these conversations and our efforts seamlessly as we've, you know, continued to remote programming.\nThis pandemic has affected each and every one of us in ways that you know we can never fully express or quantify or describe, and so to continue this work of being part of this community board of focusing on the future of our district to remain optimistic in times that are pessimistic, really speaks a lot to the character and devotion and commitment of each and every one of us, and so I want to.\nThere's a lot for us to do as we've heard from all of the committee chairs and of all the issues that we've faced, and so you know I'm, looking forward to that energy.\nAnd I just want to thank everybody and express that in the holiday season, as we wind down the year, all right so has everyone submitted their ballot.\nYou have not submitted your ballot, Let me know, and I'm happy to take your votes on the phone on the Zoom, Kyle Present.\nI. Don't know why space bar didn't work: okay, great Luciki, here, President, Lou. You need any help filling out your ballot or are you."
        }
    }
}