{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCB4 September 2020 Business License and Permits Committee",
            "publishDate": "2020-09-15",
            "shortDescription": "Agenda \\nI. ALTERATION APPLICATIONS:\\n1. 218 8th Avenue – Store 3 a/k/a W 21st Street – Bar 21 Ltd. (upgrading to on- premise liquor license) Hours of Operation: 6 a.m. – 12 a.m. seven days a week; Capacity: 74; Tables: 13; Seats: 26; Service-only Bars: 0; Stand-Up Bars: 1 with 0 seats.\\n\\nII. REMOVAL APPLICATIONS:\\n2. 735 9th Avenue – Boxers Enterprises LLC (moving from 742 9th Avenue) Hours of Operation: 11 a.m. – 2 a.m. Sunday – Wednesday; 11 a.m. – 4 a.m. Thursday - Saturday; Capacity: 165; Tables: 56; Seats: 120; Service-only Bars: 0; Stand-Up Bars: 2 with 18 seats. Rooftop: Capacity: 50; Tables: 20; Seats: 48; Service Bar Only: 1; Stand- Up Bars: 0.\\n\\nIII. NEW LIQUOR WINE, BEER \\u0026 CIDER LICENSE APPLICATIONS:\\n3. 371 W 46th Street (8/9) – 371 W 46th St Owners LLC –\\nHours of Operation: 4 p.m. – 12 a.m. Monday, 2 p.m. – 12 a.m. Tuesday – Wednesday, 2 p.m. – 2 a.m. Thursday – Saturday, 2 p.m. – 12 a.m. Sunday; Capacity: 74; Tables: 14; Seats: 46; Service-only Bars: 0; Stand-Up Bars: 1 with 10 seats. Patio/Deck within property line: 1 table 4 seats; Sidewalk Café: 2 tables 8 seats.\\n\\n4. 142 W 24th Street - NY 24th Street Manager VI LLC, NY 24th Street Operating VI LLC and NY 24th Street VI LLC\\nHours of Operation: Hotel will operate 24 hours 7 days a week with alcohol service from noon to 1 a.m.; Capacity: 1,257; Tables: 52; Seats: 212; Service-only Bars: 0; Stand-Up Bars: 1 with 19 seats.\\n\\n5. 331 W 51st Street – Corp to be formed by Michael Mestro –\\nHours of Operation: 11 a.m. – 12 a.m. seven days a week; Capacity: 100; Tables: 46; Seats: 68; Service-only Bars: 1; Stand-Up Bars: 1 with 12 seats. Seating outside within property line: 4 tables, 8 seats.\\n         \\n6. 10 Columbus Circle, Shops at Columbus Circle – Tartinery Columbus LLC Hours of Operation: 7 a.m. – 9 p.m. Monday – Friday, 8 a.m. – 9 p.m. Saturday \\u0026 Sunday; Capacity: 74; Tables: 20; Seats: 50; Service-only Bars: 1; Stand-Up Bars: 1 with 5 seats.\\n\\nIV. COMMITTEE DISCUSSION:\\n\\n7. Indoor Dining\\n8. Statement of District Need and Budget Requests for Fiscal Year 2022",
            "lengthSeconds": "1:55:09"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "OOuuAsUMlAE",
            "fillerWordCount": {
                "uh": 197,
                "um": 191
            },
            "readTimeFullTranscript": "73 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "space": 46,
                "street": 37,
                "building": 31,
                "bar": 29,
                "restaurant": 29,
                "license": 24,
                "years": 22,
                "dining": 22,
                "plan": 21,
                "hours": 19
            },
            "wordCountSummary": {
                "cafe": 11,
                "restaurant": 9,
                "bar": 8,
                "space": 8,
                "sidewalk": 6,
                "landlord": 5,
                "tables": 5,
                "neighborhood": 4,
                "street": 4,
                "property": 4
            },
            "fullTranscript": "Hi everybody welcome to Manhattan Community board. 4 business license permits committee, we have a quorum, we have an agenda, we have applicants, so I introduce myself and the rest of the committee. My name is Bert Larson, I'm co-, chair of the committee, I'm Frank Hall Zubiak, the other coach here in Chanco Public member Sabrina Riveran, can meet a member one at a time which one, whichever one Rob, I think you introduced yourself. Yes, yeah, Rob, Walker community, I'm sorry a member okay, Wendy, Hi, Gonzalez, Committee member. I guess we have christine and Gary Harry Hello Committee member also joining us is the assistant district manager of Mcb4 nelly Gonzalez. She makes it all happen right and christine Bertay Community board member okay. The way we work for those of you who are not familiar is we go through the agenda? One item at a time we ask committee members to comment after the applicant speaks and then, if there are any members of the public who want to speak, let nelly know and then they will speak. Okay, any questions. Oh, we have one more committee member, introduce yourself please and then you muted hi everyone, Morgan Mclean, okay, just a couple comments on the agenda: what used to be items five and six on the agenda? 331, west, 51st and 142 west 24th have postponed so they will not be discussed tonight. Presumably they will be discussed at our next BLP meeting, which is on October 13th, and I will add that, as you probably all know, we're only advisory, we advise our full board which meets the first Wednesday of the month. So whatever we recommend goes to the full board on that first Wednesday in October, and then the full board's recommendations go to the state. Liquor Authority and we have the first applicant is an alteration. 218 8th avenue, bar 21, its hours are 6 A.M to 12 A.M seven days a week is the applicant here: yes, Max Pokemon here hi Max, hello burt. How are you good hope, you're? Well too? Thank you. Should we get started yeah all right good evening, CB4 everyone, hello, nice, to see everyone's faces again: hello nelly! My name is Max Folkman, I'm an attorney I'm regularly before you all, and you have two cases with me tonight. The first one is cafe floor. So with me on that case is Rahul avila. He is the owner, the inspiration, the manager behind cafe floor and he's here to answer any questions that we may have tonight. Also with him is Dwayne. Holmberg he's his right- hand, man. He works with him at the restaurant and is very involved. You know both of these gentlemen because they've been before you twice before. You may recall for those who are on the committee. I think everybody on this committee back in was here in 2018. The first time they came to you was before they knew me and they came on their own for a a full op license. They, it was for a small cafe, right next to the very beautiful floral shop that Raul has had in the neighborhood for years, and they wanted to do a cafe and they had applied for a full liquor license and that it was part of their concept. But at the time there was from what I understand from the meeting, even though I was not there, there was a concern about giving a full op to people who had never had a liquor license before and so and they were new to the process, so you denied them. They came to me. I talked some sense into them and we came back the next month with with a beer and wine application, with the understanding always that you know after they've spent some time, they've proved themselves to the community. They've established a track record of respect and compliance with the neighborhood. You got a sense of who they were we'd, be back, and so here we are two years later it was always the plan to come back. Part of, what's accelerated, of course, is Covid-19 as its committee's well aware: I'm not going to get into how much that has decimated the industry and made it even more difficult to do business, but obviously that's a that's one of the motivating factors, but the applicants feel that having been in the neighborhood now built this cafe, you know what it is. Hopefully, some of you have been there now you get a sense of the type of place. It is that now maybe there will be some comfort at this stage with the full op license, which is what they always wanted to begin with. So with that change aside, we're not making any other changes to the menu to the hours to the very early hours to the nothing else, is changing so happy to answer questions anybody from the committee of any questions, yeah Max. Could you remind us how or your client remind us how liquor factors into the sort of business model I mean based on the menu? It looks, sort of like a coffee shop, bakery type place, and I was just wondering: does it change to something else at night or how's it going to work so they've always had early hours? I mean the hours that they stipulated to with you, which is midnight actually they're, closing on week, nights they're closing earlier than that does not really plan on changing that at all they've. The idea from the beginning from when they first came to you was that, in addition to the lovely pastry menu and cafe menu that they have, they wanted to have a beer and wine offering they also wanted to have a few cocktails on offer. That's all- and you know it's never changed into a like a wine bar sort of scene late at night. It's always been that's, you know cafe sort of food first and they you know, having operated for two years with just the wine piece of the menu they all. Now they want to come back for the for the cocktails, but it's never been a. You know bar scene at night, even with the wine that they have. You know it does not turn into a wine bar or anything like that. Just a couple, technical things I see you have one stand- up bar with no seats. Is that correct? It's just sort of a bar where people can stand well I'll, let the I'll let the operators talk about the way the place is set up. I mean technically, you know under the ABC law, since we have a counter like a food counter that people go to. Okay, that's all I needed to know yeah, it's not a it's, not a bar, we're not going to have like a full bar with the kind of way you'd order coffee in the morning right exactly that's just technically a bar under the liquor lawn, and I do not want to steal christine's thunder an issue. I see that I are they using a storm enclosure. Now I do not know. Why do not you guys, right now or in the winter? Do you have one of those winter vestibules that you put outside just unmute yourselves and answer the question we are looking into that we have no problem establishing that? Well, it's actually their problem is going to what you're going to hear from christine. Is they want to make sure that it's it meets the legal requirements and does not go too far into the street? It will it would it would absolutely meet the legal requirements? Okay. Well. The reason we ask is that very few do legally can only stick out. 18 inches correct from the facade of your building, so virtually everyone you see on the street is actually non- compliant. If you get one, would you agree that it'll only be absolutely stand out more than 18 inches? Okay, absolutely! That's! How I have Bert Christine was your son? Was your thunder stolen completely? Okay, any other questions from committee members? Yes, this establishment happens to be on the corner of the street where I live, so I will say that in the time that they have been in Chelsea, they have been very from my what I can tell very good neighbors. I there was a sorry because I'm the newest member of this committee, I think so I I'm not sure what happened in the past, but there was a rumor of a club in the basement of that space, and I just wanted to kind of you know find out whether that came before this committee and it was shot down or is there going to be any other space besides the actual, very thin cafe? Will it spill into the flower shop or you know, is it just the sliver where I do not know? If you guys remember it's where bright food shop used to have the little burrito stand, then I think it became a subway. So in terms of rumors I'll, let the guys on who are on the ground sort of address that, but just and it's nice to meet you virtually as it is. Hopefully one day we'll be in person again in terms of what their licensed premises is it's for this first floor, only there's no basement license if they were to, and they would not be clients of mine anymore if they were to expand their space without a license down into the basement. That would be grounds for revocation of their liquor license. I do not think that's something they would do, but guys, if there's anything more than you want to add to that, then feel free. Anything. The applicants want to say. Oh I'm, sorry, no, my plan is always being just at the cafe floor. You know opening so to be completely clear about the timing. The timing that we open is from the cafe opens from 7:00 A.M to 11 P.M and the store opens from 9:30 to 8 P.M, so we'll never really open until midnight, and that's not my future goal to opening that late. I like to keep it here, something that the neighborhood can come and have a drink, and you know socialize and things like that, but it was never my goal or my you know my intention to have loud, music or any of those things, I'm not sure where that rumor came from, because we only had the license to operate upstairs. Nothing downstairs is just the basement and we usually use to hold all this data we sell on this store. Thank you. If you know the questions, is anybody raise their hands nelly to speak on this application? No one has okay. Do I hear any kind of resolution proposal Second I'd like to make a motion that we pass this base upon the current hours that they have listed, except for the exception of outside the storm door, has to be a legal requirement. Yeah. Of course, we are we night now because of. What's going on, we have a promise to see people outside, but even with that, it's never been past. 10 P.M, you know no one really. We all have only five tables outside right now, because oh raul you're about to get approved. Let them vote. Sorry, that's a good lawyer! Okay, so I think Inga's resolution and Rob's resolution are just about the same thing. So is there a second okay, all those in favor aye opposed absent eligible, but what's up, I just lost our expression, pressing button. Okay, I think it passes. Okay, I just wanted to remind everyone, as with all of our meetings, this meeting's being recorded, it's being streamed, live on youtube and the recording will be up on youtube when the meeting is over for the foreseeable future, all of which is required by the changes to law that let us meet in this fashion. Okay, thanks for that reminder, Frank everyone I'll be back later in the meeting. Okay moving on to number two, which is what we call a removal application. This is an establishment that is physically moving from one side of the street, a little bit to the north to the other side of the street, a little bit to the south they're moving from 742 9th avenue to 735 9th avenue. This is boxers. They also have a roof. Okay, the asking for hours of Sunday through Wednesday eleven to two am Thursday Friday and Saturday. Eleven to four am the roof would have to adhere to our regulations to all outdoor spaces. They have. If you see on the agenda, 120 seats inside and the roof has 48 seats. Okay, we've gotten some letters in favor and some letters against and we have gotten some petitions in favor is the applicant here. Yeah Bert, thank you, I'm here and Bob Fluett is here and I think Rob Hines is on the phone as well. Hi everybody as Bert said this is a removal application and it's not a new application by removal. As Bert said, what we're doing is taking the license that we have at 742 9th avenue, which is on the northeast corner of that intersection, and it's been there for seven years and we're taking the same company with the same license and just filing an application to move it acrosss the street. That's all it is. It's called the removal application. The ownership is the same. The method of operation is unchanged and identical. I confirmed with Frank the end of last week and again today that the stipulations that we signed with you in 2013 with respect to 742 9th avenue all of those would remain. In effect, there is nothing that we are seeking to change in terms of hours in terms of music security, use of the outdoor space limitations on the outdoor space, such as seated table service, only 10 pm, 11 pm close no stand- up bar on the rooftop. Only a service bar all of that is just being carried over acrosss the street, and it's the same. There are some differences and the differences are that effectively. This new space is smaller than the existing enhancers. Let me just give you some information on that, so the maximum occupancy of the existing space is 274. for the new space. It's 215.. The existing spaces consists of 7,500 square feet. The new space is a little over 5100 square feet. So it's about a third less. The existing roof has a capacity of 83 persons. The new one will have capacity for 50.. The existing boxes is also on the corner, so it has frontage on both the side street and on Ninth Avenue for a total of 125 feet. The new space is in the middle block on the avenue on Ninth Avenue, with frontage of only 25 feet. The building is also has been have has no residential tenants in it. We will occupy it. The existing space was approved with open windows, french doors. We will not have that in the new space at all and those important differences really mean that the space is smaller and the occupancy is going to be less before boxers. Hk they've had boxers on 20th street they've, operated that for years, they've been in a couple of other neighborhoods in the city they're up in Washington heights now and they've operated in Hell's kitchen. Now, for seven years there were some kinks we had to get out at the beginning, those of you that were around you remember, but since then it's been pretty smooth sailing and in fact Steve Bolita Steve may be on this. I do not know, but it was very nice because I would see Steve that at CB4 committee in full board meetings over the years and once we get got past the first year, he would always come up to me and say you know, they're doing a great job. Boxers is doing a great job. It was nice to hear that, so I can give Bob feedback and if he had ever had any issues he would tell me I would pass it on, and I think that I hope that Steve would be the first to tell you that they've been a good neighbor and that whenever there have been any questions or issues that boxers has been responsive and promptly, responsive and corrected anything that had to be corrected. There has been some issues that I've heard about the fact that this space has never been licensed. It was a former mcdonald's that is true, but remember we are not adding a new license to the neighborhood, because we are removing one from acrosss the street, so we're not adding anything to the area already. Additionally, some of you may know some of the neighbors certainly know that Bob was looking at some space. I think on 54th street the same street where industry is and the other bar. I can't remember its name Offhand and the feedback he got is you know we do not need another bar on the side street. Let's stick to the evidence. You may remember that he came before you years ago with something on 10Th Street, 10Th Avenue, and there was some feeling. 10Th avenue was a little different than 9th we'd. Rather, you be online, so we've really found what we think is the perfect space for this. It is literally acrosss the street from the existing space. It is mid block it's on the avenue and we think that's a good spot for it, and you know I know that the issue of whether it has ever been licensed to something that comes up from time to time. You know it's not a litmus test for a license. There's no rule that says you can only get a license in space that has been licensed, so I just wanted to put that out there, and we do know that I think in April of 2018 you had approved 674 ninth avenue, which is right down the block, which was a dry cleaner for a license with a 4 am close. I do not think they went ahead with that, but this community board did approve that. So as recently as two years ago, and maybe since then I just can't recall offhand- you approved space on 9Th Avenue that did not have a license beforehand. So, as I said, all of the stipulations would remain in effect, and I think that is all that I wanted to say and Bob feel free to chime in yeah. I just wanted to clarify one or two points down. Thank you. The overall square footage of the space includes the roof so for both locations. We talk about it being 5100. That includes the roof itself. It's not interior space. So I wanted to make that clear and again overall, I've obviously been in front of you guys many a time and I've learned. I try to learn my lessons on what you know should work for the community as much as it works for us as well, and for us we pursued avenues. I've been in front of you, I've just I've been in front of block associations with side streets and they've highly suggested. We go to the avenues, which is how I ended up on 8th avenue, which was feedback from the Block Association. Originally, when I was looking at 52nd Street actually and they came back and they said look, we really do not want to be on anybody on the side street, and so I went out and I looked and I found my the social place, the social club which on Eighth Avenue, so we did the same thing here. We when we decided that we think it's better for us to move from this location and that's a Covid-19 world we're in we want to get smaller and want to get a little more lean. To be honest with you, and that's one of the reasons why we're looking to relocate. We still have four years left on this lease, so we have time to be here, but when this came up for us and we felt that being smaller and leaner was a better situation, one number two: it's on the avenue number three: it's not in the residential building and number four. It really limits our street exposure and not only that we sent a new diagram to clarify. You know our issues at our existing location, we're always the front door. So we still get issues that front door is open. Well, that has about a I actually put on the letter about 36 square feet. It's actually about 2:30 square feet. We're building a new vestibule in this location would literally be the entire front, which would be an 86 square foot vestibule. So basically you come in the glass there's another set of glass, acrosss the whole front and the doors are staggered so door on the left or on the right, and you guys should have the diagram in your packet to completely try to create what we call a sound barrier right. I I'm a contractor. Do it air conditioning you have air coming here, go out there, it creates the barrier for sound as well. So I think we've done. We've tried to address every issue that we could to our community board that we work with on a daily basis, so that was my two cents Bob. One question about the vestibule, which I do think is a great idea I assume, except for the door. None of the glass on the street front will open right, yeah and actually I turned the door. If you actually look, the door is not head on. I actually created a recess space and put the door in the right so that, even when you open the door, it does not come straight to the street. It goes to the side, so we think that's a better and it's a better manipulation, and also these doors are when you have them on the front, can swing 18 inches into the street. This way, there's no door at all that swings into the street. So if you the diagram, so you come in to a little area, that's open to the outside, and then you turn there's a door there, and then you have another 16 feet before you get to the next door inside yeah. So the answer is yes to your answer. Okay and a couple of technical things there. Their application indicates that they're going to have dancing but Donald- and I discussed that today and that is yeah. We took that out. We actually, I think we ended, because without we're, not experts on that, we just figured that we're allowed to today, but we're realizing we're not allowed to, and we do not anyway. So it's no big deal yeah Frank discovered that Zoey does not include that yeah. Thank you and I appreciate that anyway, I'm sorry Frank, oh, you just want one last thing Bob, so this is sort of like the cellar, the ground floor, little mezzanine, the the rooftop right there is there any sort of difference in method of operation there are they did different types of spaces, or is it all essentially? No, it's all the same like so. The space in the basement will be what we call like a little event room and things like that. We do you know some of the letters you got for us are from Lgbt groups that we work with nonprofits that we do and they have meetings they have their week. They may have their monthly meetings, so the space downstairs will definitely be for a money maker for us, I'm not saying it's only for that, but 70 percent of the use. In all honesty ends up being for local meetings: small groups, private parties, that someone may have a birthday party, so that's the same in both locations, how it operates and basically and the rest of it's basically saying mezzanine- is a small space that overlooks the first floor because he's it's a higher space there. So the method operation press is the same and there's no difference operations per floor and last thing for me with respect to smoking, there's no smoking area on the roof right correct. We eliminated that on our current location as well. Thank goodness they do not smoke as much anymore everybody, but so it's becoming less of a hassle, and you know we have to deal with the e- cigarettes more than anything else, but we chase them away, but yeah, there's no smoking. Are you having a smoking area or ninth Avenue or you're just going to like? I said we do not. We really do not have as big an issue with it anymore, so we're not isolating anywhere for smoking. We'll have to push it aside. If we do because it is a trickier spot there to have smoking. So, okay, so I just want to address the not being not licensed so I know you mentioned that space is not licensed and you're not adding a license, but it technically. You are because the space that already is licensed will likely be licensed again, so we'll have two instead of one, I'm not opposed to this. I think a mcdonald's or a bar, it does not really matter, are any of the I mean Frank address the locations. The basement is going to be. Your money maker, you said, are any of the hours changing for this location. Yeah I apologize. The basement is not our money maker it'll be we'll, definitely make money there. The first floor is a money maker. I'm sorry. So the point was, I did not want to say we were not making any money in the basement and then nothing's changed in terms of hours. We're asking for the same exact that we've had before and to that point we have spoken to the landlord and one of the reasons we are looking to leave is you know it's just a bigger space and in the covered world you know the rents are for that place in our lease is high and he knows he's not he's actually telling us that he's looking to develop it in four or five years, so this may expedite it because he wanted to build residential. So obviously I can't say he won't do it, but it's not like he's putting it on the market to for bars at the moment. He's telling us he's looking for a dry use or he may actually do a build it up over time. So he's not he's not sure. Yet what he's doing okay, you know that was. Let me just give you a little history on that space, which makes this a little unusual because Bob this is the one. We won bankruptcy right, yeah exactly so this was this was an italian restaurant. You may remember, and we had not made a deal. Bob and Rob had made a deal to actually buy this, and the landlord would not consent. The landlord did not want a bar in that space and the deal died. I do not even know if we came before you on it, but the deal died and what happened? Was the italian restaurant filed a bankruptcy, a chapter 11 petition sometime later and we ended up buying it through bankruptcy, and one of the beauties of buying in bankruptcy is regardless of what the lease says. The bankruptcy court can order the sale, regardless of the landlord granting consent. So the landlord really never wanted us in there. They never wanted a bar to begin with, so I'm not so sure he's going to rent it for that purpose at all. Okay. Another last, I just want to make sure that we have gotten feedback from the community, so anybody else from the committee christine. Yes, I am I'm you can hear me right yeah. What is in the back of this property, the part the owner who's building. This is also building the residential building in the back, so he's creating rental apartments that are going to enter off of 50th street. So in essence, that's what's going to be behind us, we have the basement or we tie in wherever we hit will be what they call back. A house it'll be some storage, some laundry facilities and then he's going to have apartments going above us. So there's no question that he's building them above, but the reality and even as the owner who's going to rent the apartments he's like looking you'll, be here anything whoever I rent to will be aware that you're there before we rent, you know it's not like we're being put into a situation where they exist, so anybody who comes into eventually rent would be aware of. What's there first, so I'm thinking I'm thinking of a slightly different question, it's the back of. If I come out the back of either the first floor or the basement, is there a backyard? Is there no, our? Second? What is there in the back? Nothing, it will be, it will be the building. So basically, we do not go all the way back to the back building. We go to the back of it's a little tricky on the site, so he's building a building on 50th street. That's going to go from 50th street all the way to the to the to the let's say the left side to the far south side of our property of our space. So the whole back of our space is going to abut this new building that he's building as we speak. That's a residential building. Our egress will be out 50th street. So if there's a proof plan to have, we have a back door that actually makes us take a right to go out not straight out the back and that's enclosed, that's part of his building. So since it's one building, he does not have to separate egresses, so our egress will eventually be the same egress from the residential building. So right now, you're going to have one access from 9th Avenue and currently before he builds. Where is your regress? The second egress as he's building, we can't open until he builds right. He has to finish that and our second eagles will be through his building right, so we won't we're going to end up building simultaneous with him, with him being able to get us the Tco of our two- story, one- story, building on Ninth Avenue before he finishes tenth. If that does not happen, we do not open until he has it. We have a tco for the whole system. So what's your timeline there for the spring, we anticipate the spring opening up so more than likely we'll be closed on 50th street. If we go ahead with this, we're going to make a deal with our landlord to get back 50th street earlier, which would probably be after the roof deck closes the weather changes. In our opinion, it would not make sense to open there at 25 or 50 if they allow us we're better off giving it back. If he takes it and then we'll have a period of hiatus for a few months between so we're expecting the March, maybe to be able to open the new place, April a lot of factors Covid-19 as well yeah, I mean the construction in the back. I mean it's very iffy right if it does not go as fast as you want correct. Well, that's part of our unfortunately part of our lease agreeing with him once we finalize the lease is about timing for Kobe timing for him as well, so yeah. Thank you. Thank you. Anybody else from the committee nelly. Do we have anybody wanting to speak from community? Yes, I have two people. Okay, the first one is Eduardo Francisco Eduardo, yes, hi. Can you hear me? Yes, we can hear you okay, great thanks. I live in a community and I have to say that I do not want, even though boxers have been there a while, I nintendo is just saturated with it. There's just too many problems right now. I'm really wholeheartedly against this, and a lot of people are also a lot of people in my area have left because of the problems we have with the bars and maybe there's a spot in eighth avenue and stuff like that. But I do not want Midtown to be a place where everybody comes just to have more bars and nightclubs, and even though you know the you know, boxers say it's been it's. Basically, it's been fine. It's still been a problem for the community. I mean people at night, get drunk, hang out and then come down 51st street and start hanging out there. You know all sorts of shania immediately from there they're not coming or not, but the reality is this community is just there's just too many bars now and I think it's time for them to start moving on, and you know to eighth Avenue at the residential area here in our area has just not is not the same anymore. You know, and I'm wholeheartedly against this and that's what I have to say thank you Eduardo and who else nelly. Now we have a greg Lynn Greg good evening, so I'm Greg Lynn, I reside in own in worldwide Plaza. I was a former board member here in 2008 and I also participated for many years on the 51st Street Block Association, along with Steve Pedita. I just want to be clear on a couple things number one. There have been for this specific operator, consistent issues that even have never been addressed. There are multiple 311 requests that have been over the years talking about queuing outside blocking 9th avenue. The doors consistently on their Friday night party are open, even though there's a vestibule. They do not utilize it. They also use metal detectors on fridays and saturdays as well at points. The staff was also pushing staff from their side of the street over to our townhouses, which align all down 50th street and in individuals who are congregating, we invited Mr fluit multiple times to the 51st, Block Association meetings and never showed up. So we did want to address that we did. There was one item that was addressed when there was a leakage of a drain that took about two years and multiple different requests on that, but I do want to be clear that, although, in the initial things got a little bit better, I want to make sure that the picture is actually accurate, that there are probably over 100,311 requests regarding the noise on the roof and outside. We also engaged sector Charlie, Detective Los Avera, when he was still part of the there. He they were over there multiple times a week as far as telling them to close their doors. The fact that they were blocking ninth Avenue with their queuing, so I'm not again as a also representing worldwide plaza. There are, you know, moving this bar from one corner to another is not going to solve this issue. It's also. The plans for that particular building under Mcdonald's was due to be a residential building of six stories. That's now being changed into commercial. There was never any liquor license there. We're fearing the fact that we're now going to have two bars on one on each corner. It was also brought to our attention during our Block Association meeting as well, that the first instance was to bring this bar to social on 8th avenue, which we welcomed. It now seems that social is now being operated as a different venue and it was not replacing boxers which it was going to so that can I can. I respond at some point. Sorry, and then let me just to speak as well based on vacancies within Hell's kitchen. We are definitely open and supportive of local businesses, both in worldwide Plaza and the Community Board. In comparison to pre- covid, there was no vacancies within the neighborhood for existing bars. There is a plethora of bars that are not in residential buildings acrosss from residential buildings or that have existing liquor licenses that would accommodate their space even in a reduction, whether it be on 10th, Avenue or 8Th Avenue or 9Th Avenue. We as a community would recommend a different location where we would not change from a commercial building from a residential building to a commercial building and also to add on an additional license within Hell's kitchen. That would not have existed before. For a space that was due to be residential, or, at the very least, a non- bar liquored license location. Thank you craig. Would you like to say something yeah on a couple points? Thank you greg. First of all, I have a very good relationship with the Block Association. I've never been asked to go where I have not gone. I've always volunteered to go on any of my applications, and I think Steve sent a letter to you guys to just to the fact that I do go when I'm asked I volunteer to go. If I have something that I'm interested in I've gone for two other locations, I've never come to you guys to get their feedback, so I am very a very good relationship with the Block Association number one number two. It is a residential building being built like I was explaining before it's, not a six story: they're building a 10 story on 50th street and because of the far required that the front of knight down you just be a be a one- story, commercial from what I'm being told to it is definitely being residential building. Regarding 311 calls. I have we've had no none, we have occasionally a police officer might stop by twice three times, maybe in the in multiple years we have a very good relationship with the police department and we and so I'm. I do not know where these hundreds of calls are coming. We do not get the complaints. Our number is listed with you guys phone number for calling. We do not get calls about complaints. Steve Bolita. I speak to almost on a monthly basis, so just to see how we're doing every chance we get. Donald speaks to him. So wherever this is going, I do not listen. The facts are the facts. I want to us to be able to address. What's going about the move, I just want to make sure that we're clear on what is actually taking place. Obviously, if we're creating any issues, enabled they're always brought to us and we resolve them. When we can, we absolutely do our initial application that the stipulations have us allow to keep our french doors open until 10 pm every night. If you read the stipulation within the first year, we, the neighborhood, asked us to keep those doors closed. We've kept those french doors closed. Ever since that was a week a discussion. We have you guys to do that, so we're working as best we can with the community. So I'm a little confused by some of what just took place and also we did send you guys. We had a few hundred signatures we received in a couple days, but what we did is we highlighted them and sent them to you in the packet of the local. We have 61 people that we highlighted in a couple days who signed who are right in their vicinity, including acrosss, the street next door, who are for this application, and it goes back to the same thing. You know not my neighborhood theory right. So what we've said is we want to be in a non- residential building on the avenue and- and we think Ninth Avenue is the best, and I know there's been discussion on 10Th Avenue, there's other locations that we've looked at that have run into some opposition about 10th avenue being opposed not being the next 9th avenue. So I do think that this location is ideal and, like I said it, you know the same token there's plenty of places that will be vacant, and we know that in the next two or three years that all these places are not getting refilled. We are going to have a reduction in our industry, which is one of the reasons why we want to move because we want to get smaller and leaner, and that's just the world we're in today, and we have to face that fact. So, thank you. Thank you. Nelly is anyone else from the public signed up? Yes, I have one more person, Rob hi, my name's Rob, I'm actually one of the owners can I go and speak. I know I just want to say that you know there's never a perfect situation for any bar, and I understand that and everybody'd rather have it in another neighborhood, and I get that. But the reality is our current space is separated by 50th street. As we know, it's a quiet street except for our bar, does make some noise. We have an opportunity to go to a smaller space as Donald reiterated a third smaller, but we're going to be a major avenue away from that condo building. The only other tenants that we're going to impact at all are the tenants that are going to be our landlord. The same person and he's made the decision as the owner of that space that he will deal with those tenants in the future. Those tenants look at this place, they're going to look at our bar and say you know what I want to live next to this or I do not. So it's a very fair situation. Okay people say that yeah nelly is anybody else. No one else has a hand raised all right, so I just want to summarize what we did get in. Writing, as Bob Fluett mentioned, they submitted petitions of support with about 200 names, 60 of which are local. We get five letters of support. You know basically talking about how they like the place, that it supports community endeavors and things like that. There were two in opposition, including one from the 49th to 53Rd, Street, Block, Association and Steve Bolita. They are opposing the application because they do not like the idea of adding a new licensed establishment, the neighborhood, they believe the establishment, the neighborhood is oversaturated and they also have some concerns about the rooftop. But to address some of what's been said, Steve's email also says. I would like to point out that Mr Fluid always works with the community. When issues arise they do not always get resolved right away, but he does listen and works with us. He recently worked with us cancelling his request for liquor license on 52nd street, because residents expressed to him that a side street was not a good place for another bar in a saturated area. He also mentioned in that same letter that it was not a unanimous among his among the people. In the association there was a few who were in favor and one of the letters we did get in favor from was from the Gay officers League, who meet there frequently still sure go ahead christine. When I look at the picture it looks. The roof is on the second floor and it's going to be right next to two buildings, one on each side with residents and I'm just a bit concerned about what is going to be done for the noise for the buildings which are on each side right so Christine Bert and I did a a virtual site visit. So one thing there are no windows in either of the residential buildings on those walls that look down on Paris, they're, solid walls. The other, as Donald has said, is the same landlord actually owns that whole corner, including one of the residential buildings. So my understanding is that he is requiring adequate, sound proofing to make sure that you know his tenants won't be bothered, but it's sort of one landlord that controls that whole corner, but I'm thinking more indeed about the tenants than the landlord and I'm just wondering whether there is some treatment that could be done in the front and in the back and especially in the back, because I presume that's where the bedrooms are to isolate a little bit, the the noise coming from the terrace and bleeding over to that to those buildings. In the back. It's a fair question. Like I said we like the fact that there's zero windows, where our current location, we actually have a window. Well, that's literally right there and all there's they and we've never had one complaint for our neighbors there who have windows. But to that point you know we know you obviously know we can't play music. We can't we won't have televisions. We even agreed on the original step, not even tvs for light and stuff like that, so I think we're going to address the front, we'll have some kind of railing. Probably we can even make it solid if our sound engineer suggests that, because we will deal with the sound engineer ultimately to deal with how to manage some of this stuff and we'll see what we can do, it might even be greenery on those side walls we may be able to do some kind of ivy that might absorb some of the sound and stuff. So I think this one compared to any of the other ones I've dealt with. I think the sound is a lot easier. Even when social became it was hard. It's harder, I'm dealing with it now, as we discussed with social because of the fact it was built already we're using. We will use the landlord's contractor, so he's actually stopped any work on the inside in order to sound proof, so we've asked them to stop. So if this went through that we can coordinate with them and do the proper soundproofing we need to do not just whiteboxing yeah, it's all good, but yeah, I'm getting at when you get walked toward the back of your building yeah. There are going to be people which are adjacent to the building which are so if there was some way to buffer the noise, so people is not coming directly and then going into the back, because I think you are going to discover that a bunch of people are going to be affected in the back. Well again, the only people affected in the back will be the new building being built. So there's no there's no alleyways that we'll see once they build it. It's all enclosed christine this one won't have any alleys. I got it, no, that's the event yeah and even to that point to those neighbors. What we like about this one is that we can do some. I would not do a roof, let's say, but we could string things up to make it more cozy right. So it's because there's walls on either side that if there is ever an issue with the new building being built, we can deal with it very easily and again it's the same landlord. So there's no alley ways. Nothing that'll allow sound to go out. It's only the front, that's what we liked about it so well I'll, reiterate the immediate wall to the north of the roof and the immediate wall to the south of the roof have no windows right. I mean they probably were built. You know because they thought that there'd be another apartment house built in between you know, yeah and our building does not go all the way back so with a building on the south of us that has light and air in the back. We stop before we get there, so our space will stop before that. Okay, any additional questions from committee members comments, because I could see in a resolution that we might have some stipulations Frank. Would you be able to summarize them yeah these? Basically, all the Stipula and Donald mentioned this. Basically, all the stipulations that we agreed to with the current location of boxers will apply here and they cover, I think, all the issues that have come up Donald. Some of these do not make any sense anymore, so I'm going to drop them, but the ones that we will be carrying over are the rooftop is to be vacated and closed. 10 P.M, Sunday, Thursday, Friday and Saturday 11 pm dedicated licensed security would be on rooftop to ensure quiet environment on rooftop and count. Patrons Rooftop will have sound baffling for quiet environment service bar only on rooftop service and consumption of alcohol will be only via seated food service. Sound engineer, recommendations will be followed. Applicant will provide contact, number and respond to complaints or concerns immediately security plan will be followed, as submitted applicant will have no televisions on rooftop applicant will purchase sound meters and train staff. To use them will measure sound regularly. Applicant will respond to community concerns. Can I make one last point just to reiterate: doreen kovet, obviously, we've been all trying to operate. We operate the roof deck we operate outdoor, cafe, sidewalk and we know the problems that have happened for some bars in that neighborhood. We've had zero violations and we've had weekly inspections by the SLA. So I just want to let you know that we've done we've been operating through this by the letter of the law like we always have under such heavy scrutiny, so I hope that counts for something yeah and Donald you're. Okay, with everything I read right, those are just yes yeah. I have all the same. I pulled them out from the prior step and I went over those with Bob and they were all fine yeah and there were the other, the others I think just are supplanted by the changes in structure and things. Would anybody from the committee want to add any additional stipulations? Do I hear a resolution anger motion to approve, with the stipulations that Frank wrote, Frank Beckham said Rob also seconded it. Okay, all those in favor aye opposed abstaining present, not eligible okay. Thank you and good luck. Thank you very much. As always. What was the count Nellie? Has it the count nelly? Sorry, I have one opposed and then nine yes, okay! Thank you very much everybody again. Thank you very much. I appreciate it remember this comes to the full board and then the full board has to vote on this. Thank you very much. Thank you. Okay. Thank you. Moving along now to new applications, we have two new applications for local licenses number three: we have at 371 West 46th street, that's between 8th and 9th Avenue. I do not know if you, if you've all seen it has four sets of hours, four to twelve A.M on Monday, two to twelve A.M thursdays and wednesdays, two to two A.M Thursday Friday and Saturday 2 to 12 A.M on Sunday Max. Well, we really think about the closing hours, and so in that sense, there's only there's really only two: that's the weekend closing hours, Thursday, Friday and Saturday, and then there's the rest of the week closing hours but fair enough. In any event, good evening again, CB4 I'm Max Bookman again with me, is Linda Salman, Jasmine, Gerald and Yvette Gerald, all together on one screen down there. Hopefully you can all see them they, maybe they could just wave. So everybody can see them. Those are the applicants for Jasmine's Caribbean Cuisine. So a little bit about them and then the application Linda is the owner of the building. Jasmine and Yvette are a mother and daughter team Yvette has an 11 year, history of managing bars and restaurants. In the Virgin islands, a french caribbean restaurant called Les Cargo a place called Coco Jones, as in the Marriott Hotel and they're, looking to open a caribbean restaurant on 46th street, a rather busy stretch of 46th street, which folks on this committee know better than I they are replacing pool Perria. So Wilbury had been there a number of years. This board had approved them with stipulations. Pool Berea is leaving and Linda and Yvette and Jasmine are looking to give it a go same hours of operation that you had approved for polporia. So that's where we got them from they're, not looking for anything different with that which to repeat the closing hours piece of it is at 2, A.M, Thursday, Friday, Saturday midnight the rest of the week same layout as Pool Peria recorded background music Whooperia did do occasional, drag shows where they would have someone dressed in drag like sing, no microphone or stage or anything they would just sort of you know saying it was a. It was a draw they're looking to continue that tradition there. So that's why we put on our 30-day notice. The continuance of drag shows, you know I think show- might be kind of an overstatement, but you know it existed there. One correction: we do have on our application that there's going to be live music. That was never the plan. It was. You know it's not sure how it got on there, but it should not be so. You know there is no live music, no plans for it. So we're happy to answer questions that the committee has yeah Max, I'm a little confused about what's going on outside, because we do not have any record of there being a sidewalk cafe there previously and my recollection of that block is that to extend their outdoor tables they're all within the property line, and no one actually has a sidewalk cafe. So you seem to have one table outside and then two in a sidewalk cafe yeah. So I was a little confused too. So here's what I looked into it and here's sort of where we're at with the outdoor seating. So two components there is the outdoor seating within the property line and then there's the traditional sidewalk cafe. This is not discussing any additional Covid-19. You know layering. That DOT has that's obviously a separate discussion. So, as far as the at first category, which is the within property line seating, they have one room for basically one table and that's what Pool Perria had where, if you walk into the property, there's like a little like outdoor sort of like it would be like the garden if it was a ground stone, wall and yeah, and you can it's like one step up and you could like have one table there and so they're going to have that there. In addition- and I did not know this- and you know this is what the city's website says- I did not actually check the zoning books, which is my sort of my bible on it. But at least as far as the city's website is concerned, they're saying that the area is zoned for small sidewalk cafes. You know that term of art, small sidewalk cafes, where you have one row of tables that is up against the property line, and you can't go further than that. I mean to the extent that's true, you know we want to be able to preserve the right to one day applied right. You, probably you probably know what you're going to hear from me and or us on this, which is we really can't. You know, vote on a sidewalk cafe until we get DCA plans and see all the instructions and everything does not stop me from asking me at least I'm okay with the outdoor table on the property line. But can we get rid of the sidewalk cafe from this application? Yeah? That's fine, and it's also particularly fine nowadays, because DCA is not even accepting sidewalk cafe applications right now, because they want everything to go through the D.O.T program. So one day whenever that day is where the mayor's done, extending the the D.O.T program, you know we'll look into it further and if we think there's a viable small sidewalk cafe we'll come back to you. Okay, and I think this is just a technical thing on our question about not having sidewalk obstructions. I think you meant to say you answer. Yes to that, you think we get it. I think we get that wrong more often than we get it right, you're agreeing not to place anything on the sidewalk, that's correct! We agree not to obstruct the sidewalk. Okay, that's it for me, questions from anyone else on the committee you're going to keep windows closed. Obviously, when there's any music inside I see on the application, it says there are windows that can be opened yeah, so I, whatever you normally I mean I do not. I think your steps, typically for just regular recorded background, require the music, the windows to be closed, yeah any kind of amplified sound and you agreed to that. Well, I think they agreed to close the windows whenever there's amplified sound and we always agree to yeah. That's your standard step. We always agree to that. So yeah, okay and I had a clarification. So you said you do not have live music, but when you have drug shows, I mean it's not background right. So without clarify I mean it does not have to be live, but it's certainly amplified well. No! Actually so it's not, I mean we call it drag, shows that we probably should not have called it that, because it's not a show in the sense that we are, you know we have sort of tickets or stage or even amplified microphones. These are basically just people who are you know in the aisle there's like one drag performer at a time who, in the aisle, goes around singing without any amplification, and so no music, you know they're just singing songs and so that that's what we're doing here got it christine. I was leaving the storm enclosure to you. It's fine because it's on their property, it's right is there always that's obvious. We have a setback. Most of those buildings on that block have setbacks yeah. This is a big setback, yes, so Bert and Max. I do not want you to get in trouble if we eliminate the live music with this drag performer. Is there something? Why do not you leave? Why do not you leave the live music there? Well, I do not just in case if you're suggesting it- I won't say no well, but can we agree? It'll cease earlier, like all live, music and performance will cease by midnight or something. I think that that's agreeable. Okay, good anybody signed up to speak nelly. No one! Okay, do I hear and any stipulations stand out. We talked about live music, not past 12 o'clock and the sidewalk cafe is eliminated for some future date as a separate application right and they're going to change the answer on the sidewalk obstructions right within that one seat within the property line, we're keeping it's just. Yes, that's within the property line. That's your! That's your business! What you put there! Okay! Thank you! Okay, do I hear a resolution inga? Second, we did that. Okay, we have a first and a second okay, all those in favor aye, okay, those opposed abstaining, president, not eligible. I think it passed. That's it for me tonight! Thank you, everybody! Thank you. Good luck! Everyone good night. Okay. The last item on the agenda is also a new application at 10 Columbus circle. That's a no- brainer christine your mic is open. We heard what you said. I was hoping you would her. That's called the stage whisper right. Okay, twee welcome. Yes, thank you. I apologize for arriving late. Okay now did I see Frank? Are you the lawyer? Why am I always the last one on your agenda? We'll try to work it differently, frank next time? How are you guys? Okay? Yes, I'm the attorney nicholas. Are you on yeah? We see him, I'm here. Yes, can you hear me? Yes, okay, hi everyone guys, you may or may not be familiar with the tartinery concept nicholas. Is it six or seven places right now? Five! Sorry! Yes, we closed the first one. You should be saying this, but I'll say tortillas are french sandwiches? Yes, so I hate to I hate to call them sandwiches exactly yes, so they're, not sandwiches, they're tattoos, which is which is a one slice of bread with the topping and we have like Frank said we have multiple locations in the city and we are very excited to take over the bouchon bakery space in in the shops at Columbia Circle. On the third floor, I'm sure many of you know the location and we're going to be doing exactly what we've done elsewhere in the city which is operating. A cafe bar from 7 am to 9 pm approximately and that's it. We've been around for 10 years, and let me know if you have any questions: oh no outdoor space, no terraces or anything like that. No it's com, it's completely indoors and you're in the what's currently called the time, Warner Set Center, but that probably will change the name someday any questions from the committee anger. I just have one question: I've had a storm enclosure because it's enclosed completely already no bikes and no closing the windows, but are you taking a space, that's obviously shown and then that center space where people? So there are two center spaces? One is kind of roped off where you serve and then one is where you can just go and sit. If you get your stuff at the counter. Is that basically all the same? Yes, it's staying the exact same layout motion to improve. Second, all those in favor aye opposed abstaining present, not eligible. It passes awesome. Thank you. Thank you. Okay, good night Frank good night, Nicholas, Bye-, bye. Okay. So now we have committee people. We have two things on the remaining on the agenda, one on indoor, dining and one on outdoor dining and there's also district needs. If anything, oh the district needs right. Thank you for reminding me. So in the past remind us frank what we've done in the past. We have. We have not done anything for this committee right. Basically, every committee at this time of year is asked to see if there's anything the committee wants included in district needs to go to the whole board and ultimately be included in our presentation of things. We'd, like resources devoted to we've, never come up with anything on this committee, but we keep it on the agenda in case anyone has new ideas. Okay, now the on the agenda, the indoor dining and the outdoor dining wait yeah. This is true, yeah, okay, we'll wait. Sure I wanted to ask. So it sounds as though there's nothing in the past that has been asked in terms of budget requests from this committee. I think the reason is. Let me let me explain that for one second, the reason being that this committee essentially deals with. I mean you know: police, NYPD and then the SLA and the SLA is a state authority, not a city council authority. So when we provide input for the City Council budget of the mayor's budget, you know if we put items which are for the for the state, it's not it's, it does not go anywhere. It's not relevant right, yeah, all right. We're asked, whereas the district needs in terms of the municipal budget right that we have control over locally, not the state budget. I mean we want more SLA inspectors, but that's not what the city budget's about. I mean we can always separately write a letter to our elected officials, the gottfried and Viralman and Linda Rosenthal, and send a letter with requests from the SLA and then they can take it up at the assembly. You know at this at the state level, and that would be the place to funnel our request, but the statement of District needs the only thing that would mix. I mean that would be relevant is essentially, you know, NYPD stuff, and if there continues to be outside, you know outside the dining there may be some requests we have of D.O.T, but that these are the two agencies to which we could direct request. Does that make sense to you twin yeah, and I also like the idea of keeping that open, because we do not know what's going to happen in the future right? Okay, Rob did you want to say something about district needs too. I wanted to make a comment, but it has nothing really to do with fiscal. Is there any way that we could maybe do a meeting, but have small business there, because we're going to be losing a lot of businesses come up? Can we also do it in conjunction with the nightlife ambassador to where we could all sort of kind of find out what the future is sort of kind of going to look like for us over the night, the next year or so Rob? We have a balanced business task force. We just recently had a forum opening up to what small business needs. We did something in the full board and I think we will continue with this. I like your idea of meeting with maybe the nightlife people specifically because we're BLP restaurants and drinking establishments. I would. I would like that in some time in the future to work that out what the future will be. Is amazing, it's a conversation. That's all it's amazing. We could get like all of us in a room and just sort of kind of talk about things. That's all! That's all I wanted to present yeah. Well, that's one of the things that we have right now was talking about the indoor dining there are. Do we want indoor dining? Do we want to make a statement about that? Just discuss it among ourselves. What are our feelings right now about indoor dining for New York City, some people are saying wait. Governor is saying we need more regulatory people out there to watch. What's going on to report infractions, there are other people saying. Actually there are people from the nightlife who are suing the governor. I think there's three hundred and twenty salmon people. The last I heard in this suit to open up the nightlife. There was a piece in the times recently somebody owning a restaurant on little neck saying you know. I can't open up my restaurant indoors, but my neighbor three blocks away acrosss the Queens nassau line. This restaurant is open same situation as mine, but there's a political boundary between the two. So we thought we'd just throw this out for us to consider just what a little round table among ourselves. What do we think do we? Can we come to some kind of consensus if we want to bring a resolution before the full board for October, which by then may even be moot? But who knows the mayor is wherever he is and we know where the governor is so I'll, shut up and listen to everybody else christine and then inga. You know it feels like if they were opening at 30 capacity, for example, that would be a beginning. You know which mitigate the risk etc and then having a temperature test when you get in, even though we know that some people are do not have any. How can I say? Do not have any symptoms, but they carry it, which is always indeed. The big problem is that you do not know who is going to go to the restaurant and come back and have it. So that's the big question, but I think considering how good this the thing has been. You know the progress has been giving a little more space to the restaurants, because October is when the outdoor space is going to close. So what are they going to do? You know, I think, I think giving them a 30 proportion. 30 occupancy would be, would be maybe a good first step. Well, I agree christine on a very small start in stages. Just like the offices are going back whenever they do. The only thing is, I do not know if it does not work, we still need a winter plan. We need to make an outdoor plan with. I do not know heaters. There needs to be an outdoor plan in conjunction with the indoor, because if the indoor does not work, the restaurants have nothing. They need to have an outdoor plan. First, that's just a very strong feeling. I think they need to work on an outdoor plan for the winter, maybe through December, because we with heaters and something maybe it can work for a little while and New York does not get that snowy. We do not get anything really so with the heaters we could do it. January February might be a little iffy, but at least through December some kind of an outdoor plan. We all go to the markets, we all have, I mean it. Could it could work outside, but they need to make some kind of an outdoor plan and slowly phase in the indoor, because, if it just dead stops then they're just with nothing right so serena. I do not think there's been a decision that it is going to expire at the end of October. I think that's still an open issue and I think I think it was hoboken in New Jersey that actually extended their outdoor dining through the end of December. Yes, hoboken did that. What I've heard from restaurant owners, though, is that the city's concern is about the sort of platforms in the roadway and what happens if it snows and how does it all get plowed? That seems to be one of the big stumbling blocks with at least the roadway stuff. They need to roadways for the pedestrians and the restaurants, but I mean they need to do not. We have some kind of regulations with the heating like we can't have those gas. Yes, no. They can't have the here in the yeah in the sidewalk cafe they can, but only you know very only certain approved. You know gas heaters that they're very specific requirements, but what you can have that's what I thought for New York. So, but as long as they have an outdoor plan through the end of the year, I would not be adverse to trying. I mean I'm not going indoor to a restaurant, but some people might but they need to have an outdoor plan along with it, because and as far as the you know, sanitation and the snow, plowing, etc. I mean you know we've. I was just looking at the number of snow days we have in New York and it before Christmas. It's very unusual that we would have a snow day. These snow days are in January and February, so we can always take the risk and then say if you have just like the people are supposed to clear the snow in front of their store, but then they can go and clear the snow on the bike lane. You know, because that's the only thing anybody cares about right. I would also go I'm sorry. Okay, they need to have this. You know they need to have what christine just said. They need to have it as a plan, so restaurant owners and bar owners know what their responsibility is December. They can't just say: well, you know they need a plan for outdoors. What do you have to do if it snows? What do you do? What kind of heater can you have? They need to have the plan, so everyone understands it and then they can work on an indoor plan simultaneously if they like. Well, I want to say something about the indoor plan yeah like upstate is can be 50, but I would not have up 50 in New York City, I think third 25 or 30 percent, and just- and I also am aware that we have indoor dining it's approved as of October, 1st or October 15th. The restaurants are not going to be inundated with people right. Well, you never know. I do not think so. I think many people still choose not to go inside and would prefer to be outside, but I also want to add. This is something I was thinking about. Frank voted to my attention. Employees. There are employees at risk for whatever reason who might be afraid of returning to an indoor, dining situation, and I would only want to approve indoor dining if there was some and I do not have the answer exactly what the mechanism is some accommodation, because if the employer says we're open, get yourselves down here at nine o'clock or at seven o'clock on Monday morning, and someone says I can't the employer says: you're fired, that person is cut off on unemployment insurance because they're choosing not to participate, so I would want the case. Is that the trigger? That is the case, and you know I was going to type up on the two first, if I were a waiter or something like that, yeah I'd be really concerned about this, especially if I'm an older guy. You know, I'm not going back to work. What do I say when I apply for my? Why certify my unemployment benefits right? I refuse work. I indeed now what there has to be some exemption there for people right and there are. There are exemptions there. Now there are currently exemptions for the Covid-19 business in the unemployment certification. I do it for my son, so I know what these many exemptions are, but it's got to be extended. You know just like unemployment's going to be extended as well. You know, but in all you know what both Inga and Christine have said so far. I totally agree with. I mean everything that you've said is like on point question is: where does this letter go? Who are we? Who are we talking to got to keep in mind that Corey is supposed to be now the head of this task force according to the governor? I do not know if he's accepted that, but I guess he will if he wants to run for mayor right. In any event, exactly you send it to the mayor and the Governor Copy Corey and copy the the you know the industry, and then they know that some community board are in support right. They would. I would if we do a resolution, I would send it to the governor to the mayor. I would also send it to the Nightlife Association, the restaurant association. I told you Harry: did you have your hand up as well or just we have a whole bunch of okay? Here you have Rob and Sabrina and Wendy Tweed yeah. I had my hand using the button and then I guess visually is what we're doing now. I had a question because I thought there was supposed to be something about the filters or the ventilation systems and the restaurants being changed so that they're, more hepa, filter and more you know more for the circulation and cleaning of the air. That's the impression that I had, because what I'm seeing is that people, if they want to have it they want to leave the at least now to leave the door open, so the academy, indoor, dining and then still have that circulation from outside. But then I did not know about the hep, like the Hepa filter systems that they're supposed to be installing okay, I apologize Wendy Sabrina Rob, I did not. I was only looking visually. I did not look on this side, so wendy yeah my hand was up on the side too. All right go ahead. Wendy yeah totally in favor of sending a letter totally in favor of simultaneous outdoor planning. In addition to indoor planning, I think for indoor the with Tweet that one of the massive issues is ventilation systems. It's the only way to somewhat keep people safe, which is for a lot of business owners going to be a major expense. So I would say in our letter you know I do not know how we would want to phrase this, but a recommendation that some sort of fund- or you know grants- become available for business owners to apply to in order to bring their ventilation systems up to whatever this code is. In addition, something we heard on the from the better the balanced business task force when we did the panel was. There is just a lot of confusion in general, even around things that we now seem to have gotten used to like wearing masks. But how do you import? How does a business owner actually enforce that? What are the rules? The business owners on the panel expressed a ton of confusion over that and that being one of their major frustrations with all of this, so I think just also spelling out for both the continued outdoor dining and how we would handle snow and things like that, in addition to the indoor dining plan setting up very clear guidelines, because that was a major stress that business owners did not need to undergo okay, Sabrina yeah pretty much. Echoing the same, I think we should have a plan for indoor dining about 25:30 capacity max, and then there also needs to be something out outdoor. There are models of this I know Europe. Does it France? Does it in winter previous pandemic, and I do not know what that's also going to be cost right, because if you have heaters and it's going to be electricity- and I was even talking to somebody like well- maybe what happens if they? It could be a fire stew right. But I do not know I'm not electrician myself, but I know that if you have a lot of them, it's what happens in we're, not fires, but blackouts as well. Like what happens when we have all the acs on during the win the summer time, right could be something like that could happen with heaters too. I do not know, I'm not I'm not like I'm, not a electrician or an expert on this there's just concerns that I have had myself, but I do think that we need to send a letter and do not know how to ask those questions or imply them, but maybe what one do is say in some sort of a fund or something like that: okay, Rob and anger. I agree we should turn around and send two letters to officials. Basically, if we could extend what we currently have outdoors until the end of December as far as it goes for indoors, if we're going to get any increase, it's going to be due to this weekend, and we should see it in the next two weeks, provided the numbers still continue to go down. Let's all go to 25:30 percent, as far as it goes for indoor dining. Also have it's where you come in, the host is turned around: they zap you. They get your temperature real quick. They ask a few questions: have you been out of the country have been out of the city, you know, or have you been in contact with anyone with cobit, I hate to say, but it's like the barbers had to go through worse to sort of kind of do this checklist, for you know the people coming in, so you could sit in a chair to get a haircut. Why not do the same? Wear your mask until either beverages or food is served and they just take it really slow. I think there are people out there that are hungry. They want to work, they're, tired of being cooped up and then, if people who can't work there are things out there for them. Saying hey. I do not feel comfortable in this environment going back to work. They should not be penalized, that's about it! Thank you. I just had one comment regarding I mean again: I iterate we have to make it clear to business owners and restaurant owners what the regulations are for indoor and outdoor, no matter what we do, but with regards to the filters, it's not the restaurant owner or the rest, the bar owners, who control that it's most often the building owners, whether or not they put those in, has nothing to do with the restaurant owner. So we can't really make that a contingency for whether or not a restaurant can open, because most of them can not force their landlords to put in the. I think it's Mb13, I think 13 is the minimum filter. Those are very expensive and most landlords are just going to say now. So while it would be nice, I do not think it's realistic, okay, Carrie yeah, I'm wondering how we get compliance mask wearing temperature taking all of that stuff and do we need to involve like what is the role of the police or who is police in compliance, because if we're going to put restaurant workers at risk, you know how do we make sure that everybody who goes into a restaurant is behaving the way that they need to behave? Well, that that's governor Cuomo's main objection to indoor dining in New, York City right now? He insists that there's been no adequate enforcement of the regulations to date, and today he called indoor dining in New, York, City, reckless or negligent under the present circumstances. So that is his big concern and I've heard concerns from restaurant workers that it's not just testing compliant people. It is people who just refuse to wear masks right. You know the whole political statement issue and you know restaurant workers feel they're, bizarrely on the front line of enforcing these rules that you know they did not set and keep changing. So it's confusing issue right now, but I think christine Morgan from an operational standpoint, it's like Frank says a lot of employees and people. I've talked to coming from within the operations are fearful and scared and they're kind of put in a hard place on the rock, because unemployment as Michael said, is once your employer calls you back. New York state handles you differently. You know I'm going to shoot myself again for many years and at some point, like the other day, I was riding down 9th Avenue and I saw the Midtown northwest some police officers in uniform uniformed police officers spreading out telling a restaurant owner to spread his tables back out. So my segue into what we're talking about enforcement and compliance and protecting employees is maybe somehow here I say it paid detail in liquor license establishments. This is a crisis. Our industry is imploding. We can only hire so many security guards. What? If there's a cop on a group of restaurants, get together? They get one police officer and somebody who is not going to wear their mask and starts a protest or something that helps the local operator. I doubt it will go anywhere. I've been saying it for a long time and I stopped saying it many years ago, christine you maybe remember but paid detail, I'm thinking if I'm out there at my age, trying to control a crowd that wants to come in I'm overwhelmed, and I can't call my waiter, my busboy and my manager or whatever, to control that crowd, no matter how much they want to work or do not want to work. It's people get a little different with alcohol and with the density of this city operationally, I want to open. I get back to work, but I do not see it happening real soon and so with the police department in crisis and restaurants, not having any money, but if they got together and pooled their money for one officer in a block or something one officer amongst five licenses. I do not know, and then that gets paid to pay detail. The office is assigned from downtown. We never see the same officer twice in a row blah like Td Bank, on the corner of 42nd and 9th and as far as operationally having somebody assigned to taking your temperature making sure you wash your hands and asking you seven to ten questions. That's one more employee. I've got to pay and I do not have any. I can hardly get my landlord to work with me. I do not know. I do not own a license, I'm talking hypothetically. Of course it's and the Hepa filters are wonderful. The ones you mentioned they're great. I do not know a landlord that does that in my leases that I was looking at, I was required to do all of my own HVAC. I never got a lease everything in that lease said you're responsible and you have to meet all the code and you have to pay for it. I maybe you maybe you know of a landlord that does that you have to include your landlord and perhaps amend your lease, and maybe things have changed since I was looking for a restaurant years ago. Thank you. Okay. I have Rob Christine and inga yeah. If we're at 30 capacity at a restaurant, the host, if they're saying how many tables, how many people you know outside inside, they can also turn around and ask you these questions really quickly. I mean I go to my local community health center and they've got me in and out in under 90 seconds as far as it goes for temperature. Taking in the questions. The other thing I wanted to comment on was sugar bears swiss cheese yeah. Oh mental health and hygiene they're. I'm sure we'd like to bring back most of their people and considering the amount of restaurants are closed. These people are not working. Why do not we ask them to bring these people back so they could turn around and check in on the restaurants that are opening up at 30 percent capacity and make sure that they're doing what they're supposed to be doing, I mean, instead of inspecting the kitchens to making sure they're up to speed which they should be, but they could also turn around and be bringing these people back to also check on if they're doing the right thing at the door. That's it christine. Yeah, I think anger's idea of being very clear of what are the rules is very important and, having you know, like a small poster at the entrance saying you must wear a mask, therefore put the owner of the restaurant in a much better position that if people come in and do not wear a mask, they can call the police- and you know right now- it's the problem is that it's really not clear- cut and they do not. So I think I think, having very clear directions is one of the. When we were before Covid-19 everybody had clear directions right then we went in to Covid-19 and he was a little bit very confused. So now we are going out of Covid-19 or slowly out of Korea, and we need to get back to having a very clear rules saying that's the way it's going to be guys, and so, especially if we want Cuomo to get more amenable to open, we need to really articulate how the enforcement, how the communication and the enforcement are going to be established and respected. Okay, two quick things just one more on the restaurant part. I do not know if anyone read today the fairy in New York City. Two people got on and refused to put their masks on it took they had to call the police it's going to be disruptive and it's going to tax the police, because that took a whole hour. You have to get there and then they had to handcuff them. They had to talk to them. It's just it's going to be hard to enforce that, but anyway, the last thing I have to say is: did anyone tell christine that I was her at the last meeting you at the last meeting christine? I did not give my approval, but I'm very flattered I mean you know we thought you deputized her christian. This is very important assumption. So did you talk about storm and Roger? She did better than you. I even voted against some hours right. You did all of it right. Okay, Logan your hand is up again and then Tweet last comment. I think I think we got to be careful when we compare other businesses and getting you know in and out quickly, because my experience when I was giving my teeth clean today is I had a person assigned to me to take my temperature. Take my oxygen level to wash my hands to assign me a mask. It did not take long, but I would not compare that to a crowd getting in front of my restaurant of a party of six that can not be processed at one time together. You need to separate everybody out and I want to make sure I'm not being too picky. I want I it can be done. The biggest thing is enforcement. It's labor intensive, it's one- on- one. It's me talking to each one of you six feet. Apart Morgan. I guess I assumed that any letter we sent would be about things. You know general things like needing clear rules and needing enforcement, but not getting into the weeds of you know about. You know where the temperature should be taken and that sort of stuff I mean I do not think we have the expertise to no. I know I I'm not I'm. I was using it as an example of what how it's, how difficult it would be. It's doable. I think it's really doable. You know, but it's very expensive. It's very labor intensive and a general statement is not going to, I think, answering Cuomo's call for the large cities or New York, that's where it comes down to, and I think your example linga is. I do not know that specific example but Ninth Avenue two nights ago there were people having a throw down and the cops were rolled up because they were not going to wear a mask they're not wearing masks, and if I have to deal with that as an employee or an operator, I do not know we want to talk about specifically how I'm going to do it, but you got to have the cop you got to have somebody there in uniform, in my opinion, and I hate to say that, because the cops have better things to do, maybe so pay detail. Thank you am I going now. Okay, I missed it. Okay, so yeah just to get to Inga's point the full story which in makes me live. It is that they said it would not happen to me if I were black lives matter and they scoffed at the whole thing, and that was just ridiculous in terms of- and you know, I'm saying this outright, because this is a safe space. This is how I feel, but in terms of enforcement, there was a talk about binding people, a thousand dollars for not wearing the mask in the subway. If people the city wants to get their money back, they have to start finding people and if it's going to be with police detail or whether or not it's going to be there's something on law and order about like security, police detail or peace officers or whatever it might be. You know that they, you know, they're not fully armed, they might just have a repellent instead or whatever, but you just lay down the law and you say: look no mask thousand dollar fine you're done you're out of here like that's it. How else are you going to? I mean? That's just me. I think let me just let me put this in words. I think I think we're getting off in tangents, because I would like us to come to some general conclusions. What we might want the board to come out with a statement in October, simultaneous indoor outdoor plans, very clear rules for the outdoor and the indoor guidelines for enforcement guidelines for enforcement 25 to 30 capacity, some kind of if we can create a grants system for our heaters on the outdoors or HVAC systems indoors. I do not know if that's in the car, but we can include an Ap party, say what would you say right? No more than eight people per party and, if you're a household that living together all together, you only need to ask one question to the leader of the group. Well, I do not want to get into the the piece about the question. I know it's just like eight, no more than eight people per party yeah, I just want to say upstate you walk into a restaurant. You do not get a temperature gun in your head and you're not questioned no, and it's up to you. If you wanted, if you want to enter- and I've noticed in some of these restaurants, I tend to be on the outside, but I've been inside a couple of times that the seating area and the tables very clear separated- and apart not more than like four people at a table because they have you know small tables, not huge party tables. Everyone is wearing a mask until they sit down. The servers all have masks. The issue is the bar. That's something else because, though people may, at the beginning keep a distance give them one drink. Maybe that's what you're saying is that no bars, so no nobody at the bar, and then you know, maybe you should say there should be a limit to the number of the party yeah and you do not say what limit you. Let somebody else figure it out: secret alcohol service, only seated alcohol service, only no standing right. I like that service right, I hate to say it, but there's no there's just no way and if I've had my first drink and I get a little, I know we do not want to get in the weeds. They got it frank, but it's just the way. People are people, okay, and that I mean I have a thought which she's feet apart. We are all talking about enforcement and who is going to do that? You know there is the traffic enforcement officers, they do not have a, they do not have a gun and they could certainly in their 3000 of them, and they could certainly pull on that resource to look at the enforcement. So I think we could say there must be enforcement and the state should be creative about where to re. You know recruit the enforcement. There is a traffic force. There is what what Rob was talking about. There is the you know the health department etc. So we just want to open the door that it does not have to be your NYPD, narrow definition. Okay, what I think what will happen? What I'm thinking and let me know if you are with me on this- is that Frank and I will come up with some kind of draft. A frank is out of the room Frank, I'm volunteering, that the two of us will come up with some kind of draft say within the next 10 days, and when is it knowing? When is our meeting in October? I look in the book. It's late, it's October 7th, it's just late 7., so we have really a deadline of October, 2nd or 3rd to come up with a full letter, a full resolution, so maybe frank and I'll come up with the draft and we'll circulate it, and people can comment and then we'll come up with a final draft and then circulate it again, so everybody can sign off on it or not does not make the first crack bird, I'm still on vacation right, you're still on vacation up in Maine, okay. I have no problem with that and one thing on comments which will remind people we have to be. We have to be careful that comments only go to burton me and not the whole committee, because otherwise it turns the whole commenting process into a public meeting, but we'll explain that when we send it out all right thanks for bringing it up, you actually would need to have the letter in if you're going to do it for full board by October 1st, so that we can e- blast it out by October 2nd. We have to get it done before that. Yes, I think we can do it. I mean I'll work on it. The next bite I'll have something to frank by the weekend, so you want to say something. I just have a quick thing: there's something in the chat. That is an interesting idea, just for you know, in terms of enforcement as well and confusion and making sure that there is a lot less, which is making restaurants reservation only. I do not know if that's doable, but it's interesting because you can put all of your sort of you know, rules and how you have to comply when you make the reservation, so you are basically opting in and if you operate and then you and then you do not comply, then it's a lot easier. I think to shut down the conversation about you know you need to leave, we need to call the police etc. So when you make the reservation, you see you have to wear a mask and it's all very clearly stated, and you- and you know- maybe it's one page- that pops up for every restaurant. I do not know, but it's it could be. It's a good idea. I think to think about that you're. Opting in there's no confusion. If you choose to eat here, you know you. It's clearly stated what you have to how you comply. So I thought that was an interesting question yeah. So some restaurants are doing that now. Actually yeah we're done as well and it works out great yeah. All the decent restaurants ask for that. You know okay reservations, but before we forget, do not forget to leave out the unemployment, no, I'm not leaving that out. I have that. Okay, I have that down accommodation for workers who have trepidation about coming back immediately and that they will have access to some kind of unemployment and income support of this meeting. Okay, when we're all done with this, I got two seconds I want to say so. Okay, we had another subject. We have the other subject, which this is the indoor dining christine has suggested a discussion about outdoor dining, the outdoor dining the way it is now tell me if I'm off on this christine, where I understood it we're talking it's it, there's a good chance. It's going to be made certainly extended for another couple of years, if not permanent, okay and what's going to happen in that process going forward. Well, we need to be adding certain kinds of questions on our applications. If, unlike now, where it's an emergency- and it goes to DOT and eventually it becomes normalized the process and goes back to us and then what kind of stipulations would we might add on questions that we might ask applicants, I would like us, if it's okay, to have this discussion next month and then move forward with that. Then, unless you want to throw something in christine lighting, no, I the only thing that I wanted to do is. I think you described very well what I was going to say. The additional comment is like in case the DOT in case the process continues to be outside of our process right. We when we have new restaurants coming in, we can ask them, do you intend to do it and if you intend to do it, are you going to respect those rules because we know they are never going to come in front of us and when they want, they want a license. That's when we have some leverage to negotiate something as we have seen in the past. Therefore we can. We can- and you know there are a whole bunch of things which are already in the guidelines, so we just want to confirm that they understand the guidelines and then there are things which are not in the guidelines. Like the music, I mean we have had frank and Burke know that we have had a running discussion about what is permitted for the music outside and how they do that, and my observation are some way and the reality are some other ways. So I think I think we should we can do that next month. What I'd like to do is just circulate, maybe a draft you know, and then at next month we can have a a substantive discussion. So your draft would be some of your suggestions. What we might want to include as questions right and the way I drafted it is like there are the things which are existing guidelines from DOT or SLA, that we want to remind people, and they are things that the we have already expressed in the CB4 letter that we were in favor. So we want to ask those questions and there are three or four items where we have not taken a position, and I would suggest that we take one okay, so I think we all can with your draft. We could. That would stimulate us to think of. Oh, that's included, but maybe what about this and we'll come back next month and have it on the new business for us again a discussion, because I think we've had a very good discussion right and I'm also getting hungry and because I could see us had going up for another hour on this. I think like we can do it next month. It's just not that time sensitive exactly! I'm also glad we talked about outdoor dining, continuing through December and we'll have that in this resolution as well. Okay did Mike want to say something Mike you wanted to throw something in the last two minutes yeah I did. First of all, we missed you frank at the general meeting we needed another lawyer. I think one more Lord would have done the trick. Maybe would have stayed there for another half hour and made it five hours. In any event, I was harping on people getting their voting sheets done online, and I assume everybody here did that, but sure enough. There were at least five people who have not done that and we ran around again. It took me all day once again, the entire damn to really hear the transcript listening to everything spreadsheets, you name, it was unbelievable, so it took all day again. You know- and some people simply refuse to do this, and I do not understand why so going forward. Janine wants us to make sure that people do it. The night of you know do not wait till tomorrow, the next day the link is down now so that it's okay, but going forward the night of, even if it's late, please but you're, not talking about the committee right, you are talking about the full board, he's talking about the football for the full board yeah, so you know it's. I did all. I did the minutes already. Okay, which is I had to get it out of the way because it was so it was so long or so huge. As you know, it was tough meeting Frank. I must tell you now: I watched a lot of it. Oh you did well there's a trend, there's a transcript that I have. You can download the whole thing just watch it. The last 13 minutes of the meeting is how long it took to to get the votes out that section. It's a separate section, zoom actually made a separate file for the last 13 minutes of the meeting very unusual. You did excellent work. Mike is there? Is there a function of zoom which allows to vote? Yes? There is. I will next time we meet. I will know better because I'm a member of an international Gestalt, Therapy Association, and we were supposed to have our biannual conference in the West of Ireland this coming week. I should have been in Ireland, not here, but so we decided we have to have elections and we have to have like community meetings and discussions and we're doing it all by zoom. It's a 400 member organizations, you know not all 400 people will be there, but at the elections we're going to get 150 or so, and we have a person from it does not matter where he's from we have a person who is familiar. Who does this for other organizations where he has a voting function through Zoom? It's a sister technology that you put in addition to that allows you to do the vote and then Mike and the and others do not have to. You know, run around well. Here's the other thing about zoom, which I you know found out today when I would usually I see the transcript you know when I download it. I get a transcript of all. You know everything is said, and it's pretty good. It's far better than many other transcription services. I did not see it this time. I did the whole bloody minutes without the transcript. Today I had to go back and look and there it was, and it appeared by magic. The whole transcript is there, so it would have taken hours off the job. The question to Nellie is one: are we mandated to do this online vote? Submission I mean. Is that our thing or do we have to do it? Well, I think Michael. You need to talk to to Jesse, because we can't answer anything. No, I know, but I'm just curious. I mean because I asked jess he has not responded. So do you know how to get an answer and nellie if you want to be, I can sneak you into my meeting over the weekend if you want to join and see how the voting goes. Okay, send me the info. If I can join, I will join to see. I will ask Jesse in regards to voting on zoom and what the mandate is for voting. That would save you, make your life easier, Mike and how you resolve, how you resolve discrepancies between how you voice vote and how you fill out your online vote sheet or if you do not submit it, because are you not present, even though you are the public, are you not present, because you did not sign this thing? That does not make sense, they was there's an illegal absence. If they do not vote, they were not, they did not attend, so it goes on their illegal absence records exactly it's separate. It's a separate thing. That's writing! That's how I regard it, but I'm not sure the rules. Okay, I want to thank everybody for being here tonight for the work we did and the discussions we've had and franken I'll do the first draft Frank and I will come up with a second draft and then we'll send it out to you all. Okay, be well good. Everybody. Thank you, Ellie. Thank you. All.",
            "summary": "At a time we ask committee members to comment after the applicant speaks If there are any members of the public who want to speak, let nelly know We have one more committee member, introduce yourself.\nIt was for a small cafe, right next to the very beautiful floral shop that Raul has had in the neighborhood for years, and they wanted to do a cafe and they had applied for a full liquor license and that it was part of their concept.\nI talked some sense into them and we came back the next month with with a beer and wine application, with the understanding always that you know after they've spent some time, they've proved themselves to the community.\nWhat's accelerated, of course, is Covid-19 as its committee's well aware: I'm not going to get into how much that has decimated the industry and Made it even more difficult to do business, but obviously that's a But the applicants feel that, having been in the neighborhood now built this cafe So with that change, aside, we're not making any other changes to the menu to the hours to the very early hours to the nothing else, is changing so happy to answer questions.\nIt looks, sort of like a coffee, shop, bakery type, place, and I was just wondering: Does it change to something else at night or how's it going to work The idea from the beginning from when they first came to?\nYou was that, in addition to the lovely pastry menu and cafe menu that they have, they wanted to have a beer and wine offering You know it's never changed into a like a wine bar sort of scene, late at night.\nIt's, not a bar, we're not going to have like a full bar with the kind of way you'd order coffee in the morning Right exactly that's just technically a bar under the liquor.\nTo kind of you know find out whether that came before this committee, And it was shot down or is there going to be any other space besides the actual, very thin, cafe?\nThe timing that we open is from the cafe, opens from 7:00 A.M to 11 P.M and the store opens from 9:30 to 8 P.M, so we'll never really open until midnight , I like to keep it here, something that the neighborhood can come and have a drink, and you know socialize and things like that, but it was never my goal or my You know my intention to have loud, music or any of those things, I'm, not sure where that rumor came from, because we only had the license to operate.\nThere, and we do know that I think in April of 2018, you had approved 674 ninth avenue, which is right down the block, which was a dry cleaner for a license with a 4, am close.\nInside Their application indicates that they're going to have dancing but Donald- Bob. So this is sort of like the cellar, the ground, floor, little mezzanine, the the rooftop The space in the basement will be what we call like a little event room and things like that.\nSo I know you mentioned that space is not licensed You are because the space that already is licensed will likely be licensed again, so we'll have two instead of one I, think a mcdonald's or a bar, it does not really matter, are any of the Your money.\nSo, the point was, I did not want to say we were not making any money in the basement We're asking for the same exact that we've had before and to that point we have spoken to the landlord, and one of the reasons we are looking to leave is you know it's just a bigger space and in the covered world You know the rents are for that place in our lease.\nSo, there's no question that he's building them above, but the reality and even as the owner who's going to rent the apartments he's like looking You'll, be here anything whoever I rent to will be aware that you're there before we rent , you know it's not like we're being put into a situation where they exist, so Anybody, who comes into eventually rent, would be aware.\nThat's, going to go from 50th street all the way to the to the to the let's say the left side to the far south side of our property of our space.\nI live in a community, I'm really wholeheartedly against this, and a lot of people are also a lot of people in my area have left because of the problems we have with the bars Maybe there's a spot in eighth avenue and stuff like that.\nYou know all sorts of shania immediately from there they're not coming or not, but the reality is this community is And, I, think it's time for them to start moving on, and you know to eighth Avenue at the residential area.\nThere are, you know, moving this bar from one corner to another is not going to solve this issue.\nA police officer might stop by twice three times, maybe in the in multiple years we have a very good relationship with the police department and We absolutely do our initial application that the stipulations have us allow to keep our french doors open until 10 pm every night.\nWe have 61 people that we highlighted in a couple days who signed who are right in their vicinity, including acrosss, the street next door, who are for this application, and it goes back to the same thing.\nLook at this place, they're going to look at our bar and say you know what I want to live.\nMy understanding is that he is requiring adequate, sound proofing to make sure that you know his tenants won't be bothered, but it's sort of one landlord that controls that whole corner, but I'm thinking more indeed about the tenants than the landlord And I'm, just wondering whether there is some treatment that could be done in the front and in the back, and especially in the back, because I presume that's where the bedrooms are to isolate a little bit, the the noise coming from the terrace and bleeding over to that to those buildings.\nWe operate, outdoor, cafe, sidewalk We know the problems that have happened for some bars in that neighborhood.\nSo I just want to let you know that we've done we've been operating through this by the letter of the law like we always have under such heavy scrutiny, so I hope that counts for something I read right.\nWe have two new applications for local licenses number three: We have at 371 West 46th street, that's between 8th and 9th Avenue.\nLooking to open a caribbean restaurant on 46th street, a rather busy stretch of 46th street, which folks on this committee know better than I.\nSo, we're happy to answer questions that the committee has Max, I'm a little confused about what's going on outside, because we do not have any record of there being a sidewalk cafe there previously and my recollection of that block, Is that to extend their outdoor tables they're all within the property line, and no one actually has a sidewalk cafe.\nIf it was a ground stone, wall and And, you could like have one table there You know this is what the city's website says- I, did not actually check the zoning books, which is my sort of my bible on it.\nYou know, vote on a sidewalk cafe until we get DCA plans and see all the instructions and everything does not stop me from asking me Okay, with the outdoor table on the property line.\nSo one day whenever that day is where the mayor's done, extending the the D.O.T program, you know we'll look into it further and If. We think there's a viable small sidewalk cafe we'll come back to you.\nThese are basically just people who are you know in the aisle there's like one drag performer at a time.\nWe talked about live music, not past 12 o'clock and the sidewalk cafe is eliminated for some future date as a separate application right, And they're going to change the answer on the sidewalk obstructions right within that one seat within the property line.\nAlso like the idea of keeping that open, because we do not know what's going to happen in the future.\nThe big problem is that you do not know who is going to go to the restaurant and come back and have it.\nYou know the progress has been giving a little more space to the restaurants, because October is when the outdoor space is going to close.\nI think they need to work on an outdoor plan for the winter, maybe through December, because we with heaters and something maybe it can work for a little while and New York does not get that snowy.\nI mean I'm, not going indoor to a restaurant, but some people might They need to have an outdoor plan along with it, because and as far as the you, know, sanitation and the snow, plowing, etc.\nThey need to have it as a plan, so restaurant owners and bar owners know what their responsibility is.\nWell, I, want to say something about the indoor plan Like upstate is can be 50, but I would not have up 50 in New, York, City,, I, think, third 25 or 30 percent, and just- I also am aware that we have indoor dining it's approved as of October, 1st or October 15th.\nThe restaurants are not going to be inundated with people, right.\nIf I were a waiter or something like that, You know, I'm not going back to work.\nYou know just like unemployment's going to be extended as well.\nThere's just concerns that I have had myself, but I do think that we need to send a letter and do not know how to ask those questions or imply them, but maybe what one do is say in some sort of a fund or something like that, okay, Rob and anger.\nAsk a few questions: have you been out of the country have been out of the city, you know, or have you been in contact with anyone with cobit , I hate to say, but it's like the barbers had to go through worse to sort of kind of do this checklist, You know the people coming in, so you could sit in a chair to get a haircut.\nBecause if we're going to put restaurant workers at risk, you know how do we make sure that everybody who goes into a restaurant is behaving the way that they need to behave?\nIt's people get a little different with alcohol and with the density of this city, operationally, I want to open.\nYou know of a landlord that does that you have to include your landlord and perhaps amend your lease, and maybe things have changed since I was looking for a restaurant years, ago.\nIf they're saying how many tables, how many people you know outside inside, they can also turn around and ask you these questions really quickly.\nI'm sure we'd like to bring back most of their people and considering the amount of restaurants are closed.\nAnd, having you know, like a small poster at the entrance saying you must wear a mask, therefore put the owner of the restaurant in a much better position that if people come in and do not wear a mask, they can call the police- When we were before Covid-19 everybody had clear directions.\nThe city wants to get their money back, they have to start finding people and if it's going to be with police detail Or There's something on law and order about like security, police detail or peace officers or whatever it might be.\nI do not know if that's in the car, but we can include an Ap party, say what would you say: No more than eight people per party I just want to say, upstate, you walk into a restaurant.\nAnd I've noticed in some of these restaurants, I tend to be on the outside, but I've been inside a couple of times that the seating area and the tables very clear separated, and apart not more than like four people at a table because they have you know small tables, not huge party tables.\nOnly seated alcohol, service, I like that service, right,, I, hate to say it, but there's no If I've had my first drink People are people, okay, and that I mean I have a thought which We are all talking about enforcement and who is going to do that?\nAnd, we'll come back next month and have it on the new business for us again, a discussion, because I think we've had a very good discussion right.\nYou know not all 400 people will be there, but at the elections we're going to get 150 or so, and we have a person from it does not matter where he's from Who does this for other organizations where he has a voting function through Zoom?"
        }
    }
}