{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UCEIeUiExox8otkETZFC9DKA",
            "title": "September 2020 General Board Meeting",
            "publishDate": "2020-09-03",
            "shortDescription": "",
            "lengthSeconds": "3:19:49"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "OqlpThvGa7U",
            "fillerWordCount": {
                "uh": 321,
                "um": 603
            },
            "readTimeFullTranscript": "108 min read",
            "readTimeSummary": "15 min read",
            "wordCountFullTranscript": {
                "motion": 43,
                "school": 33,
                "street": 32,
                "information": 31,
                "license": 30,
                "summer": 29,
                "crane": 29,
                "week": 28,
                "project": 26,
                "evening": 24
            },
            "wordCountSummary": {
                "safety": 10,
                "summer": 9,
                "street": 8,
                "business": 8,
                "o'clock": 6,
                "housing": 6,
                "health": 6,
                "home": 6,
                "regards": 6,
                "residents": 5
            },
            "fullTranscript": "Come on hello, okay, hi, Charles, hey everybody, hi John! I'm sure that we're waiting, I see that Cicely Harris has just joined us, so I'm sure we'll be starting momentarily. Our chair has finally joined us. Thank you, chair good evening. Everyone good evening, good evening, good evening, good evening. Sicily, hello, Charles, hello, Hazel, hey Michael, hi, Michael, good, that's good! To hear good evening. Everyone, hey Barbara good evening, hello, hey Hazel, hi Josh, and I think we should give a special round of applause to our beloved Derrick perkinson for all of the great work he did up to and including that March on Washington. I think he's on the call you know. Well, we all plot him. You know yeah all right, go Gary! Thank you! So much charles! Thank you derek! Thank you. Everyone out there for the support and I celebrate. I saw your picture this morning on the on the d.o.e call as well awesome. Thank you yes and congratulations to my sister Jericho, oh, my goodness, Jerick, I'm so proud of you girl! Congratulations on your new role! I wish you well all right. Yeah! That's awesome! Yeah! Congratulations! Incredible! I look forward to working. I had a chance to talk to Marielle just about I guess 25 minutes ago, and I gave you how I praise this girl. Oh thank you. I appreciate it dr Duke, I gave you high praises, so essentially I see we have our friends from the fdny on the call yes fabricio caro. What's that I will have to get off, unfortunately, at 7:30 or about a quarter to eight. I have a call that need a vote for the naacp for me and now, okay, I hope you've seen my material on the school. I've sent it to you on the naacp reopening and remote school sicily. This is Michael Downey. I have a call as well at 7:30 and I may be able to rejoin you by telephone if that's okay, that works thanks, so much go to, can join Bay all right. Thank you, Dr, Dukes and Michael for letting us know no problem. Okay, I think, if shatiki, if you could, let us know how many more folks need to be let in and then we can. We can move on and start the meeting. I think we can start now yeah, I'm letting them in. As I see them appear, okay, so there's no one in the waiting room right now, no one in the waiting room right now. No, okay, awesome! Okay! So I'm going to go ahead and get started. We do have a bit of an agenda tonight, so we definitely want to make sure that we're making use of everyone's time appropriately, so welcome to Community Board tens first meeting of our year. We start in September. We do usually take a break in the summer months of July and August, but this summer we did not. There was a lot going on again. My name is cicely Harris. Just in case I did not mention that the chair of CB10 there was a lot going on that we found it necessary to continue to meet in July and August to continue serving the community. There were. The protesters did to start our March for social justice for criminal justice. Reform for equality and equity did not stop. The pandemic did not stop. So we did not stop this summer, so we were continuing to meet and trying to serve the community through our committees. We did not have our general board meetings, but we did have our committees that were getting out critical information throughout the summer. So I'd like to welcome everyone back. We are virtual and at this point I believe that we will continue to be virtual, probably throughout the rest of the year, but we'll look for guidance from the borough president. I see Athena's on the call, so she'll definitely keep us informed on any changes, but for right now we will remain virtual and so really quickly we're going to call the order meeting to order at 609 P.M we're going to start out with elected officials. I only see Athena right now. Athena did you want to go ahead and speak now? Hi greetings! Everyone! Thank you! So much cicely, the bro president, is actually going to join us, so I'm going to defer to her, but I just wanted to wish everybody a warm welcome back. Thank you. Athena. Do you see any other elected officials that have joined us all right? Cecily is wanting to Shatik had to step out really quick. I do not see any other elected officials. I see a couple board members, so I'll pull them over. Okay. Thank you. Thank you. Thank you all right. So we're going to go ahead and move on. As the elected officials join us throughout the evening, we will give them their two minutes to speak. I know we're virtual, but we're going to still stick with the two minutes. We do have a quite an agenda tonight for presentations. I do not have any, I believe all of the committees will be reporting or saying a few words, so we'll save that until then do we have enough to move into a roll call now, or I will ask for permission to consensus, to do my chair of persons report out of order, there's about I'll, say, 23:22 board members, and this is Kevin Betterman. I'm just curious is Deborah yates here yet or not, it does not seem so. Okay, I know Deborah's coming so we'll just hold off, but we can. We have a special guest tonight very special, some real heroes, local heroes. Here we have people, Fabio Carl are you on. Can you hear us yeah? I can and apologies because I actually have, I think, possibly members from the latter company from the division of battalion, probably using the same registration, because I try to ease it for them because they're working in the field, so you might see my name three times pop up, so they all registered under me. So I'm hoping that that they're all here, I believe some of them might have called in just because the department does not authorize technically zoom for us, but I believe someone some of them might be calling in, but I do see a couple names already here, so I'll allow them to speak because they're pretty much the subject matter: experts on the heroic rescue that happened yesterday. Thank you. Thank you. So I see some fdny folks. I think we just need to unmute them. So they can speak. Is anyone from the battalion or the division on the on the call or from the ladder company I'm from the latter company Brian Quinn from Ladder 30.. Okay, Brian did you want to say a few words and tell us about yesterday, or yesterday yeah, I just you know. I I've only been in Harlem working in Harlem for a short period, and I love the community and I love my firehouse and we train all the time. We want to keep everyone safe. That's our goal and we're always trying to better ourselves, and you know any one of the guys in my firehouse would have done the same thing yesterday. It's not just that's how we train, so I just I'm just happy that I got to help someone and that's it. I do not know so. If anyone does not know there was a fire yesterday at Linux terrace. I believe it was the 16th floor in this near West. 134Th Street. Is that correct? It was for 470 Lenox Avenue, the building 470 Lenox Avenue. Charles, do you want to say a few words about it just to implement folks? That did not know, so I really you know just have to say I am seldom as effusive as I feel right now and I watch that video and I'm just going to tell you that I think Fabicio. I love your humbleness, but that was an amazing. You know just manifestation of the willingness for someone to put their lives on the line for someone who they did not probably know and may never meet again. So I just wanted to make sure that you were and your members of latter 30 and the entire fdny. It reminded me of something unfortunate that I had a ability to witness personally and that was the World trade center. The towers and I saw people who were clinging to the outside of those windows and, ultimately, you know had to leave and that's what I thought and I was so happy when I saw you know someone just come down on the rope or whatever I could not even see the rope, and I said, is he climbing down? You know to help this poor woman and to save her life, and so I think it's important as a community board and as a community. You know just to acknowledge you heroes and I know we have lots of complaints about sometimes city government, but this is one example of what we see can be done when people really care about people. So I just wanted to say thank you on behalf of myself, because I had to turn it off at some point another I was so scared. You know, I said. Oh, my god, you heard all of the people screaming to say no, when that woman went out there, but obviously she was desperate and you guys handle it so well so kudos thumbs up. You know to everything that you've done and I just wanted to say thank you and I'm sure that there are other board members and members of the community who will say the same thing that was amazing, chairman as a resident of Linux terrace, when I heard people screaming from 470 all the way down with all the commotion, I said to my dolman. I happen to be down getting mail. I sit in my door what is going on and they had called from our renting office to tell the dolmans what was going on and I walked up and Charles is correct. I mean the community was out screaming and clapping. It was amazing. Thank you. Thank you. If, if you get a text from so thank you so much for doing for being here today and for letting us have this discussion with you and for all of the wonderful things you do, and I was just able to read a news article about it and just the serendipitousness of you all practicing that rope rescue right prior to going to have to perform it and execute it and to know that it is a very difficult skill and type of rescue. That's rarely used, but you were you all were right on it and so prepared, and we just thank you for all of your work every day for keeping us safe, and I do not know if people say it enough, but you are definitely one of our local heroes that when we are clapping for all those medical professionals, we are also cropping for all those first responders, and I know that it's died down at seven o'clock that people do not do it as much, but we do need to keep that spirit in our heart. Even if we're not clapping at seven, we need to remember everyone who is out there giving their lives for us so very important. So thank you. Thank you. Thank you very much. This is fabricio again, I do not know if the chief or anybody from the division or battalion is on. If you are on. I do not know if you guys want to say a couple words. Thank you firefighter quinn, by the way for your words as well, but I want to do also give an opportunity for the chief or anyone else if they do want to say a couple words I do not know if anybody's on is there anyone in the waiting room, maybe no they're, on they're on the call? Oh, they are okay. I can see the firefighters, oh there's a lieutenant there hi folks, thank you for recognizing Brian. He was. He did a great job yesterday, we're very proud of him. We drill on these types of rescues in case we're. Putting this situation- and you know being prepared, is three quarters of the battle. So we just want to commend him. He did a fantastic job and everybody here is very proud of him. Do not brian good job, Brian Hey thanks guys. Thank you. Thank you. One thing I do want to say also and apologies fabricio from Fdny Community affairs. You know we do want to extend even you know during the time of Covid-19 and the unfortunate reality of things now not being in person or trying to now work remotely. You know fire safety is always a year- round topic and we look forward to working with the Community board and community residents as well. We have transitioned everything virtually so in terms of any presentation or anything. We could work in conjunction with the community board. We'd be more than happy of coordinating it. October is fire prevention month, and it's something that we would like to see within the coming month of stressing that message and potentially working with the board for the uptown community of Harlem, so anything that we can do please count on us. Thank you. Thank you. We definitely will thank you so much. Okay, you all are welcome to stay on. If you like and see the rest of our meeting, we're going to go back to, let's see if there's any elected officials, if not we're going to go ahead, I believe we can have our first roll call now hi Al Taylor, oh hi, Assemblyman, Taylor, Hey, good evening. Everyone wow do you want to say a few words? Oh no, I just came to hang out with you guys just to catch up. It's been an amazing summer. We're here I just can't stress enough the importance of the census. I can't stress enough the importance of voting checking on our neighbors and to continue a big shout out to our sister atkins for the cleanup crew that they've been doing. I think other people now understand their significance. Just I'm just overwhelmed with excitement about what I see happening in CB10 and in our neighborhoods, because we know how to take care of ourselves when others won't. So I'm glad to be here this evening and I'll be around for a while. Thank you. Thank you. It's always good to see you likewise good to see everyone also and for I believe, there's a representative from Congressman SBS office, hi good evening, hi sicily, how hello everyone from the community. I hope everyone is well. I'm Michelle Booker, I'm the deputy district director for Congressman Adrianna Espion. I just would like to share that. The congressman will be having a facebook live next Wednesday from six o'clock. It is going to be having a conversation regarding Covid-19, where we work the successes and how we're going to be moving forward in the fall and also to encourage those who do to take their flu shot. This is you know, overall health precautions. Thank you again. All thank you. Thank you. Are there any other elected officials at this time? That would like to say a few words or a representative of an elected official sure I can talk about a couple things that are coming up in the public advocates office. So on housing, I'm the deputy public advocate for housing and what we have coming up this month is. We are doing another meeting on NYCHA this one night, not just Nigel but affordable housing, but focusing on Nigel we're going to be talking about alternative preservation, strategies, rent to own and other methods to preserve, affordable housing, develop, affordable housing so that folks, who live in our communities can stay in them and so that folks, living in niger could have a better quality of life. We are also very much focused on homelessness and we're going to be having we're going to be doing a series of conversations on and forums on, homelessness, we're going to be doing one a month. The first one is going to be on this month on September 17th at six o'clock in the evening streaming on Facebook on the public advocates page and we're going to be talking to people who are homeless or who have been homeless. It's called homelessness in New York falling through the cracks and we're going to be talking to people so that to give a public face to the people who are falling to the through the cracks, why they're falling through the cracks and not? And it's not because there's something wrong with them. There's something wrong with the system that we operate in so I'll, be sending flyers when they're ready over to Shatek, and I encourage everyone to forward them to their network, to your networks and to tune in that's the September 17th is the homelessness forum falling through the cracks and then on September 27th 22nd in the evening is alternative preservation strategies. Thank you. Thank you. Delcenia for that update, are there any other elected officials at this time? That would like to say a few words hi I'm my name is Jacques. I'm here on behalf of the Manhattan Digital attorney psy vance. I just have a couple of brief updates. One is concerning our Harlem office. Starting this week we resumed operations on a modified schedule so until further notice we're only open for in- person, meetings, in- person, appointments on tuesdays and thursdays from nine to five, but we're still available in providing a full range of services remotely and folks can reach out. Our main number at that I want to 212- 864- 7884 on everyone's radar is to please follow us on twitter and to subscribe to our newsletter just to stay updated on the different things that are happening out of our office. Cy Vance last week wrote in op- ed about broken windows, policing and there's this also postings about how the D.A is addressing the protesters that were arrested back in June, along with highlighting some of our summer programs such as the youth certificate program. That was a phenomenal success for this summer. The last thing I want to mention is our team is trying to get the D.A out there throughout the community more talking to groups engaging with different members. So if you are interested in, you know having conversations with the Da if you're having public safety conversations and then want to include the D.A, please reach out I'll, leave my contact information in the Chat box. Thank you. Thank you. Jacques. I do see Nina Saxon. Do you like to say a few words on behalf comptroller hi? Everyone welcome back in September, so I have two things: one: the New York City Controller Scott Stringer, along with Congress member Esbayad, State Senator, Brian, Benjamin, City, Councilman, Bill, perkins, 125Th, Street, Bid, Barbara askins, a host of a lot of community leaders on 125Th Street, the congressman and the Controller have wrote a letter about the increasing the increasing of too much trash and was trying to get a lot of buy- in from the city to restore some of the funding back to sanitation. It was a great way to talk about more healthy. You know keeping our communities looking well. So if you have any questions or concerns about the letter or about the press conference or how you can help, please contact me and certainly not least, our office, in conjunction with CUNY we're doing a fellowship program which is a paid fellowship. I will put the flyer in to the chat, but I definitely want more people from this district to apply for that fellowship, it's a paid fellowship and it's going to be at the controller's office. Thank you so much and I will be here for the rest of the meeting. Thank you Nina. I do not believe I see anyone else, sicily. Yes, I mean White Island Taylor's office, so just to piggyback off of what the assemblyman said. I do want to announce on his upcoming event this saturday, so that's happening from 12 A.M to 3 P.M at polo grounds and wrangle houses. It is a voter registration and to sign folks up for the census. Please we are emphasizing the census. We need Holland downs, Meaning, Watson Heights counted, and we do know that Washington Heights is definitely getting their numbers up, and I also just wanted to go over some of the things that we've accomplished in the summer and things that are continuing to happen. Our office is currently open, we're on a staggered schedule. We opened around Mid- August, so we're Monday, Wednesday and Friday from 10 A.M to 4 P.M by appointment. Only so we please ask that you call beforehand and I'll put our information in the chat box. We also want just to go over. We had a Covid-19 testing site, along with other local electives at St, Matthews, Baptist Church in central Harlem, on 151St and mccombs. That was the month of June in July. We had polar grounds and wrangle. We had testing sites there for cover 19.. In addition to currently, there is a testing site in Eskimo gardens for Cova 19, and now the flu shot that started in August and now we're incorporating the flu shots for the month of September. No one will be turned away for testing again. Please call our office and also the assemblyman has been promoting the census: promoting voter registration, promoting wearing your mask as well as hand sanitizers with his daily peace walks and that started July 30th with local organizations such as resources who are present and with us, as well as public assets, office and reps from local representatives. All of you present on those peace walks. Overall, we gave 2,000 masks and we gave a thousand hand sanitizers. So it was the assuming men, interacting with the community, making sure that folks had what they needed and staying safe and also just making sure that you know they knew that his office was present and was there to address issues and the last day for the peace walks is September 7th. So, if you'd like to join, I will send you the locations happening for this week and you can, you know, take a walk, engage the community make sure folks of mass hand sanitizers make sure that they register to vote as well as make sure that they have completed the census. So, thank you so much. Thank you. Thank you, Mina. I know that it's been a busy summer for everyone everyone's been out and about doing a lot of initiatives, definitely seeing you and celine taylor out there. So thank you for announcing all those events. Let me see, I do not believe we have any other elected officials. We have Brian Benjamin's office on the line from Brian Benjamin's office. Okay, great shawna go ahead, hey thanks guys! So much so. Thank you. All our office is still working remotely, and so, if people any constituents have any issues or questions, they will leave a message that our office number and then our office would then call them back within 24 hours. Also, thank you all who joined in for our policing event that we had this past these couple of past weekends. On saturdays, we had one on one 15th street, one on 127Th street and one on 51st street and 52nd street, and it was really a success. So thank you all for joining us for that, and also upcoming events that we have going on. We have hope for Harlem event. That's scheduled for Saturday September, the 12th, that's going to be from 12 to 3 P.M and we're going to be giving away grocery events and hot meals, and that's going to be on Saint Nicholas Avenue on 1 street, between 118Th Street and 119Th Street. So that's next, Saturday September, the 12th from 12 to 3 on 118Th Street and 119Th Street and St Nicholas Avenue we're going to be giving away lots of grocery meals, hot package meals, we're going to be giving away baby supplies we're going to be giving away book bags, school supplies and some toiletry items for adults. So please come out for that and also we'll be sending you. Some of you all have already received some of our email blasts that we sent out for that event today. So that's it for me. Thank you, shawna! Thank you and again thank Brian Benjamin's office for the protect the block campaign that a lot of the elected officials and the Community board have adopted. We'll talk about that briefly later, but I just wanted to say that publicly. Why do you have you on the phone? Thank you so much cicely again, Shatik. Is there any other elected official? Let me check, while he's checking, I believe at this time. If we could prepare to do our first roll call, there's no more elected officials enough waiting room. Thank you. Thank you. Kevin Debra. Are you all ready to do the first roll call I'm ready to go if, unless Deborah wants to lead, I think she's joined us, hi Deborah. Yes, I'm here, I'm just pulling up the roll call sheet. Thanks Kevin. I appreciate it yeah. Okay, I do have technical issues. I just want to say before the roll call starts that everybody is muted and please unmute yourself before you speak and that Shatique is going. I do not have. I do not have a visual of the chat room, so Shatika is going to be monitoring the chat to see if there are people who are having problems and they will put that they're here in the chat. So there's no need for everybody to shout out okay. So here we go for the first roll called cicely Harris as a Marquis Harrison President Charles Powell President Joshua Clennan Present Deborah, Yates, President, Kevin, Bitterman, President, Stephanie, Palmer, Stephanie palmer. Excuse me: yeah she's, excused Sorry Honey Abushi Present Omar Arias Omar Arias Abstinent Michelle, Booker, President, Janine, Brown, Blackman she's present in the chat yeah. Thank you, Daniel Clark, Daniel Clark. I want to see Mr Clark, okay, Absent Jamila, Clark Present. Thank you, Christina Curry. Thank you. Karen Dixon President, Michael Downey. I am here. Thank you. Lisa Downey present Hazel dukes present troy gathers he's present. Oh welcome Donna Gill present Deborah Gilliard President family Glee, Stanley Gleaton Stanley, is present in the chat. Thank you Delcinia Glover present. Thank you, George Herrell President. Thank you, Karen Horey Present. Thank you. Victoria Horsford Victoria is present in the chat. Thank you. Charles Johnson Charles Johnson Absent Sapphire Man Safiya man not present in the chat. Thank you tamara Martin not present in the chat. Thank you Crystal Mckay Pleasant. Thank you. Camaria Milford, president, in the chat. Thank you. Thomas more Thomas is not present in the Chat Mari Moss not present in the chat. Thank you, Lashonda Myers President. Thank you. Barbara Nelson love it thank you. Africa owes present. Thank you derek Perkinson, good evening, good evening. Everyone present thank you. Nadine Pinkett, nadine Pinkett, not present in the Chat Jennifer Prince Present. Thank you. Stacy Ramos not present in the chat, Tiffany Reeves, I'm here. Thank you, Milan Reed, I'm not pronouncing that! No, you did it. Milan present Milan Jericho Richardson Present. Thank you. Aisha Romney not present in the Chat Cheryl Smith Present Shadow Smith, Present, Keith Taylor, not present in the Chat Chanel Washington Present. Thank you, marcus Wilson, President, Terry, Wisdom President. Thank you. Thank you chair. We have Quorum. Thank you, Debra, okay, we're going to move on to the minutes. Adoption the June 2020 minutes. You all should have received those in your email. I know there were a lot of emails today, so I apologize about that, but you all should have received the June 2020 emails minutes. So Deborah did you want to do the minutes? Adoption? Yes, can I get a motion to accept the minutes. Motion minutes is this for June or the this is for June. This is for June. We did not have a general did. We have a general board meeting in August. No, we did not have a general board meeting in August Kevin. Sorry, I meant executive meeting a minute. Sorry continue! No we're I'm asking for. We need a second except the minutes for June, so I have a second. Can I have a motion to accept by common consent, so move any discussion, hello? Yes, I do not know. Yes, I do not see the June minutes. They were in the email that was sent out by Juanita. Okay, I just did not see them. I see the executive minutes for yeah. I just have not seen them I'll check in. Thank you, okay and karen. We will note if you see them and read them and you have a concern. Just let me know okay, so we will. There has not been any discussion, so we will accept the minutes by common consent. So can I have a motion to accept the Agenda Michelle Booker, so move? Can I have a motion to accept the agenda by common consent? No, I move that we accept the motion by common consent, the minutes by common consent, the agenda by communication agenda by common consent. Thank you. Any discussion and the motion carries yes. I remember Tamara Martin just joined the call okay, so you want me to change her to be present. Okay, thank you. So it has been so moved and carried so the agenda and the minutes have been accepted. Chair. Okay, thank you, Deborah, okay, so we're just go ahead with my report. I'll try to keep it very brief. There's we did a lot this summer we were very busy, like I said before. I want to make sure that everyone knows how busy the chairs of the board were the committee chairs continuing to meet over the summer. I know we may have missed a few committee meetings, but the diligence and the fortitude to push on throughout everything going on and to be of service to the community. I thank you for that. Also in my role as chair, I was able to go to a lot of other meetings. One very important issue that I know is on everyone's hearts and minds is the uptick in violence in our area, and it's been going on for several months now and we've been out there for several months with street corner resources, the elected officials warm cure, violence groups have come together and are trying in many ways to combat what we see outside. We do also depend on our politicians to combat like some of the real issues that are there and that's economics. That's a conversation for another time, but at the same time it's this conversation and it's the thing that will really get to the cure violence and all of us on these street corners. We can't really get to the real problem until we address the disparities in economics in the community, so we were out there with street corner resources occupying the corner with Assemblyman Al Taylor, Manhattan Bro, president Gail Brewer, I know, as dickens was out there as well councilman Elias dickens. We were out there, I believe at least four to five times this summer and many times more than that with street Corner Reese's talking to the to the young people, we were at the mayor's meeting that they had for the young people at the community center here off of Lenox Avenue. So it was. We were constantly out there constantly trying to address the issues that are so plaguing our community right now we passed out masks at a lot of these impromptu parties that we've been seeing popping up over the summer that we want to not say that we are behind in supporting the impromptu parties. But if they're going to happen, they have to be safe. We can't ignore the effect that Kovan 19 has had on our community and if we continue to do practices that are not safe, it will continue to proliferate and harm our community. So we were out there passing out, masks passing out hand sanitizer, giving out thermometers as we received them. We would pass them out, so it was it's important for us to be there and I believe we were throughout the summer. I wanted to also just one more time: Thank Brian, Benjamin and Shauna and Christina, and a lot of the community members Larry Blackman for getting together and doing the protect your street campaign. It started a month ago, a month and a half ago, all the politicians have signed off on it. It's a good neighbor policy. It's what we want to see in our community and acrosss community boards. All of uptown has signed off on it all the uptown community boards are part of it. It's about looking out for one another. We can't ignore the talk of police, slow downs and things like that. But in many cases when the government starts to pull back, we have to step forward and that's definitely what the protect your block campaign is about. So there's been open streets separated apart from the open street restaurant thing, which we will talk about during the transportation report, but there have been open street campaigns where we have been at 115th at 117th partnering, with fcbc faith leaders to bring programming and real programming to those streets. So there's been divine nine organizations out there doing step, shows and practices and just being involved in a socially distanced way with our young people just being there and showing them that we do care. Also, you will hear from Committee Board member Karen Orry and her reports from parks about our effort with the exonerated five initiative. Yes, sorry about that, the exonerated five we will definitely we've had a lot of due diligence around that. I want to publicly thank Karen Orry and the Parks Committee for their diligence for having those walks for having those conversations, not just in the committee meetings but outside talking to the parks, Department and really pushing it forward of what we want to see, not what they want to see. But what really reflects our community? What really we want to put out there and actually bringing in those folks that in most effects and talking about disenfranchisement and all those things will be a part of what is manifested through the CB10 initiative around exonerated five? I also wanted to thank the health committee for all that they're doing or they're talking about sanitation, which has been extremely vital to our community, but also addressing the nursing home issue that we've had and we'll hear from Dr dukes on that and finally again, I'd want to thank Barbara Askins and their cleanup team on 125Th Street. For starting this initiative, CB10 will be taking a roll, so next Tuesday we will be taking a roll, because it's every Tuesday starting at 8 am that everyone needs to get out on their block and start cleaning. So that's all I have. If you have any questions again, my name is cicely Harris. I will put my information in the chat so that anyone can contact me in the community if they have questions. Okay, that wraps up the chairpersons report we're going to move on to the district manager Shatik Mitchell good evening. Everyone I'm! I do not know if you can see my picture or not, but I'm clicking off my camera on and off, and I do not see anything on my end. So if you do not see me, I apologize. This seems to be some type of difficulties with the camera anyhow good evening. Everyone, my name, is Shatek Mitchell district manager of Manhattan, community ward, 10. hope everyone was able to enjoy this summer as much as possible. During these tumultuous times. I might want to commend our community board members for working over the summer as well, by holding their zoom meetings online also want to thank our community assistant, Miss Juanita Anderson for all of our hard work, because there's a lot of correspondence that needs to go out and they can be a tough job trying to keep up with everything. So thank you for that. Yesterday, Education Committee members, Deborah Yates Stephanie Palmer Crystal Mccann. I we packed 250 school bags to be distributed next Saturday September 12th from 10 A.M to 2 P.M for school, our children in our district. It was a lot of work, a lot of supplies and a lot of boxes that we had to go through, but we got through it and we're looking forward to a great event so make sure you bring the kids out to receive their free school supplies. We will also be joined by street corner resources and Harlem park the park, and we will also be raffling off two laptops on my way home from the office yesterday after we, you know packed up the book bags and everything I started receiving calls about a young man who had been shot and killed on Malcolm, X, Boulevard in front of the Wells Fargo between 124Th and 125Th Street, and his name was Jayvon Bradley. He was only 28 years old witnesses. There said that Jayvon allegedly tried to chase a drug dealer off of the street and he was fatally shot in the neck in broad daylight, just after 3 P.M. At this point, we do not have all of the details, but I look forward to following up with the 28th present in regards to issues at this location in particular, as well as issues that have been a continued nuisance to residents around a phillip, Randolph Square on 116Th Street in regards to public safety, drugs and drug trafficking. Our district service cabinet does not meet over the summer months, so I have been addressing the constituent issues on my end and I look forward to bringing these issues back to the service cabinet. This September when we reconvene in two weeks throughout the summer months, we have seen many issues in our community around gun, violence, drug enforcement, noise and sanitation concerns, and I hope that, even with the reduction in the city's budget that we can come together to work towards fixing the most pressing issues and complaints on a brighter note, I'm happy to report that, after many months of trying to get NYPD to start Pac to stop parking in front of the bus stop in front of Psa 6 on Frederick Douglas Boulevard, the mayor's office finally intervened. So after for at least two years residents have pointed out, NYPD vehicles that appeared to be parked illegally. I'm at the M10 bus stop at 147 in Frederick douglass cars were blocking the bus stop and it made it nearly impossible and totally unsafe for our elderly and disabled community to board the buses. I invited representatives from Psa 6, as well as the mayor's office to our district service cabinet meetings, as well as sent emails and letters from constituent complaints. Finally, the community voices were heard by way of a news reporter who asked the mayor about it during his daily Covid-19 briefing. I want to thank the community members who spoke up and expressed their unhappiness with the situation and continued logging in at 3- 1- 1 complaints. It's just a shame that it had to go on for so long with the residents being inconvenienced. Last month, roughly a hundred thousand Con Edisonison customers in New York remain without power, which was the second largest storm- related outage and Con Edison's history only second to Hurricane Sandy in 2012.. Fortunately, I only received one complaint about a power outage in our district. However, much of the damage that had been existed had occurred in our local parks, specifically saint Nicholas Morningside and Jackie Robinson Park. Were there a lot of downed trees and debris that had broken gates, barriers and struck playground equipment, as of today, it looks like most of the cleaning has been done, but I look forward to receiving an update from park soon. Speaking of parks, I received numerous complaints about parties that happened over the weekend at Colonel Young park, as well as Jackie Robinson from the videos and photos that I saw. Many people left food items. Some people left whole grills. Amongst other things. All we can do is urge our community to clean up after themselves, we reached out to Parks Department and advised us. They advised us that they had limited staff and it was really hard to clean up the mess from the previous night in June, the city cut 106 million dollars from the sanitation, Department's budget, reducing pickup for public litter baskets by 60. In response to that, many constituents and community organizations have started the Harlem Cleanup initiative like cicely mentioned earlier. Some of the organizations are 125Th Street bid in blocka, the darnst brook properties, owners and residents and association, and the a phillip, Randolph Square Neighborhood alliance. Last week, myself, along with board members, Deneen Brown, Blackman and Joshua Clennan towards small businesses in our district with Manhattan bro president Gail Brewer and uptown director, Athena Moore handing out face, masks and hand sanitizers and getting feedback from business owners all the way from 130Th Street down 112th street from Malcolm X to Frederick Douglass. It was a good opportunity to speak with the small business owners and hear from them about their struggles during the pandemic and to offer support. And finally, I just want to remind everyone that our district needs statement. Submissions are due on October 30th for the New board members who are not familiar with the process I'll be sending out some helpful information from the Department of City planning this week, and these statements can help amplify our communities, evolving needs and budget priorities to the city's agencies. That applies as it applies to capital and expense budgets. That concludes my report. Thank you, chair, thank you, Shatik and, as you and juanita are still virtual. We thank you for all the work that you've done to keep us up and running. I do not know when you'll be returning back to the office, but thank you for I, just all that you've been doing throughout the pandemic. So thank you for that. Welcome, okay, we're going to move into our committee reports. However, I just wanted to make one quick announcement, so a little bit of I guess clarification. So we would normally at this time, be talking about elections that will happen in November, so I was able to attend a presentation by the Parliamentary Association of New York that was put on by the Manhattan presence office and they told us a little bit about how elections should occur and they're going to be a little bit different since we're in a virtual situation. So we are looking into our options. I believe that one board has already successfully done a virtual election and that's CB1, so we I talked to Adele, who is the Manhattan-, born president's general counsel for ideas and suggestions of how we will do it. We will get the information from CB1 and we will have a meeting. I will send that out as soon as we get that information from CB1 to the board members, so that you can look at it. Along with your options, we will have a meeting to discuss those options and decide how we would like to proceed for the November elections, so I just wanted to let you all know that we are moving towards that and we did not forget, but we are looking towards options of how we will have that. Okay, all right- and you all can ask me any questions about that. If you need to offline okay, we're going to go ahead and get into our committee reports, arts and culture George Harrell George was on the call I'm looking to see if he's still here yeah. I do not see him, so you may want to move on. Okay, we'll move on Echo Dev. Yes, I'm here good evening, everyone good evening, so we do have a few liquor license in one second, so the first one, the first one, the information was sent to you guys with a form that they submit to, along with their SLA 30-day notice. I believe Juanita sent it out to the board because we have to vote on all these liquor license. These were the ones that submitted it to the forum, so these are the ones that came Acrosss, Echo Dev. I do not know if you guys know, but it's not a vote anymore. It's an opinion. It's always been an unofficial vote. The official vote comes out of the General Board meeting, so you guys will be voting on these tonight. So I'm just going to name them, so you guys can pull them up in your emails and take a look at the information before you vote. So one that we will be voting on is Eighth Avenue, Social Club, the next one is ponte Bistro hold on next. One is hot pot under the tree. All right give me a second. The next one is ruby: vintage Harlem, hookah, Chipotle, Mexican Grill paint and pour neighborhood brule Harlem Alley House, and that's pretty much it. So those are the liquor license that came before us. We tried to create a process that would help them move forward, as some of them were in danger of losing their license without a waiver. So I set the form around throughout the summer to try to get an opinion so that the chair would be able to have something to base her decision on in terms of giving waivers. So that's what we'll be voting on today also, I know you guys seen a lot of the articles in terms of the Covid-19 violations. We did to speak about that. We also held two watch and discuss sessions. One was well attended and one was not the one on Mark 125, I believe, is going to be rescheduled after we find out what I believe economic. I forget, what which organization it is that's supposed to be holding it sicily, but I was told to put those on hope until we have a discussion with them. So for those of you who are interested in the Mart 125Th Street conversation, there is a conversation that needs to happen prior to us, get rescheduling another watch and discuss and that's pretty much it for the summer voting items or echoed it. Thank you, Chanel, okay and we'll get into the substance of those during the presentation of voting items: okay, health and human. Okay. I believe sorry before we move on to health and Human services, I believe our Manhattan bro president Gail Brewer has joined us. I am, but I can go ahead and wait and listen. I'm fine on time. So go ahead with your wonderful important committees. Thank you. Thank you for getting education. Do not forget education. Sorry, Deborah! Go ahead! Deborah hi, I'm Deborah, Yates, I'm chair of the education, youth and libraries Committee during the summer I set in on lots of zoom meetings regarding reopening this morning. The borough president had a wonderful meeting on the reopening. A lot of questions were answered. I took lots of notes, I'm in the process of typing that out up and we'll send it out. Also during the Exec board meeting last month, we did decide that we would do a letter to add our voice to to our thoughts about the reopening. I have prepared a draft and sent that over to Marquis and we are working on that. Secondly, last year Board year, the committee decided to do a back to school event this year, and so I just want to commend shatek for getting all of the items ordered before the end of the board year, June 30th, even though he was going out on vacation, so he ordered everything that we needed. He did mention that we met in the office the other day myself and two of the committee members to stuff those bags. He also mentioned that I reached out to some partners- and I should say, cool is partnering with us. She's bringing book bags as well as Harlem Park to Park is also bringing book bags. Silicone Harlem is donating 500 thermometers and we will be raffling off two laptops with information regarding all that follow. It will be on Saturday September 12th between 11 starting at 11 until all the bags are gone. Thank you. Thank you deborah we're going to go ahead and move on to health and human services. Thank you very much. I want to put on records and thank three of the persons from well all of the health committee, but especially Vice Chair Michelle, Booker, Karen, Dixon and Dr Smith for really putting together our proposal to the Harlem nursing home after the complaints that we have received, and you know the number of deaths that was happening. I also want to thank the borough, President Office, for also weighing in with us on this situation there. Since that time, our district manager, Shetty wrote a letter on our behalf sent the letter on our behalf to the new executive director when we first met. I think he had been on for two days and was not aware of all the problems, and so it was over a month when we did not hear from them and we made contact again. Our district manager made contact again and they have sent over names to us for the people. They want to keep the advisory board to 10 people. I've said to them no way that we at least have to have 12, so we will make a decision at our meeting on September 18th what we will accept and what we will be putting forth. As you know, the deltas have been working there for many years at the hospital providing service, and so most certainly they we will see that they remain there and be a part of the advisory committee. So we will have a report for you at the executive committee in September, so we can present it to the general member members in at our October meeting Madam Chair. Thank you Dr Dukes, I believe is that all your of your report? Yes, I want to thank Barbara asking again for this. Continuing cleaning, Harlem she's really been just a trooper out there because of my operation. I was not able to be there as often as I would like to, but I did get involved in this. The block restoring our blocks. Thank you. Thank you. We're going to go ahead. I believe Sheryl Smith had a quick announcement about something going on her blog. Thank you, Madam Chair. Thank you. Madam Chair, I just wanted to make us aware of health initiative really community- wide, because there are three community fridges within our district now, one on 120Th, Street One on 116Th Street and one on 151St Street. I believe- and these community fridge is a new concept, at least for New York, where in our particular case we only have fresh food meats, vegetables in the refrigerators and it's completely free and it's really helping people supplement their meals or create a meal. So no pantry items and from the likes of what we're seeing here, it has been really a true service to the community, and I know 116Th Street. The community garden supports that particular fridge and they found the same thing. So it's something that we need to be aware of, and also we may see more and more of this happening in our community and it's a true service to all residents, not just homeless residents. Thank you, Dr Smith and thank you. Dr dukes for the health report. We're going going to go ahead and move on to transportation, historic preservation and landmarks. I've been chairing that committee, so we just have a couple of announcements at our next meeting. We will be joined by rebel, so if anyone remembers Revel, they are the little scooters that have been zipping up and down the street for a little while they were suspended due to a lot of safety concerns, so I believe that they have been giving the yellow or green light to move ahead and come back. So we want to talk about. You know. You know what happened before and the safety precautions that they're going to be taking now, as they have been permissioned to given permission to start operating again, so that will be on the agenda for the transportation next transportation meeting, hey they're, already back yeah. I just want to jump in real quick, so I just want to let you know that Revel took the scooters off of the streets voluntarily, so they were not shut down by the city. They just wanted to come back with better practices, because there were two fatalities within a week, so they were trying to. You know, assess the situation and come back better. Okay, thank you for that clarification. That's really important, but thank you for that clarification, but they will be at our meeting to talk about what their new plan is. I know they were at one of the borough board meetings and a lot of the Community Board chairs did have a lot of concerns about the operating and even the safety precautions or the lack of lessons that are given for the people that are writing them. So we are going to raise those concerns again at that meeting on Tuesday. I also wanted to address the open streets, so we at one of our last meetings. I think it was June we had FDBA come and talk about their proposal for and that's Frederick Douglass Boulevard Alliance come and talk about their proposal for open streets to open the streets for the restaurant to start serving beyond the parking lane. So that means shutting down Frederick Douglas Boulevard for a weekend up until October to allow the restaurants to go into the street. So we did a walk through with the borough president, some elections, officials were there a lot of some community members. We did a walk through with FDBA and I believe that was in June or early July to look at what that might look like. Since then we had not heard anything, but there was a press release last Thursday or Friday. I believe that said the mayor did approve them, so the Community board did not have a any real say in this final determination. So we are not exactly sure of what it will look like. I did receive a email that contained a map that had a kind of rendition of what they believe it will look like. So just for us to have a little bit more information, I did receive an email from DOT. I contacted them right away as the m10, which is one of our most traveled buses, is on that street. So we were concerned about what that might look like for emergency vehicles, parking and public transportation, so that shutdown will take place from on Friday, starting at five o'clock till eleven o'clock, Saturday from 12 P.M to 11, P.M and Sunday from I believe it's 12 P.M to 11 P.M, that's going to be from 1:12 to 1 20th. The cross streets will be open, but 8th avenue will be shut down. There will be a 15 foot way or our open lane for emergency vehicles to traverse back and forth, but that is what we know right now. There should be signs asking cars not to park Friday through Sunday. They should be coming up right now. They should be putting them up now, if not now or first thing tomorrow morning, and I believe NYPD right now is not towing or ticketing people right now for not moving their cars, Friday, Saturday and Sunday. That's the information that we have now. I do not believe I do not know if there's any questions or concerns about that, but definitely we'll be talking about this at transportation. This is they were approved last week, but this is the first weekend that is actually supposed to be happening. That they've talked to the businesses and the barricades will be up starting at four o'clock on Friday. Okay, that's all I have for transportation. We will move on to housing. Charles, do you have done nude myself, I'm sorry good evening, everyone! So a couple of things I like the theme of what most people are saying and acknowledging the fact that this summer, I think during the Covid-19 pandemic. You know it really called upon us to recognize who our partners are. So I'm grateful for the borough president's office and all of what she's done in keeping us informed her daily reports and now weekly reports, and you know, of course, the things that are coming from the mayor's office. So you know I like the fact that you know we're acknowledging you know the work that we've done with each other, because it's all about you know our collectively working to survive this pandemic. So just a few things one. I want to acknowledge something that I think the housing committee has not paid proper attention to and we intend to do so. Chanel Washington has been talking about the issue of appraisals and the you know disparate impact on communities of color. You know, there's been some vindication of things that she's been talking about for years. You know recently you've seen the reports in the New York Times and you know and other major newspapers. So our housing committee will commit itself to really digging in and using. You know the inspiration from Chanel and her instigation, as we all know that Chanel can instigate. You know and that's a good thing to really deal with this issue of appraisals that affects you, know private homeowners. It affects so many. You know others developers and others. So we're going to focus very much on that. You know we're grateful for you know. You know Donna Gill and Gregory Baggett for over this period of the pandemic, as many of us are concerned about displacement and evictions, and what happens when we really do not have any real permanent protections. You know for those you know, residents who may in fact be. You know suffering. You know from you know: loss of job and loss of employment and therefore the risk of lost homes. So thank you Donna for that great forum that you held and we had a lot of great legal advice and that's something that we have to still maintain some intentionality. We joined with Brian Benjamin to discuss. You know what New York state has done for rent stabilized tenants. You know the rental relief, I'm sure many of you I did you know, applies for as a rent, stabilized tenant. You know that rent belief, you know it was just, I think, a small measure. You know it was not rent forgiveness which we'd like to have seen, but maybe that was a little too progressive, madame Borough president, but you know, but we need to look at. You know the reality that without forgiveness, we're going to have massive displacement, but we were appreciative. You know we're appreciative of Michelle, Booker and Congressman espion for all of what they have done in that heroes act. You know that has simply not found its way through the Senate and we know there's a lot of great protections in there, for you know, for people in housing, as well as small business owners and others, and that is simply you know been stalled politically so, but we're thankful. You know that we've seen at least what could be possible. You know if we have the right people in elected, you know office and lastly, you know we are very cognizant about the importance and value of our hdfcs. So you know I'm going to be looking Donna, you know and what used to be when I first chaired the housing committee, and that was we had an Hcfc subcommittee. I think we would have to create some subcommittees and some working committees subcommittees. You know this year and Hcfc would be. You know one of them that pretty much are the few things that we have on our wish list and just grateful for those who have decided to honor us by being a member of the housing committee and we look forward to having a great year. Thank you, Charles, going to move on to land use Lisa Downing Lisa. Can you hear me yes now? I can hear you? Okay, should I start from the beginning? Okay, yes, yeah, sorry good evening, everyone, I hope everyone had a good summer. We're excited to be back and I look forward to working with my land use team. This fall. This department of city planning opened back up, August, 3rd and they've started reviewing applications that were already in the pipeline and they will start reviewing Europe applications, September 14th, so certifications have already begun. Some of our applicants, who presented before the committee before Covid-19 will be coming back. This fall for a formal review process, namely lamore development company and the Malcolm shabazz Harlem Plaza on 116th, in addition to the traditional applications that we'll be reviewing this fall. We also want to have a panel series on the development process where we bring city agencies to come together to discuss different aspects of development. So you have a fuller picture of what it takes to build a building, and also we've been talking for some time now about a construction panel that we'd like to for residents to be aware of what happens in construction. What are their rights issues of air quality concerns about asthma and high communities that are at high health risk? Tonight we have a brief presentation from the more development group who's at who have come to us asking for a letter of support for their project on 126Th Street. It's a 37 unit, mixed use, affordable housing project. Some of you remember it was the Mandela Gardens. They won the RFP and have moved forward. They are requesting to start the construction at 7:00. A.M they've always already received two letters of support from two of the schools in the area, so we're talking about the North East Corner, pretty much of 8Th Avenue and 126Th Street a little a little west of the apollo, not a high a high traffic area from going east to West, but not a lot of density in the immediate area with respect to residences and businesses do not open till 10 or later. So we wanted to share this information with you to for you to answer any questions that you may have. We have the project manager from more realty on the in the zoom conversation with us tonight and I'll ask him to come forward. You'll, see in the background a picture of the proposed development site. It's beautiful! It's affordable, we're talking about 36, affordable housing units which have rents, ranging in affordability, from 30 to 90 of AMI and there'll, be a commercial space on the ground floor along with community facility. Karma. Are you available? I do not know. Maybe he was not able to get access. What's the what's? The person's name Lisa Karma from Lamar Development Kamar- excuse me Kamar, come on hold up, give me one. Second, they may be in the way down Kamar. I see him good evening. Everyone can you hear me yes, perfect. So, as Lisa mentioned, thank Lisa for the introduction, as Lisa mentioned, this project is developed by two mb developers, which are the more development and apex building. So in this moment we already have the permit to start at 9:00 A.M to 6 P.M right. We have already the letters of acceptance for the schools stating that we can start at 7 A.M. So we only when we inquire to DOT to request this permit the extension for the special hours they requested for you as a community board to approval. So we have all the steps prior this before we come to you to ask this favor. Thank you. Does anyone question Community board members? I actually have a question so have you this is Cheryl Smith. Have you reached out to resonance in the immediate community? I know that you've had you have letters of support from the schools, but what about the residents? That may be sleeping at that hour or so have you reached out to have any letters of support from them? We do not have any letter of support from them. We've been talking to some of the residents as HPD buildings. That is next to us, the funeral home, the one, but we have some license agreements, but not all the blog. To be honest, so the majority of the site of the blog we've been talking to them and they know- and they already see us working as we have all the license agreements with them, but not all the whole black until 1 25th. If you can envision the site, I do not know how far the building extends backward. There may be a few brown stones on 127 street and then the NYCHA housing sets back into the block. So there's a bit of distance, whereas the construction won't be on top of residents. It's not really. Otherwise, it's not a densely populated area for residential. This is marquis. When you say you have a letter to the school who, from the schools, we got one second here: the democracy, prep endurance, middle School, signed it by Katherine Perez and for Harriet Topman signed by Elizabeth Jarrett and those letters say what, though, that we're going to start at 7 A.M. So, okay, I do not know if those are going to be here with us, I'm just I'm wondering why a principal is signing a letter to say that she's. Ok, I do not know because the school does not open at 7 A.M. I do not know why that even directly influences, but I guess I'm concerned about residents who, because a lot of people working remote students are working remote and things of that nature starting earlier, I'm not, and we do not really have any gauge of the community either. At this point it seems like in regards to what they're saying so. I would be concerned that if we have not heard from the community in regards to tenants, no matter how few or just to hear some voice, that we have people who are working, you know because they work from home. They may be sleeping later, students, and I mean we do not. I do not know how loud this construction might be, so I really would be concerned not to hear any voices from the community and I would be curious to know what the letter of the support the principles wrote just to see. What, if you allow me, we can you please give access to Jovana she's in the meeting also she's from the construction team. So she can answer that question and just so you know we have the letters on file in the office. Oh the letters from the principles. Yes, two principles: yeah. Can we get all these documents emailed? Because, usually you know we get this to review and advance to the meeting yeah we have everything we can send it to you. I can send it to Lisa right away. I believe he's talking to the Community Committee chair. Usually when we have a voting item. We do get these documents so the weekend review, especially working remotely, it would be a disadvantage to us to not have seen what was submitted and what the plan is. It's. I have a really quick question: Mr Senior, could you tell us and you've? Probably this is probably in your documents, but you said the affordability is between 30 and 70 of AMI. Could you tell us how what the percentage of it, what the percentage of units within those affordability bands are sure so nine units we are talking about in thirty percent four units, forty percent thirteen unit, 60 and 10 units 90, okay- and these- and this is per these- are permanent. These are permanent, affordable, correct, okay, rinse stabilized. Thank you. I just sent the letter to I just emailed the letter to all the board members. Okay, perfect, can you add also Jovana to the to the conversation she can answer any other question that you may have she's in the waiting room. I think I'm on. Can you hear me? Okay, yes, you're wrong. This is Donna Gill. What is the justification for starting at 7? Am the crane setup takes a while to be able to start erection? So when we start at 7, am we start to mantle the crane get it set up? Get the road closed, prepare the flagmen for the pedestrians set up all the barricades. So by the time we really do start to erect steel or plank or any other items that we need to erect. It takes like about two hours later, so we're really starting to erect like around nine o'clock, and we want to be done earlier rather than later, because you do have a lot of more people on the road later on during the day, especially in that area. How much earlier do you think you'll be stopping? We have to just start dismantling the Korean at least an hour and a half to two hours before we need to stop our permit is until six o'clock, so we normally start dismantling around 4 30.. So that's 11 hours a day, correct! That's a lot! The issue is that, if the school's open, if the school opens up, we are only allowed to work from nine to two. So we're trying to capture the time that the school is closed, to be able to get as much plank up into the building. So we have less disruption to the school and what length of time is this early startup going to last? For how long is it anticipated that the 7 A.M would start up would be would continue? I believe we requested 12 months, but in the 12 months your one sweet top off the building, which I would think that would be in the next we're going to the second floor now and it's eight stories. So that's about a floor a week I would say another eight weeks to top off and then after that, you're probably going to have a crane here and there maybe once a week or twice a week for the 12 month period. Well, I hear us talking about school opening, but I do not hear anything in regards to the safety, because, from my understanding I believe the schools will be open a few days of the week for certain students. So I'd like more discussion on how you plan to deal with the safety of the students coming and going how of the hours that you're actually going to be in use of the crane, how it will impact the school and I'm with Marquis. I do not think any principal can sign off on any type of it's okay to make noise. I think that that's something that needs to go to the Community Board to the Department of Education New York, State Department of Education there's more to it, so I'm not sure, which is why I ask that some of the documents that were received, not just your letter or letters that you received, but the complete package is something that we would need to view in light of Kovic. In response to your comment, D.O.T rule will request a letter from the actual school. That's on the block. Individual letters are needed from every business school surrounding the construction site. We had to get one from the funeral home. We had to get one from the schools, but now we have to get one from the Community board in order to start at that time. We do not have your letter from the funeral home on file. Could you make sure you provide that infor that letter to us sure the letters? It's good, that you got a letter from the funeral home, but the funeral is the funeral home affected at 7 am in the morning as much as the tenants are the rest of the people, even though on the, even though, if your store or school is not affected, it's the letter is still required by DOT or we will not get permits to start work and in response to Mrs Nelson's question about the safety we have to have flagmen on site at all times during constru crane operations, and we also have something. That's called pedestrian managers that have to be some set up during the time that you have create crane operations. So we'll have all that in place before erecting with the crane, and this is why it takes so long to set up a crane. You have to set up a lot of stuff. You have to set up the flagmen, the barricades everything Giovanni. I think if you gave us the justification ladder as to why all these things are needed, it may be a little easier to you know conceptualize what's going on and it might be easier for people to agree to have you start at seven o'clock because in essence, you're not really starting construction at seven o'clock, you're prepping to start at nine o'clock, yeah correct! But are you also closing the street two hours earlier at seven? Instead of nine? Would it be a street closure? Yes, there will be a street closure and that's a concern, because we do not have many concerns in the west direction outside of 125Th street, which is always congested anyway. So and once I do not know about the rest of the board members. But in reference to the conversation I do not think we should just say approve, we should say in light of just examining it for approval or disapproval. No, I think we need to get all this in writing. First, because we can't everything. You're saying sounds good, but we can't hold you to accountable for this. If we do not have this all in writing in detail, I know your whole plan for construction when you're going to start this that and third, how many black people you're going to have. We need to see all that. You know upfront in writing so that we can review that and then vote and make a decision. Oh, and it makes sense we could put it in writing no problem mike. My concern is that you, a part of the dot's requirements, is that there's like they want every entity or the entities in the that community right to speak and give you a lot of support. So you come to the community board, but we do not live directly in that area. So I think it would be really helpful too. If we hear some voices from the people, the few residents and tenants that live in that area, because you have the school, you have the funeral home, the business, the school and they're now they're coming to the community board. If we sign off on a letter that we have not heard from the community, I think that that's not appropriate. So I really think it might be really helpful that we hear some community voice to make sure that they would be fine with a street closure, and then you know what I guess. The reason why I was okay with the nine o'clock is that students are already in the school buildings. At that point, you would now be interacting with students on their way to school, so right so students. I know you have you know people there, but that school's, particularly elementary School Harriet Tubman school. So you know you. I just think that there are more risk when you open when you start this construction earlier. So I definitely would want to hear you know a little bit more during school hours when school's in session. No matter what letter we have we're not allowed to start before 9 a.m. So if there's, if schools, if there's class in session, let's say on a Monday, we have to wait for 9:00 A.M, and sometimes we even have to wait for all the school buses to finish boarding. So if those school buses have not finished boarding, 10 A.M, we can not set up the crane. So also is the street going to be closed for the 12 months from nine two to six or seven to a seven to six, a hundred only on a day that we will need crane, because 126Th Street is a it's a main thoroughfare from 125Th. So that's really an important block to have the clothes all day. No, and it's only on a crane like, for example, this week we had one green day, so we had a crane there one time this week next week will be the same thing. But when you have one, it all depends on the type of work that's being performed on that week, whether they're laying foundation or putting in planks or having to put big obstacles on the different floors. So it changes from week to week, depending on what aspect of the construction they're working on correct. Our goal is to get the cream out of there as fast as possible. We do not want to have the cream there for too long one. It costs a lot of money. Two, it not only affects you, but it affects us because it's very expensive, it's not a cheap item, so the faster we build, the building, the faster we get the crane out of there. The better it is that's true, excuse me, is it inconvenience to the community and that's how and that's our main concern to have the street closed for weeks at a time you know in a day when that's a busy time of the day going from east to West, and you do not know what time when it's going to close, that's amazing. We have to get one of the questions in the chat is how many crane days are projected for the 12-month period right now we have like I mentioned before. We have, I would say another, eight to ten weeks to top off this building in those eight to ten weeks, you're going to have a crane day a week. Probably that would be eight crane days or ten more crane days to finish with the crane gilvana. We are heading into our winter months. So will you be continuing the use based on the in climate, whether that's inspected, expected, and is it possible that the dates that you project you'll be utilizing the crane that you can notify the community ahead of time? We have to post a sign two weeks prior to the crane being on site, so you'll see a road close and we'll say the date that the road will be closed two weeks prior for us setting up the crane and we'll also say the hours that it'll be closed. Yes, it says the hours it'll say the date and the hours it's a orange sign with black lettering and you'll see it. The other block is Frederick Douglass and I think it's Adam Clinton powell you'll see it you'll see it on Adam Clinton power because we have to post it. At least a block before you reach the area where the crane is going to be so, the cars will be directed to 127Th Street, to go acrosss repeat that, I'm sorry, the cars will be directed to go Acrosss 127Th Street. Yes, they could either use 127 for 125.. I would just like to interject another reason to jump start. This project is be and take advantage of the Victoria Theater delay, which is going to be comprised of 191 units, so we definitely want to get this building up and out of people's way before another mass of residents start moving in on the block further east and again, I think they originally stated that the reason that they want to open an hour earlier is to just get a jump start on the project. Well, while we are still in a Covid-19 mode, and will this be Monday through Friday has the weekend been suggested at any point for the cranes to be utilized, so it does not disenfranchise the community the residents the children going to and from school we could get permits for a saturday. We do not do we try not to do Queens on sundays for religious reasons, so on a saturday we might use the crane, for example, if during the week we have really bad weather and there's snow and rain, and we can't get a crane day in we'll use that Saturday to use the crane. So what I'm really asking? Is it possible since you're telling us it's going to be 12 months that you may possibly use this? You only use it one time a day. Why is not Saturday the option to be used? No, that's what I'm saying Saturday is an option, but it depends on where the work falls. So we have to take weather into account right, but that what I'm actually saying Javan excuse me for continuing the conversation, but if we're only going to use the crane one day a week, why are we projecting Monday through Friday, as opposed to just Saturday we're projecting Monday through Saturday? But, yes, we could use saturdays as well. Thank you, you're welcome. Thank you. Okay. I think we're going to move on from the conversation right now. Thank you. I think we had a really good discussion. I do believe that we do need to take some time to look at the documents that were recently sent. I believe also that we are asking for the developer to give us something in writing that lays out what exactly this might look like. Maybe a potential schedule and the reasons why the change in time is needed, something written out. It is a potential voting item for today we will consider it under the voting items. If there is, as the board knows, it, there's an option also, if there is unreadiness, so we can look at it through the through that lens as well. Okay, thank you. We will have it by tomorrow. No I'm done! Thank you, colleagues, okay parks and recreation Karen. Are you ready? Yes, I am good evening. Everyone I'd just like to welcome the New Board New committee members, I'm looking forward to working with you and- and I just want to let you teach know that I sent a a letter to him if he could share it with regards to Clemson University. It's been a very busy summer for our committee and we got a lot done. So it's hard to I'm going to be trying to be as brief as I possibly can. I just wanted to say shout out to the Jackie Robinson parks without borders project it was completed. We were one of five parks that was selected for that, so that has been completed and I'd like to and then shout out to monumental women. The statue for honoring Sojourner, Truth, Susan, B, Anthony, K, B Stanton and the women's suffrage movement was was completed and it was it's a beautiful, magnificent monument. I suggest everyone go there and see it. It's also is interactive. You can download from an app and you can hear voices of famous actresses, such as Meryl Streep, Zoe Saldana Audio problems. No, I said I think it's yours, you're breaking up with Karen is not suspecting to. I should continue yes, okay, I'm sorry about that Barbara. So I was able to attend that unveiling ceremony. The keynote speaker was former Secretary of state hillary Clinton, and it was just phenomenal to see a project that took so many years to come to fruition. It was just magnificent and it's the first monument dedicated to real women in central park. We also during over the summer, had discussions with seneca village a central park conservancy regarding Seneca village. We are going to be talking about permanency of some sort of commemoration. It may not be what is in existence right now, but the exhibit that is in existence. Right now is going to be extended due to the Covid-19 situation. We're excited to hear that the colonel young playground, all field renovations, are slated to continue. We are waiting to hear from parks exactly what the details are. We do know that the cow cal ripken foundation was involved with that. So we're waiting to hear for those from for those details. It will be fantastic because it will upgrade the ball field so that it's multi- disciplinary for soccer, Lacrossse, baseball football and just give youth in the area options as to the different types of sports. They can play and engage them more in the park. Let's see what else we have been, we also had a meeting with the Parks Department and the mayor's office on Waterfront and resiliency, and we are still able to have input into any suggestions that we might have for the for waterfront development and anything in terms of resiliency. So that would be the Harlem river waterfront vision, 2020 plan. So please we'll try to get out get a survey or, if you just, the community, would like to weigh in just send information into the office as to what they'd like to see in terms of waterfront activities to be suggested for this plan and please call into the office and and make your recommendations known, there's also opportunity to still weigh in on the brownfield repurposing project at 280. We are still able to do that. We have been making tremendous project progress on the exonerated five exhibit which we are working towards, having placed in central Park. Tomorrow evening I will be meeting with community Board 11 to make a presentation and I've, and we and the committee has done outreach to the other surrounding boards as well. We did hear back from. I believe it was five or seven that we also heard back from so we're still doing that outreach to the surrounding boards, but we had, we were very extremely busy. Over the summer we had three subcommittee, I'm sorry, two subcommittee meetings and three community outreach public discussion panels. So out of those, we got a tremendous amount of information from those panel discussions and we were joined by just wonderful, panelists monumental women, the innocence project I mean I could just go on and on and each of the panelists brought a wealth of information to the to the project. We, the first meeting we had, we were able to kind of break out into like a small character, small character groups, so we had more feedback in that respect from the community. The last two panel discussions were just panelists speaking and the Q&A, but we had a wealth of information out of that out of those panel discussions. We also had a conference call. I had a conference call with sicily, the mayor's office and central Park Conservancy and New York, City parks and they're very interested. They asked us to develop a statement of objectives and goals which we are completing and we had input from the innocence project. Ademola look Bifola artist and we were really fascinated to have Sarah burns participate, she's, the filmmaker of the Central Park Conservancy, I'm sorry the Central Park five documentary, so she has collaborated with us on the statement of objectives and goals and we'll be providing an educational component to whatever we are doing or and with respect to the exhibit. So that statement of objectives going to be sent out for the committee to review and and and give their input, and then we can send it on to New York City parks, the mayor's office and whoever else we need to send it to. We've had tremendous support from the world president, so I've got noise going by. I may have to just stop for a moment I'd like to thank the borough president for all of her wonderful support. We would not have been able to do the discussion panels without her support, so thank you so very much for madame for President, okay, and so that brings us to the last issue here, which is Clemson University. During the summer I was able to attend the Congress for New Urbanism conference, which is which was virtual and the Congress for new urbanism advocates for the restructuring of public policy and development practices to support neighborhoods that should to support neighborhood diversity and supports communities which are designed for pedestrian and transit. I'm sorry, I have another vehicle going by I'm sorry, so the Congress for new urbanism deals with urban planners around the country and even and internationally, as well with respect to best practices in urban Tech tactical development, meaning how we deal with open spaces and communities. So I'm as a result of my attending this conference, I met a professor from Clemson University, who did a workshop, and she is director of a master's program of resilient urban design. So she has graduate students that are interested in working with us in our areas sitting down with community residents and developing plans to address issues that we have in our community. I thought it would be great if they could talk to us and work with us with around our parks and Covid-19 strategies to make our parks safer and even open spaces open streets as well. So this it's a it's a program, there's no charge to us. As the community board. There would be a memorandum of understanding that would be developed once the university has an approval as well so they're looking for an approval from us, they're looking for our interest and then they would then the professor will then go to the university and get approval to engage the graduate students in this project. So it's it would be very much like the charrettes that we have in parks Department, where we have the community come in. They sit with the architects and engineers from the New York City, Parks Department, and then they did. They developed plans around what the community would like to see in the parks. So I just thought that it was something I came acrosss. I thought it was a great idea. I thought you could bring it back. I could bring it back to the community and be a benefit to the community, especially in light of what's happening with Colvin 19 and the difficulties we're having in park the parks and our open space areas at this time. So I think that basically sums up what was discussed. It was passed unanimously, we're not. We had a consensus project to the executive committee, so at the meeting our exec at our committee meeting, we did not have Quorum. So that's why we moved it on to Executive. Committee Executive Committee advised us to bring it before the report, so it's an opportunity for community board 10 to get the assistance of graduate students in developing plans to, as our committee sees it, to develop strategies to cope with the Covid-19 situation to make our open space areas safer. Thank you. Thank you, Karen welcome, and if there are any questions, yes, so we're going to take some questions out, there's any questions, because that is a voting item. The Clenson Free program is a voting item for us tonight. Okay, I do not see any questions. Joshua and Karen. Forgive me if you mentioned this already, but is there any like specific parks or areas that they're looking to you know base this study around Hey Phillip Randolph is very interested in it. They've been having ongoing issues with their area, they did have funding which was designated for renovations, but because of the cobit 19 budget and budget cuts. Their project has been reduced in scope, so what a Philip Randolph would definitely be one, and then we could select two others which we have not done at this point. Is there any criteria that goes into that selection process? We would develop that we have not done that as yet. Okay are there any questions? You said this would all be virtual. They would not actually be coming here to visit the park. That's correct. It would be done virtually through zoom meetings or whatever video conferencing applications are out there, but it would be remote. Would they require the parts that participate, people to sort of go in the parks and take photos and send it to them? They might request that and that would be a possibility that we also have the map apps that can zoom in, and you can see things up close that way as well. Okay, are there any other questions? Okay, yeah! This is terry wisdom. Can you hear me? Yes, go ahead, Terry hi, yes, structurally, once they get started, how would be, how would they be working? Have they identified the kinds of things that they would be doing with the parks and how would they be working with us or would they be working? You know independently, I'm just not really conceptually understanding how they would be working and what the outcome and results would be. So I do not know if we know that at this point or it's a developmental thing, I'm just trying to really understand yes. Well, it would involve the community, so they would not be working independently. They would be taking sitting down in zoom meetings with or whatever the video conference format is, and they would be speaking with the community about what they see as issues in the community, and then they would begin to talk about applying strategies to address those issues. So if it's signage, if it's suggesting that say the adult athletic equipment, be moved further away from the children's playground or things different like that, but they would we would have to work in conjunction with New York city parks as well, so that they make are low, can be low- tech and affordable so and these students would have access you know, they'll. Do the research and they'll look at best practices in other areas that have similar demographics or geographic geography to ours? Okay, so would the with the Parks Department, with the Park Committee of the Community Board and the community board, be like a direct liaison for whatever they're doing and like guiding, and you know just kind of overseeing so to speak. That's my I'm just trying to understand the process. Yes, I think that it would be a Parks, Committee oversight project. We would like to collaborate with other committees as well. Thank you. Okay. Are there any other questions about the Clemson project? Okay, we're going to go ahead and move on to public safety. Thank you. Thank you Karen. I do not know if Charles Johnson was able to join us, so I do not think he's on, but I was able to chair the last public safety meeting in his absence. We did have a conversation that I believe will continue. It's one that we've had before about the substance abuse clinics on the on 124Th Street. We had a group, I think it was the Harlem greater Holland coalition came and addressed some issues that they saw and we're continuing to see being a public safety issue, continuing that we had this conversation before last year with health and Human services, where Dr Dukes led a charge. The issue never went away. In fact it's gotten probably considerably worse due to the pandemic, so we will have that conversation and I believe, at the next meeting we will have a another conversation and bring in some critical parties to that conversation to continue that discussion. So that was our last discussion on at public safety. Are there any questions or concerns suggestions about that? I see Barbara asking this on the call as well. I know she has been greatly involved in a lot of conversations so either you can speak now, barbara, if you want, or we can invite you to our next public safety meeting, to continue that conversation. Well, I do want to come to the next public safety reading. I just wanted to bring to everybody's attention that burglaries at night have increased on 125Th street people going into the stores. Victoria's Secret was robbed last night. One of the things that's happening is the business owners, and this should be Harlem wide, like they have cameras, but a lot of the images are not good and the police can not there's nothing for them to work with and if the images are not good, even if they prosecute somebody, my understanding is the Da's office may or may not accept it, and so we also are having more shoplifting, but this time it's, the shoplifting is more from the people that are hanging out on the streets and they're. Very aggressive to where store owners are starting to pair up their sales people, so what we're doing now is trying to have a zoom meeting, and probably the chair of public safety should be a part of this with the commanding officer and the business owners on the street, because what we see is that this is not going to change and more communication and people working together is probably going to be the only route we could go. So we have requested a date for September 15th at 11:30. I'm waiting for the commanding officer to respond to that date, and hopefully the invitation will go out, Thursday or Friday, so Shatik and sicily, if there are others from the community board. That would like to be a part of this conversation. Please get me to eat their emails right away, so I can send the invite. That's it right now. Thank you Barbara! Thank you for that, and we definitely want to be a part of that conversation. So before we move, we already basically had a presentation of voting items. We can, if anyone has any questions specifically about those restaurants that have come before us. Please prepare those questions before we move into our vote. Did Madame Bro president want to speak now, Madame Bro, President you're on you anyway. Thank you very much Madam Chair and I want to say hanging out with your teeth. It's such a pleasure. So we did the small business call as you heard, and you know giving out the PPE, but you know there's no question that it's hard to keep afloat. People were concerned about random inspections concerned about the birth of funding for small business, and you know, as melba has stated in her op- ed. There is a concern about indoor dining I'm on the governor's recovery task force. I have a feeling that's going to come as an announcement something fairly soon, but it's very hard on the businesses. I do not need to tell you that, and I love going on the walk with you Madam chair on Frederick Douglass. That was a business alliance, but I too were surprised when it showed up on the mayor's list. So but I guess it's successful. Everything is challenging in today's world. Second thing I want to mention, I know we're sick of the census, but we only have a month to go so we've done a lot of walks. The each borough president got from the Governor Empire State development, actually some funding very late to give to nonprofits to work in underserved communities and thanks to Deputy Board President Alvin Burnia. We got it out. I do not even know if the other board presidents have gotten the money out yet, but we got it out quickly and we've been in, for instance, this week in Washington Heights at nine different events on the street, trying to get people to sign up number one number: two: we've got the listing from the board of elections as to who has left the city and where they are, and so we are now sending a letter to the Census Bureau to 35,000 new yorkers they're, not living where they're you know permanently where they are. Hopefully they will resend refill out the census with their New York City address, but there are 35,000 of them. That's just those who filled out requesting a ballot during the primary third thing we did was. We did send 140,000 postcards a month ago and more recently to those census tracts that are under that are not responding in a comprehensive way. It's not surprising to me just to give you I know in my head. East Harlem is at 62 response and each side is at 51, so uptown is doing much better. You're, no surprise to you, then financial, district, Tribeca and the east side, because of this not being in New York. So we have we're all trying on many levels we're on the lower East side today doing a census, walk and Harlem has done this over and over and over again number two. We did a lot of letters this week, one of them police barricades. I do not know how many we went to every single police station in the borough and we love NYPD, but when they close off the street, it's very hard for residents and I understand securing the building but the whole street. It's a challenge so we'll see you at NYPD. They will not like my letter. You'll get a copy of it. Just went out today and we'll see what happens in terms of response. I do think it's too much. That's my opinion. We all we see this with shatik and everyone, small businesses being vacant. It's just a huge challenge. We just did a survey of all the vacancies on Broadway and we will be doing more surveys. I do not know the answer, but I do know that we've got to think about it. At least we have the data. We also are very concerned about the nonprofits, the state and the city. If you have, if you run a nonprofit- and there are people on the zoom tonight who do your indirect rate costs is, are horrendous. You do not get paid enough for the work that you do to start with, and then you get absolutely other things. We got all five borough presidents to sign a letter to the mayor, saying you've got to pay the indirect rate cost of these nonprofits. I must say it's going to happen, but insurers health should and the state does the same thing in terms of schools. I want to thank the chair of the education committee for participating today, but we did have all the boards and all the cecs and about 70 people with the executive superintendent. We did it before we're going to do it again. So many questions we had questions before it must have been a hundred, and I do not know ten questions in the chat just for this morning. There are lots of issues I appreciate the timing is September 21 and not September 10 in terms of opening, but just one example were devices they're only 20,000 left at DOE. That's it. There are no way. Are our children in Harlem going to get a device period, and even if you do turns out, I thought Nitro was the challenge in terms of bandwidth. No, it's the shelters. Apparently anyway, it's a mess. That's just a piece and the schools are going to be open, apparently five days a week, but you could go twice a week to the school and three times a week to a learning center and you might even end up being all virtual. I do not know neither do the parents neither do the schools, it's a big house. That's all the devices are an issue, the issue of weather. We just sent a letter today for those schools that want a street closed near them and I'm sure some do but every time as we heard earlier from Karen every time an ambulance goes by a motorcycle goes by and you're outdoors and you're learning. That's a challenge too. There's a lot of challenges. So I just without getting into a lot of specifics and questions, any questions that anybody has. We will work with the executive superintendent and try to get them answered. I did learn. We were surprised that supposedly the department of sanitation is going to pick up the organics at the schools. The thing about that is, the organics were never properly put into the bins at the school, so I do not know how that's going to work, but that also came up I'm a big supporter of the regional enrichment centers, which have been taking place at nine schools in Manhattan since the beginning of covent, but it's too bad they're going to end. We should just do Rex and then we would have been much better shape. That's my opinion in terms of thank you very much Karen for joining us for the unveiling of the monumental women. I will say it took me another seven years. I hope it does not take you Karen that amount of time to get through the Central Park five Statue and I would be glad to help in any way hell would be the word we went through and I hope you will not go through the same. So anything we can do to help. We would be glad to go so forth. You won't get told no. I want to just thank Athena Moore for going to the landmark in Washington. I did was not able to get there, but I know how fabulous it was and she sent lots and lots of fabulous pictures along the way the african- American Day parade is my favorite parade. I hate that it's going to. I know it's going to be virtual. I know we'll be fine, but I'm very sorry because it is my favorite parade in terms of walking through the parade, and you do not have to hit the mayor on one side and the governor on the other side to get through because usually on the other friends, they walk and they take up all the space. I do want to thank Senator Benjamin to be doing the protect the block campaign. It's really important to kind of take over blocks that the community know between book bags and food and support and census and voter registration that there is a lot of support for that community and just in general, whether we heard earlier about the refrigerators and the mutual aid or just people on 146Th, Street and Seventh Avenue a couple of days ago on the weekend, giving out food and masks and census material. The volunteerism and the goodness in Harlem is equal to none. And I just want to thank you. I think we continue to work with fresh direct every single day, Monday to Friday from the top of Manhattan at eichmann, all the way to buladic and all the Harlem developments in between. We will be doing that until the end of September. I know that the city picked up the fresh direct contract. I assume it'll end then we do not know, but we assume- and I do think that people would like to appreciate it. The leaders of NYCHA have stepped up like none others in terms of the Ta, to make sure that it's not easy. You get these huge heavy pallets of food and yeah a need, a lot of volunteers. To get it to the seniors and b. You have to figure out where it is going to go, because it's not enough for everybody and the leadership of making that Happen has been phenomenal. We're going to try to also work on some farm, fresh food to Randolph and Wadley and grant and Manhattanville. We hope also, as time goes on, to have some youth markets. But we'll talk more about that, I'm not going to talk about the homeless, because I'm up to here with it with other parts of Manhattan, we need to have a further discussion with all the community boards to figure out what to do, because it's a non-, stop complaint and it's got pros and cons in terms of legal aid. The city agencies, those who are doing outreach, hotels, methadone, we've got to have another discussion, and I want to thank, certainly Barbara Askin for her initiative on so many ways. That's just one more example, I know she's working to try to figure out think out about the vendors and really and congratulations. I know his grandparents dave. I do not mention Doris Williams will kill me and it is September 9th and I always love working with her. Thank you very much. I appreciate your time. Madam Chair, thank you. Madame Borough president. You always give such great announcements and keep us all informed about everything going on. Thank you. I especially appreciate everything that you're doing around education so really important. We're going to go ahead and move on to our presentation of voting items. A lot of them you have already had a chance to see you should have gotten them in your packet. A lot of these are again like the chair of Echo Dev said these SLA new applications and renewals came to us over the summer. They were discussed in echo dev. Some of them were discussed at Ec, but we do as a full board need to vote on them just as part of the process. So is there any questions or a discussion that needs to be had on those or any questions that Chanel can answer? Can I just ask a question around Harlem hookah? I know there had initially been some problems with it. Have those problems been resolved, there was noise issues, people hanging around. Are they still having those problems or are they? Are they? Okay? So I've added shatek and juanita to please check noise complaints and also Covid-19 complaints when folks are applying. So that is, I believe, they're getting that data from open data, and so when I send out the opinion form, I usually send it out and there's a note that says you know whether they had complaints or not. So I believe they had no complaints. So thank you now I have a question in regards to the hook alone. Has anyone done any research on the impact on their health? I believe they're targeting a large youth population. You know our future leaders our future. Our future is at stake and many of the people like young people, I see just sitting out on the sidewalks doing Hookah. So do we really need a allowance for them to smoke or whatever it is that they're doing so, you saying they should smoke in the street? No, I'm not saying they should smoke at all. I'm just saying that it does exist. So are we going to designate a place for them to just do this? Well, I do know so on the forums when I send it out. So as soon as I get, they upload the form to the drive, I send out an opinion form to the committee. I give three to seven days three days if it's a renewal, seven days if it's a new application and then I also asked whether the committee would like to see them come before. Us neighborhood Brulee came before us and Ruby vintage. Those were the only two that came before us this summer, so we did not have a chance to dive in the questions that you see in the questionnaire were there before I became chair, I just put it in a form format, so that folks can fill it out on their own time, but that's pretty much what has happened. So if the committee does not vote to see the applicant come before us, we do not have that opportunity to question them. Best address Barbara's question directly, I think as well. I know. Maybe it was two years ago we had. I think it was echo, definitely honestly, not sure whether it was echo death or the health committee had discussions about Hookah specifically, and I think it may be a good time for us to revisit the health concerns as around Hookah. I know, maybe about six months ago we also presented something about cigarette smoking and the committee. The board did not support the resolution that we that we presented that we presented, but I do think that it's something that we should address in terms of our young people in particular, but it is not necessarily just for young people and there are a significant amount of cultural aspects to hookah as well. I would suggest that we have them come before the committee so that we can go ahead and you know try to get those things addressed. I do not think it's just just to. I think this is completely separate from. I think, that's what I'm addressing is actually very separate in terms of the health concern versus the specific establishment. So I just want to make sure we split that up, because I do not yeah that's a very different thing than the actual health concern of Hookah itself and I'm going to throw in tobacco in there. I know I'm melding the two and they're two separate things, but I would like us to actually have that discussion. So thank you, Barbara for bringing that up. This is Smith. Oh, I was going to say that I agree with Dr Smith in regards to, I think, they're very two different discussions. You know, and I think questions around hooker smoking is- are very important, just not relevant necessary to this liquor license. But I think that you know I can say someone when we first discussed this business. I was very supportive of it. I've gone and supported them. It's a black owned business. I have not heard any problems. I have not heard any. You know I see and I've gone many times have not been a very long time, but I see very positive and good things there. So I would not want to hold up something because I do think that's a bigger concern, but the reality was too was when we discussed that liquor license is that there are hooker. Smoking is a big thing in New, York, City and there's very few establishments here in Harlem. That would permit that. So I was very happy to be able to go somewhere in your own community versus having to go to Astoria, Washington, Heights or further downtown. So I actually think it's still a good thing that we have for those people who do enjoy Hookah, it's a good option and it's a good and it has not had any problems as a business. Do you smoke Hugo Marquis? I do I mean that's not that that's not relevant again. Yes, I do. No, I just echo that as a young person on this board, I'm not a smoker. I do not smoke anything, but I will indulge in some hookah every now and then occasionally- and this is really the only spot that we have in Harlem and it is the black owned business. I think it's a business that we should support, because people are going to do this anyway. People can drive up to dikeman. They can go downtown, lower East side and go to Astoria Brooklyn wherever they want to do if they want to so forget, the health risks forget the health risks we should. We just want to be cool. Like everybody else forget the health list. No, I mean there's a helper but you're not going to be able to stop people from participating in it unless we're talking about higher public policy, where you want to ban Hookah establishments in New, York City, but realistically speaking, like Marquis, said, this has nothing to do with the liquor license and secondly, even if we do not permit a establishment like this to open up in our community, people in our community are going to go to other communities and spend their dollars and still do it anyway. Let them kill yourself with us. I agree with you: okay, we're going to go ahead and move. I believe, Kevin had one more comment. Yeah there was one I was not sure if we could move on to another petitioner for the paint and poor in particular. Are there any other comments about the Hookah bar? No okay, just a point, a couple points of clarification on the ping poor location. I believe this license is for a patio license. It's not for the renewal for their existing license. At least that's what the application seems to indicate. I just want to get clarification on that before I go further. They should not be filling out a SLA application for a patio, because patio is checked on their application and their current license appears to be valid until 2022.. That's the first question, but there's a second layer to the question. The only reason why I asked it because I believe that's a renewed, so I do not know how we would be renewing a patio license. Well I'll go on to my second layer of questions. I noticed that the petitioner co- owner cited that there have been no complaints with the establishment of the last two years. However, I know personally, of complaints that have been filed that have been registered with the District Office Department, of Sanitation building management and within the community, and if it is in fact a permit to continue to expand their operation to the patio, I think there are some questions about their capacity and their care for the building and sanitation. That may not be directly related to the liquor license per se. But there are some questions and complaints and I think, even violations that have been filed for the establishment and two. This is one of the locations that on Frederick Douglas Boulevard has had, I believe, some questions around just social distancing, not so much under the leadership of the organization. But the fact that this is a timed entrance location where groups of people sign up for two hour blocks of time for painting instruction eating and drinking. There is kind of a mass arrival and mass exodus and there's a lot of congestion that happens on Frederick Douglas Boulevard at this location. I know residents in that building have expressed concern and I and I- and I am just surprised to see the owner of the establishment clearly stating in the Google form that no complaints have been filed or issues have been raised when I know that to not be the case, so I asked the staff to check those complaints and they came back to me saying that there were no complaints and I was not told that any complaints came into the district office, otherwise they would have been attached. So I'm not sure what to say about that. Since I would not know the complaints are there unless the staff is able to retrieve that. So I do not know have you received any complaints? We just need to look into it. I agree: okay, wait, so he can have possibly try to look into that yeah, because there were also issues with sanitation, both trash being stored inside the establishment trash not being picked up on the streets for multiple days even into a week at some points, and these were all registered with department of sanitation and the district managers out at the district office. So I again, those may not be related to the liquor license, but it is an indication that the establishment may have some capacity issues, especially if they're expanding their operations to the patio secondary would be my concerns about the group arrivals on the boulevard for these time sessions and how the establishment is managing guests as they leave as they stay on the boulevard. You know, I think, as residents and people in the neighbor and in the neighborhood we're thrilled to see the arrival of this establishment, because it's a great alternative to the wine and beer and restaurants on Federated Rice Boulevard, it's another form of activity. It is doing well in our community, but there are some management concerns and I would have hoped to have seen that addressed honestly in their petition and again, when I see that there are no complaints filed, that's not the case. So those are my comments noted so and just for clarification, it is a. It is a renewal for the liquor license. I just looked at the application. They did check sidewalk cafe because they're saying that's a licensed outdoor area where they're serving, but that's only through the cove, with open streets program from what I it is. I know yep so and that in full disclosure that went through, as we know, without a lot of community input and without anything yeah. So I just, I believe, there's another establishment on eighth Avenue, at least by name of the petitioning company. I can't remember where the location is, but I just I do raise a flag of caution as we're looking at what's happening on the boulevard right now. We are in support of our businesses, we're grateful that they're reopening, but there are some legit capacity safety concerns that should be taken into consideration. I feel along the boulevard. We want our restaurants and businesses to thrive, but not all these establishments have gone through the proper process of seeking community input posting for sidewalk cafes and this particular petition caught my eye. Okay, thanks Kevin. I know that we were also concerned. I know these sidewalk cafes are permitted until the end of October. These they have now. We did raise a question as to whether or not going forward since they were given this reprieve. To have this now would they have to again apply for go through the official sidewalk cafe petition through Echo Dev, so we have not received any information as to whether or not this is going to be kind of like a temporary permanent thing, or will we revert back to the official process as a community board? We are asking that the mayor Revert back to the official process of going through letting getting community input, because those these sidewalk cafes as they are usually are not up to the standard code that we would ask for in a permanent sidewalk cafe, so just to put that out there. We are looking into that and we do not know the future of what the sidewalk cafe licenses will look like, and then I would caution the check mark on the application that this is a sidewalk cafe if they have not been issued one properly. I would exercise caution before moving forward on that petition. Okay and again just for full disclosure. This, I think it expired. June 30th of 2020, so they could have already gotten it, so we might be just doing this in a vacuum yeah we do have to. We want to go on record for it, though yeah, because, according to the SLA site, it appears that it's good through 2022, so that may be the case yeah it's already gotten approved. So thank you for hearing my comments and concerns. Okay, thank you, and you know we've done this before. If we do have issues with any of these licenses, even though they've been approved or renewed, we can write a letter and voice our opinion, because that's what that's, what we're doing right now with this vote, even though it's already been approved, we're going to go ahead and vote. Okay are there any! The other thing is that everyone is not on the echo Depth committee, so everyone did not get a chance to hear or when these licenses came through. So I think that if there is an issue, we probably can do a follow- up, okay, good all right. Are there any other concerns? If not, we will move into our second roll call. So, and just so, I can clarify a little bit about how we're going to do this. I know everybody's eyes are real big right now about all these voting items that we have, but what we wanted to do is try a different kind of process that a couple of other boards have done. So the second roll call we'll just go through as usual, and then we will entertain a motion for each. However, each will be done by a common consent, so we'll go through getting the motion get it properly. Second, and then we can say all in favor everyone all in favor any opposed now. This is the key piece any opposed. So if someone is opposed to one of these applications or opposed to the project that we're voting on today, you have to unmute and put it on the record, not that just to say that you're opposed just that's it. You do not have to say why or anything like that, because that's how we'll note the oppositions? Okay, does anyone have any questions again? You do not have to give a reason why you oppose, but we're just cutting the roll call out for every vote. That's it that's, basically how we're done and I've that's how we saw another board, do it and it works, and it was very efficient, so we're trying to do it here. Does anyone have any questions about that questions or concerns before we start, especially, my question is so when are we going to do it like in a group? Are we going to do each voting item individually, it'll be each voting item individually, so we will entertain a motion for this 8th, Avenue, Social club and then it'll be moved and properly seconded all in favor any opposed, and that's when you can either raise your hand or unmute yourself, and then we can move to the next one to raise your opposition. So here's a question the same way. We do the minutes and the agenda. Yes, if you have, I mean, if you have a bunch of voices that say they oppose, are not you going to have to count them. We are so that's what we can do is we can say if you're opposed put it in the chat and and we could do it the same way, we did the roll call in the beginning. If you're opposed put it in the chat and equal. Let me know, and you can do it vocally as well, but we will we'll do it vocally as well, and we will note it does. It does have to be vocal, but you can put it in the chat just in case if anyone's having issues, but we will not move on until all of those are recorded. So just say if Deborah said Nay, then Deborah will say you know and then we'll, if you just make sure that your vote is noted, and then we move on also, obviously there's a feature that on the participants list we could use, we should be using this more effectively for raise your hand right. So if we were saying, if someone's in opposition, all they have to do is press raise your hand as I'm doing right now, that blue hand comes up so for opposition members could simply, and you need to lower your hand, so raise your hand lower your it might be. I can't I can't excuse me I'll be in the chat as well, so I can see the hand raised as well. Okay, look. I do not think I saw marquises, everyone just presses participants at the bottom of their screen. They'll then see the side screen that says participants and then on under participants. It says, raise your hand they erase I've raised my hand just now lower you know. Yeah, can I just say that we there was some legal issues in terms of doing anything other than a voice vote, so just want to put that out there, because you know I got dragged for a voice vote so we'll make sure it's going to be a voice vote, but I think that it's best, if we put if we put it in the chat at least we can verbally say it, and then we can physically see it to make sure that everyone's hand is called upon yes and that their vote has been recorded. One question can somebody say when the email went out with the packet with these voting items, I can't seem to find it was today all of these came out today, so they were emailed to us today. Yes, thank you. So there's a couple of them. Each of them are on probably separate emails, so you received several emails from us today, with the exception of the land use item. Yes, with the exception of the land, use item and Madam Chair, so people who arrived late and were not in the original roll call will they be called to vote as well. They will well. We want to get their attendance because it's important for when the borough president is looking at who attended. So yes, but they will not be allowed to vote. You have to be here for both roll calls. Thank you. Okay, hey sicily! Yes, this is shatty before we start. I just want to make a comment on 2080 Frederick Douglass, that's the paint and set pain and poor. So, according to the 3- 1- 1 data, through beta NYC, there was only one complaint lodged against the establishment and that was on July January 11 2020, and it was for loud talking, January 11, 2020, 10:25 pm loud talking, that's it! So that's the only that's the only complaint, that's on the 311 database, so Shatik the issues that were registered regarding sanitation and trash in the building and trash not being picked up on the curb. Would those appear in the 3- 1- 1 system, or where would those appear? Because I know emails were sent about those as well. You have a sanitation option where you can see the complaints from sanitation, okay on the on the beta NYC, it's NYPD, D.O.T and department of consumer affairs. So if there were any violations, including noise, complaints of drinking anything that has to do with liquor, license violations anything to do at restaurant health from the Department of Health any violations. It does not say anything on that sanitation and enforcement not to be labor, but any constituent calls that went into the district office. How would those well those were that those would not show up yeah. Those would not show up on as a 3- 1- 1 call as a 3- 1- 1. Yes, would not register as a 3- 1- 1 complaint, okay and just really quickly. If you believe that you have any conflict of interest, you can't abstain or recuse yourself, okay, and we will give you a chance to do that. So just remember, we are voting in a common consent fashion. We are recording any nays or negatives, but if you do have a conflict of interest, you can recuse yourself from that. Are you ready for the second roll call? Are we ready? Yes for the second, I believe: okay, yes again, as in with the first roll call, everybody is muted, so you need to unmute your stuff. When you hear your name called and Shitty will be monitoring the chat for, if anybody's having any problems. Cicely, Harris, President, Marquise, Harrison, President, Charles, Powell, President, Joshua, Clennan, Joshua, Kevin, Bitterman, Present, Stephanie, palmer, Excuse, Tahani, Abushi, President, Omar, Aries, Michelle, Booker, President, Janine, Brown Blackman, here, Daniel Clark, Here, Camilla, Clark, Present, Christina, Curry and Karen Dixon present Michael Downey yeah. You have to hear the call all right. Okay, so he's asking for this roll call, Lisa Downing in the Queue hazel dukes, Hazel dukes. I believe doctor, I believe as well. Okay, thank you! So she's asking for Troy Gathers, Present, Donna, Gil, Donna Gill. Give me one second okay. I do not see Donna Gill, not here. Okay, Deborah Gillyard present Stanley Gleaton. Oh that's what Stanley give me family's here Stanley's here. Okay, does senior are still on the phone she has not said. Is she typing in the present? Thank you, George Harrell President. Thank you. Karen and Ori President Victoria Horstford Victoria Horsford Victoria's on the call. But could you announce yourself, Victoria Charles, Johnson Man. I know it's just absent. I'm just checking to see if they got on the call Tamara Martin Tamara Martin has been the guest president. Thank you Crystal Mckay. Is she still on the phone? She I'm checking. Give me one. Second, thank you. Crystal Mccain, Camaria milford here. Thank you. Thomas, more absent Mari Moss, Absent, Lashonda, Myers, President, Barbara, Nelson, Present, Africa, O's present derek Perkinson Derek is present. Thank you. Nate nadine pinkett is absent. Jennifer Prince Tessa. Thank you. Stacey Ramos's, absent, Tiffany Reeves, I'm here. Thank you. Milan Reed present. Thank you, Jericha Richardson Present. Thank you. Aisha Romney is absent. Cheryl Smith, Present, Shadon, Smith, Present, Keith, Taylor's, Accent, Chanel, Washington, Present, Marquis, Marcus, Wilson, President and Terry wisdom. Yes, present. Thank you. We do still have Quorum Madam President, so we will move forward with the voting items. As mentioned we're going to do the voting items by consensus. The first voting item is the SLA renewal application for 8Th Avenue Social Club Llc 2082 Frederick Douglas Boulevard, and this is for a renewal application for a full liquor license. Do I have a motion to accept this application? I move that we accept this application. You'll have a second there any discussion, any opposition passed. The second one is an SLA renewal application for hot pot under the Tree Inc 2835 Frederick Douglas Boulevard New York New York, it's a renewal for a full liquor license. Can I have a motion to accept this application? I move the application. Can I have a second? Is there any discussion, any opposition eric? Are you opposed to this? I am. I am not opposed. Oh, so is there any opposition to the hot pot under the tree? I believe, is there Josh? You have a hand up disregard. That's the accident. Oh okay! I am not opposed so seeing none. This passes as well. Moving on to SLA new app New application, Nbhd Brule Llc 2620 Frederick Douglass Boulevard New, York New York, one zero, three zero. This is a new application for a wine and beer license. Can I have a motion to accept this application? Except can I have a second? Is there any discussion, any opposition? Can we just go through the motion of saying all in favor, please just so I can get the voices going all in favor, Aye, Karen Dixon is opposed any other opposition. The application passes the next one is an SLA renewal application for Ponte bistro, which is located at 144 West 139Th Street New York, New York. This is a renewal for a full liquor license. Can I get a motion to accept this application? I so move. We accept this application. Can I have a second a second to me? Is there any discussion all in favor any opposed application pass? The next one is an SLA renewal application for paint and poor, which is located at 2080 Frederick Douglass Boulevard New York New, York 10026. This is a renewal application for a full liquor license, and I have a motion to accept this application. Can I have a second second? Is there any discussion all in favor all opposed refusal? Can I have those names for the opposed the opposing Recusa Michelle Booker Michelle? What are you a recruiter opposing opposed Aaron Dixon, opposing Marcus Wilson, opposing okay, slow down, Sharon, Dixon and Marcus Wilson? I just this is Ponte bistro right, no yeah? No, this is paint and four okay. So I have. I have three opposed Michelle Booker, Karen, Dick, Dixon and Marcus Wilson, and there was not a recusal who was that Kevin Bitterman Recusal for Kevin Bitterman? Okay? Are there any? Are there any other? I'm talking about Washington Chanel Washington? Am I on Mute Cheryl Smith Opposed Cheryl Smith Mommy, look Stanley, Clinton, Stanley, Gleaton, Delcinia, Glover, Belcenia Glover, any others deborah this is this is Sicily I wanted to, because I did not get to speak during the discussion, even if we pose or pass. I do think that we should address the issue and write a letter of some sort. So even if we are supporting it, we can support it and say. However, these things are our concerns. So that's what I would say and I want to send that back to the Echo Dev Committee, if possible- and I think just with a okay for continuing discussion on this- is a wonderful establishment on Fredericks Boulevard, like I said it's a great alternative to the wine and bars restaurants, but it is a unique business and that it is in the it's a pseudo event space where groups are arriving at a particular moment, and I think that that's one of the additional issues to be discussed and addressed with this particular establishment. Sure so, just to be clear. We have one recusal Kevin Bitterman and then we have seven opposed Michelle Booker, Karen, Dixon, Marcus, Wilson, Chanel, Washington, Cheryl, Smith, Stanley, Clinton and Delsenia Glover. Is that correct? So this still passes and we're going to send it back to echo devs for to write a letter of concern, even though it passes? Is that correct? Yes, I would like to do. I would like to do so to send it back to Echo Dev. Okay, thank you chair. The next is a renewal application for Harlem Hookah located at 387 Lenox Avenue New York New York 10027. The renewal is for a full liquor license. Can I have a motion to accept the application? I move that we accept the application. Can I have a second? Is there any discussion, all in favor Stanley, bleeding Elsina Glover Karen Dixon, Jennifer, Prince, Shadon, Smith Recusal? So far I have an opposition. I have gentle Chanel Washington. I have Jennifer Prince Karen Dixon Cheryl, Smith, Michelle Booker, Stanley Glee and Darcenia Glover and Chanel Washington in opposition and one recusal in Shadon Smith Deborah Yates, I'm in I'm in opposition as well. Who is that Barbara? Yes, thank you Barbara! Thank you and again. This is which establishment just for clarity one more time this is harlan yeah opposition as well. I'm deborah. What is your position? Kevin opposition? Never this is Tamara Martin. I do not think I could vote, but I'm in opposition as well. No, you were, you were Mark President, the first one, so you can? Oh okay, so I'm in opposition Martin. So now we have one two, three, four, five, six, seven, eight nine ten opposition and one recruit one recuv. You can add me to the name: Brown Blackman, it's still past this. Did you add me I did. I did thank you. Thank you no problem. So, just to be clear, we have one recusal Shadow, Smith opposition. We have Barbara Nelson Kevin Bitterman, Tamara, Martin, Jennifer, Prince, Karen, Dixon, Cheryl, Smith, Michelle, Booker, Stanley, Gleaton, Delsenia, Glover, Chanel, Washington and Demean Brown Blackman. Is that correct it closed? Is that correct? Okay, whoever that is needs to mute themselves? Okay, thank you. So this passes and I think this will be the same thing- that it should go back to Echo Dev with a letter of concern, okay and to be addressed hopefully by health and human services, as we talk about the effects of Hookah and any type of smoking, so yeah, but just to clarify is that is that going back to echo Dem or is that because no it passed it has about? No it's going to it's going to. I do not know if they're going to do a joint discussion, but I believe the the request for education was made by Sheryl Smith member of Health and Human services yeah. So that's, okay, yeah! I'm sorry! I should have said this earlier, but I think Kevin may have already covered this, but the having it having them do. The Hookah Outdoors is a great concern to me. It's a great concern because it's exposing other people to the smoke who did not participate and it is it demonstrates something to children as an activity that is desirable because all of these sophisticated adults are doing it and I think that's a bad thing too. So I just want to put that on the record if they want to keep it in inside the place. That's one thing but doing it outdoors is very concerning to me, and I think to other members of the community. Are we still in discussion? No, we are not we're. Actually. I know that. I know that I just wanted to put it on the right. You do not mind. No, I do not because it would have been a thing for other people to have heard before the vote. Thank you for that. Delcinia. You are on the record. We are moving on to the next SLA renewal application for Ruby vintage at 2340-, 46, 7Th, Avenue, New, York, New York. It's an SLA renewal for the full liquor license. Do I have a motion to accept this application? I'm so moved. Do I have a second? Is there any discussion, all in favor aye all opposed all right. This has passed the next one is an SLA renewal application for Chipotle Mexican Grill of Colorado Llc 72 West 125Th Street, New, York, New York, one zero, two, seven, it's a renewal application for a full liquor license. Can I have a motion to accept this application? Iso move. Can I have a second any discussion all in favor? I all opposed. I am opposed. You know. I'm opposed Booker opposed Karen Dixon, so the opposition I have is Chanelle Washington, Karen, Dixon and Michelle Booker anybody else. What business is this again sonic? This is chipotle. Okay, did you get me Deborah? Oh dude, right now? Okay, where are you were you were you were you there? I was on my phone died while you took it the tennis, but I was there in the beginning. Okay, yes, you can vote Deborah. Also tomorrow Martin Opposed, Miss Mizjit, since we're doing everything about his census. You have to if Miss Gill missed what all of the other votes the numbers will be off. Okay, so no, you can't vote Donna. Thank you for that. Thank you for that all opposed to the renewal for a full liquor license. Yes, oh was that Kim Joshua yeah was I opposed. They should stick to Burritos and whatever yeah I opposed too. No. I did not miss all of the other votes, because I was online I'd when you made when you called attendance, I my phone died, but I got back on and I was there for all of the other votes. Okay, you just probably recognize me. Okay, we'll add you to the opposition, so the opposed people are Donna Gill Chanel, and this is a renewal, not a new application. Donna Gill Chanel, Washington, Karen, Dixon, Michelle, Booker, Tamara, Martin, Joshua, Clinton, janine, brown, Blackman and Lisa Downing are opposed and please Sad Deborah kill your please add derek perkinson, as opposed for what it's worth you can get Margaritas at Chipotle's downtown. I do not know it does not make a difference. I was just flagging. This is not new. That Chipotle sells Alcohol yeah. I wanted to say the same thing. They have a family margarita, that's why they have a full liquor license because it has to keep that's all they sell. Oh okay, that's all they say is frozen beer and Margaritas Beer. I'm sorry, I'm sorry. It's been three hours but yeah. I just thought I'd flag it. This is not new for Chipotle, so I do not know if it's what it looked like that the Harlem one I do not know as long as one won't allow it and we can we okay. Can we just thank you for that? You're welcome! So Lisa. Are you saying you no longer want to vote? No, yes! Is there anybody else? That's changed their mind, no okay. So the people who are opposed with Donnie Gill Chanel Washington Karen Dixon, Michelle, Booker, Samara, Martin, Joshua, Clinton, Denis, Brown, Blackman, Deborah, Gilliard and Derek Pickerson. Thank you. It passes really I'm going crazy. The last one is Harlem. The last SLA renewal is Harlem Hill House Ale House on 101 West, 127Th, Street, New, York, New, York, 1027 wine and beer renewal application. Can I have a motion to accept this application motion to accept they've had that license for a while, but it took a while for them to open is. Was there again, no problems? Nothing. Oh they've been open for a while. I've been in there a number of times yeah, but they had that week. Their license was granted like almost more than a year before they actually opened. Though I'm just wondering if there was anything I do not know. Okay, all right, never mind, then no discussion. Okay, no! It's a valid question. All in favor aye all opposed. I who is opposed Chanel anybody else, Michelle Booker anybody else opposed Aaron Dixon. Anybody else opposed, so the opposition is Chanel, Washington, Michelle, Booker and Karen Dixon it passes. Thank you. So the next voting item is the free Clemson University Covic strategies for Central Park Safety thing that Karen presented. Can I have a motion to accept central park or all parks in Harlem? It's not central park. It's not a particular park, it's parks and central Harlem right. It's park. It's park safety. It's park, safety right you're! Welcome I mean. Did you hear the discussion Donna around Clemson University, wanting to come in students like graduate students at Clinton university? Okay? Yes, I did yes, I do okay, so any discussion all in favor, any opposition hearing none it are we voting on land uses. Even though I do not it's not on the agenda. Are we voting on land uses issue? Yes, we are getting information from the community. Are we sending it back? Well, it was on today to vote, but we can vote to send it back to the committee. It's not on the agenda. It's not an agenda that I got wait a minute. It was today presented in the land use meeting in her report as a voting item yeah. So I know it's presenting as a voting item, but it's not on the agenda. Let me vote, but we're going to go ahead and vote on it. Okay, why are we going to connect so the vote is this the one that we is this, the one that we're waiting for the background information? Yes to committee? That can be the vote? Okay, we're voting to send it back to the committee. Yes, because it was presented, we got to make a motion. We can motion to vote for it now or motion to send them back right committee. You can do any of those things. I have a question. Can we make a? Can we make a motion to vote on the condition that the contractor and the developer will provide the information that we requested? This is a last- minute action that I just discussed last night with the boy chair, so it did not make land use last month. It did not make exact committee. So tonight was the first proper discussion about fairness, so I'd like to propose that we vote on the condition that they provide us, the information that they requested. I I'd like I'd like to make a motion, because I'm sorry Joshua, I'm sorry, wait. Everybody please can we have one person speaking at a time? Yes, thank you. So can I first just bring it out and then we can see what motions come to the floor. So I'm going to say hey. This is a. This is a project that we already voted on they're, just asking for a one- hour extra hour, they're asking for two hours, two hours for crane prep, so they've offered to provide a descriptive analysis of the process of the schedule and any other all the other issues that we raised today in a formal letter. So it's not like. We have not already approved the project. This is a development project, that's sanctioned by all city agencies, so issues of school safety and all those issues are already part of the protocols that all construction workers have to follow. I think about the project. This is about inconveniencing the community and not only there's no letter we did not. We did not amend our agenda for it to be presented at the beginning of this meeting. We need. We did not have ample time to even discuss it, so my concern is: why are we automatically voting on an item? That's a not on the agenda and B was just presented last night. According to our balance, I believe there's like a three- day process that it should be added on to the agenda and that we should be notified. If I'm incorrect, please correct me. So that's not that's not correct, but I should have in the beginning added it vocally or orally to the agenda because it did just come before us and I apologize for that. But it was presented as a voting item, and I do think that at this point of hearing the developer hearing the committee report, it is important that we vote either one to send it back to community to committee to get more information. But I do not think it's at a point where we just want to leave it out there, where we have not had our say or put something on the record from CB10, because this is actually, I think, they're trying to get this done sooner than later, and there are other organizations that have already weighed in and if our weigh- in is that we want to get more information, we send it back to committee and have them wait for that, and excuse me Madam chair. Can we please add that we want something from the residents because we do not have not so anything can be part of the motion. If someone wants to make an emotion or just before we motion anything, I mean because before we were just having a lot of chaos with the noise that he, we should really focus, try to use to raise the hand because Marcus Wilson is at its end of I do not know if he has to say anything but he's had his hand up for a while. I do not know if it's about this matter, but it might help us just to keep order in regards to like when we want to, because this is a very interesting topic, that a lot of people have things to say, but it's hard when everyone was you know talking, and we can't we do not know when the next person is going to talk unless they're recognized with their hand, we should use the feature on the side so marcus do you have anything? I know your hand has been up. I saw that, but I mean I think, cicely you actually hit it on the head. I think we can like move ahead and go and vote for it, but just have those conditions around it saying you know we expect them to bring back x, y and Z to the board or you can send it back to committee with those conditions it's up to the board as the motion that they want to accept, correct, yep and just keep in mind that all information that comes in shatek will be sharing with all members of the board as soon as we have it. Okay, so we are now, I believe, Joshua is raising his hand in this okay, oh okay, yeah as Dr dukes would say it. You know it's almost not. I think it's past nine o'clock I already originally motioned. I was going to say it's already motioned to send it back to committee with the documentation. So that's the motion on the floor. We should vote for that. If that's voted down, then y' all motion for something totally else, but there's already a motion on the floor. So, let's move forward. Please right! I made. I also made a motion, though I made an emotion that I made my motion. First, you can't make a motion point of order. Yes, point of order. He I believe that Joshua did make his motion. First Josh was good, but we need to point of order. So these motions, you know we're not doing. We can be stated very clearly because Joshua needs to clarify he's not asking. If he's not, actually let him let him clarify. Let him respond asking him because I'm putting it out. There were two things said, but if he's sending it to the committee, please say start with imove, and so we were very clear with what you're moving to do on and so forth. Just so that it's very crystal clear, because I almost interpreted that what you're saying is still go to committee. What Lisa's saying- and I do not know if it's the same thing, no okay. So to be perfectly clear, I moved to send this back to committee and also requests that they provide community input from the local residents who live on the block regarding you know how they feel about this project and and to make sure that's not going to you know inconvenience them yeah and I'll. I'm willing to accept only friendly amendments. If anybody wants to include anything else to that as well. I would. I would just like to say that if that's the motion, then the decision gets made at the committee. It does not come back to the Community Board next month that the decision gets made at the committee. It does not go back to the community board the next month. That's what I'm saying! Well, Josh was the maker of the motion. Do you agree? No, he said friendly amendments, so, yes, he has to accept it though I mean he does not accept it. I do not accept that piece. I do not think that's that goes in accordance with our rules and regulations. I mean in other circumstances, and I've been on the landings Committee for about four years now. A letter of support of this nature does not usually get to get to the full board. It's usually made at the land Use Committee. I mean we have discussion on that people please chime in so I mean I'm just chiming in that all right. So it seems to me that you're moving that this goes back to the committee, where you're asking for more information to be brought back to the full board before a vote is taken, and I think maybe that needs to be clarified because you're saying that we're not it should not. It's not a decision to be made in committee, you're saying that the committee needs to get information and bring this issue. This topic right back to the full board correct. So if it's not a decision for the full board to make, why are we voting on it? Now? It is a decision. It was a time sensitive request that came in last week that missed Executive, Board, that missed Land, Use Committee and their in construction process. Construction is expensive and they needed a timely response. I understand, but is not that on them. They should have got this to a sooner right. They, I assume they knew from the jump that they were going to need a crane, so their oversight does not mean that we should rush through this and be hasty and make a hasty decision without all the information they're going to have a crane regardless they're just asking to start earlier in the day. That's the only thing that they're asking to start set up earlier in the day, so they can stand back into the day. No, it does not mean for the community, not developers. So therefore, let's actually put forward- and I agree with Joshua- I think that going back to Marquis's recommendation about process, he asked for any friendly amendments and he did not accept the amendment. So I think we're in the next phase now so that we can vote on the motion that was set forth by Joshua. Okay, we're ready to vote on the motion set forth by Joshua Clennan. Can we give Joshua the opportunity to amend his motion based on what marquis informed us that he did not say that it he can ask that it come back to the Full board. Sure Joshua! Do you want to do that? That was the intent of my original motion, okay to the full board for a while, okay great. So we are now voting on Joshua's motion. Wait. Has it been seconded, I moved you did second okay, I said you're, probably seconded it's been moved improperly. Second, all in favor of Joshua's motion any opposed opponent, who's opposed Lisa and who else anybody else? Okay? So it's only opposed by Lisa Downing and Michelle Booker. So it goes back to committee to get the information that the board has requested from the community and otherwise, and then it is to be brought back to the full board for a vote. Thank you. That is the last voting item. Thank you very much chair. It is now all yours, okay, thank you so much any old business that we need to discuss. I have a question yes Karen. Yes, I'd like to know what is the status of the health lab which is proposed, it was proposed for Harlem hospital. We can follow up with the health and Human Services, Committee, Karen or Michelle. Have you heard any updates? If not, then we'll just give those at the next meeting. I will provide you and shatik with the information that we've been receiving from Harlem hospital related to that the destruction and then the construction of the lab, okay so be sure to get that out to the board just for the updates right. Okay, any other old business, cicely. I'd just like to ask: has there been any more community outreach around that community outreach in regards to doing what do you mean by because the project was moving forward ahead? It's not a Harlem hospital project, it's a New York City project. So what specifically, do you mean by community outreach? I know that the well I know I voiced concerns about the health lab coming in. I did not think we had enough information in terms of what level of research it would be involved with, and just the safety issues around having infectious diseases being studied in the residential community right next to a school karen. This is fatigue. Department of Health will be re- engaging the community ever since we went into Covid-19 no movement no traction on this. Definitely I'm no construction, so they will be in contact with us and they were willing to have open forums with the community. So as soon as we hear something that the district office will let the community know, thank you, okay, that's it for old business, any new business, any announcements. At this time I will entertain a motion to Adjourn removed, so if it moved it's removed and practiced, so we moved and probably seconded I'm all in favor post, none opposed. We are adjourned at 9, 21. good night good night. Thank you. Goodbye have a blessed night.",
            "summary": "Just in case I did not mention that the chair of CB10 there was a lot going on that we found it necessary to continue to meet in July and August to continue serving the community.\nWe did not stop this summer, so we were continuing to meet and trying to serve the community through our committees.\nAnd I'm sure that there are other board members and members of the community who will say the same thing that was amazing, chairman as a resident of Linux terrace, when I heard people screaming from 470 all the way down with all the commotion, I said to my dolman.\nIf, if you get a text from so thank you so much for doing for being here today and for letting us have this discussion with you and for all of the wonderful things you do, and I was just able to read a news article about it And You all were right on it and so prepared, and we just thank you for all of your work every day for keeping us safe, and I do not know if people say it enough, but you are definitely one of our local heroes that when we are clapping for all those medical professionals, we are also cropping for all those first responders, and I know that it's died down at seven o'clock that people do not do it as much, but we do need to keep that spirit in our heart.\nDo, not brian good job, Even you know during the time of Covid-19 and the unfortunate reality of things now not being in person or trying to now work.\nYou know fire safety is always a year- round topic We look forward to working with the Community board and community residents, as well.\nOctober is fire prevention month, and it's something that we would like to see within the coming month of stressing that message and potentially working with the board for the uptown community of Harlem.\nThat would like to say a few words or a representative of an elected official sure I can talk about a couple things that are coming up in the public advocates office.\nWe are doing another meeting on NYCHA this one night, not just Nigel but affordable housing, but focusing on Nigel we're going to be talking about alternative preservation, strategies, rent to own and other methods to preserve, affordable, housing, develop, affordable housing, so that folks, who live in our communities can stay in them and so that folks, living in niger could have a better quality of life.\nThe last thing I want to mention is our team is trying to get the D.A out there throughout the community more talking to groups engaging with different members.\nIf you are interested in, you know having conversations with the Da if you're having public safety conversations and then want to include the D.A. I'll, leave my contact information in the Chat box.\nEveryone, welcome back in September, so I have two things: one: The New York City Controller Scott Stringer, along with Congress member Esbayad, State Senator, Brian, Benjamin, City, Councilman, Bill, perkins, 125Th, Street, Bid, Barbara askins, a host of a lot of community leaders on 125Th Street, the congressman and the Controller have wrote a letter about the increasing the increasing of too much trash and was trying to get a lot of buy- in from the city to restore some of the funding back to sanitation.\nIt was the assuming men, interacting with the community, making sure that folks had what they needed and staying safe and also just making sure that you know they knew that his office was present and was there to address issues and the last day for the peace walks is September.\nThank you and again thank Brian Benjamin's office for the protect the block campaign that a lot of the elected officials and the Community board have adopted.\nI know we may have missed a few committee meetings, but the diligence and the fortitude to push on throughout everything going on and to be of service to the community.\nUntil we address the disparities in economics in the community, so we were out there with street corner resources occupying the corner with Assemblyman Al Taylor, Manhattan Bro, president Gail Brewer , We were out there, I believe at least four to five times this summer and many times more than that with street Corner Reese's talking to the to the young people, we were at the mayor's meeting that they had for the young people at the community center here off of Lenox Avenue.\nWe were constantly out there constantly trying to address the issues that are so plaguing our community Now we passed out masks at a lot of these impromptu parties that we've been seeing popping up over the summer.\nThank Brian, Benjamin and Shauna and Christina, and a lot of the community members Larry Blackman for getting together and doing the protect your street campaign.\nI want to publicly thank Karen Orry and the Parks Committee for their diligence for having those walks for having those conversations, not just in the committee meetings but outside talking to the parks, Department, and really pushing it forward of what we want to see What really reflects our community?\nReally we want to put out there and actually bringing in those folks that in most effects and talking about disenfranchisement and all those things will be a part of what is manifested through the CB10 initiative around I also wanted to thank the health committee for all that they're doing or they're talking about sanitation, which has been extremely vital to our community, but also addressing the nursing home issue that we've had and we'll hear from Dr dukes on that and finally, again, I'd want to thank Barbara Askins and their cleanup team on 125Th Street.\nI might want to commend our community board members for working over the summer as well, by holding their zoom meetings online, also want to thank our community assistant, Miss Juanita Anderson for all of our hard work, because there's a lot of correspondence that needs to go out They can be a tough job trying to keep up with everything.\nThere said that Jayvon allegedly tried to chase a drug dealer off of the street and he was fatally shot in the neck in broad daylight, just after 3 P.M. At, this point, we do not have all of the details, but I look forward to following up with the 28th present in regards to issues at this location in particular, as well as issues that have been a continued nuisance to residents around a phillip, Randolph Square on 116Th Street in regards to public safety, drugs and drug trafficking.\nWhen we reconvene in two weeks throughout the summer months, we have seen many issues in our community around gun, violence, drug enforcement, noise and sanitation, concerns, and I hope that, even with the reduction in the city's budget that we can come together to work towards fixing the most pressing issues and complaints on a brighter note, I'm happy to report that, after many months of trying to get NYPD to start Pac to stop parking in front of the bus, stop in front of Psa 6 on Frederick Douglas Boulevard, the mayor's office.\nIn response to that, many constituents and community organizations have started the Harlem Cleanup initiative, like cicely mentioned earlier.\nLast week, myself, along with board members, Deneen, Brown, Blackman and Joshua Clennan towards small businesses in our district with Manhattan bro president Gail Brewer and uptown director, Athena Moore handing out face, masks and hand sanitizers and getting feedback from business owners all the way from 130Th Street down 112th street from Malcolm X to Frederick.\nWe would normally, at this time, be talking about elections that will happen in November, so I was able to attend a presentation by the Parliamentary Association of New York that was put on by the Manhattan presence office.\nLet you all know that we are moving towards that, we're going to go ahead and get into our committee.\nThere is a conversation that needs to happen prior to us, get rescheduling another watch and discuss And, that's pretty much it for the summer voting items or echoed it.\nI'm, chair of the education, youth and libraries Committee during the summer I set in on lots of zoom meetings regarding reopening this morning.\nI want to put on records and thank three of the persons from well all of the health committee, but especially Vice Chair Michelle, Booker, Karen, Dixon and Dr Smith for really putting together our proposal to the Harlem nursing home.\nThey were at one of the borough board meetings and a lot of the Community Board chairs did have a lot of concerns about the operating and even the safety precautions, or the lack of lessons that are given for the people that are writing.\nWe were concerned about what that might look like for emergency vehicles, parking and public transportation, so that shutdown will take place from on Friday, starting at five o'clock.\nThey should be putting them up now, if not now or first thing tomorrow, morning, and I believe NYPD I do not believe I do not know if there's any questions or concerns about that, but definitely we'll be talking about this at transportation.\nSo a couple of things I like the theme of what most people are saying and acknowledging the fact that this summer, I think during the Covid-19 pandemic.\nI want to acknowledge something that I think the housing committee has not paid proper attention to Chanel Washington has been talking about the issue of appraisals and the you know disparate impact on communities of color.\nYou know I'm going to be looking Donna, you know, and what used to be when I first chaired the housing committee, and that was I think we would have to create some subcommittees and some working committees, subcommittees.\nYou, know one of them that pretty much are the few things that we have on our wish list and just grateful for those who have decided to honor us by being a member of the housing committee, and we look forward to having a great year.\nWe have a brief presentation from the more development group who's at who have come to us asking for a letter of support for their project on 126Th Street.\nA.M they've always already received two letters of support from two of the schools in the area, so we're talking about the North East Corner, pretty much of 8Th Avenue and 126Th Street a little a little west of the apollo, not a high a high traffic area from going east to West, but not a lot of density in the immediate area with respect to residences and businesses do not open till 10 or later.\nI do not know why that even directly influences, but I, guess I'm concerned about residents who, because a lot of people working remote students are working remote and things of that nature starting earlier , I'm not, and we do not really have any gauge of the community.\nI would be concerned that if we have not heard from the community in regards to tenants, no matter how few or just to hear some voice, that we have people who are working, you know because they work from home.\nIt takes like about two hours later, so we're really starting to erect like around nine o'clock, and we want to be done earlier rather than later, because you do have a lot of more people on the road later on during the day, especially in that area.\nI believe we requested 12 months, but in the 12 months your one sweet top off the building, which I would think that would be in the next we're going to the second floor now, Well, I hear us talking about school opening, but I do not hear anything in regards to the safety, because, from my understanding, I believe the schools will be open.\nSo I'd, like more discussion on how you plan to deal with the safety of the students coming and going how of the hours that you're actually going to be in use of the crane, how it will impact the school and I'm with Marquis.\nIt's good, that you got a letter from the funeral home, but the funeral is the funeral home affected at 7, am in the morning as much as the tenants are the rest of the people, even though on the, even though, if your store or school is not affected, it's the letter is still required by DOT or We will not get permits to start work and in response to Mrs Nelson's question about the safety we have to have flagmen on site at all times during constru crane operations, and we also have something.\nI. Think if you gave us the justification ladder as to why all these things are needed, it may be a little easier to you know And, it might be easier for people to agree to have you start at seven o'clock, because in essence, you're not really starting construction at seven o'clock, you're prepping to start at nine o'clock, Are you also closing the street two hours earlier at seven?\nIs that there's like they want every entity or the entities in the that community right to speak and give you a lot of support.\nYou have the funeral home, the business, the school And they're, now they're coming to the community board.\nSo we definitely want to get this building up and out of people's way before another mass of residents start moving in on the block.\nFurther east and again, I think they originally stated that the reason that they want to open an hour earlier is to just get a jump start on the project.\nHas the weekend been suggested at any point for the cranes to be utilized, so it does not disenfranchise the community the residents the children going to and from school we could get permits for a saturday.\nEveryone I'd, just like to welcome the New Board New committee, members, I'm, looking forward to working with you and- Know, that I sent a a letter to him if he could share it with regards to Clemson University.\nThat statement of objectives going to be sent out for the committee to review And and give their input, and then we can send it on to New York City parks, the mayor's office and whoever else we need to send it.\nSo it's an opportunity for community board 10 to get the assistance of graduate students in developing plans to, as our committee sees it, to develop strategies to cope with the Covid-19 situation, to make our open space areas, safer.\nWe had a group, I think it was the Harlem greater Holland coalition came and addressed some issues that they saw and we're continuing to see being a public safety issue, continuing that we had this conversation before last year with health and Human services, where Dr Dukes led a charge.\nI know she has been greatly involved in a lot of conversations, so either you can speak now, barbara, if you want, or we can invite you to our next public safety meeting, to continue that conversation.\nOne of the things that's happening is the business owners, and this should be Harlem wide, like they have cameras, but a lot of the images are not good and the police can not there's nothing for them to work with and if the images are not good, even if they prosecute somebody.\nSo what we're doing now is trying to have a zoom, meeting, and probably the chair of public safety Should be a part of this with the commanding officer and the business owners on the street, because what we see is that this is not going to change and more communication and people working together is probably going to be the only route we could go.\nI do not even know if the other board presidents have gotten the money out yet, but we got it out quickly and we've been in, for instance, this week in Washington Heights at nine different events on the street, trying to get people to sign up number one number, two : we've got the listing from the board of elections as to who has left the city and where they are, and so we are now sending a letter to the Census Bureau to 35,000 new yorkers they're, not living where they're Hopefully.\nI want to thank the chair of the education committee for participating today, but we did have all the boards and all the cecs and about 70 people with the executive.\nIt's, really important to kind of take over blocks that the community know between book bags and food and support and census and voter registration that there is a lot of support for that community and just in general, whether we heard earlier about the refrigerators and the mutual aid or just people on 146Th, Street and Seventh Avenue a couple of days ago on the weekend, giving out food and masks and census, material.\nWe need to have a further discussion with all the community boards to figure out what to do, because it's a non, stop complaint It's got pros and cons in terms of legal aid.\nIf it's a renewal, seven days, if it's a new application, And, then I also asked whether the committee would like to see them come before.\nThose were the only two that came before us this summer, so we did not have a chance to dive in the questions that you see in the questionnaire were there before If the committee does not vote to see the applicant come before us, we do not have that opportunity to question them.\nDefinitely honestly, not sure whether it was echo death or the health committee had discussions about Hookah, specifically, and I think it may be a good time for us to revisit the health concerns as around Hookah.\nSo I actually think it's still a good thing that we have for those people who do enjoy Hookah And it has not had any problems as a business.\nI think it's a business that we should support, because people are going to do this.\nUnless we're talking about higher public policy, where you want to ban Hookah establishments in New, York City, but realistically speaking, Like, Marquis, said, this has nothing to do with the liquor license and secondly.\nHowever, I know personally, of complaints that have been filed that have been registered with the District Office Department, of Sanitation building management and within the community, and if it is in fact a permit to continue to expand their operation to the patio, I think there are some questions about their capacity and their care for the building and sanitation.\nSo we have not received any information as to whether or not this is going to be kind of like a temporary permanent thing, or will we revert back to the official process as a community?\nWe do not know the future of what the sidewalk cafe licenses will look like, And then I would caution the check mark on the application that this is a sidewalk cafe if they have not been issued.\nWith a letter of concern, Okay and to be addressed hopefully by health and human services, as we talk about the effects of Hookah and any type of smoking , I do not know if they're going to do a joint discussion, but I believe the the request for education was made by Sheryl Smith member of Health and Human services.\nThat's one thing but doing it outdoors is very concerning to me, and I think to other members of the community.\nI did not miss all of the other votes, because I was online Okay, we'll add you to the opposition, so the opposed people are Donna Gill Chanel, and this is a renewal, not a new application.\nThe next voting item is the free Clemson University Covic strategies for Central Park Safety thing that Karen presented.\nDo think that at this point of hearing the developer hearing the committee report, it is important that we vote either one to send it back to community to committee to get more information.\nDo not know if it's about this matter, but it might help us just to keep order in regards to like when we want to, because this is a very interesting topic, that a lot of people have things to say.\nThe block regarding you know how they feel about this project and and to make sure that's not going to I, would just like to say that if that's the motion, then the decision gets made at the committee.\nIt does not come back to the Community Board next month that the decision gets made at the committee.\nI mean we have discussion on that people, please chime in It seems to me that you're moving that this goes back to the committee, where you're asking for more information to be brought back to the full board before a vote is taken, and I.\nYou did second It goes back to committee to get the information that the board has requested from the community and otherwise, and then it is to be brought back to the full board for a vote.\nAs soon as we hear something that the district office will let the community know, thank you, okay, That's it for old business, any new business, any announcements."
        }
    }
}