{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UCeK-WtMnxma1QVk2EkN3omA",
            "title": "CB7 Steering Committee",
            "publishDate": "2020-09-15",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 177,
            "um": 341
        },
        "wordCountFullTranscript": {
            "board": 57,
            "community": 39,
            "people": 37,
            "budget": 32,
            "time": 29,
            "things": 27,
            "committee": 24,
            "city": 24,
            "hand": 24,
            "priorities": 23
        },
        "wordCountSummary": {
            "budget": 16,
            "community": 12,
            "priorities": 11,
            "board": 10,
            "people": 8,
            "time": 6,
            "statement": 6,
            "planning": 6,
            "way": 5,
            "committee": 5
        },
        "fullTranscript": "Is that a what a banquette you're sitting at or is that yours, it's just it's just a sofa, it kind of looks like a banquet. I know I can only see a little bit of it. We're live streaming now, just fyi, we'll record in a minute. I've been on calls since 6 30 45 this morning playing with different green screens. Oh yeah, enjoying them look like one, but this should be an easy one DNS. What could be controversial about the budget right? Oh hi, it looks so lovely where you are christian yeah. I wish I was there too hurricanes and storms behind right down there, though so probably better you're here well school starts tomorrow: yeah wow, right, yep, all right, I'm gonna start letting attendees in. Although I didn't see that many signed up. So I don't know how many they'll be. Where are the participants correct? Hmm, okay, the only one I need is a booster seat. Okay, so hi everybody, hey there, hey doug, hi everybody hi there. Julian and sarah. Can you fight among yourselves to figure out who does the minutes? I suggest rock paper scissors, but whatever works, for you is fun, sir. Would you mind taking minutes? I'm actually trying to juggle two calls right now sure I can take the minutes. Thank you. Thank you. Well, we're very close to a quorum, I'm just going to give it one or two more minutes so as to reward those who come on time as opposed to those who come late, and I think we have a quorum. It's steering. I mean it's not the same forum as right. It's not correct forum and steering is quorum and steering is the is a majority of the committees right, not necessarily the population. Well, I didn't know that before I learned something new every time I'm here is that is that in a bylaws I thought well probably they're handy somewhere, but susan's here so it'll become the bylaws, some somehow or other the idea. The idea was, as I recall, was that you don't punish a committee that only has one mem one chair as opposed to two co-chairs by giving more votes to the to the better represented committees but or anyway, you get the idea yeah. But that said at 6 32 we have 26 members of our board who are with us. Excuse me 27, because I got to promote josh. We only need a quorum of the steering committee correct and I believe we have it. So I'm going to call us to order and thank you all for joining us to joining the meeting tonight. There are some important things to discuss. I hope it won't be the longest of all meetings, but given my track record I'll find a way, the the first order of business and the thing that I want to make sure that we have plenty of time to discuss and understand is the is preparation for the district needs statement and, rather than have me say things that I'm sure cindy's going to say only better. Why don't I just give the floor to cindy right now so cindy if you would unmute and take us through whatever it is that you need us to understand both about the narrative district needs statement and about the preparation for the budget priorities that need to be voted on at the October steering committee so that we can vote on them at full board in november, I'm stalling for time so that cindy can plug in, but I think she is now plugged in and so cindy whenever you're ready take it away. Okay, I realized I didn't want to bother my family with listening to things about the DNS they're, not interested in the dulcet tones. I don't know [Laughter], but I wanted to just say I hope everybody had a nice summer. I can't believe it's september and school's starting tomorrow. So that's crazy. It seems like only yesterday. It was mid-march okay, so I wanted to start. I wanted to just give a little bit of an overview of the DNS, even though we've done this before some of us were on a webinar that the department of city planning held on thursday, the 10th, which was then followed the next day, which mark and I attended a full day- borough consultation session with some of the different agencies. So one of the things that city planning went through was talking about the timeline and they talked about attending the borough budget consultations in september and how our community boards need to schedule, meetings for review and votes on the issues, the needs and the budget requests, which is what we're starting kicking off now and that internally we're supposed to be collecting input and enlisting support from elected officials and stakeholders on our key priorities. So my hope is that many, if not mo all of the committees have reached out to maybe elected officials or ngos or any other groups you can think of for input in order to help formulate your district needs statement and budget priorities. Not all committees have budget priorities. For example, bci has a has a district needs statement, but it there's not really a. There aren't really particular budget priorities that fit into the slots that were given for requesting different agencies for funding next month. We will be, I guess, mark and I will be sharing the resources and the feedback that we got from the agency consultations. I will tell you that I don't know about you mark, but my impression, you wouldn't believe that we were in the middle of a budget crisis at this borough consultation. I don't think because every time the agencies were asked, what do you need? Are you going to be able to? What would you need to do things? The way you've been doing them? What would you need in order to hit your your benchmarks? They said we think we're going to do that. Am I wrong mark. Did you hear anything different for most of the agencies that were on the call? There were about five or seven agencies last friday and not a one of them said? Oh, my god, we're going down the tubes, it was rather a remarkable thing, you're, absolutely right, yeah. I was, I was honestly kind of shocked, but I don't I don't know. I don't know. Why? That's? Why that's the case, so I and I can't even guess next next month, we need to refine what our most pressing needs and priorities are. So I'm sure most of you who are on the board last year will recall that during steering we were voting on top priorities that the board has to decide on what our number one priority is like the majority of community boards last year, our top priority was was a housing issue was okay, but there are other choices we can have other. We can have it be whatever we want, so everybody should start thinking about that. I'm pretty sure I sent out the list of the different possibilities for priorities for each area, but I can do that again. If people want me to I'm happy to do that and again it can always be other, so we're not really hamstrung by the choices that we're given. Then we ultimately have to ratify our final budget priorities during a public hearing, and my understanding coming into this role last year was that in the past and what we did last year was our first november meeting. We held that vote and even though the actual submissions are due October 30th, I think historically, it's been fine with planning to have us submit that, but everything else has to be nailed down. I mean it will be nailed down by October 30th, whether the committees give us stuff or we have to write it ourselves. It's going to be submitted. You know, I'm not I'm like that's the drop dead date, so if we don't receive, if we don't receive DNS from you know a description from a committee we'll look at what we had last year well to the best of our ability, as a committee in the committee, as you know, is mark and roberta and beverly, and I to the best of our ability. As a committee we will, we will write something, but the preference of course is to have broad input by as many people as possible both on the board and in the community. So our real hope is that we will ultimately get something in writing from everyone. I've gotten some I've gotten from bci I've gotten some from yel, but it's I'm not 100 happy with the lack of response can't lie, but you know I'll. This will get done one way or another and then and then and then in november, omb actually distributes our budget priorities to the agencies, which is why that deadline of October early november is so important, and then city planning distributes the city-wide community board perspective reports to the agencies and the agencies review and respond to the budget requests prior to the preliminary budget. One of the things that city planning told us was that we are. We have a unique opportunity this year to have our opinions considered more so than other years, because they're going to be making tough budget decisions in a tight time frame, and this will be a document that ostensibly reflects the will of the community, and I think that when you have to make a tough decision, it's a lot easier to make it with the strength of some support than to just make it. You know without that. So that was something that they highlighted. They also said it's very essential to refresh content, so if you have data dates or numbers or whatever in your in your narrative in your you know, district needs statement. Narrative portion of the narrative please make sure that you've done your best to make sure it's it's up to date and the same with budget request, to the extent that you can get hard numbers. Obviously that's important one of the things they also stressed was location. So if we can give an address for a particular school or or at least name the school or the more specific we can be and the more supporting information we can give, they said that that it was more. It was a definitely a a more compelling statement if you had a supporting letter or organizations to which you can point and and say they are in support of this or they brought this to the board's attention. They also said that it's important to tie content between the various elements of my of our submission that it makes it a more cohesive report. That's not on you! That's on our committee, because we're going to be taking what you give us and trying to do that. They talked in terms of sending surveys to the broader community. Although one of the one of the district managers did point out that there are a lot of people who don't have access to computers and internet, and so it's difficult, it is difficult to send out like a survey monkey survey to the broader community because there may be, we may be forgetting about people or there may be people who don't have access so something we can think about. I don't think there's time for a survey right now anyway, but maybe going forward or if you've done surveys already. You certainly can include those in your in your submissions trying to see what else that they said. That was really important yeah. They said they mentioned. Affordable housing was number one in Manhattan. There is a they've produced a lot of a lot of background. They have a document with tips for strengthening your submissions. Anybody who wants any of that stuff. I've got it and I can easily send it on to you or I could send it to everybody, it's whatever you want. They, oh one of the things they. Why don't you? Why? Don't you share that with everybody? Just so everybody's got it: okay, yeah, okay, so I got a. I got a an email after so after this webinar, which again they also have there's their slides. They produced a deck and everybody can look at this after the after the webinar they did they sent out yeah there. You go christian, you got it too, because you went to the webinar right. Yes, so yes, so this webinar! So we have this and I christian did you see the other documents that they attached to that they gave links to? I didn't yet? No okay, so it within the text of the email. There are other documents that you can click, that you can click and look at and there's some helpful stuff in there. I mean it basically just says: do a very good job but anyway another thing that they one of the things they emphasize, though, and it's something that I think our committee has been emphasizing this year too- is that if you can it, I identify external stakeholders, it can change in agencies, maybe to a yes that for what it's worth? That's what city planning was saying- and you know they of course want to hear what our means of outreach are if they can help to collect and share best practices. They want to do that. I think that if we have any problems, gathering data planning is available mark. I don't know if you'd like me to be like or you to be a conduit to planning or if you want to encourage different committees to reach out directly or thanks. I defer to you on what you think is most efficient with respect to city planning with respect to other agencies, especially the agencies, to which each committee naturally corresponds or relates. I don't think they need to go through either of us to reach out to their counterparts. A streamlined approach where you have a good rapport with your corresponding agency is of course ideal, and I would encourage everybody to do that within the framework of whatever makes sense for your committee yeah and I'm happy to have people reach out to city planning, and I can give you know, email addresses they were, they were sending them out. I mean you'll see them on the on the email that I send out, but I wouldn't mind being copied on emails that you sent. I mean if you call obviously I'm not part of the phone call, but if you send an email I wouldn't mind being copied just so that I can see what the what the conversation is. But if you don't do it, I won't be hurt, don't worry so the plan now I I'm hoping that I was hoping to have drafts today, but I don't have them. So what I'm going to ask everybody to do is take a look at your lat, your last year's submission- if you want to do this, the quickest way possible make it as up to date, as you can bring in as much data and outside support, as you can give as much detail as you can and get it to me as fast as you can so that I don't have to do this on October 29th at midnight, and that's, I guess, is there anything else mark. Thank you cindy. That's perfect. I just will emphasize one or two things. There are two basic buckets into which this work fits. One is the narrative statement of district needs and the other is the budget priorities that your committee decides upon, and then they become the fodder for a unified list of budget priorities for the whole board. What cindy was talking about in terms of the top three was that the form of the online form into which god bless her she's, the one who inputs all these narrative statements calls for each board to have an overall top three needs and, as she was saying last year, the top need was- or at least one of the top needs was affordable housing. Our number one was yeah. I wouldn't be surprised if that recurred, that will be discussed at the October steering committee along with the budget priorities, while the budget priorities need to be well, the budget part. Thank you christian thanks. While the budget priorities need to be voted on at november full board, I both out of out of gratitude for cindy and the committee for taking on this very difficult and time-consuming task, and because you know, we've been kind of working on this. A while now the narrative statements should be done pleased by by October steering, I was going to say by October full board, but I'm being realistic, because that would give us an opportunity, as a committee, to assemble our own standalone document as well as input the relevant sections into the right parts of the online form that cindy was showing and that actually christian is now showing you. So that's all I've got to add to cindy. Unless I miss something, I think, that's it roberta and beverly. Do you have anything you'd like to add roberto you have to unmute, so I want to remind everybody that the economic downturn is going to be going on for quite a few years, so programs that are are being cut across the board so be especially mindful of cuts. I'm looking at andrew and albert thinking about the mta, but there are other agencies throughout our board that will be harmed by what's going on. Well, I read submission. Today I got I got some stuff from blanche and then some stuff from steve and they for sure you know covid's all over it, which I think is great and it does talk about. You know: lack of access to internet lack of access to technology. You know hardware, lack of I mean just all of it, so I think I think it that they did a very good job. Reflecting and bci also mentioned the you know brought the Covid-19 you can't not and again, according to planning the agencies are going to actually be looking at this. Probably in november I mean, unless they just decide, they don't want to look at that at all, but I that would really hurt our feelings very badly. So if they, if they look at it, if this year, we may actually have a chance to really emphasize what what's important to us as a district, I see paige's hand yeah. I also have a question after pace a few things. First of all cindy. Thank you very much for sending me the buildings department and I think you sent me city planning, no preservation, lpc, the one thing that was missing there, and this is one quick question: does the bsa board of standards and appeals actually have any role in this? Okay? I don't remember them. Were they are they one of the agencies mark that comes to? They have never come to budget consultation. If any of the committees would like to develop a budget priority around what bsa can or should be doing or a need statement, we certainly could include that in the right place. Okay, because here's the issue from our super tools, meetings that we used to host at landmark west last year, the common complaint was the bsa- is very slow. It's five people if one person is sick, nothing happens and for 66th street landmark west attorneys have been waiting now we're into month nine of a decision of of what's happening on 66th street. So we can't go to court. We can't follow in article 78, etc. So one question is I'm trying to get my arms around this and not make it too difficult, but I think the bsa not that I want to throw them under a bus but they're not doing their job, because city planning can't make their decisions and neither can preservation, because the other issue that I want to table- and I don't know if it's something that I'd like to reach out with jay and michelle- is air rights transfers, because that's why we're getting these ziggurat upside down ziggurat buildings and cantilevers. So I need help. I see sima's on tonight, because I need to touch things with her as well, but is this something that we can jay and michelle would be willing to work with me on certain areas that impact city planning you're one letter off: it's k, nothing, hey, I'm! Sorry, okay! I think it would be good to share, because I was shocked by the DOB that was so detailed and this preservation, I'm afraid, is going to get axed every time. There's a downturn. They always want to cut up staff and not designate and do everything. So I think john paige on that one. Let me let me bring up to date about their budget consultation from last friday, which is that they are down five staff members. Somebody is needs to mute themselves because there's some sort of feedback here, but they're down five staff members and there's a hiring freeze, but other than that they have informed us that they can keep their staff. So I see a couple of more hands: let's go to those christian was next and then I see bev and stephen. First of all, I want to say that cindy and her team have done an excellent job and they always ever since cindy, came into the war and took over budgets. It's been excellent work. I I thought that we needed to have all the budget priorities ready for October exterior, because we need to vote on them right. Yes, we do okay, so basically we really have to have everything ready by then we need to decide them in October steering yeah. Well, I mean the full board votes on it. You can't just do it. I know I know in november, but in steering we decide the first time priorities right. Yes, that's correct! You need to come to October, steering with your budget priorities done and while you might have a little bit of grace period with respect to the written narrative part of it, that needs to be done more or less at the same time as well cindy if it's okay with you I'll, just call on beverly and then stephen yeah, I'm sort of taken with the calendar right now, because november has become incredibly important for several reasons. First, it looks like agencies will begin to see our priorities at that point in time. It's also the time when the state will have to make decisions about whether or not federal aid is going to fill the state budget gap, thereby permitting them to avoid further cuts to the city and in addition to that, the city in its January plan will have to accommodate whatever the state then does so. It could very well be that, instead of being a 2022 fiscal year needs reflection, it could very well be in the current year that what we put on paper makes a real difference. So I just want to point out that this is has some immediate consequences as well. I think you're right. Thank you, stephen yeah sort of a two-part question cindy. I just wanted to follow up on that email, which was about budgets. I mean we didn't. We didn't put budgets, it seemed more like it would be, throwing a dart on the wall and wanted to get your feedback if that's necessary and then the let the next one is maybe broader for you or mark just curi I'd be curious. Have we ever seen any of our priorities in the past years being sort of acted on and are we sure I'm just curious about the process? So I'm curious, I did something worked on. It was an interaction in it. Just curious. I did send the res. You know we get agency responses every year to our requests to our budget requests, and generally they say we need to study this or we don't have sufficient money at the time or go to your council member and see if they have some money. Generally. The answer or we've already started doing this, so I had sent out some of those. I think I sent them to the appropriate committee people. Sometimes I get confused where the lines get drawn and whose agencies go where and sometimes I send it to multiple people, because I'm not sure, but if you take a look at that and again that's another thing I can send out is the responses from last year's. If you take a look at that, you'll see that no pretty much no, the answer is no. Am I wrong mark? No, the well to the extent that things are acted on. It is the last of those things that cindy mentioned that that council members with their member items or the borough president with her funding available, will sometimes look to our statement of priorities as to when they are deciding among different projects to fund and then, as far as putting the dollar figure on last year, some of our budget requests did have a dollar figure attached to them, and that was just because I got those figures from the committees. I don't have any special idea of how much things cost. My assumption may hope that was correct was that they had spoken to agencies or elected officials or someone who knew how what the what the dollar figure was for that. I know with some of your stuff, like steve with your stuff. You know when you're talking in terms of making sure people have sufficient, you know laptops or whatever it is. You know it's. I was as I was reading it. I was thinking. Well, I guess we're thinking in terms of our district right. What are our district needs, but you're? Really thinking so is it is it that number is or is it the number for the entire for all of Manhattan or is it the number, for you know the whole department of education, so I mean I think we could just specify that if we have a number, we've also made submissions that didn't have a number attached, because we really didn't know, and you would hope that the agencies will know what the number is I mean my feeling. Is you just do your best? I know beverly. I know you've been involved in in budget. Maybe you have a sense of how much some of that stuff costs? For you know education or I don't know yeah I mean if you don't get numbers from the agency, it's sort of hard to come up with cost factors that are reliable yeah. So I guess the answer is number one. You could go to planning and ask them. Can you help us get this information from the agencies if you're not having any luck with the agencies, go to maybe the elected officials and see if they can help you get through the agency? Or you know, if you have a connection like I know, clary has worked with parks for many years. She has a relationship with them, go directly to your and hope that they can get it for you. But that's really I mean do your best. I mean we don't have the authority to order people to do stuff, we're just a volunteer community board. So all we can do is try a few different methods like I know. I worked on participatory budgeting and it was the same kind of thing. The community comes to the council member and says we need computers for ps75 and they don't just put that on the on the ballot, what they do it. What we did was we went back to the agency and said: okay. How much does that cost? So then we could determine whether or not I was appropriate for participatory budgeting and then also we could put it on the back. You know we had we needed to have a number because you're voting on the number. So I think this is similar to that, where we can think of what the thing is and a lot of people in the community have ideas about how money should be spent, but at the end of the day, as beverly said, the only way to get the answer to how much is that? How much is what is that going to cost is go right to the agency, which is in the agency that's going to later on where they said their responses say: there's insufficient money for this budget, so it's kind of we're spinning around a little bit, but I do think, as beverly said it's important this year, particularly to at least let them know what our priorities are so that hopefully in making their decisions, they will consider that great sorry that was long-winded. No that's great thanks and melissa has got her hand up just a quick technical question and pardon if you said this, I'm a little brain dead tonight. What's the best way to submit to you the budget items because they'll be entered into a form yeah just any way anyway, that's good for you. I mean a lot of people send a word document and I can just because it has to be there's a lot of like little click off things in little boxes to fit stuff. Anything where I can cut and paste is helpful with so that I could take the verbiage, cut it and then paste it into the into the document so excel or word I mean I prefer a word document or a or even you could put even in an email. As long as I can just take the I'm, not that particular it does. It doesn't help me one way or another as far as I can tell, and so I repeat one more time: what's our deadline, I guess it was yesterday well so now mark is saying by steering next to you steering we have to be able to be ready to vote. So you really need to have everything done by then is what I'm hoping for yeah I mean personally, I'd prefer coming in dribs and drab, so that I can you know if I see stuff that I think is not going to fit in. If I think there's some way that this doesn't really fit in with the form I don't know, I don't know what it would be that I would that I would see, but just I like to have things a little bit ahead of time. So again, I'm not at midnight in my pajamas trying to figure stuff out or make things up. You know I mean eventually I have to. I have to fit things into the document, so the sooner I can get started on that the happier I will be anybody else or are we? Are we ready to move on? So thank you very much cindy, that's great! Thank you very much for taking this doug's got his hand up. I'm sorry, no yeah, I just sent in the chat. I just I just wanted to understand what, when they, you were attending the the webinar, what they meant by external stakeholders and if you can give an example of that, like I, my impression was like the the community, like this riverside yeah pta. What do you call it? C, cds, cbo or goddard riverside is an external stakeholder external okay, even though they're in our district but they're an external stakeholder external to, I think it's just external to the community board right. Oh okay, thank you! Anybody else! Yes, thank you again. Thank you cindy and thank you for the effort that we know is coming and I'll do my best to be to share the load. But you did such a good job last year that you earned the reward for hard work is more hard work. Okay, I'm going to move this along a little bit. Josh is with us and has an update on the roster of candidates for board office josh. Can you unmute and give us the update? Yes, seema is going to withdraw her candidacy for vice chair, so it looks like all of the races will be uncontested, but we still need to have a vote because we do need to receive a majority for each office. We also have the election committee, which is going to be myself, barbara adler, susan schwartz, christian and richard robbins, so the five of us will have to count the votes in uncontested races for majorities and we're working on a system of how to do that, which we will have by full board in October yeah. Let's try to have it a week before so we can share with everybody, see what it looks like one of the ways that apparently will work. We have borough board this coming thursday, and so we will use that as an opportunity to see if the borough president's office and noel from beta NYC has come up with a template. Otherwise we will use the template that christian and rich were working on, and something tells me that the template that christian and rich we're working on is going to be very similar to the one that noelle had anyway. That's the that's the update there, just like the election in november. It is important that everybody vote, even though, because it is possible to lose an uncontested election, and I will you know anyway. That's all I'll say about that, and I thank the I see shelley's hand. I thank the election committee and the newly appointed members of the election committee for their service in this regard, because it's important to have you know a button-down process and we will get us there despite the fact that we're doing this online shelley, you have something you want to unmute shelley. You need to unmute like to point out that the november meeting will not be on november 3rd. Thank you. I was getting there but go right ahead, but it should, according to our cons by laws, it should be november 4th and it will be yeah that was gonna raise that later in the meeting. But since they were right here, we should not and will not hold a full board meeting on election day. So the november meeting will be the first wednesday instead of the first tuesday. That's the we were incredibly lucky this year in that religious observances. So far at least have not occasioned the need to reschedule any of our committees, but election day is election day, and we should all be cognizant of that. I'm looking at the agenda, I have an item here about supporting community and block association efforts, and I guess one of the things that I want us to be able to be in a better position to do is to correspond with block associations on a on a global basis. We have a database, we have hired somebody to help us make better use of that database and we will be rolling that out. But meanwhile, any of you who have a block association on your block, if you could send me the contact information for that, I would be grateful. I will store it and share it with as many of you as want the list, but we'll have sort of an sort of an informal list going and then, when we can do a better formal list, we will of course do that one of the things that we spent are our extra money. If you want to call it that in previous fiscal years is on building a database and now we have spent some of that money on hiring the builder of the database to finish that work, there's going to be a group of folks who have been continuing to work on that, I'm looking at roberta seymour up and there goes your hand roberta among others, is going to be helping us make sure that process follows through on the promise that that it holds for us roberta. You want to jump in on this yeah. I do. I do have it in the database. I already have some block associations. The problem is, it was last updated in 2009, noel and his team did some work on the block association and what I, what I need basically right now is in any current updates, with mostly people give out their email. We don't really need phone numbers. We basically, if there's a name, we need the name, but we many block associates just have one generic email. So thank you. So if you would forward that information, if you have it to both roberta and me, that would be great. Thank you. Doug is asking if we want tenant associations as well, I would say yes, more is better. So let's try to absolutely tenants associations co-ops. This database can hold a lot of information and we do have some of it but, as I said, some of it was last updated in 2009, and a lot has happened since then. Thank you- and I want to thank kay- gave us a great list of religious institutions which has been a big help. We just need to finish inputting that terrific, thanks, okay, unless there are further questions, I'm going to move this along here and the next is a agenda item has to do with full board meeting planning, and that was where I was going to mention november, but we've already covered that, so I'm moving on the okay. So are you? Thank you christian okay, there are. It looks like the this is the agenda as it exists now, except that there is a transportation resolution that didn't make it onto this draft. It will be added, obviously before October a couple go ahead. Also, the bc on the bci, the 153 155, was withdrawn, so that shouldn't be on the agenda very good, so christian. If you would send a note to penny and me by email to confirm that just so we don't forget, tell us, can you tell us what the subject of the transportation item is andrew? Do you want to take that sure it's something that we've taken up over the years, but there's some there's a some a new push, because community board four has also asked for the department of transportation to not have a sponsor for a curb extension. They have insisted on one. So it's about the southwest corner of 96th and west end avenue and we're asking for them to do the curb extension without a sponsor got it that we discussed that at the meeting. Thank you sure. Okay, the so that's the agenda. It doesn't like dangerous words, but it doesn't look like there's a show stopper resolution among those I'm always live to regret, saying those words, but so we'll try to make the October meeting move along that way. The one of the things that I've been asked in recent weeks to work on is the order of public comment. Those of you who were on either the information session for the hotel issues or the most recent full boards saw me try to move elected officials along in a way that you've never seen me move them along before, thus empowered and emboldened. I'm going to try my luck at that again, but more to the point. What I'm going to try to do is I've been asking them since, basically, since we went on zoom to zoom in if you'll pardon that expression at a particular hour, and I'm going to continue to do that, but I'm going to push that hour later, so that the public has more of a chance to speak before the electeds. Do I'm gonna at least try this out for October, the idea being that we would have the elected officials hear the community and then respond rather than then, and try to make us their last stop, rather than bouncing from one meeting to another to another, which I know that they need to do. Of course we will be hospitable hosts for those that need to do a quick drive-by. But that's my goal is to try to move us into that framework, because the public is feeling a little bit like they get the last. You know the last word when the last word on the one hand, but when no one's listening is on the other. It's not true, because I've been incredibly proud of all of our colleagues who have stayed on our meetings to the bitter end. It's a it's a full screen and screen or two screens. So I don't think that anybody can point that finger at our board, but sometimes they want to be heard not just by us but by each other and the electeds. So this is going to be my next attempt to try to make that happen, and we can talk about how well that goes at October. Steering we've just taken a look at the October, our agenda and we're going to add the transportation resolution and subtract one bci resolution. But I think that's basically it. I want to call to your attention. I will be circulating by the end of the week, or as soon as I can, there was an amendment or modification to the bylaws amendment that susan schwartz and I collaborated on about voting procedure. Remember there's no provision in the voting in procedures in the bylaws for voting online, precisely because there was no provision for holding a meeting online. So we have that, and the amendment was, I believe, christian among others suggested that we not time limited to a period of months but say for whenever it is appropriate and allowed to take a vote. An election during a remote meeting or a virtual meeting that these would be the procedures and remember that we have a bylaws committee that will be taking up a thorough, going review of all of the bylaws. So this is this still will be an interim measure, because the the hope is that we will come up with a complete discussion of of the of all the bylaws and how they interact with one another, including, of course, the voting procedures so and I'm seeing susan nodding your head. So I thank you for that and that I understand susan will be reconvening that task force in the coming weeks or a couple of months, and so I thank you for that and anyway. So I think that's all there is to say about that. I'll get that out. I'm gonna run the new text by susan. Ask you to make sure that I captured it correctly christian. If I could look to you for that as well, just to make sure that I've captured it correctly and then we will share it with not just all of you but the full board, anything any questions or concerns about full board meeting planning. I do have a couple of new business items and there's been one person who's been requested. Been requested, has requested an opportunity to speak so don't run away. I see kay with his hand literally raised not virtually yeah mark. I put it in the chat, but I think we can take the preservation item off because of the timing of landmarks commission. Is that correct? No, that's, not correct. It is very important. It is important for our board to vote on resolutions, even if lpc has already heard the memory. Okay, the reason is that we want to be consistent with how we do our business, so we don't want to set a precedent that doesn't come before the full board, and so we don't have to belabor it, but we certainly should take a vote on it. Okay, thank you for that, and I don't see any other hands raised. Whoops susan has got her hand raised. So please go ahead. I got a quick question. I don't wanna put anyone on the spot, but there's no agenda listed for the hhs meeting later in the month. I'm just wondering if anyone knows has an agenda for that yet or could share it. Yeah the it's almost devoted totally to the DNS. We have six different people working on different aspects, actually seven and they're going to report and share and we're going to give each other feedback and finalize our statement and work on the budget priorities and numbers to extent we could get them. So that's the that's the agenda it should be on. We had originally sent in that would be the DNS, but then I believe catherine sent them the list of the topics. You know this is the seven topics he hasn't made it into the website. Yet, ah so shelley, let's you and I to tomorrow, get something up on the website to reflect the agenda. That's all doesn't have to be the seven topics, just that that's what the agenda will be. Okay, thank you for that. Thank you. Susan. Don't see any other hands, I'm going to scroll real quick here in case anybody's raising their hand physically, but I don't see it so. I'm going to move us along to effectively new business one item of new business. I just want to remind everybody, because there's been a lot of controversy in the district. You may have heard or read about some of it, and I just want to make sure that we're all on the same page about speaking on behalf of the board when we speak on behalf of the board, it needs to clear through me or whoever is the right person. I will certainly delegate to the appropriate committee chair on committee business and encourage committee chairs to be the spokesperson for the board on the appropriate matters, but let's please make sure that we talk to each other about that, because casual conversations in the hands of the media sometimes become statements that sound like they are on behalf of all of us. So I just a gentle reminder about that. Please jay adolf asked for an opportunity to speak, and after that I have a couple of points for you about borough board this coming thursday. So please stay tuned after jay mark I've. Seen luisa for a question her hand raised for a question what you had just said: okay, I didn't hear who it was, but whoever it is. Please, oh louisa. Thank you. Go ahead, louisa. I was just wondering if we have a statement on the situation, the situation, meaning the use of the hotels for the protection. Absolutely we do not have a board position on that. Shelly is waving his hand. I see you do we want to. My personal view is that we are performing a very important function of trying to participate in identification of issues and bringing people together to try to address those issues on a case-by-case basis, and we are in a situation where there is an awful lot of dissension in our community and a lot of misinformation in our community, and we perform a very important role by being facilitators of conversations rather than advocates. So that would be my suggestion for you, but I see shelley's hand and there may be other hands after that. Shelley, please position, but I'd like to point out that the board voted on the whole topic, I believe in may or June. We encourage the mayor to use for the use of hotels to deal with congregate settings where people were in danger health-wise now he did took a long time to do it in certain cases, but we supported that, but on the condition that it was with health, aids or nurses providing food providing social services. The fact that perhaps in one at least situation, the execution of it was very poor and non-non-um non-consultative and the preparation apparently was not good, doesn't negate the fact that we, I think, unanimously approved the for health. The health situation during Covid-19, the use of the hotels for this purpose. Thank you shelley, and that just points out even starker relief. Louise I'll get right back to you, but points out in starker relief. How the devil can be in the details that you can before something that makes a world of sense and still have issues with how it's done so and that's where I think we had our best value right now, but that's just my view of louisa. You want to continue well, just as the situation has changed and the point is: do we support keeping homeless in the hotels in our community board rather than doing this kind of round robin that the mayor had advocated well, first of all and I see linda's hand and I'll take a few more first of all. I am. I have no confidence that we've heard the last of any of this, that the situation seems to change every day. So one of the things that I would fear is taking a position on a set of facts that will be misconstrued to relate to to a new set of facts as they change tomorrow, and I think again that we do a better service by trying to connect people and information and resources than locking ourselves into a particular volatile situation. Linda, did you have your hand up and then I'll take their hands and just very quickly? I don't think we can take a position on this in terms of the number of people in the hotels right now. It's moved because the mayor's decided that they're going to stay there and he was playing around robin anyway with moving them relocating from one hotel to another. But I think the issue really is about transparency from dhs and that's our biggest issue and we've suddenly had 686 folks brought into the neighborhood at one time, with no oversight. No cons, no consultation, no transparency to the community board, our elected officials. That's that's untenable and I think that's the issue that we can stand on, but you know just I think, the upper west siders for safer streets and the upper west side, community group they've got a handle on it with their own opinion, but we're a community board that represents everyone, and I think the biggest issue is the fact that we kind of got blindsided and that and it's been going on for 20 years and it shouldn't be going on at all. So it's got to stop so that I would take a position on, but perhaps not now, maybe that maybe, when this is all said and done would be the right time to think about that, because there may be more curveballs coming our way. I see. Clary has her hand up and I'm going to call on her and then I'm not sure if we'll be ready to move on yeah I was. I was just going to say that I think mark is exactly right. That we have, we have what we've been doing is great. Actually, we have repeatedly facilitated in one central place and convenient place for people to congregate, on zoom, extensive discussions where we have brought together anybody in our community that wanted to talk about this ongoing changing everyday situation. That's exactly what we should be doing, we're still doing it. Not only do they express their views, but, as mark pointed out, we spend all night ourselves listening to them, which is part of what we do. But I agree with mark that it would be just a huge mistake for us to take a substantive position aside from the fact that the facts change every day. Thank you is anybody else want to weigh on this. I don't want to shortcut this important discussion, but I also don't want to take more time than these. Doug has got his hand up. Sorry yeah. I just wanted to say that I don't perhaps what we could take positions on are secondary and tertiary issues without weighing in on an opinion specifically, for example, we all are against any crime in the neighborhood that may be related to this or additional services in congregate settings where appropriate. If they are there, so it's you know it. There are. I think I think, there's a whole set and subset of issues that are that you unanimously would be agreed upon, and safety is one of them without taking a position on whether or not the hotels are being used or not. Does that make sense again? I don't want this to be a dialogue between me and everybody, so I think I think we all hear you, I'm not sure, there's any move right now to do anything different, but this is this absolutely will be topics for continued conversation as we move forward yeah nice tonight. Yeah. Thank you. Thank you. When I see susan go ahead, I know that you've been having what are called small group meetings with various stakeholders in this, but I'm wondering if we should perhaps have this on our agenda for the full board meeting, so that the community feels at large that they can be heard, because I've heard comments from a number of people that they feel that those smaller group meetings are really contained and there's not been a kind of open forum. The way we had, for example, with the equally contentious issue, which is museum of natural history, where we had many meetings that were very open. So I know that you know there might be dissension within the board about how we feel about this, but in our role as being able to provide a platform where everyone can feel like they're heard it might be something we might want to consider for the October board meeting to put that on the agenda, particularly given that the agenda is relatively lean right now. That would be a nice opening. I'll, certainly consider that we have a public comment session. I I'm mindful the fact that we had an information session with 1389 people present very different takeaways from that experience, depending on where you might have found yourself in that dialogue, we had a full hour of that kind of comment at september full board, and if we had another hour of that at October full board, I would be delighted. I think we need to be careful on realistic what we can realistically deliver in terms of in-person open, mic conversations. The small group meetings don't work in a in a big group setting. You can't have 1300 people come to what is effectively a community advisory board kind of meeting. Although the borough president's office with our support, has done a pretty good job of making sure that key stakeholders are there, so we'll continue to do our best. I don't know if those are going to continue by the way, because I'm not sure that the service providers will have a heart for continuing to discuss how to make things better in hotels that they're expecting to be kicked out of at any minute. So I'm more thinking work about the the community at large have an opportunity to let the community board know how they feel about. What's going on a day-to-day basis, you know where we are at the time of October. Full board might be very different from where we are right this moment or where we were a month ago. That's all there might be something to consider, because to leave it just as open as it's. The community session people can know to commemorate.com is very different from putting on the agendas and actual items saying. This is something we're welcoming comments on. This is a thought. Thank you for that. I won't. I won't belabor the point, and maybe we can talk a little bit offline about what that would look like, because I'm not sure I have a precedent for that, but doesn't mean it can't be done. I see cindy with her hand yeah. I just wanted to I understand where susan's coming from, but I think, if you put that on the agenda, you need to make sure that there are people there who can answer questions with facts who are from you know, different agencies from the service provider. So if you, if you put it on the agenda- and you don't have anybody there to speak to it, who's dealing with it as an agency or as a service provider, then what are we doing? Why are we? You know we don't it'll, just be us listening and having no one to ris to really respond. So I think I think I hear your point. I think it's more of an open forums that the electives will be there and they can hear it. That's all yeah, assuming that the electives are there. So, let's work on that a little bit. I think we, I think the point is made for this group and then how we go forward from here is something we should talk about, but I'm open to the at least having a discussion. I thought we had all the hands, but I'm looking at the list here it looks, like ken, has his hand up ken. Can you unmute? Yes, I just wanted to say that this is the biggest issue that has come before our community in a number of years and certainly the most profile. One city-wide, and it just seems amazing that we haven't taken a position on it. We've taken positions on many other controversial issues, and if we had taken a position earlier, the mayor might not have felt emboldened to do what he did last week. If you have a window into the mayor's thinking, I would encourage anybody to share. It might have helped. Thank you, ken howard yeah. I just wanted to say that there's more to it than just getting information, people in the community may want to advocate that the community board take a position on it, so that may be a motivation for a lot of people as well, so some people may be interested in information. Some people may be interested in basically supporting what ken just said, advocating that the community board have a position, because it is obviously a very critical issue facing the community. So there are all sorts of motivations for attending a meeting, and many people may not be particularly interested in information. They may be again interested in getting us to do something. Thank you very good. Thank you. Anybody else, elizabeth, are you raising your hand, elizabeth? I am, but if somebody else did it before that's fine, like howard, I agree with what you're saying, but I, but I also think we have a responsibility as a board to be a convener, and there are plenty of groups right now. We many of you are involved in and some of them that are taking a very activist approach on one side or another. I think for us to get engaged in that we've already done it, we've hosted numerous meetings, we've hosted hours and hours of conversations about this. I would really like for our board to be a source of knowledge and resources and whatnot, but not to have you know, I think, to have us sort of weigh in on an activist side. One side or another is is really tough for us right now and I I'm not sure that that's something that the community board seven should be doing. So that's all okay, I don't see any other hands, so I'm going to turn to jay who wanted to make a statement, and then I have a couple of questions and or updates that relate to boroughboard. So please stay tuned yeah thanks and thanks mark for giving me excuse me a couple of minutes. What I have to say is somewhat related to the discussion that just preceded it, but I asked mark for the opportunity to talk to the steering committee and I would have done so to the full board, but I wanted to do so now, and I want everybody to understand that, despite the fact that we have often have disagreement on a whole host of issues, I sincerely wanted to speak to you guys, because, notwithstanding any disagreements that we have from time to time all of us as volunteers, on the board and residents of the west side and of the city, I sincerely believe always have the best, the best of intentions and a sincere desire to do what we think is best for the welfare of our community and the city as a whole. I've been a west sider for a long time, I think, probably more than anyone else on this board more than 50 years and I've and I've been a city resident all my life, including the time I took to raise three children in this city. I think, frankly, that our city is in a dangerous decline. I've lived through the financial crisis of the 70s when much of the west side was unsafe, the streets were often filled with garbage used, crack vials, broken automobile windows along the curbs, etc, and through those years a lot of families like mine with young children, were fleeing the city, including our neighborhood. But you know I personally, I made a decision to stay. I've also been here while the neighborhood, along with so many in the city, recovered and became a desirable and attractive place to live lately. I've been become concerned and anxious about the future of our community and the city of the whole. Our government and our local officials, in my opinion on many issues, have become tone deaf to the needs and concerns of a substantial number of our neighbors. The latest example, as the preceding discussion indicated, was the sheltering of homeless men throughout the district, a district that has always been concerned with inclusiveness and a willingness to help those needing help. The most our neighbors, who expressed genuine concerns for theirs, their children's safety for the proliferation of offensive and dangerous conduct in our streets were and who, in my opinion, justifiably became very angry at not having been involved in the process, have been greeted by derision accusations of racism and NIMBY-ism. If, by the way, if that's a word, I'm not I'm not sure, but they have been by our elected officials, and I think, sadly, by some of our colleagues as well. The failure to consider the needs of all segments of our community has also occurred with regard to other issues, for example the crusade to eliminate street parking where the needs of car owners were and continue to be, ignored completely, where so-called open streets were established, with no input whatsoever from the residents of those streets and this week as an example again with the scheduling of a fair on those open streets which are supposed to be peaceful residential streets, not commercial avenues or parks, no input from the residents, many of whom were working from home. And oddly, according to some material. I saw today with sponsorship of cb7 with no public discussion that I'm aware of people are again fleeing the city, many of them middle class, upper middle class and, frankly, wealthy people who have a choice to leave and likely will do so more and more if the city continues on its present path. These are people who support the city directly by paying some of the highest taxes in the country and indirectly, by supporting cultural and social institutions and local businesses. I I'm saying all this not to stir up a debate, though I see that one kind of preceded it, but asking that we all consider the consequences of our actions and their effect on everyone in our community mark. Thanks for giving me the time I appreciate it. Thank you jay. I personally want to believe that we all have those best intentions and best interests of our neighbors at heart, especially when we disagree with one another on contentious issues. That is the soul of making sure that all voices are heard, and I want to believe that. I want to try to model that for myself and I will take to heart what those sentiments and continue to value the diversity of opinion on our board and unless I see another hand which I'm going to quickly close my eyes so that I don't I'm going to move us to the next part of the agenda, which is the borough board. Is this coming thursday, and there are two resolutions that have been that I got today. So I will be asked to vote on them on thursday. One of them has to do with mayoral advisory boards and how there are no community board members from any Manhattan community board on any of them. We previously actually opined on this back in the spring, slightly differently phrased than the one that's going to be coming up on thursday, but I'm going to I'm going to vote in favor of a request that that the mayor include community board representatives on his reopening panels or his reopening committees to make sure that our voices are heard and through us, our community's voices are heard. The second has to do with a proposal relating to central park and under ordinary circumstances. I would like to have a committee vote on this, but, like I said I got this today and it's on the docket for thursday. It involves you what some of us may remember as the central park jogger case with five young men who were it turns out wrongfully convicted of having taken part in that brutal attack and were later exonerated complete with a different person having confessed to the crime and having dna evidence confirmed that confession was, in fact, not fabricated and indeed was valid to the extent that our judicial system allows for that. There is a request that originated with community board 10 in harlem to have a some kind of commemoration or acknowledgement of what are now being called the exonerated five, as opposed to the central park five in central park. The vote on thursday will simply be to encourage the creation of such a thing. Those who are familiar with this process know that nothing would be erected in central park without multiple layers of review, including by the landmarks preservation, commission and, of course, the public design commission, which has complete oversight over anything and for those who were able, as I was to go, see after its dedication that statue of the three suffragist pioneers susan b, anthony sojourner truth and elizabeth katie stanton know that was the first new structure of any kind of commemoration in central park in 70 years. So there is a robust process about whatever this might end up, looking like where it would go, who would be involved in creating designing and implementing it. So it would be my intention, consistent with our core principles, to vote in favor of a resolution asking that process to continue not necessarily but which, mindful of the fact that whatever it would look like, would be something that something that would be subject to considerable further discussion and debate. I see clary's hand right, so we live in a time now when everybody seems to be falling, including all of many of us falling all over themselves to be what they perceive to be politically correct in the moment that we're in even if they don't all agree on what that is, and certainly that is an explanation for this, and it was an important event and it was a that remains in our memories and it was a severe miscarriage of justice, and that has fortunately been largely now rectified, and you can't give these guys their lives back, but has been recognized and, to a large extent, rectified. On the other hand, central park is a c. Is it not only formally a scenic landmark, but it was built and is intended to remain as a place of repose. The placement of the suffragette statue was in a location that had 100 years ago, been does longer than that actually part of the literary walk where there was a single location, symmetrical with others that had not been filled in with the statue and that one was considered to be appropriate for there. I'm not saying at all that I disagree. I know, certainly when we were considering our own board's position with regard to that statue. The designers, the planners at the conservancy expressed the view to us that it was not appropriate to be adding that this was an exception. It was an understandable one, but it was not appropriate to keep adding heart. Let's call them hardscape whatever they may be. I don't think that was their word, but to keep adding elements to central park that are part not part of its natural landscape and place of repose. So while this sounds sure why not, as mark said earlier, somebody just said earlier, the devil's always in the details, and this could be anything between a plaque or a some a sign or something on 102nd street. It's not a transverse but the 102nd street road. Where the incident took place. Many people might consider that as a historical marker to be appropriate, it could be anything from that to many other things to you know to something as big and aggressive and as the suffragette as the monumental women or anything in between or a whole lot of other things. So I just think we need to be really careful about inviting anything other than something that's green and landscaping into central park mark. I don't know that. I oppose your voting. Yes, but I do think it's a slippery slope, so thank you clary I should I should I should let me give a little more context. If I may, the concept of an exonerated five acknowledgement in the park is not new roberta. I see your hand if I may finish. First, it's not new. What's new, is the borough president putting it on the agenda for this week cb10 I actually attended a meeting or a webinar or whatever you want to call it where cb 10 explained a little bit about what they had in mind, and it was attended by yusuf hawkins who dr hughes hawkins, who is one of the exonerated five and spoke eloquently about some of his experiences there without a trace of bitterness. It was a remarkable evening. The while clary is absolutely correct that this could take any form and they were quite open to hearing what forms might be appropriate. There was no proposal as far as I understand it. There still is no specific proposal about what this should be about or what it should look like. The only reference point that they gave was that there is a plaque or sign in central park that acknowledges the location. The site of what I understand is called seneca village, which is a native american habitation that was within the boundaries of what became central park and depending on whose history you read of it was removed from that site in rather abrupt ways. So that is the best point of reference I can give you the only other thing I will say and I'll say this very gently other than to say that the slippery slope is something that we can revisit and if somebody wants to put a saturn v rocket in the middle of the great lawn and call it the exonerated five memorial that we will have plenty of opportunity to weigh in on whether that's the appropriate way to acknowledge this. I hear loud and clear clary's park, centric focus on this part. You know that makes wonderful points in this moment with all that else, that's going on and the way in which the media is having a field day with the upper west side. My voting against even an abstention, which is a vote against that's a soft. No am I voting against a concept. Not even a statue might be something that fuels a fire that we don't need to fan right now. That was my other thought that I should have included in my remarks before I'm sorry for going on about this, I'm going to turn to roberta and then anybody else who wants to be heard. First of all, the seneca village was african-american american and some native americans, and if, in order to vote, you needed a black person needed to own property, and so the people owned property in seneca village and were able to vote it's a very exciting. I think it's one of the most wonderful things central park. Conservancy has done a long time. I think having something for the exonerated five is absolutely beautiful. I think it's very important. It's especially important to our it's a message that we care about people deeply, that we've made mistakes, that you know stuff happens and we make mistakes and we apologize for our mistakes and I'm sure that it's going to involve all of the all of the community boards that surround the park in any decision making, plus the borough president and I think, having something wonderful. Whether doug had suggested planting five trees, but I think some signage some explanation about you know the what went wrong. What should have gone right? I think it's an absolutely fantastic concept and I would be very upset if you weren't there and you couldn't vote for it, but I know you will be there and I know you will vote for it. Thank you for thank you roberta, and I commend you to the chat where doug has put an interesting idea and I'm going to call on howard finishing the wrap howard. I think you need to win howard. You need to unmute you're right. This is this. Is a resolution just to explore the possibility of this? It's a little more than that, but it but it, but it doesn't say what the it says that we should go forward with something in the in central park. For the exonerated five, it doesn't say whether it's a statue or a sign or up five trees or whatever it might be well. The concern was that it would be some kind of hardscape monument. So that's not no pun intended put in stone, that's something that is yet to be considered absolutely, and there are a lot of people whose approval, besides ours, but typically anything that gets added to the central park in the way of this kind of a thing requires a referral to all five community boards that border the park with a view toward it eventually being approved by the landmark preservation commission, which then writes a letter that recommends whether or not to approve that whatever that is whatever it is to the public design. Commission, who has, I believe the final say on whether or not the design is approved, and if you were following the suffragist statue after it left cb7's hands. You know that it was the subject of significant input and further review and revision after the community boards and the lpc weighed in so we should try to keep the discussion to not whether we should have some kind of monument or some kind of whatever it's, whether we should just get more information on it, whether we should pursue learning about this, and if that's the resolution, it's fine with me. No, it's going to be a little more than that. It's going to be calling on folks to move ahead with such an with an action. It's an aspirational resolution. It is not please build this thing in this place. Okay! Well, I understand now, christian, I see your hand is up. I mean my major reaction to this would have been like the actual. What happened might not raise to the level of that? It requires something in central park, but the context of it whether it was five minority kids that got railroad and now, and that probably indicates that the systematic problems that we have with racial bias in the system and given the climate of everything that's going on around us in the country right now. I think this is something that's worth pursuing. Thank you. I think the central park connection is the is that's where the crime occurred. Right, yeah, all right, I'm gonna! I'm going to move forward with this. I appreciate all of your comments and pledge that, if there's any way that we can even double down to ensure that whatever next step is something that we have a complete visibility to as a board I pledge to do. That is the last thing that I have on my agenda. I open the floor for new business or comments. I don't see any hands raised, I'm scrolling through. So I'm going to motion auctioneer going once and going twice. I think we all want to give a big round of applause and thanks to cindy for the incredible job that she's already done, as well as the one that she's already she's signed on to do in the future. So thank you cindy and with that I deem us to be adjourned and look forward to seeing you full board in October, if not before, motion good night good night. Thank you all. Everybody right.",
        "summary": "But, given my track record, I'll find a way, the the first order of business and the thing that I want to make sure that we have plenty of time to discuss and understand is the is preparation for the district needs statement.\nNeeds statement and about the preparation for the budget priorities that need to be voted on at the October steering committee, so that we can vote on them at full board in november, I'm stalling for time.\nOne of the things that city planning went through was talking about the timeline They talked about attending the borough budget consultations in september and how our community boards need to schedule, meetings for review and votes on the issues, the needs and the budget requests, which is what we're starting kicking off now and that internally, we're supposed to be collecting input and enlisting support from elected officials and stakeholders on our key priorities.\nAll of the committees have reached out to maybe elected officials or ngos or any other groups you can think of for input in order to help formulate your district needs statement and budget priorities.\nSo, I'm sure most of you who are on the board last year will recall that during steering we were voting on top priorities that the board has to decide on what our number one priority is like the majority of community boards last year , our top priority was was a housing issue was okay, but there are other choices we can have other.\nThis will get done one way or another and then and then and then in november, omb, actually distributes our budget priorities to the agencies, which is why that deadline of October early november is so important, and then city planning distributes.\nWe have a unique opportunity this year to have our opinions, considered more so than other years, because they're going to be making tough budget decisions in a tight time frame, and this will be a document that ostensibly reflects the will of the community, and I- think that when you have to make a tough decision, it's a lot easier to make it with the strength of some support than to just make it.\nA streamlined approach where you have a good rapport with your corresponding agency is, of course ideal, and I would encourage everybody to do that within the framework of whatever makes sense for your committee, And I'm happy to have people reach out to city planning, and I can give you know I, Wouldn't mind being copied just so that I can see what the what the conversation is.\nOne is the narrative statement of district needs and the other is the budget priorities that your committee decides upon, and then they become the fodder for a unified list of budget priorities for the whole board.\nWhile, the budget priorities need to be voted on at november, full board, I, both out of out of gratitude for cindy and the committee for taking on this very difficult and time-consuming task, and because you know, we've been kind of working on this.\nAny of the committees would like to develop a budget priority around what bsa can or should be doing or a need statement.\nOne question is I'm trying to get my arms around this and not make it too difficult, but I think the bsa not that I want to throw them under a bus, But they're not doing their job, because city planning can't make their decisions And Neither can preservation, because the other issue that I want to table- But is this something that we can jay and michelle would be willing to work with me on certain areas that impact city planning You're one letter off Let me bring up to date about their budget consultation from last friday, which is that they are down five staff.\nYou need to come to October, steering with your budget priorities done and while you might have a little bit of grace period with respect to the written narrative part of it, that needs to be done more or less at the same time as well cindy if it's okay with you, I'm sort of taken with the calendar right now, because november has become incredibly important for several reasons.\nYou know we get agency responses every year to our requests to our budget requests, and generally they say we need to study this We don't have sufficient money at the time or go to your council member and see if they have some money.\nThey said their responses, say, there's insufficient money for this budget, As beverly said it's important this year, particularly to at least let them know what our priorities are so that hopefully in making their decisions, they will consider that great sorry What's the best way to submit to you the budget items because they'll be entered into a form.\nWe also have the election committee, which is going to be myself, barbara adler, susan schwartz, christian and richard robbins, so the five of us will have to count the votes in uncontested races for majorities and we're working on a system of how to do that, Try to have it a week before so we can share with everybody, see what it looks like one of the ways that apparently will work.\nThe next is a agenda item has to do with full board meeting planning, and that was where I was going to mention november, but we've already covered.\nThose of you who were on either the information session for the hotel issues or the most recent full boards saw me try to move elected officials along in a way that you've never seen me move them along before, thus empowered and emboldened.\nThe idea being that we would have the elected officials hear the community and then respond rather than then, and try to make us their last stop, rather than bouncing from one meeting to another to another, which I know that they need to do.\nWe have six different people working on different aspects, actually, seven And they're going to report and share And we're going to give each other feedback and finalize our statement and work on the budget priorities and numbers to extent That's the agenda.\nYou want to continue well, just as the situation has changed and the point is: do we support keeping homeless in the hotels in our community board rather than doing this kind of round robin that the mayor had advocated well, first of all, And I'll, take a few more first of all.\nWhen I see susan, go ahead, I know that you've been having what are called small group meetings with various stakeholders in this, but I'm wondering if we should perhaps have this on our agenda for the full board meeting, so that the community feels at large that they can be heard, because I've heard comments from a number of people that they feel that those smaller group meetings are really contained.\nYou can't have 1300 people come to what is effectively a community advisory board kind of meeting.\nMore thinking, work about the the community at large have an opportunity to let the community board know how they feel about.\nThe community session people can know to commemorate.com is very different from putting on the agendas and actual items.\nIf you put that on the agenda, you need to make sure that there are people there who can answer questions with facts who are from you, know, different agencies from the service provider.\nI'm, going to vote in favor of a request that that the mayor include community board representatives on his reopening panels or his reopening committees to make sure that our voices are heard and through us.\nIt's, especially important to Our. It's a message that we care about people deeply, that we've made mistakes, And I'm sure that it's going to involve all of the all of the community boards that surround the park in any decision.\nThat's something that is yet to be considered absolutely, and there are a lot of people whose approval, besides ours, but typically anything that gets added to the central park in the way of this kind of a thing, requires a referral to all five community boards that border the park with a view toward it eventually being approved by the landmark preservation commission, which then writes a letter."
    }
}