{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q",
            "title": "Education",
            "publishDate": "2020-05-20",
            "shortDescription": "Manhattan Community Board 10's Education, Youth, \\u0026 Libraries Committee Meeting",
            "lengthSeconds": "1:25:45"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "p5f5GSFalig",
            "fillerWordCount": {
                "uh": 154,
                "um": 247
            },
            "readTimeFullTranscript": "37 min read",
            "readTimeSummary": "4 min read",
            "wordCountFullTranscript": {
                "students": 41,
                "kids": 39,
                "school": 25,
                "links": 24,
                "summer": 22,
                "program": 19,
                "food": 18,
                "chat": 17,
                "schools": 17,
                "teachers": 17
            },
            "wordCountSummary": {
                "summer": 8,
                "students": 7,
                "program": 7,
                "school": 6,
                "youth": 5,
                "teachers": 4,
                "concern": 3,
                "homework": 3,
                "teacher": 3,
                "help": 3
            },
            "fullTranscript": "Foreign is thank you every day, deborah. You know how to unmute yourself right good afternoon, everyone good afternoon hi. How are you make if you want to speak just make sure you meet yourself, hi, I'm Debra Yates, I'm chair of the education, youth and libraries Committee welcome we're going to give people a few more minutes before we get started you, okay, janae. How are you doing? I see you looking down I was going to. I was going to message to tell him to make me the captioner you're, not oh okay. I did that already. No, it says withdraw closed. Captioning permission hold up. I just did it thanks, fatigue. Majes, I put all the links in the chat. Is that all of them that was on that was on the pump initiative. I do not see the one about the library card. That's on there. Is it nypl.org the nearest pantry? All of it is okay. Thank you, yeah. Okay, thanks a lot, I appreciate it. I was technologically having a problem with that. I appreciate it so we'll give people a couple of minutes and then we'll get started. There's not a lot on the agenda so, but I still think it's important to me to find out what's going on with people in the community hi Miss Kramer. How are you hi? Welcome? Good everybody mostly, but I like your face. Thanks for joining contact goes a long ways these days, huh thanks for joining and joining us this evening. We appreciate it. What organization are you with? Well I'm a resident here in the in the community, so oh cool and I the reason I'm on tonight. I've been trying to monitor your regular emails and news and bulletins and all that, but I'm a little bit concerned for some of the children who might be falling behind with the school sure tutoring or any okay. You know you can definitely talk about that once the meeting gets started. Thank you. That's a one concern! So, okay, thank you trying to wait for a few more committee members to get on board. I do not see any of my committee members- hmm, not one again for those of you just joining I'm waiting for some of my comm. My name is Deborah Yates and I'm chair of the education, youth and Libraries Committee. I am waiting for my committee to join. I do not see them yet so we'll give them a few more minutes and then we'll get started with it without them, because I'm here and you guys are here and we can- we can start talking, I'm going to give them until 6:40, just so that you know, and then we'll get started at that at that point, it's 6:37, so I'm going to give them few more minutes. While we wait. I just want to point out that we've posted several links in the chat there's a link to some tutoring help for students, there's a link, letting you know that they're still hiring for contact tracers. If that's something you're interested in there's a link for absentee voting. You can, because there is an election June, 23rd and there's a link to the first link is to let you know where you can find food help in them in your neighborhood. So if you want to take a look at those links, we're going to be starting in about a minute. Hey crystal thanks for joining, you have to unmute yourself. There you go. I still can't hear you no do you know where I can hear crystal she's she's off of mute. She just has to check her audio on her end. You can test for audio when you first join the call crystal. Can you hear us now she's up she's, muting and kneading herself, but can't hear you dear, you need to click on the there's. A microphone in the bottom left hand corner of your screen. If you click on the up arrow up, you can just make sure that you are. You have the microphone and the speakers clicked perfect off no huh. I think she should log out and then log back in should he suggest you log out and then log back in she's going for assistance. I said I'll put a thumbs up if she can hear you he she logged out. So hopefully she'll come back and as soon as she comes back, we will get started. Thank you so much for your patience, everyone. I do not see anybody else here. She comes. Oh there's, Jamella, Yay, Hey, Jamila hi. How are you today? Okay? How are you I'm good we're going to get started? We're just waiting for crystal to come back in okay crystal okay? Can you hear me yes, hi? How are you good how y' all doing everyone so we're going to get we're going to get started? It seems as if the rest of the committee is not here. It's just you and Crystal and Jamila. I know marquise is coming on. He said about 6:45, but we're going to get started in new way. I just want to re again. My name is Debra Yates and I'm chair of the education, youth and Libraries Committee. Thank you to everyone for joining this evening. I do want that. There are some links in the Ch chat and the links are for different things. The first link is for food help. If you need well actually the first one is for academic support. If you need some academic support, that's there there's one there. If you're going to need assistance with air conditioners, there's a link there. If you're interested in being a contact, tracer, there's an in there's a link there for the New York public Library, the New York public library offers so many great resources you can download. They have a app called simply e and you can read the books. They have homework, help they have homework. Tutors, Crystal, mckay who's on my committee. Who's on this committee works for the library system. She can you Wanna tell some of the things that's going on with the library system crystal okay. So, like you said, we have tons and tons of resources. They also have a good resource for Covid-19 help different branches have their own web websites and or facebook pages for different food testing. Things of that nature that you can go on in your community. We are also trying to link everything together, but it's so many resources. It's best that you go to one that maybe that's closest to your neighborhood, to find out different aspects, especially of the bonus everyone's been asking about that simply e. You can get a library card, a digital library card, so you'll be able to log into simply e and on your sources. So that's really good as well. You do not need an actual card. Can you talk? I think that a major concern with a lot of people is students falling behind, and I noticed on the New York public library website that they have quite a bit of homework. Help and mentoring. Can you talk a little about that offering within the New York public library system, okay, so one thing I do we're not necessarily tutors. We do have the the teacher's help the ABC mouse they have tons of. When you go on the children's children's website, they have all those different reasons yeah. I did not write them down or look at them prior, but I do know they have quite a few. The one main concern since now, with the Covid-19, that's hitting the kids and as far as us returning to our branches. That is a major concern and they are working serious furiously on that issue, because it's not just for the patrons it's for the staff as well as handling and how they're going to be treating everyone moving forward. So we do not have a date of when we're opening. We are going by the governor's guidelines and maybe extra. There are plenty of webinars that people can go on. Regular people can go on that are talking about different aspects of librarianship as far as how we're going to be working with patrons how we're going to be working with kids, what we're going to be opening? What are we going to be closing? You know, so there are tons of webinars and you can find that out on our website as well yeah. I noticed that they have a partnership with an organization called brain fuse where they're offering live help in math science. Reading writing social studies- that's awesome, yeah, and so you can get free online homework help one- on-, one tutors daily from 2 to 11 P.M, it's available in English and in Spanish, and so that link is posted here where it says it's also another link for varsity tutors. That also offers help for any students that need that. So again, the links are uh- huh, no only saying crystal had got. We have gotten a request of having a lot of our online resources in other languages, preferably someone asked about Mandarin and French, so they always things like that. The library but we're not the end dog there, there's Brooklyn public library and Queens public library as well, and you can go on their pages because they may have something that we do not have. So we all are working together but try those as well as like. If you needed another language or you know something extent, try them yeah and there's one other thing that I put in that I took from Gail Brewer's newsletter. It's called the pump initiative, it's also in the chat room and it's an academic mentorship program. That's based in Harlem it's a virtual learning program designed to help middle and high school students pass their classes. The classes begin on the 18th, which is Monday. They have a rolling admissions policy and you have fly, and so just wanted to point out that I see that Leona Willis said where the links in there, if you scroll up in the chat, you should be able to see all those blue lines on the links. Awesome, I'm glad that we all are, though, pulling together to help, and if and if you, if you still can't see them, if you put your email address I'll, make sure that they get to you. But if you scroll up, you should see you should see it says: commit Manhattan community board to everyone they're all kind of together, but those are all the links. Okay, let me know if you're still having problems, Km, K Kramer says she's having problems either I mean as well. So let me know if you see them above they're not showing in the in the chat and even when you go up, there's they're still not showing there could you do. You know why they might not be why they may not be showing no. Do you see them Deborah? I see them yeah, so you guys do not see a chat from Manhattan Community board 10 to everyone with a lot of blue link lines. Marcus. No, the first message in the chat is it's from Leona. Oh really, even though it says to everyone, that's interesting wow. We can look at it afterwards right. Let me see if I can. I do not know. I see them Deborah, I'm not sure why who's who said that they see this is Danae. Oh danae, you see them yeah wow! Oh maybe you can't see them because they were put in the chat before you joined the meeting fatigue. I'm sorry, but can you put them? I hate to ask you to do this, but could you put them in again I'll? Try? I appreciate it. I'm sorry. I think that that's why they can't see them because they were put. I thought I was trying to be sort of get ahead of things and stuff to check the links in the chat before everybody came on, so that it would already be there, but it seems as if that, if the links are put in before you join the meeting, the links are only visible to the people that were in the meeting when the when the links were put in so Shetty Mitchell who's, the district manager for Community Board 10 is going to put them in again. I appreciate that because it's a lot of headache, while he's doing that, I'm going to ask member Marquis Harrison Marquise Harrison, is a member of the board he's also first vice president of the board, he's a member of the education committee he's also a teacher in New York City public schools. He is also involved with a teacher which has just been reignited, and so I'm going to ask him to give us sort of an update, what's going on with Dallas teacher and also what's going on the front lines with teachers, hi marquise, how you doing? Okay thanks a lot. I just put a link in too so yeah. Right now I mean the New York City public schools, in collaboration with the teachers Union, we did initiate a program to try to create some support and homework help. We had our famous dollar teacher program. That's been enacted in place for many years as a collaboration between the teachers, Union and the Department of Education to support students with homework, and that was great kindergarten or pre- kinder pre- k to 12th grade in several languages when this, because it was operating on a very antiquated system, though, when this, when the pandemic took place, it we shut down dollar teacher and were really not necessarily equipped to go online to begin supporting students as we should have been able to, and so now they created a system within you know a month or they had a system that was in test phase, but they pretty much accelerated, getting it operating to create dollar teacher. So now, dial teacher is operating to provide homework help and I sent the link tutor.teacher.org. If you know anyone, but it's limited right now as we're kind of testing it out to see about phone call, I'm engaging how many students actually log in to get homework help and parents as well are getting support. It's not just students who call, but parents call all the time, sometimes just to help their children with the homework. It's grades, one through five right now, and so it's mostly elementary school kids, even though I could say that was always the biggest call group anyway. So that's why they're just focused on one through five and kids are coming calling in slowly. It's not been, I mean the DOE did go putting it out and they tried to put it out in the course the last week or so for the first two weeks it was operating with hardly any students calling it you know utilizing. It certainly has increased traffic a lot more, and so it seems to be doing pretty well now, and that's just one support to assist parents and students in school who might need extra help, and it goes from four to seven. Every day after school. Okay, that's Monday through Thursday; never it's never on fridays and as far as you know, what's going on, you know I I think that right now, schools, you know we're all waiting face in the waiting phase. Kind of was, as the policy makers are making decisions. So you know as far as teachers. Basically, if we take like let's say my school last, we just finished a marking period with grades of the students who about we put it. I think we had entry. We said of about over five thousand six thousand grades right for in my schools is six through 12. 43 of that was an x, so 43, meaning nx, is what now that's the equivalent of incomplete. Basically, these that means, and what percentage was that again, 43 percent within the 43 and that's pretty much aligned with a lot of the things I'm hearing, Acrosss district, five in Harlem. So what that means is so that's of all the grades. It's not a particular. That's all the grades just being entered right in the whole school, but what that is that's a lot. That's a huge percentage of students who are just not either one they could be choosing to do some work, not others or they're. Just not some of these acrosss the board. Some of the students are just not doing any of their work right, they're, not logging in they're not, and so some of the you know. I had a big meeting today with teachers and their concern was just like what is going to happen come next year. How are we going to evaluate students? How are we going to be responsible for bring students up? You know, and they were just concerned about, like our students who have traditionally been behind, are folding further behind and right, so that gap is really increasing and teachers were just really concerned, not about themselves. You know, because I, as a union person, I was listening to them as in you know, trying to say: well, you know we're not going to have you be blank, but they were not. They were really talking about the gap amongst our students here in Harlem and that it seems to be winding during this pandemic, and you know what can we really do to I mean. Obviously it's going to it takes way more than teachers are going to be policy makers, but how do we really help close this gap? So you know I do not know if you discussed already that New York City just kind of outlined a plan for summer school. No, I had not gotten to that yet, but you can go right ahead and then I'll okay, you know. Well, I can't tell you I really this today. I did not get all the ability to read through the whole thing, but we do know that they want to increase the amount of students in summer school right, but right this is going to be remote, so we're going to be dealing with some real hard challenges. You know the one thing I did remind teachers about, I mean we're still really being you know, we have to be reminded of each other. Is that you know, while we also heard let's say in my school that there were a number of students who just not been doing anything, we're also learning more and more students who are losing parents, who've lost parents right in the same light. So you know there's a there's, a real problem here that you know we just found out. We did not know that so, and so who did not check in the whole marketing period had lost their mom all right and so and there's not. I mean that's just one example, but there were like several. I was sitting listening to the grades of acrosss the grades of nine through 12, where there were different pair students who were reporting as to we're just learning that their parent had passed so on and so forth. So there's a real problem and you know, obviously teachers are on the front line trying to do as much as we can. I know some schools that have in the parent teacher conference. So what we're doing we have we're actually going offline for Thursday and Friday, and at Frederick Douglass Academy, and we're just focused on parent outreach right. So we're really going to try to just we're not having any classes. All teachers are responsible for just constant outreach, we're going to try to get into as many homes whether they'd be zoom conferences, whether they be phone calls emails, we're going to try to do as much as possible to get in contact with students and parents to see if we can pull them back in, because, at the end of the day, we've been given instructions that anyway, we're continuously be positive, that we really can assure you that you can pass, and that's really the truth, because you can't fail based upon what New York City's outlined right. So it's really like the case that we want to really encourage and offer hope to the parents as we're outreaching. You know doing outreach that listen. Your child can really get through this. We just need them to really try and get online and make efforts and turn in assignments, and you know come to live instruction when we do have it and so on and so forth. So that's some of the challenges that I'm hearing. That's with today, I sat in meetings with teachers acrosss and just listened to some of these struggles that we're having thanks. For that. To your point, I just want to say a couple of things that if any of any child student still needs ipad, they're still available, if you call 3- 1- 1. Secondly, there is. There is some conversation. I do not want to say a lot going on about the trauma that's going to be after this is over. I was on a zoom call. You know: Gail Brewer, the man Amber President, had a zoom call last week around ensuring that there's a social worker in each school and she's, saying how important even more important this is going to be going forward because of the trauma that's going to be happening after this is over. Thirdly, I just want to say that Hazel dukes, who is a member of the Community Board, she chairs the health committee, but she, of course, is a community advocate. I reached out to me today because she watched the update from Chancellor the Chancellor today and mayor De Blasio, talking about the reopening of the schools, and she has some major concerns and so she's putting together a task force and she's. I'm not going to read everything that she is going to be talking about, but I'm going to just give you some of the headings that she wants to to talk about. She wants to talk about. He wants to make sure that our children have access and a prevention in the use of technology as well as their parents. She wants to make sure that there's some kind of summer learning plan put together for the students to make sure that they achieve whatever it is that they're supposed to achieve and to identify the process for which we're going to find out whether or not it's completed. What is, did they want to record something for acquiring a list of eligible african american students who have not received ipads, which students are mandated? She wants to make sure that the distant distance learning is very flexible, and I just want to say to my committee members what she said to me today. I will send to you know so that you know what it is that, because this is a very draft proposal, once it becomes sort of a final document, it'll probably be sent out to the general public, but for right now I want you to know that I did have a conversation with her. There are people that are concerned that our kids are falling behind and they want to do something about that. So that is one thing. That's going on. Also, I sit on a a district, five call every Thursday and they talk about how their kids are being affected and how they can help and a lot of things they're going to do. One of the things that they're going to do is everything about the church. Baptist church already has a food, pantry and so they're going to tap into the food pantry that Abyssinian has now and give D5 students preference they're going to send letters out. You can register you come in. You get preference for this pantry and they're also going to give be giving out other things like paper, towels and toilet paper and hand, soap and hand sanitizers, and also sort of like a wellness kit to go along with that. So when that happens, I'll make sure that it's sent out to everyone. Can everyone now see the links in the chat yeah? I can see them at least yes they're in the chat. Okay, great also, as you guys know, people on the committee we did have our summer youth Employment program letter was approved by the board at the General Board meeting at the beginning of the month, sent it to all of our local elected officials so that they know we support that. There will be some kind of some use employment program and, to that end, this weekend on Saturday should take. Is there any way to put that flyer in the chat, the one that you sent me? Let me see, I'm not sure. Okay, there's an event on Saturday, there's a zoom, that's being run by young people who are who will be talking about what the summer youth employment program means to them. So I would ask you all to invite all of the young people that you know and get on the call yourself as well as their parents, because it's going to be a great event. It is hosted by a delta, sigma theta sorority incorporated, but who we have a I'm a delta just for full disclosure. We do have a mentoring program with young women and they are concerned about the summer youth employment program. As you are aware, it usually employs 75,000 youth and it has been, as of now has been canceled and we're hoping that it will be on the board in some way form or a shape or form Jamil. I'm going to ask you a question. I know that you did you work you deal with pal students, but what are you guys hearing? As for the summer youth employment program, no, not if anything, yeah not much. I mean, there's still some advocacy going on around people trying to put pressure on the mayor and all the powers that be to do something. There was some talk about maybe doing a really scaled down program, and this is talk from DYCD who manages an overseas summer youth, and it would only be the pro if they decided to go forward with anything. It was only going to be the really low numbers and it was going to be related through the piece of it that they do specifically in NYCHA. But I do not know that they've made a final if they're going to do that or not a lot of nonprofits that I'm familiar with are trying to sort of come up with ideas to do something, as it relates to youth to the youth in their programs and employment on their own. But you know it's kind of tricky because folks are losing a lot of funding, and so it's hard to necessarily see for sure what the summer is going to look like. I know we're in talks with NYPD about maybe being able to offer like our version of summer youth, but only for maybe like 50 kids, but that's still being talked about internally at how many kids do you normally find jobs on a given summer? Oh goodness, so we, when we used to have the we just had the vocal youth contract. It was 350 with vulnerable youth and I do not do the gin pop, but I want to say it was close to a thousand, but do not quote me, but it was okay, but still the numbers are going from thirteen hundred to fifty right or 50 from the 350 that you did usually deal with oh yeah and that's incredible. That's still being talked about, and that would be I mean, I'm sure I mean. I know that that's not etched in stone, but I'm just saying those numbers are crazy. Those numbers right and it's not even coming from the same like it's not even coming from gycd. This would be NYPD providing jobs, providing funding for it so yeah, it's it. It's kind of scary, because you know we have the thought- and you know somebody mentioned earlier about talking about how to handle the trauma related to everything that's going on with these kids, but then the other issue you have is if the city opens up, you have kids that are coming out of being quarantined for months and months into the summer, which is already a period that is a hot bed for a lot of unhealthy behavior, sometimes in our communities, and then you have no jobs, no summer school, no physical summer school. So you just have a lot of kids with a lot of time on their hands. So yeah no swimming pools, no smells yeah, no outlet for all of that energy yeah! It's a recipe for trouble. Does anybody have any comments of? I know we've been talking about a lot of stuff. Is there any marquis yeah? I'm sorry? I was so. The last thing I was going to say about schools was that you know schools are also preparing for you know, and this will be an important time. I think for the board to have advocacy around we're going to have crippled budgets going forth right. So, while we're talking about students being behind there's a lot of talk of accessing teachers, staffs getting smaller and potential layoffs, obviously- and that's acrosss the board- so just something to happen in our you know thinking about like what is a school who's already short on certain things. Now, if you're telling him in the era of social distancing and like trying to spread things, how do we do way more with less? You know, yes, something that is going to really be on the agenda, so a lot of people were also a lot of teachers are worried about that because they want to be in the schools that they are in, but they could potentially be accessing, does not necessarily take them out of a job. It just takes them out of the building that they're in and potentially here in our district, there could be many teachers accessed. No, that's a big point. That's a that's a that's a big point, because you're going to have to do more with less and you're going to have to do more with less with kids who are behind you know. Usually the summer is a time when students lose ground anyway, because they're not studying or doing anything during the summer months, yeah now they've had what three or four months with where they really are, not as attentive as they would have been if they were sitting in a classroom. So they've lost those four months in addition to the two months over the summer and now they're coming back into a classroom which we really do not even know if they're going to be coming back into a classroom, because I think the chancellor was saying- or the mayor was saying, there's a 50 chance that the students will still, you know, have virtual learning in the fall, and we know that our students, you know historically, are the ones who fall behind the most, because you know other communities will have money to get tutors for their kids and get them some special attention where they may have felt fallen behind. Because they did not do the work that they should have done, our community historically does not have that sort of opportunity, which is why I wanted to put all of these links in the chat room again. There are links for tutors. The New York public library system has some great partnerships, mentoring from 2 to 11 daily, and so they also have a calendar of. If your kid is just bored, they have a calendar of things that you can do with your kids from pre- k, all the way up to high school. You can look at those calendars to try to keep your children engaged in the in the home while we're all quarantined, and so please avail yourself of those links again. They're still hiring contact tracers. If that's something you're interested in, they are there's still an election on June 23rd. So the link to get an absentee ballot is there as well, and so hopefully, some of those and a map, a food map to help you find where there's food being distributed in in the city in our neighborhood. I know that the red rooster on 126Th and Linux gives out food Monday through Friday. I know that they're feeding about a thousand people a day, a national action network on 145Th Street, gives out food Monday through Saturday and they're feeding a thousand plus a day and starting this past Sunday Sylvia's is now feeding people on sundays. So now the community has an opportunity to have food every day in a lot of different places, and then there are pantries all over Harlem that give out food. That's not cooked that you can prepare Harlem park to Park is giving out groceries to the service workers and restaurants. You go to their website and you can sign up every Tuesday, it's at a different restaurant and you can get a bag of groceries, which is also good. So there is some opportunities to get food in the community for the time being, and so hopefully, if you are in need, you will avail yourself Deborah. I have a question this is Jamila. Can I ask you sure the food opportunities that you were speaking like red, rooster and sylvias are their eligibility criteria? No, you just need to go and you just need to go and stand in line. You do not need to sign up. You do not need to call the lines do get long, as I mentioned they are, they are feeding you know a thousand plus a day. So you know this is prepared food. I know that red rooster and national action network has partnered with Royal kitchen, which is a not- for- profit, that's owned by the chef Jose andreas. If you guys will remember when Puerto Rico had the hurricanes he went over and he fed all the people on the ground, and so he has a not- for- profit, so they are working through his not- for- profit and feeding people. I also know that Ruby's vintage is now working with a world kitchen they're, preparing 400, plus meals a day and someone picks them up and takes them to a different place every day. So there is, I'm not going to say that there's enough food, because is there ever enough food, but there are opportunities out there for food. If why not? I see Terry wisdom wanted with who has who has tablets. I can give you those numbers actually, because the mayor gave those numbers out today and I wrote them down they have given out. This is to Terry wisdom. They have given out 284,000 ipads as of today they ordered they initially ordered 300,000. They have 297,000 requests and they've already shipped 289, so they're running just a little behind, but that's where they are now they've delivered 284,000 ipads to date. Does that answer your question? How can we support and get data on children who have experienced the loss of Obama yeah? I'm sorry, this is terry wisdom. It does and I'm reading the I'm reading the rest of your I'm reading the rest of your okay. So go ahead. Please thank you. Are you a new board member Terry? Yes, I am hello. Welcome. Thank you for attending. Are you going to be on the education committee? Well, I'm visiting. Are you checking it out? You check it out. Everything looks like this is a great one. Yes, I'm very interesting! Thank you. I appreciate that. Well, we would welcome you, but you know definitely do your due diligence and make your decisions. If you had something to say, please go right ahead. Yes, I was interested in how many children have not received the tablets as of yet and also I wanted to find out about the universal broadband. What is going on with that, because if they do not have the internet connection, then the point is mute so that I was concerned about and as well as what is happening or what can we do to support the children that have experienced trauma or loss and also I'm with Palm Network news, which is a new media platform? So if there's information or things that you want broedcasted, particularly I'm very interested in the program that you're doing with the deltas and the young people very critical that you know we all know what's going on, you know I will get your email address from Shatek and I will send you the flyer and then let's talk offline, the universal broadband. To be honest, I have I do not know what the response is. Do you have any information about that marquis? I mean no, I do not have on the broadband. I could say about more about the the laptop ipad distribution is that you know the mayor a few weeks ago or last week or the week before, had announced that if any child or parent had requested, they had actually successfully given given them out and basically those kids who requested it. We found major loopholes in that. That's just not true and recently that there were several many kids who actually request. We had proof that they've requested it and that city still had not met their deadline of getting it to them. So again, we knew that there were lots of kids with without them, but we were being told that those kids probably just did not request, but there are lots of parents and households who have basically, you know if they followed up with the 311. They may have actually been told at some point. We just told them to show up to a location where they could actually pick it up themselves, rather than wait for it in the mail, and some people have done that. I know that we have schools and teachers Acrosss district five, particularly where there's like there are at least three or four teachers in each school who are literally taking it to kids still because they wanted to like the Pa. The teachers are still the lip. I've been delivering it because the city had not met had actually not gotten it out. So you know, are you guys keeping a list of students that do not have idpads? And can you share it? I mean I mean we keep a list if they're reporting it to us. You know right. Okay, we attempt, because we do not we just in all honesty, there are kids who have literally been invisible, unfortunately, throughout this entire pandemic and throughout this entire thing, and so kids, who want help and who like are requesting it they're going the extra mile obviously- and there are certain little other incidents where, if they've done it, there's not a kid at least, I can tell you in Frederick, Douglas County in most schools in describing I'm sure, there's not a kid. If they've reached out to a teacher or the principal we found a way, even if the city did not deliver something, but there are still a lot of people who are just not reporting anything or saying anything, and so those are the people who we're more concerned about are the people who are just under the radar right now. So the whole process of calling 3- 1- 1 is severely flawed. I'm you I ca. You know, I can't say what went wrong. I'm because they've delivered thousands upon thousands upon thousands but they're. They have delivered 284 thousand yeah, so 884,000 yeah they've had major success. I'm just saying at some point there's still some some failures: there's always people who fall through the cracks yeah. What did you say? Mari, oh, I said that's out of 1.1 million students. So yes exactly one that needs one. No, I'm absolutely right and to marquise's point. There are always students who fall through the cracks always and you're right to bring up that number of 1.1 million students in our you know in the school system and to give out 284,000, whereas 1.1 million is really a drop in the bucket, and you would like to think that. Okay, all those other students have technology, but we know that. That's not true. We know that that's not true, so sometimes students got technology. You know the DOE has these? Have these weird web blocks and stuff like that, so sometimes they had technology and just could never access the internet. That was around them the Wi- fi, because it has all these. I think what you call this security, I can't think of the term, but oh yeah, the network blocks, basically because this is not a security firewall. Is that where you get firewalls, that's what I was really secure, right, yeah and so many kids have complained about that. So getting a device is one thing why they may not have access is another thing: that's been the firewalls on the DOE material because they have a lot of firewalls. So if they were given from directly from the school, I think the ipads they recently gave or the new things those were probably open a little bit more, but a lot of kids got laptops and things straight from their school too right before we tried to give as many as possible. You know exactly those had firewalls and some parents were already keeping their kids I've heard from some parents who were already keeping their kids home right before the lockdown, so they were not there that last day for their kid to get yeah an ipad yeah. So some there's so many reports of like just not being even though they have the technology not be able to get online and get it on the internet because yeah they do not know how to you know, there's a code, that's needed and so on and so forth. Well, we do not have what I think the deal we really should have had is they need to have, and I mean this is where they could have is we do not all have technology specialists in schools where they could troubleshoot and really assist our students? Maybe they could have brought the laptop. You know, there's not even that type of system in place where we could bring where a student could say, here's my laptop. Can you unlock it or do something with it? There's no trouble shooting, there's, not there's no place to troubleshoot anyone else on the call have anything to say about that conversation before we move on okay. So I just hello, sorry, I'm Terry wisdom, it's for sure Terry. We need a task force, the same way they're having ambassadors like go around or they're supposed to have ambassadors go around and deal with the mask and all of that, but I mean this is a really serious problem. If a majority of kids do not have the ipads do not have broadband, I mean this is serious and there's I mean. Maybe there needs to be a task force, ambassadors sure, but at reality sure, as I mentioned a little earlier, hazel dukes is putting together a task force, okay and she's, going to be addressing. She wanted to be on the call tonight, but she had a conflict and she- and I chatted today and I'll- make sure that you know she did send me a draft of a proposal that I'm going to sit up, send out to the committee and I'll make sure that you're included in that, so that we can begin a conversation with her and also make sure that the task force is addressing everything that we feel the community needs for it to address. We want to make sure that we have some input, and you know Hazel is great she's open to all kinds of information, so she did want me to mention that tonight that she is doing that task force. I do want to mention this multi- system, inflammatory syndrome that now is affecting our young people. I think that I just would be remiss if I did not mention that you know there have been a 145 cases and of those 145 cases. 67 of those young people have tested positive for Covid-19 and there has been one death, and so I think that we need to. While we are social distancing. I know I'm out sometimes if I take a run or a walk, I do see parents with mass for their kids but oftentimes. The kids do not have mass on the parents. Do I think that in the beginning we felt that kids were safe and sort of immune and clearly this disease a virus has morphed into something where we need to be concerned about the young people in our community as well, and so I would just say, take heed: if you have young people in your house, please make sure that they are also wearing a mask and be careful of you. Please tell your family and friends the same thing that this thing is serious and that we are watching it and we want to be careful. I think it's something that we are also going to have to be mindful of as we look to whether or not they're going to open the schools back in September is something we're going to have to look at and see how it's affecting a young people's immune system. So it's it's a serious. It's a serious thing. We do not know a couple of the things that this committee had talked about before that I'll bring up tonight. Just we had talked about having some kind of back- to- school event. I have sort of breached brought up the idea with the board about, maybe because I think that, because no summer youth program there's always a lot of organizations in Harlem that are given our backpacks full of school supplies, I think that that's going to be tenfold this year and I'm hoping that we as a community board can be a part of some kind of back to school program where we can give out a few hundred or a couple of hundred backpacks full of items for back- to- school kids. I'm hoping that that's something that we can do and also another conversation that we've had that we're going to follow up on is having some kind of form in the fall around schools, trade schools, because we know that you know a lot of kids will push college, but a lot of kids are not interested in college. We know that trade schools are a great alternative and we need to let the community know what that those alternatives are. You know, electricians, carpenters, plumbing, they make a lot of money, and so I think that we, I know the committee had talked about this before doing some kind of forum to just inform our community about trade schools that are available. Any comments, yeah comments on that. I am an adjunct, professor at borough, Manhattan community college and Okay Sister, Reverend Rhonda, Mclean Noor, and I we run a road to college program right now, we're on a little bit of a furlough, but we've been working with Frederick Douglass too. We've been working with thurgood Marshall and we had about 30 students who went through the program and we give them options soft skills, so they can understand. What's going on we're going to start it up for the summer and all of the students who complete the course they get to take a free course at borough, Manhattan community college, while they are in high school and get credit for it. So I definitely am going to be reaching out to you about a few things. Yes, like I said I'll, get your email address and you know we give them a lot of skills and communication and love and care and dinner. So food is always good, yeah good. Thank you thanks for that. So I have a couple of things that I'm going to be reaching out to you about. I will get your email from Shaktik and I'll. Send you my phone number, and so we can schedule a time where we can talk about this and I've taken some notes about the things that you want to talk about. Okay, so thanks a lot for that information, I appreciate it Keema Kramer at the beginning of the call you had some questions about some things that we answer. Those questions. Do you have any comments? Yeah, you guys are great. I mean my concern has been for the kids of this neighborhood and- and just you know when I heard the summer youth employment program was, but you know I thought, oh dear, and then the next news was the recreation centers being closed, and you did mostly I you know, I want to see how I can volunteer and offer some resource in terms of educating and things like that. But one thing I thought that was encouraging was- and I put it in the chat, but you know just to maybe have some conversations with the NYPD so that they have an orientation with these kids because they are going to be running on these streets this summer and if they have maybe more understanding of what these kids are going through. Now I realize you know you do not put the word compassion and if they could hold that these kids are like working out a lot. I do not know and see how maybe they could somehow to engage the NYPD more constructively. Kids. That would be. I was glad to hear there's like a program with maybe 50 kids, but that's only 50. so and it's more like how they're meeting the kids on the street if they're, seeing them as troublemakers or if they're, seeing them kids who've, had a really hard time they're going to approach it. That's the big issue and thank you for all you guys are doing. I'm just I'm so relieved that all these things are being talked about and, oh sure, yeah. Thank you for coming online tonight. We appreciate it anyone else, Marcus Sharon, Megan, shawna, Tamara Dana. Anyone have anything to add. I see our chair is on the call she has anything she wants to add not much to add thanks, Deborah and committee for all that you're doing, I may have another update on the summer youth program. I have a meeting set up on Thursday to talk to some folks about some ideas. They've had about an additional type of funding on Thursday, so hopefully follow up with Deborah. Thank you. That would be wonderful thanks for that anyone else mari not of now. I think I'm glad that you brought up the you know this new illness, that's affecting our young people, that's a major concern and just trying to find ways that we can be proactive before students get back to school. Well, that's all! I got y' all if there's nothing else. All right, I will. I will follow up with you Terry and thank everybody for coming. Are the links available after the zoom comb is over? Can you still access them, whether it be sent via email as well? I can send I can send them via email, okay, I'll, send them out, because I I did not know how to put them in the Chat. Shatik was very kind, but I have them in a document that I can send to the committee and if there's anybody else on the call that wants me to send them to them. If you put your email address in the chat, I can send it to you. Okay, I see you terry, the listing of all the blue lines and different resources, you're going to send to Holland networks at gmail, uh- huh. Okay, can I ask you a question? I'm so sorry my name is d respect. I can't I could not access zoom I'm on the phone. So can I get an email address, so I can contact you. Okay, sure. Can you give me your email address, so I can reach out to you? Okay, you want it now. You want me. Yes, I can write it down now. Okay, it's my last name: D is not David E B, as in Victor, E, R, S and marketing. Actually, is you said marketing? Yes, so that's diverse marketing at gmail, yes, Gabriel C, as in David, okay, Diaz and David is an ed would be as Invicta is an Edward Arson River S is in Sam marketing at gmail.com. Yes, sure I will send you an email, did you want the list of links or did you just want to talk? You know the list of links and to talk briefly. Okay, so I'll make sure that you get the links I have. I will send the links out to the committee and then I have Harlem networks and Marcus Wilson that wants the at hotmail. Okay, so only you're welcome. Only two people put their emails in the link in the chat, so I'm assuming besides the committee, those are the only two people that want the links and so we're good. Okay. So again, thank you to everyone. I will send those links out this evening as soon as we get off the call. So I do not forget, and if you need to get in touch with me, you can always go through the Community Board office, even though they're working remotely they're still working very hard every day, and you can reach me through them so have a great evening be safe everyone good night. Thank you. Last poets. They have a 50th anniversary celebration right now. It's amazing! Where did that where's, the www.com and we'll have it with davio dune on Harlem network news tomorrow, so it's an amazing event so tune in if you can. Thank you great. Thank you. Thank you.",
            "summary": "Well I'm a resident here in the in the community, I've, been trying to monitor your regular emails and news and bulletins and all that, but I'm a little bit concerned for some of the children who might be falling behind with the school sure tutoring or any That's a one concern!\nIt's best that you go to one that maybe that's closest to your neighborhood, to find out different aspects, especially of the bonus I, think that a major concern with a lot of people is students falling behind, and I noticed on the New York public library website that they have quite a bit of homework.\nYou talk a little about that offering within the New York public library, system, okay, so one thing We do have the the teacher's help the ABC mouse.\nThat's based in Harlem It's, a virtual learning program designed to help middle and high school students pass their classes.\nI hate to ask you to do this, but could you put them in again The links are only visible to the people that were in the meeting when the when the links were put in so Shetty Mitchell who's, I appreciate that, because it's a lot of headache, while he's doing that, I'm going to ask member Marquis Harrison Marquise Harrison, is a member of the board he's also first vice president of the board, he's a member of the education committee Also a teacher in New York City, public schools.\nWhat's going on with Dallas teacher and also what's going on the front lines with teachers, I mean the New York City public schools, in collaboration with the teachers Union, we did initiate a program to try to create some support and homework.\nAs we're kind of testing it out to see about phone call, I'm engaging how many students actually log in to get homework, help and parents as well are getting support.\nIt certainly has increased traffic a lot more, and so it seems to be doing pretty well now, and that's just one support to assist parents and students in school who might need extra help, and it goes from four to seven.\nI did not get all the ability to read through the whole thing, but we do know that they want to increase the amount of students in summer school right.\nYour point, I just want to say a couple of things that if any of any child student still needs ipad, they're still available.\nShe, wants to make sure that there's some kind of summer learning plan put together for the students to make sure that they achieve whatever it is that they're supposed to achieve and to identify the process for which we're going to find out whether or not it's completed.\nAs you guys, know, people on the committee we did have our summer youth Employment program letter was approved by the board at the General Board meeting at the beginning of the month, sent it to all of our local elected officials, so that they know we support that.\nOkay, there's an event on Saturday That's being run by young people who are who will be talking about what the summer youth employment program means to them.\nWould ask you all to invite all of the young people that you know and get on the call yourself as well as their parents, because it's going to be a great event.\nAs for the summer, youth, employment, program, no, not if anything, I, mean, there's still some advocacy going on around people trying to put pressure on the mayor and all the powers that be to do.\nYou know it's kind of tricky because folks are losing a lot of funding, and so it's hard to necessarily see for sure what the summer is going to look.\nWhile we're talking about students being behind there's a lot of talk of accessing teachers, staffs, getting smaller and potential layoffs, obviously- What is a school who's already short on certain things.\nLot of teachers are worried about that because they want to be in the schools that they are in, but they could potentially be accessing, does not necessarily take them out of a job.\nHave anything to say about that conversation before we move on Or they're supposed to have ambassadors go around and deal with the mask and all of that , She wanted to be on the call tonight, but she had a conflict and she- And I chatted today and I'll- make sure that you know she did send me a draft of a proposal that I'm going to sit up, send out to the committee.\nI have sort of breached, brought up the idea with the board about, maybe because I think that, because no summer youth program there's always a lot of organizations in Harlem that are given our backpacks full of school.\nSo food is always good , I mean my concern has been for the kids of this neighborhood When I heard the summer youth employment program was, but You know, I want to see how I can volunteer and offer some resource in terms of educating and things like that."
        }
    }
}