{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB8",
            "channelId": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "title": "Land Use Committee Meeting",
            "publishDate": "2020-12-04",
            "shortDescription": "",
            "lengthSeconds": "3:03:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB8",
            "normalizedName": "Brooklyn Community Board 8",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 8",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "pbH7QTQES2c",
            "fillerWordCount": {
                "uh": 424,
                "um": 414
            },
            "readTimeFullTranscript": "81 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "building": 62,
                "project": 38,
                "stucco": 33,
                "door": 31,
                "development": 30,
                "chat": 29,
                "landmarks": 28,
                "roof": 22,
                "units": 22,
                "elements": 20
            },
            "wordCountSummary": {
                "building": 14,
                "land": 8,
                "development": 8,
                "landmarks": 7,
                "door": 7,
                "units": 6,
                "housing": 6,
                "project": 5,
                "stucco": 5,
                "deck": 5
            },
            "fullTranscript": "You know no, they usually don't even go back in until a lot of people good evening. Everyone. Thank you all for coming. One time appreciate it. The agenda shows two items for this evening: 857 St marks, which is a do-over and 97 St marks, which is a first time. We may have a third item: 294 Albany Avenue, if you can all agree to allow the latecomer who has not submitted his materials for his presentation ahead of time for us to look at, but we can see whether or not that'll work for us, so I just want to see if we have a quorum and I will be, depending on Julia Neil from the board office to help us coordinate things, Norah Daniel, the land Use Committee secretary and our vice chair. Here's a Ester Weatherspoon to help, keep us on track with information coming into the chat. I'm hoping all of those folks are on the ball as of this moment, and I'm trying to good evening. This is irsa, I'm on board hello. Everyone thank you, and we also have committee Secretary, Nora, Daniel I hope is with us not yet she's a busy lady she's also chairing the youth and Education Committee. So we could talk about that all right. So now, first up is a do-over by the name of 875 Saint Mark's avenue. Wait. Let me back up, I'm sorry, I hope everybody had a wonderful thanksgiving and you're all hail and hearty and ready getting ready for Christmas. So with that said, we can go into our business for the evening. If we have a forum, we have 23 members on the committee. All of them would be. 12. is what the spoon can you tell if we have a form, I'm checking, but I just want to bring to your attention. I was just waiting for you to get a breath. There is a question regarding the Atlantic Avenue application is, will that be conducted today or that will be talk about it, feel it out, look at the different parts of it and they haven't started their process. Yet, okay, what about Albany, because Avenue I think I saw the proponent come online? Cityscape I, don't believe we have their materials, but if we have time we can walk through that. If the proponent has a presentation to make, we can do that. So I'm trying to see if we have a quorum so I guess we need to do roll call. I'm not sure if you have the committee list, Ms Weatherspoon, let's see yeah. If you could do the roll call, that would be more efficient than me pulling it up. Okay, we'll make sure we're starting business with business. Okay roll call starts with Princess Ben James, please you're, present: okay, John Buckles Robert Callahan, President Janet Collins, here, Norma Daniel, James Ellis, here Kevin Farley, here, Johnny Granville, Kathy, Island. Here, okay, thank you, Sir, Zima Jordan! This thing is alphabetical by first name, I see her name. Is Jordan I see your name on the list. I'm gonna Marky present Peter Crassus here. Thank you, Sarah Lazar Present. Thank you. Sherry Norton, Barry Norton, yes, I marked a present. Thank you. Then next was Sherry. Norton I didn't get a response on that. Okay, moving on I have Robert Tuka I, see a couple of telephone numbers, so I don't know who those people are telephone number ending in nine seven, beginning with three four seven, four and ending in nine seven. Who was that hello, okay, moving on with the rope who's speaking well, this is Mississippi Mrs Ida Ramos at 859 Pacific street, I'm on the line for a building of 840 Atlantic Avenue. Okay, so we'll come back to you right now we're doing roll call for committee members. Thank you, okay! Thank you all right! So next is we have Robert Puka, not responding. Carl Riddle gotta go back up, Adam Sacks, Meredith Staton is 394, I! Think no he's not one all right! Ethel Tie is present, give Viconi give for Coney use, so Weatherspoon I know you're. Here, I'm present, I'm here I, don't see her okay, Elaine Weinstein here. Thank you. Deborah young I saw your name I'm here. Thank you. Okay, let's see, we have one too okay, we have 13 out of 23. We have a forum, let's proceed with tonight's business. First, item on the agenda is 875 St, Marks, Avenue and I. Think I see Guy Cohen, Sorry Miss Tyus Norris is here and she's trying to speak, but her audio is really low. This is James Ellis, sorry to interrupt. Thank you Norah. You said Norad Daniels, right, okay, so you're present, so we have a forum more than a quorum. Now. Thank you so 624. This is good. All right, 14, all right, moving right along first item on the agenda is 875 San, Francisco, Avenue, Crown, Heights, North historic district, and this is a second presentation by the architect for the project which is to legalize the work referenced in the LPC landmarks. Preservation commission list of violations I still see four violations listed same numbers last time. The impression I got from the correspondence that I saw was that work had been done. As people can read in the agenda item that was on the calendar for the board. The building is a small seven unit, co-op apartment building. The original developer went bankrupt in 2017 and abandoned the project before completing the removal of the landmarks violations, as well as obtaining the final certificate of occupancy. Originally, the developer obtained a LPC permit for resolving violations before abandoning the project. Some of the work listed in the permit was done, and some was not. We've been in talks with landmarks according to the proponent and the landmarks is fully aware of the situation based on the work that was done. Some of those violations have now been resolved, so that list should be shorter at the staff level with the LPC. The remaining violations are what's listed, above which, oddly enough, is the same for violations that were listed first time but Mr Cohn. Please take us through this and unravel that mystery for us. Well, thank you. Mrs Tyus I appreciate the opportunity for of speaking with everyone again tonight. Can everyone see my screen and the presentation that I've put up? You need to make it bigger it's about as big as it can get. Okay, unless there's a way I can I shared the screen, and can you see it now? I can see it all right, let's see if there's another way to actually are you guys watching this I just see a black screen that says guys starting to share content. I can, on the left hand, side of your screen. There would be a magnifying glass click on the plus one it'll get bigger, and then you drag the presentation back to the middle of the screen. Okay, I got it big enough to see it go ahead. Okay, so, as you may remember, last time I presented. Excuse me, I'm sorry, Mr Cohen! Excuse me. While I interrupt you, please the only microphone that should be. He is presently speaking. So please. If everyone could just mute their microphones, it would be greatly appreciated. Thank you. Go ahead, Mr Tong! Thank you. As I was saying, you may remember: I presented this project at the last White News Committee Meeting right here and I'm back again with Mr Kong. Can I pause you for a second I'm going to go ahead and mute everyone and after everyone, please don't mute yourself sure all right, let's see if I can unmute myself, you are on YouTube. I am okay, yes, go ahead, okay, so, as I was saying, we presented last time to the land use committee. There were a number of items that were on that last agenda that we have since resolved with landmarks, I'm hoping that everyone's whoops sorry, I'm hoping that everyone had a chance to see the documentation and some of the materials that we had sent to the community board in support of the situation with the developer of Boaz Gillard and how he left the building pretty much in the lurch and a little later on after my presentation, one of the owners of the building will also would also like to speak and discuss some of the information that they've researched regarding grants and tax credits that might be available for historic properties. So at some point there will be another person who will chime in I believe that I don't see her name up there yet, but maybe she's gonna join a little bit later. So with that said, let me walk you through the project and explain a little bit about what we're doing now. So, as I mentioned before, we had discussions with landmarks, a lot of the items that had been discussed prior to this were in discussion with the staff of landmarks and since then, we've resolved all those items. The only remaining items left are the side bays on the building and the reason that those items have to go to public hearing is because the material that was removed during the first when the developer worked on the building was historic material. As you can see, the building is a romanesque revival, building very much like a lot of the other buildings in this Crown Heights National historic, registered district. The architect was Magnus Dollander, who was very well known for his unique and fantastical fantasiful. Sorry, fantastic, victorian conglomerations. So one of the things that was unique about this building was the fact that there were three bays on the east facade and during the developer, Boaz Gilad's renovation. If you want to call it that he removed a lot of the historical mystery material and you can see, we don't have great photographs, we've not been able to really find any good pictures of what that looked. Like prior to the renovation, but we're able to find these two pictures, if you look on that screen, one and two one is the building before is renovated and two is a detail of what we could see of the bays and three is what there is now so, as you can see, the bays are still there, however, they've been rebuilt and covered with stucco, so there's remnants, but not all of the historic material at one point had fish scale, metal, pressed fish scale, metal, roofs, it had wood detailing pilesters, lunettes, various framing elements that were very unusual compared to the romanesque revival front. They really didn't. They were not romanesque. They were victorian so in researching how to best deal with the situation and to prevent having to rebuild the entire base, which would be extremely expensive and onerous to the owners of the building who live there. Now we had discussions landmarks actually suggested that we try to recreate some of these. Some of the original look of the materials was stucco. So with that said, let me go to the you can see on this slide. What there is now. These are photographs of three bays, I'll call them one two and three, the first one Bay Number one is a brick bay that was not really affected. There was no work done on that. They didn't take any of the material away bait two, which is right next to the brick bay, was a three-story bay that had a lot of unique, victorian material on it. Fish scale as I mentioned, pressed metal, fish scale, roofing, stick work, pie, lasters moldings, and you can see that they were kind of simplified and just kind of glazed over with the stucco. They kept the original shape. You can see the bottom third of the middle Bay is still rounded, and the top two levels are angled and in the bay next to it, it's essentially the same shape that was there before it has a very large overhanging cornice. But at one point we really didn't know what was there, because we don't have any good photographs of what that actually looked like you can see if I go back to that. First picture that that's obscured the second bay or the third bay is obscured by the second bay. We couldn't really see it so, with that said, I went into the history books and I look I. Did some research Magnus Dollander the architect built this along with his partner Langston in 1891, they were using a wide alphabet of different forms. Gargoyles materials shapes they were very lively and unique and inventive uses and designs. So what I did was I went back, I looked at some of the things that were originally approved and you can see on the top elevation. The permit that was approved by landmarks prior to the renovation was very similar to what I can see from the photographs. Although I'm not 100 sure that that's exactly what was there, you can see in the lower elevation. That's what's there now, I, don't know if everybody can see this, let's see if I can zoom in on this in some way and try to show you what was there. So that was what was on the original permit. That was approved but, as I said, the developer left skip town and had glazed over this rebuilt. This covered in stucco and landmarks gave it a violation for not being done according to what the plan showed. Let me go back here, zoom out. Oh sorry, so, what's there now is this, as you can see from the photographs that I showed you prior to that? This is what's there now. So let me go to the next page, and this is the elevation above once again is: what's there now the elevation below there is what I'm proposing. Let me sorry to move this around. What I'm proposing to do? Whoops. Sorry, okay, go in there, so this is what I'm proposing to do in stucco, which I think is better than what was originally proposed and permitted by landmarks. I, dug into victorian pattern. Books, I looked at other buildings that Magnus Dollender did in Brooklyn and was able to recreate pretty much bay number two as close as I. We could to what I saw on the photograph and then extrapolated Bay number 3, which is this one. So let me go to the next page, which is a blow up of those bays, and so this is the proposal that there is an existing stained glass window in Bay Number, two at the bottom portion, which landmarks is fine with it's not the same stained glass window that was proposed originally I, don't know what happened to that. Who knows when, where it went or what happened to it, but there's a stain, a stained glass window. That's there now and in discussions with landmarks, they're perfectly fine with keeping it what I've done is built up. Framing pilasters tried to recreate the fish scale, roof on two levels and actually recreated the exact framing at the upper two base, which are these bays and these bays. So that's exactly the same as what was there. Originally I was able to use my microscope and just determine that this is actually what was there, except now we're proposing and based on our presentation with you and landmarks we'd like you to. Let us do this in stucco, because rebuilding it in wood would be so invasive and intrusive. That we'd have to rip out all the walls and redo them and with a good craftsman. I think some of these profiles are very easily replicated. There are some things that we're suggesting doing, such as the medallion, which, if I go to the next page, is actually that's actually precast. It's made, you can buy it like this. It looks almost exactly like a medallion that I think was there originally, and it fits perfectly into the composition. Let me go back the lower level, the fish scale. Sorry, let me just jump back in jump around a little bit. The fish scale, roofs I believe we can recreate with stucco and some insulation. You know the rigid insulation that you use for building insulated precast details on various buildings. You underlay that on you attach it to the substrate, and then you build up the stucco on top of it, so you can create the forms using stucco without having to penetrate the original stucco. That's there you just overlay. It then a little lower the columns here because they're a little bit more detailed, I'm suggesting making them in a cast fiberglass and then applying them and then Lunettes to the windows as they were originally jump over to Bay number three, as I said, the cornice is already there. The shape is already there. What I'd like to suggest to doing is create this fish scale. Roof here, create these arches over there, because that was a kind of element that Magnus Dahlner Dollander would do and apply some small stucco brackets. So if I can jump to the details, these are the details and you can see the column. Capitals are based on victorian, motifs, they're, literally developed from there's a very famous victorian architect by the name of Aj Bicknell, who authored a number of victorian pattern books and they were interchanged and used quite a lot amongst various architects of that period. So that is, you know our proposal. The idea is to try and recreate those bays using stucco fiberglass and cast stone, build them up not have to penetrate and rebuild the entire bay use, the bays that are already there and then create decorative patterning on them to replicate the original material that was unfortunately lost when the building was renovated by Boaz Gilad, who has gone, and with that said, I don't know if Dina who happened to be one of the people who was going to come in and speak is on, is Dean hi guys. Excuse me, hi guys. It's Mandy Good afternoon hello hold on Mr Cone for Mandy and Ordina speak. There was a question I thought if we could answer that would be great before they begin was in terms of the color that's being used for the stucco. Yes, and there was a question also a part of that question about also inquiring about the design elements. Did you get to capture all of those? Well, let me address the color aspect. Originally, let me go back to the photograph. As you can see, that was a very dark stained. Wood color that I. Can everyone see that on there and then the fish scale was metal so at the time the windows of the building were all black we've had discussions with landmarks, the windows are now currently white, as you can see. If you look over into this picture, so some of it's still a little bit undecided, so we're having these discussions with landmarks as to what the final color is going to be. They don't seem to mind the color of the stucco because it blends in with the brick, but ultimately, when we present to landmarks and in our discussions with the deputy commissioner and the staff member we'll touch on that, I think it has to be clarified what they would actually like to see. Personally, if it was up to me, 100 I, don't mind the red, stucco I think it kind of blends in nicely with the building, although I think I might tint the roofs a lighter gray, to match the stone color of the front and the other question had to do with what was the design elements? I didn't see the question: I don't have the chat on. Let me see I'm telling you what it is. It was a two-parter, the question about the color for the stucco and also the design elements. Okay, so the design elements would be whatever color the entire base would be. It would all just be one color and the only color difference would probably be the roof color, which would blend in with a stone, there's also a possibility that we might make some of the elements such as the pilusters and the brackets and the surrounds the same color as the stone at the front of the building, so I think that's still a little bit of a moving target and but we're open to all kinds of suggestions and whatever will look the best. Okay, thank you, I also before the owners speak. We have another question if you could summarize the outstanding issues with LPC regarding the bays, what specific elements have LPC not approved at the staff level? You could answer those for us. Well, there really are no outstanding issues. Yet we've just submitted this our proposal to landmarks, so we haven't gotten and we haven't gotten any feedback from them. That is negative. So far, it's all positive, that's why we have to go to the public hearing, because we want to. We have to present it to the commissioners regarding specific elements: every are you: are they referring to the bays or other parts of the building? Mr Viconi? Would you like to elaborate? Yes, thanks, I want to understand it's. It sounds like a lot of things have been resolved with landmarks, which is great, but since you're going to public hearing, I want to understand what specific things are. Triggering the public hearing and specifically with respect to these bays I, understand that it's the bays that are at issue. Are there any particular elements that staff has indicated are acceptable and what are the ones they haven't indicated are acceptable the well the debates are the specific elements, there's nothing outside the base that we're requesting approval from landmarks. For and specifically to be honest, they don't have any one particular item or two items that they object to they just they don't really hate the base. The bays are still intact in the sense that they're there, but they if I can say they mourn the loss of the historic material and in discussing this with Jared Knowles who's, the deputy commissioner who's taken an interest in this. He suggested that we try replicating you know, because of cost and because of time and because of a disturbance to the building he suggested replicating as much as we could and as much as I could really determine in stucco. So at this point, we've submitted to landmarks and we're going to go to public hearing. We haven't gotten any feedback negatively from staff level or from Jared Knowles. So we're you know as long as the community board is okay with what we're doing and we're that's why we postponed it initially, because we weren't had things to work out still at staff level with LPC, so that the community board would have a say and also have some input into the process. So we're open to suggestions from you if you think, there's a way to improve it. Okay, Mr Bocconi, are you done I? Might ask one more question: do you have any examples of the type of implementation of the roof shingles in stucco that you're proposing something? That's actually been realized that we can look at and see what it looks like I think I understand all of the other elements that you're proposing, but that one is throwing me a little bit. Well, it's interesting this picture because when I pdfd it got a little blurry, unfortunately, but the way that the fish scale pattern that I can see is kind of laid like marzipan and it's it seems like it was done in sheets, so you'll have the bottom layer and then another layer on top of that and another layer on top of that and another layer on top of that, and the fish scales are just cutouts almost like paper dolls. So what I would talk to the craftsman about is doing it in that sense, kind of building up the layers of stucco, so you might have a quarter inch and then a half inch and then three quarters and so on. If you can visualize that yeah I get that, but I think that the texture would just seem very different than roofing material. Well, there's no question the roofing material would be shiny and the stucco would not, but having to try and duplicate that in metal and put it on there in a way that didn't disturb the fabric of the obey would be very difficult. I think and some of the stucco elements that we're proposing would not be as pronounced. They wouldn't be as three-dimensional as the original wood elements would be. Obviously the wood and the roofing really stuck out quite a bit further than the stucco, so we're somewhat limited by the depth of what we can do with the stucco, but we still want to try and recreate the original impression as best we can. Thank you, mister. Okay, Mr Cohn. I'm sorry excuse me. Miss ties. I. There were four outstanding issues that were highlighted in the chat box and I wanted to know. Had they been reconciled, I don't know if you can see them, but I can just quickly say they all have been reconciled. Okay, so that's so that when you say that means that LPC did, what did they say something specific or did you actually? They are they're, basically legalizing the well for one thing: the alteration of projecting bay and painting the secondary facade that was reconciled because the paint was removed by the developer, so that was reconciled. The replacement of the windows that were in question were done and made out of wood, so their LPC looked at those and said they're good. They have no problem with that. I just see two things right here. The mailbox is the light, pose light post. So the mailbox we are in the process of confirming with the post office if we can move the mailbox away from the building and if we can move the mailbox away from the building. Landmarks is okay with us, putting it closer to the sidewalk at the front entrance, so it doesn't interfere with the look of the building and the light posts they're fine with that being where it is in the fence, the rear yard, they're. Also fine with that they said they looked at it. It's barely visible, as you can see from the photograph number three on this picture. You can't hardly see it from the street because the church next door is very close to it, so they're fine with that being the way it is also thank you for the clarification you're welcome, Miss Tyus. Thank you. Forgive me if I've mispronounced your name, Adina they're, also waiting to speak when you're say it's okay. Thank you. Ms Weatherspoon I just wanted to share some of my past experience with similar issues from other projects that have come before the committee on the stucco. There is a particular composite type that is recommended for work on historic buildings. So, if you're wedded to the stucco I implore you to check on the consistency and ask the supplier, there are a couple of main suppliers. I don't have the name in front of me, even though I have a bag of it sitting. Here. In my study that I used to show LPC what I was doing on a property I have so that's one thing. The other thing is that there are sources of wooden fish scale that you may be able to buy. That would shorten the time and last a lot longer than the standard stucco. So I implore you to look for the historic composite, stucco that'll last longer or use the wooden fish scale that could be available from a supplier like diced lumber here in Brooklyn. Okay, that's all I would have to ask you, I'm glad you went through the list of violations and explained how those have been addressed. So this is the kind of stuff you only want to do once every 20 or 30 years, so I implore you to do dig into sources for assisting on the finance. So if your clients have a couple of short comments, they want to make on what their findings were for the tax credit opportunities and the grant opportunities that'd be great to share that. But let's keep it short less than four minutes please. Thank you responsibly. Yes, thank you very much and I really appreciate everyone's time this evening. I will certainly keep it short. We have done a fair amount of research on what's available to us as far as some grants and tax benefits. What we have found is that there are some limited options for private owners, which is what our building would be considered, and we also have found that most of the grants and tax credits are typically linked to rehab rehabilitation projects which, unfortunately, our work would be classified as corrective work, so that doesn't mean that we won't try to get some grants and see what we can do as far as that goes, but just in our initial research we found that we may be not eligible for as much as we could hope for we did find that there are some federal historic rehab tax credits, which is a 20 tax credit again focused on rehabilitative work. We also found that New York State historic homeownership rehabilitation is limited to owner occupied and rehab only again and also the work must be approved, and then we also found that the preservation, League of New York state seems a bit more geared toward our type of work, which will be a condo. But again you have to have a budget in place and you have to have the work approved. We also found that, for that particular grant, the deadline has passed for 2020, so we would start again in January. So all that said what we'd like to do is once we get a full approved scope of work from landmarks and we have the plans in place and we know exactly what our scope of work is and what that budget will be. We would then like to go out to see what types of credits or federal grants that we might be afforded, but unfortunately we can't do that until we have the work ready to go and a budget approved. So just we certainly appreciate you guys giving us some leads on what's out there and we are actively seeking out what we're eligible for. But you know we aren't getting our hopes up too much given most of these grants are afforded to rehabilitation projects and, unfortunately, not corrective work really appreciate your time. That's all thank you Ms most Moxley that was very informative and don't forget to keep looking because, as you turn away, things change and opportunities crop up that weren't there before so, keep your eyes on the horizon and see. Let us know what your success is this time next year, so we'll have a little part. Thank you, okay. Yes, thank you very much. I appreciate it. Are there questions from committee members on this item? Yeah I just put one in the chat. This is Deborah young yeah I can actually take that one. So we're going to the postmaster to speak to them on Friday I won't share my screen to waste some time, but basically, what we've gotten approval from landmarks is. If we just flip the mailbox in front of where the garbage cans are today landmark seems to be fine with that. So that's approximately 20 feet to move the mailboxes and it would actually just move the mailboxes closer to the sidewalk in essence, making it slightly easier for the post office to access the mailboxes, so we don't anticipate any pushback from them, because it's only moving the mailboxes 20 feet or so closer to the street. Okay, all right! Thank you. Any other questions. Yes, there is a another question here from Robert Callahan, yes, yeah, oh go right ahead. Robert, I'm happy to just very quickly, I'm sure it's an easy answer. I know many of these units are under occupied but are all of your units under occupied, and, if not, is that going to impede your ability to win grants? Yeah hi Robert, it's mainly again so yeah most of the building is owner occupied. There are two units that are rented out. The rest of the five units are owner-occupied. That's a good question. I hope that it won't impede our ability to access some of these federal grants, but I don't know that we'll know you know what we'll know until we get a bit more into it. There is one the New York State historic home ownership. Rehabilitation is very limited to owner occupied residents, but it's also for rehab work. Only so we will be eligible for that, but I do think. The preservation League of New York state might be a bit more geared toward us. As I mentioned there they're a bit more focused on condo associations, but we've missed that deadline for 2020, and we do have to have a budget and a plan in place before we can seek that grant. So our plan is once we have all of the work ready to go, we'll be able to submit that for next year. Okay, Ms Moxley and Mr Cohn I just want to suggest to you that you not wait until you have a signed contract for every specialty that you're going to use to do the work that you're planning estimates will work and I'm not sure how your condo handles rentals. But there is a program for rentals and it goes through the state. So you want to explore that to see if that might help you with the other apartments, given that the work is being done on the building as a whole and not on individual apartments. So you get the 20 from the state and then there's another 20 percent from the feds, but it has to go through the state office and for the things that are not corrective. You've got a new prospective to maintain the building and maybe improve some things. While you're doing this, those items should be available. Okay, so thank you. I just want to mention one thing: we've already started sending this out to various contractors to get pricing, but it probably will take a couple weeks before we get comprehensive pricing on this, but we hope to have something at least for the landmarks public hearing, which is on December 15th, okay. Well, they they're not so much interested in your finances. They just want to see you get it done so, especially anything else on this. I'm asking the committee members to come forward with the motion on what you've heard this evening on this project at 875, Saint Mark's avenue to legalize things that the fire owner did outside of Lpc's approvals committee members. You can unmute yourself and speak Ms Neil. Are they on a night, okay themselves hi? This is Sarah Lazar, yeah I, move that the committee approved this new and vastly improved plan, yeah I'll. Second, that I'm sure if I can make a friendly amendment Miss Lazar I would like to. This is James Ellis Committee member I would like to just add into some language about what the understanding that the other violations have been rectified at LPC that the presentation at the base, be it just be more explicit saying that the other items we are not making the most. You beat me to the punch, Mr Ellis. We need to have a specific some specificity to the motion. Ms Lazar. Do you want to recap your motion and accept the friendly amendment? Yes, I accept all language that Mr Ellis just used I just can't remember all of it. So we have a motion on the floor to support the legalization of the work on the bays at 875, Saint, Mark's avenue, using historic, composite stucco, and we recognize that LPC has removed violations numbered in the original presentation ending in 1025, 1027, 1032 and 1033. have been approved at staff level. So is that accurate anyone have any exceptions to the language or the motion to support Miss Tyus. There was no mention of mandating composite stucco in Miss, Lousy's presentation. I. Think your suggestion to explore composite stucco was just that I. Don't think Miss Lazar's motion made a mandate to that. Okay, fair enough, so we have a motion to support recreation of the fish scale over the Bay Windows with stucco and that's the remaining violation that needs to be legalized at the hearing and the hearing is on. When is your hearing? It's on December, 15th, okay, I just want to mention that there are a number of different composite stucco mixes out there. So if we could just say generally Stucco, I'm obviously going to use what I think is going to be the best and the most durable product. There's things made by cathedral stone and various other things: absolutely: okay, not a mandate as Mr Ellis misinterpreted. It is just trying to be wisely spending money and not having to do things every three years. Absolutely I don't want to do all this work and have it come down in three years? Yes and change colors absolutely absorb and turn black with mold stuff that happens to stucco right. Okay. So now we have a motion on the floor from his Lazarus, a second from Ms Young and a friendly amendment from Mr Ellis, to specify that the violations listed from the original hearing have been resolved. The staff level and I would like to for the role on this Mrs Weatherspoon. Do you have a role for this? What should I call the role? Yes, I do, but I just want to I just want to speak about a few things that have entered into the chat. Okay, one Mr Verconi thinks that the motion is far more than the fish scales. It's for everything proposed for the bays and there's an agreement there with Miss Iceland, there's wood framing for the Windows and Mr Ellis believes that we still need miss young to officially accept, which is true, the second, the friendly amendment. Does she accept the amendment as it is? There's motion? Yes, sir needs to accept these amendments. We need to recap: did you spell it out? I've seen these things in the chat, I, don't know why I'm fine with the broader version of the motion? Yes, okay, let me do Mr Viconi. Do you want to elaborate, or are you fine yeah sure I mean even Miss, Iceland yeah, just very briefly, I mean this is an application for a bunch of work. That's all been detailed by the architect and presented in these plans and that's what we're voting on. It extends to more than the fish scales. Okay, so we're voting on every we're voting on everything that's being presented and the motion as I understand it has been made to recommend it being approved by the board. Okay. Thank you again. What we're voting on then short and sweet is to recreate the big windows using stucco and wood other appropriate materials how's that for me, I just want to mention. There's really no wood, we're using there's, no good framing for the windows are already there we're suggesting a fiberglass pie, Laster, okay, inserted. So if I can just suggest that you reference the drawing numbers and the date, maybe the work. Okay, what is the drawing number and the date? Well, it's this particular drawing which has all the details is lpc005 and Lpc006, which shows all the details, and the date is 12, 1:20, okay, good! So that's what we're voting on folks, I'd like to go to roll call on this now in support of making these changes outlined so far. Okay, can you please read the motion again in its entirety, we're supporting the recreation of the Bay Windows using drawings, lpc005 and 006 of December 1st 2020, okay, Miss Collins, but Mr Christie Ellis made an amendment to add. In the other questions, this is Kathy Island, okay and Mr. Ellis asked for a friendly amendment to include the that the other violations had been legalized. That will be there. Yes, he legalized prior violations. Okay, have we finally arrived at the language that makes everybody happy? Okay, I just want to just verify. Miss young. Have you second, the yes, okay, I'm on board, yes, I! Second I still. Second, okay and I want to thank everybody for that for the friendly amendments, most appropriate. Okay, all right so Sarah's, good Debbie Young is good. Mr Ellis is. Are you okay with all of this? Yes, ma'am? Thank you! Okay! So I'm going to call the roll we'll support. Prince has been James, Princess, Ben, James, okay, John Buchholz; here, yes, you're voting, yes and John Callahan and Robert Callahan, I'm voting yes, Janet Collins, Nora Daniel, yes, James Ellis! Yes, no problem! Thank you! Mr Ellis and Johnny Granville, Ms, Granville, okay, we'll come back Kathy Island, yes, Desima Jordan, yes, Peter, Crassus, yes, Sarah Lazar! Was that a yes, of course it was yes, Jeremy Norton Jerry, Norton, Robert, Cooper Carl Riddle wait back up. Robert Puka Carl, Riddle, Adam, Sachs, Meredith Staton Ethel tires. Yes, good for Coney Miss highest I have Mr Staton. Do you want to register your vote? Did the committee hear that to register Mrs Staton's vote? Can you hear me? Okay? Yes, can you meet with thank you for coming again? Yes, you're the Weatherspoon, yes, Sharon, Wetterburn Elaine Weinstein, yes, Deborah Young! Yes, okay! James! Yes, can you hear me now I can hear you. This sounds like conjunct, yes, okay, I believe also princess just registered her vote, okay, which was a yes okay. So it sounds like we have 16 1 2 3, 4, 5, 6, 7, Ms Neil I have 17. What do you have Miss Neil? Are you there I have not been keeping the role. That was not my agreement this evening. Hey thank you got it. I got 17 and that'll. Be it because I don't think I. He asked Mrs whether someone to do it. Yes, so were you able to follow up on that? No okay, so we have 17. trust me all right. So excuse me, science, 17. What yes favor one obsession and one abstention. We won't forget that you abstained. One abstention by Janet Collins. Okay, again, this item will go for hearing on LPC Tuesday, the 15th of December. We wish you luck and thank you for coming back and I'm glad you were able to find some resolutions to these issues. Thank you for your patience and understanding and working with us on this. Okay, yes, I echo that sentiment. Thank you very much for your time and all of your input and very helpful good luck. Thank you for your diligence stay with it. These old buildings need a lot of love and care. No question. No questions go ahead. Okay, yeah I just would love to have Miss Moxley, our representative from that property. You know and kind of, as you mentioned, or updated on the grant and tax programs that this type of project might fall under. If you would be so generous to share in six months or eight months or whatever anything that you found out, it would help us and be a more informed community as to what abilities are out there for projects like yours. Yes, absolutely ask: could you possibly send us the best email address to keep you abreast of our progress and just where we are in general and where would I? Where would we communicate this information that would be to the board office? Okay and my email address is Ee tires gmail.com? Yes, so between those two and Mr Ellis does. Would you want to share your email address, Mr Ellis, sure I'll put it in the chat? Okay, excellent! Thank you. So much you're very welcome. Okay, so good evening, everyone good evening have a good evening. All right see you soon so moving along to 97 Saint Mark's avenue. This is an application for a new stair bulkhead and Roof Terrace mechanical equipment to be located and roof adjacent to the new bulkhead, and this is in the prospect, historic district and I'm not sure who's. Speaking for this application. Yes, it's Brian Ripple, I'm the architect and the applicant repeat your name, please Brian! Ripple! Okay! All right! Can you see my screen? Yes, so this is an application for 97 Saint Mark's have between Flatbush and Carlton. I still can't see the screen. My screen is still black, I'm sorry to interrupt, but just to let you all know I put it intact: nothing's changing! Okay, I'm sorry! Ms Collins did you leave and come back like I asked you to in private chat, okay, so I'll leave and come back. I'm sorry yeah! Do that, let it re let the system refresh itself, so Mr Ripple! Sorry about that. So please continue with your presentation sure. So this is 97 marks Ave between Flatbush and Carlton. It's an existing. The existing structure is a five-story townhouse. A proposal is for a new bulkhead to provide rooftop access with an associated roof, terrace Outdoor, Terrace and relocation of some mechanical equipment to that roof. So this is the roof planned here that you're seeing in essence the bulkhead is this area right here, which is basically a stair from that top floor out onto the roof and then the roof terrace proper is set at two levels, just basically there's a pitch to the roof. So we need to put two levels to keep the actual level of the terrace down low, and then we are locating mechanical equipment on the back side of that roof. Terrace Saint, Mark's Avenue, is at the front here. The initial proposal to landmarks had that mechanical equipment over here. After doing the mock-up, we realized that it had more visibility, and so we revised the proposal to the second mock-up and located in the back where this is entirely invisible. Now the this is the rear facade of the building. Seeing again the proposed bulkhead here, the glass railing that we're proposing for the terrace and then you can see from beyond that upper level. The next image will show it better. So these are the kind of cross sections. So that's the bulkhead that we're proposing this is the mechanical equipment again the front of the building on this side, and then these are the two levels of that roof. Terrace area. A majority of the railing is glass. There's a small section that we're doing over here, which they wanted to put some plantings up against, which would be made from metal, but the rest of it is all glass. This is the three-dimensional rendering of what's proposed so again, the actual stair bulkhead glass railings on most of it and then a small area here that would be just solid metal. The materials are. The bulkhead would be clad in an aluminum metal cladding as an a page of aluminum, also for the mechanical enclosure, and then the surface would be porcelain papers on pedestals we constructed a mock-up as landmarks have requested. This is just a view to give you a sense, I'm standing at the front of the building. Looking towards the back again, you can see that basic scenario here of the bulkhead, where you're seeing the mesh on the railing is the solid portion, as opposed to where it's just the frame. Is the glass portion view of that and then, in terms of visibility, there's very limited visibility. These photos are taken basically, as we approach the building from Saint Mark's Avenue. There's a moment when you're on the same side of the street, there's zero visibility from the opposing side of the street. There's one moment where there's about 18 inches of visibility, popping up right here that you can see and that's taken. Basically that's this location right here, so it's across the street closer to Flatbush, and then you can barely see it here, just a glimmer of orange again as you move about 15 feet forward very slight degree there of visibility beyond that, it's invisible for the entire rest of the street from Carlton Avenue, which is 400 feet away from the proposal. There's no visibility, except for there's one moment where there's a vacant lot: that's here where you can see both the railing and the bulkhead again from the position across the street of Carlton Avenue. At that point on the diagonal you're about 450 feet away and then continuing around onto Bergen Street is it's virtually invisible? We speculate that when the trees are fully no leaves on the trees. There may be a glimpse of visibility at the top of the bulkhead from across the street on Bergen over here and no other disability note. So that's the proposal and the presentation that we have I'm happy to ask answer any questions that people might okay, I'm going to. We have a couple give. Can you go ahead and just question sure hi. This is give ficoni I visited site earlier today, I wanted to see what the mock-ups looked like, but I could not see them from the angles that are shown in your photographs, and it looks to me like they're no longer there is that right. Yes, there was a it toppled over with all of the heavy winds. It's actually we tried to have it back in place prior to tonight, it's being reassembled tomorrow, the storms. This was erected back in early October and it weathered about three or four storms, but it got knocked over either in this most recent one or the previous one, I'm not sure which so apologies for that it'll be back up tomorrow, so, okay, so that will be back up tomorrow. One other question: I have what's the setback from the rear from the back wall, the rear facade for the railing you're proposing for this railing here yeah here we go, I, don't know about the exact dimension, it's about. Let's see, if I have it in the elevation. One moment it's not even answered in the plans. Yeah, it's not dimension. It's about 18, inches and I can confirm that in via email, but okay, and why are we going with a glass? Why are we putting glass at the railing up there? First of all, it just seemed like it would disappear and the owners really liked it. We weren't trying to it's, obviously not a historic element on the building, so we were just differentiating it, and so the notion was that it's less visible and they like that effect on other questions. Yes, we have a question: does the work include addition, the addition of permeable services surfaces? Excuse me: storm water, absorption to the roof. I'm sorry does it. Does the work included addition of permeable services at present? No, it's we're adding porcelain papers to the roof and as well as the stormwater absorption that would be the same yeah there's. No we're not changing the storm drainage at all. The existing leader just remains the existing roof is existing. It's. We are only adding on top of that. It's a floating system on top of it, okay, Mr Buckholz. Does it answer your question? Where is I'm sorry? Does that answer your question? Is there anything that you wanted to say with regard he's, not answering okay, we're going to move on to it. I spoke for itself. I, oh okay, great, okay, excellent Miss Weinstein is wondering. Is there any way you can judge the noise level from the Buckhead bulkhead I thought the mechanical equipment? Yeah? Yes, that's correct! Yeah I, don't have the exact decimal raiders readings, but this is a mini split system. The condensing units are very quiet and these are actually relocate. So they were there existing units that are mounted on the back of the building that are going to be relocated to this we're augmenting it with two additional ones, but there's three existing units there. So we will be adding two additional, but there's. No, the actual adjacent structures are quite a bit when we go back to the photos. We're looking in that equipment over here and it's quite a bit higher than the adjacent building, so I would actually expect that it's going to be quieter than what they presently have, because the existing units are in the on the back wall of the building. Okay. Thank you very much. Thank you. Are there any other questions before we move on? No I have some questions. Sure Miss ties. Thank you. How many units in the building and what is the mechanical equipment to that you're planning to service those units, sure it's just it's a two-family structure, so owner-occupied and then a rental apartment and the so it's heating and cooling that are basically just a it's a they call it a ductless system. It's I believe this one is made by Fujitsu they're. These small wall bracketed condensers on the roof, and then they have wall units on the inside of the house that provide heating and cooling. Okay. Thank you, okay. Committee members, any other questions: if not I'm going to ask for a promotion hi, I'm sorry, this is again. I was busy typing my question in the chat, but I didn't get it just I'd like to ask two things. The first is what guidance, if any, have you received from landmarks about the color of the bulkhead? This will be, as you show visible, from Saint Mark's Avenue. What have they told you about making it black? They didn't express an opinion on it, one way or the other. To be honest, they were mostly concerned as I mentioned. Initially we had the mechanical equipment forward with screening on it and that was actually proving to be visible. So we shifted that we did two things. Let me go back to that image. We not only shifted, I'm sorry, one second, we shifted the equipment from here to here, and then we pushed the railing over so that all of this was now essentially invisible from Saint Mark's Avenue, and so they have not commented on the caller per se. We were just yeah. It's a bronze anodized color is the one that we're proposing right now. I realize that it's not fully visible from the street, but did you not want to do something located in a way that would make it not visible at all? It seems like if you moved it, you might still have some opportunity to move it closer to the back of the building or potentially move it to the other side of the building. You know the East wall, rather than the West Wall, where it wouldn't likely be visible at all yeah, so the existing location is nested on top of the existing stairway of the entire building, and so imagine that presently there's a bulkhead actually I'll go back to my photograph. You can see it the bulkhead, the mock-up photographs, so presently the stair terminates here and there's a scuttle hatch with ladder, and so in essence, we are basically nesting this right on top of the existing stair. It's the only way that it would be accessible from that existing stair and then both the height and the location was dependent upon the headroom clearance that we have coming from below. So we pushed it as far back and made it as low as possible, and I mean we would have obviously loved to it been entirely invisible and in fact we thought we had achieved it. We're surprised to see that little bit of visibility in the revision, but at this point we've got a minimum elevation at the landing. We just have enough to get kind of a 7.6 landing headroom and the structure above it that's what's dictating kind of the height of it and then again, this position here is essentially because it's following the line of the stair below yeah no I get that it's convenient for the owners to have it line up with the stairwell down there, but it does create the effect of being able to see it from St Marks, okay, Mr Viconi. Possibly you want to recommend another color, no I, I'm I, didn't no, not necessarily I just wondered if it had been discussed with landmarks. Thank you. Are there any other questions? I, don't see any in the chat. Ms Weatherspoon am I missing any. No. There are no more lodged right. Then again, I call for a motion on this item. Bulkhead at 97, St, Marks Avenue. This is in the Prospect heights historic district. Does anybody in prospect heights want to move on this? Okay, so give moving to support with the second from this Weatherspoon all right, any other questions. Hearing no other questions, I'll call the role we're supporting this application for Stair Bulkhead, hello. That is minimally visible from what is it from Saint Mark's Avenue at 97, Saint, Mark's, Avenue, glass railing, mostly some of them played in black okay, Mr Bocconi and Miss Granville. If you mute yourself until you're ready to give your vote, that'd be great, I'm going to pull the roll and support for the motions to support this application. Princess Ben James. Did you support this application? Yes, thank you. Robert Callahan! Yes, Collins! Yes, thank you! James Ellis! Yes, thank you! Kevin Farley! Yes, thank you! Johnny Granville! Yes, they can't hear me yes, Kathy Island! Thank you Catholicism! Thank you. Yes, this is Zerzema Jordan. Yes, thank you! Sarah Lazar! Okay! Let's take that sms. Thank you. Jerry Norton Robert Puka, yes, hey, Robin, Pooka I got laid sorry: okay, Carl Riddle, Adam, Sacks, Meredith, Staton, Mrs, Satan, Mrs Dayton. Oh, yes, all right good to hear your voice. Ethel tires, yes, give Viconi, I'm staying, abstain. Here's a Weatherspoon, yes Jared, Wetterburn, Elaine Weinstein, yes, Deborah Young abstain. Okay, what have we got here? We have six. We have 16, yes and two abstentions: I got seventeen, you have seventeen you're right, 17. I can't count okay, so we have 17 tests and two abstentions and the item is passed and goes to LPC for Tuesday December 15th. As you all know, these are online now. So if you want to watch that it will be there, we've actually been. We've been calendared for next month. I think they already filled up. So it's the January meeting January. What day I will look? It up? Pardon one? Second? Yes, they just said January 2021. They didn't give me the date yet I apologize, sorry, okay, so we'll it'll show up that's for sure. Well, this was a good presentation and it's a fairly simplistic project. So it shouldn't be a big deal. Thank you for coming in and then wish you luck at your hearing. Thank you very much. Thank you. You'll be sending a letter to LPC to know the result of these deliberations this evening. Hello I think we have 294. Excuse me miss Tyus, yes, I, don't know if Mr Ripple has left, but is this going to be presented at the board? Yes, that hasn't been mentioned. Does he know? Thank you, you're right, you're, absolutely right! All of these go to the full board for confirmation next week, I believe correct next Thursday and you made you want to be on that meeting to answer any questions that weren't brought up tonight and I got to get back to Conan and tell him that as well. Thank you, miss Weatherstone, understood. Thank you. Okay. Now we have a surprise entry. Here we weren't expecting 294 Albany avenue, which is an item we would hear and vote on and then. Lastly, it's a preview on 840, Atlantic, Avenue I, believe which we wouldn't have to vote on, we're just getting a presentation on a plan for that building which is in or near the in crown zone. So do we have materials to look at for 294 Albany Avenue? Do we have a representative hello? Do you hear me? Yes, hello, my name is Maryam. I'm project manager of 294 Albany. You have to spell that for me, I, don't see you listed anywhere. K is slowly K a p, a n, a d c e. Okay and you are the representative for the project. Yes, okay, do you have materials to present? We send the application by email. Do you have anything you can present on screen? Okay, I can share. Do you see my screen? Yes, so this is 294 Albany Avenue, yes, and this is for minor, exterior facade renovation. Yes, it is nice north destroyed this okay. So this is the rare earth. We have window change here. This is the condition prior to work, how it was when we started this project and after they did this sliding door, because we're gonna have deck here at the top of extension. Okay, I'm sorry Miriam. Can you make your screen big enough so that your presentation takes the whole screen? Thank you. Okay, sorry about it all right. You have my attention. So this window, actually this sliding door is visible from the streets of Lincoln place from here. This is how it is now this is view from street okay. This small portion is visible from some places. Okay, what else do we need to know and so we're proposing to so it is a break as it was in previous condition. We had some arch here, but we're planning to do it like all wide of the sliding door. Why didn't you give my mother branches? She didn't wanted him. Sorry, Miss Jordan. Can you close your mic? I'm going to unmute all and the presenter. You can go ahead and unmute yourself in about five seconds. Can you continue Miriam? Is there something else we should know about the project? Actually, that's all! That's only this sliding door. Okay and you want to talk about the composition of the door or anything like that. Yes, we have a sliding door details, dimensions, everything cause. Actually we have it already presented with pictures, but there is all details of this door. How big is it? This is eight feet. Okay, and so this door opens out onto a rear deck, yes rear deck, it looks like there's barely any safety issues there from the pictures. The drawings show a safety really. What will that be because I don't see it in the picture, so this is the deck we have proposed at the top of this extension, and this stack is until here we have some column here for support this deck, so it will be metal deck. This portion, what color I didn't present it here, but it is brown I. Remember we don't have color here, but it will be brown okay. What else do we need to know about the project? Is the door already installed? Yes, it's already. So yes, it is, but the railing is not there from what I can see. No railing is not and that deck is not also yet. Okay, I have a question a lot of the time in these presentations. People show what the buildings on either side of the site in question. What the back with the back of those buildings look like, so that we can compare. Do you have pictures like that? Sorry, I! Didn't understand my pictures, sometimes in these presentations people show a picture that shows the buildings on either side so that you can compare how much this proposed new silhouette is similar or different to the building or different from the buildings on either side of it. We now have neighbors pictures from back. Do you have the block building footprint there? The log front face the Sanborn Map. Yes, we have, of course, maybe I missed it. Has this information been emailed to the district office, so I can circulate it to the Lannies Committee Julia? This is James. It was in our dropbox file, 294 Albany, yes, okay, I'm not sure if the Sandboard Map was in there, but there were photos. No, we didn't submit sunburn maps, okay, so we're on Lincoln place and Albany Avenue, and your cursor is pointing to the building at 294, which is near the corner of Lincoln Place good. There we go okay, we can't I can't really tell from this particular version of the map. What the neighboring buildings look like in the back. Okay, keep going to the same. This is not showing us very much. Okay, Miriam! Do you have a date for LPC? Is that December 15th sorry dates the date for you to go to LPC. Think no excuse me miss Tyus. Yes, I'm not sure. If Miriam has a grasp of the presentation, that's needed for the audience and they're there are a few. There are a few questions that we have that's really relevant to what we're not hearing right and I just want to remind everyone again, please, if you have a question, please don't call out. Please put it in the chat, as we've been doing. I really would appreciate that. So we have a few things. That's of concern. The plans say that the railing color is black, a black material. Is it metal. The other concern is that we have an organization that in the community, the North Crown Heights Association, and this is something that they would have had to have in hand meaning received it even prior to you speaking to us this evening. So that's also a concern. Just we need there's a lot of clarity, that's needed, and I'm not sure if you're prepared this evening to answer I. I'm just curious. I know that you're, representing are you the architect for these plans, project manager? Okay, actually, our manager is on vacation and I wasn't planning to join with this meeting, and so I'm not really ready, but all I have is the plans and I'm trying to explain what we're gonna do. So this is our block. You know, because you really want to be able to present in your project's best light and, if you're not really prepared, you know it just, and you can't even answer the question. You know you really want to be. No I prefer this I preferred it, but what they submitted, what they sent you, I'm not really aware they should send you slumber maps or not all of these details. I just know projects what is inside there. You know, okay, this is an entree to ask you to return to the land use committee in January, so whoever is the head honcho at Cityscape. Is that the name of your firm cityscape? Yes, okay, it seems like because we don't have a holistic presentation on your proposal. We need to ask you to come back in January and give us the details on what you're proposing, because right now we're not sure so we're looking at January 7th do we know their hearing date, though yeah there is a hearing date. We'd have to send an email to LPC and say we didn't get the information that we need to take a vote. So we sent everything what they said to us, but it was never like summer map. I'm sorry. We submitted what they told us the project and the pictures of notices to neighbors but somewhere map. No one told us about it. We have to send it or what else we have to send. I'm fairly sure the district office advised you to make a presentation to the local Neighborhood Association Block Association, Neighborhood Association, and in this case I'm pretty sure you were told by the district office to make a presentation to the Crown Heights North Association, which is the general representative for the Crown Heights North historic district I. Don't think that was done, Miss Young! Can you confirm? Yes, I was gonna, I was putting it in the chat, but since you called me out, I have to say that the plans were sent to myself as they were to the Saint John's Block Association. Regrettably, we did not get to review them. China didn't, but that's on us, okay, so I, don't think the applicant should be held responsible for that. However, in view of the questions that's being proposed, the presenter this evening, through no fault of hers, may not be in the best position to answer those questions so I do support and was going to recommend that they return in January and that they request or whatever process we need to follow up on so that their hearing with LPC is rescheduled. The person who sent out the plans who sent other things to us before is Alexander. Yes, he sent those plans out. Actually it was the day before Thanksgiving I think they gotta got lost in the process of the holiday. That's what I have to say because I didn't I did lose it. I'm sorry so I do apologize for that, so that was November, 25th or 6th, or something like that. Okay. So what's your recommend that you you're recommending a revisitation in January? Yes, are you okay with that sorry, January? Okay, but twice we have to present the pictures of neighbors and how can we prepare better where well you want? You do want to have a better description of the project to present to the audience. Ms Neil I think she's, asking about be notifying the neighbors is that the process there will be an updated form with the land use, Committee infant meeting information that will be sent out to Alexander and anyone else. That's on the initial emails with all the ccs going back and forth. Okay, so that we have a more comprehensive understanding of the proposal other than the pictures with a door. That's halfway off the deck, with no railing the drawings and comparison photos to the building's nearby on either side in particular, to show there's a consistency or rhythm to what you're planning to do so. The building to the west seems to be a budding over a garage or something. So that's not so it's a building on the other side. You need to include a photo of that rear. Miriam. Is that? Okay? Can you okay understand? We will take the pictures and present it, so the door would only if you're walking out of the building through that door. It's only going to open to the left, because otherwise there would be nothing there. Are you planning to do anything on the ground floor level to expand that rear extension rear shed or whatever it is? Okay, I'm coming out from the building through that door. It has to open to the left in order for me to step out onto the roof, we're going to play here to have deck all of these lengths. Only at the top of the extension, it will be longer like until this corner. Okay, so we I'm not seeing that and what's been presented so far, we have it in elevation. So Mr Ellis made a comment in the chat. Excuse me Sarah we're watching the chat, so we I see it just like everyone else. So I will I was planning to mention it. I'm not ignoring the people in the chat room. Okay, would you bring us up today? Ms Weatherspoon, no I was just waiting for you to take a breath and finish what it is that you were saying. James does have something that he wants to say and it's better. He says he's put some things in the chat and he can speak on it. Okay, thank you. So it seems as if this project we're not I'm not 100 certain. What it is that we're looking to review the applicant is proposing a rear yard, a window, a change, that's already been installed for a sliding door. That's going to go over to a deck with a new railing, but comprehensive review of the plans being presented also shows the front door is being switched that there's a new painting, color scheme, that's going to happen to the front, but there's additional changes to the rear yard extension with a new door and a column being installed, and my concern is that the pro the present presenter is not it's not articulating to us what it is. What are the elements that we are looking to support in his proposal? So if we are aware that their hearing is not until a later date, I think it would be best advised to table this until the presenter can comprehensively present all of the elements of this project. Inc the window, changing I think there was also some mortar, some artificial, mortar or casings that were going to be installed. So I think a lot more detailed elements of this project that we're not hearing. Tonight we sent you before the whole application, but after our lemon complement, examiner advice like I detail, is only the this portion. We wanted to discuss on this meeting only the this window just show only these details there, because I have this application. Of course, I can open and I have full application for all details. What we're going to do front and rear? Of course I can present it yeah once, but let me just clarify I think that so there that's the clarity that we would have done. So all the other elements of this presentation, the pdf version, the paint color the front door, the rear yard extension elements, that's already been approved at staff level, so is it am I to understand that you're only seeking approval from this community board for the rear yard new window edition in the railing? Yes, that is all you're presenting today. Yes, all the other elements have been pre-approved. Yes, that was the only issue with landmark she wanted to present. Okay, so I think that's where we're asking for you to articulate what it is that we're looking to approve on in this application. So if it's just the rear door in the railing, then I think we've seen and heard, and we can probably question and debate and but if all the other elements of door and the paint colors and all the other things that were being changed have been approved at a staff level. There's no reason to drag this off unknown. I know it's almost approved this project, that's the only point we hold it and we submit it in community board. That's the only this window. We want to change like the sliding door and the rear deck portion proposed portion of the deck from here to here, like at the top of this door. Like a present, if I may ask is there is the only portion this only this portion being the only part being asked of approval, because it's already been installed because you went ahead and did it you went ahead and did it without approval? Yes, it is okay. So now what we have is five days notice when they were instructed to give seven days notice in advance of the meeting they sent their materials in on Thanksgiving day from what I'm seeing so I would love to just do a quickie on this because it seems simplistic but we're not getting any feel for the building to the east or the building to the north on the neighboring building, we're not getting a holistic presentation. So my recommendation is to ask for a fulsome presentation at our next land use committee meeting and I'd like to know if anyone else on the how many of you on the committee agree with me. No just I think I don't have enough information on the table that okay Committee here Mr Satan, yes, I did hear him. Thank you. Yeah I want to table it. I don't have enough information. Thank you. Mister! That's one view. I think Mr Ellis was moving towards trying to dispose of the item because it seems fairly simplistic. I see. Miss Lazor wants to make a statement. I see. Ms Granville is agreeing that the information was sent out. Late, Saint John's, the local groups, didn't get a presentation and Miriam is struggling to explain what it was planned here. So I. Miss Young also wants to make a statement. Okay, young yeah, okay, I just want a couple of things, one for clarification and I unless I, misunderstood I want to be clear that they did send out the presentation again, but late on December 20 on November, 26th I tend to agree, yeah thanksgiving and that's how I think it got lost. I agree with Mr Ellis that if it is something as simplistic as the two items that are being presented, then I think we could dispose of it. However, because of the lack of clarity in terms of I'm, not so I'm not clear any longer about what they are supposed to be presenting to us what decisions were made by LPC and I'm not sure that the applicant is comfortably able to explain to us to me not to us. I can't speak for anybody else to me what she actually is trying to get our approval or support on from this application. That's not clear to me right now, because in looking at the designs, I thought there was also a part where they wanted to build another level. On top of the rear extension I thought I saw that in the plans I could be mistaken, but you know that there's just too many uncertainties, although I would like to dispose of it, but the descent. The uncertainties don't allow me to comfortably do that. Okay, Mr Puka, has also wants to make a statement, I'm leaning towards saying, James and again I like that clarification from the applicant. If it's just a railing and it's just the window, if it's just those two items and El and LPC has already at the staff level, has already approved the changes. I just don't see what I understand the applicant is not explaining herself too clearly, but as long as LPC hasn't, and if you know that LPC hasn't issued any opinions against it, I'd be willing to give LPC the benefit of doubt. In this case, I'm just against tabling and I think we have enough information to make a vote on if it's just derailing the door. If we can somehow clarify that those are the only two issues, that's my personal opinion. So sorry, this is my because of my language. Maybe I can not present it like clearly, but I'll. Try again to this is the application. What we signed you before it shows a metal deck at the top of a rear extension. This is the only extension. What is existing. This is downstairs. This is from second floor and this is only extension, and all of this is metal deck at the top of extension and more this space, and this sliding door goes on this metal deck, but we want to get a pro from here, and this is how it looks like on elevation, and this is side elevation. Miriam is the bathroom being expanded. This bathroom is existing. This is the extension. What we have already at the radio right is it being expanded? Is it being made bigger? No, we don't attach it. We will do only the roof bigger, so deck we're not touching the walls. We only extend that portion see how it is presented here. Okay, so now you're staying here- and this is proposed portion of this floor of this deck, okay point to where you're looking on the plans use your pointer, where's, your cursor okay, you see my cursor I'll move it. Oh I'm moving! Okay, so now you've been to I, see it now, I see it go ahead. Okay, this is the only portion of this floor. We're gonna extend for this. That's what I thought that makes sense, so you're going to have a plate there and then you're going to have a joist to support that additional, yes and then the door below is staying. It will still be operable. Okay, all right so, and we're gonna have railing around this black metal deck. All right what's happening next door. The other way is there a similar. Is there a matching extension that matches the extension in the building you're working on which door? I'm sorry? Is there the building next door? Does it have a similar extension? Yes, they have extension, but they don't have this sliding door or deck on second floor. They have window, they didn't change. Okay, all right! So again, I would like a motion from the committee on this item before I asked the mo yes for the motion. I see because Jim has a question: yes, Mr, Mcconney! What's your question? Please I I've been looking at the LPC website for this address and they have one approved certificate of no effect and another one that's pending, but the one that a cne wouldn't cause them to come to us I, I'm just con I'm confused about what this is. The cne that was approved before wouldn't cover this sliding glass door, these glass doors on the back wall of the house. What's are you applying? Is this project applying for a certificate of appropriateness? Is that the permit you're requesting you've already done the work? So it looks like it looks to me that the work must have been done without a permit, since I see no approved permit for this property. That would allow that those glass doors in the back, but it also doesn't have a violation by the way I looked for violations for this too and I couldn't find any. So I'm just confused about what this is really for. Do you have a docket number at LPC for this for your project? Can you type it in the chat? If you have it, I'm not sure I can find it yeah, I'm just very confused, because I don't see any I, don't see any violation and I don't but I don't see a permit. That would cover the work that we're seeing in the photographs I mean it looks to me like we're being asked to legalize work. That's already happened. Excuse me miss Tyus, hello, Ms Tyus, I'm here, yes, I just want to bring to your attention that we have a chat box full of our members who are asking for this application to be tabled. People are not feeling comfortable and I. Just you know, I, just we just kind of I mean the comments are building and it's saying the same thing and I'm I too am in agreement because we really don't know. What's going on. It sounds like we're looking to excuse work. That's already done we're just not sure. What's going on. Thank you. Mr Weatherspoon I make a second call for motion on this item. Motion I made a motion that this sorry, one of the Times James Ellis, was in there first go ahead, James hi, thank you. So let me try to craft this in real time. Do I would say. My motion is to my motion is with the thing that no violations that we would like to table this until our next committee meeting more developed presentation of application. Is there a second to Mr Ellis in a second thank you, I'd like to make a friendly amendment to that Christmas Young. Yes, I'd like to suggest that we add clarity, certainly with Mr Ellis proposed I support that, but I'd like some more clarity on what, if there are violations, some clarity on what those violations are and that thought be spoken to at the next hearing when they come back before us. I, don't know if that was clear in the spirit of your in the spirit of your amendment. I do accept a I think it's about a more comprehensive presentation on item proposed. Okay, so this would include which would include any violation. That's worked out, okay, that works. Okay! Thank you, okay, and that's in second that as well still, okay, thank you. More informative presentation is requested for the land use committee meeting in January, which would be on which would be on January 7th of 2021. Time flies when you're having fun and I need to call a roll on this make sure everybody's on the same page. Excuse me too also that the neighbors are notified just to make sure as well the neighboring yeah and it's a seven at least seven days in advance of the meeting. Yes, is that business days, Ms Neil it's seven days before the date of the meeting. So if the meeting is January 7th, then you know notification would happen about December for a little bit more than seven days. You know, preferably about ten but seven days. The standard, okay and you're talking calendar days, not business days. Thank you, okay. So all I'm pulling the ball on tabling this item. Princess Ben, James motion to Table, Princess, Ben, James, yes, motion to table, okay, John Buckholz motion to table doesn't appear, he's still present any longer. John Callahan Robert Callahan. Also, my presence I heard a faint. Yes thank you, James Ellis motioned the table. Yes, Kevin Farley, yes, Johnny Granville! Yes, thank you! Kathy Island! Yes, thank you! Zuzima Jordan! Yes, thank you. Sarah Lazar off Jerry, Norton, Robert. Puka, repeat: please, are you saying yes or no abstain? Thank you. Carl Riddle Adam Sacks Meredith statement. He has stable Ethel tires, yes, give Bocconi; yes, here's the weatherstone; yes, damn Wetterburn Elaine Weinstein! Yes, thank you! Deborah Young! Yes, thank you. 16 in favor of tabling with one abstention motion passes and we ask that Cityscape Alexander, I'm sorry, I, don't have the last names return on 294 Albany avenue for January 7th. Excuse me miss Titus! Yes, do we has it been confirmed if there's an LPC hearing date, I believe there is a I sent that out earlier I think last night, Richard Bryan usually sends out the schedule and they were on there. Lpc will get a letter explaining that we've asked them to come back to the land use committee meeting and then to the full board meeting for January and they usually work with us. Okay. Thank you. Lastly, we have an item on I think it's 840 Atlantic Avenue. Do we have representatives here for 840 Atlantic Avenue? Yes, hi, Stephanie, Marazzi and Benjamin Stark here? Okay, so we have a presentation, but first I want to thank the land, Use Committee and the community board for hosting us tonight. My name is Stephanie Marazzi. This is Benjamin stark. We are both land use, attorneys at the law, firm, Herschen singer in Epstein, and we represent the applicant for a rezoning of 840 Atlantic Avenue at the corner of Atlantic and Vanderbilt. So we have a presentation which I will just pull up here. We go: okay, who's, your client, our client is Vanderbilt Atlantic holdings, which is the ground lessee of 840 Atlantic Avenue. Okay. So let me just thank you. Can you see the presentation? Yes, okay, great hi there. Thank you. As my colleague Stephanie introduced, we represent Vanderbilt holdings, the ground, let's see of 40 Atlantic on the corner of Atlantic Avenue and Vanderbilt Avenue your neighborhood prospect heights. This is an application to rezone the aforementioned property, from m11 to c63x and with that establish an MIH area and also amend the zoning resolution to allow wider more pedestrian friendly sidewalks when the new building is constructed, which you'll see later in the presentation, as some members of the community board I mentioned earlier. This is a preliminary presentation. This application is not yet certified into Euler we're here tonight, just to update everyone on the status of our application and the project generally and to show you know what our thoughts are here. So we're excited to be here tonight and to show you what we've been working on as a lot of people know this site in that it's adjacent to the Pacific park project. It's on the very northwestern edge of your M Crown district and many people just know it because it's worth the drive through Mcdonald's is Humbug. Oops. Let's see my is it working? Oh, it doesn't work if I hit the arrows if we click on it, clicks, okay, once again, southeast Corner, Atlantic, Avenue and Vanderbilt Avenue. I'm sure this is all oh I can hit back here. Yeah cool yep, we're on the corner of Atlantic around the corner of Vanderbilt, two very wide streets: Atlantic Avenue 120 feet wide Vanderbilt, 100, downtown Brooklyn. In the distance there. The open rail yards on to the west of the project site right now consists of a handful of tap slots with the primary lot being a lot one on block 1122. This is a tax map, I'm sure everyone on the landing screen you've seen these before. But this is we want to flip between these two images. Just so, you can see what the current lot configuration is in kind of in a an actual, understandable context of what the project site is bring us down to down street level. Here, we're on the corner of Atlantic and Classen. The project site is to the south, but in this image just to your left, this is right where it is right, where Clinton kind of dumps it out into Atlantic. The Barclays Center is further in the distance to the west. We're gonna bring it a little closer 550 vanderbilt in the background as well right, 550 vanderbilt moving along we're gonna. We swung it around we're now on the hundred foot wide Vanderbilt, with the 20 foot wide sidewalk, the Mcdonald's immediately to our right in the open rail yards to the left to the west, bringing in a little closer for everyone to see the project site has a handful of residential buildings in the middle of the Mcdonald's. They are part of the project site and would be raised for new development. This is an image we have already today to show of the new building that is proposed for this site. The rezoning, if approved, would facilitate development of a new 18-story building with approximately 316 units of which 30 would be earmarked for affordable housing. The building would also include a non-residential uses on the ground and on the second story back to up above. So what brought us here today and why are land use actions necessary to facilitate this project so I, as I'm sure so many members of these committee are familiar with, especially those involved in the M Crown study. Much of I'm not retreading any. You know new territory here. Everyone knows that much of Atlantic Avenue is zoned m11. The way it's been zoned for almost 60 years a year in about a year, yeah, so 1661. and in that and that m11 district had been shipped into a number of times. This application would be the next extension of that evolution, m11 districts, as I'm sure so many of you know, are very low density districts. They permit just commercial and industrial uses and they do not permit residential use so that zoning would have to change to facilitate the new development. The project is, in our view, consistent with both the department of City planning's thoughts on the future of the M crown, and also consistent with many commentators view on the future of the M crown and that where we sit in the wider M crown is right along the western edge in an area that's been identified for high density commercial district. That would allow a significant development of a significant amount of new housing, including affordable housing. What's part of in our view why the city has earmarked again I'll bring that one back. This particular site for high density development is what is slated for development nearby and, of course, just because there's new development slated nearby. That doesn't always mean that certain development is appropriate, but we believe in this case the development that we've proposed is keeping with. What's going to be going on around it and offers a wonderful transition to the balance of the neighborhood to the east and to the south I know, a lot of people are familiar with what's going on at Pacific park and but just to remind those who aren't a 550 Vanderbilt already constructed has a roof height of over 200 feet and eventually parcel 10 of Pacific park, we'll see a building with a roof height of over 300, but it's not the only development of significant magnitude, nearby 470, vanderbilt and 810 full and are they share a merge zoning lot, they're kind of different sister developments. Recently, a new rental building on that merge. Zoning lot fronting on Fulton was developed with 73 units of affordable housing. But then the most recent development of node in the area is what's being developed at 809 Atlantic across the street, a roof height identical to that which will come with Pacific park's, partial 10, a 312 foot, roof height, and this development will include 206, total residential units with 86 units of affordable housing, and this the city planning and the city council and others have deemed it appropriate, given the very wide nature of Atlantic Avenue and the exceptional access to not just local public transportation, but regional public transportation with the long island railroad nearby, we didn't have great renderings for that building because it's not ours, but we pencil had our architect pencil in what that structure is gonna, look like in the context of the surrounding area, and but we did also find this on online. Maybe some of you have seen this particular structure. Pretty you know, uses a small floor plate, but it transitions down to a podium, lower densities. Moving to the east. This is where our or how our proposed structure kind of fits into this future context. You can see that we've taken it upon ourselves to try to step down from, what's going on to the west into the north, noticeably over a hundred foot step down and then further step downs as well, and that step down is in keeping with what has been discussed with M crown that the step down should not just occur from sites to the west of this particular corner, but also within the site itself. So you can see that the yellow here on the corner of Vanderbilt and Pacific, calls for some amount of step down. So that's what we've proposed here that the building will stack far and away most of its density right on the corner of Vanderbilt and Atlantic, and then and it will move down by almost 100 feet to the corner of Pacific and Vanderbilt, which is similar in context to what can be developed in R7D districts and this action. This kind of spreading of bulk is we'll show it kind of here. This is a great way to demonstrate it. We've got most of the bulk piled right on the corner and then a number of steps drop almost 100 feet, and then it continues to drop on Pacific street to match some of the context moving more to the east, and this is the stack of what this mass looks like in its effort to try to work with the surroundings around it and provide that transition that we discussed to the lower densities to the east. So the zoning actions necessary to facilitate this development include a spring map amendment of the underlying m11 to a c63x district. Again. Why is why are we proposing an l-shaped rezoning area? It matches the l-shape of the development site itself and the building, like we had said, includes over 300 units of housing, of which 30 would be earmarked as affordable housing units, and at this time the development team has proposed to use option two for its MIH compliance, where the weighted average of the income bands will not exceed eighty percent of AMI a way to kind of think about. That is. If there's an income ban over 80, there has to be a commensurate number of units below 80 to make sure it always averages out to no greater than 80 mi. But it's not the only action. That's that land use action proposed to facilitate the building. After a number of discussions with city planning, we've proposed an amendment to the zoning test to facilitate much wider sidewalks, which we think is appropriate for such a wide street, where pedestrians are often quite close to traffic. We think wider sidewalks allow the installation of pedestrian friendly street furniture that then creates kind of friendly barriers between where a car might be parked and where a pedestrian may be walking. It just allows more optionality as far as really separating the pedestrian from the real busy nature of both Atlantic and Vanderbilt. Is this part of Vanderbilt, where it intersects with Atlanta? So that's our presentation for you tonight we're very excited about this project and bringing it before you today and, of course, we're here to answer questions that you have. Thank you both very much Stephanie I didn't quite catch. Your last name and I can't see it on the screen. Sure my last name is Marazzi M-A-r-a-z-Z-I and I'm Ben Stark S-t-a-r-k I won't call you tony it's either that or it's game of thrones, so I like to okay. So we have a series of questions for your proposal now. You're well acquainted with them, Crown Act, obviously, because you've been referring with DCP, you have their take on it and you would think you have their blessing already, but we work very closely with city planning. M Crown is a neighborhood rezoning project and Gcp is our partner in that effort. So I want to step through the questions that are in the chat. I, don't know if you can see them as well. If they're offered to everyone our beginning question is: will there be separate instance, entrances for affordable housing residents which I doubt but I'll? Let you answer that no separate entrance, it's no longer permitted by law, yeah! That's what I thought now we're looking at what can be built there, you're working you're, proposing 18 stories with 316 apartments and the zoning you're recommending is equivalent to an R9X. If the members of the land use Committee are writing your assessment, that's correct, although a really important thing to remember with this particular development is that despite the rezoning to an R9X equivalent, a notable amount of the zoning lots, lot area will be rezoned from m11 to r6b and because of that, the development itself will not be able to achieve the maximum permitted far in R9X. Rather, there will be a blended far because of the significant chunk of the lot or the development site that will be zoned to r6b and that's a that's. An affirmative act by this proposed development. The there is M11 zoned property that is proposed to be zoned under 6b, which ones are those? Can you point them out? So if you can see on the tax map, this, like the I, can't tell it's a portion of lot, one that has a leg that extends down to Pacific. It's the easternmost portion of the development site, that's outlined in red, that is on Pacific street, that is still within the R6B and part of it is currently zoned m one and one yeah and will be rezoned right. That's right: okay, what size units will be affordable. You know, I, don't know if we have an answer for that right now. I think that the law requires that they be the same size as the market rate units so or yeah on average out to the same size, but we can confirm and get back to you on that. Okay, let's see percent, because thank you Richard. So you know that's Richard Bearak from the borough president's office, speaking yeah, okay, I'm sure you're familiar with him. So are there other questions than what I see in the chat? There are a number of questions. Perhaps the assumption you could direct us. The one you'd like us to answer: first: okay, that's that all right! So now I'm just going down the list. You've answered most of them already. Are there current residents and are they controlled or stabilized? There are. My understanding is that of the residential units on the site. Some of them are occupied and I believe most of them are actually owner occupied. So they're fully aware of what's going to transpire here and will make arrangements and those arrangements will be a sale to you or what are they? Well, you know, I can get I can ask for a little more detail. I all I know is that they are owner occupied. So you know how many of the, how many are like that? How many lots are like that on occupy presidential, we'll provide the community board with a better synopsis of the you know, the number of residential units that are within the development site and what their status are. Thank you. Okay. Let's see what else is here? What am I missing, gotta scroll down, there's gotta be some more questions here. Ethel can I have a chance to ask a question or two, of course this is given for Coney. First of all, I want to make a comment. The community board and elected officials have indicated a desire for a density of six to seven far along Atlantic Avenue. What in what's considered the C sub zone of the M Crown proposal, which is what this building is in so this is this building is asking for two to three far more than what we have proposed along Atlantic, Avenue I haven't heard any talk about what would justify that other than zoning context, and I'm don't even get me started on trying to talk about zoning contacts next to Atlantic yards on buildings that are unclear will ever be developed. So we haven't heard any justification from a community benefit point of view of anything like three far more than what the community has asked for. But if we were to go along with something like that, it would absolutely have the effect of creating tremendous development pressure on the lots to the east and would be very difficult in my view, for the community board to ever get back to the six to seven far that has been outlined for Atlantic Avenue in the imprompt zone. I want to point out that this is the first lot on Atlantic Avenue. That has come to us with a proposal for development and if we start this way, it's going to be very difficult to keep the density on Atlantic Avenue, to where the community board and the elected officials that have partnered with us on the crown vision have pegged it. So that's so that that's a that's the comment I want to make and I think it's surprising that we did not hear any discussion at all about what the trade-off in public benefit is for this additional density. I want to say that MIH option. 2 is not what the community board typically asked for in MIH rezonings, because the far I mean I'm sorry. The affordability levels are higher. We typically ask for option one, and here I think we would probably ask for one plus option three, with some very significant commitment to deeper affordability on the part of the developer. At least that's what I would want to see happen here, but I'm curious as to whether to develop the applicants control all the lots in the development site. Could you speak to that? They don't I. We we're like we said earlier. We represent the ground tenant that is proposing this development. On the we understand through reading the chat room, that there's is some discussion about ongoing litigation between the existing Mcdonald's tenant and the developers of this site. You know we can't speak to that this evening, or the land use attorneys retained by the ground tenant to redevelop this property, but I do want to speak to your points about density. You know we have talked ad nauseam with you know some of the city's policymakers about density at this location. We understand that those policymakers don't always see the eye with the community board and other stakeholders, but we don't think it's appropriate to characterize the far of or the far that's being requested for this site as 3far beyond what you know, the community had asked for it like I said that, because of the proposed rezoning to 6b, the maximum far that could be achieved at this site would be 8.8. And yes, that is beyond this, the six to seven, that it sounds like your that the community has identified for Atlantic Avenue. But we believe that, because of this site's unique position on the corner of Atlantic, Avenue and Vanderbilt, that it is appropriate for this site to have perhaps one and a half, far greater permitted density than sites on Atlantic Avenue moving East. We don't think that the community is going to lose its opportunity to maintain that six to seven far grasp on Atlantic Avenue. In fact, we think, like we had shown some of the prior images that stepping down to an 8.8 here from the more dense developments to the west is going to set up future land use actions moving east on it on Atlantic Avenue. For a lesser far, we do not think that, based on our feedback with policymakers, that they support densities- east of us at the same far, we know that they feel that the corner site, because of its proximity to 120 foot, wide Atlantic, Avenue, 100 foot, Wide, Vanderbilt, Avenue, its proximity to public transportation on a regional scale, that this is exactly the type of site that should have an extra far and a half beyond. What then will be mapped along these very long. 800 foot long blocks moving east and do they also agree that there should be no additional trade-off in terms of additional public benefit from this? From that much far, did you just get it because of the width of the street? I'm not sure. Sorry. In other words, your argument is that you is that you're owed all this additional far because it's a wide street and that other people and it's the corner of two wide streets, but nobody else will ever again I, don't know if that's true or not, but I would like to ask if you're aware of line that's ever being mapped in outside of Manhattan I. Don't have an answer that, but we could definitely follow up, but I'd also say we don't think we're owed anything I. Don't we don't like that way of putting it? We think you know we're land use attorneys, we represent property, and this property is, in our view, uniquely positioned to be part of. You know the city's effort to develop housing, including a very notable chunk of affordable housing within proximity of public transit, on concrete on streets that maybe aren't at least at this time, particularly pedestrian friendly, and that these improvements will better the quality of life and will not put the community in a position to you're not going to be in a position to have R9X flying on inhibited east. This is, there is only one corner of Vanderbilt in Atlantic and this is it I counted. Thank you, Mr Stark, and thank you Mr Viconi. What we're looking at here, who's speaking, please, and that the higher number was allowed her development thanks to Barack. We want to stay on track with what's happening in our neighborhood Atlantic yards Pacific park started out with a heavy hand using eminent domain. We don't have that here and since that did happen in this community district, we are not now what I want to call woke. Okay, so people are sensitive now to the rapid pace of development that is happening in central Brooklyn, because it's transit rich is going to attract companies like your client, and this would not end it would go along any high traffic mass transit corridor and that's the route of Lirr going east to Jamaica and north and south with the different train lines. So we are in community district. Eight, we here in community district are very sensitive to these types of proposals and we will be looking for benefits and a moderation of proposals of this size and girth and substance. We are hitting a bit of a slow down because of the decision makers. Changing hands is a changing of the guard. The mayor's changing we've got Covid-19. A lot of things are slowing down here, so we are hoping that Vanderbilt Atlantic Holdings will be sensitive to the time that they're operating in and not try to max out on this largely minority community. With this very substantial project, I know: Mr Viconi has some more questions. So there's a question here about ground floor uses. That is one of the key linchpins of M crown so that we can have jobs in an area that doesn't have a lot of jobs in crown's been sitting around for a long time. People waited for the city to do the studies. Now that is slowing down folks are ready to jump in and do it on their own, but we're here we're not leaving we're going to work with investors to do beneficial things in our community, not just for them, so they take them to go but to bring something into this community district. That's worthwhile, I, see, there's a question on ground floor uses and look to the question. Ms Lazor, you had a question on ground floor. You want to bring that forward. Oh I mean it was pretty much what you were just talking about, how the whole purpose of them crown was to have this like mixed-use area with that would be creating jobs that people could walk to jobs that you didn't necessarily have to have a college education for light manufacturing. I didn't see this addressed as part of the plan and I mean just to also follow up. I'm also a member of the Kronaites Tenant Union, and you can be sure that affordability is a serious concern in this neighborhood and all around it, and you know proposing something like 80. Ami is: maybe it's not something that is going to win you popularity contest. You want to frame a question there, so Mr, Stark or Mrs Marazzi can answer yeah well, I, just I guess if they could answer the question about what they plan for the ground floor uses and also to talk about how flexible they are on the affordability question. You know which AMI option and also are they going planning to apply for any other programs that would create affordable housing, 421a, etc. Yeah there's just a lot yeah. Thank you. Yeah I hear your questions. The ground floor is proposed to be primarily commercial. This commercial will be on the second floor as well, so the first and second floors will be entirely commercial. It's let me see how much commercial there is about 50,000 square feet, and then we have about eight thousand square feet of community facility space as well, so under rezoning, there's not really a good way to make that mandatory, but it is part of our design and what we intend to do is two stories of commercial use in terms of AMI, yeah I think. Ultimately, it is up to the council member, the majority leader about what she would like to see. So, as Tom also said in the chat, we're open to discussion on that. Thank you very much. What are your next steps on your project? Well, I mean this was a really. This was a really important step, just to finally be before the board and finally, before the various neighbor associations that are nearby. Our next step is to continue to talk with city planning, to make sure that the application is more refined. We also are reaching out to the majority leader and trying to set up time to speak with her and her staff. I mean we are we're hoping to certify early next year into Euler, so we'll be back within a few months. Hopefully thank you. There are a couple more questions here. You plan to complete Euler during a next calendar year. 2021. If we certify at the beginning of the year, then I, then we would yes, okay and then there's a Mr Lee. Is he with us on? The call? Can he introduce himself probably is part of the ownership? That's right he's our owner. I'm sorry he's who what's his name. Sorry he's with the development team, Tom, Lee and he's in the chat answering questions hi everybody. This is Tom Lee, a member of the development team with the Vanderbilt Orlando accordance. You want to add anything to the discussion. I think we're here to listen. We really appreciate the community board for giving us opportunity to present and we see a lot of questions that are in the chat which we want to respond and certainly think about the feedback we're getting here. So, as I said stated in the chat, the AMI's they're not setting stone and we're open to discussion and in terms of commute the commercial portion we're not looking to bring any bitbox retail. So you know there's a lot of things. We're working on to address the total square fee is approximately three hundred forty thousand all right. Okay, give the coney. You have any other questions. No I'm, but I would encourage the applicants to make a much stronger presentation about what other types of whatever types of support their project represents to the M Crown vision and how this project fits in. We didn't hear it tonight, you'll be back later. I assume, but I I'd highlight that a lot more in your presentation. If you're looking for more density in the community and the elected officials have laid out Okay, Ms, Marazzi and Mr Stark, you mentioned a community facility. I didn't catch the number of square feet about 8,000. and your target used for that. The target type of tenant would be. What well I know that the opener has been in discussions with various community facility uses, we're still open and have an open mind and would welcome suggestions. It's frankly been hard to think about tenanting, given what's been going on the last six to eight months, but you know the ownership is moving forward on that and talking with potential tenants, any particular type of tenant well and for community facility uses will be limited to that which would be you know it within use group three or use group four that includes certain nonprofit institutions. Maybe certain types of arts, organizations or schools and healthcare uses I mean I know that many of the members of the landings committee are familiar with what's permitted in those districts, and so at least at this time the owner is exploring any of a number of them. That would be permitted in a community facility space. Well, I can suggest for you something related to health care, because we've lost hospitals in the surrounding area, north and south, so see what else do we need to try to shoehorn into this discussion? We've been at this for a little over three hours, almost three hours now, so thank you for your patience. Now there is a group in the area North Prospect, Heights Association and the Prospect Heights Neighborhood, Development Council would be I, think interested in having it up close and personal discussion, one on your proposal, especially the height and the density and the affordability. If it's going to be permanent and so on so I, don't know if you've reached out to those two groups, but I would strongly advise that and I want you to know that community board 8 is continuing to work with city planning is looking at this community board as a partner, and we've been very clear with them that we are standing Pat and what we feel we need for this community to be healthy and economically sound, so we're looking to use this area, it's been years that we've been working on this to do some serious economic development. So I don't see many more questions in the chat. Mr Puka is asking about the HPD lot on Dean Street. I'm not sure what that question is for CBA to have offices in your facility, sure that would be great so think about these things, but I do recommend you contact Prospect, Heights, Neighborhood, Development, Council or up close and personal, and maybe do a combined meeting with North Prospect Heights Association to get a closer feel for people who would be your immediate neighbors, so to speak great, we really appreciate it and we really appreciate whoever just jumped into the chat with contact information. Yeah, that's helpful. Thank you. Everyone here has been really nice and very direct. Well, we try to be fair and square and open-handed. Clean hands. Best thing keeps you from getting covered. We appear before a lot of community boards and it's just very obvious that this particular community board has been just very involved in on from like from a technical perspective and the just your familiarity with the city's own zoning and its processes is pretty impressive. So thank you, you're, very welcome and we'll look to hear from you again as you work towards your certification. We will be working with city planning to try to get pole position on moving M Crown neighborhood rezoning ahead, so it will be like two cars racing along I think we have a little bit more gas, but we shall see so anything else from the committee members here I see community facility suggestions in the chat. I'm sure you guys can see what's going into the chat, how that space could be used and I hope you'll take a closer look at that before we part I thought. Yes, we want to get to a place where we don't have homeless people anymore. Everybody should have a home. So what we have a question about what regional transit is the proponent looking for the residents to use? Sorry what I think when we mentioned regional transit? We were talking about the Lirr, yes, and we understand that it is not feasible for many people to walk sixteen hundred plus feet to or more to the liar, the closest Ir entrance. We know, though, that you know numerous bus lines run down. Atlantic Avenue, my reference to this site being within close, quite close proximity to regional transit, is in reference to the connectivity one could make by stepping out of their door hopping on a bus. Moving down the road getting off I mean we. These kind of public transit connections are unique in this immediate area. Exactly that's why everybody wants to build here and live here, we're being inundated it's very popular lately, so nobody wants to drive anymore. So this is what's happening. Well, unless there's something else any more questions. We want to ask directly I'm going to ask for a motion proposing reading. Thank you all for coming and Miss Marazzi and Mr Stark. Please keep us posted on what your plans are and don't take it personal if things don't go exactly as planned. No. Thank you so much. Thank you! Everyone! Thank you have a good night. Thank you! Everyone asking what we're sharing! Oh all right! Let me get them.",
            "summary": "We, may have a third item: 294 Albany Avenue, If you can all agree to allow the latecomer who has not submitted his materials for his presentation ahead of time for us to look at, but we can see whether or not that'll work for us, so I just want to see if we have a quorum.\nAnd I will be, depending on Julia Neil from the board office, to help us coordinate, things, Norah Daniel, the land Use Committee secretary and our vice chair.\nWho was that hello, okay, moving on with the rope who's speaking well, This is Mississippi Mrs Ida Ramos at 859 Pacific street, I'm, on the line for a building of 840 Atlantic Avenue.\nAll right, 14, All right, moving right along first item on the agenda is 875 San, Francisco, Avenue, Crown, Heights, North historic district, and this is a second presentation by the architect for the project which is to legalize the work referenced in the LPC landmarks.\nAs I was saying, You may remember: I presented this project at the last White News Committee Meeting right, here.\nI'm, hoping that everyone had a chance to see the documentation and some of the materials that we had sent to the community board in support of the situation with the developer of Boaz Gillard and how he left the building pretty much in the lurch and a little later on after my presentation, One of the owners of the building will also would also like to speak and discuss some of the information that they've researched regarding grants and tax credits that might be available for historic, properties.\nThe only remaining items left are the side bays on the building and the reason that those items have to go to public hearing is because the material that was removed during the first when the developer worked on the building was historic.\nLike prior to the renovation, but we're able to find these two pictures, If you look on that screen, one and two one is the building before is renovated and two is a detail of what we could see of the bays and.\nAt one point we really didn't know what was there, because we don't have any good photographs of what that actually looked like you can see if I go back to that.\nUp, Originally I was able to use my microscope and just determine that this is actually what was there, except now we're proposing and based on our presentation with you and landmarks.\nYou look over into this picture, so some of it's still a little bit undecided, So we're having these discussions with landmarks as to what the final color is going to be.\nThey don't seem to mind the color of the stucco because it blends in with the brick, but ultimately, when we present to landmarks and in our discussions with the deputy commissioner and the staff member we'll touch on that, I think it has to be clarified what they would actually like to see.\nI think it kind of blends in nicely with the building, although I think I might tint the roofs a lighter gray, to match the stone color of the front, and the other question had to do with what was the design elements.\nIt sounds like a lot of things have been resolved with landmarks, which is great, but since you're going to public hearing, I want to understand what specific things are.\nWhy we postponed it initially, because we weren't had things to work out still at staff level with LPC, so that the community board would have a say and also have some input into the process.\nThat's actually been realized that we can look at and see what it looks like I think I understand all of the other elements that you're proposing, but that one is throwing me a little bit.\nAnd, if we can move the mailbox away from the building, Landmarks is okay with us, putting it closer to the sidewalk at the front entrance, So it doesn't interfere with the look of the building and the light posts they're fine with that being where it is in the fence, The rear, yard, they're.\nI just wanted to share some of my past experience with similar issues from other projects that have come before the committee on the stucco.\nSo I implore you to look for the historic composite, stucco that'll last longer or use the wooden fish scale that could be available from a supplier like diced lumber here in Brooklyn.\nAll that said what we'd like to do is once we get a full approved scope of work from landmarks.\nWe would then like to go out to see what types of credits or federal grants that we might be afforded, but unfortunately we can't do that until we have the work ready to go and a budget approved.\nI just want to suggest to you that you not wait until you have a signed contract for every specialty that you're going to use to do the work that you're planning, estimates, Will, work.\nI just want to mention one thing: We've already started sending this out to various contractors to get pricing, but it probably will take a couple weeks before we get comprehensive pricing on this, but we hope to have something at least for the landmarks public hearing, which is on December 15th, okay.\nI'm, asking the committee members to come forward with the motion on what you've heard this evening on this project at 875, Saint Mark's avenue to legalize things that the fire owner did outside of Lpc's approvals committee, members.\nThis is James Ellis Committee member I would like to just add into some language about what the understanding that the other violations have been rectified at LPC, that the presentation at the base, be it just be more explicit saying that the other items we are not making the most.\nWe have a motion on the floor to support the legalization of the work on the bays at 875, Saint, Mark's avenue, using historic, composite stucco, and we recognize that LPC has removed violations numbered in the original presentation ending in 1025, 1027, 1032 and 1033.\nOkay, I just want to mention that there are a number of different composite stucco mixes out, there.\nIt's for everything proposed for the bays and there's an agreement there with Miss Iceland, there's wood framing for the Windows and Mr Ellis believes that we still need miss young to officially accept, which is true, the second, the friendly amendment.\nOkay, Can you please read the motion again in its entirety, we're supporting the recreation of the Bay Windows using drawings, lpc005 and 006 of December 1st 2020, okay, Miss Collins, but Mr Christie Ellis made an amendment to add.\nThis sounds like conjunct, yes, okay, I believe also princess.\nYou want to share your email, address, Mr, Ellis, sure I'll put it in the chat.\nThis is an application for a new stair bulkhead and Roof Terrace mechanical equipment to be located and roof adjacent to the new bulkhead, and this is in the prospect, historic, district, And I'm, not sure who's.\nOkay, so give moving to support with the second from this Weatherspoon all right, any other questions.\nYes, I, don't know if Mr Ripple has left, but is this going to be presented at the board.\nOkay, and you want to talk about the composition of the door or anything like that.\nOkay, and so this door opens out onto a rear deck, yes, rear deck, It looks like there's.\nOkay, I have a question a lot of the time in these presentations.\nOkay, This is an entree to ask you to return to the land use committee in January.\nWe need to ask you to come back in January and give us the details on what you're proposing, because right now we're not sure so we're looking at January 7th.\nI. Think she's, asking about be notifying the neighbors is that the process there will be an updated form with the land, use, Committee infant meeting information that will be sent out to Alexander and anyone else.\nOkay, so that we have a more comprehensive understanding of the proposal other than the pictures with a door.\nIt is that we're looking to review the applicant is proposing a rear, yard, a window, a change, That's already been installed for a sliding door.\nThat's, going to go over to a deck with a new railing, but comprehensive review of the plans being presented also shows the front door is being switched that there's a new painting, color scheme.\nSo, all the other elements of this presentation, the pdf version, the paint color the front door, the rear yard extension elements, That's already been approved at staff level, so is it am I to understand that you're only seeking approval from this community board for the rear yard new window edition in the railing.\nThat was the only issue with landmark she wanted to present.\nOkay, so I think that's where we're asking for you to articulate what it is that we're looking to approve on in this application.\nMy recommendation is to ask for a fulsome presentation at our next land use committee meeting and I'd like to know if anyone else on the how many of you on the committee agree with me.\nNo, just I, think I don't have enough information on the table that okay Committee here Mr Satan, yes, I, did hear him.\nThat's, not clear to me right now, because in looking at the designs, I thought there was also a part where they wanted to build another level.\nThis is from second floor, and this is only extension, and all of this is metal deck at the top of extension and more this space, and this sliding door goes on this metal deck, but we want to get a pro from here, and this is how it looks like on elevation, and this is side elevation.\nSo again, I would like a motion from the committee on this item before I asked the mo yes for the motion.\nIt looks to me like we're being asked to legalize work.\nTyus, hello, Ms, Tyus, I'm, here, yes, I just want to bring to your attention that we have a chat box full of our members who are asking for this application to be tabled.\nMy motion is to my motion is with the thing that no violations that we would like to table this until our next committee meeting more developed presentation of application.\nI think it's about a more comprehensive presentation on item proposed.\nLpc will get a letter explaining that we've asked them to come back to the land use committee meeting and then to the full board meeting for January.\nOkay, so we have a presentation, but first I want to thank the land, Use Committee and the community board for hosting us.\nThis is an application to rezone the aforementioned property, from m11 to c63x and with that establish an MIH area and also amend the zoning resolution to allow wider more pedestrian friendly sidewalks when the new building is constructed, which you'll see later in the presentation, As some members of the community board I mentioned, earlier.\nSo we're excited to be here tonight and to show you what we've been working on as a lot of people know this site in that it's adjacent to the Pacific park.\nJust so, You can see what the current lot configuration is in kind of in a an actual, understandable context of what the project site is bring us down to down street level.\nNow on the hundred foot wide Vanderbilt, with the 20 foot wide sidewalk, the Mcdonald's immediately to our right in the open rail yards to the left to the west, bringing in a little closer for everyone to see the project site has a handful of residential buildings in the middle of the Mcdonald's.\nThe rezoning, If approved, would facilitate development of a new 18-story building with approximately 316 units, of which 30 would be earmarked for affordable, housing, The building would also include a non-residential uses on the ground and on the second story, back to up above.\nBut, then the most recent development of node in the area is what's being developed at 809 Atlantic across the street, a roof height identical to that which will come with Pacific park's, partial 10, a 312 foot, roof height, and this development will include 206, total residential units with 86 units of affordable housing, and this the city planning and the city council and others have deemed it appropriate, given the very wide nature of Atlantic Avenue and the exceptional access to not just local public transportation, but regional public transportation.\nAnd this is the stack of what this mass looks like in its effort to try to work with the surroundings around it and provide that transition that we discussed to the lower densities to the east.\nIt matches the l-shape of the development site itself and the building, like we had said, includes over 300 units of housing, of which 30 would be earmarked as affordable housing units, and at this time the development team has proposed to use option two for its MIH compliance, where the weighted average of the income bands will not exceed eighty percent of AMI a way to kind of think about.\nA number of discussions with city planning, we've proposed an amendment to the zoning test to facilitate much wider sidewalks, which we think is appropriate for such a wide street, where pedestrians are often quite close to traffic.\nHow many lots are like that on occupy presidential, we'll provide the community board with a better synopsis of the you know, the number of residential units that are within the development site and what their status are.\nThis building is asking for two to three far more than what we have proposed along Atlantic, Avenue I haven't heard any talk about what would justify that other than zoning context, and I'm.\nIf we were to go along with something like that, it would absolutely have the effect of creating tremendous development pressure on the lots to the east and would be very difficult in my view, for the community board to ever get back to the six to seven far that has been outlined for Atlantic Avenue in the imprompt zone.\nThat has come to us with a proposal for development, and if we start this way, it's going to be very difficult to keep the density on Atlantic Avenue, to where the community board and the elected officials that have partnered with us on the crown vision, have pegged it.\nAnd yes, that is beyond this, the six to seven, that it sounds like your that the community has identified for Atlantic Avenue.\nDon't think that the community is going to lose its opportunity to maintain that six to seven far grasp on Atlantic Avenue.\nIn fact, we think, like we had shown some of the prior images that stepping down to an 8.8 here from the more dense developments to the west is going to set up future land use actions moving east on it on Atlantic, Avenue.\nWe, think you know we're land use attorneys, we represent property, and this property is, in our view, uniquely positioned to be part.\nYou know the city's effort to develop housing, including a very notable chunk of affordable housing within proximity of public transit, on concrete on streets that maybe aren't at least at this time, particularly pedestrian friendly, and that these improvements will better the quality of life and will not put the community in a position to you're not going to be in a position to have R9X flying on inhibited east.\nI'm, also a member of the Kronaites Tenant Union, and you can be sure that affordability is a serious concern in this neighborhood and all around it, and you know proposing something like 80.\nI mean I know that many of the members of the landings committee are familiar with what's permitted in those districts, and so at least at this time the owner is exploring any of a number of them.\nAnd I want you to know that community board 8 is continuing to work with city planning is looking at this community board as a partner, and we've been very clear with them that we are standing Pat and what we feel we need for this community to be healthy and economically sound.\nWe will be working with city planning to try to get pole position on moving M Crown neighborhood rezoning ahead, so it will be like two cars racing."
        }
    }
}