{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "title": "2020.10.26 - CB2 Executive Committee Meeting",
            "publishDate": "2020-10-30",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nExecutive Committee\\nMonday, October 26, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Welcome \\u0026 Roll Call\\n00:03:55 - Approval: Agenda\\n00:04:45 - Approval: September 2020 Committee Minutes\\n\\n00:06:18 - Committee Action / Health, Environment and Social Services\\n00:23:05 - Committee Action / Land Use\\n00:26:55 - Committee Action / Transportation \\u0026 Public Safety\\n\\n00:37:52 - Committee Report / Economic Development \\u0026 Employment\\n00:42:14 - Committee Report / Parks \\u0026 Recreation\\n00:44:34 - Committee Report / Youth, Education \\u0026 Cultural Affairs\\n\\n00:46:37 - Discussion / Statement of District Needs \\u0026 Budget Priorities\\n\\n01:08:20 - Chair's Report\\n01:10:05 - District Manager's Report\\n01:16:43 - Other Business\\n01:20:19 - Community Forum\\n01:44:25 - Motion to Adjourn",
            "lengthSeconds": "1:44:40"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "PgQE3lVa68Y",
            "fillerWordCount": {
                "uh": 226,
                "um": 228
            },
            "readTimeFullTranscript": "54 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "hotel": 25,
                "bridge": 21,
                "budget": 21,
                "motion": 17,
                "music": 17,
                "chair": 15,
                "proposal": 14,
                "concerns": 13,
                "location": 13,
                "lane": 13
            },
            "wordCountSummary": {
                "hotel": 11,
                "neighbors": 6,
                "beer": 5,
                "garden": 5,
                "agenda": 4,
                "company": 4,
                "complaints": 4,
                "concerns": 4,
                "music": 4,
                "budget": 4
            },
            "fullTranscript": "Welcome to the executive committee meeting for Community Board two, I am Lenny Singletary. I have been elected by the wonderful people to serve as chair for Community Ward 2., and with that you know, I recognize that there could be some new members or members from the community who may be new and maybe not be familiar with all of the members of Community board too. So I'm going to take the liberty to ask for members who are present to introduce themselves, and so I do not see the first vice chair on, but for the sake of introduction, the first vice chair of Community Ward 2, is the gentleman by the name of Leonard Jordan. He also serves as the chair of the finance and personnel committee, and so with that I'll turn it over to the second vice chair to introduce herself and then the respective chairs and co- chairs of each committee going in alphabetical order of the committee. That's the chair and co- chair alphabetical order of the committee would introduce themselves that would be an occurrence with our agenda so far, texted a message that she's having technical difficulties with her microphone. But she is present: okay, so Mr Jordan just joined, and so let me let me introduce you already, so you do not have to worry about introducing yourself I'll, take the opportunity to introduce Barbara, Zalla Gringer who's. Also, the second vice chair of Community Board 2.. She is the lovely young lady you see on the screen who just looked up and her name says Martin, but trust me she is Barbara's. Alligator serves as also the chair of the Parks Committee, and so with that I'll turn it over to the respective chairs of the chairs and co- chairs of the respective committees that make up CB2, okay I'll start in Carlton Gordon, the chair of landmarks and land use, I'm Brandon Smith, I'm the chair of Health Environment, Social, Services, Hi, Juliette, Colin, Chung, Chair of transportation and public Safety, Gerald, Galvez, Co-, chair of transportation and public safety, betty Fibrous, Chair, Youth, Education, cultural affairs, hi, just signing on Denise, Peterson, Economic, Development and Employment committee coach. Here- okay, great, thank you and last but not least, none of this could really be possible without the Secretary of Community Board too, and she is Hi Jessica Thurston Secretary. Thank you Jessica. So thank you for each of you introducing yourself and that work provide everyone within introduction to the members that make up the committee for Executive Mr District manager. Are there any edits that I'm omitting from the agenda? We have everything. As is right, the agenda is is as sent to the executive committee. I do note that the notice that was sent out to the public omitted mention of the statement of district needs that will come at the end of the meeting, but that will be probably a somewhat long- winded discussion for serious wonks only so stay tuned, okay, great. So with that, can I have an approval for the agenda and bill. Thank you. Thank you. Mr Jordan seconded by Oscar approval. Has everyone had a chance to read the minutes from September 29th? Are there any edits or corrections Julia? I think it me. It may be my pdf, but maybe not it says, Juliet Thompson manning clearly we're missing a comma there, so yeah, but I think that's a noted correction. Okay. Are there any other corrections that we have okay submitted some copy edits that we have not I'm good, I'm sorry! Perhaps it's just me. I can't make out who's speaking miss fiba you're, having extreme difficulties with your Mic connection, where you're breaking up and we're unable to hear you. I think we might have specifically any additional corrections. Please email them to the board office and we'll make those corrections in that manner, and so, with that hearing, no additional corrections will move forward with agenda item number four committees for action. Our first committee this evening is the health environment and Social Services committee, led by Mr Brandon Smith good evening. Everybody thanks for joining us. I I'm going to go through our applications. From the October meeting. We had five new applications that were approved and then separately. There was a letter that we approved regarding an existing application where there were community concerns expressed so for the five new applications. I just want to say conclusively that there were no community concerns or objections expressed about them, but I'll go through each of them, one by one, so that you can understand I'll, be happy to take any questions that you have about that. First up we have 306 gold street known as Puyo d'oro. This is located around gold and Flatbush in the oro building. This is a location where they're doing a switch of ownership, but they're going to keep the same company and menu just a new owner, a peruvian restaurant they're, open Sunday to Thursday 11 to 10, P.M, Friday and Saturday 11 to 12 A.M and upon discussing it that there had not been any complaints or concerns about the existing operation raised by neighbors. They mentioned that they were going to hire about 10 to 15 new people, and we spoke to them about community engagement and, ultimately, the motion was approved for this, for this license 600 the next application located at 45 main street. It's called evil twin brewing company located down in Dumbo between, I want to say, front and water. So, as you might expect, there's a brewing company. The brewery started in 2009: they have about five locations. There's outdoor seating, music's going to be all background, they're going to be open, Monday to Thursday 12 P.M, to 12 A.M, 12, P.M, to 2 A.M on Friday and Saturday and 10 A.M to 12 A.M on Sunday. They had. We asked about nearby residences. They they indicated they had some nearby residences. They provided a letter of support they planned to hire and employ 10 to 15 new people. We approved this by a margin of 6 0. Next we had 87 lafayette Avenue a place known as the quarter. This is located on the corner of, I want to say, South Elliott between South Elliott and South Portland. We have two locations that are located right around the same area, but that's where this one is. This is going to be mediterranean- american food they're, going to be open, 11 A.M to 11 P.M Saturday and Sunday closed Monday and Tuesday 4:00 P.M to 11 P.M Wednesday through Friday. There's a backyard area with seating. It's going to have the same hours as the indoor they had spoken to the neighbors that are out that are facing this backyard location. There were no concerns that were raised. This was approved again six zero. Next, we had 71 lafayette, Avenue, Brooklyn hospitality partners, but it's going to be known, as I want to say, francie free sports pub. Some of you might know of a location in this area, Lafayette Avenue known as Mullaine's. This is going to replace that location. It's going to be open, 11, A.M to 4 A.M. Every day we asked him a lot about the 4 A.M hours. There's also going to be an outdoor space in the in the front of the location where which is going to be open until midnight every day they indicated. These are the same hours that Melane had we asked had there been any prior concerns or reports of concerns about this location to the board office. This church had confirmed that there were not going to be any con. There had not been any prior concerns. The out the community was said to be excited about this, according the applicants, and they were going to have events like a jazz band or an irish trio as part of their live music that they would have at this location is in sort of a brunch setting. We approved this application by margin of six zero. Finally, we had a application for 445 gold street ms known dekalb. There. This location is going to be in the basement area of the city, point decal food market area, and I think we had a follow- up email, which confirmed that the hours are going to be 12 P.M to 8 P.M seven days a week. Wait a minute. Sorry, I want to confirm 8 A.M to 12 A.M, but regardless this is this location is in the basement there at the city point, there's literally no surrounding residence. For this location, they may have an occasional dj. The location is currently known as Fortina. It's a full- service restaurant. This is going to be a full- service, Mediterranean Middle, Eastern Restaurant. We also addressed local hiring with them and we moved to approve them by a margin of six zero. So those were all the new applications that we raised. We did have another issue that came up at the meeting and we made a recommendation about this as well too, which is a letter that will ask for your support on as well too. We've had a existing hotel liquor license at the Tillery hotel since 2015, and over that time period there have been 2015 to present. There's been a number of community concerns expressed about noise, particularly related to one of their licenses, which is a second floor, beer garden that goes out under the outdoor area of and, if you think, of how the tillery hotel faces, Flatbush, the beer garden actually faces away from Flatbush down towards the bridge Plaza neighborhood, where a lot of the residents live and to summarize it, we've had five years of different people coming to represent the tillery hotel. On behalf of the of the the management of the location and the it when they first came in 2015, the two individuals represented the hotel indicated that there were that the beer garden did not face any neighbors and there was not going to be any community impact and there were no community members at the at the meeting. So we had approved the license 900 and the in 2017. There were a number of complaints filed with 3- 1- 1 and City councilman Levin got involved, and there was a meeting we held in November 2017, with a completely different group of people representing the Tillery hotel, who indicated that they were new, that they were quite overwhelmed by their work and the the neighbors expressed concerns about noise from the beer garden and the hotel and us and the neighbors. We agreed that they would that the hotel would no longer play amplified music out from their their beer garden, because there was a concern about these sort of special events that they were holding where this amplified music would be very loud, go on late at night, and the neighbors would go to the hotel and attempt to complain about it and there would not be a manager around or they would not have anybody to work with, and the person who came to that 2017 meeting was very apologetic, who really wanted to work with. The neighbors indicated that they would that they would work on this, and we came to this agreement that they were not going to have any more amplified sound the from there. They it. We had a follow- up in June 2018, where we were expecting to see both the neighbors and the tillery hotel come back to give us an update as to how things are going. The neighbors showed up the tillery hotel did not show up, and the neighbors told us that they had a couple of incidents there with loud music but for the most part that they were adhering to their their agreement. With the no amplified sound fast forward to 2019 fall of 2019. The hotel got sold to a different party, who, I believe currently owns a hotel and they had to come in for a transfer of the existing liquor license. Neighbors came back and expressed that there was that there was still concern about noise coming from this balcony. At this time or from the from the beer garden and in October 2019. The committee voted to approve the transfer, but there was a condition which was that there would be no music, no music whatsoever indoors. Outdoors acoustic amplified whatsoever coming from the hotel and the hotel was agreeable to that and it got put on their license, and that was our understanding as to what the the status of this of this arrangement would be going forward until we've had now, obviously a year where we've had Covid-19 and the hotel was shut down for a period of time and in September, it seems like their operations have been started up again and there have been fresh new complaints and it seems it seemed the complaints were that the hotel effectively abandoned their agreement from October 2019 and has just started playing music, creating lots of noise for the for the surrounding residences, and we invited them to come to our last community meeting our last committee meeting, just in order to get sort of a better understanding of what was going on, but hopefully to reach a resolution between the community members and the hotel, and we had a representative from the hotel attend. It was a different representative once again than the other representatives. Who'd attended all of the prior meetings. So it's about the fourth different person who's. The fourth different group has come to represent the hotel and they, the sort of throughout the course of about an hour of discussing this issue between the community members. Many of whom I can see here attending this meeting have come to with great interest in this matter. Have what the hotel really did not seem willing to even comply with what they had agreed to back in October 2019? They stated that they had contractual arrangements that they had freshly agreed to continue. Events in October with third parties coming in to do bar mitzvahs and weddings, and that they'd expressed a lot of difficulties with Covid-19 and with the challenges that had existed associated with that and at the end of it you know, despite really trying to reach a consensus with them, which I think is probably the main goal. We ended up with a point where the hotel was just not willing. They said they would not do any more events and they would not have any more sound or noise ever again after October 25th, but they wanted to go through and do all of these events up until October. The 25th, which was just not in compliance with what they had said they would do previously. So at the conclusion of this discussion, I really feel like we were left with no choice but to agree that we would write a letter to the state Liquor authority, informing them that the hotel was not in compliance with the agreement that it was previously reached from our last meeting in communication with them. So I think that pretty much summarizes it, but again I'm happy to take any questions on that or on any of the other applications. Any questions for Brandon from executive committee members all right so brandon to reiterate a bit. So I can understand clearly, there's no objections to the on- premises licenses and how did the committee vote with regard to the letter to the state Liquor authority regarding 85 Flatbush? Sorry, I omitted that the committee voted unanimously 6- 0- 0 in favor of sending that letter. Okay, so I'll entertain a motion to accept the committee's recommendation. That includes approval of the one two three four five license: requests for on- premise: applications, but also to write a strongly worded letter to the state liquor authority about the Tillery Hotel Bill Floyd motion to approve a second irene. Second, all right. Thank you Irene. I appreciate that. Is there any discussion on the motion hearing none all in favor aye. Is it anybody opposed? Are there any abstentions? Hearing none! Thank you. Brendan appreciate the report. Thank you all. Okay, let me just make a two statements. One at the beginning of the meeting. When I asked for an approval of the agenda, I took a second from Oscar and why Oscar? I appreciate you participating at the present time you're only a member of the youth education and Culture Affairs Committee. So technically you do not exist in this committee as a voting member but stay on the phone do not hang out. We want you to keep participating. So let me take a second from. I think it was bill Clinton who shouted his name so Jessica. Let the minute reflect the minutes, reflect that we're taking bill's second, as opposed to Oscar's. Second, and this I had already given it to Bill but hi Oscar, and thank you okay great week, so we so oscar. We appreciate your participation. I love the youth and enthusiasm you bring to the to the meeting. Additionally, let me just remind everyone that this meeting is being recorded, since I wanted to make that public announcement so that everyone was aware that we're being recorded not that you need to change your behavior because you're always on your best behavior. Nobody laugh please. The next item on the agenda is land use, I'll turn it over to Mr Carlton Gordon. All right. Thank you, lenny all right. We have one 81, Pierpont street and 35 love lane two buildings, but it's being considered as one application. It's in the Brooklyn heights, historic district. The application is to excavate the rear yard of 81 pierpont and rear yard cellar at 35 love lane to create a new subgrade into interior space, including a new lot line window and a new opening at the east or secondary facade facing passageway and make and modify windows and doors in the front and rear facades at 35 love lane. In some cases you know new openings, basically, what the owners are trying to do on this one is to combine the two properties and the excavation is really for a swimming pool, so they'll have a nice pool. Unfortunately, the it'll just be them, and we will not board members will not be granted access to the swimming pool other than that their work will be done on some of the windows. As I said in the back and there'll, be some additional work in the rear for putting in more you know, fixing up the rear we Brooklyn heights looked at it association, looked at it and felt that you know it's a lot of work, but it's a it's one that can that the community could live with there'll, be some work on there'll, be additional some bluestone, which we like we always like bluestone at the to be added as part of the of some of the older buildings that we have in the community. It's an old both are older structures and we approved it seven. Yes, no opposition and three abstentions, and we would like your approval. Thank you. Carlton I'll entertain a motion to accept the committee's recommendation motion to accept committees, Colin Chung, a second from Debbie, fine Bush. Is there any discussion on the motion? Just a quick question: Mr Chair is there? Was there any reason for the three abstentions, any particular reason, or were those mainly this problem? They, the three members, had problems with the technology. They could not hear all the work that was being described. It was not okay reflect on the application. It was just that they could not. They could not pick up on it or they could not log in got it. Okay. Thank you, yeah. Any other discussion from board members hearing, none all in favor aye. Anyone opposed any abstentions. Thank you. Thank you. Very much. Next item is a transportation and public safety I'll turn it over to Juliet Colin Chum hi everybody. At our meeting we heard a presentation from Brooklyn bridge forest, and after I talk about that, I would like to also talk about other aspects of our meeting, including a visit by the 84th precinct. Captain captain rana so Brooklyn bridge forest was the winner of New York, City, Council's competition for new designs for the Brooklyn bridge. They came to us with their proposal that incorporated that really was a multi- phase proposal, but they focused mostly on phase what they called phase zero. The first phase of their proposal and what it would entail is phase zero would entail taking the bicycles and two wheeled vehicles off of the current walkway, the promenade of the Brooklyn bridge and putting them onto a the manhattan- bound out outboard roadway of the Brooklyn bridge. So they would reduce that conflict that exists currently between the pedestrians and the bicyclists and the e- bikes, and they would bring them down to the roadway and they had a good plan that could be implemented within a year at minimal cost. They estimated their cost would be to 2.5 million dollars. For this preliminary phase, they identified both the entrances and the exit from this ramp over the the Brooklyn bridge. They would use an exist, the existing lane that I think goes to park row off the Brooklyn bridge, which has been closed since September 11th and is only used for parking of government vehicles right now. The proposal incorporates sustainability. It incorporates greenery and green space and as a sort of 0.5 component of their proposal, they would like to separate e- vehicles from the bicycles in another lane on the Brooklyn brown side, the inboard lane of the Brooklyn brown side of the Brooklyn bridge at some future date. So our motion supported phase zero and that second phase of of their proposal. What they envisioned in the long term is that there would be a platform decking over the over-, the- top part of the Brooklyn bridge. So the vehicles would be covered with wooden decking that could Susp support investment in the rain forests from which the wooden decking came from. But a big component of their proposal was corporate sponsorship, for that and our committee thought that it would be better to use city funding, at least for that first part of the proposal, so that it would not be a corporate proposal. So I will read you the actual Motrin, which was approved unanimously by the committee. We support phase 0 of the Brooklyn bridge forest proposal, which involves the creation of an exclusive two- way bike lane on the outside lane of the Manhattan- bound vehicle, roadway of the Brooklyn bridge, incorporating green space and creating a pedestrian only space on the upper walkway, two, the creation of an exclusive two- way bike or motorized two- way: two- wheel, vehicle lane on the inside lane of the Brooklyn- bound vehicle, roadway, three further study and consideration of subsequent phase improvements and for the use of city funding, as opposed to non- government funding. That's Brooklyn bridge forest. Would you like me to talk about the other stuff or would take a pause on that yeah? Let's let me let me get the motion. I mean the recommendation approved and then we'll come back and let you finish part two of your report. Okay, I entertain a motion to accept the committee's recommendation for Brooklyn bridge forks five. Can I get a second by Mr Gordon yeah any discussion on the motion? Yes, I have a question the out the outs, the there's wait, the the one they're doing first is on the Manhattan bound side. Correct now. Does your motion include all of the phases or just this? First one? It is phase 0 and then phase 0.5. That has the also the bike lane for the E vehicles, as a second phase would now that would be on the Brooklyn bound. Yes, the inside lane of the Brooklyn brown side, the inside letter. So that's the one that goes off to tillery. Yes, oh the first one would not go to tillery. Okay, thank you! Barbie! You appear on the screen as being on mute. Unfortunately, I can't hear you yeah barbara. Unfortunately, we can't hear you. I can see your lips moving. You appear to be somewhat convicted in your statements, but I can't make out what you're saying all right, so Bob has experienced some technical difficulties on any other discussion on the motion from board members. It's a quick question julia. What was the committee's vote on that motion? It was unanimous. Thank you. Mr Singletary Barbara posted her question to the chat panel and she asks why was the committee against corporate spending? I think for all the reasons you could imagine they. The committee generally wanted this to be a very public space and did not necessarily want logos all over the Brooklyn bridge, which I think is the method that the corporate sponsors would get to highlight their involvement in the Brooklyn bridge. Another question actual planks of wood is where the logos would go. I have another questions. Irene hello, the Brooklyn bridge is an historic monument. Was this presented to the LPC, so we did post that question and they noted that one of the jurists was a member of the LPC and while that does not mean that the LPC itself would support their proposal, this jurist was very much in support of their proposal. I do not understand what you mean by jurist a jury member that voted to select this proposal. As the winning proposal do they still have to go to LPC. Yes, any further discussion on the motion. Just I'm sorry very quickly, assuming LPC is supportive. What happens after that? What will be the timeline for this starting they could they say that this could be done within a year? Oh even like, including the time now of approvals, or once the construction begins construction. I think that it would. It would be inclusive of that, because really construction only involves some roadway barriers right and scaffolding. They would use scaffolding to create the entry ramp. Got it great thanks any additional discussion. Anyone opposed any abstention. Jessica. Could you note the extension a barbara it raised? The other one. Okay motion carries okay. Thank you. Everyone, julian. Your second part of your meeting discussion. Thank you. We were very honored to have captain rana the new precinct captain from the 84th precinct in attendance. He even had to deal with a 911 call and then joined us afterwards, so it was. It was really nice that he was able to make the time and do that community outreach with us. He talked to us about what the precinct is doing to address, gun violence and gang violence in the neighborhood, and he was very receptive to us as we shared our list of concerns going over. Frankly, a lot of the priorities on the budget that we recently went through and the whole community board has voted upon since and he did share some personal experiences and overall seemed receptive to our conversation. That's good to hear I mean especially given how duty called, and then he made the time commitment to come back. That's impressive! I'm glad to hear that, hopefully, we'll have a stronger relationship and that to imply that we did not with the previous commanding officer, but we hope that we can continue the relationships that we have with the 84th president in a good way he's still very positive yeah. Thank you. That's good to hear I'm glad you shared that next on the agenda item number five committees to report: let's start with economic development and employment bill, Fletanoy hello: this is Bill Fluroy, Charity, Economic, Development, Employment Committee, I'm having some difficulties with my internet, it's kind of spotty, so I'm calling in on my cell phone okay. At our meeting, we had a presentation by cinch market they're, a company local company that actually has taken taking the initiative because of Covid-19 to actually organize an Amazon type of platform with local businesses throughout the area where you can actually order products from various small businesses throughout the area, whether they are brick and mortar or online, and actually order goods to be delivered to your house. If you do it by 10 o'clock could be delivered that same day, otherwise, it'll be delivered to you, but the next day the person who gave the presentation was in Maya. Last name is Kimora. That's k-, O- M-, E-, r-, o- v. They have a website where people can join and that's www.cinchmarket.nyc. What I liked about this was the fact that, currently, right now, they have literally 30,000 products that people can actually purchase online at their site from local businesses throughout our area, all in Brooklyn, okay. They currently have 40 businesses who are trying to get on their platform, so this is actually taking initiative where they are looking to somehow manage to still thrive in this environment where people are not going to stores throughout the area. What I also like about them is they have a lot of media attention and support, which is very, very interesting. They have a marketing kit that they give to all the individuals, companies or stores that actually join with them and also they're offering gift cards okay to be distributed for the holidays, and the other thing I like about this company is their pay scale, they're, hiring individuals throughout Brooklyn and their rate that they're currently offering is 20 to 25 an hour plus tips. Okay, so I immediately joined myself, okay, because I've been ordering my groceries in, and I had to go manually to actually walk to other stores to get things from for the drugstore from the hardware store. I could do everything from this website, so I think this is a great model and you're looking to expand this model throughout the other boroughs and actually they're getting attention on other locations and other cities throughout the I know I sit throughout the country, but other cities lost their interest in this platform. Okay, that's my presentation! Oh that's, my yeah! Let's take my presentation right now any questions or Mr chair any questions for Mr North. What's the name of the site again, okay, thank you. The site again is www.cinch market, that's c, I n c h market M, a r k, E T, DOT N, Y C. I was, I feel, very comfortable in recommending this company to anyone to check out the website and see what they're all about the the link is also in the chat room, along with a link to Dumbo stores that are using the platform and Tia Mueller, and I are working with other bids, other community boards and the borough president's office to make connections between and other parts of Brooklyn. Thank you thank you Robin. Thank you tell you for including me in the chat really appreciate it next committee parks and recreation. Can you hear me now? Yes, we can hear you now. Oh gosh, okay, great, okay, sorry about that continues to be a challenge. We had a very interesting meeting. The focus of it was a presentation from Playground New York City. They are, they operate. Child directed adventure play yards, their major. Their major work is at the yard at governor's island. If anyone has been there and experienced it and they bring together all sorts of items to reuse them, a lot of cardboard, a lot of metal works and they believe that children should have as much ability to play as possible without having restrictions, and they did a pop- up right before Covid-19 at city point and they they're very much interested. Excuse me in doing some other program in our district and our committee was very receptive to them. They should be able to find some funding to do an initial one- off type situation and then sometimes they work with other entities to find additional funding. So we're going, we've started a conversation now and we're going to move forward with them, hopefully to talk about just what sort of project they have in mind and probably for the spring. It's a little too late now to do something outdoors for, for the last part of the fall, so we're looking forward to hearing from them again and to see what they could bring to our district and they're, particularly interested in setting up a program that would be very much accessible to children who live in NYCHA projects, so we're interested in what they have to say. Any questions. Thank you. Thank you, Barbara Next committee to report on youth, education and cultural affairs. Hello. We did not meet since the last time that the executive committee met, but I did want to share that. I had trouble with the technology when we were talking about the minutes. I did not hear that part and I will suggest a change to the report on last week when the minutes indicated that seven schools in district 15 was segregated. It was district 15, subsection c, which, as I've reported before the cec and the DOE and the superintendent's office, are working on developing a new plan. It's my understanding. The plan to decrease segregation, increase diversity, not just racial diversity, but english language, learners, low- income, children and so on, as well as reducing overcrowding in some schools. So it's my understanding that there's a meeting tomorrow and that there's going to be an announcement about a grant, a large grant coming into district 15 and, as I've said before, the two schools are Ps 261 and Ps38 on Pacific street. That would stand to benefit from the grant and there'll be some discussion about the rezoning which some parents might or might not agree with, or you know be happy with so more on that later, I plan to attend the Tuesday meeting report to my committee Wednesday and then report to the group in the future. Thank you, Buddy. I I'll take the liberty to ask if there any questions, given the corrections that well not on the corrections, but any updates that he gave hearing none. Thank you up to item number six new business. We're going to discuss the fiscal year, 2022 statement of Community district needs and register of budget priorities at this time. I want to turn it over to our district manager, Mr Paris and Taya Muller, who has put together, I think a fine job of engaging feedback from the board, and so with that Mr Paris I'll turn it over to you. Thank you, Mr Singletary and Taya's going to share her screen so that you can see the spreadsheet, but I want to start first by thanking taya for two things. One is all the effort that went into pulling all of the information from the different committees together into one place, but also for creating the Google form that allowed the board members to rank or establish some sort of a different sense of priority for each of the priorities that came out of the committees. You know those of you who have been on the board for a long time and many of the executive committee members fall into that category. You know that we have tried a wide variety of methods to get feedback from board members and, generally speaking, that usually comes in at about a 50 percent participation rate, which is not bad. You know, people that do surveys and other kinds of marketing will tell you they'll be happy with a much smaller response, but the Google form that Taya developed allowed us to have about a 75 percent. As you can see in the green row, 75 participation rate, which is about a 50 increase. So this is probably the most democratic ranking of budget priorities that community board 2 has ever had, or certainly in a in a digital era. So we took the input from all of the people that responded to the Google form. We have the the budget priorities that came out of committee in two tabs capital budget and expense budget. The Office of Management and Budget has expressed a preference that we limit our capital budget priorities to no more than 40 and although the list has grown slightly since last year, we have 30 of them and then the expense budget has a great deal of new new priorities that were added this year. And you know, in addition to thanking taya. I really need to also thank all of the committee chairpersons and the committees themselves because, for whatever reason, perhaps the stressful times that we are living in, but the committee members really took this process much more seriously this year than a than they often do, and I think there was a lot of a lot of discussion, a lot of input and that's reflected in the large number of priorities among other ways. But the Office of Management and budget would like community boards to limit their expense budget priorities to 25 and with the new additions this year, we're somewheres up around 60., so the executive, among other things, that the executive committee will need to decide is what to do with the excess of suggestions. So listen. We the participation from everyone, as Rob, said I want to emphasize what Lincoln flies. Point has been great. I appreciate that, given that the expense budget has a far greater amount of priorities than I believe is requested from OMB, I believe that's what we probably would need to focus on. How do we scale the list down? I mean if I'm looking at what Taylor has on the screen. Now it appears that we have 59 items and while I believe the recommendation and the ask is for 25, I guess I could live with us getting to relatively half of that lesson. So we if we could get to 30, I'm happy with us submitting 30.. This is going to be you know new and in uncharted territory to figure out how we do that, given that we are virtual, I'm hoping everyone can see say your screen share together, but you know how do we get? There is the question I have and I, and I will admit I do not have the answer. If I am just simply looking at this in a fairly logical perspective, by my count, we have six committees, and so you know I could make the argument. Each committee give you know top five recommendations, but that's not how the expense budget is created. It's not so much. That is the per committee type process and the items do not necessarily have a one- to-, one correlation. So you know I'm looking for any kind of ingenuity, any kind of kind of creativity to help us get there, but we need to scale down the list, so I'm open to what could be, I guess, a challenging discussion, but I'm open to initiating the discussion any suggestions or recommendations, how we get the expense budget reduced hello. This is Bill Floyd, chair of the economic Development and employment committee. May I speak Mr Chair Chairperson yeah bill. We know who you are guys: okay, yeah. My suggestion. Very simply is this. Even though my committee gave us a large number of suggestions, I'm going to go with the ranking. Okay, they've all been ranked okay, so I say we take the top 25 and top 40. and building on your both of your comments. Manteya has highlighted that section of the spreadsheet you know Lenny, you said you'd be willing to go a little bit deeper and it just so happens that right about the halfway point, there's a big jump in the rankings, as you can see, most of them are increments of one of one or two, but from row 31 to row. 32 is a jump of six, and so there is sort of a falling away of support about halfway through the list. Okay, that's good to hear any other board members with any counter suggestions or any support for what was already presented from a ranking perspective. This is Nick, Ferreira, sorry, hello, I'm sorry, executive, Committee members, I'm looking to hear from exec committee members hi. This is Betty. My screen kind of went dead, so I'm on the phone. So I'm not seeing everything or anything, but I just want to say that some of the items like that relate to the topics of my committee were not discussed in my committee, so I was having a little trouble with that when I reviewed it about reducing school safety offices and training them to be guidance, counselors and social workers, we did not discuss it. Maybe the public safety group discussed that, but I think we should think about which topics came from which committees and also maybe certain topics could be combined. If there is a similar recommendation, Betty I'm a little well so here's the funny thing. I do not know how to respond to that, because if I look at this on the screen now you know the top. Let's say the top six items are DOE recommendations. I'm not clear on what you suggesting that we take them off. Moving down, I'm not clear on the recommendation or what you're suggesting I'm sorry. I do not have. The whole screen went off and I have to I'm just on the phone now, so I apologize for technical technology. I guess the only thing that I would recommend. Let me let me do this. I did not mean to cut you off. Let me do this: let's take let's rob and tell you: can we work offline with Betty and your fear so that they can get a chance to review the items that are on the list, given that Betty some technical difficulties and then, let's see, look let's deal with that separately because it looks like they would still fit within the top ranking and then, if we, if I put that in a separate lane for a minute, is there anyone else that has any comments on the proposed suggestion to move forward with reducing the expense budget items based on the ranking up before you take Mr com, any additional comments: Mr Singletary, the link for board members to the statement of needs. Worksheet is in the chat panel, and if anybody needs that email to them, we can do that that will be accessible to anyone that has not been granted access to that drive, but all board members should be able to access that, and then, with that tangent and your interruption, you had solicited additional comments. Mr Singletary, I have a comment. It looks like I'm coming back. Okay. If the district office could email me the spreadsheet, that would be great. I have problems with Google Docs Excel works. Fine. I agree with what Rob and bill were noting with regards to the the 30 expense priorities and looking at how people have ranked them, and you know taking the top 30, but then a comment that Betty made. I think we could also look into potentially combining a couple of the proposals so that we might be able to get more into that theory. For example, we I think one number 120, which is at the bottom of the Rank Expand Police Athletic League programs beyond sport, to provide youth with more opportunities away from criminal activity. I we have a lot of that sort of agenda item budget item, so I think that could be combined with, for example, reallocating funds from the nybt NYPD, redirecting them to educational opportunities, internships, job, trainings, etc, and that could be a component of that very high priority without listing it as a separate priority. That's just an example, and with regard to Betty's comments about the school safety officers, yes, that did come from the transportation and public Safety committee. That was a recent part of the reallocation of the Nypd's budget, where the school safety officers went from NYPD to DOE, but it did not score high among the the votes, and so it's not in the top 30 anyway. Thank you, Julia, that's very helpful. Let me just remind everyone, or in some cases, inform others. This is a request that is due on Friday this Friday, and so we are now essentially into Tuesday. So you know we do not have a lot of time to do an extensive amount of editing, but I am okay with the general concept that we will work through this on the ranking. I, like the comments that I've heard this for far that would allow us to perhaps collectively review the request. Maybe combine some items so that you know we get as much into our recommendation as possible, which case if we combine a few items, maybe that takes some of the lower items that have them kind of move up on the agenda. I'm sorry on the budget priority, but that's one reminder everyone. This is due Friday and we will make a submission on Friday, so just put that out there, but I'm okay with you know having that work take place offline. If, for example, the two chairpersons that have spoken up are willing to work with their coaches or, however, they do it to get that information to the board office, I'm open to that and those of you who have access to email, taiya just sent the spreadsheet as an Excel spreadsheet to everyone on the board and, I believe all the public members of the committees as well. Thank you, Rob. Thank you, claire. Any additional comments: Mr Chairperson, just this is bill. Throwing me to ask a question: yeah Mr, Paris question: if we start combining items and requests it would that have any issue as far as having them actually enacted if we start combining them because they may be different departments or different areas of interest. This is survival. I'm sorry yeah, let's find you with a spot. Let me just let me just add this and bill. You said something that triggered the thoughts. I just want to give this point of clarity before I provide you with an answer combining within reason right. I do not. I do not want. I do not want people to be so innovative that we're now creating things that do not really fit. Let me just highlight and amplify combining within reason, where there's some logical path that one could deduce without an explanation how the combination or the act of combining the items makes sense. Rob you can respond now, I'm sorry for interrupting. Well, I think I think you answered Bill's question Mr Singletary, you know. Within that framework, we probably can combine recommendations, but if they get too diversion, often agencies will sort of cop out and say well. This is this is really three requests and we do not know how to respond so we're just moving on. So we need to be somewhat careful about what gets combined with what like and like hi. This is sean hi, Lenny hi. I can't agree with Mr Flonai. I think that Rob and chair did a fantastic job of putting this in order, and if we have to get this in by Friday, I know that there was much thought put into how everything was ranked and rated. Why do not we just take the top 30 or whatever it is because the minute we start linking things together, it's going to be, as Rob just said, they're going to look at it and say: oh this: is they want too many things in this one in this one ask: let's put that aside, so the what the top 30 seems to be very clear. What is it we want, then let those be the top 30., so Cheryl Listen. Thank you for those comments and I do not think anyone disagrees with that sentiment. I think we all agree with this sentiment. I do believe that the comments that have been made thus far help to support giving a chance for us to make sure that perhaps we get to, in fact the 25 that is being asked for, as opposed to settling for the 30, and if we can make an effort to get there. I think it's worth the time to do so. I'm confident and part of why I'm really receptive to entertaining the idea is that, because the office has managed this in such a way that we've been able to get this feedback so with the collective thought of the entire office, but clothing represents representation this evening in both the person of Rob and taya, they can get us to stay on this framework and stay intact. So I do not know that it's. These are my words, no one else's words, a few little futile or wasted effort to go through the combination. I'm, given that we have a clear framework for how we want this to work. There needs to be some logical reasoning for how we would combine any categories and once Rob and Taylor have looked at it in the office and collective and then I have a chance to review it that will determine our path forward. So, while I do not disagree with your comments, I do think we have a good foundation that we can. You know, spend a little more time to get this a little more to get it perfect, because right now, it's great any other comments. I think we have a good framework. The office did a fantastic job. Who has the last comment before we move on Lenny? It's Barbara. Okay, thank you, I'm just thinking. Perhaps there are some items here that you know if we really need to calm them down that there's some items here that would be handled in any event whether or not we supported them. So maybe we should, you know, focus on things that are really in our district and need attention. Well, I think that's just the suggestion, yeah! No, it's not a bad suggestion, but I think that's the overall strategy on how everybody voted and that's what led to some of the rankings. Obviously there are, there are specific points that may drill down and come closer to CB2, as opposed to you know a larger city- wide perspective, but you know without having to undo the work that the office has done. I'm going to lean on the side of let's take. What's come out of the collective participation of the entire board. Use that as this framework to get us closer to what would be the fair representation of Community board 2. your point about drilling down on things that are more specific to CB2. I think, can be considered in the days leading up to our submission in conjunction with the collaboration that we're discussing now. But ultimately, I think we're all saying the same thing. I do not think there's any objection to what you're suggesting there's a there's something listed here about the you know about the police records, but we have a new law on that. So maybe we do not need to put that in here. That actually is at the bottom of the spreadsheet and was not included, because it is not a budget request. It is a okay expression of sentiment all right thanks. So, given that you know we, it feels to me like we have consensus on how to move, and you know we've heard some great comments. Let me pause there before we remove that positive momentum and, let's move to the next item on the agenda, which is the chairperson's report and so Ted. Thank you for sharing your screen. You can have us share our faces again and I do not have a chairperson's report, but I do have an announcement I want to make, and it would it's. You know, at least for me in particular, it's somewhat of a heavy heart, it's hard to make this the communication, but I've had some time to get myself together, but some of the longer tenured board members and some may not be on the executive committee, but we had a board member who was very active and then due to an illness, he was no longer able to serve on the committee, and that is in the person of Tony Kennedy. Some of you remember Tony Kennedy, who was a member. Unfortunately, he had a nine year fight where he suffered from a pulmonary embolism and the last thursday he transitioned. So I just wanted to announce and let everyone know that Tony passed away. Many of you board members had constantly asked me about Tony and wanted you to know that he he put up a good fight. You know just briefly: Tony is someone that I've known since I was in the fifth grade, and so you know he's like someone he he's not like. He is a brother to me. Most of you know that I'm my only child so he's special to me in that regard. But that being said, I just wanted to communicate that to each of you. Thank you for those who've always asked how his progress progression was, and I'm sure his family appreciates some of the thoughts that you may have but wanted to be open and let you all know that he put up a good fight he's in a better place. So because I do not have a report. I wanted to just share that with everyone and then we'll move on to the district management item number eight on the agenda. I will send the board members a district office report as part of the package for the November general meeting, but I did want to share with the board members a couple of pieces of news. One is that 265 I spoke with the attorney for 265 front street, he's the same representative as 98 third avenue, which was presented to the land Use Committee last week. That was an application to rezone a site in Vinegar Hill from m12 to R6A, with a c24 overlay and the Community Board voted at our last in- person, general meeting to recommend disapproval of the application. The vote was 20 to 2- 3 and at the time that the attorney and his client presented to the land, Use Committee and also to the General Board, they said look if the community does not like of what we're proposing we'll call the application and we'll submit a new one. His report to me, however, was that the Department of City planning won't. Let him do that and so he's kind of betwixt in between trying to do the right thing by the by the community and be responsive to the Community board's recommendation, but seems to be stuck in some sort of a policy dispute with city planning officials. The other thing that I want to share with the board members and guests, and if tay, if you'll, give me the pineapple, I will bring up the Google map continent. There was a Con Edison had a walk through last week and they are getting ready to do something that they first talked about seven years ago, which is the demolition of two buildings at their Hudson avenue plant. The two buildings that they propose to tear down are on these blocks: east of Hudson, Avenue and North of John Street, and they have not been operating for a number of years. The cost of demolition of demolishing them is fairly extensive, and so, although they announced this about seven years ago, they never moved forward. There's now a new local law that incentivizes the demolition, and so they are moving forward and that will probably begin in the first quarter of 2021 and take about 30 months or two and a half years. The second piece of news that they had is that this site sort of right in the center, which used to have a fuel oil tank, a large fuel oil tank that has been removed, as you can see from this aerial photo. I do not know what the vintage is, but the fuel tank is gone and Con Edison proposes to construct a new substation on that location and then tie it into a couple of other substations that are nearby there's one on this block, as you can sort of see the infrastructure and then there's one in the block. It's a little bit further south from the outside. It looks like a building, but it's really just a series of walls around a transformer substation. So once they build this the substation here they will run lines underground to those two existing substations and and the whole thing will be interconnected and that work will begin fairly shortly. Con Edison has done what, in my opinion, was an excellent job of outreach to the local community. They were represented at the walk through last week and they seemed very pleased with the preparations that Con Edison has made, as well as the outreach that they've done. So, as I said at the outset, I will send a written report to to the board members when we do get ready for the November meeting, but I did want to bring them up to date. On those two issues you Mr Paris, we will receive the report as we get ready for the November meeting. Mr chairman, I ask a question bill: okay, Mr Paris on the demolition that they're looking to do. Did they mention anything about the remediation issues in regards to demolition and also the substation? Is that substation going to be servicing Brooklyn or it will be servicing the entire five boroughs they did discuss both of those points all of the environmental remediation will be within the structures and will be completed prior to the demolition of the buildings themselves and the new substation is in fact being built to increase capacity, not just in Brooklyn but specifically in community district 2. Where there's been so much growth resulting in increased demand. Any other questions hearing none, I will move to agenda item number nine. Is that any other business come before the committee this evening hi having none, no buddy? I just Wanna, I hear you Buddy go ahead, go ahead, okay! So, as most people know, the next community district 2s 6 will be experiencing the big rezoning of the Gowanus area and that will have, I think, a significant effect on our region, our district. So in terms of the utilities it was mentioned about the electric substation, all the different utilities, as well as sewage, water and so on. That might not be addressed thoroughly. So I'm wondering if, as to you, can think about or assign somebody to kind of keep an eye on that and to report back or, however, you see fit, but I think it's a big issue, since we are just a few blocks away. Mr Singletary may I comment absolutely Mr Paris, so actually Community board 2 has a small portion of the Gowanus rezoning in particular along fourth Avenue, so I've been keeping the land use committee up to date, but when that gets certified Community board two will have the opportunity to to formally comment. Mr Singletary and I have discussed how best to keep board members in involved with rezonings that are not in the district per se, but are close and potentially of interest. In addition to the Gowanus rezoning, the governor's island rezoning was certified as complete at the beginning of the month. Governor's island is in Manhattan community district 1, but the Department of City planning asked the trust for Governors island to present to community boards. 2 and 6.. Our plate is pretty full over the next several months, but what I intend to do, after consulting with Mr Singletary, is to make available recordings of meetings that have already occurred and the meetings that are scheduled. I think going back to the original Topic Community Board six plans three sessions in the next few weeks about the Gowanus rezoning in advance of a certification- that's not anticipated until January at the earliest, so board members will have the ability and others to stay on top of these topics, but we will probably not directly review them ourselves. I appreciate that and just think we should be as active as we can be, especially in the Gowanus, because it's going to affect our electricity, our gas, our sewage. I think it's very big any other business. Okay, great. Let's move on to item number 10 community forum. I remind everyone that community forum is where we hear from the community. We have always maintained and will continue to maintain, at least for this evening, a two- minute time limit. We hope that everyone, as you as you have in the past, will continue to successfully adhere to that request. I will ask that if you are representing a larger group- and someone from your group has said something that you've already said, or we've acted in the affirmative for something that has been said- please be respectful of everyone's time and, let's not repeat the comments, and with that I've asked that you please indicate your desire to speak by raising your hand or at least making a comment in the chat. Our district manager, Mr Paris, will call your name and upon calling your name, you will have a two- minute time limit to make your comments. So with that we open it up to our community forum. Mr. Do we're not able to hear you, but we see that you're trying to speak Jon you're on you, we can't hear you Mr. Do it appears that both of your devices are unmuted but we're not able to hear you? Oh let's try to unmute this one. Can you try now Mr Duke? Can you speak? Hmm John. We can see you let's move and we still can't hear you, though you are unmuted on both devices. Could you please speak? Could we ask him to put it in the chat yeah? So you know what how about this? Let's put John do on pause for a minute, we'll come back to him because I'm sure he's just trying to work through some technical difficulties and then is there anyone else who raise their hand or would like to indicate their desire to speak by listing their name in the chat, so they can be recognized by the board office. I had raised my hand Patty, you have something you want to yeah, I'm a part of the bridge, Plaza Group, and I just want to thank you guys for all of your help, the Hess committee and the executive committee for supporting us with our continued battles with the tillery, and I just how much I'm enjoying being able to attend these meetings. Since they're virtual, I can be home and grading and still listen in, and so I hope, even after Covid-19, you find a way to continue to do this because yeah, I I'm just enjoying being part of these meetings and hearing the conversations. Thank you so Teddy Patty. Thank you for those kind words. You know it's while it's nice to hear it's the right thing for us to do. You know if we were members who lived and had to deal with some of the issues you and your neighbors had to deal with. I'm sure we would want some type of resolution and you know at this time I do take a lot of pride in recognizing Mr, Smith, Miss Thurston and all the other members who make up that committee to take the comments and the concerns that you and your neighbors have shared, but to take them seriously and to make the recommendation and then you know we will as a collective body, particularly through, I guess my signature and the correlation of a letter with the office. We'll make sure we get your concerns to the right authorities, and hopefully we get a strong action taking place so that you can have a better quality of life. Now part two of your comment, as you see we're having some technical difficulties. So I do not know how much longer when we get back to normal. This will happen, but while we have it, let's enjoy it. So we'll continue to make sure we get participation so that many members of the district, like you who have to multitask for whatever that multitasking is, can still be a part of this kind of civic engagement. So thank you for that. As well wow who's next, you want me Rob. I believe, unless I'm misreading his body language, that former board member and Bridge Plaza Resident Juan Salazar has a comment: hi everyone. How old? Are you good? Thank you. Thank you. Thank you all and thank you particularly to test me and Mr Smith and Ms Thurston for their time, but and the Committee Executive Committee for voting to write to the SLA, and I just wanted to point one thing out: that of all those meetings that we've had with the hotel has been first, where the applicants, then there were senior managers with their counsel. This is not a junior person, they have their attorneys and you know so. They agree that we're not going to have amplified sound and then last year they came the attorney that would properly represent it. The last meeting they brought a separate who claimed to know anything, but we have and we send it to the board emails. That person was involved in the discussions about the sound. So it's they now. This is not a beer garden. This is the disco. They are advertising in social media. I think we also sent that information to the community board. You can look it up, they open the doors and we're concerned about Covid-19 Et cetera. So we appreciate- and we are you know to the best you can the strongest letter, because this has been going on for many years now. It's taken a lot of your time, our people etc. So we appreciate it and all the hard work and we thank you again. You're welcome, you're welcome, so Mr Singletary Mr do is posted some shorthand comments to the chat panel. Some my understand some. I do not. I think he seems to be asking Mr Gordon, to report out on the letter that that Ernest augustus sent to all board members. That was, as you know, discussed at the Landings Committee meeting. He also writes Fort Greene Handball Court funding by the council. I do not I'm not familiar with that topic and then also the the phrase notification of items funded. So those are the topics that Mr do would have liked to have spoken about if technology would be his all right. So, let's hold on before we before we respond that I just want to give us one more shot. Can we see we can get Mr Zoo unmuted and if he can take one shot, one more shot to unmute himself and if not, then we'll figure out how to answer the questions that he's put in the chat John? Can you hear us Mr Singletary? I can confirm on our end that both devices Mr two is on are unmuted, so he should to speak and John has commented in the chat panel, perhaps somewhat resigned. I will follow up tomorrow morning and we could do that. So, let's do this John. If you would, when you send an email, send it to the office and myself and we'll try to respond but Mr Gordon. If you are familiar with what John is identifying in the chat about the letter to Saint Felix, do you care to have any comments? Oh okay. Well, all right! We'll start! This is the the 130 Saint felix, which is the requests by the Brooklyn music school to increase the size of their property so that they can. They said it would help in funding their students, and you know and help the kids to come to the Brooklyn music school. There was a several months ago, I think, was one of the last in- person meetings we had. The board did approve the expansion of the it was an application for a it's, a 20-story building on the which would be a on the historic district on that block on St Felix Street on 16th street place. I forget exactly which, but it's a, although I did have some qualms about it at the during what because of the size of it now when, after the approval it was then went over to the Landmarks Preservation commission, which denied the application to the Brooklyn music school sort of. I guess I understanding that they took some of my personal concerns about the size of putting it in a larger, much larger building in the historic district. What Ernie, Augustus- and I think, John were very concerned about- was that a lot of people, the lungs near St, Felix, on six felix and around it were concerned that they did not have a chance to participate in the in the discussion. It came. It came very balancing quickly, but it did come up and, as a result, they're now feeling that they were left out of the initial process and what John was concerned was that Zero's voices were not represented during the discussions before the executive committee. Then what Ernest- and I think, Ernest and John were concerned about- was that if this comes or something like this comes in the future- that we should be able to participate and bring in the people who have, let's say, alternative viewpoints, and we should consider them as well, especially for people in the community. It was now. The whole thing was that it was yes, it was a nice idea by the Brooklyn music school to expand the size of their property, so that and they would be able to help the students. I think it was almost across the board support for the broker music school in theory, but what happened was that, because of the side, the proposed size of the building that would be, which would generate income for the Brooklyn music school? It was just something that would not really fit a law, especially on that relatively low rise block. Now it's right next to the Williamsburg savings bank building and I think what they were trying to do was to make it sort of fit in with the Williamsburg savings bank. You know high- rise building, but people on the same Felix side felt that it was just too large. It was just too much and that their viewpoint should have been addressed and I'm sort of going all over the place, I'm trying to wrap up the history and the discussions all at the same time. I was not ready for that point, but- and we did have a long discussion about this when I opened it up to in our last landmark land use meeting, we did have a discussion on this point. Let me let me let me interrupt you yeah, I'm going to hold you to the two- minute time limit, yeah, okay, yeah right, but I did not want to just address the this is great, but this is the section for the community so now that you've given me a lot more context when Mr Dude follows up to more tomorrow, Rob- and I will address this. Some of this has already been addressed, and let me just safely remind everyone that this is going to have to come up as a Europe item in 2021. So the opportunity to hear from the community is not lost, but we will give a response to Mr Dylan in a more official fashion from the from the office. So thank you for go ahead. Yeah and you know he's done it. He did a great job because I'm not sure you were prepared to speak to. That was nice. No, you did a great job speaking to him. Thank you, but I want to keep you in contact with the limit. So thank you. I appreciate it. Okay, any other comments from the community doing this community forum. Julia, am I saying that correct, okay, you're on mute for me, come on you, so I can hear your lovely voice. Oh my wonderful Brooklyn voice. Yes, Juliet is correct. Thank you and thanks again to the hess committee. They made it smooth and understanding what bridge Plaza has been going through. I'd just like to point out that we often have these meetings in the fall that we've dealt with in the past and then November and December and January are very cold months. So it kind of gets quiet on its own, not because there's no one outside at the beer garden. So we would not necessarily see any improvement until the spring once people are outside using the the outdoor space. So it's sometimes a little deceiving to look at complaints that may happen in the fall, because no one is really sitting out there with you know, freezing weather and then also it has become brought to my attention that, with the Covid-19 situation, people are leaving the events without mask or getting down to the street, and they do not have masks. Several people on defeat street have pointed that out. So that's kind of a trickle- down effect of having these large events with outside vendors or organizers. There's no control on that, but that has to do with Covid-19 and it trickled down from having the noise and the events and the drinking and then kind of falling out onto the street with no mask on their way to their vehicles or ubers or such and then the last point just to re- emphasize that, although the hotel may say, oh, we do not have amplified music or it's just a little background music. The way the architecture of that space is the sound is bouncing off their back walls into apartments adjacent and even across the street, which someone sent me some recordings, which I passed along to the community board that were taken in the apartments across the street on deaf fields, and it just somehow is amplified the way the situation is so the heads held can not use that excuse. Oh, it's not really amplified it's just background music either way, it's noisy to the neighborhood, as you have heard over the years. So thank you again for your time and efforts and helping us to kind of resolve this issue. Thank you. No thank you, and so let me just say for the entire bridge Plaza community, I got it. We will definitely make sure that we get the letter, of course, but let me say something in direct response to what Juliet suggested. You know we're going to we're going to submit the letter period full, stop we're not going to let the time of the year and the weather affect it, largely at least for me, because if the mandate from the City Council is that they won't allow for restaurants to continue on through some of the winter months. I do not want this to be an excuse for why the beer garden may continue to be a nuisance for lack of a better term and so to make sure we cover all bases there. We're going to proceed, make sure that it gets to the state liquor authority because I do not think any institution that has a liquor license wants to be on the radar of the state, Liquor authority, and so given that the action that the state look authority has taken, particularly during the period where enforcement of some of the regulations related to Covid-19 have not been adhered to. I do not think this is a good time to be on that list. So we'll proceed we'll make sure we cover the items that have been communicated to us. Will you know Jessican't only is a member of the committee but she's also the secretary of the of the board, and so I have no doubt that we have enough of your feedback captured in our minutes to make sure we put the right letter together to get the right message across. So thank you for that, but I wanted to just respond to you in that point. Any other speakers from the community. I do not see anybody in the chat, but given the technical difficulties, you know if somebody has a comment- and I'm saying this jokingly, but I really do not mean this and you're not from bridge Plaza, just raise your hand and we'll try to find a way to call on you, because I want to make sure that we get everybody who may have something to say so, and I mean that is a joke. If you have, if you're from british Plaza, you need something else, you want to add. Well, listen as well, but trust me. I got it. The letter will go out good job. Anybody else. Can you hear me John? We can't hear you, but we passed you already we're going to deal with you in the morning. It'll be easy. If you hear me now, first of all, I do have to acknowledge Mr Salazar and Mr Benicom, who are community board members from a previous century. I wanted to follow up real quick Mr Gordon gave you a synopsis of Saint Felix Street. The issue on that particular block again with the residents not being notified is also that the Community board submitted a letter of approval to landmarks without getting information from the community. So we are actually on record and from what I understand if they had enough resistance, the project would not go forward, so we needed to know that and we need to make sure that landmarks knows we did not consult with the community, because this meeting was held in May during Corvette, so there was no in- person meetings. The other item about Fort Greene Park is apparently in either ingersoll or whitman. There is a handball court that, according to them, lori combo has funded and it does not appear on our list anyway. So I wanted to share that with the parks Department to see if it is, it should be on our list and if council, member combo has not defunded- and I guess that the other item for Mr Paris, the question is: how do we know when certain items that we submit are going to be funded? That's it if Mr do is asking how we know about how we know whether budget priorities that we have submitted in past years are funded or not. When we receive the register of budget priorities as part of the January financial plan, which is issued along with the preliminary budget for the following year, there is a notation within that document on a priority by priority basis about which projects have been funded. So when that can be shared generally share that every year, I think someone's sharing that right now. Okay, so thank you so much. Thank you, Community Board! Thank you, John. I'm actually glad that you were able to work through the technological issues and be able to ask those questions directly. So thank you. I had to go to my third device. Okay, good! Are there any other comments from the community? I mean from the community? Okay great! So once again, thank you. Everyone who participated, we had another successful meeting. We could not have done it without the participation of everyone. Those president, those who, just you know, were not able to show their face. Everybody who spoke with those who have desire to speak and those who have their thoughts channeled through other people. This is what the community is about. I thank you all for your participation and before I get a mad response, I'll entertain a moment, a motion to adjourn some move all right. Any objection, I'm only joking, have a good night. Everyone take care good night have a good one.",
            "summary": "Okay, I'll start in Carlton Gordon, the chair of landmarks and land use, I'm Brandon, Smith, I'm, the chair of Health Environment, Social, Services, Hi, Juliette, Colin, Chung, Chair of transportation and public Safety, Gerald, Galvez, Co, chair of transportation and public safety, betty Fibrous, Chair, Youth, Education, cultural affairs, hi, just signing on Denise, Peterson, Economic, Development and Employment committee coach.\nThank you for each of you introducing yourself and that work provide everyone within introduction to the members that make up the committee for Executive Mr District manager.\nI do note that the notice that was sent out to the public omitted mention of the statement of district needs that will come at the end of the meeting, but that will be probably a somewhat long- winded discussion for serious wonks only so stay tuned, okay, great.\nIt may be my pdf, but maybe not it says, Juliet Thompson manning clearly we're missing a comma there, So Please email them to the board office and we'll make those corrections in that manner, and No additional corrections will move forward with agenda item number four committees for action.\nThis is a location where they're doing a switch of ownership, but they're going to keep the same company and menu just a new owner, a peruvian restaurant they're, open Sunday to Thursday 11 to 10, P.M, Friday and Saturday 11 to 12 A.M and upon discussing it that there had not been any complaints or concerns about the existing operation raised by neighbors.\nThe community was said to be excited about this, according the applicants, and they were going to have events like a jazz band or an irish trio as part of their live music that they would have at this location is in sort of a brunch.\nThere's been a number of community concerns expressed about noise, particularly related to one of their licenses, which is a second floor, beer garden that goes out under the outdoor area of If you think, of how the tillery hotel, faces, Flatbush, the beer garden, actually faces away from Flatbush down towards the bridge, Plaza neighborhood, where a lot of the residents live and to summarize it, we've had five years of different people coming to represent the tillery hotel.\nThe two individuals represented the hotel indicated that there were that the beer garden did not face any neighbors and there was not going to be any community impact and there were no community members at the at the meeting.\nThere were a number of complaints filed with 3- 1- 1 and City councilman Levin got involved, and there was a meeting we held in November 2017, with a completely different group of people representing the Tillery hotel, who indicated that they were new, that they were quite overwhelmed by their work and The. The neighbors expressed concerns about noise from the beer garden and the hotel and us, and the neighbors.\nWe agreed that they would that the hotel would no longer play amplified music out from their their beer garden, because there was a concern about these sort of special events that they were holding where this amplified music would be very loud, go on late at night, and the neighbors would go to the hotel and attempt to complain about it and there would not be a manager around or they would not have anybody to work with, and the person who came to that.\nAnd there have been fresh new complaints and it seems it seemed the complaints were that the hotel effectively abandoned their agreement from October 2019 and has just started playing music, creating lots of noise for the for the surrounding residences, and we invited them to come to our last community meeting our last committee meeting, just in order to get sort of a better understanding of what was going on, but hopefully to reach a resolution between the community members and the hotel, and we had a representative from the hotel, attend.\nFourth, different group has come to represent the hotel and they, the sort of, throughout the course of about an hour of discussing this issue between the community members.\nEvents in October, with third parties coming in to do bar mitzvahs and weddings, and that they'd expressed a lot of difficulties with Covid-19 and with the challenges that had existed associated with that and at the end of it, you know, despite really trying to reach a consensus with them, which I think is probably the main goal.\nWhen I asked for an approval of the agenda, I took a second from Oscar Only a member of the youth education and Culture Affairs Committee.\nOkay, I, entertain a motion to accept the committee's recommendation for Brooklyn bridge forks five.\nI'm glad to hear that, hopefully, we'll have a stronger relationship and that to imply that we did not with the previous commanding officer, but we hope that we can continue the relationships that we have with the 84th president in a good way , That's good to hear I'm glad you shared that next on the agenda item number five committees to report: Let's start with economic development and employment, bill, Fletanoy We had a presentation by cinch market They're, a company local company that actually has taken taking the initiative because of Covid-19 to actually organize an Amazon type of platform with local businesses throughout the area where you can actually order products from various small businesses throughout the area, whether they are brick and mortar or online, and actually order goods to be delivered to your house.\nI, was, I feel, very comfortable in recommending this company to anyone to check out the website and see what they're all about the the link is also in the chat room, along with a link to Dumbo stores that are using the platform and Tia Mueller, and I are working with other bids, other community boards and the borough president's office to make connections between and other parts of, Brooklyn.\nThey believe that children should have as much ability to play as possible without having restrictions, and they did a pop- up right before Covid-19 at city point Excuse me in doing some other program in our district, and our committee was very receptive to them.\nWe've started a conversation now and It's a little too late now to do something outdoors for, for the last part of the fall, so we're looking forward to hearing from them again and to see what they could bring to our district And they're, particularly interested in setting up a program that would be very much accessible to children who live in NYCHA, projects, So Thank, you, Barbara Next committee to report on youth, education and cultural affairs.\nWe did not meet since the last time that the executive committee met, but I did want to share that.\nWe're going to discuss the fiscal year, 2022 statement of Community district needs and register of budget priorities at this time.\nYou know those of you who have been on the board for a long time and many of the executive committee members fall into that category.\nThe Office of Management and budget would like community boards to limit their expense budget priorities to 25 and with the new additions this year, we're somewheres up around 60.\nIf we, if I put that in a separate lane for a minute, is there anyone else that has any comments on the proposed suggestion to move forward with reducing the expense budget items based on the ranking up before you take Mr com, Worksheet is in the chat panel, and if anybody needs that email to them, we can do that that will be accessible to anyone that has not been granted access to that drive, but all board members should be able to access that, and then.\nMy only child Thank you for those who've, always asked how his progress, progression, was, And I'm sure his family appreciates some of the thoughts that you may have but wanted to be open and let you all know that he put up a good fight he's in a better place.\nI wanted to just share that with everyone and then we'll move on to the district management item number eight on the agenda.\nI will send the board members a district office report as part of the package for the November general meeting, but I did want to share with the board members.\nThe vote was 20 to 2- 3 and at the time that the attorney and his client presented to the land, Use Committee and also to the General Board, they said.\nAs I said at the outset, I will send a written report to to the board members when we do get ready for the November meeting, but I did want to bring them up to date.\nI'm, a part of the bridge, Plaza Group, and I just want to thank you guys for all of your help, the Hess committee and the executive committee for supporting us with our continued battles with the tillery, and I, just how much I'm enjoying being able to attend these meetings.\nI'm sure we would want some type of resolution I do take a lot of pride in recognizing Mr, Smith, Miss, Thurston and all the other members who make up that committee to take the comments and the concerns that you and your neighbors have shared, but to take them seriously and to make the recommendation Particularly, through, I, guess my signature and the correlation of a letter with the office.\nWe appreciate it and all the hard work I think he seems to be asking Mr Gordon, to report out on the letter that that Ernest augustus sent to all board members.\nWill, you know, Jessican't only is a member of the committee But she's, also the secretary of the of the board, And so I have no doubt that we have enough of your feedback captured in our minutes to make sure we put the right letter together to get the right message."
        }
    }
}