{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB2",
            "channelId": "https://www.youtube.com/channel/UCVLwE9hAz_DYXIEaL9TbfKA",
            "title": "Bronx CB2 FLP Committee Meeting 2020 October 13 (Part 1)",
            "publishDate": "2020-11-16",
            "shortDescription": "",
            "lengthSeconds": "0:34:42"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB2",
            "normalizedName": "Bronx Community Board 2",
            "twitterName": "Bronx Community Board 2",
            "youtubeChannelName": "BronxCommunityBoard#2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCRfzp2GSHg6CIjALtX73JGw",
            "twitterHandle": "@2_bronx",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "PKTzWzLRVlY",
            "fillerWordCount": {
                "uh": 68,
                "um": 80
            },
            "readTimeFullTranscript": "19 min read",
            "readTimeSummary": "3 min read",
            "wordCountFullTranscript": {
                "license": 18,
                "location": 17,
                "liquor": 13,
                "beer": 11,
                "problem": 11,
                "wine": 10,
                "restaurant": 10,
                "hours": 8,
                "establishments": 7,
                "food": 6
            },
            "wordCountSummary": {
                "liquor": 8,
                "license": 6,
                "wine": 4,
                "state": 4,
                "services": 4,
                "beer": 3,
                "location": 3,
                "authority": 3,
                "food": 3,
                "capacity": 2
            },
            "fullTranscript": "Okay, so we're going to move on to the second item on the agenda which is and Bobby you told me to take it off. So we have Dusa Diaz President of Route 55, located at 1318 Lafayette Avenue she's, applying for a beer wine insider. This establishment will have a full menu. They'll have recorded music, there's no op Ms Diaz are you here with us she's there I'm her daughter. She doesn't speak English or actually, what's your name, Miss Nunez, so I just unmuted her I guess you guys could Pres exactly what you're doing here and then the committee will have questions okay, so you want to say present or something. Oh man present. Give us tell us what are you doing here? What is it, what kind of restaurant? What's your hours of operation? What are you looking to sell? What kind of food you sell and so forth? Please! Thank you. Okay, so I am the manager. Is a restaurant, a family restaurant? So it's mainly actually it's so we just want to apply for the liquor license just to provide if they want a wine or beer while they're eating. We are opening the side, which is another location, so we want to do like a private party event, but the most it fits both of them is 60 people, but actually they for one of my accountants. She, when she submitted the application. She told me that it was just wine and beer, but we actually want to apply for the full liquor license if possible. What are you going to only entertain? I'm sorry Mr Chris, but we can only entertain what was submitted to us by the state liquor authority, so we're only looking at beer and wine. We can not do full alcohol. You have to apply for that and that's that will have to come back. We're only going to entertain what was submitted to us. Okay, no problem. Okay, can I. Ask a question: is this like, so you have a another site, so this is just yeah. It's just the location next to us was empty, so we're taking that over. It's already been approved and it's setting up another bathroom and it's just an empty hall. It's a small site yeah. What's the address, 13-18 Lafayette I didn't hear that Lafayette. It's right on the corner of Bryant, so the owners of this establish located there. There's three brothers they've been located in and out of this community 40-plus years they've been pulling bodegas. He purchased the leaf next door and wanted to sell food and actually reached out to me a while back and he's calling it route 55, because that's the route in his hometown and in the Dominican Republic correct. What are the hours right now? The hours are 7:00 a.m to 10. P.M is closed already, and you said currently you sell. Seafood is spanish fruit, just dominican food, it's a mix of everything yeah. What kind of security do you have in there? So we don't have security, because it's a very right now, it's very small! The most is only three tables right now, since we're doing the 30 of the space that they approved for people to sit. If you, okay, if it was a fool, if you was there, was no Corona problem or anything like that. How many tables would you have six tables without the new location? That's open without the what the news, the sign? That's opening up like they're, constructing and they're fixing it up in total. It will be about 60 people max 60 yeah max, and what are your operations on the weekends same hours, 7 a.m, to 10, P.M Ralph remind me, isn't this where the mexican guy had the no? This is not that Bobby no they're up the block. This is a totally new place. Yes, this is a brand new establishment. Here this one liquor license is going to be for both sides right, oh because they have a liquid. They have a beer wine for their bodega. Okay and now this is not applying this for their restaurant, okay. Well, they gotta turn the corner right yeah, the bodega is on the corner right. This is the owner of the bodega all right. It's the same address it's just the local four and five is like just the side of it is the full one. Still on Sarge yeah. Have you guys had any reports on this particular location in the past? Not on this particular location? So I ran the address in our database and you know just typical stuff harassment assault, but nothing in regards to to this this exact location. The only thing is this is going to be a new. You know this sounds like a new entity. 60 people sounds a lot, I mean I'm a little. You know it's. It sounds like a lot of people also I, don't know how it's going to work with the 25% capacity, so if you're at 60, if your capacity misses 60 people you're actually not going to be able to have 60 people inside because right now the city ordinance is 25 yeah. So it's not even open. Yet it's just a restaurant part which is like 10 people max, and we have the control like the girls in the front, they're controlling that, because you know they just come in for takeout. Ninety percent of it is takeout and delivery and that's if they open the site- and let's say that was like if Colbit was in existence, but right now with Covid-19 like it would be. 30 people, maybe 20 people max, but it's not open yet yeah, that's 15.! Another question: are you guys planning on having a car in the location? It has a part. That's why I, because I wasn't aware that they submitted for only wine and beer, so I will be submitting for the full liquor license. The restaurant is a small restaurant and it has a bar area, but we just have sodas and juices right now, planning on utilizing the bar area, if approved for the yes, you know it's only 15 people you can have inside yeah 60. She said they only and there's only four chairs each and people okay, but let me just explain you applied for a license and that if it goes through, if we approve it goes to our board and they approve it, that's all you're going to get. If you make any changes, you have to go through the whole process all over again, yes, and just understand that understand, right, you're, saying your operation of hours, Sunday through Saturday, is going to be till 10 o'clock at night until 10 o'clock some days right now, we're closing at 7 pm every other day we're closing at 10. Anybody got questions I. Do she just stated that she wants a full liquor license and she's willing to come back if she's, getting the beer and cider or she's getting the full liquor license? Which one is she getting the beer, but she just stated that she's going for the other license and she has to come back. She has to come back to her: okay, Mr Chairman, yes, oh Chairman, Oro, sorry that I took your space, no problem. Thank you very much for standing in for me. I want to re-emphasize that Covid-19 is very much a problem, not just this city but in our community, and it's not really the right moment for us to be thinking of expanding a species where people congregate so as much as possible. No one really knows if the vaccine will be available in the next one year. We, as we have seen in places like Brooklyn, they are reinforcing. You know, closures, businesses are closing down, houses of worship are closing down, and here in the south Bronx we are very vulnerable. We have our challenges. We lost so many lives during this recovery. 19 and my committee do not want to be a source in which there will be a spread of infection of lives being exposed to unnecessary danger. So I would suggest that you know this application should be resubmitted. While we evaluate the current coverage, 19 situation, Mr chair can I say something yes Sir, so Pastor John. It was great. It's great hearing from you. You know compared to the previous application. You know, I can tell you that I will be supportive of this application. You know one of the challenges that we have in the state budget and the city budget is the ability to provide funding for our safety net programs such as the food pantries, such as supportive services and so on and so forth, and in order for the city of New York and the state to provide these services, we depend on these businesses to pay taxes so that we in return can turn around and we can pay for these services. This is a family-owned business. We need to revive the economy in the borough of the Bronx, and the only way to do that is to support small businesses and they would have to follow the rules of social distancing and if they don't follow the rules of social distancing, the Marshall will go in and they will find them just like they did this weekend and they find many businesses up to 150,000 and fine for not adhering to the rules of social distancing. You know this is a small business, that's providing food and, at the end of the day, they're going to generate more tax revenue so that we can pay for our food pantries and provide for safety net services that we need in our communities. So I would really hope that you, you know you reconsider. Thank you John. It's your show. I relinquish, yes, I, understand the need for us to support local businesses. Currently they have a license for one of the establishments they are looking into expanding. All I'm saying is that at this point in time we are dealing with so many challenges, so many issues in the community and I mean I'm only voicing my concern and it's it's just one vote, so the old boy has to make a decision, but I'm just saying that I personally believe that at this point in time, we need to be a little bit careful on how we expand some of these businesses either in approving or renewing licenses I, pastor John. They must have if they like, the councilman, has stated they have to comply with the social density, distancing and right now, according to what she's telling us it the place is the certificate of occupancy 60, it's only 25, so that would only be 15 people that you'll fit in that particular location. So I personally, do not see a problem with it. We will also have the police department be going by there on a frequent basis. We understand the area we need. The area police department always gives that particular area a little bit more attention, so I trust the police department to tell us the truth and I know that sergeant Guglielmo and Captain Cherblin and Cola and Emmanuel will be on with it and telling us what's going on. Yes, I also want to add that I mean while we trust that these establishments will adhere to the to the safety. You know protocols. There have been instances where they are not observing the protocols, and you know we are even thinking of ways to you know, to go on surprise visits, just as our council member to do when he was a district manager visiting this establishment, giving them surprise visits to see what they are doing, because there are so many establishments right now that are not. You know providing enough safety as we would have expected of them. So I, I'm not saying that this one will be, will not be different, but we have issues in in our community. People have personally come to me to complain about some of these establishments that we have approved their legal licenses that they are not providing enough safety protocols in their establishments. I understand that concern, because we've got a few places. We've got a few places in the board that are not complying and sergeant top of us, letting us know and, as a matter of fact, making one particular location they're planning to close it down because of them not complying and becoming a nuisance to the community. So I understand exactly what you're saying my thing here is only as the councilman has stated not to I don't want to keep beating a dead horse, but I would like to see you know, especially in that area where, across the street there's new homes in that area, you know they need to have some place to go to, and if this place does work out, we'll know about it and if it doesn't work out we'll know about it, also the count the councilman's always driving by there, I'm always driving by that area, and so does the district manager. So you know we would know if the places operate the proper way or not the same way. We have board members who go to other establishments and let us know when they're not doing the right thing. So again, I'm saying that to try to. We should try to see how we can facilitate this particular license and approve it. So Mr Chairman sergeant Guillermo again just just a point of order. Just Columbus John know so all of my visits and all of our inspections are all surprised, I, don't ever let the establishment know that we're doing a whether I work with the SLA I mean I'm on the phone with Mr Vado, Mr, Bobby Crespo. All the time and I take every complaint seriously: every single email, every single text message that I've gotten captain, Schumer and I have reviewed the location and I've gone to the location. So we don't and then I never ever there is never a heads up to the restaurant or the bar or the location we just show up and I do it at random hours. So, just to be clear, we do spot in check inspections and if anybody please like, let everybody know if there's ever something that you see that that's that you don't is not complying. I've done my homework, studying up on all the rules and regulations, but I keep you know it keeps updating on a weekly basis, so Captain, Schubert and I are very on top of it, but they're there, none of the locations ever know whether it's a restaurant, a bar or a nightclub. They never know when we're going to show up there and do an inspection. Thank you Sarge. So you thank you. So it's I think it's only you and Maggie. That's on the committee Maggie's, not on this committee. It's owning home right now, so he's gonna have to be the executive officers again as well. Huh feeling is on as well Evelyn's on as well. Okay, great so I take a motion. Oh I'm, sorry. What I'm sorry I didn't see. Evelyn that was on I'm sorry, I wanted to commit. I would take a motion from the floor to accept this particular application for to see how this thing all works out. I would take a motion to for approval on the application hi. This is Julia I'll make a motion to accept the application hi. This is qualified carriers and I suck at that motion. Okay, so is there anybody, because we can't ask because everybody's crazy is there anybody objecting to the motion. I just want a commitment from Ms Nunez that she will follow the the protocols and the the distancing, and all of that just make a commitment to the committee because we all will be visiting so this way. So you know once a month all city agencies meet with the district manager. So, if they're, if something, if we find out about something we will be talking to them and you'll hear from us. Of course, I would like for you to reach out to the community affairs officers in the full so like this, they give out a class. They it's called nightlife, it's in the four right precinct, if I'm not mistaken, also there's a gentleman from Outboard Cedric Mccluster, who has a program that helps restaurants and other establishments that you should be reaching out to so you could reach out and she could give you the names and the numbers to everybody and the preaching. Also nightlife. Excuse me the precinct also does their nightlife meetings yeah, that's what I'm saying the precinct does the nightlife but I think they do it at the 4-1 right? Yes, yeah, okay, right, okay, thank you! Okay, so Cynthia, please follow up with her and so that they could attend the football meeting, no problem. Thank you. Cynthia next review of renewal application for Lupana Nada, 404 Hunts point Avenue. This is a renew for their license for their bare wine insider. They have a full menu they're like 24 hours. They only have recorded music they're, not seeking any outdoors. Yes, so good evening. This is Mark Weinstein. I'm and I still have a problem pronouncing his name, but we call him Bala, and this is a renewal, as everybody knows, perhaps to refresh you President Mark is Bala here. No, he had some technical difficulties, so he wasn't able to I was texting him while you guys were and he's having a problem with his computer. So my apologies on his behalf. Do you have a power? Do you have power of attorney with him I submitted the I sent the board the the renewal 30-day notice, I'm on file with the New York State liquor authority I was the per I was the attorney that did his original liquor license application two years ago? Do I have a power of attorney for you here tonight? No, would it be possible for you to get him on the phone like speakerphone I'll, see if I can get him I don't know. If I can, let me see well what is the address? 404 hunts point Avenue. This is for Kelly's the pizza shop. We used to always open the pizza, oh yeah, so this is a new owner. He did come last year. He also owns the Delhi across the street from coastal street across the street, and he's been now the owner of fertility for quite some time. He bought it two year two years ago, I have him on Speaker Bala. Can you please say hi to the board: yeah hi, hello? Yes, how you doing? How are you good? We were hoping that you would be on so that we could talk to you, but we just want to make sure you're authorizing your attorney on any issues that we may have on correcting any of it. Yes, you will okay, you know, I'll, keep you I'll keep them on this like this. If that's? Okay, that's fine! Thank you mark! Thank you just so that maybe you don't have it that your files handy because I know everybody's having problems going to the office, but on last in June 2018 there was the stipulations that were entered into. In fact, the Ralph Acevedo signed as the district manager and Chairman Crespo Robert Crespo Mr chairman you signed as well, and it had 21 stipulations with regard to this application at the time that it was a new application and we haven't had any issues to date. We've adhered to all the stipulations tried to be a good neighbor. You were very accommodating to, and we appreciate it to the idea that we were in a district. That was a little unusual in the sense that people have different schedules in that part of hunts point. So you were very accommodating at the time with regard to the hours of service of beer and wine which we appreciate mark. Can you give me a second, please sergeant Guglielmo sergeant you're still here yep, I'm here this location, 404 hunts point you got any issues. Anything came back here, no same thing as the other location I mean just the random stuff that that happens on the street, but nothing stemming from either Fratelli's or the restaurant or the pizzeria good. To know. Thank you sergeant, Mr, Chair, yeah, okay, yeah, it's good to know the four one has no objections: Reverend John I think he's on mute column, hello, yeah. Yes, we have no objection. Not no complaint has been brought before the committee. Okay, so make them. Someone needs to make a move. I will take a motion from the floor from any of the execs Larry or Julia or Paula I vote that we've given Ellie permission to sell what he wants to sell at the store. Basically, a liquor license with their wine right now, tier one. That's there's a beer and white license and it's a renewal all right any seconds, Kanye's, our second emotion. Okay! Is there anybody on the floor that would object to this particular location. Yeah. Thank you. I. Don't think it's on that here with none. Oh this one yeah I will call it unanimously and we'll follow up with them or they can appear at the full board meeting. Yes, Mr Weinstein. Please call the office and speak to Cynthia and she'll she'll. Give you the date of the board meeting and it'll, be virtual. Also so you'll have to be there just in case there's any questions. Yes and oh, we did not get. The I did not get the return receipt from the board that the liquor authority needs. So could somebody be kind enough just to email, something to say that you received the 30-day notice speak to Cynthia? Okay, let's just check that and we'll follow up with that before the full board meeting mark. That's not a problem! Thank you for your time. Everyone, thank you. Mr, chairman, no problem. All right. Moving on the last item on the agenda is a renew of a new application. I, don't know if it's new or if it's a renew for Jose Duron, president of 1089 La Locanera Pollo Sabroso, located at 1089 southern Boulevard he's applying for a beer wine insider the fisherman has a full menu. They will have recorded mute, no outdoor permits at this location. Ryan. Are you present Mr Duran? Is there anyone representing 1089 southern Boulevard? No one here representing 1089-7 boulevard, who is Andy now with the Senator Brg? Okay, so I, don't think anybody here is all right. So Ralph I'll take a motion from anybody to deny the license since they were not here to make a presentation. I give a presentation that they're not here. We should deny the motion because they should be here to present themselves. Thank you. Larry Yvonne, you won. Iran is not on. No okay will I get a second Maria. You could, second it no just the executive office. So then I'll second it that's the chair, hello. You think Reverend John wants to say something very John, Reverend John Johnson, hello, yay, yes, yeah. We have no objection to denying the the application because they were told that they need to be present today for the meeting. So if they're not here, then the bot can not continue with the process. Okay, so Larry put a motion on the floor. Any anybody am I, correct, Larry yeah. Did you get a second on that table? The request table it right? Hey? What are you doing? Okay, because first somebody said deny which one is it Larry deny or table Larry? We don't hear you, I'm you on I got it I think we should table it. They don't have no fractions against them, for my knowledge and I'll give them opportunity to show up at the next meeting yeah and they actually sent us their information, maybe like two months ago, but the office was closed. So what are you doing? Oh okay, so Larry, it's not a denial like you said before. It's table: okay, so I. Second, that I agreed to table it. Okay, all right, all those in favor say all right or don't. Rather anybody objecting to the motion. Perfect, not hearing, none Maggie, you waving your hand, okay, not hearing, none I will take it as a as unanimously to table this particular license and give them another opportunity. Cynthia try them again for the next month, no problem! Thank you! Any old business. Any new business I want to mention something quickly for new business. As far as a first presentation with club, w, we did reach I was back and forth with the General Council for the state liquor authority, and they just because as of right now, the license is issued under the old owners and I wanted to go on record with Mr Fuhrman and his attorney that the old owners are no longer at this location. So I'm going to request from the security that they revoke that current license and that we're objecting, along with all the elected officials, what I actually did was record. This meeting and I wrote that one portion and I'm going to send that to the state liquor authority, so they can have it on record, so there won't be like minutes taken. They can actually see the actual video, so I just want to go on record any announcements. If there's no announcements that that's all for these girls Chattoria Gloria Sartoria. Thank you pleasure meeting you now we'll be talking to both of y' all and the other members. You know as a group, all right this is Paul, can I, say something yes, Miss feels Kanye's. Thank you, I keep forgetting all right, detective Jew will be without I mean retiring and her workout would be October the 30th at 3 p.m. Just in case you want to know we're going to get a flyer passing around October 30th at 3 pm. Well, it depends on how they set it for between three and four. The time is not really to be determined, but I'll send the flies to you. Cynthia. Yes, please I'll be in town, so I'll be there. Thank you just remind me, Ralph I think you should represent the board too I'll be there as long as we get fires that we can send out, we'll send it to everyone. Thank you Paul. I'm sorry about that. I'm sorry about the kindness! That's it for the agenda. So if you want to make a motion to adjourn the meeting motion to adjourn, is there a motion to adjourn I could stay here all night. Thank you, Jennifer! Thank you. Victoria am I, correct. Okay,",
            "summary": "We just want to apply for the liquor license just to provide if they want a wine or beer while they're eating.\nWe are opening the side, which is another location, So we want to do like a private party event, but the most it fits.\nShe told me that it was just wine and beer, but we actually want to apply for the full liquor license if possible.\nI'm, sorry Mr Chris, but we can only entertain what was submitted to us by the state liquor authority, So we're only looking at beer and wine.\nAlso I, don't know how it's going to work with the 25% capacity, So, if you're at 60, if your capacity misses 60 people you're, actually not going to be able to have 60 people inside because right now, the city ordinance is 25.\nShe just stated that she wants a full liquor license and.\nI want to re-emphasize that Covid-19 is very much a problem, not just this city, but in our community, and it's not really the right moment for us to be thinking of expanding a species where people congregate so as much as possible.\nYou know one of the challenges that we have in the state budget and the city budget is the ability to provide funding for our safety net programs such as the food pantries, such as supportive services and so on, and so forth, and in order for the city of New York and the state to provide these services, We depend on these businesses to pay taxes so that we in return can turn around and we can pay for these services.\nYou know this is a small business, That's providing food and, at the end of the day, they're, going to generate more tax revenue so that we can pay for our food pantries and provide for safety net services that we need in our communities.\nJust saying that I personally believe that at this point in time, we need to be a little bit careful on how we expand some of these businesses either in approving or renewing licenses.\nWe've got a few places in the board that are not complying and sergeant top of us, letting us know and, as a matter of fact, making one particular location, they're planning to close it down because of them not complying and becoming a nuisance to the community.\nI don't want to keep beating a dead horse, but I would like to see you know, especially in that area where, across the street.\nNone of the locations ever know whether it's a restaurant, a bar or a nightclub.\nI sent the board the the renewal 30-day notice, I'm on file with the New York State liquor, authority.\nI was the attorney that did his original liquor license application two years, ago.\nBasically, a liquor license with their wine right, now, tier one.\nOkay, So I, don't think anybody here is all right.\nThey, just because as of right now, the license is issued under the old owners and I wanted to go on record with Mr Fuhrman and his attorney that the old owners are no longer at this location.\nAnd I'm going to send that to the state liquor authority, so they can have it on record, So there won't be like minutes.\nIn case you want to know we're going to get a flyer passing around October 30th at 3."
        }
    }
}