{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "title": "CB7 Housing Committee",
            "publishDate": "2020-07-13",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 1,
            "um": 10
        },
        "wordCountFullTranscript": {
            "housing": 44,
            "money": 39,
            "people": 25,
            "things": 23,
            "lot": 23,
            "nature": 22,
            "thing": 22,
            "time": 21,
            "doors": 21,
            "meeting": 19
        },
        "wordCountSummary": {
            "district": 6,
            "money": 6,
            "capital": 5,
            "people": 5,
            "housing": 4,
            "budget": 4,
            "committee": 4,
            "meeting": 3,
            "priority": 3,
            "funding": 3
        },
        "fullTranscript": "Yeah we already got the bees eating because they fertilize on the wheat fields at night up some Wars and use that money. To put some, you know, build bridges and fix the farms yeah. They had a woman on today who basically study gorillas and apes in Africa, and she was saying that we as humans have to stop separating ourselves from nature and not understanding that we have to share diseases jumping in to mankind the way that they are herded together, like markets all over the world right yeah. But you know what her comments were about, how you know we have to learn how to live with nature, and you know the plan I just completely the hours up, but we have to change how we do things and how we interact, because she said you know everything that the animals are being crowded together now they have less space to throw in the wild, so to speak, yeah we're coaching on their grounds and they're coming back, but they're coming back at us, but it's really their territory that we're in costar we're developing their areas. It's not that that's not beneficial to either side, so you move out to the country and you think that you're gonna have and you gotta wind up competing with the wildlife in the country where they belong, and but you can't stop, you can't change the mindset of developers. They see a and I can say yes, sherry, it's not you. Okay, who do we have on I, don't see you and I can hear Polly I'm gonna have to go to my computer, because the phone doesn't give me enough information and Madeline it and I'm. Gonna come back as a weird delay here, I'm hearing things twice and three times hi. How do you do hi, Louisa hi haven't seen you in a while I know: Roberta's back in San, Francisco I'm, still in birdie square, really nice here good to be local. There Doug the Sun, never sets here, it's yeah! Well, I! Guess last night was Manhattan. I heard it was a lot because of the clouds. Did anybody get to see any decent views? I heard it was okay? What's that sounds like a motorcycle? It is a motorcycle inside my house. There's a lot of them around I. Think I'll mute. So you don't hear it. Oh. This is so weird I, don't missing a number of committee members, yeah Susan, IRA, the leader, yeah I, don't think we'll leaders on housing anymore, harvest going on twice: okay, that's genetic! Coming to all the meetings and there's trees at the foot board mark you know, I sent you that email and I'm- sorry, you replied to me, but I did something evil to it and it disappeared so yeah. So this is an old hotel on Columbus and 79th. What happened is that mark make sure that the full board meeting that there was affordable housing going up on 79th, Street and I asked him where okay conversion, it's building on 79th Street, that was it's been taken over by project open, I, see on 79th yeah, it's there's a developer, that's taken over and they hired project open to run it project find I, mean project. Fine, sorry I got that project. Fine and it's it wasn't a sorrow, they're converting it so that each room will have its own bathroom and its small kitchenette am I. The only one who's getting multiple feeds of the audio I'm hearing it as well I'm, okay, in my end I, did it I heard it just now. Mark I don't see anyone on twice, that's usually what causes this I know in the attendees is twice yeah, but they can't speak right now. We can't we can't hold a meeting this way. I just lost soon, mark and Madeline. Why don't you exit and re-enter? Because I am not having a problem? Okay, yeah! It sounds. Okay, my sight, you, okay, the problem! The problem is a fight all right. Here's what we're gonna do make me hosts and then I'm gonna make you I'm gonna make Melissa the host, because, if I exit other yeah, everybody else would drop off the power okay Susan in the leader, yeah, that's what Madeline and Marshall yeah like haircuts so now, I'm not wearing that tantalized wearing it at every meeting. So, what's so beeping I'm hearing someone or something you could wear it until pandemic is over think about that the Hat, like rather of a haircut I'm, sure, hey I, almost thought. I was gonna, just grab my hair and it just became impractical and when, of course, I bought a clipper to do it myself and the day that clipper came, the hair salon said they were gonna reopen. So now I have a clipper which I haven't used. Well, you might need it this winter. So yes, hopefully not, but you know: Thank You Melissa between the haircuts just enjoy the law right now, but I guess marks having problems, give him another minute and then oh sorry, that was me. Okay, I think, let's just get started and Mark will join us. So I, don't know the agenda, never got posted I, think which is my bad it's to look at the DNS of what was supposed to do right. So we wanted to look at the DNS and budget priorities one and then to talk about what we want to be doing in our committee meetings, especially well. I guess starting come September I feel like it's kind of a new community board year and I. Think we want to embed into both of those discussions a lot of thoughts about weaving NYCHA and the needs of residents into our work. So I think, let's start with the DNS and budget priorities, and we can look at we did last year, but I think you know for context. Cedilla sent out that memo that sort of asked us all to be a little bit more thoughtful about how we compile them this year, with so little city money likely available next year and to sort of really think through what should float to the top of our list. And you know just based on our committee to me it would seem the needs of NYCHA, both capital and operating in our district would be a major priority and I sorry I'm just reading a message from Larry wood from that's, where a law project also suggested, like rental assistance or eviction prevention funding for people who are in rental housing in our district judge agree. It's a need, but I. Think overall, we need to talk about. Like what do we want to prioritize? Are they like big asks that are sort of like larger policy issues, or are they more concrete things that are actually in our district that we think we could maybe get as opposed to being more of a coalition of voices? And you know I'd like to hear what everyone's thoughts are on like what is the right scale of ask to be targeting and Louisa? Do you wanna? Yes, that's why I was muted, but I could still hear it. Yeah you're, certainly crackling bad in my crackling for everybody. For me, okay I just want to talk Terkel, okay, because I looked at that list that Cindy sent around and everything that was the five of them for housing and that included the playground in the Senior Center of Frederick Douglass. So my first question is: why is housing so low on the totem pole? There's a lot for repairs all this is necessary a lot about social services and there was just repairing repairs for nature. There was the skill, the idea about the skilled trades and apprentices for nature and other than that we weren't on the list at all, and so I think. Also we should advocate more for being included. Wheel is important as blue stone steps in Riverside Park. That's all I want to say three I think it's going to be a very different discussion this year. If I can yes I think so also, but it's also that housing is a very large component of what the need for good housing. It's a very large component that what's happening this year, but what is gonna be the priorities of the governor and the mayor. Is it small businesses or housing? So that's what we have to look at also what I'm gonna be their main priorities, but do we have to say it is small businesses I mean? Does that mean that we are not gonna advocate for better housing and police Louisa? If I may, I think that it's a tactical issue, I think that where Melissa's body is where we should be here and I, think it's a MIDI as of or at least a location at the committee to the board, we should stay focused and we should stay focused on nature. We know the state in the city politics and it is an underlying political issue. Who's gonna get whatever is available, but I think as a community board. We have to outline and make the arguments for the different components of support for nitro and the different projects and the playgrounds and the senior sentence all related to NYCHA and I. Think we should not let up on their and I think that when the local elected officials are held in and the Laveen and all of them, they see the additional arguments and the pressure that we're applying I think it helps them in making their cases. But I, don't think that we get into a discussion as whether we should support them or for night repair or small businesses. No, absolutely not I think as a Housing Committee we're dealing with housing and that's our focus and it's the single mindedness flower of our argument and our attack, and then there, of course, there are different elements of housing, but the priority, if we're going to exert our energy effectively, has to be in Nitra, because that is the that is the ongoing issue. That's the bear month, that's the big one: that's what I call the black swan in housing in the city of New, York, okay and so I think that we should not take into account these other considerations that are very important but they're, not our work. Our work is housing and in the community and the city of New York, it's Nigel because Nitra is most vulnerable. I have a much more cynical view of the politics of nature than a lot of people, even people who are suffering you know, I know these pastors and I know what they I know. What plan and I'm a realist so I know what the real estate interests, how it looks at nature, okay and, of course, I'm on the wrong side of real estate. Always but I think that we mustn't be, we mustn't, lose sight of what were charged to do. That's my comment on that. I have another comment on the response to in your median the DNS memo you sent out. I made a comment of what I would like to add with respect to another sector, the mitchell-lama which I know a lot about, but it's I'd like to stay on the night, Racine yeah, let's hold on for a second I, just want to say a few things just for like run of meeting I understand. There are some nature. Tv presidents watching I would love to hear from them. I just first want us to sort of establish what our scope is right now of like what we're looking to drill down on and then I want to get input. I just don't know if it'll be constructive. If we just like all start speaking without knowing what we're working towards and just again to assert my initial question, it's sort of do we want to focus on like a larger scale, asks or smaller asks that are more specific to our district, so just again to pose that and I want to hear what people to say about it and I think Jeannette I did you you've wanted to speak front, you ahead and then Roberta yeah I would, from my experience of district need. Statements are a little bit of a procedure that city agencies and Ownby have to go through, but the easiest thing is when a community board gives a big rambling discussion, and the agency's response can be okay. Talk to this guy talk to that guy, okay, we're in agreement, but we don't have funds for that right now, I'd, like the way that we wrote everything last year, but I think within that we should have a specific, discreet, ask and I would just say the plate. Douglass playground I've put that on in the last three or four years and got criticized a lot because I'm not I am usually not in parks, meetings and parks has its lists of things and I bring it up and people see it as a parks item. However, if you talk, if you look at nitrile properties, how they originally were developed and I, don't know about I'd, be curious, II hear from the Nitra presidents here, but I know, for instance, and the ones and Queens they constantly talk about the surroundings and no longer having tweeny centers and the playgrounds being run down and sashed. The Douglass playground for the past 20 years has not really been renovated, other than cool well, other playgrounds have been renovated more than once and I think if our community board is going to put it its money where its mouth isn't saying that we're looking at a fair, equitable approach to improving our public environment. That back playground should be number one on our list, but that doesn't necessarily mean it has to be a housing item. But I do think it does relate to housing. But I would argue that we have our preamble as we had last year, but we really try to focus on one or two key items for capital and one or two key items for operational thanks, Greta, okay, tonight, I think. Procedurally, the Housing Committee should ask should send a recommendation to park any that particular playground is our number one priority and that we'd like parks to consider that, because I think they're always upset that Outsiders coming in suggest. That would be my first suggestion. The second thing, I wanted to say is housing. Affordable housing has always been our number one issue since I've been back home and I think we should amble. Astor was great and I agree. We should pick one or two things that we feel could be funded, but I. Think part of our DMS goes to the city agency. Part of it goes up and is read by the community and is a guiding principle for us in our actions throughout the year. So I think we have to focus on both of those okay. Any other kind of overarching thoughts before I would like to drill down on like the nature budget priorities. Piece of it and hearing I'm sorry go ahead, I read it the playgrounds need to be restored or rebuild, or whatever the wording you want to use. But mr. Kovic 19 not just looking to increase revenues, then I, don't I'm, not gonna speak for them, but I just feel they they're not interested in and rebuilding on, making Douglas prettier. If you will for lack of a better word, they looking to generate funds and I think what we need to focus on I mean not about the DNS, but I think we need to focus on what NYCHA is going to do, because whatever we decide and I guarantee this by dealing with nature, doesn't matter so I think we're gonna find something like Robert was saying. We have to find something more concrete, more meat on the table in order for him to listen to us, but until then we need to have something that they don't care anything about the playground. We got a quarter billion dollars where the dates from what is that mark help me here was the participatory budgeting. They got that money and spent it for something else. So what I'm saying is we have to pin them down or they haven't even made any plans. Yet we don't even know what the budget is for New, York, State, yet or New York City, so to target playgrounds. We have to see where the monies lie. We just can't go blindly into saying they. We need them to do this, or do that. So we have to figure out what we can do right now. I think that's most important. Okay, I like to add something to the conversation. This is Polly Spain speaking, okay. So basically, the mayor has allocated 150 million dollars right for broadband expansion within nature developments throughout New, York City. So that's something that I feel should be referred to an a DNS statement in addition to that, I just put a comment in the chat up about the 14 million dollars. That HPD is holding okay and I. Do feel that part of that statement should include a statement that money should be allocated to the nature development C on the Upper West Side, to improve conditions as clause capital, because well as the former chair of the Housing Committee, we always spoke about repairs all the time we always focus at cetera, but whatever happens downtown with the agencies. Nothing has ever came to fruition. Now it's an opportune time because the money is available through the mayor's office and because of the money that collegiate had allocated back in 2015 for affordable housing and most of that money went to wish fish. So I do not understand why none of that money was allocated to any of the nights to developments here on the Upper West Side. So I like to see something to that effect in the DNS statement. Yeah mark. Can you just speak to the status of the money? For a second sure- and some of this is to be followed up Don for sure, but the collegiate money was as I understand it- to build or preserve, meaning to retain affordable housing that would otherwise become market rate and there's no threat or no proposal to turn NYCHA housing into market rate housing such that money would qualify. So while I love the idea of taking any or all of that money and using it productively, especially productively in our district I, don't know that as currently configured that it would qualify now nothing's to say that we couldn't request that the conditions that are attached to that funding be changed. I'm, not certain. If there is a procedure to do that, I don't know if Roberta has ever considered that or talked to anybody about that, but I. My initial inquiry into this was that NYCHA doesn't qualify because it's not either currently or potentially market rate housing. I can I like to intervene because there's a building down the block. For me that is federally subsidized. It's not market rate housing call independent house, that's managed by wish fish now. So if they we are federally funded, so there's getting to the same funding stream as NYCHA, so they qualify and their fellow refunded entity, then we should be able to qualify so I'm glad to look into it Polly. The issue, though, is that independence house is not the recipient as I understand it of that collegiate money. It's the 108 street development, which is senior supportive housing anyway. Sorry Roberta go ahead, though. The collegiate money was how to build a certain number of affordable units and at the time that swamp was made from to put the collegiate public in into the last building of every side south, because it was a school they weren't going to build, affordable housing and had to be no affordable house and go for new, affordable housing. So a deal was made with agreement of cb7 that the restrictive decks or Riverside South could be amended. Collegiate could put 50 million dollars into a fund that would go for new, affordable housing. It's not supposed to be existing house. It was supposed to be new, affordable housing, and so we have to go back and look at the dad could see what their sorry hold on. Okay, I don't want to invalidate this discussion because it is very important, but it is also a bit apart from what our goal is here tonight, which is to nail down our budget priorities and I to the second piece of our agenda tonight: I'm very open to making this a whole meeting like in September I. Think that could be a great use of our time. Our you know delving into more but again, I do want to listen. We'd also have to do research. I totally acknowledge that agree. Sorry, I cut you off okay, Roberta's much more first in this than I. Think any of the rest of us but I, remember having a conversation with any number of people before I had any involvement with a hundred a screen and that and not any involved coming after 108th Street, but the original building that was supposed to go where collegiate was supposed to go was supposed to be a seniors building and that's what was lost and there was no site for it. So the intent was to replace that senior building, which was really intended as correct me. If I'm right Roberto was, it was intended to have a supportive element, no yeah, okay, I, don't think it's I, don't think it's baked into okay. I want to hear from some people who are heroes, attendees, Cynthia and Carmen. When we start with Carmen, are you doing? Oh yeah? You know we've been working very hard with now because of the money that's being allocated. I have been working diligently with community engagement, the DA's office 24 preset to bring in a lot of to bring in a lot of not only revenue for programs in here. The problem we're seeing is that we have, even though we have the community space over they of that school DOT list most of our children and most of our people have no access to that. Who is that I really believe of community board? Seven really wants to buy interest. You should invite the TAS to the table so that we can give you firsthand what it is that we really need where the ones on the ground, the ones that know what we need and we have renovated the park that we have been an awkward and a half billion dollars and we had our Park renovated in the front. Okay, it's been a long time, but I bought a half billion dollars and had it made, and so while we do need these parks redone, they open these parks not so long ago. While it was closed for culvert, but they didn't know cleaning, they didn't know sanitizing in any of these parts that are open. At this point. That's the problem: that's what really what we really need to be looking at opening the parks for these kids and we got cold all over the place, but you cannot sanitize the parts. So there are a lot of issues that are going on that we really need to look at what I am asking. You is that if you guys can have an open policy for the tennis to sit down with you when you are making these type of decisions, because most of us are hands-on all day long and it's only right if people are making decisions for our developments, we need to be there a great Carmen. You know I'm happy to work with mark to make a more formalized structure where we have some kind of periodic meeting, I'm happy for you guys to join every Housing, Committee meeting I'm. You know whatever we think is the best format. But of course you know, your voices are important because you represent so many of our constituents. I mean you totally run 4,000 residents and plus, because you know I'm one that whenever any development caused me alcohol, so we are all working together and it's only right that we sit at that table and be respected as such, because we're the ones on the ground and anything that hits Douglas hits to me. I've had two deaths so far, two deaths. He got two grieving parents here two sets. This is a lot going on. I have the Crips I have I, have the Crips and I have the Bloods? Okay, people are hurting, our children are dying. There's so much more to this, then you can see. That's why I'm asking you make sure you have an open policy for the TA presidents. Madeline does not support us. Let me let you know that right now, I don't want anyone else left on this beat for us. She does it. She won't come and join us. She won't come and help her neighbor I've asked her. Nothing is personal, so you need to make sure please there is a board here that works include us. Okay, we will do our best to include you. Hurt Oh rephrase that we will include you, but please, let's not bring any personal, animus -, no I'm, just letting you know what the reality is and that's the reality. Thank you. I want to reinforce what Melissa said, there's a lot of good work that needs to get done, and so, let's focus on the right path forward. Please that's great and I see that there are others of your colleagues and other TAS that are here and perhaps we can hear from them as well. There's plenty to do and it sounds like Melissa and Louisa are working toward a very sensible approach. The only other thing I want, while I've interrupted the only other thing I want to make sure I say is that there was a couple of references to decisions being made and sadly Community Board 7 doesn't make decisions. We make recommendations. I am delighted to have our recommendations, be well informed by those folks who all everybody who has a stake in this and I think we all have a stake in this to make sure that all of our neighbors are well treated and well prepared for so let's move forward on that basis and I will now stop interrupting and give it back to the co-chairs of the committee Cynthia. Did you want to I think you were raising your hand or the chance race? Can you hear me yeah all right? First of all, thank you. The reason why we have so many presidents on tonight is that I have been working with mark to try to get our presidents involved. We have felt slighted by CB 7. We have felt that you don't listen to our voices and, yes, we are hands on. We are round 24/7 seven days a week. Nobody knows our developments like we do and while you make Resident recommendations, you have going on at wise towers currently during Kovac, which should not be happening. Nobody has asked any resident at wise towers. What are they going through during cope during renovations? At wise, you have not reached out to the TA president Ernesto Cabrera at wise. Tell us that's Kim. What have they been dealt with? They have been harassed. They have had the new management knock on doors and try to force residents into signing new leases during co. Vid, there's a lot going on that CB 7 is not aware of so, while you say you make recommendations before you make them, you need to hear both sides of the point, because there is a lot going on and we do want to be involved. We do want to be heard. We do want it. What if it's on a zoom meeting or at the table, we do want to let you know exactly what we've been doing. There's a lot of possible things. We do. We feed our tenants all the time we give out sanitizers all the time and while I am guarded as to say what I want a CB. Seven should not be reprimanding me on the phone or be permitted to reprimand me on who I should give my sanitizers to. Since you don't want us talking about your board members, your board members have no right interfering with my work so where there's two sides to each of it and if you're unaware of it mark knows what I'm talking about all right. You've had a housing night of task force for years now, and you don't even have the database where you know every single president. In every development there are 45 things alone twice. There are eight presidents, nobody overboard, who knows all eight of us or our emails or our phone numbers as the chairwoman of the task force that should have been done years ago, Madeleine years ago. So you need to work together with us. We're stronger in numbers, then separating us stop isolating us start working with us, I hear you I appreciate the feedback and I think there's some really helpful, concrete stuff. We can be doing on that note, like you, said, making sure we're in more constant contact with the TA leaders, because sure we know all them. You know I definitely feel like that's something. I have not done well. I have only met. You know a few of the leaders so far and appreciate that feedback and to you know bring us back to our first question and request sorry I'm hearing an echo. Are there any things in your I'm going to meet everyone rooms renovated and we've done that without any help from CSUN? Okay? So, while you're deciding what to do with money, we've already had money allocated to having our community rooms we've had floods in them, we've had floors, collapse, ceilings collapse in our community rooms, and we have been working with our elected official and the heads at night Chuck to get our rooms renovated and without asking anyone for a penny just again to I guess to clarify in the district need statement about your priorities. You know we don't have any money to allocate ourselves. It's just how we basically tell the city agencies what we think they need to prioritize in our district and also they can be used as a tool to push elected officials occasionally to also help fund things without what, with whatever discretionary funding, they have parry be funny with the funds when they get designated to playgrounds. For instance, wise towers was designated I. Think it's 2018. Well, the money actually doesn't happen that year it happens years down the line. Now that wise towers is going through Pat the money that was allocated for playgrounds. Mr. Cabrera has asked repeatedly what's gonna happen to that money, because now that you have PAC coming in and they're redoing the playgrounds, what happened to the money that was allocated to the playgrounds for wise towers? No one has an answer to that. So we very helpful bb7 wrote a letter to Helen asking her. What's going to happen to the previous money that was allocated for playgrounds, which now is at a stalemate, because they're going through the pat prob progress and money from HUD is being allocated for new playgrounds, I'm happy to do that- or at least maybe even just speak to Helen about it without a letter and then decide if that's the best way to get a response from nature. Okay, in terms of wise towers, if you had to name some capital neat, I, guess I, don't know with packed going on it's harder to think through like how to add something to our budget priorities. So I'll ask more broadly to tenants and tenant leaders on the call. If there are concrete things in the development that you think could be improved, we would love to just have anyone jump in and provide some 30 cameras? We need all cameras up and functioning. The majority of the developments already have cameras, but the problem is and when we have, we had a shooting just the other day, when you asked NYCHA to go to the campus and pull up the footage management won't pull up the footage, and in the beginning, when the federal-aid made the concessions and the agreements with these cameras, one of the agreement is that the first thing every morning, Nitra management, would pull up the cameras and review them, and they have not done that since that agreement was made. So is the problem of the cameras are not working or that the footage is not reviewed or is it they're not reviewed they're, not suitable people get attacked in the elevators, people are getting shot outside and there's no accountability from the management office to review the cameras. They claim they're too busy to wind back footage. Well, the agreement was made. Polly knows the exact date that the agreement was made with the federal aid that they all decided. Cameras would be refused every morning and it has not happened where that happened in 2014. Another thing is the entrance doors cause. They only did half inches snores, especially here in Douglas, and so we would like that a debt are allocated to the rest of the doors, the entrance doors that need to be put up, because crime is rapid right. We have a lot of crime between different developments. Now we have Pleasant Avenue coming down this way, which is you know, it's development against development, and so, in order for my seniors to be safe, we need to finish the rest of the doors and get them done. So is it that some of the buildings didn't have their doors done, or they were done anything out of money? Okay, so some buildings were never done. Is that right? Okay, that's helpful, and definitely something that's something we can ask for easily yeah I got it correctly, guys I'm, making a couple of notes here myself. -. Are these the front doors downstairs like the main entrance yeah? Okay, thanks? Yes, very good -! Oh, it's not easy for them to process. I just want to interject, because the West Surrey building site, a B and C also are in need of new front entrances as well all of the night again sites here on the Upper West Side need capital renovation of their front entrances and security. Sorry, which buildings were those again. What service site a B and C I can give you the addresses. Okay, that would be great and I would assume if you need an ask for it, yeah well, yeah, exactly so, probably we'll get together and move okay, any other attendees. If anyone else has something that they would like to put forward specifically on the NYCHA section of the DNS and district needs statement, you can indicate by raising your little digital blue hand. I was checking the chat. If there's anything, we need to it's a quick question Melissa if I may yeah, just because I'm also showing this and wise towers we're talking the hardware. The cameras are functioning, but the tapes are not being reviewed, correct, okay, so there's no its wife's towers. Five 89201 West 93rd 74 West, 92nd, 54, West, 94th, Street, 112 s 95, all so there, so we're not looking to for capital to install or repair cameras. It's the reviewing of the tapes and I'm assuming that PSA or NYPD have an incident. They get access, but the management is not reviewing it. Definitely as they promised all right and then the second part are the front doors you're saying that they are swinging open. There's, no security, they're just open! Are you open? Yes, they're constantly being vandalized? Most of the doors are old they're over 20 years of age. So really you know there's no real security. That can be jammed constantly, even with the doors they're constantly vandalized all the time. So you know that needs to be addressed with capital funds, okay, to put and secure entry doors to the building's if the doors at the front are unsecure. That sounds like an emergent issue, not even just the right of habitability and the warranty of the right Avot ability everything else. You have open doors. That sounds like that's, not even a DNS statement. That's an emergency that has to be fixed yeah, but it's a DNS because they're constantly broken and vandalized and all right there's no response to repair them. They're supposed to be repaired within 24 hours, they're, not being repaired. Understood may I interject for a second, especially on these doors, because we have a lot of the problems with the entrance doors also, but the vandalism that's happening even with the new doors. That's why I'm surprised that simply can't get that footage, because when something is broken, I go to the cameras I make sure that my manager pulls that up the trick to this is you have to remember. You have to find out from what time to what time that door was vandalized, go to management extra acts for that footage, and you only you and the manager can see that footage, and then we call them I mean for me. I can't talk about anybody else. We're talking about me. Unfortunately, why's the manage not communicate with the president's why's is being used as a stepping stone for promotions. We have gone through six milliliters in two years: six superintendents in two years for assistant superintendents in two years. This is the stepping stone promotion. Everybody comes in with an agenda and nobody wants to listen to us. We have told them that when they leave, we still stay here with the same existing problems that we've had for decades, because nobody wants to address them and, like I said when Polly said in 2014, it was read upon that every morning they would go through the footage. Nobody has a hear to that rule since 2014 and they blatantly ignore us blatantly. Every time I write a letter. I have to go all the way up. The chain to the general manager. Vito must have to know before I get a response, because management feels that we are beneath them and they don't have to answer to us, and it's not just me. It's also, president - I have a question. Since this is a district need statement. Are we requesting capital dollars to fix the doors or and I believe we did this a couple years ago? We occluded it, or should we instead be requesting operational funds to have like doormen there, something that helps prevent these doors from being constantly broken? I will be good because the money that is spending I'm, giving these doors fixed over and over is horrible, so it leaves it leaves us - and you're, taking away money that we can use for something else. Instead of fixing these doors over and over and over, that makes no sense. You I like exactly what you said Anna you should do that I mean we can both I think it's you know. Obviously it does require cash world actually fix I, don't know like I, don't know if having more security staff would address the camera problem. - I don't know if it's just like their stops: fine, they just don't do their jobs or maybe it's both, but we could definitely think about putting in an expense for the personnel. Sorry I would just add to that, though. I would just add to that instead of approaching. This is just a security issue. You know the right thing might be more to have like a doorman service there of these buildings, rather than some security cameras and punitive way yeah. My understanding is that people forget their keys or their letting somebody in who doesn't have a key and they're. Not you know they're forcing the door open after it's been fixed, so it might be nice to take a new approach to this and not just be oh, it's a security issue. It needs more security, I mean I. Think security cameras are good, but it might be nice to approach it where it's not just. Oh, we need to punish those who are breaking the doors down. Okay, so like front entrance coverage, we could say something: yes, that is yeah. You know I, agree that everybody's there to help people yeah so I saw someone in the chat mention elevators I'm, assuming that's so I Robert one second I just want to hear from anyone on the call who wants to speak to any buildings in particular that have elevators or constantly broken, and if we could get an address and we could include it as a capital item well, elevators are always being vandalized. I tell you the truth. I really think they love the overtime I, believe they fixed it for it an hour - and they have to come back. That's those! That's just me, though, right because I'm for you to come and fix an elevator today, and it's broken four hours later to me is a gimmick right and so that's what's really happening with the elevators. These new elevators that we have a harder are harder, a little hard and lives. But if you, if you keep the door open it automatically shuts down, so then it a lot because these are new, of course, is on this timer and everything is digital. So if they hold the door open like they just hold it open, it will shut down. I mean that's a bad elevator design issue. I definitely need shut down. I, don't know what to say. There was sorry Robert you wanted to speak and I also see Marc Victor wants to speak. Although Paulie I don't see him, no one can see him or hear him so I'm asking him. If he's on video yeah I know I, don't see him either he's not on my list of attendees or panelists. It's a different name, I'll find out. Okay thanks! Let me know me well go ahead: Robert, yeah, sorry! This would yeah. This would be a reasonable ask. I think, and we should know that one of the trends in private housing is what we call virtual. Oh you're, saying the door attendant or coverage idea virtual, but you see what one of the points that party was making and that was made doing the meeting with the our PA for a long time like. Can you guys hear him? No Robert, you froze. We can't hear you what we can return to what he unfreezes and yeah Victor's saying he could see and hear us, but we can't see or hear him and he's on the on the is he watching on YouTube instead of on zoom, that might be okay, no Robert Saul. Okay, the question seems to me is: what ideas do people have to stop? The vandalism of elevators I mean we can talk about it. We've been talking about it forever, but I'm not sure what to do, and even if we do, we have security cameras in there. Do people look at their men and what are they? Even if they see somebody what happens well. I, look at footage all the time. I don't know if there's some, if there's some, because we have cameras in our elevators. So if there's something that happens in the elevator or something with the elevator I make sure I go down to watch that footage to see from what. If I have the right time, you know the timing, it was not the repairs. No, actually the problem is our resident residents. Actually, residents hold it and once they hold, it will lock, and you can't do that. These are no different elevators. These are not the old elevators. They will shut down in a minute and so I've been I've, been putting out a lot of fliers telling them to stop holding the elevators. It's gotten a lot better for us Douglas when it comes to the elevator. Actually they do break down, and so they do come and fix them in the number. Just because everybody calls me so no come, but as far as vandalism, no, they just hold up. They just hold it and because it's on a timer or whichever way they have it right, it automatically will shut down. Okay. What can we do about this? I'm not sure talk to the managers of each development and have you know, have the footage, my signal you can tell who's doing I say no drop so that I lose my place, yeah virtual doorman and then yes, my signal, and that is the trend, and that is very manageable. And it's in perfectly until the desire that we have heard from nature leaders to have local management of their of their developments. It is a it is an ask. We can ask for start-up funds to get this sort of thing going. We might even start with an experimental site, whichever one the leaders decide would be the best place to set this sort of thing up, because there's the installation process and all of that- and it is very successful in private housing. I know Doug you're, mostly commercial, but in the housing that I've been doing, and it's of course it's the higher end now. But it is the trend where it stops. It starts at the top and it and it proves itself and it's very efficient, and it might be easier to ask for this sort of support than to ask for personnel support. The thing with this support is that it's really reliable because you can have a relay if Cynthia is not available, Polly's available. If Polly's not available had a unit is available, they all have access to you don't even have to lose. You don't even have to leave your apartment, a man that would be an ask that is perfectly doable I, don't know what the cost is. It is it? Well, it's not a prohibitive course. Given the way you would balance it, the cost and the benefits in the whole thing. So that's my comment on the security and I think that it's doing things as usual: it's only gonna. It's not going to improve anything. We have to go a different way and this is a different way. One other note if I may and then I'm - we're talking about that 40 million being held by HPD or Niger. It's not an ask, but it's something that we could help Helen out of HPD for nature in this district and we're talking about Amsterdam, Douglas Weiss, you know massive units and that 14 million dollars, if it belongs to my tree, belongs to my trousseau. Then you know we could we could help. We could help I think extract that out of HPD I. Let's again, I want to table this until we're all more informed and I also want it to be an open debate over what the right thing to do is in terms of honoring a previous agreement and what you know we see as important projects in our community and not just you know, come in with the solution. That's beginning, the meeting I want to actually discuss the funding. But again, let's talk about it in September, okay, yeah, sorry and I wanted to speak on that Sharon Austin wrote, she's a Douglas, House resident. She didn't think it's realistic to have a doorman that it could actually make things worse. It's sometimes it's existing residents and their family members that create part of the problem and putting a physical erm. An additional and unnecessary risks, so I actually thought that sort of shored up your argument for a virtual doorman. What the unit's saying is, of course, exactly the figure of speech if we have crossing grips, if we have Bloods and Cripps in the house, I don't want to put a doorman there, really don't actually Robert I wanted to loop. Piggyback off of that, because occupy nature is looking into resident management. We are incorporated and we are definitely looking into resident management. It's something that we should do and it's something that in our regulation says we can and so we're working very hard on that been with the CEO and veto message. Oh well, we would love to hear more about, but both the concept and if any plans for management you, the prints will work and some paperwork. So you can see what we do. It's different developments from Queens the east side we've got. We've got a total of maybe ten presidents that are actually on board and so we're just getting the paperwork final and making sure we have all our tea and eyes done. But it's something that we've been talking about now for a year, so we are definitely do occupy nature. We have about ten so far that want to resident management. Okay, so I, just wanna I'm talking about virtual doorman. We put it in the federal eight back in 2011, we put in a virtual doorman system in partnership with a company called digital divide. That's why I mentioned 150 million dollar broadband that the city is allocated to NYCHA residents, so we were one of the first locations in Manhattan, along with the support of Gale Brewer when she was a City Councilwoman to get funding so that we could put in our own virtual doorman system. Okay, at that time it was $5,000 all right. So since 2011 we've had a system, but of course we need funding for that. So we want to mention that in the DNS statement, that would be great that we need more funding to expand the virtual program that was already implemented in 2011. We are able to see on our phone any kind of digital device. You know who's entering coming into the building. Okay, it doesn't cost ten thousand a hundred thousand dollars. There was five thousand dollars. You have a whole website. If you want to go to our website federal, a tour okay and you can see what the thing is. We need funding and that's what we lack. So if you can put that in the DNS statement, you know that would be great to expand our virtual program that we already have in place where we actually certified residents to maintain and all their own system. So it's not a concept, that's foreign to us, but we just don't have funding on a regular basis to continue to support it. You know I myself have taken money and other ta presences were out of our own pockets to keep the system up and running. That's what we do as CA. President I mean that's really helpful, to have a concrete example that we can say expand on some nebulous idea to return to some other district need priorities or budget priorities in terms of kovat and safety and food security. Are there still gaps in like what is being provided versus? What is actually needed? Is there anything you could think of that we could be helpful and requesting that could help the developments prepare for in case things get really bad again or continue to be bad if, since they are sort of still very bad on night campuses in terms of kovin my opinion, as you definitely need to focus on sanitization and cleaning, that is an area. That's always lacking and that's very important. You know in light of Kovach I know we mentioned early, especially Cynthia with the brownstones I do not have elevators, they have stairs where there isn't any cleaning going on, so money does need to be allocated so hire individuals. You know and I would like to see residents being hired to clean their own locations. To me, that makes more sense because they know the buildings and they know the sites instead of bringing an outside entity that doesn't live there and that doesn't care. I would like to see money allocated for some kind of program, especially for the youth all right to be engaged, whereupon this way they can clean their own buildings after they've, gotten training, of course, but I do feel that that's a direction that we should go in I like that, any other thoughts on what it means as the president of the brownstones and because we have to walk up. We have had to rely on Alliance company to come and do our handrails, which of course they do not do so. We have already been cleaning our buildings on our own. We have already been cleaning our floors on our own arm. Thankfully, Goddard was grateful enough to give me their youth workers because they were not laying them off. They were keeping them on staff and they linked them out to me will help me go door to door and give sanitizers and masks and gloves to all my residents. So there is you know many ways we can implement. The youth Goddard is one of them. Okay. Well, we could get our kit guys up in teams to clean our own floors. Nycha workers have not mocked any of the buildings in formals. None of our building has been mocked by a nitrous staff in over four months. Don't do it. They don't get done. Sorry mark mentioned this. A little while ago is Larry. Wood is still here. I want to also give him a chance to weigh in I, don't know: Larry I'll unmute, you, if you have anything to add to the discussion here on budget Nitra, specifically affordable housing. Thank you. Can you hear me? Oh, thank you guys, nice to see everyone by the way. Actually, it's interesting starting back in December January god had started facilitating meetings of the federal eight, so it's been really interesting meeting with my neighbors and folks, I've known for many years in some respects and the work that they've done to really help organize themselves. In that regard, we were talking about the cameras and also their ability to access to footage, because this issue about alliance and the adequacy of the cleaning has repeatedly come up and being able to pull the footage to see if the work is actually being done would be very helpful. I understood from what Cynthia has told me in the past, management's supposed to check the cameras to see the difunctional not necessarily to go through every. You know many of the footage to see if something happens, but to make sure the cameras have been actually recording appropriately. So if they're needed to monitor cleaning or to monitor a door being broken or vandalism or a crime, you know it. We know that they're actually functioning and then the police would have access to them when appropriate. So just continuing to hear from the neighbors here from the Nitro residents, their needs is so critical. I'm glad you put that out there Melissa I know the intent. Is there it's just a willingness and creating the space to get that concrete feedback on an ongoing basis. Great group of leaders supporting one another and with the privatization changes through the rad conversions are going on. It's just one need for communication, and then one thing I just want to close with. It is a huge undercount right now in the census and if you're looking. This is track and beat Rick Tilly the census track that contained the Nitra housing. We have a big under count and that's a huge problem for funding and for political power down the road. So that's something we have to work on between now and October 31st when the census wraps up. So thank you for the opportunity to add. Okay, if any other attendees have something that they want us to add into the district needs a when we haven't touched on again, you can raise your hand, we're always happy to hear from you guys, I guess beyond nature. Are there other housing things we want to make sure we touch on? Someone mentioned eviction assistance early on I. My concern with that is that it's like one of those really big nebulous big-ticket items. So I don't want to it's I. Guess that's my opinion that maybe it's not worth, including cuz, it's like too big, but would love other people's input on whether some kind of addiction prevention assistance, whether it's kind of like a one-shot deal thing or rental assistance. If it's something we'd want to include okay, my worry about this is that this is for 2022, yes and I. Guess the mixture problem would still be here, but we really have to consider that this is really long-term request and we should have separate them out from what we need to do now and what we do now in terms of evictions, etc is maybe the solutions are passing, then we could still have evictions for long term because we're so good at the problem. But we should be aware that the DNS is really two years in the future. That's a good point and I do think. Also you kind of bring up another point, which is that there may be other vehicles to say that that's a priority for us as well. You know, is it a resolution that calls on state electives or federal elected it just doesn't necessarily have to be the DNS cuz, the money for it, probably not coming from the city. So again, that's my two cents, but if other committee members feel differently, so what we're looking for right now is somewhat long term projects to put into the hopper the I'm sorry to interrupt but they're effectively. Our two district needs budget priority options, so you can ask for capital projects on one list and expense items on another list and then just while I have the floor for a second. Many of the things that have been discussed tonight are things that very much are appropriate for our consider duration as budget priorities, but it is a system-wide issue and in some of the forums that we have conducted, we've learned that there is perhaps as much as forty billion dollars in deferred maintenance and other unattended to capital needs, and that is you know that this is very much a part of that. But it is it's tricky to figure out how to get the needs of one development met when the whole system is down in a hole that big yeah. That's you know the I'm fortunate truth, it's sort of like an overwhelming and awful truth. So I guess my thinking was like. Let's focus on you know smaller capital projects in our community district that maybe we could get funding to, but it's a valid point, no just a reality in this age of coded daycare, centers and senior centers, and because this is where people get food, seniors get food and they get some kind of quality of life support. And, of course everybody needs to take care, centers and but I think other committees are going to discuss that I. Think about that. Preventing evictions prevents poverty, so I think if you know that might be something we want to look at I, don't know that we can put it the DNS, but it might be something you little and that not only do you need to help the people that might be evicted. You also have the landlords who are family by people not being able to pay their rent and I'm right and I. Think some for a second especially comes to the senior the Senior Center I think it was the biggest mistake, taking senior centers away from presidents and giving it to swish fish most of my own residence. My senior that right here in a 68, they don't get. What they need here and they're constantly asking me to take over is the essential. It's not the same for the people in Douglas when wish fish is on a hunt, sick, Street and don't get me wrong. Nikki is beautiful. She does her job I have nothing against I'm. Only speaking for the seniors in my development, I find it number one very hard to get [ __ ] to be number two when they have a Senior Center right here now, and it's not me appropriately run right and this for someone checking do about, they should have left my Senior Center right under the TA president. So there's something that really needs we look at I will be talking to somebody about how it's being run and it's most of the time you know I'm being actually help which fish is calling me to help them out. So what's the sense of me help being not as well just give me my Senior Center back I, think you bring up a good point. Maybe there's some room for collaboration with you know our Health and Human Services, Committee and but the tenant leaders said, look at the social services being provided on site and sort of like what are the gaps and what are the management issues? I think that could be something we definitely look at this year: yeah, okay, Oh, open it before again, one last time and say any other housing items, Nitra or otherwise that anyone in attendance committee, non-committee, attendees public ta presidents wants us to consider, including please speak up. This is Louisa I've lost. My picture I would like to bring up something that we've had previously, but it is about training residents of nightshirt to do repairs and have an apprentice program and we've had it in the DNS before, but I think that it would be very valuable if we could actually get something like that so program funding, or is it more like a DNS item? Actually, community engagement is doing that with the reef program. The what program the risk program resident engagement does one of that they are actually I know they took it from me, because I thought I would meet with them. Next thing you know when I mentioned, did they had it up too, which is solar paneling? That I was looking into making, you know doing some classes on it and they do have the OSHA classrooms. Now. Listen, it's no longer there. Any public support, so movies has a lot of programs that they're, initiating and other people have to do- is reach out and do okay, all right. So one thing I want to talk about. Is recycling initiative? Okay, that's something that can be put into the DNS statement, because it's important you know again because of the cold vid, but prides of codes that we still have problems with garbage and rats etc. So I would like to see something you know discuss or put into the statement so that money could be set aside to improve recycling, because a lot of the garbage cans and trash cans really do not accommodate recycling. I know for the brownstones Cynthia. You know. Definitely they need to change the trash disposal cycle. Well, I was that they're using because they're not large enough like to see the large bins that kind of close from the top there, like a rectangular shape in their large right now, they're just using these plastic traditional garbage cans and rats are all over the place getting into them. So we need something more secure and also, you know doing the recycling as well. So we talked about that before at the different locations, but nothing has happened so on that yeah. One of the things that I would think that we would want to advocate for as a holistic answer to. This is not just recycling like bottles and cans, which is of course important, but what they, what the Department of Sanitation refers to as organics recycling, and what I call composting yeah, which is taking organic material out of the hard waste stream, which does a couple of things not the least of which is isolates, and if we do it correctly puts into a proper bin. Then you're absolutely correct that there are different kinds of bins so that, when you put hard trash out on the street which, let's face it, nature has never been to particularly good at doing and doing in a safe way. You're not putting organics out so that when you put the trash out the night before you're, not feeding a street full of rats. The this comes up actually, oddly enough in the parks committee, because the rats live in the park, but they eat on the side streets and so the cutting of the funding. For what I call composting is actually a curbside. Organic recycling want to be part of what I understand you to be advocating for, because, if we simply just improve the container, we will continue to attract the rats. They'll just make it'll make their lives a little harder I'm all for that, but why not go all the way to a solution that would put them in a difference of different place. It is by the way, a district wide issue and not just a nature, but considering the issues that NYCHA has with getting trash to the street in a responsible way, it would be a smart thing to highlight in the housing as well as in the environmental side of our DNS. This is a much bigger discussion here than house and I'm, not sure where it belongs, because how we handle our waste stream. It has many problems, and maybe there's a committee or group of committees that we could talk about it, because you also have a problem when they do the organics up until a few months ago, is one day a week, so that basically you're shifting all the organics now inside the buildings where people lived so that didn't work very well either, and there was all sorts of new collections of clothing. They do collections of electronics. With that only work, they only run that in very large buildings. So there's a whole other issue here. Maybe a future meeting this to have sanitation, come and explain their recycling programs to us when they're fully functioning because they're a bunch of them that we don't know about that, would really help everybody and not just this group of housing or that group of housing, but really housing in general market down to the fall agree. It's a bigger issue, happy to think through, like a collaborative committee arrangement, to explore it further for the purpose of the DNS and district and budget queries. I think it could be like a more universal ask that, like multiple committees- okay, yeah, but that yeah, it's important, don't compost thing yeah, we can put it over. You can see like prioritize nature, for the implementation. That would be great because I'm starting a new garden that would be awesome. Okay, certainly, the brownstones are a really good place to try out more innovative ideas on things like clothing recycling, electronics, recycling, because you can also talk about repurposing rather than recycling. Repurposing is actually a preferable option to recycling. Sorry I'm, just gonna reply to Larry. He just said something in the chat to return to the like to be over whether we should be saying something about like rental assistance in eviction crunch and assistance, Larry points out, there's a number of new bills in Albany to cancel rent or one shots to pay arrears. You rent, subsidy programs uses well in Lourdes, and a resolution to support would be helpful. Also Congress hasn't moved the five hundred billion dollar stimulus bill relief, piece of the bill. I again, I am fine. Adding this to our list come fall. We had someone speak to us about the canceled rent campaign I think last month and I was honestly not convinced fully that, like the implementation was sort of worked through, but I think it is something that we should revisit and not just you know have heard about once and leave by the wayside. So I'm definitely game for talking about it. In September, October I said I'm, sorry, I have to go. I have another zoo meeting, I appreciate it. If you can get me if I'm help, if you need my help on any committee, I'm willing to join any committee I'm here and I want to thank you for coming to Douglas and helping us out. With your injured hand, you are a trooper before you go. One of the things that I was is one of the things that well. This is a whole nother conversation I'm. Sorry, the long story short is there are an amazing group of volunteers. All over the place and I was privileged to watch a few of them in action. The city is spending billions upon billions of dollars to put food in the hands of people who need it and that's exactly what the city should be doing. The amazing part to me is that the last step, the last 25 yards of that process involves volunteers and so I. Don't know what happens in those places where the folks have day jobs and can't be there when the truck pulls up, but it's a pretty amazing thing to see in action and so props to everybody who's involved in it and everybody who's. You know there are different ways, it's being done at different facilities, everybody up and down the district, but it is really a humbling thing to see in action. Thank you so much like right. Okay, unless there's further comments on the district needed budget statement, I'm gonna move us to agenda planning. It sounds like you got a pretty good start on that. There already huh yeah just for next steps on this I think maybe Louisa mark and I. We can like trade, an email just where we bowl it out. Everything we've heard, like all the potential needs that we heard tonight, and then we can. One of us, you or I louisa, should take her first attempt at putting it into the narrative and the format we normally used. Okay, agendas: yeah. We did sort of get a jump on that. So one of the things that we heard was the interplay between Nyjah and what I'll call the collegiate money. I think is we're all been calling. Yes, and that is a worthy agenda topic both because it's important and because we really, as Melissa said, need a bit of research and some answers from people in either elected or agency positions to tell us what the limits and opportunities are there I've just refresh every, but if you member back to when that happened, HPD was going to give us a report at one point they did give us a report at one point, but it would be a good time to have a second point: yeah, okay, and just so you know, I planted a seed with a number of folks, not the least of whom is Gale Brewer. Who also wants to make sure that money, a is spent, be spent wisely and see spent in our district, good and I think that you also want to touch base with sanity, because with respect to the collegiate money and independence house, some of that money was earmarked. That's right so that that's true the end. So you, when you may, when you sit down with sharing over with you all of this, and we are due for another report from HPD as to where the money is but we'll find out what the restrictions are on it and I'm pretty sure the job night should because its existing housing it has to be for new housing, because we were supposed to get additional. How is it we're such to get additional, affordable housing and community, not repairing an existing housing, but we will clarify for everybody yeah, so just as I had mentioned, and Larry brought up revisiting like eviction prevention in the wake of covetous okay, since this crisis is not really waning, I could add that to the list yeah waste management I'm, not sure that really comes from - housing. That's the problem. I mean again, I'm happy for us to meet up. I was like a DNS item as when it comes to like holding a meeting and asking des, and why I tend to agree that, like in terms of the how we, how we do it is not under us, but asking for it to be done better at nature, is yeah on upcoming agenda items. I think we could follow up on the point that the onus was making with respect to the senior centers, because Health and Human Services- and this is another point- I- think to collaborate as you requested, because we did address that as committee and we arranged the meeting with and Sally is the one who represented the committee in a meeting in an especial inspection by the commissioner's office nights at the mission at of the senior center at the Douglas, and they did a walkthrough and so on, and the unreasonable conclusion at least impressionistic to me was that send your seniors over to 106 tree, which has not, which was it didn't, make any sense at the time and I'm from what I'm hearing tonight. It wasn't workable anyway, so that I think that we might do a follow-up on that and in the long-term and it's I appreciate Lewis's caution that we're talking four to 2022, that we could make a statement in the short term, but also in preparation for the reacquisition of the Senior Center at Douglas, which can take a little time because there were spatial issues and the reason that we had the meeting to begin with this when Jinora Johnson was on the board and she was reporting all kinds of plumbing I mean you know just this disgusting. They were pictures everything disgusting situation at that Senior Center in the especially in the feeding area, the dining area, and that you know it was uninhabitable or unoccupied. But yet that's what the seniors had and that's a sheer insanity. So I, don't think we have to tolerate that. We can have plenty of say on that and I think that for someone I'm on Human Services as well as you know, so this is a joint committee on that particular item. So I think that I think Owen and Shelly I'm happy to do which went, meeting and mark. Let me know if it's best that I reach out to initiate that engaged interest or if you would prefer to I'm happy for you to speak directly I'm here as a resource. If you need me, there are topics that were mentioned tonight. You want to talk about it at each meeting or not get mentioned just. Let me reiterate that when I said the short-term, the immediate you requested, we could find out what the shortfall is there with respect to that Douglas City, Center, $50,000 or $100,000, whatever we can put that we can ask for that immediately and then down the line. You know because the amount of space was also initially, so we should a nice job there. I think. My only concern is that if we asked for it this year without like getting more information about like what the needs are and like what it would take to get it reopened, like NYCHA's agency response will just be. You know that is not a location and that we are operating at this time or you know to something very basic to shut it down, but no judgement. So you use your best judgment on that. I think judgment is political. Stove is a good point, I mean having to explore it and also to include it this year and next year, maybe this year, if it's expected next year, it's more realistic. Other top of mind items for discussion in November in December January is called email Hokkien. We want to see that virtual thing going. So that's a long-term project and if you had money you know, and if it's not as costly as one would think, that's to be an item that you we should work on a regular basis. That is the we can obviously pick this up again in September and do more planning. It might be easier when we're not looking right at the summer, but unless anyone else does new business, they want to discuss. I. Think I might ask us to adjourn Burt. Are you waving or moving your camera I think she's waiting goodbye? Okay, all right! Thank you. All this is really helpful, especially to all the fun in it yeah good to see them here, yeah, and if anybody has any ideas, just send them out. Yes, September, okay,.",
        "summary": "Is that mark make sure that the full board meeting that there was affordable housing going up on 79th, Street and I asked him where okay conversion, it's building on 79th Street,?\nSo I, don't know the agenda, never got posted I We wanted to look at the DNS and budget priorities one and then to talk about what we want to be doing in our committee.\nWe want to embed into both of those discussions a lot of thoughts about weaving NYCHA and the needs of residents into our work.\nYou know just based on our committee to me it would seem the needs of NYCHA, both capital and operating in our district would be a major priority and I sorry I'm just reading a message from Larry wood from that's, where a law project also suggested, like rental assistance or eviction prevention funding for people who are in rental housing in our district judge, agree.\nThey like big asks that are sort of like larger policy issues, or are they more concrete things that are actually in our district that we think we could maybe get as opposed to being more of a coalition of voices?\nJust first want us to sort of establish what our scope is right now of like what we're looking to drill down on If, we just like all start speaking without knowing what we're working towards and just again to assert my initial question.\nAnd I think if our community board is going to put it its money where its mouth isn't saying that we're looking at a fair, equitable approach to improving our public environment.\nProcedurally, the Housing Committee, should ask, should send a recommendation to park any that particular playground is our number one priority and that we'd like parks to consider that, because I think they're always upset that Outsiders coming in suggest.\nDo feel that part of that statement should include a statement that money should be allocated to the nature development C on the Upper West Side, to improve conditions as clause capital, because well as the former chair of the Housing Committee, we always spoke about repairs all the time we always focus at cetera, but whatever happens downtown with the agencies.\nOkay, I don't want to invalidate this discussion because it is very important, but it is also a bit apart from what our goal is here: tonight, which is to nail down our budget priorities and I to the second piece of our agenda, tonight: I'm, very open to making this a whole meeting like in September Sorry Much more first in this than I.\nIs that if you guys can have an open policy for the tennis to sit down with you when you are making these type of decisions, because most of us are hands-on all day long and it's only right if people are making decisions for our developments, we need to be there.\nPlease, let's not bring any personal, animus , no I want to reinforce what Melissa said , there's a lot of good work that needs to get done, and so.\nYou've had a housing night of task force for years now, and you don't even have the database where you know every single president.- So, you need to work together with us.\nWe've had floods in them, we've had floors, collapse, ceilings collapse in our community rooms, and we have been working with our elected official and the heads at night Chuck to get our rooms renovated and without asking anyone for a penny just again to I guess to clarify in the district You know, we don't have any money to allocate ourselves.\nIt's just how we basically tell the city agencies what we think they need to prioritize in our district Also, they can be used as a tool to push elected officials occasionally to also help fund things without what, With, whatever discretionary funding, they have parry be funny with the funds when they get designated to playgrounds.\nIf you had to name some capital, neat, I, guess I, don't know with packed going on It's harder to think through like how to add something to our budget.\nYou know that needs to be addressed with capital funds, okay, to put and secure entry doors to the building.\nYou know the right thing might be more to have like a doorman service there of these buildings, rather than some security cameras and punitive way.\nMy understanding is that people forget their keys or their letting somebody in who doesn't have a key You know they're forcing the door open after it's been fixed, so it might be nice to take a new approach to this and not just be Oh. It's a security, issue.\nYou know I, agree that everybody's there to help people One second I just want to hear from anyone on the call who wants to speak to any buildings in particular that have elevators or constantly broken, and if we could get an address and we could include it as a capital item.\nYou know we see as important projects in our community The meeting I want to actually discuss the funding.\nI know we mentioned early, especially Cynthia with the brownstones I do not have elevators, they have stairs where there isn't any cleaning going on, so money does need to be allocated so hire individuals.\nI would like to see money allocated for some kind of program, especially for the youth all right to be engaged, whereupon this way they can clean their own buildings after they've, gotten training, of course.\nThat's my two cents, but if other committee members feel differently, so what we're looking for right now is somewhat long term projects to put into the hopper the Our two district needs budget priority options.\nPreventing evictions prevents poverty, so I think if you know that might be something we want to look at I, don't know that we can put it the DNS, but it might be something you little and that not only do you need to help the people that might be evicted.\nRun right and The tenant leaders, said, look at the social services being provided on site And Oh, open it before again, one last time and say any other housing, items, Nitra or otherwise that anyone in attendance, committee, non-committee, attendees, public ta presidents wants us to consider, including please speak.\nSo, that's a long-term project and You had money, you know, and if it's not as costly as one would think, that's to be an item that you we should work on."
    }
}