{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCgFwgrApUvg0TVbxexo3Gtg",
            "title": "Top chat replay",
            "publishDate": "2020-10-05",
            "shortDescription": "",
            "lengthSeconds": "1:50:18"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "q8d17E4apB4",
            "fillerWordCount": {
                "uh": 324,
                "um": 256
            },
            "readTimeFullTranscript": "68 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "program": 33,
                "problem": 30,
                "sanitation": 30,
                "trash": 28,
                "street": 23,
                "rat": 21,
                "garbage": 21,
                "schools": 21,
                "rats": 20,
                "parks": 20
            },
            "wordCountSummary": {
                "sanitation": 11,
                "trash": 8,
                "street": 8,
                "food": 6,
                "waste": 6,
                "recycling": 6,
                "department": 5,
                "program": 5,
                "neighborhood": 5,
                "locations": 5
            },
            "fullTranscript": "Do not look so pensive russell. I look pensive you're in deep thought. That's right! That's right! I'm thinking about this meeting you! So it is it's a little past 6:30, but I think, let's just give it a few more minutes, as people are still filtering in here sounds great. Well, while we wait I'll give a little spiel about how these meetings are conducted, while we're doing the them via zoom the for a few people. I see that I do not think I've seen at our meetings before we have everybody, muted and you're, not able to unmute yourself the way that you'll get the attention of russell and cause the co- chairs. Whenever it comes time for open questions and open dialogue is you'll use the raise hand feature that you can find as you open the participants menu on your screen, the participants menu will usually be at the bottom of your screen. Look like two little people standing next to each other and the number will fluctuate, but right now that number next to it says, number 18. That means there's 18 people in the room. You can open that box and you'll see a button in the box. The participants box that will say raise hand if you click that button. You only need to click it once your hand will go up in the participants list and Russell and Kaz will be able to see that you have a question. Do you have a comment for our speakers? So all you'll have to do is use that button. If you're on the phone, it's a little different, you have to hit star 9 to be to be, to have your hand, go up and be recognized by the co- chairs, and you can always use the chat if you're having a problem with the with the zoom platform. But it's not where you're going to ask questions. The speakers will not see that thanks and do the the folks who are dialed in do we have to identify those. I am working on that as long as they gave their name as they signed in which they did. Okay, I see we have jenna here from Councilman Powers office. Is the councilman going to be joining us Jenna? You can have mute yourself, yeah, hey, Russell, yeah Keith should but be on very shortly. Okay, great! Let's just give him a few minutes here so and we have Luke wolfe from the comptroller's office who's. Also here for the second item, so hi Luke yep, I see him all right. Well, what do you think gosh? Should we just start with the second item? We can just reverse the two yeah. We can okay, get it over and done with Let's. Do that so so Luke, let's we'll start with you, and thank you very much for coming thanks to everybody for coming to this meeting and we have Luke Wolf from Comptroller Scott Stringer's office, and the reason we have him here today is that comptroller Stringer had sent a joint letter with Congressman Adriano Espana to the department of sanitation and also the Department of Health related to street sanitation and issues that we've been having there and in particular I think it was. It mentioned a number of items, but I think one of the areas that people are most focused on is the rat problem and ways to abate that so Luke. If you could just start out by just sort of telling us what the items were that were outlined in that letter and and what those proposals were, I think that would be helpful and then we'll have some questions for you definitely thank you Russell and for having me, my name is Luke Wolf, I'm filling in for Mike Stinson tonight, who many of you know and, like you said this letter kind of came out of a lot of feedback and complaints. We were getting from communities acrosss the city about trash, pickup and rats, and especially during the pandemic, when people are spending more time at home, we saw in a number of neighborhoods sanitation, go up as services were being cut, and so, in response to that, we sent this letter proposing a number of recommendations, but also asking a few questions of the department and hoping that they would be able to get a little more creative and think a little bit more outside the box, but some of their solutions, knowing that especially the time of time budget. That's when you need to really push the envelope in you're thinking and hopefully be able to maintain some of those quality of life, even though maybe the pickups would not be as regular. So our first recommendation was really about giving businesses and bids more flexibility. So one of the things that we were hearing was that businesses wanted to put trash cans in front of their stores or bids put on more trash cans, but they did not want to get fined by the Department of sanitation, so providing more flexibility for businesses to kind of take it on themselves, and we actually got a response. I think was Friday from the letter, so I can help run through some of their response as well as I go through each recommendation so kind of in response to that general proposal. What tsmy said was that they kind of already work with bids broadly in this regard, and that individual businesses can place private baskets outside of their storefront in a way that does not impede the flow of pedestrian traffic and they encourage businesses to do that and then take that trash and then arrange for their private carter to pick it up. They also said that businesses can do an adopted basket program where they are given trash liners and they can kind of manage that basket for them or sponsor a basket, which means that they could pay to have their been upgraded from the wire one to a higher greater higher quality one, so those are kind of the option that they laid out. They did not specifically, I do not think addressed the fines issue but said that it seemed like they were willing to work with businesses, and there are a few options that businesses can put to have trash outside of their storefronts or fronts as long as it does not block traffic, which we also know is concerned, especially with a generally crowded streetscape area. So the second proposal was about the clean Curbs program. So what that does? It was supposed to be a pilot program launched earlier this year in March it was announced and it allows bids to apply for the opportunity to have sealed on- street containers for their trash and recycling storage, which will therefore reduce the need to set out garbage bags and recyclables on the sidewalk. So it would be a contained area that your bids ideally would manage and then put the trash and recycles in instead of leaving them on the street, and that's something we think would would be an overall positive reform, especially freeing up a lot of that sidewalk space and hopefully helping with the rat issue as well. Basically, their response was we plan to move forward with this pilot. They did not end up taking applications initially, because cove had got in the way, but hoping to resume doing that later this month. So they had not begun that pilot program, but we're going to keep pushing them. So we think of overall positive reform to be taken. The third was about city parks and, specifically, the big belly cans which have now popped up in a few parks. They are, can hold five times as much trash as standard litter basket. They have built- in sensors that notify personnel when they are full and they can be open by foot. So we asked DSNY. Have you examined the possibility of deploying more of these kind of smart cans in commercial corridors and what they said was that they require higher level of maintenance, but that they would make sense in certain places which can have that higher level of maintenance, like bids or parks, and that's kind of where we were pushing them to go so not on every street corner might not initially make sense upon places where, like at the Parks Department or the bids, would be able to service them regularly. It might make a lot more sense in those dense areas as well, and hopefully that would take some pressure off. You also know exactly when it needs to be picked up because of those built- in sensors and then the last point we made was on rat sightings, which we saw increase dramatically, especially at the start of the crisis and just ask generally what are their strategies to help mitigate this rat problem moving forward and they kind of presented some other data which said that year over year, the rat problem is not as severe that did not really match the anecdotal evidence that we were kind of collecting. But that was their evidence and they said that Dohmh and Dsnyo are going to continue to work on the problem, but did not really come back with any new solutions or programs or plans to do so. That's just kind of a broad overview of what we laid out in some of the responses. I'll put the letter in the chat now, so you can also read in more detail but happy to take any other questions and anything. I can't answer now I'll be happy to bring back and hopefully come back with some more detailed answers. So I just have one clarification question, which is: what are the statistics that the department of sanitation collects regarding rats? I mean it seems like a tough thing to qualify, statistically and so or quantify. So I'm just curious what they're? Referring to sure, let me pull so the statistics that they sent. It seems to be number of sightings and I'm not sure exactly where that get that data from, but they just have a number of sightings number and then a percent change year over year. So not I'm not totally sure the method behind that, but can hopefully find out some more okay yeah I mean it seems to me like I would imagine there are a lot of sightings that go unreported, probably even most sightings. I see that there's an individual nelson who's raising your hand. We would just ask that you raise your hand in in the zoom and we'll call on you now, but just for future do not just you know, wait for us to see your hand on the camera if you can raise your hand and zoom. That makes it that makes it easier for us. I was just because I'm on a block Association on East 80Th Street, we report we call in rat sightings and we ask the DOH to bait in our catch basins, and so there are people who call at rat sightings and we do it sort of regularly, though we have not done it recently, but maybe other block associations do that. I do not know how else to, but I'm one that does got it and do you mind, can I just ask you: have you seen your your reports go up and your sightings go up recently: okay, yeah russell. At the moment I mean we went through central Park the other day and I think in about an hour and a half that we were there in certain areas we counted about seven or eight. You know big rats in central park now DSNY stopped poison or certain baits. Some time ago they were going to reintroduce something else. Did that ever occur or what's how do they stop the rat problem? There, I'm not exactly positive. If that program has been changed or implemented, they pretty broadly answered that they're going to just continue working to address the Rhoden population and seem like their strategy is going to be by reducing their sources of food or they said deploying pest management strategies, but they did not get any more specific on how exactly they're going about that. Okay, yeah, sorry, yeah, all right, yeah, any members from the public. You have a person. Okay, great! Thank you! So much so nice to meet all of you, I'm David Brodsky. I have problem with you, know: sanitation, related and also sort of rat related in Karlsruhe's park. I do not know if anyone's brought up all the signage. That's just been collecting mold, all of the illegal signage and the family unfriendly messages. I do not mean to hijack this meeting and talk about something, that's not on the agenda, but if that's something we need a sidebar and put on the end, but I do think that it does tie into sanitation because there's stuff- that's really adding up in Carlson's park with these protests and the noise, and are we ever going to address that on this board? Again, thank you for allowing me here sure so yeah. I think that's beyond the the scope of this of this meeting. I do not think we're going to get to that tonight. You know it's. If there are concerns about that, you know, I would say, maybe email us and we can discuss it. I mean I my impression is that by and large the you know, the community's been pretty supportive of the messages in Crossroads Park, but I think you know. Obviously this is a bigger issue than what we're talking about at this meeting here tonight, so we'll we'll table that for another day yeah. I think also the parts department should be involved in this too right. Well, if I could just mention sort of a small plug, I run an organization, I called defend NYC. You can check it out, defend nyc.org about this very problem. If you'd like to talk to me about it directly and how we can approach the parks Department effectively. Other than that again, I appreciate being on the call and I'll stick around and listen to the rest of it, and I wish everyone a lot of peace and safety out there. Yeah contact will at the office and he'll put you in touch with the Parks Department sure I'm in touch with you right, let's yeah, just I would say, yeah get in touch with with will I think that's right and we'll we'll kind of take it from there great all right, thanks so much I'm going to stay on the call just to send on the other issues as well. Thank you for taking my call sure. Okay, it looks like there's another member from the public marco Mozoko hi, hey excellent pronunciation by the way. Thank you regarding the food pickup. What do we used to call it? The the food waste program where at the green market on 83rd street, where grow NYC used to have a lot of containers that neighborhood residents could drop off food scraps for recycling. I live on 87th street and I'm sure everybody knows there is a sanitation kind of headquarters, building right on 87th in between York and First Avenue on the north side of the street, and I was just wondering if we could ask them to just have a bin put out in front of their building, where residents would happily bring lots of food scrap to them, because it's been taken away from the 83rd street farmers market because of cutbacks etc. And I know lots of residents would definitely appreciate that. And you know people can walk there just as easily as we used to the to the farmer's market, and they actually did that once already a couple times for me just out of convenience, when I first was speaking to some of the guys there they're, like yeah, sure we'll put a container out for you, no problem. They did a couple one- offs. But I was just wondering if we could do a an official process to get them to do. That is that something anybody in here can tackle. I think we can ask the men, sorry, which is the institution Department of Sanitation gotcha, okay yeah. I think we can do that on 87th street and it's specifically for food waste is what your is. What you're referring to exactly for food for sure yeah exactly, and I also confirm on the rat problem. I was walking through I've been walking through the ramble, a lot doing a little bit of birding and the rats are incredible going through there I mean it's, you know you got little kids, confusing them for squirrels. It's just it's terrible! Thank you! Okay, yeah, and we can ask them about that, so I would just ask for for other folks. You know this segment were if we can keep it to questions for Luke from the comptroller's office and we'll have another segment with council member yeah powers and I think for more general sort of sanitation related inquiries. We can deal with that at the end. You can a leader, I think, with that yeah, let's, let's turn to Elita yeah. So I joined a couple minutes late and I'm not really sure how to deal with the rat problem, but it makes no sense that the rats would have been diminished over the last year when the city has cut back so significantly on the rat patrol. In fact, Carnegie hall neighbors offered a link to a city program on how to look for rats yourself and deal with that yourself as a city resident rather than having the city agencies deal with it. So I just do not understand how anyone could say that the rats might have been. It might not be, might be less of a problem than they have been in the past because there's nothing to counteract them, and I do not know what the answer is so anyway. I guess it's kind of a question kind of not a question, which is what other alternatives are there for the city, and I also understand that the Organics program, which was eliminated in the initial round of budget cuts, is being reinstated to a degree. Is that possible to address that? Thank you Russell, thank you cause sure, and I do think councilman powers will talk about organics, but Luke. If you want to, I can try to find the first part. I think we agree that our kind of experience and kind of the in what we were getting from community and just my personal walk around the street would reflect that the rat problem has not gone down, I'm not exactly sure how they get a full sentence of the rat population, but I do not. We sent the letter saying the Rat population went up and their numbers reflected, otherwise I'm not really exactly sure kind of where that disconnect is. But I agree with you there in terms of next steps. I think that the first step is trying to get as many pickups restored and especially in those commercial corridors as possible. So that's something that we advocated for, and I think it was two three weeks ago now the mayor said there was going to be a restored service in some of those corridors, which is a good first step. So I think that's step. One also pushing the city to more heavily embraced that clean curbs pilot which they said they're going to roll out, is another good step, because that would ultimately move a lot of trash and food waste off of the sidewalk into enclosed containers. So we think that would be another thing to kind of hopefully address the rat population by kind of taking some of what they're looking for and make it a little less successful for them and also the benefit of keeping the sidewalks a little bit cleaner. There's a group in Hell's kitchen called check heads which is forming their own little pilot around that and I'd be happy to connect you with them and kind of get some of their thinking as well. They're doing some organizing around that, but in general those are two kind of next steps, one being destroying the service cuts to being hopefully embracing this bigger pilot program and as long as you're talking about corridors, I think the intersection wherever there's a subway station, because they live in the subways too. And so I know I see them on Lexington avenue near the 86th street. There's a hole in the sidewalk in front of starbucks and they and I've seen them come in and out of that hole. So thank you all right. Let's go to billy good evening, everybody Luke! I want to ask you going back to the big belly cans that you were talking about earlier and how neighborhoods should either partner with business, improvement, districts or parks? What can we do in a situation like 86th Street, a major commercial corridor where trash does pile up? We do not have a business improvement district, although one has been proposed in the past for the east 80s, and it's not obvious to me whether you get you know something as far east as Carl Shorts, Park or as far West as central park involved. So what if any options do we have if we want someone to help maintain those trash cans which I do think are a good idea yeah? I think at this point it's about trying to push them to embrace them as an overall idea and kind of part of the solution. I think they only rolled out a few of them in select park citywide. So I think step one is saying this is something that we should be rolling out and a lot more places in the first places may start as the commercial corridors with bids or parks where there's kind of the natural partners, but hopefully over time there would be an expanded. So there become kind of just a general part of our city, and we have much more much smarter response to sanitation issues because of all the data that you're getting from this. Where you can respond a lot more quickly and you know exactly where and when you need to pick up. So I'm not exactly sure what the solution would be for that kind of corridor right now, unless there are open community partnerships and I'm not sure how open DSNY is that where there would be some sort of sponsor organization who would be willing to kind of take up that role, that they're looking for of someone to be more active or a group to be more active? So maybe that's a pathway, but right now I think they've only had a few of them in the whole city, so not sure how open they are to kind of those other types of pilots at the moment and by the way, I think, as a community board, we should really take up something to try to push the city to adopt these big belly trash cans, which I think are really effective, particularly around the 86th street corridor and then one other question I had just going back to these. You know more innovative ways to approach trash, pickup and collection and using some of the street space, for that did the controller look at all at one idea that's been raised is trying to use some of the underground space for trash collection. I gather that's really hard because you have utilities and all sorts of other things. As you know, you know five feet under the asphalt, but is that something the controller looked at? And can you just speak a little bit more on what it would look like to use some of that street space for garbage collection yeah? So I do not know if we looked at the underground option, at least in this letter- maybe something we've looked into in the past, and I can kind of see if we've ever done any work around that I think kind of how they've envisioned this clean curbs program is that maybe on an entire block, there would be two spaces along the streetscape, which would kind of be carved out. Have some sort of enclosed looks like a glory like a nicer version of a dumpster sort of thing where there would be separate spaces for trash, recyclables, initially and hopefully down the road have a much broader array where it's organics and other things as well included, and then that would be the kind of core space so instead of everyone putting their trash out right in front of their building on the curb that would be kind of the one hub and then you'd have the sanitation come and they just pick up from those two three. However many spots on the block it would be, and that makes the pickup more efficient. It reduces their stopping idling time. So it's environmentally friendlier as well. Hopefully it's a cleaner sidewalks there's a number of downstream benefits they could have. So it's definitely a pilot program that we want them to take more advantage of. It was unfortunate here that they did not, that they put that all on hold because of Kovitz, but hopefully when they open up the applications, they're able to get that going again, but I think that's kind of the general vision of how it would work. Okay, thank you. Okay, we have another member of the public here, which I think we'll go to just before we get to more board member comments, so Judy Schneider. Well, I'm sorry that I joined late. I just have a question for Luke. The big bellies are great. I've had a little experience with them, except for they're extremely costly. Is there any chance that there would be any money put in the budget for these to get these, because I know bids have used them some of the park associations where they've had money have paid for them, but to have them on corners without somebody funding, it is not realistic because they're so expensive yeah. So I think that's definitely a very good point. I think in theory they might be able to be funded out of like a longer term capital budget, and then the operating budget on a year by year basis might would be reduced because of the their smart capabilities and because of the benefits that come downstream from them. So I think in theory, while it might be a bigger initial outlay, hopefully over time it would be a money- saving maneuver because of the features they're able to provide, but I'm not exactly sure, of course, right now in this budget, how that would work, but generally, if you're, able to fund them out of the capital budget and then have the reduce the operating budget would be the general thought process. Okay, thank you all right. Let's go to marco marco Tamayo. Thank you. I thought it was the other marco. I think the rat problems is not it's not only for one person or one organization, one City Council. The problem right is for everybody has to be involved in that, especially in the enforcement how to mitigate the right population in our district. I'm going to mention three major points that I testify that actually it happened right now in our community. The first one is here to put their small business outside the debts, so the customer use that space and they do they do business, and I remember very well: the layout from a D.O.T clearly shows that there should not be no deck on the street. Why they have two reasons. One of the reasons that mentioned D.O.T is because, when you put an wood deck on the on the road, the problem is, you impede the rain water to run and that's a good idea, but at the same time the other problem that creates is a beautiful place for nesting of the rats, because once they close the business, the rats nest under that and seeing that some of them they are going inside of those places. The second part is the pizza pit trees. If you work in the neighborhood, you see a lot of holes and the holes is. This is the where the rats are infested and they are, they actually grow in those places and the other day I see on one of the buildings they try to put a metal mesh on the top of the tree pit because there are no tree anymore. So the only the third issue that I am rising right here is on 85th street at the end of the unified street, with the end of the fdr serving road finished right, there is a retention wall and the retention wall is a beautiful place for nesting. If you want to see that you just go to 85th street going to the promenade and look down the rats are planting. Why? Because the retention will have so many holes that first of all the holes, they should not be so big, so the rat nest. So what should be is a small drains for the water that needs the retention walls. So if nobody do take actions, drastical actions in those places, so we're going to keep invested of that- and this is a major problem. I remember, I think one of the worst experiencing in the community world that I have is one day I came for working with many community members on Third avenue on and then, when I turned on a reference street down to the east and the middle of the vlog. While I was walking, I stepped on the right because the rat at the same time crossed the sidewalk. So the issue of the rats are extremely serious in our community and we need to take the action to especially the buildings to comply with the with the with the conditions of the sidewalk, with the condition of the halls of the buildings, the condition of the of the feet: trees, the fdr nesting. This is a huge nesting. I'm going to describe what I saw on the one day I saw, I think, was a female rat that was running and probably the male rats were coming behind like a 10 or 20 behind her, and she was running all over the place and I called T-1- 1, but no actions, and that was this is the biggest problem. Is we need to take action? We? It means. I understand it's beautiful: to have laws, it's beautiful, to have some enforcement, but the problem is: we have to take action right away immediately. Actually, this is kind of continue like that. This is one of the major problems in our community and we have to figure it out who is responsible or how to enforce better, and I think I appreciate that. Finally, this committee take action in that part and deeply, and I hope that we can have meetings in order to figure it out the locations and take action with that. Thank you. Thank you. Can I just ask when you were talking about the wooden platforms before you were, that is that related to outdoor? Yes, signing like those are the platforms that they're putting the tables and stuff on yes, yeah, usually, first of all, when they put the deck they put some two by fours and the two by four never match precisely with the with a with a card with a concrete cord. So there is a holes over there. The rats go easily over there and just wait until it has a little bit more time. It will be very well organized and not beautiful nesting for rats and that's we have to take action, and I think D.O.T was very smart. Do not recommend decks on the road is just saying you have to put a plywood just only for the handicap, access to the road, no adapt, but many people understand doing almost everybody they're doing this deck, which is, I think, it's good because they make a flat the sidewalk with the road. But it's wrong because the problem is, they can not. They can not seal completely if they seal, they have problems of the rainwater, and so this can they stop and create a serious trouble for our community. It's good yeah, okay, yeah William. I thought there was some time ago that DSNY had a separate, the rat patrol or the red agency. They used to go out and inspect the neighborhood, help the buildings and basically do what they could to mitigate the rat problem. I know we had them at the community board three. Four. Five years ago two young ladies came presented. They gave out some bins to people. Do they still have that department or group or whatever they used to call them? Yes, they do they actually just hello, I'm sorry for Luke! Well, you seem like you were about to. Oh I mean they do still have that department. The speaker just held a rat academy, which is what you were referring to recently in our in our neighborhood about three years ago or four years ago, so that we could. We could set up another rad academy that they're usually pretty excited to come out and talk about rats. Oh good, maybe that'll be another meeting: okay, yeah thanks! Well, let's we can just yeah, let's discuss it, yeah, that's fine and all right, so exactly yep and I'll. Just I want to get to the next agenda item here, marco. So if you have the, if you can be brief, go ahead. If you have a question for Luke, absolutely, I think the issue with the rats and the trash pickups, it's all working together because basically, as everyone has been forced outside from the restaurants, you can see in Carl shirts Park. If you go through there on a Monday morning, the trash bins are completely overflowed, because every birthday party, every get- together everything- has taken place in the park. Sheep's meadow is the same thing in central park. It is jam- packed with people because they have no place else to go. So I think that is what's driving the rat problem and then, in terms of big belly containers versus regular street containers, it's a question of getting people to pick it up. So whether it's a smart container that sets off a signal and says hey change me, the bottom line is, we do not seem to have the resources to come in and change the bins nobody's collecting it so that right there is a problem. So we have. We have an issue of DSNY without the resources to pick up the stuff, but there's more stuff being put outside because of the policies of the city forcing everybody to eat outside. So hopefully you can place the emphasis on getting everybody back inside and we can solve this problem, and that would also start help funding the city again and we can get back to normalization. So is there a push to get people back inside that we can solve these sanitary issues? I did not even think of the issue from the from the rats nesting inside of all the structures that people built up all over the city. That's actually a great point. I never even noticed that, but yeah we've built rat housing. Basically, I mean, I think your question goes a little bit beyond the scope of the question: yeah, sanitation, pickups and rats, and obviously the question of how, to kind of you know the phases of the reopening and all that stuff. That's. I do not think that's something we're really going to get into here tonight and there are a lot of factors to consider, including safety, and what have you and so you know, ultimately, I think that's a little beyond the scope of the no that's fine. I just hope that Luke is aware of this and can pass that on up the chain, because, as a as a citizen I mean it's a health issue and the more people are outside the more problematic it is. I understand yeah thank you yeah, and we hear you. We hear it's an issue, which is why we wrote this letter and we're going to continue to push on this, because we know it is a problem, it's affecting quality of life, and we want to make sure that the city is doing everything they can to address it, which includes increasing pickups, includes getting more creative, and it also includes responding to how people's lives and daily schedules are changing, to make sure that the city is responsive to that as well cool. Thank you. I appreciate it. Yeah I've got one other point: look the governor has volunteered the state help in helping the sanitation. Can we take him up on it? I mean I think we should take all the help we can get, I'm not exactly sure what he offered specifically to help with. I do not know if I saw that, but I think we generally are supportive of making sure that we're getting more resources from the state. It's something that we've been continually asking for right now on this issue and a number of other issues, so I'll figure out exactly the type of help you offered, but I think, as a city, we need as much help from the state as we can get right now. Yep thanks all right. So I think we turn to the next item on the agenda here, but I just want to say thank you very much luke for coming. This is very helpful, informative and thank you for taking all the questions. So, let's, let's turn to council member Keith powers and he's here to talk about the core act. But you know he may have some comments about the the sanitation issues also, but first and foremost, I think councilman powers. If you can talk to us about the the Core Act, and thank you very much for for being here. You are now thank you. I nice to see everybody and thank you for give me some time to talk about one of my favorite bills and an issue that I hold near and dear to my heart, I'll. Just I just Wanna before I do anything else. I just Wanna note- and this is very cba specific. We have not announced this yet, but you know part of what we get to do in the council is to we get a number of different parts of funding. Some are after school programs. Some are for local programs. We find a number of the block associations things like that, but one of the part we get is actually for cleanup and for sanitation services in the district to help plug the gaps where, where there are not where there might be a need for additional service in the past, we've done it kind of two ways. One is we've supplemented, DSNY service, in particular hot spot areas where areas where there might be a real need, like Midtown and other areas where there's like a heavy traffic, and there might be a need to add in additional pickup service and we've also did trash cans. So we could put new trash cans out, bigger ones, more protected, a little more guarded against rats and so forth. This year we actually decided to change it. A little bit we're actually going to fund a new cleanup service in Cbhs area. We're going to give you the details. I did not want to tell you this until I had all the details, but I figured this is a good group to tell it to, and we want to when Jennifer my office will get you some details, but we're going to actually coordinate with some of the groups to try to figure out where it's most necessary, so on the east side of it. You'll have councilman. Kaylos is funding a group we'll be funding the other side so that they're somewhat of good, comprehensive service being provided, particularly in the residential areas. Where we get a lot of calls and complaints where maybe a business is leaving trash outside or something like that, Jenna just put her email into the box. If you want to email us or if you run a neighborhood group, you want to find ways we can try to coordinate so we'll get you details, but if it was a good time for let you know that we put 160,000 of new extra sanitation service into the district and it's coming quite soon. We just met with the group last week to talk about it. So a little bit of news yeah, I was going to say you're making news here tonight. That's really exciting! Yes, I I think was not supposed to tell you that yet, but it's but news anyway. So I want to talk with the Core Act and what is the car act? For starters? It's an act that an intro a bill that we introduced. I introduced with my Councilmember colleague, Antonio reynosa from Brooklyn, who chairs the sanitation committee in the City Council, and it is about the organics recycling, which is composting and regular recycling, which is the stuff that many of us do in our buildings or do in our neighborhoods and before. I just want to thank Russell and Kaz for letting me come and speak for a few minutes about it and talk about. Why we're doing it talk about what it is talk about ways you guys can help. So, as everybody knows, we are in deep and dire fiscal conditions right now here in the city, and there was ever you know, lots of things getting slashed this year when it comes to services based on the fiscal conditions of the end of pandemic and so to look at ways both to incentivize, better community composting in the city and community recycling, but also to address the possibility of cutbacks on composting and recycling in the city. We introduced this interest legislation to kind of uphold the ability to provide that service here and to also try to create more equity, and it is obviously about sustainability and about composting, but it's also about convenience, making sure and equity making sure that every new yorker has the opportunity to be able to do this in their neighborhood, not just our community, not just based on what neighborhood you live in or what building you live in, but to provide this sort of as a universal service here in the city, and I have to start by, as we were, there's two different. Let me just explain: there's two different programs that we have in the city when it comes to kind of composting, recycling and I'll talk about composting more than recycling. In this case, one is amanda sort of mandatory pickup, which means you, if you're, if your building is participating in it, there's a brown bin in your building or in your home. You bring you drop everything off there and there's a pickup service provided by the city to it. I live in Stuyvesant town, we in every building and my we can drop it off right downstairs. They take it. They, it gets picked up and gets taken away, there's also community composting, which is where in somewhere in your neighborhood, it could be at a grow NYC farmers market. It could be at a local with local community group or community composting center, an opportunity where you can go and you can drop it off, so you could just bring it down the block. You can drop it off and then get rid of it and they'll. Take it away and they'll take care of all the services of getting rid of it and all the organic recycling components of that, and- and so this year both were facing cots. The mandatory program actually has not always worked exactly. The curbside pickup has not always worked the way. We want it to work, it's actually a program that really does need some reinvention, so that one and it's expensive, so we were trying. You know it made sense to maybe pull that program back and actually be able to redo it a bit and then come back with a new program and we have the money to fund it. The community composting program, though, for me it's kind of like the last offense against having a composting at all in New, York City or not having it. So if you take away your ability to drop it off downstairs, you want to preserve your ability to walk somewhere in your neighborhood and be able to drop it off and be able to still get rid of it. So in my, for instance, where I live, we funded. We have for grow NYC right downstairs. We do a farm market every sunday, so every sunday you can walk downstairs, you can bring it down, there drop it or you can collect it in your house and you can bring it down every sunday that was facing cots it's a really small program when it comes to how much money it costs, but it makes sure that we can do our sustainability goals here in the city and if you are a good new yorker and doing the recycling and composting that you still have a place to do it. So, even as the city was looking at taking away the big program, we wanted to make sure that we kept a small investment of a few million dollars to make sure we can. You know, stay on track with our sustainability goals. That money was getting also getting wiped out, and I really have to thank a number of myself and a few other colleagues thought to make sure that money would not go anywhere because it's a really impactful investment for only a few dollars in our total budget. So we did that, and we also introduced this bill's intro 1942. It requires a minimum of three dropping comp off sites in each community district community district being Community Board District, meaning that Committee Board a community award six community five, like I have a little bit of community world 11. Every community board would have to have three sites, and that means that you really kind of no matter where you live would have probably the ability to go drop something off. So it could be a carl shorts park it could be at it could be at a lenox hill, neighborhood House. You know it could be any of these sites where there's a grow, NYC site or otherwise, that it would require that the city is providing funding for, but also ensuring that there are three community composting sites. It also requires that there's education and outreach to educate new yorkers about how to do composting, what it is and where to go, because a lot of folks do not understand how simple it is, do not kind of get grossed out by it and maybe do not understand like the easy way to do it right in your household. So we would require that beginning. Actually, in June 1st of 2021, the city would be funding and standing up these programs and why? Let me just tell you why this matters- because I do not want every year- have to get in this fight with colleagues who do not believe in it do not care about it. Do not have it in their district and just want to let it go, which is a lot and more than you would think. After this fight, we should put a law in the books, require it make sure we invest in it. It's a minimal investment at a time where I think we could. Actually, we can actually for this investment and to do it, so our bill would do that. We had a hearing on it. We heard lots of feedback from folks about the importance of it to them and their and their utilization of it, and really, I think, they're kind of belief about this. If you take away this program, we have nothing that we've really, you know kind of dropped the ball when it comes to our sustainability goals. Here this would mean there'd, be a 177 disposal sites that are either preserved or created in the city, but it also means that places where they do not have. It would be required to have it so that we can start educating people in those areas about how to be able to do composting in an easy way, and this is really- and I just a couple numbers here- I mean one third of a New York City's waste stream is organic material. Doing diversion of that is not only good for our sustainability goal, but repurposing that it's also cheaper in the long term for us to do that, because the cost of disposing for waste is cheaper than the cost of reusing our organic materials. So there is a benefit over the long term and a full wide city- wide mandatory program would defer 20 times. Material would really have a major impact, so you can go right downstairs and do it, and that is actually the real goal for me is to get us to a mandatory organics program that works and is really accessible to folks. So it was a little unfinished inefficient, but we want to get to a full goal there. So that's, ultimately, what we're, what we're looking to do and really, oh, you know, kind of standing up our goal in a cheap in a cheap and affordable way at a time in a fiscal crisis and to make sure that we are doing our job as new yorkers to be to be good, new yorkers and to make sure we're meeting our goals and just to just to talk about who's, supporting it. New York, League's, New York lawyers for public interest have been driving. This conversation they've been really great advocates: New, York, City, Environmental, Justice Alliance, the League of conservation voters, New York, Resources, Defense, Council, all the solid waste advisory boards, including the one in New York in Manhattan, rather the ecology, center and low East side. That is the one that I work with a lot and all the groups that are doing this work so I'll keep it at that. Just in terms of it, I would say two things: we are really starting to move towards really getting a lot of support out for this. We had the hearing on it, we're trying to get it to a vote, so we're trying to sort of amplify the attention to this issue before we get to the next year's budget process, so it's sort of a sort of built into the budget coming next year. So you know your support here at community. Board. Eight would be good as a sort of way to help raise attention to it. Obviously, I'll do my social media to amplify your support of it, we're doing some town halls and some events on it. Soon. We're really trying to steer folks towards getting this to a vote and getting communities all around the city to say they want it, and so we would love all your support here and but we're working on it when we're working with DSNY to work to work on it. So questions if there are any and happy to talk through it with people. Thank you. I have a couple of questions. Yes. Well, you know what no, let's turn over to Elizabeth rose first and I'll go at the end, so Elizabeth Thanks Russell, thanks Councilmember. This is, I completely agree that I'm just heartbroken that this organics program has gone backwards, not forwards and, in fact, when I, in my application to join the Community Board, I spoke about how much I wanted to push the organics program on the Upper East side, which I felt you know our community has been lagging ul. So I greatly appreciate your continuing to push on this issue and to create something that is potentially at least minimally workable. The question that I have I had sort of two questions as it related to the text and the specifics of the proposal. The first is the notion that this is something that has to be opened 20 hours a week, which implies that it has to be manned or peopled. You know supervised, yes, and I really wanted to just push on the question of. Is there an unsupervised? You know approach that you know could be sort of more permanently available. You know and because there are two different costs here. One is the cost of actually picking up whatever gets deposited, and we've been speaking before you joined us about you know. Part of the problem with sanitation is no matter. What type of garbage container you have our problem right now is that we can't afford people to come and empty them, so you know making them bigger, helps and therefore emptying them less often helps, but we still have that challenge. So here there are two costs. One is well three costs, one is the cost of location whatever. That might be if it's a separate location. The second is the cost of picking up from this location, and the third is the cost of staffing the location, and it seems that if there are opportunities to create unstaffed, you know think of a library book drop. Would not that ultimately help enable whether it is more of these or greater usage at lower cost yeah great question yeah can I can I take church so sure the department of sanitation, so this actually this bill, the my introduction actually stems back to a conversation I had actually in a Manhattan delegation meeting with all the council members talking department of sanitation about their plans for this program, both from a community composting side, mandatory organics and what's the future of composting here in the city, which is where I said, I think we should really try to affirm some of the gold here legally in law, but the there they are it does. The part of that conversation was their intention to start looking at sites that could be unstaffed or unmanned on people, but to be unstaffed and to do kind of drop- off spots. I have not actually had a conversation with them recently about whether what progress they have on that, but that is their intention, is to be, and that's what I think we that's why I think we wrote it the way we did, which is to say there does seem to be sites that will start to be unstaffed, which would reduce the cost, but also, I think, just make it easier to run for a number of reasons. Okay, that would be great and so right now in my head- and maybe this is just the way I read it. The text seems to me to imply that those sites must be staffed. Oh yeah, if that does not have to be that way, that would be great got it. I do not I'll read it again. I do not think that's entirely our attention, but what we, what we are trying to do is to make sure there is. You know, availability of it and to that point, if there are limited hours, it would be great if there could be some requirements that those hours not be solely sort of Monday through Friday midday. You know that, but that there be a variety of times of day and days of the week, including weekends. You know all of our lives are upended and I'm not sure that the weekend is a relevant statistic. You know concept anymore, but nevertheless the more we can ensure variety of times of day and days of the week would be great yeah. I yeah, I think I think every day is Wednesday. Now I think yeah and but I you know, I agree with you and that will be part of our implementation- is to make sure they're accessed it's because there's there will be different sites in each district. I think there's an opportunity to also coordinate among sites to make sure they're open and available in different hours and different days to help spread out availability. It's a great suggestion and then my last question about the text was the required reporting that speaks about the number of individuals using each site. Yeah it struck me that is a that is a record keeping requirement that I question the. What does that do to implementation cost? You know: does it matter that it's five people or a hundred people? What ultimately matters? Is it effective at collecting waste? You know, and maybe you start getting block associations banding together and one person brings the waste from you know an entire apartment building or one person brings the waste from several. You know buildings, so I I'm not sure that the how many people is important. What is important is the quantity of appropriate waste. That's dropped off and that asking for the number of individuals in the report may be adding an administrative burden that is not critical in a in a tight cost world yeah, I would say three things one is. I thought I agree mostly in principle of the that there's a potential burden there, so something we can look at. I think you know the one eye where I go. Where I jump myself off, they do actually keep a count, and maybe it's because I'm the council member, they just tell me what how many people are coming, but they have a pretty good count. So I think they're at least I know some sites are able to do this, but yeah we're not looking to create a new burden for anybody. I think it is helpful to have both like weight or other some other measurement, and also you know. For me, it is actually important to know how many individuals are being are able to use the Acai, not just the bulk, but we're not looking to create administrative burden, and if that is the case, we will take that out. Good thanks. Thank you. As far as the buildings there's many buildings that have a lot of space available. I know I spoke to the super of our building some time ago and his concern is again the rap problem and people will drop anything in there, but if we could get support from the buildings they have a lot of space. Put the bins there promote the buildings, then the whole block could go to that one big building and drop it off. It would be so much easier. I'd rather walk one block than walk half a mile to a drop- off site. Well, it's both. I mean what we've seen is that when we actually just goes back to the conversation we're having at the outset when I was talking about this bill a few months ago about introducing it, I you know, the other option is like this replies on parts of the Upper East side too, places where you know one individual on the block may decide to go, get the brown Bin and potentially be able, but there's a capacity issue, but not being able to allow others to do it. That's some level of coordination that would probably require people knowing each other or Block Association, or something like that. I do not. I look, there's no issue, you know for for a building to make available to other neighbors in the in the community the ability to drop off your organics there. I just know that some buildings may not be willing to do that. It'd, be there from a security standpoint or access standpoint or their own capacity. There's a number of reasons. Why, but also, I should say like if I, if you any building, if the curbside program is available in that area, can just get a bin and put it downstairs rather than having to explore. But I do not disagree with you. I think there is not. There is a world, and this is maybe a project. For you know. All of us at some point is to look at ways to better coordinate. How folks can find where maybe it's a maybe it's an app one day we'll develop, but where you could find your local dropball spot neighbors or something like that. There is a level of coordination. I think is helpful and I think there's something to that, but I also, I think, when we've discussed it there's some large buildings, I think, might be a little bit concerned about who they're you know how they're letting people in like that, but there might be a project in there for all of us the future. The future that's right, if there is there ever is one. So that is that's another. I have a related question, which is just: how are the sites going to be determined the three sites per community district? What's the plan for that, I ultimately said something we have to, but I mean I, of course I have to mention that in any iteration of the bill could go from three to two or something like that. I think it's really going to we're going to provide the funding for it and then I think it could be up to the department of sanitation to do an RFP or some other way to sort of to determine those there'll be areas where we're going to have more than three because there's lots of folks who want to do it. It's something we're working out with department center about how to cite them. Okay, all right, I see. Marco has a question. So, let's go to to him here, constant powers. I strongly support that idea. The only thing I find a little bit incomplete your idea is, you should include all restaurants. Do this recycle? If you do that it will you reduce dramatically the organics that produce these the restaurants? Well, I'm going in one direction: always I have the gains of the Marines transfer and the Marines transfer was created exclusively for commercial garbage and if you enforce and develop that idea deeper, I think it will be great for our community. We can get rid of the marine transfer and we can have different facilities. Always I have been fighting for that and not only that the Marines transferred at the time when there is another sandy, it will be flooding the whole garbage out to the river. So I think we have good arguments in that direction, but your program, your idea, I think, is lovable and I appreciate a lot and I think it's great and I think the community will support it strongly because we do not want to see the Marines transferred in our community. Especially you should include the restaurants, so they can do the right thing and they dispose a lot of garbage on them, and then we have a chance to decide to save the city. We do not need any more than marine transfer. We need just only recycle, which is basically is a sustainable program for the entire city. Thank you, yeah. No, thank you. There is a there is a commercial food organics program, it's been a while, since I've looked at it, there are some requirements around doing requirements around commercial businesses to separate organic waste, and I think it applies based on like your square footage or usage. I forget the exact criteria, so there is some for that program. The other area they've been looking at a lot, is around schools and other places where there's a lot of food use. It's just proven to be more difficult. Well I'll, defer others. We might know more about this, but, like I, it seemed to me to be proven to be a little bit difficult to implement that program, but that's there are definitely more opportunities in other spaces to do more organic separation and more organics recycling and we're I'm interested in doing all the above. Thank you. Thank you all right. So that looks like that's all of the questions and I think we can. You know we can talk about a resolution on this, but I do not think we have to keep council member powers here for that. So thank you very much for coming in. Thank you guys. I got ta go to my next zoo, but thank you everybody. Thank you guys for giving me time and caring about this topic. I really appreciate it. Thank you. Thank you. Thanks guys, bye everybody, but you did have a couple hands just go up. I do not know if you want to no I'm sorry, no marco and Elita had their hands up. I think I was going to say well, let's okay! Well, let's I guess: let's go to the raised hands yep! So let's go to Valerie hi, I'm sorry! I joined really late. Can you just explain to me in this newest recycling thing where's the money supposed to come for this, so one of the things did Keith give a proposal for how much is going to cost. He did not talk about the specific costs in terms of specific numbers, but one of the reasons for the act which he put forward is essentially the running of these yeah, the running of the drop- off sites so separate from the question of sort of pickup composting in that aspect of it. Just the running of pickup sites is very inexpensive in the context of the larger budget, and so the reason for the the bill. One of the reasons that that they want to introduce it was essentially to say you know, in the context of larger cuts that are going to pick up and other kinds of issues. You know just to make sure that there's essentially some backstop of some just baseline ability of people in the neighborhoods to be able to do this composting and the cost benefit is basically very reasonable, because the actual costs of just providing this opportunity in different neighborhoods just to have a spot where people can drop off their composting is pretty minimal. And so that's really. The goal of it is to ensure that, in the context of kind of larger cuts and larger service issues that there are that we just maintain some kind of baseline ability to allow people to do composting and also there's an outsized impact. Another thing that he mentioned in terms of the share of waste that kind of falls into this category, so those were so. It was addressed in that. In that sense, let's go to Billy just sent me. Thank you thanks. So I had a similar question to Valerie. Although I do not imagine the cost is going to be particularly high. I will say you know the legislation does talk about establishing these at least three sites and locating them, in quote a geographic area that is easily accessible, including for persons with disabilities in close proximity to public transportation, which is all good, but I think we should be mindful, of course, of you know our community district, that we have Roosevelt island, where, if you did not have one of these centers on Roosevelt island, for example, I think that would be problematic, both optically and there's an actual substantive policy. So I think we should pass a resolution if there's interest in doing so supporting both these bills, but I think we should include language that emphasizes the parts of our district where we feel might get shortchanged if we're not specific about where these locations should go. I would add to that. You know we have a couple nicer locations and I would not want to locate these centers. You know particularly far too far from Say homes in Isaac's or Robins, but you know I otherwise I looked at the bill, it seems pretty straightforward. I agree Valerie. The cost question is a good one, but I'd support doing a resolution. If we, you know include some of the language I just suggest yeah with that billy. I think we should have a minimum of three rather than three. I think that would be more general, depending on the situation like you said, with Roosevelt island, which means that we would have two in Manhattan on in out. You know on the Manhattan main island, which is ridiculous, so I think maybe we should change the wording to a minimum of three yeah. I agree with that. Completely and I'm just searching now in the legislation, whether there's anything that talks about in consultation with the communities or the community boards, because we could easily identify three or more or more areas, and we should not have the last word- we should defer to the expertise of DSNY. But you know if we're going to put something in about community consultation and then again, specifically what I mentioned about Roosevelt Island. I think that would make a lot of sense, but I agree with you more than three so yeah. So it sounds to me- and I I'll just make this comment before we go to Marco. It sounds like these are basically three items that we potentially want to include, which is to say number one. You know we want at least one on Roosevelt island, in addition to having at least one on the sort of Manhattan island side of it number two. We want. You know more than three, if possible, if that can be worked into the final version of the of the bill, and then the third point I think, is you know we would request that that DSNY consult with a community board about their proposed locations, because at the end Keith was saying that that that's how they would do it that it would be sort of like a consultative process. I guess with the council, members and DSNY, and I think it makes sense for us to just put in our own resolution if we make one that you know that we would like, we would like to say in it- and I think it's probably beneficial to the city to hear from the community boards about what's useful in and what makes sense from us directly. So I think that'll make sense to include another thing on that russell is no one has mentioned: Central, Park or any of the parks. So you know that would be a great place. That's where people congregate. That would be ideal in all the public parks. So that's you know we can include Parks Department in that yeah I mean. I would not want anything going on in the park to count against our oh. No, this would be extra but yeah, and I mean I imagine, there's basically yeah. I think it's sort of a separate issue, but there's probably compost waste being or organic waste being generated in parks with people picnicking or whatever, and I think they're going to have to deal with that. Also, okay, all right. Let's go to Alita here first before we hear from Marco go ahead. Elita. Thank you. I just wanted to say. I agree with asking for more than three Roosevelt island is really standalone and people from there could not be expected to come over to our side and people from our side could not be expected to go over there to bring food scraps. So it makes perfect sense to treat Roosevelt's island as a standalone and to have three in our community district which would match the size of other board areas within Manhattan. So yeah, that's a great idea. Thank you also. Does anyone know what happens if non- vegetable or non- compostable waste is put into containers meat contaminates? I do not know what happens with paper, and that would be a consideration for the park which we would weigh in on as a board that borders the park, and is that something like putting in a number five recycling plastic into a plastics container? It contaminates the stream. So there needs to really be a lot of education in there, which would seem to add to the expense of it. So we need to ensure that the public is fully educated. I do not know I post those mailings that come from the city, I'm recycling, but that is definitely an expense to have to mail those and produce them. So thank you, yeah, I'm not sure if councilman powers address the cost of the education specifically, but I mean my impression: is that the I mean look, you there's different ways to do a sort of educational component to it and you can certainly imagine really intensive ways to do it. That could drive up the cost, but I also think that you know in the grand scheme of things I think you can do an educational program, that's pretty inexpensive, and I do think one of the things. That's I mean it's sort of a double- edged sword when it comes to composting is not everybody. Does it and I think, to the extent that folks are going to want to do it, it's not a casual thing. It's going to probably lend itself to people who are sort of more serious about it, and my guess is that there's going to be folks who are wanting to kind of come in and learn a little bit about it before they do it and will need to learn about it before they do it. So, hopefully there we can rely a little bit in this context, even more than in others, on people being proactive about kind of informing themselves. Do we know about schools did Keith address schools, because that could be a place where they compost after lunch. The kids are involved in learning at an early age, and parents could drop off or babysitters could drop off food scraps on the way to pick up their kids or drop them off in the mornings yeah. I do not think he addressed that specifically, but I mean I think that that's sort of getting into the larger question of what the good sites in the community district would really think, and so I think you know it may be that those end up being good choices. The other thing we could do is make sure that council member powers, you know that we are concerned, and maybe the DOE could be brought into this too. It just seems that it's you know they put, they put green roofs or whatever they call them on on the roofs to help kids learn about science, they do gardening when they have plots of land or little yards, and so this is a really good way to initiate kids into caring for and about the environment, teach them young yeah so and also there's a massive amount of waste produced at school meals when they're there and they're having them. I do not. I can't obviously speak for right now, but thank you I'll stop here. We could include that in the resolution you know more than three plus you know, does certain locations that have a concentration like schools or parks that could we could make that general in the resolution yeah. Should we should we should we just sort of get a formal resolution proposed here and maybe that's what Marco's going to do, but I think that would be kind of helpful as we're going through. So let me go to. Let me go to Marco. Thank you guessed exactly what I was going to say. I would like to put the motion to support. They keep powers bills and if somebody else second, I can continue speaking all right. Let's do the seconds with their okay. Elita has seconded and billy too. I think so. Okay, so I think pretty much. The language has been expressed, everybody billed say clearly a leader said and caused and mentioned very well the points of recollection. We can just only mention that it should include more points of recollection than the same so and pretty much. The rest is clear to support the bill and thank you, yeah. I think good, and I think I think, in terms of the question of you, know the numbers. I think the way that that Elita phrased, it is good to say. Basically, you know, Roosevelt island should count separately from the community district. They should not count against R3, they should get their own. Irrespective of what the rest of the community district gets. Let's go to Judy Schneider yeah. I do not agree with cars about the parks. I think it's great the schools, because, if they're going to do composting and as the leader said, the kids learn about the environment, I know the schools in our area that's become important. It would be great and make it very easy drop off place for the composting, but in parks, not all our parks in our district have workers in them, and I do not know that they're going to put a worker in the park just to watch the composting bin. We're talking about course earlier and a lot goes on in the parks trying to keep them clean and they're. As someone said, a leader, maybe the garbage is not separated, even though we have paper bins and plastic bins and same catherines, and so on. The people do not separate. They do not the composting. I just can't see it working in the box. I can see it is a very good thing for the schools and remember central Park is not just our district. It's the five districts around the park that get to say about what happens in central park. So I think for the ease of this resolution. I would not include the parts now, but this bill concerns the whole New York. It's not only CB8. Our resolution speaks to cba. Okay, see all right. Let me just work up here. What what I think we've got for the resolution, so I think we would say CB8 supports the core Act and urges the City Council to adopt it. Roosevelt island should have at least one compost drop- off location apart from other compost locations in the Manhattan island portion of the community district. I do not know if there's a better way to refer to the part of CBS. It's not Roosevelt island, but I think Manhattan island portion is pretty clear that we encourage the city to to include more than three more than three drop- off locations in each community district, and we ask that or we yeah. We request that the department of sanitation consult the Community Board in determining what the locations should be within the community district, and I think so that that's the so that I think, captures all the points that we were talking about, the CB8 specific stuff. I mean I tend to agree with Judy about not including central park in this one, but I think we could take a vote on that. Potentially, if there are differing differing views- or I guess the well, I guess the question is what would if we do want to include central Park? What would that you know what would that entail? Well, we could have two one for cba specific and one for General New, York City in General, and the New York City General would be very basic, but then just to say we encourage. We encourage the city to to also set up composting drop- off locations in Central, Park, well in parks in general or other areas. Would you know if we could work specifically to be general rather than specific, that we want them to look at other locations that are not specific to CB8? Got it yeah, I think? Well, so most of it, I think, is neutrally aside from the sort of Roosevelt island specific aspect of it. I think the other points we're making, I do think, are generic and are not cba specific, so we're saying basically more than three locations in each community district. So I think that's going to be broadly applicable right. I think if we say we urge the department of sanitation to consult with the community boards on the locations of drop- off locations within the community districts, I think that's also sort of generic and broadly applicable is not necessarily specific to our district. So I think, with that wording, we've still got a kind of like a city- wide application in part right and also they should consult with DOE and the parks. That's general got it so consult with. Okay, you know we're keeping a general specific for what we want, but also including the generality of the city as a whole. Yeah I mean, I guess my concern there when talking about the other districts or sorry, the other departments is they can sort of stick up for themselves and I sort of feel like for us. If we're you know, it makes more sense for us to talk about what the role of the community board is going to be or community boards are going to be, and if the other, you know, if does, should be consulted or if DOE wants to be consulted on whether you know they get in front of a school. I mean I sort of think that you know, like the city agencies could sort of handle that among themselves would be kind of my yeah. I mean I'll, find whatever makes it easy. Whatever everybody agrees to you know it's a mutual agreement on everybody's past. Okay, all right! Well, let's see what other folks have to say so Barbara has her hand up Barbara, I'm sure this was asked. I'm sorry I was late, but if there is none, if there's other stuff thrown in is, does that compromise it or is it able to be separated, because that would make a big difference in terms of parks as far as I'm concerned, what, if somebody does throw in paper or something that is not organic, so I mean I'll, I do not know a lot about. It was not asked because I do think yeah that there was not an answer to Keith. I mean that was a point that Alita brought up and I will confess I'm not. You know, I'm not an expert on composting. I do not know a whole lot about it, and so I do not know if that's the case, but I mean, I think, that's a that's a valid, because that will make a big difference as far as I'm concerned with parks. I will say: people are eating a hot dog. They do not stop and say this should go in this bin and that should go into that then, and I think that there'd be more problems with it. I think we ought to just stick with the bins where people who are dedicated to do it would know what to do and schools where they would be lunch AIDS that would sort of be able to follow what to do. If we do want to talk about other places such as schools, parks would be a disaster. I do not see it working out at all and maybe making it worse. It could be that it costs. You know it's worse for because it's all compromised, that's my comment. Okay, we can leave parks out, I'm fine, all right, barry, yes, good evening cause and Russ. Just one thing you did not mention schools in your allocation of the resolution. I thought we did. No, I do not think we mentioned school specifically. I guess my thought was that the school point you know and the question of whether schools would be good pick up locations that would come in the sort of consultation phase later you know. Basically, we then it's sort of encompassed by that, and we say you know we want them to consult with us about all right. You know what, to the extent that it makes sense to have schools, be those I think, that's sort of the phase of which we would. We would make that point. I do not want to prejudge it at this stage. Fair enough. Thank you all right, Elizabeth, so Russell. I want to thank you for your position on schools. I have no issues with in a preamble. We want to say that we broadly support sort of the resumption and continued development of an Organic Organics collection in New, York, City, more broadly, and that might encompass the previously existing programs, which included a program that was school specific, but I a couple of things one is having run facilities for the public schools. The last thing that I would want is for people to bring garbage to schools. I mean that's what we're talking about here. We are talking about. If you, if you make a school, a drop- off point, you are talking about having people bring garbage to schools. I would be strongly opposed to this. In addition to all of the issues of just bringing garbage to schools effectively, the maintenance of ensuring that is then kept clean and does not impact our kids would fall on department of education, custodial staff, so you're just transferring costs from sanitation to the doa. In addition, DOE sites where you would be able to put these 99 of them would be school yards, which is where kids play. So I think there are lots of issues in making schools collection points. I would, however, completely separately support the resurrection renewal, continuation expansion of the school specific Organics collection program, but I think that is a separate thing, so I personally would strongly support russell your approach of leave schools out of this resolution. This is about. We want to support the law that is being proposed. We want to support the bill and, as it relates to Central Park, I have a similar reaction. I do not want people bringing more garbage into the park. Okay, all right, so I think there is kind of a yeah consensus to leave at the park. I think I think at this point the rest of the wording we've described is folks, are on board and I'll just go back. You know, marco. Ultimately, it's your resolution, so I just want to make sure if you have any issues that you that you flag, those I mean I've been sort of treating all. This is kind of like friendly amendments, but let me know if, if there's any issues with that, but what's that, thank you. I think the comment that they did. I think we had to my attend general. We can not specify park, we can't specify schools, we can't specify not just leave general, we support the bill and other choices very simple, and so then we can have a chance, an opportunity, probably to negotiate and to see the right location, because it's right, you can not bring more to the schools you create, you can not bring to the central Park or any other park. We have to be very sensible with this, especially in summer time, when they, the collection of these recycles, create serious others that affect to associate with for other people. So I think we have to be very careful in the way that we handle and we maintain general the our resolution in general terms, asking probably another location to explore, and that's it very simple. Nothing is specific, I think that's the only common thing and it's and you're on board, with the other points about the oh yeah. Yes, absolutely right: okay, roosevelt eye and all that stuff. Okay, all right, so I think we have the the wording and the basically the three the before resolve clause I'll just go through it one more time. It's going to be to the effect that CB8 supports the core Act and urges the City Council to adopt it. Roosevelt island should have at least one compost drop off location apart from other compost locations in the Manhattan island portion of community board, eight and Roosevelt islands, drop off location should not count against the number that the rest of cv8 gets. The council should should- or we urge the council to include more than three locations in each community district and we request that community boards be consulted by the department of sanitation in determining which or where the drop- off location should be within each district right all right. So with that, I think someone wants to call it. Somebody has to call the question yeah. Do you want to do that? Can you hold the question all right. Do we have a second oh yeah, Gary or elite is seconded okay, we're good, very second, okay, all right! So, let's vote and I think the voting procedure is the same right. So we just anybody who's, voting, no or abstaining can raise their hands all right, valerie yeah, I'm going to abstain, because I have not had a chance to read the legislation and I'm not sure I want to vote for anything that we do not know how much it's going to cost thanks. Well, rather than abstaining valerie. Since you were not here for the whole meeting and you know not having read, would you like to just be excused that way would have? We would have a unanimous yeah, that's that would thank you cause. That would be great thanks. So much okay and if one of you would read off all the names of the board members who are here just so it's in the video record sure so Russell Squire and Caspagnaletti Marco Tamayo Valerie made some of those she's excused from this vote. Elizabeth rose, Elita, Camp, Barbara, Rudder, Barry, Schneider, Billy Freeland, and that is it. That's everybody, yes, okay, so guys Dan is unanimous. All right. I did say that you know, given that we were getting a number of sort of non- germane questions earlier on that folks could raise stuff at the end. So so, if there are other kind of if members of the public have other items that they want to raise or just other questions that they have for us- and I would just ask you to be concise, but if there is anything please go ahead, I'm not seeing any hands valerie go ahead. Valerie! You just have to mute yourself. Sorry about that. I just wanted to raise the point of, and I do not know if this came up before the problems that we're all having or at least in my neighborhood of benches, becoming trash receptacles, and I think we need to look at the efficacy of having all these benches and what they're being used for and and whose responsibility it is to keep them clean and I'd. Like somebody, you know we've kind of asked department of transportation. They have not really been able to answer that simple question and I really think it's an important one as the trash cans become overflowing. Okay and you've seen people have been leaving garbage on the benches, yeah they're just being used. The trash cans are, full people sit there. They just leave their garbage there. I think it's unfair to ask stores to come out and clean these benches and nobody seems to be responsible for them, and these are you're not talking about like bus, stop benches you're talking about other. No, I'm talking about the benches that the D.O.T has put along 2Nd Avenue, at least those are the ones that I've seen and they're constantly filled with garbage. Well, that should be a DOT quest. Would not it well, they do not have a cleaning crew yeah I mean, I wonder if it falls within the kind of general rule that the frontage of the building is the responsibility of the of the business. Basically yeah, interesting, essentially that you have to you know each business is responsible to keep its own area clean and if these, in terms of sidewalks- and so if these benches are on the sidewalk, I would think that would include the benches well do they. I do not think they have their responsibility to clean a tree pit. I mean, maybe not a tree pit, but I think a bench. That's on the and I look frankly I do not know if they're required to clean a tree pit or not, but I think the I do not know it seems to me like that's. A solution also is just to say that you know it's part of the frontage. It's part of the sidewalk and in the same way, that they're cleaning up sidewalk frontage. That is that you know it may not be garbage that they themselves created it's a responsibility that they have under the city rules and they just have to take care of it. Maybe that's an item for will to find out for us, since I do not think yeah. I think, let's get to the bottom of what the rule is at least and not just sort of speculate on it but yeah. I suspect that that's what it's going to thank, be I'll reach out and try to find out. Do not ask colleen because she does not know all right elita. Thank you. I have an item of new business. I'm not sure that you're there yet, but when you are, will you will you come back to me? Please sure? Well, I think all of this is really new business. Yeah. Okay, then I wanted to raise the issue of the air quality at the mts, which is something that the Community board weighed in on a while ago. A back pre- covered everything kind of is weird now, but I do not. I we always asked for it to be measured more than twice a year, which is what I think DEP had said that it would do and to have more air quality monitoring stations. My concern is very specific to this time, which is, if they're, if they tested in July, when a lot of people were out of the city, there were no buses, because nothing was open. Kids were not calling the asphalt. Green people were not traveling around the city as much. There was not as much trash that those numbers are inaccurate and we should ask for some better. I guess denser, more frequent quality of air again, because there's no there's no floor. If we're looking at July as one of the twice a year times that they're monitoring air quality, so I'm just concerned that trucks are still going. There are a lot of questions about whether the other ramp is going to be built and when because of budget issues, but that this is something that they could work with now, especially because asthma is a comorbidity for Covid-19 and asthma rates in east Harlem in that area are high with the Fdr drive. So it's an issue of concern yeah. I agree and I think we'll basically try and take that up next month at the next month. Okay, did I miss that? I'm sorry? No, I have not. I mean we have not. I do not think spelled it out yeah, but I agree with you that it's something we should that we should do so. I think that's, okay, that's the whole world besides taking it out besides taking it up next month, should we as a as a committee, I have a resolution that we encourage the DSNY due to what's been going on for the past six months, whether it's a resolution or a letter from the chair, we could you know, do either at this stage a letter from the chair could be beneficial. Okay, yeah, I would say in terms of a resolution I would like to sort of. I would like to have more of a discussion and leave it for another meeting so that we can kind of hear more about it and and be more comprehensive about it in terms of whether to do a letter, a letter on it, I mean you know, sort of indifferent. I guess I mean I think, if we're going to deal with it at a meeting with a resolution. Potentially, I think we should also just sort of wait on that. Okay, but maybe, if you're going to take it up in November, then maybe you could have someone come from some government agency or some health agency to talk about air and co- morbidity and all of that, especially if they're expecting some kind of a surge or numbers start changing. I know that particles in the air, even cooking particles, can increase the risk of lung damage from Covid-19. If you get it, so I just want to make sure we have the information, if you're going to do it, that we have fuller information from people who know about this yeah, I think that's a good idea is to bring in basically speakers on it and be able to ask them questions and have that inform the resolution. Okay. Thank you all right, barbara I'd like to comment on both things. I have some old knowledge about both of them in terms of the trash that valerie was talking about. The problem is that the garbage is not being picked up. We had a horrible problem on 86th street for a long time the community Board finally reached in, and we got the garbage men to the sanitation department to pick up more often, but when you have full garbage bins, it's not it's. Not the building camp you know does not take care of those garbage it's their own garbage they do so. I do not think the issue is a D.O.T, it's sanitation that has to we have to have better pickup in my opinion, and that will solve it. I've seen people throw something in a garbage bin and it just flies out because it's so full it does not stay in there. So that's number one. The health committee had a very big years ago. I can't remember how many years ago, on the environment of asthma. At that point, I think it was Rebecca C Wright, one of our electeds was trying to pass a bill to have asthma studies specifically because of the transfer station, and my memory- and I may be wrong- is that the governor did not sign it. I think it's time again to talk about it. If you wanted, we had a very interesting pulmonologist, actually from health and hospitals from the Metropolitan, which was good because he was right, acrosss, the street, I mean they know it very much because it's their area and it's something that you can work on it is. It is very it's a very important issue that has been brought up and we in fact we probably do have a resolution. I do not remember whether we did or not okay, but I do not know if there's another pending bill there. I do not know what happened to Rebecca's bill. I think it did not pass and I think it just disappeared. Okay, all right, Judy! Yes, I'd like to go back to Valerie's comment. I do know what the law is and it's the department of sanitation that enforces the law, it's up to the storekeepers to keep their sidewalk and their curb 18 inches from the curb out into the street clean. That includes, if they happen to have a tree bed in front of them that has trash or whatever in it. And if there are no store keepers, then it's up to the building owners or town houses or whoever owns that piece of property to keep the property clean. So if we have these benches that Valerie's, referring to in front of the Gristiti's on First, Avenue and 65Th Street and very often people do leave stuff there, but I've also seen people from the grocery store come out and pick it up and clean up on a regular basis. So that's what has to happen and if it is not happening, then the department, then you should come, give a complaint to will about the department of sanitation and he'll. Take it up with him by the way will the gentleman that we were talking about he's still out. I called him today he's got covey and they expected him back this week and he's not coming back this week, our sanitation supervisor. I would explain why they did not respond when we invited them. Okay, Valerie. I just want to say thank you to everybody, but unfortunately, one of the biggest offending benches I'll, just let you know- is in front of the East 72Nd Street Subway station and supposedly they're, not and I've spoken to the station and even the D.O.T and supposedly MTA has no jurisdiction over that bench and they will not clean it. Just I do not know if that makes a difference you can find out well, but I just you know. I also think, to a certain extent, given everything else, that the store owners have to do it's kind of unfair, to ask them to clean a bench that they did not ask for. So when they've got a lot of other things going on, but anyway yeah all right. Well, that's helpful. I do not know that specific location. We can ask about that. Okay, thank you, yeah. The general question all right thanks a lot, and I appreciate everybody's input too thanks. I think all right. Well, that's all the hands. So I think if there is a motion to adjourn that would be in order motion to Adjourn, so I can have dinner. Okay, move to Adjourn excellent. All right, it's been seconded, no opposition, that's it! Thank you! Everybody thanks! Russell thanks will yeah, of course, yeah. Thank you. Everyone! Thank you.",
            "summary": "We were getting from communities acrosss the city about trash, pickup and rats, and especially during the pandemic, when people are spending more time at home, we saw in a number of neighborhoods sanitation, go up as services were being cut, and so.\nIn response to that, we sent this letter proposing a number of recommendations, but also asking a few questions of the department and hoping that they would be able to get a little more creative and think a little bit more outside the box, but some of their solutions, knowing that especially the time of time, budget.\nThey did not specifically, I do not think addressed the fines issue but said that it seemed like they were willing to work with businesses, and there are a few options that businesses can put to have trash outside of their storefronts or fronts as long as it does not block traffic, which we also know is concerned, especially with a generally crowded streetscape area.\nIt would be a contained area that your bids ideally would manage and then put the trash and recycles in instead of leaving them on the street, and that's something we think would would be an overall positive reform, especially freeing up a lot of that sidewalk space and hopefully helping with the rat issue as well.\nI do not mean to hijack this meeting and talk about something, that's not on the agenda, but if that's something we need a sidebar and put on the end, but I do think that it does tie into sanitation, because there's stuff- That's really adding up in Carlson's park with these protests and the noise, and are we ever going to address that on this board?\nThe the food waste program where at the green market on 83rd street, where grow NYC used to have a lot of containers that neighborhood residents could drop off food scraps for recycling.\nI live on 87th street And, I'm sure everybody knows there is a sanitation kind of headquarters, Building right on 87th in between York and First Avenue on the north side of the street, and I was just wondering if we could ask them to just have a bin put out in front of their building, where residents would happily bring lots of food scrap to them, because it's been taken away from the 83rd street farmers market because of cutbacks etc.\nYou know people can walk there just as easily as we used to the to the farmer's market, and they actually did that once already a couple times for me, just out of convenience, When I first was speaking to some of the guys there they're, like I, think we can ask the men, sorry, which is the institution Department of Sanitation gotcha , I, think we can do that on 87th street It's specifically for food waste, What you're, referring to exactly for food for sure.\nOne also pushing the city to more heavily embraced that clean curbs pilot which they said they're going to roll out, is another good step, because that would ultimately move a lot of trash and food waste off of the sidewalk into enclosed containers.\nThere's, a group in Hell's kitchen called check heads which is forming their own little pilot around that They're doing some organizing around that, but in general those are two kind of next steps, one being destroying the service cuts to being, hopefully embracing this bigger pilot program and as long as you're talking about corridors, I think the intersection wherever there's a subway station, because they live in the subways, too.\nThere's a hole in the sidewalk in front of starbucks, and they I want to ask you going back to the big belly cans that you were talking about earlier and how neighborhoods should either partner with business, improvement, districts or parks?\nAs a community board, we should really take up something to try to push the city to adopt these big belly trash cans, which I think are really effective, particularly around the 86th street corridor, and then one other question.\nCan you just speak a little bit more on what it would look like to use some of that street space for garbage collection, So I do not know if we looked at the underground option, at least in this letter, maybe something we've looked into in the past, and I can kind of see If we've ever done any work around That, I, think kind of how they've envisioned this clean curbs program, Is that maybe on an entire block, there would be two spaces along the streetscape, which would kind of be carved.\nThe road have a much broader array where it's organics and other things as well included, and then that would be the kind of core space so instead of everyone putting their trash out right in front of their building on the curb that would be kind of the one hub And then you'd have the sanitation come However many spots on the block it would be, and that makes the pickup more efficient.\nSo I think in theory, while it might be a bigger initial outlay, hopefully over time, it would be a money- saving maneuver because of the features they're able to provide, but I'm, not exactly sure, of course, right now in this budget.\nYou have a question for Luke, absolutely, I, think the issue with the rats and the trash pickups.\nI did not even think of the issue from the from the rats nesting inside of all the structures that people built up all over the city.\nThere are a lot of factors to consider, including safety, and what have you As a as a citizen, I mean it's a health issue and the more people are outside the more problematic We hear it's an issue, which is why we wrote this letter We know it is a problem, it's affecting quality of life, and we want to make sure that the city is doing everything they can to address.\nWe find a number of the block associations, things like that, but one of the part we get is actually for cleanup and for sanitation services in the district to help plug the gaps where, where there are not where there might be a need for additional service in the past, we've done it kind of two ways.\nYou want to email us or if you run a neighborhood group, you want to find ways we can try to coordinate so we'll get you details, but if it was a good time for let you know that we put 160,000 of new extra sanitation service into the district.\nI introduced with my Councilmember colleague, Antonio reynosa from Brooklyn, who chairs the sanitation committee in the City Council, and it is about the organics recycling, which is composting and regular recycling, which is the stuff that many of us do in our buildings or do in our neighborhoods and before.\nWe are in deep and dire fiscal conditions right now here in the city, and there was ever you know, lots of things getting slashed this year when it comes to services based on the fiscal conditions of the end of pandemic and so to look at ways both to incentivize, better community composting in the city and community recycling, but also to address the possibility of cutbacks on composting and recycling in the city.\nBut it's also about convenience, making sure and equity Making sure that every new yorker has the opportunity to be able to do this in their neighborhood, not just our community, not just based on what neighborhood you live in or what building you live in, but to provide this sort of as a universal service here in the city, and I have to start by, as we were, there's two different.\nYou can bring it down, It's a really small program when it comes to how much money it costs, but it makes sure that we can do our sustainability goals here in the city If you are a good new yorker and doing the recycling and composting that you still have a place to do, it.\nYou know it could be any of these sites where there's a grow, NYC site or otherwise, that it would require that the city is providing funding for, but also ensuring that there are three community composting.\nIt also requires that there's education and outreach to educate new yorkers about how to do composting, what it is and where to go, because a lot of folks do not understand how simple it is, do not kind of get grossed out by it and maybe do not understand like the easy way to do it right in your household.\nIt would be required to have it so that we can start educating people in those areas about how to be able to do composting in an easy way- I mean one third of a New York City's waste stream is organic, material.\nWhat we're looking to do and really, oh, you know, kind of standing up our goal in a cheap in a cheap and affordable way at a time in a fiscal crisis and to make sure that we are doing our job as new yorkers to be to be good, new yorkers and to make sure we're meeting our goals and just to just to talk about who's, supporting it.\nWhat type of garbage container you have our problem right now is that we can't afford people to come and empty them, so you know making them bigger, helps and therefore emptying them less often helps, but we still have that challenge.\nI had actually in a Manhattan delegation meeting with all the council members talking department of sanitation about their plans for this program, both from a community composting, side, mandatory, organics and What's.\nThe future of composting here in the city, which is Where, I said, I, think we should really try to affirm some of the gold here legally in law, but the there The part of that conversation was their intention to start looking at sites that could be unstaffed or unmanned on people, but to be unstaffed and to do kind of drop-.\nI know I spoke to the super of our building some time ago and his concern is again the rap problem and people will drop anything in there.\nAnd then I think it could be up to the department of sanitation to do an RFP or some other way to sort of to determine those there'll be areas where we're going to have more than three, because there's lots of folks who want to do it.\nYou know we can talk about a resolution on this, but I do not think we have to keep council member powers here for that.\nI will say you know the legislation does talk about establishing these at least three sites and locating them, in quote a geographic area that is easily accessible, including for persons with disabilities in close proximity to public transportation, which is all good, but I think we should be mindful, of course, of you know our community district, that we have Roosevelt island, where.\nIf that can be worked into the final version of the of the bill, and then the third point I think, is you know, we would request that that DSNY consult with a community board about their proposed locations, because at the end, Keith was saying that that that's how they would do it that it would be sort of like a consultative, process.\nIf we make one that you know that we would like, we would like to say in it, And I think it's probably beneficial to the city to hear from the community boards about what's useful in and what makes sense from us.\nI would not want anything going on in the park to count against our I think it's sort of a separate issue, but there's probably compost waste being or organic waste being generated in parks with people picnicking or whatever, and I think they're going to have to deal with that.\nThink Manhattan island portion is pretty clear that we encourage the city to to include more than three more than three drop- off locations in each community district, and we ask that We request that the department of sanitation consult the Community Board in determining what the locations should be within the community, district, and I.\nIf we say we urge the department of sanitation to consult with the community boards on the locations of drop- off locations within the community, districts, I think that's also sort of generic and broadly applicable With that wording, we've still got a kind of like a city- wide application in part right And also they should consult with DOE and the parks.\nI mean I sort of think that you know, like the city agencies, could sort of handle that among themselves, would be kind of my If somebody does throw in paper or something that is not organic, so You know, I'm, not an expert on composting.\nI think we ought to just stick with the bins where people who are dedicated to do it would know what to do and schools where they would be lunch AIDS that would sort of be able to follow what to do.\nSo I think there are lots of issues in making schools collection, points.\nIf there are other kind of if members of the public have other items that they want to raise or just other questions that they have for And I do not know if this came up before the problems that we're all having, or at least in my neighborhood of benches, becoming trash, receptacles, and I.\nIf you get it, so I just want to make sure we have the information, if you're going to do it, that we have fuller information from people who know about this Is to bring in basically speakers on it and be able to ask them questions and have that inform the resolution."
        }
    }
}