{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB14",
            "channelId": "https://www.youtube.com/channel/UCnAsiniI4DF7vAAe7omWWFQ",
            "title": "Community Board 14 Executive Committee",
            "publishDate": "2020-09-10",
            "shortDescription": "Brooklyn Community Board 14\\nExecutive Committee\\nWednesday, September 9, 2020\\n6:30 PM",
            "lengthSeconds": "1:02:40"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB14",
            "normalizedName": "Brooklyn Community Board 14",
            "twitterName": "Brooklyn Community Board 14",
            "youtubeChannelName": "Brooklyn Community Board 14",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_BAkpXTYFoKdHVRvswVgtg",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "q_aV7e-8KsA",
            "fillerWordCount": {
                "uh": 101,
                "um": 142
            },
            "readTimeFullTranscript": "23 min read",
            "readTimeSummary": "3 min read",
            "wordCountFullTranscript": {
                "bylaws": 12,
                "president": 8,
                "thanks": 8,
                "website": 7,
                "place": 7,
                "business": 7,
                "member": 6,
                "youth": 6,
                "chairman": 6,
                "summer": 6
            },
            "wordCountSummary": {
                "summer": 3,
                "business": 3,
                "hearing": 2,
                "bylaws": 2,
                "boards": 1,
                "requirement": 1,
                "participation": 1,
                "responsibility": 1,
                "I.": 1,
                "system": 1
            },
            "fullTranscript": "And said finally, and then hung up he's there what's up all right ed, are you there now? Okay? Can you hear me now? Okay, yes, at last, let's just get started, I'm I have to apologize, but we do not have time right now. I'd just like to thank everybody for for joining the executive committee meeting of Community Board 14.. The time is now 6:45 and we are going to get started with a new board member orientation. Two new board members were appointed by the board President Eric Adams. They are khan and Michelle Brunson Welcome. This oriental orientation is to share with you some of the board's resources to assist you in becoming an active board member. I encourage all board members to check the community board 14 website for the many resources there, including Covid-19 Updates, community resources and announcements, Job, education and youth resources. The district needs statement projects in the district and much more, including the bylaws for the board. Please review the membership section of the bylaws and note that board members are expected to be at all monthly meetings. If you are absent for two board meetings, you will receive a warning letter from the chair. Excessive absences can be caused for removal. Each board member will be a assigned to on a standing committee. Please attend all of your committee meetings. You are encouraged to attend any committee meetings beyond the one you serve on and to attend public hearing boards have a quarant requirement for these meetings, so participation is a key responsibility. Please also note that all board members serve as private citizens, not as a representative for a group or an organization. In addition, board members can not represent the board at public meetings or events, unless requested to do so by the chair. Note that the chairman of the board's sole point person to the press to ensure that views are expressed, that the views are those that have been vetting the board's processes to make sure that all views have been heard before a position is used and presented. Everyone will receive a committee preference form on Monday prior to the board's meeting, and the committee will be finalized before the October meeting unless just set up your land, News Community, Board 14 most frequently holds for special permitations with board standards and appeals in the special apartment district in the southeast portion of the community. These are usually for single homes that we vet to make sure they support with the president in terms size and open space in the neighborhood. This process helps ensure that neighbors concerned are addressed. However, in October we'll hear two applications. One is for a home, shelter for 21 deurier plays, and the other is for 1620 cortelli road, and I'm going to ask to a bit more detail about that sure I we spoke actually Joel, Siegel and Fryan. Can you mute yourselves? Your microphone button, I'm getting feedback cool thanks man, so the these are two hearings that will be held in October, but we're talking about them a little bit ahead of time, because they'll be more controversial and because, given that we're meeting remotely, we wanted to make sure that we did. You know, above and beyond our due diligence, to make sure that we, you know, had an early and often notification system to the to the public, so the Department of Homeless service, shelter, which is a plan, not a proposal. So we are not asked to weigh in on homeless, shelters and actually Community board. 14 technically does not have its own homeless shelter. This will be our first but there and it's a new build they're building a building at 21 duria place. So my concern when this first came to my attention in January, was just the location, I kind of said you could put it almost anywhere else in the district and it would be better than 21 jourier place because it is adjacent to 1938 place. 19 derea place is a facility for people with mental illness and is a you know. Constant source of 9- 1- 1 calls because of the residents there. Mostly. Those are medical calls to assist them, but sometimes it's from the community who it you know reacting to some behaviors that are anti- social and of concern. It's also the block that king's theater is on and the new building that will be the 200 bed men's shelter will be on the loading dock practically on the loading dock. So it's that part of East 22Nd street, that was mapped d, mapped by this board to build the back part of the theater, and so it's just lousy. It's a lousy location for homeless men because of the facility next door, because it's a lousy facility for those men who will basically be living on a loading dock of a of a 3,000 seat. Theater. It's not a big deal these days, but you know presumably will return to normal and there will be live, shows and stuff like that. But those concerns they were brought to the detention of department of Homeless services. We met with them and the police and the theater, but they're moving forward with it. And you know so we will hear from the community they will hear from the community. We will I'm sure, work on a you know like a community advisory committee and something like that, but I think that we'll hear a lot from people in that area who the people who live under ea place are sort of really overburdened. I think you know to have a 3,000 seat, theater and now two facilities on their block. When there's only about six houses, it's going to be tough and the people on Beverly road. I think we'll hear from too so that's just a heads up on that and any questions or concerns that you want some early action or you know some research on just bring to our attention and we'll see what we can find out on that and then the other one is the 1620 cortelli road and we did get a preview of coming attractions back. I can't even remember Ed Alvin, maybe somebody remembers how long ago that was. That was my first board meeting. It was my first committee mini, so it's like 2017 or 2018. 2017, okay, wow! Well, that really was not early yeah thanks for your memory, steve, so that then moved forward. That was just like conceptual and now it's an actual application with city planning. It's on our website under projects for anybody who wants the details, but that is going to be a nine- story. Building on Cortolia Road corner of East 16Th street, with about 85 units of affordable housing, it will be a zoning map exchange and a zoning text. Amendment 85 units of housing, 60 of them well, which equals 21 about 21, affordable units at 60 percent of AMI and then 10 at 40 of AMI. But we do not know what kind of units those are. I do not they when asked. They said they did not have the mix. So if they're, all one bedroom, then they're not for families and it's still a pretty high income and if it's for families, then that's a kind of a different story in terms of what affordability means, but we're definitely going to hear from the community on that one, because I already have 240 some petitions, which is a lot. As you know, those of you who've been to a lot of our public hearings. Sometimes we get zero members of the public, making a comment so 240 a month and a half out is a lot, but there are also a lot of those auto petitions like press a button. Yes, I agree kind of thing, so we're going to work on a system of sorting them out to find out who's in the comm in the community, who's actually from Canton Ohio. You know writing in from Canton Ohio, because you know it just sounds like something that they would oppose if they were here in Brooklyn with us and we'll sort out the auto replies, and then the people who've written individually and I'll remind them all that the that the public hearing is in October and that they can actually submit into the public record then, but that's where they are with that. But I do encourage people to go ahead and look at it on our website. Look at the plan. Look at what they're saying you know and get some questions together. I you know this is a board that has been supportive of a lot of developments. Even when they've been controversial- and you know, I want to make sure, though, that the community feels that they're being heard and that we're as supportive of their concerns as possible that you're supportive as their concerns as possible. I think that's all I have on those two things and I'm happy to. If there's any questions now, I'm happy to hear them all right, then I'll. Add that I'm! I want to apologize that those committee forms that we'll send out to you on Monday. We usually put them. We usually give them to you. I think, on the June board meeting, but that's the thing that was in Irena's brain that she would always do, and I just kind of did not remember that we needed to do it. So I apologize for getting them to you late, but just get them back to us as quickly as we can and we'll have the committees formed by October, which is usually when we do, and and thank you to Steve Cohen and Carl Henry Caesar for stepping up mid- year to co- chair, the education, libraries and Cultural Affairs Committee meeting and hopefully you'll resign up for that you're. Here, thanks Ed. Okay, thank you! So, since there is a discussion there, let's move on to, we spoke over the summer and there was brought support to performing a community board. 14 Youth Council, Dwayne Joseph did some outreach and the youth services and public safety committees were part of the conversation along with others. Duane are you here and is Brian Cunningham around? Neither are okay, so I guess if there is any board member who is part of the conversation of committee, co- chairs over the summer who's put any thought into this or still or wants to talk about. You know interest in moving forward with it, because the idea then was like we wanted to kind of hurry up and go and get something going over the summer, and then that did not happen for very understandable reasons, but here we are at September. Is this still an idea that the board wants to move forward any any discussion at all? On that any comments, anything okay, hi everyone, it's Joanne! I do think that we should continue to move forward with this idea. It's not really something that we should table and the Human Services committee is definitely interested in partner partnering with this concept. There's a lot of overlay, so I do not want to see it tabled, especially since you know Dwayne and Brian are not here. Nina has her hand up as well yeah, I'm just going to second that opinion that I think that I think now more than ever, we need to have youth involved. We need to give them things to do that, help them to feel that they are participating and that they've got a voice. Yep, okay, well, the Youth Council is certainly a good idea and there's room for any and all committees to be involved with this. You know if and when we're able to bring some younger people aboard and form this council. You know they'll be working with every committee. I would suppose so. Yeah jump in the fray everybody on the agenda before we move on to other business. There's I just something that I'd like to say to the New board members. You know, as you might have guessed, I am the chairman of Community Board 14. I anything that you might see me do right or show up on time or say correctly. That's because of what I've learned from my predecessor, the former chair of Board 14, the chairman Emeritus Dr, Alvin Burke. He you know, I can't say enough about. You know what I've learned from him. It's not always evident in. You know what I do or say with regard to this position on the board, but Alvin has been you know, a teacher to me he's been my friend and my brother, and he is a true public servant. You know when he stepped aside on the board. He remains a member of the board now true public service. I do not know what is so. You know I just wanted to do my little quick rant. You know regarding my predecessor and my admiration for him. So having said that other business, so I'm going to again ask Sean to give us an update on staffing issues and then a reminder about filling out. The budget request form. Okay, I I'll I'm going to back up first just to the to the Youth Council. Just so I can sort of tie it back together, I'll put together a a concept outline and some suggested next steps for all committee co- chairs, I think maybe we'll use the Youth council platform that the city already has so that we're not reinventing the wheel and if that ends up not being a good fit, we can always jump off, but that seems like a good way to get the word out and then we'll use our youth committee. I mean our youth. What do we call that youth conference page for the for the outreach to try to gather you so we'll try to move those resources forward? So thank you, Joanne and Nina and Edson, who commented on the chat for chiming in on that, because this will be. This is going to segue into the staff report. I promise this will be a sort of committee, dependent effort. We do not. We can't pick up a whole lot more in the office, so we'll need a lot of sleeves rolled up on the committees, and so I appreciate that you want to do that, because I also agree that it's that the time is now and it could be invaluable in our in our community. But the reason why I sound possibly hesitant is because the staffing issues are that there's me and there's anya who's. Four out of five days of the week, I've asked the Office of Management and budget if we can move forward with a personal action to bring anya on for five days a week, and they have not gotten back to me, which is incredibly frustrating they. Actually, the executive committee knows this: there was a request by the OMB to voluntarily participate in a layoff program, and we did not volunteer to do that, and I talked to the committee when that request was made about how we would respond, but then it was ultimately decided not to respond to a request in writing not to put our response in writing when the request was not in writing, so we made so we did ask for them to put the request in writing and you know, as expected, they did not do that. In addition, they did not ask answer my questions about whether or not sorry it's getting dark in my house. They did not answer questions about whether there's a there's, a hiring, freeze and and a pay increase freeze, which I imagine is going to be hard to get a pay increase approved when other agencies are cutting. But anya is willing to come on for the fifth day at her current salary. They did. She did get a slight raise at the end of last year and we'll step up for the fifth day. I also asked if we could hire attempt to do the administrative stuff I'm struggling woefully with the budget stuff, with the with the budgeting through fms and purchase orders and payment requests. It's a ridiculous amount of time for those tasks, but so we're hoping to get a temp. Who would have that sort of experience but, like I said, OMB has not answered my questions I reached out to our liaison in the mayor's office today to see if he might facilitate an answer and as soon as I know, I will let you know, but I would like our bylaws are pretty clear that I do not need board approval to make these personnel action changes. But because there's been some pushback by OMB and by in the past the borough president's office. I would not mind having, I think, it'd be useful to have the board support. Have it documented. So I would like the executive committee to report out on Monday to the full board that I've asked for the board support in adding a fifth day to anya schedule and hiring a temp once the city of New York. Instructs us on how to go about that, so I'll try to get that worded a little more eloquently, but I am going to ask the chairman to bring it before the full board for approval just as backup and additional support, especially given that OMB seems reluctant to be helpful. Absolutely was that, okay thanks. I do not think that was overly candid. I did not use any bad language, so it was not and then what else? Oh, the other thing was the budget. You know every year we ask the community for community input on the on budget requests and we have not received, I think only one, but one form. So if board members want to go to the website and look right on the front page of the website, there's the forum and if you want to fill one out, if you want to share it with neighbors, if you're working with a group that you know is underfunded or has identified funding needs. Obviously, this fiscal year, everything is going to be really tight, but it helps us identify needs for the community for the district needs, statement and kind of just gives us backup when we're asking agencies to restore funding or add funding or add new programs. So please participate in that. It's right on the front of the website, but let me know if you need, if you need to get it another way, and we will have that will be our public hearing on Monday's meeting, so I kind of need them back before that meeting starts on Monday so quickly, please yeah! That's all for me thanks! Thank you, sean any other business, any other discussion I just because Ed you mentioned the this is deep going just because Ed you mentioned the bylaws before I remember early last year around a year ago. This time we distributed the bylaws we considered maybe changing one part we decided not to, but I just wanted to bring it up, because I think the bylaws are about that we're last a minute about five years ago, and there might be some things in there. We'd want to clean up, especially you know, for example, allowing remote voting. Just so you know it's in the bylaws, so we're not doing anything problematic there, not that you know anyone's going to not that anyone's objecting to that, and I do not know, especially with the the what was it the city charter revisions, the community board process. Maybe there's some things we need to clean up. So I just wanted to raise that just because you mentioned the bylaws, I I'm pretty sure we have some sort of legal committee, though I'm not really sure the details of that. I do not know if the legal committee should take the first crack or what the process is, but I just wonder where is that? Well Steve? I think you hit the nail on the head, I think. Well, certainly you know the revision of the bylaws has been a standing thing for quite some time and we've not really gotten around to doing that work and completion. The legal committee, I think, would be the first step there and maybe, but if I, if I can jump in, I think in the past, there's been a bylaws committee that gets appointed by the by the chair. Alvin could correct me if that, if that recollection is incorrect, so maybe as part of the chairman's report on Monday Ed you can and now, if you know you, I do not know if it needs to be a motion to form a bylaws committee, and if the motion passes then the chairman appoints it is that right, alvin. That sounds like a reasonable process. So Steve. Maybe you want to bring it up as a motion on Monday and then get it, get it confirmed by the board and then Ed can ask for violent. You know for people to email the board office to volunteer to serve on the bylaws Committee I'll, try to go through the notes from when it was done in 2015 to give people a sense of how many meetings it was sort of what the level of commitment would be. It might not be quite as much because they were done kind of more recently than the last time, but but it was several meetings and it was over the course of several months and yeah, so it would be people willing to put that time in that's good makes sense. Okay, Steve, so you'll make that motion at the general sure. Let's go okay, any other discussion, any other business, new business old business, I'm not quite sure where this fits in, but I'll bring it up and if I'm out of out in the wrong place, let me know, but it sort of ties in actually with the community and environment. Over the summer there was a in one of the emails we got. There was some talk about some cleanup projects, so I reached out to the scout trooper 611 and said you know this might be something scouts would be interested in getting involved in, and I also mentioned that I told Anya and I'm just waiting to hear back about when we can actually act on that Nina. I think I saw an email go through that was from Stefan Ringel in the borough president's office, who said he would be because that was the program through the Bp's office, and he said he would be your point person. So if you missed that or can't get a hold of Stefan, then I do not recall seeing anything. Okay, I'll look for it and I'll send it off and I'll resend it to you and if I can't find it again I'll, just simply do an e introduction to Stephan Ringel who's running that program at at Borough hall. There's also. A lot of this is on our website too, but there are a lot of opportunities to work with parks because they are really understaffed and really overwhelmed, and so there's some cleanup days in Prospect Park in the parade grounds, but the one that the borough president's office was organizing would be in our community. So that would be great I'll make sure that happened, sorry that we did not make sure that got followed up on. Thank you. Thank you. Thank you, Nina. Anyone else I want to ask if Michelle Brunson is here. She's one of our new members, I wanted to see if you have any questions- and I can also you know- I think I put on the email today, my cell phone number and you're welcome to do that, because I think it's hard to acclimate when you're when we're not meeting in person. So if you want to say something now and mute yourself and speak up, and otherwise just follow up with me by email or phone I'd be happy to talk more about the board, and you know and welcome you directly good evening I was. I tried to figure out how to put my picture on. I needed my kids assistance for that. So I apologize for my picture popping up late, but I was listening in on everything glad to be a member of Community Board, 14., Mr Powell. I made it I'm here and I'm ready for you to put me to work, I'm very interested in the youth committee, the possibilities of if I may work with that as well indicate that on your form, yes Sir. I will also the meeting that I think I accidentally set in. Thank you. Miss Brown that I accidentally sat in over the summer where we had the gentleman from borough hall, the chief of staff, speaking in reference to the precinct community boards having a safe or representative in a committee. I was interested in that conversation, but during the meeting I did not, I kind of felt like I was not really supposed to be in the meeting, but I do have some suggestions that I would like to go over with you sean or you need to draft it out I'll write it out as far as an added addition to the letter that you sent acrosss as well. If there's no objections to that, I'm interested in everything that's going on. Yes, yeah! No, please pitch in on that, and because that's just going to be a work in progress where we left it with the borough president's office was that they were going to continue to talk to other groups and assess broader interest and keep us in that loop. So yeah, let's keep ideas flowing, but I think they do that they. You know, oh we're going to form a committee and it's a dead committee. You know it really is just there and it does nothing and it has no accountability. You know so I wrote out some suggestions and how to make it tight, so it has accountability as well as the entire board gets a say. You know you had it's one thing to have a representative there, but if they're not reporting that it's, you know kind of probably problematic, because the community is looking at the board saying, but you were there, you were at the table, so they want to hold you accountable as well when there needs to be some distance between as far as I'm concerned and I've worked on a lot of these city- wide commitments. Okay, so you know keep all ideas around. I thought I saw. I heard someone else trying to make a comment there, Shahid, were you yeah good evening, everybody good evening? I just want to share that in these days we are watching and observing the gun, violence daily, and we are watching shootings and a lot of things happening in community for 14 and all over the Brooklyn. So I think, if you, if we discuss and take on board samurai present and we chalk out any programs for the awareness and meet with the community leadership and other guys, as you know, that Jumani William Rodney Bishop elected officials are also walking on the road and they are announcing and have a chat with community. So I think if we also make a plan to or take on board several present with the inspector, so maybe we have a good peace situation in the community. Thank you. Thank you. Shaheed just kind of stay tuned keep checking out the what 14 webpage for the next meeting of that committee, and you know that you know everybody is facing that same situation within this board district. So you know we doing intend to at least I do intend to be active on trying to do something about that. But you know just stay tuned, keep checking the board's web page because we also want to know the is there. Any development that borrow President gave us a proposal to Community, Board and present and all the these issue together with the Community board and present. Is there any development about that proposal? The proposal that the President put forth to all community boards- I mean we did meet on that and we did agree to a limited kind of sign- on Sean. Could you speak to that yeah? It's. I think it did not move very far past. The last conversation we had because of summertime months, but I'm happy that I'll reach out to Ryan Lynch, the chief of staff over at Burrow Hall. Who was our point person on this and and started to Michelle's point. You know just follow up and keep them accountable and keep them moving forward and ask them what you know where we're at in the process and that we're still interested and we still want to be engaged. Oh and I'll. Let you know what he has to say. Oh thank you, hello, hi, Sean, hi, Sean, hello, hi Glad. You made it go ahead. No I've been on I've been behind the scenes. Yeah I did get on. Thank you for the suggestion now. I just wanted to say that I'm also part of the seven oh interfaith Clergy, Council and Mr Khan is, and the detective Nuzi and Kim have been informing us about some of the shootings that have happened that have occurred and the president of the Sevino Interfaith police, Precinct, Clergy Council, has gone out. He there was a March. We did one with the bar president and on Sunday night, with their public advocates with God Squad, the six seven police, Clergy Council, so we've been visiting the sites and I've actually prayed foreign folks, and you know just making the presence known in the you know the spots where they've been shootings and as detective nuzi has let us know, and so even the other night. He acts that we go to a site that had a large party and saying God. There was no gun violence on that night. You know just going and speaking- and you know talking to the folks so yeah there have been some groups that are out there that have been out there for the summer and we've been in touch with the 7- 0 precinct yeah. So just wanted you to know that that's excellent for just also Wanna, just you know, as I mentioned before, keep in touch with the board office or you know, by way of the webpage or phone in whatever, but try and be present at the next meeting. You know public safety. Okay, right, you know we can develop something out of out of the board some kind of response out of the board. Okay, yeah cause we're you've got crisis and ed you'll, the 7- 0 in case Michelle does not know this. I think all of the Veteran board members know, but it is also the president of the 70th police, Precinct, Community, Council and Ed. Your monthly meeting will be on the fourth Wednesday on the 30th again on the 30th this month correct the last Wednesday of the month, which I believe will be the 30th okay, it is yeah. So I want to encourage a lot of participation in that as well. Not to give you know Ed more to do in terms of handling a big crowd, but the, but the commanding officer of the 7- 0 is not as community oriented as some of his predecessors, and so that's kind of you know he sort of dropped off our my district service cabinet meeting after about 10 minutes today. So that really needs to be a place where the community shows up. You know what is it about? You can't bring the muhammad to the mountain muhammad to the mountain mount to the muhammad. You know what I mean like just go, be there be present for that meeting. Please absolutely, and you can get information about the meeting again by being in touch with the board office or continuing to monitor the board 14's web page. Okay, I have on my calendar here that September 30th there's a public hearings. Is that a conflict? That's right! Glenn! It's going to be it's going to be a doubleheader baby, we're going to have a 6:30 public hearing. It's going to be a real, quick one though it's a special permit here on Olian Street, and I and I promised that we would release him by 7 30.. Honestly, I think that's going to be a 6:37 public hearing and then Ed will go then you're going to sign off and then sign on to Ed's meeting it's going to be a good night popcorn make your popcorn I'll, take off one hat and put on the other and just keep it moving. Okay in any other business, any other discussion. This is album. I just Wanna. I just want to thank him for the very gracious well alvin I'll. Second, what Ed said. We appreciate your continued guidance and thanks for picking up the mantle Ed. Is there anybody else? Okay, here I am class dismissed I'd like to thank everybody for joining us. So we'll conclude this meeting now at 7:26 thanks again for joining us thanks everybody is it to you all right. Thank you see you back good evening. You.",
            "summary": "I'd just like to thank everybody for for joining the executive committee meeting of Community Board 14.\nYou are encouraged to attend any committee meetings beyond the one you serve on and to attend public hearing boards have a quarant requirement for these meetings, so participation is a key responsibility.\nWe will I'm sure, work on a you know like a community advisory committee and something like that, but I.\nYes, I agree kind of thing, so we're going to work on a system of sorting them out to find out who's in the comm in the community, who's actually from Canton, Ohio.\nThe committees formed by October, which is usually when we do, and and thank you to Steve Cohen and Carl Henry Caesar for stepping up mid- year, To co, chair, the education, libraries and Cultural Affairs Committee meeting So. Since there is a discussion there, let's move on to, we spoke over the summer and there was brought support to performing a community board.\nNeither are okay, so I guess if there is any board member who is part of the conversation of committee, co- chairs over the summer, who's put any thought into this or still or wants to talk.\nYou know interest in moving forward with it, because the idea then was like we wanted to kind of hurry up and go and get something going over the summer.\nWe can't pick up a whole lot more in the office, so we'll need a lot of sleeves rolled up on the committees, and so I appreciate that you want to do that, because I also agree that it's that the time is now and it could be invaluable in our in our community.\nLet you know, but I would like our bylaws are pretty clear that I do not need board approval to make these personnel action.\nSo I would like the executive committee to report out on Monday to the full board that I've asked for the board support in adding a fifth day to anya schedule and hiring a temp once the city of New York.\nBut let me know if you need, if you need to get it another way, and we will have that, will be our public hearing on Monday's meeting, so I kind of need them back before.\nYou know for people to email the board office to volunteer to serve on the bylaws Committee I'll, try to go through the notes from when it was done in 2015 to give people a sense of how many meetings it was sort of what the level of commitment would be.\nSo it would be people willing to put that time in Okay, any other discussion, any other business, new business old, business, I'm, not quite sure where this fits in, But I'll bring it up and if I'm out of out in the wrong place, let me know, but it sort of ties in actually with the community and environment.\nYou've got crisis and ed I think all of the Veteran board members know, but it is also the president of the 70th police, Precinct, Community, Council and Ed. But the commanding officer of the 7- 0 is not as community oriented as some of his predecessors, and You know."
        }
    }
}