{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "title": "CB7 Housing Committee",
            "publishDate": "2020-11-10",
            "shortDescription": "",
            "lengthSeconds": "1:59:45"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "qaqNR-4s7_U",
            "fillerWordCount": {
                "uh": 89,
                "um": 372
            },
            "readTimeFullTranscript": "70 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "housing": 79,
                "residents": 47,
                "development": 45,
                "developments": 40,
                "units": 31,
                "conversation": 29,
                "conversations": 27,
                "management": 26,
                "place": 22,
                "council": 19
            },
            "wordCountSummary": {
                "housing": 31,
                "residents": 19,
                "development": 14,
                "conversation": 10,
                "conversations": 10,
                "units": 9,
                "developments": 7,
                "section": 6,
                "management": 5,
                "fact": 5
            },
            "fullTranscript": "So we're public but I want to start the well wait a minute. Let's see it's 6:25 I'll give a couple of minutes before I start the webinar and let the attendees- and there were not that many people registered for this meeting tonight. Oh really yeah good I'd like to Rob it yeah I'd like to try to get some concrete next steps out of last week. So hopefully we can do that. Okay, Robert I've always been impressed by that beautiful color on your wall. Behind you there I can never pick out colors that well, that's you got ta unmute yourself, yeah robert you're, muted, yeah. That guy was an artist, and you know you pick your color, but you can't always predict the outcome. So he got it to the point and he says well after meeting you, I figured I put seven coats on and in his colombian guy he says, because in spanish a code is Amano. He said like that. So I do not know what you would do to me if that color did not come out right, but that's a lot of pain on there yeah it's nice makes an impression. Everyone have a good weekend of celebrating and I've been celebrating two days straight. I go to all the plazas and hang out have my coffee, my cup and my croissant go to union square. Go to client park, go to Frederick Douglass go to and those were the three I went to nice, but I figured life was celebrating too because we have beautiful weather. Yeah I was just telling madeline that I was down at the corner of my block and there were spontaneous celebrations on the corner and one of the nicest parts was that people would cheer every time a postal worker went by right. Yeah, because you know the mail in ballots was the deciding vote or the deciding factor right. Yeah I was in Brooklyn with a friend and it was absolute pandemonium. It was like streets just filled with people reveling. You know in a legal way, but you know it was. There was a lot yeah. We used to back in the day mark we used to go out to Grand Army Plaza, which is one of the destinations, of course yeah. There's nothing like celebrating in the street. It just is not funny. I'm going to start the webinar that'll, let the attendees in if there are any none yet who are we missing from the committee? Oh Ira, Annette Paulie, and no oh yeah, Jeanette, yeah, Jeanette, Susan, yeah and I. Guess polly polly's, not officially a member, but she usually comes, but there she is. Oh okay: we've got ta, try to publicize things better I think these kind of things I just saw something where Gail sent out something for community Board, one wanting everyone to know about it. Right. It's about governor's, island, yeah, no I, know but I. It would be interesting if Dale maybe had a list of interesting sessions that were coming up for community boards. You know not everyone, but obviously something like this I do not know how she would pick and choose, but that's true, my season we'll give it a few minutes before we well. We need the council member too. Do not. We yeah I mean yes, just you know: elected officials run on elected official time, so, if necessary, we can flip the agenda. So so, okay, oh huh, a very quiet meeting, yeah madeline you're on mute I, do not know if you're trying to speak or not oh I said silence is making me go to sleep. Okay. We do not want that to happen. You know and Lisa makes a point- that's important in the historical context of the committees, because there are subjects where the public just does not want to hear it. There are subjects that are explosive, the most certain and different shelters and the whole thing. But when you deal with certain subject matter that are critical also- and this is in my long experience in Db- the public does not really want to hear the details of what you're talking about. So I'm with you when Luisa says suggest that the world president in certain instances, should send out a general notice that community board x is going to have this theme on this evening and we encourage city-wide attendance I. Think that's a clever suggestion and I think we might want to do that in the future, even with a committee as hot as housing. All of our sub themes are not well, not a general interest. You know, but I think it's like what Melissa said. You know it depends it's all so subjective to me. It's really interesting, but obviously not as interesting as the Lucerne hotel yeah, but when the Bob President sent something out city-wide, it does make a difference and more people would be interested in it and that's what I'm talking about yeah. My guest is here: yeah hi and oh another council member Helen lots of fun I. Of course, I'm here. If my sister like is here, I'm here, hi everyone you guys are in for a treat, but I'm going to check out there well welcome council, member to CUNY birth, Seven's housing committee and we're so excited for you to join us for a discussion about public housing and some other models. We've seen be very successful in other locations and sort of how that relates to the pact program in our district. If I can just give you a brief introduction for those who are less familiar council, member Andrew Samuel represents parts of Brooklyn, including bed, Stuy Ocean, Hill, Brownsville, East, Slot, Bush, Crown and Crown heights. She was elected in 2017. She chairs the committee on public housing, which is why she has been so great to agree to come, speak to us today, she's actually also a former employee of NYCHA and has worked in the offices of several elected officials prior and I'll, leave it there and kick it over to madeline. If you want to make any additional remarks, oh yeah and just housekeeping if anyone has questions, feel free to put them into the chat. As always, let's keep our chat friendly and positive and at the end of the meeting, we'll open it up to public comment. But if you have specific comments for the council member or on this topic, you can raise your hand during this agenda item because we want to make sure you get them in while she is with us. So how are you council member? Thank you for joining us hi? How are you I'm good? I'm glad to see you here and I was so impressed with that London webinar that I had to get you here. It sounded like that they were doing great things and not saying every solved issue is, can be resolved with what's going on in nature, but I would I just wanted you to be here to explain how it came about that you went to London and also visiting with us to cambridge to look at that housing stock, and also this is just a little I want you to explain how we can go forward with the comparisons with the pact and the rad and all the things we need to go and forward, because, as I do not know, if you may know, we had an advisory board and we could do resolutions. We could do so much, but if you could guide us in the things have you done guide us in the way that we need to go in a direction where NYCHA will listen to us? Okay, all right! So first you know thank you for the invite and whenever I have an opportunity to speak about public housing, I jump to it, because it's so important and Melissa. When you said introductions, I thought you were talking about introductions to the work that you all been doing and what you're working on I did not think you were talking about my introduction. So you know I'll just jump right into it. Since it's a conversation- and you know that's really what I'd like to do. The most first I did work at NYCHA. I was a senior advisor there to the avp of community engagement and partnerships, and that was sadia Sherman, but prior to Sadia, Sherman was Melanie Hart, and that was when I'm not sure if anyone's familiar with Deidre Gilyard, who used to work at NYCHA was running community centers that was before dj. Even left. I knew her well yeah and NYCHA has I think it's such a shame that they close down the community centers and what we see happening across all of the developments across all five boroughs, with the lack of activities and space for our young people. I. Think a lot of it has to do with the fact that they they closed down, to see the centers and then did those rfps to community-based organizations where some of them are amazing. But you know, a lot of them are not just are not connected to the community. So I just wanted to. You know say that so I did work at at NYCHA, but I also worked at before. It was breaking ground. It was common ground and did a lot of work at common ground with organizing of NYCHA residents and then before that some years ago, I used to work at got it Riverside and I used to work in one of the developments on 92nd and Columbus and Amsterdam I can't remember which developments, but we had a outreach team to mentally ill homeless and our office was in the basement of one of the developments up. There is that the hostess, or something like that yeah it was project reach out with guided Riverside and I, can't remember the development on the corner. Senate, maybe not the Senate, but it was another one. So the Senate was down the street, but it was one of one of the developments and that's what the case management services were. I was in wise tower. Yes, exactly thanks, doug exactly so like, so this has just been my world and my life for a very long time, and that was in the 90s before Margaret Lopez actually ran for City Council when she left the got a Riverside project reach out team I replaced her. So that's this that was that was in the 90s. So anyway, there's a lot happening with public housing, not just in New York but across the country, and when we speak directly to what's happening at NYCHA. We know that this is six hundred thousand residents that live in in our natural developments. 174,000 apartments and there's about a 50 billion dollar need for repairs under George, W, Bush, listen to Cnn or Msnbc right now, and so there's a there's a realistically a 50 billion dollar need to fix apartments, and we know that NYCHA has had its issues of poor management, piss, poor management and that lack of management led to lawsuits related to mold and lead. And now there's a you know, a settlement agreement with the U.S attorney's office in the southern district. There's a federal monitor in place and everything that NYCHA and the city does related to their units have to go through this federal monitor. They have to provide action, plans related to mold, Lead, elevators heat and hot water systems, pest control. They have to come up with a new organizational plan and that's all going through this federal monitor. So they are in some real. You know serious times, and that was before Covid-19 hit right and I just wanted to put that information out there related to Covid-19, because it's important for every nature resident that tested positive for Covid-19. The statistics show that nature resonance died at twice the rate of the coronavirus compared to the rest of the city average, and you know clearly that's because of the living conditions, but also everything else, that's associated with those nitrogen developments and not just the nitrogen developments, but the communities that surround the nature developments. So when we're talking about you know, can we're going to talk about rad and everything else, but there's so much more. That's happening in NYCHA right now. Rad is just one aspect of it right and they're. Also talking about developing on vacant space vacant land empty space under utilized space, whatever you want to call it, and those are those infield deals. The Infield deals will you know well known during Bloomberg's administration, but when De Blasio came in it continued and that's the development of you know single buildings on a parking lot or on you know, park grounds, playgrounds, you name it and, in addition to that, there they've also sold air rights and are now discussing and going through development designs related to utilizing the open space and air rights of NYCHA properties. So that's air rights. That's infill deals as well as the red which is the renovation of the units and converting them from traditional section, 9 public housing to section 8 with private developers. That's I'm just curious what your take is on before we get to you know, rad packed. What's your take on infill and air rights transfers? Do you think that they can be beneficial or do you think that how they're being executed is problematic? I'm just wondering I think that anything could be beneficial. If the community feels that it's beneficial I think every community is different, every borough is different and I think what makes it so problematic and so challenging is the fact that what's missing is the voice of the people, the voice of the resonance and the voice of the surrounding you know blocks. You can't just come up with plans internally, you know in a border room, you know at a conference table in NYCHA and within you know, HPD in city hall, without incorporating not just the input from the residents, but residents should be an integral part on the decision making and that's what I'll go. You know and that's and that's why you know: I love what I saw in in London and I'll talk about that the fact that residents should be included at every single aspect from designing you know just the ideas and first should we have a building on this parking lot. You know that conversation that decision should be should be from the people, and that has not been the case across the city and just a quick example of that and I can use. Recent infill deals the 50 concept. There was one at Isaac homes, 92nd and 2nd avenue in Manhattan on the upper East side, that particular development. The community members, you know decided clearly that if they're going to have a building built, it should be. You know, by the basketball courts, overlooking the FDR into the in the water and NYCHA came back and said that we're not going to go with plan C we're going to go with plan a which is to build on this playground across from the Daycare center on this little triangular space and the community was upset about that. Rightfully so, and it led to the borough president doing what you know: Gail Brewer decided we need to file a lawsuit and the same thing happened in in Brooklyn a development called White, Corp gardens. The residents were just adamant about being part of the selection committee and HPD came back and said you do not have the skill set to be part of the selection committee and there's also a conflict because you live there, you know, and and you know you have to have disclosure agreements and everything else. It's like what do you mean, let's figure out how to make the residence part of the selection committee and move on. You know, there's enough lawyers in place across this city in every agency to make it work, but they that was not the priority. They did not want the residents to be a part of, and so you know push back lawsuits. You know, protests and rallies and so for me, I think whatever. If it makes sense, then you know you can move forward with it. In my own personal experiences, I have a development, Van dyke houses, and we have two infield deals in the middle of Van dyke houses on two parking lots and the buildings were all already close and they do not. They do not face the street, they face inward, and so the residents were always looking at each other. Now, they're, looking at a new shiny building and the new shiny building is not even for the residents, you know it's housing connect, lottery process and so they're now seeing people from outside the community moving into this brand new, beautiful, shiny building, that's not for them and that's the purpose of them not engaging with the residents because they feel they feel that if you do not like it get out, so that's the concept that I feel that they're doing you do not like what our plan is. Then you do not need to be here so and engaging other people to move in and so and you and so and again, I'll talk about this in London when London. If they're doing an infill deal, they will build a brand new building and in that particular development, where this new building is, they now will move relocate the residents from the same development where this new building is into the new building and then once they fill up the new building. They then will either renovate the building that the residents moved out of they will either renovate it or they will demolish it and build something new, but the process is the only people that are going into this brand. New building are the residents that have lived there for so many years, and that makes sense- and so that's why this is this conversation is so important to me and I enjoy having them, because in New York you know we will say we will hear the administration say. The administration I always say that everyone, just you know when I say those people, the administration. You know I'll talk about the mayor HPD. They will say that New York is too big to do what these other places are doing. You know the scale is different. New York has the you know, largest content, the you know largest public housing across the country, and it's like okay. Well, how about the fact that London has more you know. London has more people that live in public housing and more units, because it's council, housing- and you know- they've- been doing this for so long and they are figuring out a way to do it, and so that's no longer the excuse that we're just too big and too large of a city to include the voices of the people and we have to do it our way. That's it just does not fly anymore, especially now. Yes, Mr Robert, I'm seeing it ironically. What you're describing in London is that was the model of NYCHA original developments. I grew up in what you call now Martin the king used to be Stephen, Foster and I also grew up in Jwj and when the hot existing housing a lot of brownstones and that sort of thing apartment houses were raised and the people living there were relocated. When the new project opened, they had first dips. Anyone who wanted to come back went first and public housing in the 50s in the early 50s was really comparatively luxury housing. It was new, it was clean. Everything worked, the maintenance was up out of this world. There were all of your neighbors everyone, you grew up with, and the old housing came back and it was just a wonderful place to live in okay. But the point that you made is that that's the original model in New York City, so for them to come back a couple of decades later and say: New York is too big nonsense. You point out, London has more, that's it and New York did it already, so there really is no excuse for not honoring the legacy of public housing systems for what it's? What's on the table, not what's on the planning table now, it's interesting to say that because and I and I think that that's why I'm so passionate about this work. My family lived in what was called the prospect market in the 50s and they had to relocate from their home because they were going to build the NYCHA development prospect, Plaza and marcus garvey houses and so and they lived in the tenement buildings, and so they relocated them to farrakhan houses, which was already built, which was just built, allowed them to live there and when they developed prostate Plaza and marcus garvey. They, then you know, contacted my family and said: okay, do you want to return and it was allowing them? You know the first opportunity to move back into the community and into the developments that you know cause them to be displaced, and so we moved back. My family moved back, and so that was the case right and what's interesting about prospect. Plaza is that fast forward to 2005, prostate Plasma was one of the first nitrogen developments to be demolished under the hope, 6 plan in New York City. So when they started to demolish developments across the country, public housing units across the country, prostate Closet, in New York City, was one of the first, and so a lot of my family members were displaced again and it took almost. This was 2005 where the buildings were leveled and they redeveloped the area took about 10 years, and so the community is just coming back, and so we know what it's that. So there was a model in place like you like, you said, and they did the right thing, but then we also know what happens now when you displace families and what happens to the communities under these new laws. And you know new administrations. It takes too long and people do not have that opportunity to come back. And so the purpose of this conversation is to you know just to make people aware that there are options and I think that we need more people to speak up and fight and advocate on behalf of public housing residents to say what we're seeing today is just not appropriate and that, if a rad development, if a conversion development is appropriate in far rock away and the residents love it there, it does not mean that that's what we need. You know in Jackson houses or you know, wherever and so again that conversation should be with the residents themselves and also when you think about it. If there's, if there's a 50 billion dollar capital repair need- and we have 20 billion dollars that we can actually utilize. Clearly, that does not mean that every single 174,000 units should be converted to section eight. How about we have a conversation with the residents to find out which ones want to go through the Rad program? Who is interested in and not doing at doing that, and they only want their developments to be renovated and still full under NYCHA. Maybe that's you know 10, and they can then utilize the remaining funding. That is absolutely available under section 9. But that's again, that's having that conversation, because some residents do not want anything to do with NYCHA and some people feel more comfortable with making sure that it continues to be traditional public housing because of the tenant rights that follow that. Because this part, you know it's built into the HUD regulations. So some people are comfortable in remaining under NYCHA if management changes. So but another thing, I want to add what the new chair Greg Russ is doing. Is he has submitted proposals to again convert every single unit from section 9 to section 8, but also to create something called the public? Housing trust the Hou, the housing preservation, trust, and so it would be something very similar to the school construction authority, where you have this public trust that is, in a sense, the owner of the developments and they're, the ones that are managing and operating the aspect. The whole aspect of the public housing authority, but through this public trust, and they would be able to generate money because it's a trust through bonds and everything else, but it's not NYCHA, and so he that's something that would require state legislation and we now have Senator Cavanaugh and Assemblyman symbolics, introducing legislation in both houses, the Senate and the assembly, and that's something they're looking to push aggressively moving forward. But when you speak to Council of presidents, when you speak to District Council of presidents, when you speak to the average resident, they do not even know that this is happening just they might have heard of it. Sorry I just wanted to ask about on that. What are the risks and benefits in terms of like rights of residents, because it seems a little less clear than with rad? So and that's the thing right now. You have public housing residents have rights under HUD regulations, and you know, for instance, if you just talk about rent, if you bring home, if you earn a hundred dollars, then your rent will be 30 right and that's just what it is. It does not matter. It's not a situation where you know you have to earn a certain amount of money like your like, affordable housing units or you know. If you live in section 8, you have to you know, continue to recertify and you do not. You know make sure that your section 8 voucher is together and you're doing what they're supposed is not that's not the case in public housing, whatever you earn your inc, your whatever your income is. Your rent is based on that particular income. You know you can't get thrown out for just anything. You know, there's systems in place right that you have to adhere to and that's there's HUD regulations that speak directly to that, and so the risk involved is basically, you have to negotiate every single new development lease and deal with any conversion, because you're no longer going to be part of HUD public housing authorities is going to be a new entity is going to be a private entity, and so we have to make sure that legal services are involved which they are, but they are, you know they have the bandwidth and the capacity to help negotiate. All of these new leases, you know across the board, and so with the city I mean with the state based on the language of the new bills. They are trying to mimic the exact language from HUD, but at the same time, these are legislators who do not live in public housing that are dictating what these laws. You know what the new language should be, what the rights and protections should be did the rights and protections that fell on the HUD makes sense. Some of them are really archaic. Like the you know, exclusionary rules like the exclusion rules right the fact that you know you might have you know a loved one that was incarcerated and coming home, but you know under the language of HUD and NYCHA they can no longer return home because they have a felony right. That should be, you know overhaul. So there are so many nuances and so many things that we should be looking at to change. If that is going to be the case, that could be beneficial, but again the residents are not part of not even a think tank. You know not even a brainstorming session. What do you want to see, and so that can be problematic and right now there's you know no one, there's such a lack of trust in government and in systems and in all administrations on the city, level, federal level, state level, and until we are able to sit and make sure that the residents are part of the entire process. I do not think anything should move forward. Not now I think Jeannette's hand has been yes, hi, Mona Lisa's by the way, just in case you do not see it. Thank you, yeah I did this. Thank you. This is really wonderful and I have too many questions and thoughts, but with 50 billion neat capital needs. I understand the desire to go for a mix of the private sector, the public sector, I'm wondering if the same way that sort of a lot of other sort of major development is going forward these days. If the non-profit sector might also be a partner in that, so you have the triple of them. I'm also wondering with the federal oversight. While that was complained, you know I know the mayor did not want that and it's been going on, but is not that in a way forcing the Federal's arm to be involved in public housing where otherwise they've totally sort of abandoned it. And hopefully you know with the coming administration and at in Washington or something we will see some funds and then the third thought I had was I mean I, absolutely agree that it's all about resident participation from the start and I. It's so hard when you can't, when there's so little trust, but I almost think that I was involved in a lot of community board 197a plans when, where the community board would do sort of a plan and then propose it to city plan, I, wonder if you know some of the NYCHA developments. We could not get some kind of small grant or something to do a master plan for themselves so that it's not the city coming and saying. Oh we're taking your playground and going to build this market rate housing and then we'll have 10 million dollars to put towards your heating or something, but that there could be some proactive aspects and I'll stop there. Okay. So when you first started, I and I want to apologize, I was listening like oh I'll respond, and then you continued and continue to continue. I was like oh wait. Let me start to write. Oh so I'll just take a step at it all you know, I'm just put it all into context and again have a conversation. First I think that we should definitely be working with. You know some of your affordable housing developers and community-based organizations all day long I think they should be at the top of the list. I do not think that is it that we should even be having conversations around. You know these private. You know billionaire developers because they do not care it's about making money and, if you're, coming in with the mindset of just making money and we're talking about public housing, it's just a bad setup from the beginning and I really believe that what we're seeing right now in New, York, City, we're developing everywhere and I know personally. I have partnerships with habitat for humanity, and I have used my own capital dollars for City Council dollars in order to get more units for my habitat units, and my habitat units are co-ops, and so, if I am developing cooperative units in my community that are all literally for you know, they're truly affordable, and this is with city dollars. And this is a development deal. We should be able to invest those same types of dollars in our public housing units in a way where we can have conversations about converting the units to co-ops the same way. We had those conversations with the Mitchell llamas, and you know back in the day, and we talked about workforce housing. We should be having those same conversations with our unions and with state, and you know, local government and being able to apply capital dollars to renovating our units and have an ownership structure. It should not just be infill and air rights and the section 8 conversions. It can also be remember. We had the till program with HPD and we did the hdfcs we talked about. You know we worked with helping the tenants renovate their buildings, find you know, opportunities to be able to get mortgages and funding to renovate and for them to be able to then own their units. Those models exist, they're still in place, and we are now even having those conversations around third-party transfers and the fight to make sure that these tenants to continue to you know be able to own their units and working with them we should still be able to. We should be looking at the like a variety of structures that are in place and models that are in place in New, York, City and so I. Do not think that we have to look at like wealthy folks to bail us out, like that's not the case, because they're not coming to the table with anything we're giving them money to develop and then we're giving them these vouchers. So how about we come up with? You know, resident management groups and the resident management groups partner with the affordable housing developers, and we create those you know, entities in order to really get us out of the situation that we're in and those structures are in place and the regimen management groups that language is already built into the Hut is part of 964 regulations. We just do not do it because there's been no, it was not prioritizing. There was just no will of the people. There was no push because you know facing we're talking about public housing and as far as the federal monitor in place and that being a push for like federal dollars, Federal funds, the agreement itself put New York online. It did not the federal agreement and the federal monitor did not put the federal government on the hook, and that was De Blasio's complaint. You know here: does we have this agreement, but we have to put the money for it. We have to pay for it. Even the salaries of the federal monitor himself, you know, and so I am hopeful in a change in the federal administration, because at least we know that there is that 70 billion dollar you know part of the Cares Act and the the infrastructure bill. That's in place that speaks directly to 70 billion dollars across the entire country and 30 between 30 and 40 bill. 36 billion will come directly back to New, York City. So at least we will have a big bulk of the public housing funding for capital improvements that we would actually need and could use, and so I'm hopeful in the change in leadership on a federal level I think it's going to make a huge difference, which will also force us to have another conversation with Greg Russ to say what you have presented to convert all of the units. Is it necessary now that we have another? You know, structure in place. Does that answer anything tonight. I think the other piece Jeanette had asked cause. I was taking notes, was about residents, getting grant funding potentially to do community planning, which you touched on a little bit with so and that's a so that's so that is huge and that's also part of what they do in London. You know reason number 365 of the great things that you know come out of other places in public housing. So that's something that we have also suggested, because when you look at what London is doing, the government actually works with the residents and provide them with funding to be able to hire experts. So you know they. The resident leaders, you know have somebody in place to you know, help them like our architect. Who will say this is what your developments your buildings look like now. This is what they could look like. This is what you should be. You know fighting for, you have you know a financial manager or you know, an accountant in place. That's that works directly with the resident associations to say this is what it will cost, and this is what I think you know you all can be. You know looking at and coming up with. This is how much it will cost for you know 250 units on this particular site and it will take five years, and so there are experts that will be assigned to the residents that will help them come up with their own plans as well, and that's how they're able to come up with an agreement and really be part of the conversation, but that planning piece of it is huge in the beginning and that's to get the residents engaged in the planning process or just the concept of you know. Can you imagine something different in your community? My thought is: why wait and ask permission? Why not you know I do not know, put together a group and get a Ford Foundation or a Rockefeller brothers, or some kind of small grant and have take one project. Take the large, take queensburg, take up, take a project and build a master plan that okay, if you want to build in this playground, we're going to redesign the landscape, and now we have more people on the site. We're going to have this better playground over here, and this is how the phasing can be so that nobody's displaced, and this is how the building should be orientated or such I just think. That would be a really worthwhile exercise that then, could demonstrate to the government entities that residents have value in participating and that there's more than one way to the best way to repair NYCHA housing is by all parties working together, not for you to single out the most lucrative corner of property that can become market rate housing and then have some spill over cash. What's interesting. What's interesting is that's the conversation that we have been having with community-based organizations like that's the conversation that I'm having with community solutions right. That particular organization was working with that my Community Land Trust group was working with community solutions, and so we were looking at. How much will it cost to have like community navigators and and how much will it cost to have planning partners in place in order to have these community conversations and design charities that have nothing to do with the city, but also those are the conversations I also had with our speaker before Colvin and before this conversation is when we were discussing the increase in funding for the community boards, like the that 40,000 increase with the community boards, and we were hoping that I do not not the collective council but I, know and I'll speak for the 41St council district. We were working directly with our land, Use committee and our housing committees to have that full conversation around being able to hire someone that can directly. You know, have intentional and you know, focused conversations and meetings around land use and housing development on the community board level and being able to work with the surrounding public housing developments, because in my district, I have actually have 27 developments. I have the highest concentration of public housing in north America in my council district and so for me to have a conversation with my community boards. I'm also having conversations so public housing is clearly included because of you know, I have so many developments, and so talking about land use and talking about development includes my public housing residents and associations, and so it's working with them and making sure that they have the talent and expertise at all meetings to have a real conversation that when we are talking about the state legislation, the state legislators submitting a a bill about the public trust that is reflective of the residents submitting what they think the bills should include and when HPD is having their conversations around infill. The residents are saying this is what we came up with and so okay should we call on Monalisa? Sorry, I'm just going to say that speaking of you know resident involvement, can you calling up Mona Lisa? Thank you. Mona Lisa. Are you with us? Mona Lisa is one of the ta presidents at the dome on the Dome Project Mona Lisa is Melisa. You can you unmute? Yes, I really felt very left out, I'm so sorry, we generally call people up when that when it's time to speak, that's all there's no disrespect, I'm sorry, if that, if it did not come across so it's different. This meeting is different from the last meeting that we had. Yes, it is I think also we're sort of you know still figuring out what our best practices should be on zoom, it's very important. Controlling me, I mean we were good last week I. This was one of the things that we spoke about, but that's not what I'm going to talk about now. I guess! Well, thank you. Let's you and I talk some more about that. Another time and later, thank you. Take advantage of the time with a council member. So again, how is this information that our the council person here? Oh what's her name, Malika hi alika, my name dome site, is on West 84th street we'd I also sit with the federal aid here on the upper West side, we're a group that we support each other. We have different things going on in our developments, but we're very supportive to each other, we're all from the upper West side and we have represented and the Manhattan south of of neisser as well at one time anyway. My thing is what were you I know: I got in a little bit late. You were talking about the rad and the situation am I correct, so we were just having a conversation about just all the different types of ways: NYCHA is trying to address the capital repair needs and that's rad, that's infill, as well as the selling of air rights right well, unlike I was mentioning before, which I'm glad you brought that up. I caught on to quite a few things that I found very interesting that you were talking about, because my at our last meeting, my big concern is that the person that we need to be keep responsible about a lot of things not going on is because of these things that are going in place. I mean we got these people managing us me we're still on we're a federal development. Here on 84th street, we were the sister of wise towers, and then they put a private management just to oversee the development. We were under the the fix mixed finance and with NYCHA, and they were supposed to be overseeing. You know, whatever management they brought here, we must have had like about three or four different ones, so our situation is a bit different, but we're still left out in a lot of things, because we have elevator problems, we're to the point that we're fixing all the things in our apartment and one of the things that we were concerned about is how does HPD step in when you're having so many problems with your direct management, which is under HUD, you know, can you help us with that information as well? So I'm not really clear on the question per se. Is your development going through I? Do not have the list in front of me, but is your development on the list for rad? No, it's not and we're not trying to go there. You know, like I, said we were the sister of wise and part of the developments in the area. Some are state and some are federal and I. Think I think this is where a lot of the other developments have got caught up on. So you know you have an issue, you do, have you call 707 and they and NYCHA maintenance team are the ones that come out and do the repairs correct? No, actually they send the private management to do it so which one does so who does it? We do call the ccc now, because we did complained enough about getting our tickets in and so the private developer that the private manager that comes in is who crouch crouse management? Okay, all right, so we can definitely we can have a conversation offline about how they are showing up and what are the exact needs and what are the projections for the future, for you know that type of entity that type of structure? Okay, because it's it- we could sit here and talk all night about just me. Yes, absolutely issues the process. The concept is that the problem is, there's been mismanagement, you know and clearly that's why we're having these conversations now, including with with wise and the situation that they're going through and also with the brownstones over there, because I lived under the brownstones and I lived on the wise before I moved here. This is the one of the newest developments that were that exists in this area. Right now, it opened 24 years ago, going on 25 years, I was the first tenant to move in the building and I was under the with Sora brownstones then, but, like you said you about lack of trust in government and the residents to be a part of the decisions. That was something that we spoke about last week and we want to see that to come in action again because when other things were going on back in 1996 around during that time, I did participate in as a community service aide and sat with NYCHA on making decisions on contractors and certain things that would come to the developments and that's not happening anymore, and this is what we want to enforce. You know to try to fix, and you know just you know, have a solution to the things that we're going through. You know, as far as quality of life and the fixtures in our development and how they're just deteriorating more and more. This building is only 24 years and it's horrible. We have plumbing electrical elevator problems, rodent problems, mold mildew and it goes on and on and on I. Think that the let me just say this I think the key part is in all of this is the fact that the days of you know saying: let's force government to do X, Y, z, and the only thing is, the complaints are over right, because I think you've come to the come to the realization that people just do not care right and they are not going to show up and do what they're supposed to do unless it's in the media. Unless there's a protest, unless there's a federal agreement- and you know the federal monitor- is forcing things right, you have to be aggressive and what Jeanette was talking about a little while ago, we were talking about the planning piece of it is now coming to that point of being strategic in organizing and planning what your next steps are going to be and utilizing this opportunity to present the city present HPD with some alternatives, because, again, not all developments. Clearly, Mona Lisa are the same right. Everyone is each development, each community, each borough is unique and so being able to articulate what the needs are for that particular community working with the community board working with even the precinct councils working with the resident associations for that even four block radius. This is what we you know are presenting for this particular development and being able to which is what we've been doing, and this is why we're here you know yeah, that's why the federal aid sits together. You know, because we do have different needs in our development. We all do not have the same issues, but we are there to support each other to enforce what you're talking about you know. Let me just put things in place and being a little more aggressive about it, and so this is that this is that opportunity, and so I think that the city Council members play a role so going back to London right. This is what 366 now 366. the council members are. The ones is council, housing and so they're. The ones that you know can literally are part of the process of having in their own budget for their district for the public housing in their district. And it's not the mayor. It's not this centralized system. You know it's on a borough by Borough Basis, Council, District, Council district, so we're a ways away from that, but it goes back to being able to to advocate for your own particular community, based on what those needs are, and so we should not be having a conversation about rad across the table for every single unit right, but there are like I have like I was saying: I have 27 developments in my district I actually have a development that want to go through red. They did a survey and 93 of the residents want nothing to do with public housing and they want absolutely nothing to do with NYCHA. They want to to go through the conversion process which I understand. So, if that's, okay with them, that's, okay for them exactly what you said earlier too and I agree with that. A hundred percent you know like in far rockaway. Well, that's good for them, whatever it is, that's working for them over. There does not mean that it's going to work for us over here, because and what I wanted to add to that was they do not want it to be. Like far rockaway, they do not want it to be like Ocean, Bay, okay, they want, they want to be in the resident management structure, part of that they want to be the managers of their development and they want to partner with a private developer. That would do the renovation and they have gone so far as to even begin those conversations with development with management companies in order to learn how to become their own management company. And so you know again that goes back to that ownership piece of it. If the city of New York is investing in community land, trust conversations right and community land trust, we can also be talking about what does community land trust? Look like what does the ownership structure look like in public housing and that's going back to that conversation around the possibility of co-ops is going back to I said, like I was working with habitat for co-op units, but I also have habitat, renovated, Ghost homes. In my district, where you know, NYCHA owns private homes and remember the ghost home situation and habitat for humanity stepped in and renovated those and public housing residents, natural residents were able to, you, know, apply and purchase the homes and put in that sweat equity when they were doing the renovations, and so all these things exist, and so we can do that with the single unit family homes. We can also do that with the units themselves, so there are so many opportunities, so many options that should be on the table and what we see right now is not the end-all be-all and another thing I wanted to mention about Cambridge, because that came. We visited Cambridge Massachusetts and a different piece of Cambridge was the fact that what we saw with the tri-barrel deals here, where the units were converted to section 8 and the NYCHA workers had to make a decision as to whether they are going to work for the new management company or try to find another job in NYCHA. Well, in Cambridge, Massachusetts Teamsters was able to negotiate a deal where those same workers. A new management company is part of the public housing authority, so the NYCHA maintenance workers, the NYCHA. You know union workers, local 237 teams is local 237. Those workers are still able to work in the new buildings they should be able to, and so what cambridge was able to do was broke with those deals and really negotiate on behalf of their members, because so many of the NYCHA workers live in NYCHA apartments. They live in public housing, and so some of them have worked for NYCHA for 20 years or 15 years. You know whatever the case may be. They should not have to. You know after 12 years decide that you know now that I can no longer contribute towards my pension. I have to go to this private company. You know we should be also negotiating deals even with the union, so that they could continue to work in a new development. So that was something that came out of cambridge. That I thought was pretty awesome as well. Councilmember I want to just enter for a second, firstly to ask: do you have a hard stop at any point that we should be aware of? I mean I did, but I'm here, okay, we really appreciate your time, it so great to be with you in Cambridge it was okay and it was wonderful to see how the the both groups work together. You know the I have never seen that before, where the people in power really relied on the people that were living in the in the in the cambridge apartments. That was so much wonderful and I so enjoyed being with you. It was very refreshing break up this positive reunion. I just want to make sure cynthia gets a chance to speak and then madeline and then polly just saw this order. I saw the hands go up. What did you just say? Here's something I do not want to break up this happy reunion. That was a good one hi. Can you hear me yeah, okay, so hi miss samuels. This is my question. I am the ta president of the brownstones. That's part of the West Side urban renewal. That's connected with wise on the upper West side. I understand what's happening in London and Cambridge. Unfortunately, New York City is not London or Cambridge, and as long as we have gregory Russ in office, he is not going to allow us to be a part of the decision process. Currently wise towers is undergoing pact. They are in the middle of signing their new leases so for the remaining 62,000 units that are not in the Bundle B and will probably be in the bundle c. How do we get a recognition on the table? I've heard about how we need to have a voice. We could possibly be our own resident management corporations which we are all in favor of, but as long as you have the current administration, they are never going to allow that. So how do we move forward with that before we get slammed just like the Bundle B has been slammed. They do not have an opportunity to pull out now, they're already halfway into it and during Covid-19 they have had problem after problem and intimidation on top of intimidation because nobody's watching what the current private management is doing. So moving forward, how do we get involved to put a hulk to this? How do we get a voice? Because, as long as gregory Russ is there we will not have a voice? I'm a first say this language matters. What you say matters and you started out by saying and I had to actually type it. While you were saying it because it gave me goosebumps, you said he is not going to allow us. He was that's not the world that that's not the world that I live in hope, not oh, but the mayor men. So there's no! But there's no, but to that right. There's just this, there's no! But to it. So then, why has not it happened? Yet? Why has not anyone been able to stop this from going forward and do an alternative as a result, so I'll so I'll say this. We mentioned it with holmes towers. We mentioned it with White Corp Gardens. There have been opportunities to stop projects and projects have been stopped. I personally had Brad deals that were listed as part of the bundle and they took it off because when you are in the first thing that they do when they look at what deals they want to submit, they look at the political will of the community. They look to see what will be the easiest way to get something done. That's the first part of it, and so, if you have elected officials- and you have advocates literally advocate groups and allies that are aggressive in the pushback, then even if a development makes it to a list, it can be removed because it's just that is a suggestion. Right and HUD will only the way it plays out. Nycha will submit a list based on again the political will of the community right. If they can, if they can make it happen, they would submit that to the mayor's office. The mayor will go through the list and that's what they get: that's what they submit to HUD and they can easily say you know what we submitted this list only based on the units, but we're going to change up the developments that are on the list. We still need the units because it's about the unit, and so this is a time like we're in the middle of a pandemic right, and we were also in the middle of like unrest in this city based on police brutality and everything else, and so New York City today is a thousand times different from New York City even last year, the same exact time in New York City 10 years ago. So we are in a position where we can dictate and we can go to court and we can file lawsuits and we can hold people accountable, because this is just a climate of it and Greg Russ is not going to be there beyond I. Do not I. Do not even think he's going to be there too much long. I, do not see him being there for the rest of this mayoral term, I mean if he is he's just there to just to be sitting there, but he's never even moved to New York City he's still not even arrested in New York he's just a puppet right and so I think that you know. That's the reason why we're having these conversations to come up with plans for residents as to what they want to see done and work with allies and advocates to push that agenda and have those conversations I do not I do not know what is happening right now with the congressional with your congressional member, but I know that I meet with my congressional members, Yvette Clark and Hakeem jeffries on a regular basis and we hold tenant on the Resident Association panel discussions in town halls and speak as a collective voice. Okay, well, we've been holding them up here on the upper West side. Unfortunately, when the Bundle B was first brought to the table, we fought for our non-for-profits to be the new managing agent and we were told that De Blasio had a list that was done back when Chola was here and they would be using people from that list and that's exactly what happened in the Bundle B when Prc got put in place so moving forward. How do we stop this madness from continuing with my ultimate question? Moving forward? How do we stop it? How do you stop? What? How do you stop your development from being on the list, or how do you stop development from being on the list period? How do we stop them from making decisions for us and not listening to our wishes to what we want, which is resident management corporations, because right now we met personally with Greg Cross, and he made it very clear not going to happen in his office, so Greg Russ is still relying on kavanaugh and symbolics to move forward with legislation in order for him to do what he wants to do, and so it's not Greg Russ is what greg Russ is the chair of night like he is not he got to ask for stuff just because he put something forward just because he has an idea, does not mean that that's going to happen right, the same way that scholar got ousted because, like this, he is like I do not have conversations with kavanagh tell them. What you want to see have conversations with symbols have conversations with the like to like I just said he. The process now is a state legislation right, that's on the table for the trust, in order for them to be able to move forward with the rest of these units. They have to do that through the state, and so we are having those conversations with the state electeds and not just kavanaugh and symbols, but also the speaker of the state assembly. Who's Carl Hasty, who is you know, have to again mobilize and organize the members to even agree to pass this piece of legislation, and then you have a the most progressive, like senators going right now into the state, and so this is not we're not part of the blueprint, we're not part of the trust. We have already been slated for pact. We are part of the 62,000. right now, wise towers is being converted, but we they changed our name to wise and wise consolidated. So while the towers is currently going through it, the rest of us will ultimately be thrown in because we are part of the 62,000 units that have already been slated. So I'm not talking about the trust I'm talking about what do we do as a collective now that when we become part of the next bundle, when they finish with wise towers and they move on to the rest of our seven developments, we are eight developments under one umbrella up here and right now they are doing wise towers after that will come with Sir Brownstone's with sir site a B c with Sir Rehabs. We all fall under the 62 if there's a collective voice to not move forward, and you do not want to see this happen, so you can organize and have a legal like form, a legal argument, and you can actually stop it. It's not something that has to happen. It does not have to be your unit. The city is worried about. The number is not necessarily worried about the actual development itself, and so, if you're, if your developments as a collective voice decide, we do not want to be part of this bundle. Then they can move on to a different development with those same vouchers with those same number of units is my point. Okay and so that's a collective voice, so you can organize and come together and we can speak offline about what a strategy can be based on what the collective voice is. Okay and I just want to be clear. I like that whole do not allow us. That's not part of my world, because in this in this climate right we have a voice, and we have to believe that and own that and make the changes that we, you know want to see happen and that's just not public housing. That's everything! That's the that's the rezonings that we see it's. You know small business is everything yeah that really resonates and I think what you said about allies really resonates, because that's what we want to try to do here at the community board is, you know, be those allies and would love to continue that conversation cynthia, okay, just for the two others who had their hands up, madeline I, think you were next and then Paulie and then ernesto as his hand up too so maybe okay as I said initially community board we're in advisory Board and I'm not going to say pressure is put on us. But we want to work collaboratively collectively with everyone. However, we could do but so much so what do you suggest going forward for us collectively to NYCHA is aware of what's going on, but to put a little more pressure on them, because we as a housing committee and a task force we're having a hard time finding a direction that could be meaningful and forceful to NYCHA. But, however, there's all these other obstacles in our place, and we do not know I'm not saying we do not know. We do not know what to focus on that is more important right now, to get NYCHA, to listen, to ta presence, to listen to Community, Board and listen to the community at large. What can we do as a community boy? As I said, we have roger? What can we do as suggestion into making this more forceful environment? So what I've known and I do not I can't I do not I do not know the politics and the dynamics of Community board seven in Manhattan, but when I talk about what's happening in community and I talk about what's happening with public housing, it's not just public housing. I talk about the entire community right and as an example when we were going through a East, New York rezoning plan, the mayor in the city of New York were focused exclusively on affordable housing, the business district transportation. You know investing in the infrastructure of transportation and bike lanes and there was an entire public housing development that was in the footprint of this zoning plan that needed boilers. They needed roof repairs and not one conversation during the rezoning plan spoke to the needs of the NYCHA development, frontino Plaza right, and so it was the it was organizing and working directly with the advocates and like the Cypress development, the Cypress hill. You know development Corporation, the Ldc's and East New York Development coalitions just working with our advocates and our allies and community Board, five and Community board 16 the housing committees and the land use committees to say we have to force them to include the public housing footprint in this rezoning plan. So, if they're making investments around the entire community, they need to definitely start to. You know, make investments and repair the developments right, and so it was speaking directly to the actual overall. What makes an entire community so we're talking about housing, we're also talking about. If there's an increasing units you know, do we have the adequate schools there right? And if we're talking about that, you know we still have to talk about parks in the area. You know we're congested. We live in. You know like highly dense communities, so where's the next green space. Oh there's not a park, okay. Well, we have an empty lot that HPD want to develop on how about we not develop on that particular lot and we turn it into a green space. You know what I'm saying, and so it's and you know where's the nearest grocery store and we're talking to developers and when they come to the community Board to present their plans. I immediately say: okay! Well, who are you working with that's going to come in and and rent your retail space? We need fresh fruits and vegetables. You know who are you reaching out to? Oh? Well, you know, I, have a family dollar coming to a 9 cent store. No I do not need that. You know in order for me to approve this particular plan, I need to make sure that you're doing your due diligence and making sure that the needs of the community is included in this particular development right and having those conversations with the public housing residents so that they can understand that their developments are part of the fabric of society. They are part of the community because for so long the public housing residents were not part of the conversation. I know in my district, you had your resident association meeting your tenant Association meeting, and that was it. They were not part of the Community Board right and so making sure that we are intentional in our conversations about what makes a real, healthy and safe community in this totality is what we need to first start to talk about right and making sure that we are building community and getting the residents to be engaged by just civically engaged coming out to not just the ta meeting. But the Community board meeting is on the first. You know Monday of each month and so from there making sure that whatever you're talking about in the housing committee includes every piece of housing is not just public housing, but it's also what's coming out of HPD right and when you have those conversations with your elected officials, like I, said: I spent 1.5 million dollars well I added 1.5 million dollars for my habitat for humanity units right. They came with their finance, their funding structure, but I added to it in order to ensure that we were able to have more affordability in it and then turned around and used the Community board space and time and effort and energy to do outreach to the to the actual NYCHA residents to let them know that this is what's coming down the pipeline, and this is what we need to do together and so I think it just kind of starts with that whole civic engagement and outreach piece, because it's such a big deal and once you have people that feel like they are part of the conversation and now they are invested in the conversation. Then you can, you know, start to have those planning sessions and hold in and getting funding and from your elected officials to even help with financing attorneys right. I have an attorney on board. That's exclusively for housing for this. That comes out of my budget. Well, we met with Community, Board, 10:12 and I think 11 and 9. We we've had several meetings to discuss their housing committee or their public housing stock, and we were getting some headway, but the pandemic. You know it just threw us off and I think we need to get back with that, so all of the community boards would be on be on the same page, whereas all developments in the whole city will be involving this I think it's a stronger figure to the male, whoever we're going to have to deal with later on now. My last question, then: probably you could, though, with the new administration I know this is going to be a hard question to answer: is anybody going to be advocating to them to put more funding in public housing? I know some people do not want the government to be in NYCHA affairs, but we're at a time where this is a crisis and we need some assistance and I just feel in the past that many elected officials have not advocated for us enough. So will there be somebody talking to the federal government once they're in place, so the conversation starts before they're in place. Right, that's happening now right and when I talked about the infrastructure bill. That's coming out of Congress, that's a real bill right, that's a real 70 billion dollar request and the reason why it was we did not see it happening is because of the current climate, the current administration, and now that we see a change in the administration. I do believe that that's something that's going to move forward, because it's already something that Congress you know approved of and you know have been pushing for, and that is the funding that we need, and so, when we talk about like what Greg Russ has proposed, I've even had the conversation with greg to say. Well. If this money comes through from the federal government, then you know your plan is not even necessary because it can speak directly to the needs of you know a huge piece of the NYCHA housing stock, and so the ones that do want to you know transfer to section 8 convert to section 8. You can have those conversations with them because we're talking about a smaller you know, population, so I, you know, I do have hope in what we're seeing and I know. I have conversations all the time with the Democratic Conference Chair Hakeem jeffries- and you know this is this- is something that is at the forefront. You know I've heard Carolyn speak about it. I heard native last question about like they've all it was just difficult in this particular climate with this administration. That sounds good. That's hopeful, keep hope alive, keep hope alive. We have polly with her hand up, and then we have ernesto who had his hand up. Do you want to go there? Melissa yeah? Thank you mark Paulie, yeah, okay, so, first of all, I want to say thank you so much for sharing so much information and answering so many questions I'm to make mine brief, because I know that you know the meeting has kind of been pretty lengthy. What piqued my interest was when you spoke about London and about the council over there, I'm having a funding stream to help develop the projects over. There is your office thinking about doing that here, duplicating that same model, maybe where you would get funding from the city to maybe plan some development in partnership with neister residents leaders. So I'm not shy about that at all. I am very supportive in looking at my district as a possible pilot program, because there's been so much pushback across the city and oh, we can't do that. We can't do that and I said well, let's just see what we can do and so I would love to be able to to. You know, use London as a model in my district because I see when we got it wrong. Like I said we've, you know, we've had nitro developments demolished in my district, prostate Plaza I have two infield deals sitting in the middle of Van dyke houses, which is absurd. You know so. We've got it gotten it wrong so many times, and so now we have to figure out ways to to do something the right way, and so you just got to try it, and so even working with my borough president. So in London, every borough has its own, like city hall. In a sense it's like, if you go to Manhattan borough hall, Brooklyn borough hall, it's like a mini city hall. So all the city agencies are in that particular building and they have their own budget. So it's not like I, said decentralized system, and, and so the local electeds are able to dictate what happens with their public housing units in each district, and so I would love to be able to see a a Brownsville housing authority concept, and this is something that, of course, the administration has been talking about going back to the borough-based system, where the property managers can manage their own budgets. That is what's happening. They've submitted their organizational plan to the federal monitor, so these conversations are happening again. It's happening at 250 broadway right. It's not it's not happening with the elected officials and it's not happening with the residents and so I think that we should be utilizing that type of model and structure, and this is something that I have been pushing and we're doing it in the way, like I said. Looking so I, look at my entire community and I work with HPD and we have a Brownsville community plan and we are working that plan and all of the housing developments that we are doing now are really basically in the surrounding areas of the public housing units and so we're doing everything as a collective and intentional movement. Well, I would like to see us start our pilot here on the upper West side as well, so I, I'm glad that you shared that information with us and I would like us to also work collectively and see what we can do to make that happen, because it's innovative and it's new and we need to get away from the archaic systems that we've been you know working with when it comes to housing, we need to think out of the box. So thank you for sharing, but let me say this is not my I. It's not my idea right. So we talked about London, but the we had public housing residents, the nature residents. They were in London. They were in Cambridge, no I know but I like them, and it comes from the so the idea is from the residents and they did their surveys, and you know they just came to me so I want to make that clear that you know again it's about the voice of the people exactly and that's something that we I would like to see us do up here on the upper West side collectively. Absolutely exactly absolutely! Thank you. Okay! Thank you. So much ernesto good evening how you doing everybody? How are you thanks for having me thanks for having me thanks for being here? First of all, I'd like to say to Mr Lika that she's a breath of fresh air, she did not even have to say that it was not her idea, just the knowledge that she's putting out there for us and the advice that she's giving for us is a tremendous thing. I'd like to say, in my opinion, what's going on with NYCHA is an epidemic of irresponsibility man? Yes, you know, Mona Mono said Listen man, you know down there at a dome. You know we're having different problems, but I beg to differ with all due respect. Wise towers is not faster with rodents. The outside lights do not work. We got leaks and floods everywhere. We got NYCHA transferring tenants into section 8 apartments and then threatening to put them out and not just put them out, but terminating leases. Okay, I just had a fight with Carl Walton that was I, can't believe the mentality of this guy he's supposed to be the ram he's supposed to be a people person, and this guy is just as bad as anybody in power. This guy does not deserve to be in the position. The position that he's in I've been to meetings with this guy Mr Cynthia Tibbs, can attest to what I'm saying with this guy literally right in front of our faces, has threatened every tenant in wise towers right to our faces, and I'm hey. Listen, I'm an older guy, whatever you know what I mean, but I was so humiliated for him, especially as a man of color that all he talks about is putting people out if they do not if they do not meet his requirements, if they do not stand up and fly right by what by what he has to say, I mean it's madness. That's going on over here, so I know for a fact that I have every development, we've all gone through the same thing and that that's why I appreciate Mr Leaker for imparting all this knowledge, because I'm going to be honest, I I've been sitting here and I'm like wow. You know I've learned so much tonight in one session that it really. It makes me even more furious, because the conditions over here are wise and I wish I wish. There was a way that we can get out of this rad thing, because the room has been running rampant for years that they were going to do this twice and I did my best to fight it. I spoke to people and then I got other tenants that were saying. Listen man we're not getting repairs, we're not getting nothing done. You know, I, remember at one time wise was one of the crown jewels in Manhattan. You know, but that era is long gone, long, gone. Okay, you know we we need help and the ideas that are being thrown around I wish. We could really apply them and you know say to these people. Listen, we do not want to be with red, we do not care about starting to sign leases if there was a way that we can get out of it and have this new administration bring us back to life that that's my that's my wish you know, but can we do it? I do not know. I do not know if we're too far into the process, but, like you keep saying, with this pandemic, everything is pushed back. Nobody really knows when these people are going to actually take over I know they keep that I always have meetings with them and they say the politically correct things and they always tell you what you want to hear and I walk out of there. Just shaking my head saying, wow I do not know what the belief you know and I sit there with them face to face many times many times and they keep assuring me and they keep assuring me and they keep assuring me how they've even helped me in a couple of instances with tenants that were put in section 8 apartments that should not have been put in section 8 apartments. They have helped me, I'm not going to lie about that, but I'm saying as a whole, a lot of people are so afraid of this process and I have been asked by a lot of channels. Man is there any way we can get out of it, so I'm asking you Mr Mika, so you know what remember. Let me just say this too you have to in order for them to convert with rad. All of the residents have to sign a new lease. If the residents do not find a new lease, they can't do the conversion. So what now? Let me ask you this, because a lot of tenants are under the impression that they have to sign the lease like they do not have a choice. I personally tell them. I can't tell you what to do, but I'm never going to tell you do not have a choice, but the intimidation. You know they use a very subtle intimidation like they do not tell you straight up hey if you do not sign the lease you're out. You know they're not ever going to say that, but what I need to know is there a way is that the only way we can get, because there has to be a large number of tenants right to make it even count? You know for us to fight like I, always say it. You know if it's the it's the people, it's the collective voice, and so you want to make sure that you know you do that. But as far as the the signing over on the lease, that's part of the HUD language, that's an actual regulation. That's so that's part of the rules right and so I think a big piece of it, too, is just going through what your rights are and being comfortable and confident in knowing you know what your rights are right, because you know what happened overnight. You know this takes time crazy. It's really crazy that if you used to see the apartments, you know pipes, breaking ceilings, you know breaking holes and walls. You got workers like with us with wires, I'm only speaking for wives. When we call the 707 number put in tickets, we get nature workers, we do not get private workers, we get guys that work right here on the grounds. Okay, they go to apartments, they put gaping holes and walls looking for pipes or we'll be back and then I got to go and fight to get them to do the job and then it'll take a month for them to plaster the wall. I mean I, got I got tenants that are really suffering over here and that's why? Like Mona Lisa was saying you know that a lot of people are with the conversion, but I also have a lot of people that are not that do not trust the process. What do I do about that? In your opinion? First get a consensus of who and what like I mentioned on one of my developments. I was shocked to see over 90 percent of the people wanted to convert and I said well look well, let me see that you know because I'm out here yeah, it's all debating up cutting the phone in some of these meetings and they was like wait. A minute. Wait! A minute calm down over there sis we actually put it over here and they showed me, but you know it was because of all the issues that they had exactly there's something else like they're saying: oh, come on and convert it's because of all the irresponsibility that's going on, you know, so people are looking for a way out, but I also say too. We were able not we but one of my developments. Cephalo houses did a full survey of the apartments and had an independent contractor, go in and look at all of the units and was able to come up with a number of the capital repair needs that was different from what was reported by NYCHA and and so they were able to do that with you know, getting funding from the Robin Hood Foundation, and so it was, you know, really being able to tap into and as the Resident Association. Knowing that you are, you know, an actual entity, a body that can apply for your own grants and funding resources, and you would be surprised at the you know, folks that would be willing to be of assistance and helping to organize and helping to figure out. You know how to plan for your particular developments, but just utilizing other resources and another one. That's really good I think is the community service society. You know working with Vic Bach. They are amazing at css and and just reading their material, and you know just they put out a lot of information. You know public information and reports related to public housing. That I think is very helpful to go through. You know, as a committee to even articulate you know what it is. You would like to see and just kind of get some ideas. Yeah can I say one more thing: Melissa before yeah, just one this one, this one I as far as the Community board right, because madeline, who I know her whole life, she says. Well, we need to do it collectively right and my question is well. That's a that's a great statement to make, but why is it so difficult for tas and stuff to who want to join the board? Who want to be a part of the board and they're not being allowed to join? Why is it that they tell us? Oh well, if you're a ta, you can't be on the board, which is absolutely nuts to me. My opinion can I take that one here, absolutely Mr Daley, please! Oh it's mark! It's not Mr Diller Okay Mark. So the first thing to know is that elected officials make the appointments to the community board, not the other board members. We have no say or role in that at all. The second thing to know is that polly are not you a ta president yeah, so there's no rule that I know of that says that a ta president can't be on the board. It's just up to what the elected officials decide is the right person to be joining the board so, and we would welcome anybody and everybody that we can get, especially from public housing with first-hand knowledge. So thanks for that, I'm telling you there are a lot of people that we're talking to tonight. That has a lot to bring to the table and that's a fact. I might be, I'm not being patronizing, I'm not blowing smoke. I know for a fact, because I have spoke. I have sat down with these a lot of these women and we're talking about some powerfully strong, opinionated women that know what they're talking about they're, not just blowing smoke they're. Not just you know it's not. In my opinion, it's not ego driven these women are knowledgeable strong women and I love sitting down keeping my mouth shut and listening. Y' all heard that compliment from Ernesto did y' all hear that ladies y' all hear that later. Thank you. They know me ernesto, but I, know you the longest. That's right! That's the fact. I've known madeline, my whole life, hey, it's a fact. It's a fact, but I'm just saying this. You know it's a great thing to say, but I think that the community can work harder to get the tas in there and have them more involved. That's just my opinion, because I I'm telling you I it takes a village man. It takes things like things are definitely changing. Now things are definitely changing. Now. You know. Even with the rules of the community board, it was a. It was very difficult. I know across the city to get onto a community board, because you know people were there for so many years, but now, with the term limits, I think that there's you know, opportunities for you know shifts yep. Can we take one more Melissa I appreciate it? Thank you. I'd like to make sure the council members off by 8:30 and maybe we're all off 8:30. yeah, that's cool, absolutely and I realized that when I was I did not want to stay in my office, so I rushed home to do this and I realized I left my cell phone in the office. So when I got like, of course, I leave my cell phone in the office, I'm sorry so Margaret Mustack, I'm sure I'm mispronouncing, but she's now joined you Margaret. Do you have a question you wanted to ask you had your hand raised? Sorry, okay, I have a couple of questions. I wanted to ask, is: can you please list or email me? The members of Congress that's backing up the 70 billion dollar infrastructure bill, so I could know to follow up with them and they all are you're near who you have yeah. Excuse me Nadler and a little espionage. Maybe I'm not sure yeah. That's it! The entire democratic conference, the entire democratic conference is, you say you said it's an entire democratic, Congress right, conflict, okay, I did not understand. You said the entire I did not care that my I'm sorry, but oh yeah, I'm sorry so I was so the the delegation like the New York City delegation, and that was speaking specifically to the democratic members of the delegation- are all supportive of in science. Natalie. Okay, thank you all right and the other thing I wanted to ask you with the Corporation Council. I've been hearing about a lot of it lately, and so many people want to do it. But how long would this take because they say it's? It would take like five years to train the tenants. Some of the tenants to be involved as part of the boy it would take, not sure which you're referring to okay, the Corporation Council, where the tenants would manage their own buildings. How long would that take to get started to purchase their own building, I? Think she's, trying to say yeah? How long would that take? Does it because some people look like they're trying to do a lot of developments all at once or is it like one development per? You know, council? How would that go so it really just depends on whatever the financial structures are funding structures in New, York City. If you have a private development, you can have a building go up in 18 months, if you're, looking at affordable housing and term sheets and HPD it'll be five years six years right. It just really depends on what's happening, that particular district, but when I was talking about the resident management structure, yes, what I can do? Do you live in public housing? No, yes, I do I live in oceanside. So are you familiar with the 964 regulations? Yes, you look at the 964 regulations under tenant. You know tenant participation and it goes under to the participation you'll see resident management in that particular section of the 964 regulation speak directly to the structure itself and the language around what it is and if you are a lay person and have no clue what you know managing development, is you know how long will it take to get caught up to speed to you know, get the necessary. You know skill set, build a skill set and certifications to make that happen, but then we also have individuals who live in our buildings who work in management companies right or who you know, work in social services and have that skill set and that talent and they would love to be able to start a resident management group, and so the timing of it just depends on the individual, and it just depends on the association itself with pulling that together. But that is something that this particular residence I mean this particular regional administrator, Lynn Patton. She started having town Hall meetings around the new section, three law that came out that Ben Carson just put in place about a month ago and in that conversation they're also talking about resident management groups, but I do not know how long they're going to be doing that because they're, you know heading out the door and so I think the first part of it will be to go through the 964 regulations first and then you know, look to see who's doing what so we can. You know we can have a follow-up conversation about that. If you have more questions yes, I would I do not know. How would you follow me up? I'm going to put my information in the Chat box. Okay, everyone, if that's helpful right and the other thing I would like to say- is like so a lot of the tenant associations. They're very unqualified, for a lot of you know stepping up things and it's like really scary when they start talking about this, because they can't even get along or even have a let's not get. Let's not get. So that's a blanket statement and the same way the same way. Everyone has a role. Everyone has a skill set, everyone has a god-given talent, and so whatever your talent is that God gave you can bring that to the table, no matter what it is, but everybody has a role to play: okay, yeah I just do not want to get caught up in something I. Just you know. We end up like a house of cards just tumble and we're worse off than when we started that's. Why I would like to get more clear information, and you said you put this in the chat. I do not see it. I'm typing it I stopped. When you said what you said, we had so many bad experiences with tas I apologize. Thank you with that. I want to give anyone like a last quick comment. Otherwise, I'd like to let the council member go so she can go, get her cell phone at G, Broadway Madeline yeah. Do you want to say a concluding statement and then we'll I just would like to thank you, council, member, for coming so long. I have admired work watching your work and been trying to get you here, so they can. They can hear what the different experiences in different countries or even different cities are experiencing, that we could be on the right track, and now we have a new administration. Hopefully that happens so again. Thank you for joining us I. Just put my thank you for having me, everyone and I put my email address in the in the box and please feel free as a committee, to share my information in within your within your distribution group, because you can get on my mailing list. I actually do zooms and informational sessions about you, know the possibilities and the options in Brooklyn, and so you are more than welcome to jump in on any of those meetings that we have to try to because, and we kind of do a deep dive. How would we find out the link to get on this so so I just put in district 41 at Council.Nyc? And so, if you just email me, you can get on my mailing list so that you can know when we're when we're having those conversations right great well, thank you again, and this has been just great and informative and I think we all have a lot to mull over and hopefully apply in the coming months. So thank you. Thank you. So much and thanks for being so generous, you, everyone, good luck, stay safe, wear your mask. We had on the agenda kind of the next steps from last month's meeting and I. Think now from this month's meeting. I honestly do not know how much progress we're going to make at 8:30 at night and deep thinking and planning. So if it's okay, I kind of like to push this agenda to next month and again, ask our nigel leaders to please keep returning every month, so we can keep these conversations going. It's really important that you're here and you're part of the conversation, obviously, as we discussed and with that I just if there's anyone in the attendees who wanted to just have a two minutes of public comment, please raise your hand. Otherwise, I think we will adjourn so I'll just give you guys a minute in case. Anyone wants to. There are two people on the phone. If you want to raise your hand on the phone it's star 9. are you raising your hand or saying goodbye? No, I'm waiting raising my hand. Oh okay. Yes, sorry, okay, so I thought she was amazing and has a very interesting new way of looking at things and it really kind of circles back to tenant involvement, and it seems to me that is something that we have to focus on. Also, how do we get tenants involved in so we know what the issues are. I mean we're just standing back and kind of looking at it and she was offering fresh way thanks, yeah and that to incorporate what she's saying so that we could be more involved I. The idea of putting the british borough system the London borough system in New, York City I mean it does not seem possible, but she does not say no to things. It's very interesting, and so I really would like us all to think about this and we would talk again next month. But how is everything set up so that you can get more people involved because I think one of the problems is that people do not get involved and the situation is so bad and so dire that people just get disgusted and step back and all you have is a great deal of unhappiness and no moving forward. So we should think about this. A lot yeah good words to end on and I completely agree and I. Think that's what we need to focus on next month and I thought she was amazing: yeah, oh yeah, okay, all right! Anyone else, yeah any other right. I would like to say something. Oh sure, sorry, I never know if you're waving or yeah. Well, that's why we're here you know and that's why we're showing up the federal aid and to get more people to participate in these meetings and for us to represent them. You know because, like there's only so many that's going to come out, but we will be that voice and we will be there every month to express everything that the residents are going through, what we would like to see and what we can stop and one of the things that she said that I've always said this and polly. You know this, you know because I've had Naisha come in this development and tell me oh, you got to do this and you got to do that. If you want to be hurt, I do not need NYCHA to back me up to be heard. I got a voice, you know as long as I'm participating. That's what we got to remind people. You got to be in it to win it right. So you as long as you're, doing something and you're giving your voice you're going to be heard. You do not need that name Naisha to be heard and that's why we're going to continue to do what we do and we're going to have people like yous beside us and we're looking so forward every time to sit and discuss these things and create the solutions and resolve things that are coming up. Mona, Lisa I have a question: have there ever been tenant strikes? Oh yeah, I'm we're about to talking about that in our own development. Now you know uh-huh, you could put your money in an escrow. Do not worry about it. You know what I'm saying. If that's the case, it's not impossible. You know I, remember at one time, I was doing bad. You know and I have my ups and downs and I went through a situation. I did not live in niger, but my apartment was a section eight at one time and I. Had a judge. Tell me that I was moving out and was not even being listened to and I refused so I made myself a prisoner of my own apartment did I get help. Yes, did the mayor give me what I wanted? Yes did? I get a lawyer, yes, so my thing is, you know what they say. No I say yes and we're going to step it up and we ai not going nowhere. That's it! That's right! 100 statistics. You know out there we're over here to have a better quality of life and continue to participate with our community and spreading the word and to make things happen and to keep it strong. That's right well said: Mona Lisa! Yes, thank you so appreciate all of you, I really do I'm grateful. Thank you all right, I appreciate you too. Okay, Melissa looks a little tired, yeah, I'm kidding guys. Sorry, it's been a rough day. All right. We need to give a break. We appreciate everything you do and let's not let Mark dillard out of there. We talking about him also- and you know, let's just keep it going 100, let's keep it going. That's all I can say: let's keep it going appreciate you guys. So you know with that. I do not know what to say other than adios. Okay, all right.",
            "summary": "She chairs the committee on public housing, which is why she has been so great to agree to come, speak to us, today, she's, actually also a former employee of NYCHA and has worked in the offices of several elected officials.\nI. Want you to explain how we can go forward with the comparisons with the pact and the rad and all the things we need to go and forward, because, as I do not know.\nHas I think it's such a shame that they close down the community centers and what we see happening across all of the developments across all five boroughs, with the lack of activities and space for our young, people.\nThere's a lot happening with public housing, not just in New York but across the country, and when we speak directly to what's happening at NYCHA.\nThere's a realistically a 50 billion dollar need to fix apartments, and we know that NYCHA has had its issues of poor management, piss, poor management and that lack of management led to lawsuits related to mold and lead.\nThat's infill deals as well as the red which is the renovation of the units and converting them from traditional section, 9 public housing to section 8 with private developers.\nAnd I think what makes it so problematic and so challenging is the fact that what's missing is the voice of the people, the voice of the resonance and the voice of the surrounding you know: blocks.\nYou can't just come up with plans internally, you know in a border room, you know at a conference table in NYCHA and within you, know, HPD in city hall, without incorporating not just the input from the residents, but residents should be an integral part on the decision making and that's what I'll go.\nAnd I'll talk about that the fact that residents should be included at every single aspect from designing you know just the ideas and first should we have a building on this parking.\nYou know that conversation that decision should be should be from the people, and that has not been the case across the city and just a quick example of that.\nYou know, by the basketball courts, overlooking the FDR into the in the water and NYCHA, came back and said that we're not going to go with plan C.\nNew York has the you know, largest content, the you know, largest public housing across the country, and it's like okay.\nLondon has more people that live in public housing and more units, because it's council.\nMy family lived in what was called the prospect market in the 50s and they had to relocate from their home because they were going to build the NYCHA development, prospect, Plaza and marcus garvey houses and so.\nSo, when they started to demolish developments across the country, public housing units across the country, prostate Closet, in New, York City, was one of the first, and so a lot of my family members were displaced.\nAnd I think that we need more people to speak up and fight and advocate on behalf of public housing residents.\nTo say what we're seeing today is just not appropriate and that, if a rad development, if a conversion development is appropriate in far rock away and the residents love it there, it does not mean that that's what we need.\nThat's having that conversation, because some residents do not want anything to do with NYCHA and some people feel more comfortable with making sure that it continues to be traditional public housing because of the tenant rights that follow that.\nYou have public housing residents have rights under HUD regulations, and you know, for instance.\nYou have to negotiate every single new development lease and deal with any conversion, because you're no longer going to be part of HUD public housing authorities is going to be.\nThere's such a lack of trust in government and in systems and in all administrations on the city, level, federal, level, state level, and until we are able to sit and make sure that the residents are part of the entire process.\nThe public sector, I'm wondering if the same way that sort of a lot of other sort of major development is going forward.\nYou know some of your affordable housing developers and community-based organizations all day.\nAnd I really believe that what we're seeing right now in New, York, City, we're developing everywhere.\nWe should be able to invest those same types of dollars in our public housing units in a way where we can have conversations about converting the units to co-ops the same way.\nWe had those conversations with the Mitchell llamas, and you know back in the day, and we talked about workforce housing.\nWe should be having those same conversations with our unions and with state, and you know, local government and being able to apply capital dollars to renovating our units and have an ownership.\nThose models, exist, they're still in place, and we are now even having those conversations around third-party transfers and the fight to make sure that these tenants to continue to you know be able to own their units and working with them.\nThere was no push because you know facing we're talking about public housing and as far as the federal monitor in place and that being a push for like federal, dollars, Federal funds, the agreement itself put New York online.\nWe will have a big bulk of the public housing funding for capital improvements that we would actually need and could use, and so I'm hopeful in the change in leadership on a federal, level.\nYou, know reason number 365 of the great things that you know come out of other places in public housing.\nYou know 250 units on this particular site and it will take five years, and so there are experts that will be assigned to the residents that will help them come up with their own plans as well.\nYou know, focused conversations and meetings around land use and housing development on the community board level and being able to work with the surrounding public housing developments, because in my district, I have actually have 27.\nI have the highest concentration of public housing in north America in my council district and so for me to have a conversation with my community boards.\nSo it's working with them and making sure that they have the talent and expertise at all meetings to have a real conversation that when we are talking about the state legislation, the state legislators submitting a a bill about the public trust that is reflective of the residents submitting what they think the bills should include and when HPD is having their conversations around infill.\nSorry, I'm just going to say that speaking of you know, resident involvement, can you calling up Mona Lisa.\nYou know, like I, said we were the sister of wise and part of the developments in the area.\nWe want to see that to come in action again because when other things were going on back in 1996 around during that time, I did participate in as a community service aide and sat with NYCHA on making decisions on contractors and certain things that would come to the developments and that's not happening anymore.\nI think the key part is in all of this is the fact that the days of you know saying, let's force government to do X, Y, z, and the only thing is.\nYou have to be aggressive and what Jeanette was talking about a little while ago, we were talking about the planning piece of it is now coming to that point of being strategic in organizing and planning what your next steps are going to be and utilizing this opportunity to present the city present HPD with some alternatives, because, again, not all developments.\nEveryone is each development, each community, each borough is unique and so being able to articulate what the needs are for that particular community working with the community board working with even the precinct councils working with the resident associations.\nLet me just put things in place and being a little more aggressive about it, and so this is that this is that opportunity, and so I think that the city Council members play a role so going back to London, right.\nThe ones that you know can literally are part of the process of having in their own budget for their district for the public housing in their district.\nYou know it's on a borough by Borough Basis, Council, District, Council district, so we're a ways away from that, but it goes back to being able to to advocate for your own particular community, based on what those needs are, and so we should not be having a conversation about rad across the table for every single unit right.\nThey did a survey and 93 of the residents want nothing to do with public housing.\nIn, my district, where you know, NYCHA, owns private homes and remember the ghost home situation and habitat for humanity stepped in and renovated those and public housing residents, natural residents were able to, you, know, apply and purchase the homes and put in that sweat equity when they were doing the renovations, and so all these things exist, and so we can do that with the single unit.\nWe visited Cambridge Massachusetts and a different piece of Cambridge was the fact that what we saw with the tri-barrel deals here, where the units were converted to section 8 and the NYCHA workers had to make a decision as to whether they are going to work for the new management company or try to find another job in NYCHA.\nThey live in public housing, and so some of them have worked for NYCHA for 20 years or 15 years.\nThat's the reason why we're having these conversations to come up with plans for residents as to what they want to see done and work with allies and advocates to push that agenda and have those conversations I, do.\nThat's, not part of my world, because in this in this climate right we have a voice, and we have to believe that and own that and make the changes that we, you know, want to see.\nAnd I, think what you said about allies really resonates, because that's what we want to try to do here at the community board is, you know, be those allies and would love to continue that conversation cynthia, okay, just for the two others who had their hands up.\nI talk about the entire community right and as an example when we were going through a East, New York, rezoning plan, the mayor in the city of New York were focused exclusively on affordable housing.\nYou know investing in the infrastructure of transportation and bike lanes and there was an entire public housing development that was in the footprint of this zoning plan that needed boilers.\nThey needed roof repairs and not one conversation during the rezoning plan spoke to the needs of the NYCHA development, frontino Plaza right, and so it was the it was organizing and working directly with the advocates and like the Cypress development, the Cypress hill.\nYou know development Corporation, the Ldc's and East New York Development coalitions just working with our advocates and our allies and community Board, five and Community board 16 the housing committees and the land use committees to say we have to force them to include the public housing footprint in this rezoning.\nI need to make sure that you're doing your due diligence and making sure that the needs of the community is included in this particular development right and having those conversations with the public housing residents so that they can understand that their developments are part of the fabric of society.\nThey are part of the community because for so long the public housing residents were not part of the conversation.\nThey were not part of the Community Board right and so making sure that we are intentional in our conversations about what makes a real, healthy and safe community in this totality is what we need to first start to talk about right and making sure that we are building community and getting the residents to be engaged by just civically engaged coming out to not just the ta meeting.\nIn order to ensure that we were able to have more affordability in it and then turned around and used the Community board space and time and effort and energy to do outreach to the to the actual NYCHA residents to let them know that this is what's coming down the pipeline, and this is what we need to do.\nAnd, so I think it just kind of starts with that whole civic engagement and outreach piece, because it's such a big deal and once you have people that feel like they are part of the conversation.\nI know this is going to be a hard question to answer: Is anybody going to be advocating to them to put more funding in public housing.\nI know some people do not want the government to be in NYCHA affairs, but we're at a time where this is a crisis.\nThen you know your plan is not even necessary because it can speak directly to the needs of you know a huge piece of the NYCHA housing stock, and so the ones that do want to you know, transfer to section 8 convert to section 8.\nThere is your office thinking about doing that, here, duplicating that same model, maybe where you would get funding from the city to maybe plan some development in partnership with neister residents, leaders.\nListen, I'm, an older guy, whatever you know what I mean, but I was so humiliated for him, especially as a man of color that all he talks about is putting people out if they do not if they do not meet his requirements, if they do not stand up and fly right by what by what he has to say.\nI know for a fact that I have every development, we've all gone through the same thing and that that's why I appreciate Mr Leaker for imparting all this knowledge, because I'm going to be honest, I I've been sitting here.\nLike Mona Lisa was saying you know that a lot of people are with the conversion, but I also have a lot of people that are not that do not trust the process.\nAs far as the Community board right, because madeline, who I know her whole life, she says.\nYou know it's a great thing to say, but I think that the community can work harder to get the tas in there and have them more involved.\nShe started having town Hall meetings around the new section, three law that came out that Ben Carson just put in place about a month ago, and in that conversation they're also talking about resident management groups, but I do not know how long they're going to be doing that because they're, you know heading out the door."
        }
    }
}