{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB10",
            "channelId": "https://www.youtube.com/channel/UCSs8rHuOhCTYrXkMRb7qYag",
            "title": "Top chat replay",
            "publishDate": "2020-05-19",
            "shortDescription": "Brooklyn Community Board 10\\nMay 18, 2020\\nFull Board Meeting\\n7:00 PM"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB10",
            "normalizedName": "Brooklyn Community Board 10",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
            "twitterHandle": null,
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 103,
            "um": 215
        },
        "wordCountFullTranscript": {
            "people": 57,
            "favor": 45,
            "area": 38,
            "meeting": 35,
            "committee": 33,
            "dog": 33,
            "park": 28,
            "board": 24,
            "lot": 23,
            "office": 23
        },
        "wordCountSummary": {
            "people": 11,
            "office": 7,
            "district": 6,
            "lot": 5,
            "committee": 5,
            "state": 4,
            "area": 4,
            "food": 4,
            "board": 4,
            "dog": 4
        },
        "fullTranscript": "Sorry guys can't hear anything. Hang on hello, June, hello, it's judy, collins, hi, johnny yeah. How are you for a second hello? Do you hear me? Yes, we do. Thank you, hello, madam chair nope. Not working! Okay. Does anyone know if these airpods work with this zoom connection, we can hear you airpods should work, but you might have to select them as your output source. If you go down to where you can mute and unmute yourself, there should be a little up arrow and sometimes you can select a different speaker as in like the thing that you're going to be hearing us from you might be able to like select the airpods from there [Laughter]. No I'm on I'm on the computer, and it says my airpods and it says, connect and I press connect it as long as you can hear us vaguely that's my problem. Okay, sometimes you have to raise the volume because the airpods work differently. No, I tried everything I had both my kids trying to and for some reason it's the volume. So I wanted to put the ear pods in. Maybe it would be better, but it's not working it's okay, I'll! Try again, we put the audio the live stream. If you're, not speaking, please mute yourself. Thank you! Everybody! Okay! Another one! Dorothy, yes, is one of the audios okay. So, let's see who do we have here? 51 participants can't tell if we actually have a quorum. We have a quorum okay when you're ready to start. Let me know I'll put audio on the live stream and everyone just remember to mute yourselves if you're not talking to avoid some of that feedback. Thank you thanks for wait. Can you hear me now? Yes, we can hear you okay, so I should that's it. Okay, so are we ready go mark ready to go okay, so I'd like to start tonight's meeting. This is the may 18th community full board meeting for community board 10. and we start every meeting, as we always do with the pledge of allegiance, and this evening the honor of the pledge is going to go to nick nicholapolis, one of our longtime board members who will be leaving us. Unfortunately, this will be his last meeting, so nick okay where's the flag. Do we have a flag graphic to post? The youtube stream has a flag. Okay, youtube has okay, so nick, please go ahead. I pledge of allegiance. Thank you nick. I want to say a few words about nick. He has been on the board since June of 2014. He served as the community board and environmental committee chair. He also serves as the parliamentarian as well as a member of the transportation committee and the police and public safety committees, and I want to say I have had nick as one of my committee members and just in his participation on the board. He has been a wonderful addition. He's always fair. He always brings up good points he's a great member of the community. As most of you know, he owns bay ridge, bakery which donates cookies to just about anyone who might want a cookie he's worked for. Bravo and he's just we're very sorry to see you leave our board nick. Thank you guys really a bittersweet moment, because I really enjoyed every moment of being on this board. I learned so much. I advise everyone to try it at some point in their lives. It's such an amazing experience. I always try to be fair. I learned a lot about my community and the body about everyone here, and I also you know I was appointed by councilman gentilly and I continued on from councilman brennan, which I thanked for allowing me to continue this is it was really a pleasure and just my business, you know I opened another place in jersey and it's just getting a little tough. So thank you all for everything. Well, thank you. We hope to see you around. God bless you yeah! Good luck, thanks man! Good luck! Now I would like to call for an adoption of the agenda. Okay and I hear joe suckalovsky larry, collins, okay and an adoption of the minutes. Yes, second, thank you now to move on to the public session we're going to try going to attempt to limit each speaker to two minutes, just in the interest of keeping the zoom meeting short, and I would like to acknowledge senator andrew gonardis, who is here at our meeting. Would you like to speak? Is he here? Did we lose him? Okay, I'd like to acknowledge I'm assembly, woman, nicole malliotakis assemblywoman, if you'd like to speak. Thank you well. First of all, I want to thank the community board and all you're doing and your dedication to continue the meetings as regularly scheduled, so we can discuss what's happening in the community and inform each other. I want to first talk about how, during this time, many organizations, including you know, for example, not only your organization, but we saw organizations like bravo great community organizations that have stepped up, and I want to thank all of them for what they've done. Our local hospitals really stepped up and, as you know, did amazing work. I was happy to work with them very closely and trying to get them supplies, but from you know whether it was lutheran whether it was manatees whether it was the va they all did their best, and I really feel that, as I'm sure all of you do that we owe them so much in terms of gratitude to thank them for what they've done during this difficult time. You know right now we're in a transition phase. You know over the last several weeks the priority was delivering supplies to these organizations, getting them whether it be face shields or masks or medical gowns. You know trying to find ways to supplement what the city was providing because they weren't giving enough to these organizations or these healthcare communities. Now that we have come along and now flattening the curb you know there are still some issues that are outstanding. One of them is still unemployment. Unfortunately, sadly, my office has had to help hundreds of people in our district apply for unemployment. So the first thing I wanted to say tonight was you know if you or if someone within your company or neighbor or friend, is still having trouble weeks later getting through to the dol system. I want them to contact my office. As I said, we've been able to help about 400 people so far and I think to understand the magnitude of what's been happening here. 1.6 million people applied for unemployment in the state of new york. There are about another 400, 000 people. They understand that people unable to get through, even with the expanded capacity that the governor had put in with google, to try to expand the network, hundreds of people to take the calls there's still been a back up, and so, if you contact my office, we will help get your information over to dol. So you can get those payments and I think that, obviously it's a priority for every family to be able to make sure that they're getting their their checks, their families and pay their bills. I also want to share with you: state has set up a mental health hotline for those of you who may stress, you may feel anxiety. You may feel depressed. There's a lot happening here. Some people lost loved ones. Some people lost their jobs. Some people are afraid about their business with the future when the state has set up a mental health line which I'd like for all of you to share in your social media networks. To get that word out, there we've already seen a couple of suicides. You know in the vicinity in the area, and we want to prevent that from happening and get this information out to as many people as possible, and that number is 844 863 three one, four, eight four, eight six, three, nine three one four and the next phase and every day presents a new issue, a new problem. For me. In the last couple of weeks, I've been working on specifically trying to get essential surgeries back on the calendar. As you know, there's been a it was a hold on all of that, and there are a lot of people who are suffering people waiting for hip replacement, knee replacement, glaucoma surgery. You know hernia surgery or even preventive procedures like colonoscopies endoscopies biopsies. All of these things have to get back on a regular schedule. I've been working with the governor's office to get down state to get the whole state really reopened in that sense, but as of right now, it's 49 out of the 62 counties, so we're still pushing for down state, and so, if anyone has a story to share with me that I can then give to the governor about how this is impacting real people. Please reach out to my office, my email, nys, assembly60 gmail.com, also dentistry, another industry, we're trying to get reopened. I've been meeting with the medical society, but also the dental society and many people constituents have reached out dentists have reached out. There are procedures that are non-emergency that need to take place, regular braces, for instance, if you have to get them removed, you need a root canal. You know unless it's considered an emergency. The dentist currently can't see you. So that's something we're trying to move as well and put on the governor's radar working with the dental association. On that I know, senator grenardis is also advocating for that to occur, and the last thing is, you know looking for ways that we can reopen our economy and get people back to work safely. My priority or my focus has really been on the construction home improvement outdoor work yeah that stuff can happen. It's happening in new jersey, as of today, all of construction. All outdoor work has restarted, it's happening, upstate, new york, and so I'm talking with the governor's office regularly to see if we can allow it to happen in the city. As a matter of fact, all affordable housing construction has not stopped during this entire period. In the city, we were seeing sewer work resume in the city, so we wanted to see if we can put some of those home improvement, those small contractors back to work and start with that, as we look for opportunities to reopen our economy. So I wanted to be brief because I know there's other speakers, but if anyone has any questions, I'm happy to answer them. Thank you very much and thank you for the work that you've been doing. Thank you. I would next like to let's hear from assemblywoman mattel francis has joined us. Would you like to speak sure, of course, hi everyone hi, let's see here all right. I guess. If everyone can see me, that's fine for some reason. I are you guys able to see me we can. I can see you no, yes, it depends on who's talking loudest. So if everyone can kind of mute themselves that helps out, I see I see there, you are in any event. In any event, it's really good to see everyone. I want to echo what's been said before me that what a last few trying weeks and months this has been, it's really hard to wrap our minds over how everything has really changed all around us. A few months ago we had never heard of the word coronavirus, and now the entire world has changed. So I just want to start off by expressing my condolences to anyone here tonight who may have lost a family member, a loved one, a close friend, and I definitely want to take a moment just to remember all of the people here in bay ridge and southern Brooklyn, who we lost, especially during the height of the pandemic. I wanted to give people a really quick update, because I know that there are a lot of speakers tonight, but my office actually has been pretty busy from day one when everything was going on. It's not that we were being hard-headed when the governor was telling people to stay home, but the fact of the matter is we find ourselves just really not having a choice and just putting our boots on the ground going out every day to see what people needed. The number one need that we noticed right away was the issue of food insecurity. I'm sure that's of no surprise to anybody here. A lot of our seniors have been struggling. A lot of our seniors have not had access to food, so I just wanted people to know that we have been pretty busy signing up hundreds. I should say of seniors across the district, to make sure that they have meals delivered to them from the new york city get food NYC program. If anybody here has seniors who need to be signed up, please don't hesitate to reach out to my office, and I know I have some staff on this call. So they'll probably speak a little later, because unfortunately I have another zoom after this. So in addition to signing up seniors for food, you may have seen whether in the papers or in the social media that I was also out there delivering PPE door to door, we're still doing it. You know we're not. We don't always get a front page spot in the paper. I don't think I've ever gotten a front face from the paper, but that doesn't mean that we're not on the move. So we have given out thousands of masks. We just got another 2 000 from the mayor, we're giving those out right now, as we speak in a couple of days, I'll be tabling out in bay ridge. Look for that information on my social media pages I'll, probably be in front of one of the supermarkets that has a lot of foot traffic and we'll be giving out hand sanitizers, be giving out masks and things of the sort we even got a really cool donation of, like, I think, 500 or a thousand cell phone cases. If people want to sort of make a change and keep their phones term free. So there's a lot of exciting things going on. Let me share this email that we created for the 46th district, which is help ad help. Ad46 gmail.com help ad46 gmail.com people love to use it. They contact us for anything that they need, whether they want meals from the city, whether they want boxes of groceries, delivered to them, whether they need PPE they reach out to us and we have been delivering. I hope that most of you here tonight know that my office is having a really important telephone town hall tomorrow morning at 10 a.m. For seniors, if you don't know, consider yourself notified and informed when I get off this zoom, I will make sure that josephine has the flyer and will ask if maybe the community board can share it on their page. You can also look on my social media pages and you'll see it. This is a special telephone town hall just for seniors in the 46th district. That includes many of the seniors here in bay ridge. We're going to have people from the the new york city department for the aging, the new york city, food czar program, who's been coordinating all the meal deliveries, we'll have someone from hra and we're going to have a number of senior organizations in our district on the call talking about what they've been doing so from bay ridge. We'll have someone from the bay ridge center really quickly, I'm wrapping up. I wanted to echo what my colleague said a minute ago and just thank the organizations that are on the ground. I tell you, you really don't know who you have and who you can depend on. There's nothing like a pandemic for people to see who they can rely on in their time of need. I'm proud to have been there as a shoulder to lean on for the people of bay ridge, but I also want to give credit where credit is due and thank a lot of our non-profit organizations. So can I give a shout out please to bay ridge cares. Thank you for all the work that you've been doing. Grandma's love. They have been very active serving the people in the community, the bay ridge center, marianne and todd. I'm sure you two know them. The union of arab women has been doing amazing work, delivering food to people at all hours of the night and there's also a group, the Brooklyn immigrant support that has been raising a lot of money spending money out of their own pockets, delivering food to everybody, those in need which oftentimes includes immigrant families. So I want to thank everybody for doing that as well. I think that's about it. For me, I want, let me say about unemployment insurance. You know today. I got the news that my office in the last two weeks, we helped almost 350 people with their unemployment insurance claims. It's just incredible to me. It's incredible. What's going on, I am just humbled and honored that our doors are open and people can reach out to us if we were not there. If we didn't have my colleagues in government, nicole, everybody else, who's been helping with these claims. I just can't imagine what people would do, but our doors are open. Please use us call me email the office. We are helping people we get about a dozen very sweet. Thank you messages a day which warmed my heart with people, just thanking us so much for helping them. Apparently, if you try on your own to get through it's hard to get someone, but my team seems to have a secret to make sure that you can get a call back and get what you need and we're proud of that. So please reach out. If you need our help, you can also call the office at 718-266-0267, and I promise we'll call you right back. So that's it for me, but I wanted. Can I take a minute if anyone has any questions or we're kind of over time, we're trying to keep these meetings? So maybe if people want to, maybe you can message, do it by message and you can absolutely that would be helpful. Thank you and I'd like to next move on to councilman justin brannon justin. Would you like to say a few words sure really quick, really quick. Thank you. So much it's great to be here with you and see you all see all your faces. I miss you guys we're doing everything we can to help as many people as we can as always. No problems too big or too small for us we're helping folks every day, there's a lot of still a lot of grim news out there, but we do look like we're coming down the other side of the mountain and doing what we can here passed a bunch of good legislation last week to help our local small businesses doing everything we can to try to support them to make it through this tough time. You guys know where to find me. If you need me we're doing lots of mass giveaways in addition to whatever city hall is doing we're doing mass giveaways, wherever we can making sure our folks on the front line, still have masks and also we're getting our own public testing site starting the week of may 25th, which is next week, it's going to be at 85th and and fifth, which is the first, the ground floor of the municipal parking lot, and it's going to be Covid-19 testing there. For anyone who needs it, no appointment necessary. You could just walk up. A lot of folks have been asking about testing city md, pro health, all those urgent care places they're. All offering testing and they're offering it for city md is offering it for free. If you have insurance, they may they'll bill your insurance. If you don't have insurance, you can still get a test. They're really trying to ramp up testing is really going to be. The only way we're going to get ourselves out of this doing the best we can thinking forward about the summer figuring out, beaches and street fairs and that kind of stuff doesn't look like much of that is going to be happening, but we do need to think creatively, because, even though restlessness is not a metric that the CDC follows, restlessness is a reality and you'll see more and more people out and about on the streets who are just fed up with this and they want to go outside. But you know, flipping a switch and heading back to normal would be a complete disaster, which is not what we want, but we're all. We are in a new reality now, where we're flattening the curve. So we are demanding some new guidance, so we can move forward safely, but we can have some semblance of the summer. So stay safe out there. You know how to find me if you need me and we're here, for you hang in there guys. Thank you. Thank you, councilman. I would like to acknowledge captain robert conwell from the 68th precinct. Captain conwell. Would you like to say a few words is he? Let me see. Is he here? Did we lose him? Captain conwell, I think we lost him lost him. Okay, all right, laurie andrews! Yes, I just saw thank you and I'd like to recognize senator andrew gonardis senator. Would you like to say a few words? Thank you. Everyone, sorry. I was a few minutes late, but it's great to see you all here again this month. You know in some ways there's not much new to report. I think we all know that we're kind of entering month three of this, this new reality, this new, normal and like justin, said we really need to start thinking about guidance for the next couple of months. You know I was out this weekend on my bike and I saw just the parks were crowded. Coney island was packed, you know everywhere. People were out and about. We really need some good protocols in place to help allow people to have the space they need in order to enjoy the outdoors, especially during the summer months, but also do so in a way. That's safe for everyone. Two things I just want to highlight you know the need for food in our community is more dire than I ever thought. I would say every day that we're giving meals out from my office or a couple of the other locations across the neighborhood they're, turning away more and more people every single week and it's heartbreaking. You know it's a really instructive moment when people are willing to wait online for two and a half or three hours just to get food, and they have to be turned away because there's not enough food left. So I know that we're all working really hard to try to increase access to food in a bunch of different ways, but it really tells us it reminds us just how lucky a lot of us are that we can put food on the table for ourselves and our families, and so many of our neighbors can't the emails that I get at two or three o'clock in the morning from people who are still, you know dealing with frustrations with the unemployment system, and you don't know what they're gonna do next, the utter desperation is just really haunting. So I share that with you all, just to kind of put in perspective, the type of pain that people out there are still feeling and still dealing with, even if they are otherwise healthy and okay. So my office is here to help with whatever you guys need. We've been processed, we've processed a couple hundred unemployment cases, thus far people still waiting for their checks from late March middle of March, which is crazy, but we're still trying to help people. So if you know someone who needs help with unemployment, let us know, let me know we're here to help navigate the system and the one thing I kind of want to put on the radar for the board, and I know what have a lot more conversation around. This is what does it look like when our businesses reopen what creative steps we have to take to support our local businesses on our avenues, whether they are bars, restaurants, shops stores, whatever? I think we have to come together and really think outside the box about ways to create sustainable economic models for them to be able to reopen and stay open once we're out of the other side of this. So with that, I hope, you're all staying safe, healthy and well and know that I'm here for anything, you guys need. Thank you very much. Senator I'd like to now move over to the public hearing portion, and I invite doris cruz, the chair of our zoning and land use committee to present on the BSA special application, doris dorsey, might still be muted. Mute me thanks dan. Okay, are we good? Okay? Thank you start over again. Thank you. Everyone, it's nice, to see. All of you. The committee met in quorum via zoom on thursday may 14th. Also in attendance was the developer's representative todd dale. The committee met to discuss the BSA board of standard and appeals application, 2019 275 b7 for a building proposed at 9201 fifth avenue more easily recognized to us as the kentucky fried chicken site and the application is for a special permit. Pursuant to section 73-44 of the new york city, zoning resolution to permit the reduction of necessary parking spaces for the proposed building with uses in parking requirement, b1 at 92, 101, 5th avenue, basically they're asking for a change in the permit in for parking. The proposal the proposed building is a three-story mixed-use building with a cellar and the second and third second and third floors to be community facilities with medical space. The special permit is requesting six parking space. The zoning requires 50 parking spaces. After a quick review of the plans, the committee chair me offered some observations about the location before opening up to committee discussion. The observations are as follows: on 90s on fourth avenue on fifth avenue, between 92nd and 94th street, there are four driveways, possibly more. There is a firehouse. There are three no standing zones. There is a bus, stop on the southwest corner of 92nd street and fifth avenue directly opposite the location. Is a bus, stop on the northeast corner of 92nd street and fifth avenue right by 104. and there school buses? That's the b63 stuff, but the school buses pick up and drop off at the northeast corner of 90 seconds, reading, 5th avenue and the buses queue up early in the afternoon. According to the crossing guard early as 1 30 for 3 pm pickup, there is no parking on 92nd street from 4th avenue to gatling place. 92Nd street from fort hamilton to 4th avenue is highly congested during the evening. Rush gridlock and blocked intersections are common. In addition, on fifth avenue, on the east side, the closest area to the site between 92nd and 94th, there are four, maybe five driveways, thus limiting any parking on fourth avenue, then the application was open for discussion. The committee noted this is an area right for development. It is near subway stage a subway station and many bus lines. It was also noted that there are large developments proposed for the area and this would add additional congestion to the area. Although there are parking concerns about this development, the committee felt that this was an acceptable proposal because of the current congestion there were concerns that the request requested reduction of parking was too severe. Some committee members commented that adding parking encourages driving and there are many reasons to discourage and drive it. Other others noted that many people do not use public transportation for medical appointments. There are also concerns that the doctors and their staff will use the allotted parking spaces and there will be almost no parking if any for patients. Mr dale, the builder's representative, confirmed that the parking would pro most likely be for doctors and staff and that patrons would need to find alternate parking in the course of the discussion. It was made clear that access for parking would be from 92nd street. The committee saw that the 92nd street access as problematic- it is a narrow block and there are. It- is used by four different bus lines. Two in each direction members asked to develop if the developer would considered an interior drop-off, something like a circular drive driven or drive through. Mr dale said he would pass the committee's concerns on to the developer. He advised the committee that, because of the current Covid-19 conditions, board of standards and appeal is only doing virtual meetings and they are only doing meetings for items already on the calendar. Mr dale said that it is unlikely there would be a hearing before almost more likely in September at the earliest next page, since mr dale is willing to take the concerns back to the developer, the committee and the full board can review this as a later date. Unfortunately, mr dale had a previous commitment and could not attend the meeting tonight. A motion was made that the meeting be adjourned to July or august after mr dale gets back to district manager beckman on the availability of the developer and the architect, then the motion was seconded and the motion was approved. There were seven approvals, two abstentions. Following the meeting the district office received comments from residents who watched the meeting on video. They rightfully said that we, the committee, did not discuss accessories and how those drafts also would impact traffic in the area. So we have a motion on the floor to adjourn the meeting to a future date. Any discussion, any questions. We have any questions, mark questions everybody's unmuted, okay, so we have a motion to adjourn the meeting and we will be discussing this further. I second it okay. Well, the motion is the commitment and quorum. So the motion is on the floor. We don't need a second. We don't have any discussion. There are no questions or comments, so we're ready for a vote. Okay, so I'll begin, a roll call vote and I will start with tracy britton in sabre jane, kappa tanakis in favor shirley chin in favor, judy collins in favor, doris cruz in favor, hi to the emilio in favor richard day, richard michael davis, favorite favor, yasmin, swedar and saludico in favor, carmen feliciano in favor, michael festa, in favor, barbara gurma in favor, diane grinardis in favor, steve griffith, absent, judy, grimaldi, steve harrison. It's absent dan heddick in favor, john heffernan, absent justin hyatt in favor, in favor, June johnson, in favor habib judah, absent, okay, brian kozuba in favor and richard day on chat, says his mic. Isn't working he's in favor as well? Okay, I'll make him down. Thank you. Stella coca-cola's in favor ryan mahoney in favor, anthony marino in favor, ruth mazur, nick massive in favor iris mulay in favor, nick nicholopoulos in favor, susan polaski, in favor dean, rosina, your favor, dr romali, absent adam rozzati, absolutely joseph sokolowski in favor, larry, stelter recusal henry stewart in favor ali taub, janito, okay, jana in favor. Thank you, julie, thumb in favor sandy vallas in favor, barbara bellucci in favor, lori willis. In favor, michael c, absent, ed, he's here he's here: okay, michael's in favor yeah. Thank you, michael sorry about that ed you in favor. Thank you, madam chair. That concludes the role. Thank you very much and thank you, doris. I would like to add one comment. Go ahead. Zoning issues can be confusing arcane and if anyone has any questions, confused want more information feel free to reach out to me or to the district office, because it really helps to get the confusion clarified. So that- and someone did reach out to me- and I think it helped me focus on the issue more clearly. So please, if you're confused, ask us okay! Thank you, doris, thank you very much. Okay and next we move on to the chairs report, I'd like to keep this brief so good evening and welcome to our may 2020 board meeting this month. Once again, our meeting is being conducted via zoom, video and audio with live stream to the public in accordance with executive orders. I'm happy to say that we continue to have our committee meeting month, committee meetings and our monthly board meetings during this pandemic, which is a testament to this board's dedication and the staff's dedication to getting our work done. I understand that holding the meetings through this medium is somewhat cumbersome. We've done a great work as a city in driving down the numbers that indicate the damage of this virus and staying inside as much as possible is a small sacrifice that each one of us can make to keep others alive. So if we all do the right thing, this too shall pass and thank you for staying the course and attending the meeting and everyone just stay safe and be well respectfully submitted. I'd like to now move on to the district manager's report josephine. Thank you. Lori good evening board members. The district office continues to work remotely on day-to-day issues, as well as preparing for committee meetings, you may have noticed our social media pages on facebook and instagram were launched this month. The communications committee will be meeting and reporting to you next month, but in the interim, please make sure you like our pages. I want to also provide a few quick updates. The cb10 email newsletter distribution list has grown and become a great resource in getting our day-to-day important Covid-19 19 update. I too want to shout out to all the community groups who have rolled up their sleeves to help others in the community. At this unprecedented time we have received positive input from the public and also day-to-day calls from you know, regular ordinary service delivery questions. The district office also continues to mail public hearing notices on matters of importance that are on the calendar and we have received positive feedback. The department of transportation has informed our office that the 79th street overpass that reopened last thursday will proceed now to dismantle the temporary bridge beginning next weekend, weather permitting national grid and ddc work has also resumed some work and will move ahead in June, and I will get that email out to you. Finally, the de Blasio administration announced that alternate side parking regulations resumed this week starting monday, although thursday is still suspended for ascension thursday and all street festivals and block parties have been cancelled through the month of June. We touched base today as we're getting inquiries about July and august, but so far no decisions have been made about July and on July and august street block party and other events. So please continue to read all the email blasts from the district office. They really are chock full of information, stay safe, be healthy. It was nice seeing you all tonight, and our next meeting of cb 10 will take place. I'm sure right here on June 15 2020 respectfully submitted. Thank you thank you. Josephine and now we will be laurie. Doris has her hand up. Oh I'm sorry, doris. I just wanted to make a comment. During our committee meeting, the representative for the developer said he was very impressed because he deals with many communities and there are no zoom meetings going on or similar meetings in Manhattan. He was very impressed with our efficiency. Yes, he did. He did thank you for noting that doris it's true. I was proud of that as well and that that's a reflection of everyone on the board. That's right, okay, so the treasurer's report would be next. That will be in the interest of brevity that will be distributed with the minutes of the meeting, and we are now moving on to our committee reports. So the next report will be the parks committee with our chair, diane gonardis good evening. Everyone, it's good to see everyone met via zoom on monday may 11th at 7 pm. We did not have a forum present for this meeting. The meeting was also live, streamed or streamed on youtube for those who could not access it via zoom. We welcomed michael madden, rachel cramer chris yadoli, terry naruho, and chris cyret from the new york city parks, department and also present at the meeting was liam giordano from senator andrew gnardis's office. Mike madden presented a report regarding the proposed shore road park dog run construction project. This dog run is located by the area between third and fourth avenues and between shore, road and shore parkway. Just to the north of the westbound entrance to the belt park, the project funded by councilman justin brannan from our 43rd city council district to the tune of 1 million dollars. The area encompasses 0.4 acres of shore road park, which stretches over 58 acres of land along shore road. The goal of this project is to provide space to accommodate, to accommodate both large and small dogs, amenities for dogs and dog walkers provide a welcoming entrance, enhance, provide softer surfaces with less concrete for dogs, correct drainage issues in the area, all in an ada, accessible property door. Road park, along with the other parks in bay, ridge and neighboring communities, provide many activities, including areas for baseball handball, basketball and tennis. There are few parks within this area that also prov dedicated space for a dog run. The area proposed was previously used as a temporary ice skating, rink a playground and, most recently an area dedicated for construction. Staging mr matt did a detailed description of this area, including the fact that it is currently covered in cracked asphalt. He proceeded to explain production proposal as follows: there will be pedestrian-only entry areas and one maintenance area. The ladder will be loca off the intersection of avenue and shore road at the double gate area, and I see that you have this the slides up for everyone to access. There are a good number of trees in this proposed area, which has they've all been inventoried and found to be in good condition. These trees will provide a nice amount of shade along most of the area, providing an overall canopy of shade in most areas where the benches will be situated. This part of the park faces due south and will therefore be getting adequate sunlight as well. There are planting beds which run along the outer edge of the property compact buried. Evergreen shrubs will enhance the air around the dog run. A new connection for a bottle filler with a dog bowl will replace an existing inactive water. Fountain stink holes which exists, will be remedied by the department of environmental protection. There will be a trash bin, a dog bag dispenser near the entrance to the run. There will also be water access, post, spigot connections and a storage bin located on the property. The dog run will be divided into two sections to accommodate different sized dogs. The area dedicated for smaller dogs will be about 4 000 square feet, and the area for larger dogs will be about 12 000 square feet. There will be a four foot fence separating the two areas. A synthetic turf which is canine friendly will be used as well as dog friendly mesh fencing in an effort to comply with the parks without borders, initiative, the height of the fencing, will be lowered to appropriate levels at various areas of the run also so that the dogs are not distracted by the tennis court activities. Adjacent to this run, a fabric screen will be added to the fence along the side of the tennis courts. There will be steel tree guards installed around the trees. The design of these have not been finalized, but will be conducive to being able to keep the areas around the tree clean from leafs and other debris. A variety of benches will be installed, including benches, with arms and backs as well as backrest bench. A robust drainage system will be installed to collect and manage rain water in the area to bleeding buds in the air. The led will provide added lighting to accommodate the time of day or night that individuals might use the run. The timeline for this follows the design phase is set to end on November the 12th. The procurement phase usually takes nine months after that construction phase usually takes 12 to 18 months, although it was noted that this particular project would probably be constructed in 12 months. If this is the case, the project would be complete around february 2022. If not an additional six months would be added to the construction phase, bringing the new the project completion to august of 2022. following the board meeting a few questions from board members and the public were that were forwarded to the new york parks and we received the responses, and I will go through those now, since the parks department will be working on a drainage system. Do you feel comfortable asking them to consider putting a small sprinkler for the dogs and maybe one or two pieces of workout equipment, a bridge, a set of stairs even just three steps that go up and down something, a little extra for the dogs to entertain themselves, but, of course, have room for their owners to do frisbee throwing and have social distancing was a sprinkler considered? Is this possible at this juncture and the response was I don't know that we've ever installed a sprinkler in a dog run, but that's a very interesting idea. That might be something we can consider in future sites we're pretty tight on, but so I'm not sure we can add additional elements like a sprinkler or workout elements for dogs. However, community members will have access to a hose bib and can connect any sprinklers. They would like to bring the sprinklers can be stored in the provided storage box when not in use the next question or comment. I am concerned about the wrought iron guards surrounding the trees. Are there any other options to protect our trees from dogs in the park that will not harm the trees and the end? Was our designers have been working on this detail? They have opted for a steel fence that will give ample room for the truck trunk of the trees without needing to use a concrete footing that would impact the tree roots. This is our most effective tree guard option for this condition as the trees have such established root systems, and we need to be particularly careful not to damage any structural roots. Next question: is there a friends group that will be maintaining the dog run or will new york city parks provide regular maintenance? This is not an existing friends group associated with this dog run. New york city parks will provide basic maintenance of the site, for example, trash removal, perimeter, cleanup, etc. However, it is important to form a friends group around the dog run. The friends group is responsible in helping to enforce the rules of the dog run and perform cleanup and maintenance of the run. Our partnerships for parks team can help to develop and sustain friend a friend's group when the run is constructed five. There are, there were several of these children sandboxes in the robert moses era, original plans for showroad park, circa 1940 and several remain the one by zaverian, the narrows botanical guard, the botanic garden and which has been marvelously trans transformed into a koi pond, another around 82nd street, or so that has become an overgrown box of weeds, and I think that there's at least one more further south and this one be preserved, and this would be in the in the dog run area the sand pit. While we appreciate and understand the interest in preserving this element, unfortunately, the condition of the sand pit is very poor. This pit would need complete reconstruction and conflicts with the open run dog space that we are proposing. The sand pit is also in the critical root zone of a mature tree, so careful removal is our best option. Our other concerns are the sanitary and maintaining and maintainable aspects of a sand pit in the dog run. And finally, the last question was this: playground was closed due to poor underground water, sewage infrastructure. Has this been examined? Department of environmental protection responded on all infrastructure projects and parks. We work closely with dep to ensure any work we conduct for both the underground system sewer and the longevity of the project dog run. In addition, we have conducted multiple rounds of borings with both percolation and soil testing throughout the project area to ensure we are approaching the drainage and settlement issues with as much information as possible. We have addressed the sinkhole issue with dep and it is currently slated to be repaired. We continue to follow up with dep periodically to check on the repair status since we did not meet in quorum and there being no other discussion or questions on the presentation. The chair me asked for a recommendation from the committee to proceed to proceed with the project. Justin hyatt made a motion to write a letter to the new york city parks department in support of the design as presented. It was second by dan, hederick's and all member dependents agreed with the recommendation. This will be brought to the entire cb10 membership at our general meeting. This was the only item on our agenda. All those in attendance were thankful for their participation and the meeting ended at 7. 30 pm respectfully submitted diane gennard is here. Okay, thank you diane, so the committee did not meet in quora and all members dependents agreed with the recommendation. Okay, so we I'm sorry so we would need we would need a. This. Was the only one from the floor? Sorry, I think someone's listening to the live stream yeah and it's coming through so whoever's listening to the live stream. Please mute yourself because it's okay, so they did not meet in quorum. So we would need someone to make a motion you're using a mobile phone. I can't help you doris's hand is up. Oh okay, doris, and I need a second, no, I'm not making a motion to support it. I am making a motion that it not proceed until there is a friend's group department cannot do any maintenance in cannonball park where there are numerous broad benches okay. So we can this up in the discussion right here, but what we're so now, what we're looking for is. We need a second from the floor, because this is, I can second it. Okay, thank you jana! So now the motion is on the floor and we can open it up to discussion. Doris, would you like to say something? Yes, I would like to make make an observation that many dog users use cannonball park and I think there is no maintenance in cannonball park and if there I would not like to see maintenance for dog park be diverted from other park maintenance. I need. I I'm very concerned that there should be a friends group supporting this before it proceeds. Okay, madam chair, may I say something yes responsible, because I spoke today to chris mccrate, who is councilman brannan's chief of staff, and I spoke to him about the issue of the friends group and he does have a list of interested dog goers who attended the scoping meeting, who were interested in forming that friends group and we both committed to working with the group and the parks foundation to organize that friends. Group for the park. Okay, so do we have any other comments from anyone? Yes, joe anything raised. Who do we have here? Hello? Oh hi! Go ahead, joe okay! I just want what they mentioned about the lighting that it's going to be open, 24 hours yeah. What are the hours? That was my question yeah. It sounded like 24 hours to me. Diane. Can you answer that for joe I'm? Sorry? I didn't realize I was on youtube [Laughter]. So there was some discussion and it actually, it did not say, go ahead. Diane. We can hear you okay, so it's we did not really the hours of operation. The only thing that was addressed was the fact that there should be adequate lighting for those that do use the dog run in the evening or in the early morning. But there was no absolute discussion about the time. You know what the operations of the dog okay. Do. We have any other questions. Any comments, don't go ahead. Larry. I think I lost yours. Larry go ahead, larry you're, mute! There's I mean I'm here. You hear me now yeah. No. I noticed on the plan that there was those red arrows at the entrance and it looked to be. There was a gate of some kind. Is that part of the plan or that sort of thing? It's not 24 hours there. As I mentioned, there are three entrances for pedestrians and there is one double gate entrance that will be used for maintenance, maintenance for trash cleanup or anything of that nature. I don't know committee members, I don't recall them saying that those would be locked at any particular time. They said, I think the maintenance, the maintenance gates, were going to be locked and only opened, for you know, parks, department, crews, those big large gates and those were the double gates, but the other, the other entrances would for pedestrians. Only yeah. The way that the plan seemed to be laid out is there would be a single pedestrian entrance out to the pathway near the park, and then there would be a split like interior kind of a like contained area where you could either go off into the small dogs area or the log large dogs area. So those are the other two gates but they're inside the parks, there's only really one pedestrian entrance that goes out into the main park area, and I it's possible that could be locked or not. I'm not entirely sure it might depend on the overall hours of the park itself since it's within shore red park. Okay, do we have any other questions or comments? Yes, go ahead, I asked a question in the chat I couldn't. I was looking at the pictures. What was the building that was pictured in the photo where there was like a fence and there was a building beyond it, a brick building? That's just a simple, that's just to say that wasn't in that. Okay, because I didn't, I didn't know if that was a proposal to put a building there or okay, so just found it just an example. I just wanted to be sure. Okay, all right. I also think that the hours should be restricted. The only can I interrupt for a second yeah sure mark, please, if you like to speak, there is a raised hand function on zoom. We will not necessarily see you waving your hand on the screen, because there are three screens worth of people so use that raised hand function. Please where's that and diane's hand is up. So I just want to clarify the only thing that they propose on putting in the area is a. We cannot hear. Okay for those of you who are not speaking. Can you please mute yourselves, use your mute feature and then unmute yourself when you're going to speak, okay go ahead, diane, maybe we can hear it now? No, so that was the only thing I wanted to clarify. Is that the only thing that they are said that it would be putting in the area besides the benches ex been, and that would be the only structure, yeah, okay, any other questions again use your raised hand feature your zoom feature to raise a hand and then mark will be able to see who's willing wanting to speak. Do we have anybody. Mark dan has his hand up I'd just like to add, because we were talking about hours of operation. One of my questions to parks was whether the lighting would be sufficient to fill the entire space. There are only lights on the upper portion of it near the path, and they said they would be installing some high-capacity led lights. That would keep that entire area lit even off hours. So it would be very easy to see if anyone was in there and keep it safe, especially because it kind of goes off a little bit and it's mostly just grass so should be easy to spot. Anyone should be pretty a little bit safer than the surrounding area with those lighting thanks dan barbara's hand is up bad barbara. You got to unmute yourself there. You go okay, hi, now just to answer that the idea of the the maintenance and the hours and the lighting will they be cameras. So if something happens there that there'll be some kind of recording, they made no mention of any kind of cameras or any of that kind of technology. Yeah. I think with the with the parks budget. I don't know that we're going to be that lucky, you know and a lot of strange things happen. You know it could be a place where unsavory activities can be happening under the guise of going to walk a dog. Well, I was, I actually have to say, I'm very familiar with that with you know the park and walking a dog there at night, and I was very happy to hear that it will be well lit, because the area right now is very dark. It's been fenced off for a long time. It's been in a state of disrepair for years, and I really think that this will brighten it up and I it. I would think that it would make it more safe with all that lighting all right laurie. I also want to add sorry other dog run, that is on the other side of the by 68th street, that side of the hut. They don't have any camera system there as well. Is that I don't have a dog, so I really don't know. No, they don't. No, that seems to be much open. You know a much a much more open area. Maybe not as as I don't know, secluded you know as the as this new proposal. Yes, yeah, that's the area, that's visible, even from the highway at owl's, head yeah right joe's fiend's hand is up joe go ahead, yeah. No, I just wanted to add that the parks department is requesting just an endorsement of the design as it was presented. I think a lot of the questions about hours of operation and all can be addressed when the parks committee joins with the councilman's office to work on forming a friends group as we have with other dog, runs in the district, and I think it is important to have a friend's group. It's we have one at some of our others in the district at owls head and at daika beach park, and I know for daika beach park. We were instrumental in helping form that group, so I do. I do think we can resolve a lot of those issues at you know at that juncture, but tonight we're really tasked with reviewing the design and endorsing the design for the parks departments. You know for them to go ahead in the process. Okay, so do we thank you for that and joe sorry, you have dan too, laura sorry yeah. I just wanted to give a final comment of like I'm really excited to see so much attention being paid to the southern part of shore road park lately, especially with the new ramp just north of this, and now a dog run, it shouldn't increase and attract more people to use this part of the park. So I think this is the first step on making this part of the park a lot less sketchy that a lot of people remember it. So I'm really excited, I know at least 10 friends who live down in the 90s and the hundreds that want to walk their dog over here. So just giving that as an anecdotal bit judy grimaldi. Can I make a friendly amendment. I mean, since this is about design. Could we include a recommendation for some sort of surveillance? Count? Commerce, because it is in such an isolated spot? Would that harm the application, since it's about design the fact that you know they're on a very tight budget, even that's their job to figure out, but we our job, is to make recommendations and they could say no, but if we never ask, we won't get it. I have no problem, so I think that's fine that we include a request for surveillance cameras for safety reasons for the users of this area, because it is so isolated. Okay, so do we have any other discussion on that stars hand is up, go ahead. Sorry, clarification! We're only discussing design now, maintenance and other issues will come back to the board. Will it proceed with other issues before it comes back to the board after the design is approved? I think that being indicated that that's something that would be worked out with the friends committee and with the parks department so right now, the only thing they're asking us about is the design you know as to the hours of operation. You know I'm not really sure about that. I guess it would depend on the friends and also you know. This is part of the park, so you know it goes by parks, department rules, joe, do you have anything to add to that? No, I would. I would just agree that you know there are rules by parks that are posted when there's a friends group there is, you know once it's an organized friends group. They can set hours of operation if that's what's agreed to on by the group and the parks department, but there will definitely be a follow-up meeting. This park is planned to be completed in 2022, and I can assure you know the members who are concerned about it that we will have a meeting with you know to establish a friend's group in advance of the park being the dog one being completed. Okay. So if we have any more comments about the design in particular, who would be monitoring the cameras? So, typically, the cameras have a live feed like the police department. They have a continuous feed and that feed is retrieved when there's an incident and the police department have the ability, it's so typically surveillance cameras are not monster. You know live my experience with the argus cameras. Only if there's an incident in that time would be. You know, retrieved, they're, really a deterrent, not that they're going to stop the crowd, seize the camera. They may not act because they teach them. Okay. Do we have any other hands-on questions about the design? Let's come to an end, because, yes, that we repeat the same thing over and over. Thank you. Sorry. You have the phone on your ear and you have to concentrate, and there is noise static noise. So you cannot hear very well. So let's come to an end for that particular subject. Okay, so now I'll get to you in a minute stella does anybody else have a comment or a question? Okay, that on stella's recommendation we're going to call the question so all in favor of the committee's recommendation with the friendly amendment as suggested hi. I understand this is taking a long time. We usually do a roll call. What I'm going to ask is if anyone listen very carefully if anyone is against is not in favor. I cannot see you, but at least I can hear you mark. Can you mute stella, please? If anyone is against the motion, please use your raised hand feature on zoom mark where no, I was trying to make a comment before, but no one were asked to raise that use the raised hand function on participants. I recognized that you were trying to make a comment. Where is the raised account raised hand? Okay, we're gonna have to do a roll call, go ahead, hold on lori on the participants on bottom or the more the more record, and then it says reactions. It doesn't say anything about a hands up. Do you have the participants open on the right side? Participants open it's on it's in the middle. You have the list of participants open. No, when you tap on participate clarity on the right hand, side. Yes, I have no, yes all right now you want to have it now on the bottom. There should be a raised hand function all right, all the way to the right, larry all right slide on the bottom. I got it here now. Everyone have it yes, larry's hand. Is up now, okay? Is there any anyone else speak up? If you are have, if you are voting against larry had his hand up. Barbara has her hand up. Okay, all right now, don't try. Well, let's use the raised hands feature for in favor. Yes, I did. I just want to comment about that synthetic tarp how resilient that's going to be and then mixing it with the grass. Yes, I can actually answer that really quickly. The parks department said it was a turf specifically designed for dog parks and dog runs. Well, it's not going to be ripped up and then it's going to be replaced. So all right, I need to bring this to an end. Josephine joe. I think we're going to have to do a roll call because the raised hand isn't working and then, in the interest of time, I'd like to do a roll call. So can we please have a roll call vote? Oh come on josephine? Are you there joey there, I'm here, okay, joe I'm, here, I'm sorry, I was on you tracy britton in sabre jane, kappa tanakis in favor, judy colin judy stars, michael devine. In favor and politico in favor, carmen feliciano in favor, michael festa, in favor, judy grimaldi in favor, steve harrison's, absent dan headaches in favor john heffernan, absent justin hyatt in favor jill hajar johnson June habib juday, brian kazuba, in favor delicacy in favor marty lentz in favor, nick leonardo's, your favorite stephanie mahany in favor ryan mahoney in favor, anthony marino in favor, ruth mazur, is absent. Nick, I see really. Oh hey bruce. I'm sorry hi, I'm here, but I just can't. I can't vote I'm obtaining okay abstain. Thank you. I can see the issue: okay, nick in favor iris mulay in favor, nick nicholapolis in favor, susan pulaski and favor dean rasina in favor, doctor romawi, absolutely absent joe suckalovsky in favor larry stelter in favor henry stewart in favor, janet taub in favor julie, thumb in favor sandy vallas in favor, barbara velucci in favor, lori, willis, [Applause]. Okay. That concludes the role. Thank you josephine. Thank you carrie! Thank you very much diane and the committee, and next we move on to the nominating committee report. Yes, sorry, I have my up so just because it's ramadan I'm going to go early, but I just want to let everyone know. I am tutoring anyone at this time. So if anyone has any kids that need any help from middle school elementary and even into high school, please do reach out to me. I am doing that now so have a great night, and I will see you guys next month. Thank you. Thank you. Okay, okay, so I'm sorry judy grimaldi, okay, so the nominating. Can you hear me? Fine? Okay? Yes, the nominating committee met the committee. I'd like to acknowledge was tracy britton ruth greenfield mazer susan pulaski, michael festa, and myself I was serving as chair. We met twice. The first time was on tuesday July 28th and we met in quorum and we determined the process for selecting the slate. We established that we learned that all of the officers who have the pos hold the positions now are eligible for an additional runs. So we made the outreach to those mem those officers and learned that all of them were willing to serve again. They we also sent a notice out which the district office sent the notice out. Thank you very much staff, and it was emailed to all board members saying if anyone was interested in nominating someone or self-nominate for the position of officer that they had to, let us know by may 5th, and we received no additional nominations. So the committee met again on wednesday may 6 my at 7 pm. I was not able to be part of that meeting and thank you to susan polaski for running the meeting and for stepping up. It was attended by tracy britton ruth mazur, again and michael festa and dorothy garuccio hosted the meeting, and at that time we determined that, since there were no other nominations from self nominations or other nominations, and that the existing officers would wanted to continue in their role that they expressed their desire to continue. We are now proposing the slate of officers to be for chair laurie willis, her vice chair, jean-marie capotenakis secretary sandy vallas and treasurer brian kosuba. So I'd like to thank all the members of the nominating committee for serving and that the at the June meeting, this slate will be offered unopposed. I believe and therefore we will be able to all vote next at the next June meeting. Thank you thank you judy and now old business, any old business. Anyone do we have any hands up mark. I do not see any okay, any new business. Wait. Sorry, doris and barbara okay doris go ahead. Is this all business or new business just because I called them both go ahead, doris you have to mute okay, the nominating committee just for clarification and they said they met in July. No did I say that? Yes, you did. I did I love you girl. Why did you lie mike ron? We met on April 28th at 9, 15 and then again on may 6 2020.. Sorry, thank you. Where did I say and barbara yeah? This is a new business. I know this is a question that you know. I still can't understand why liquor stores are under the title of essential businesses, but right now, if you go to a bar, you can walk out with a drink and you can walk in the street and now in Manhattan you see people are congregating outside of the bars at night. Do we have any plan? Does the precinct have any plan regarding the public drinking good question? Yeah? I don't. I don't have any information on this in terms of, and I don't know if that's been a great problem in our area. Josephine do you have anything on that? We haven't received any complaints about that, but I certainly could reach out to the precinct commander absolutely and report back to the board. I could call him tomorrow and learn from him. You know how they're a if they've been handling that you know because I've been inside not out myself. So we could ask him if he's had these types of issues, how he's handled and how he will continue to handle as we approach the summer months, yeah, especially like this coming weekend and the weather gets warmer in Manhattan was on the news. All day long that people, you know they came in parties, there were like 10 15 people hanging outside the bar with their drinks, some with masks some were not, but they were standing outside the bar, and just this afternoon a friend of mine said that he met another friend. They passed the bar. They bought a beer and walked through third avenue with a beer and a cup today. Well, I certainly that is not allowed yeah but yeah alcoholic beverage yeah, but as things open up, I mean it is a good question and a good question to put to the police department, because, as things open up, I mean there are going to be. You know we're encouraging. You know more and more people to frequent businesses, and I see you barbara, I hope that's water, more and more people to frequent businesses and they do need a plan and maybe some guidance. You know, although I know you know everything's developing minute by minute, because it is a new situation for all of us. So there's a lot of trial and error, but you know if josephine can reach out. That would be great, doris is next. Okay. I was on a zoom meeting with my homeowners association from fire island yesterday, and this issue came up and there is an sla regulation that you cannot carry an open container of liquor and on fire island. They are looking for the suffolk county police department to enforce it. So there is existing regulation and it's a very important issue to be addressed. Thank you, barbara dean yeah. I just wanted to echo that the regulations say it's when the bar sells is for on-premise consumption. So you know the old rules still apply. We need enforcement, that's the that's the bottom line that was dean. Oh I'm sorry, yeah! That was with the mayor and the governor they're saying you can go out and do this. I didn't read any executive order to that effect, but I think that's what's happening. Sorry, I know I'm not a board member. The executive order is you can they can sell it for take away, but you can't you're still not supposed to drink it on the street yeah and doing it? Okay, jane marie jane marie? Yes, I just had an unmute with the there. We've always had a situation by the park on 67th street between third and fourth avenue has had really a growing homeless encampment, especially during these difficult times, and so I just wanted to raise that issue once again, as that, it being an issue of concern for our community and if, whatever possible outreach, can be done at this time jane. I will tell you that I did speak to captain conwell and he did raise that issue with me today about homeless in the northern section of the district, and they are working with DHS and outreach, and I will relay that specific location to him as well. Thank you, okay, brian hi, I know in some parts of the city, they've been doing open streets. I was wondering, if there's been any consideration about doing that in bay ridge. Since I know it's an area that you know we're used to having our street festivals and our walks and lots of block parties as the days get better. You know I'd love to see some of that down in our areas to sort of expand. The footprint of where people can go when that when it's nicer well, I think that in our district we have- I mean, as you know, being part of the city. We have one of the greatest. You know areas of park lands you know as compared to other areas of the city, so we do have a great amount of parks for people to get out in. So I don't think, there's been any proposal in our district or having you know the open streets, but that doesn't mean that they're there aren't considerations for that. You know coming down the line, you know as things open up josephine. Do you want to add anything to that? Yes, I just want to add that I spoke with the department of transportation today on this very topic. In order there has to be an applicant, a community group to apply, and so far there was one application for an open street on marine avenue that was made, but, unfortunately, marine avenue is a bus route and the cross streets that were on the application were non-existent and if there are any other open street applications, the department of transportation will notify the board, and I will share that information with you all. I think you'll go to the point. I think it I think you're right do you think we have great parks. I think the problem is because we have great parks. People from other neighborhoods are going to start coming to our area, so it's not just our neighbors but neighboring neighbors, and I think it could be a situation where we wanted to have not having a lot of places to go. I tried to raise my hand judy grimaldi. That point line is what I'd like to make where we, our parks, especially along the shore road area, attract the immediate, the immediate surrounding areas and if we don't have a place to absorb all those additional people, they're going to overrun the park, it'll be impossible and what will happen is they'll close them. So I don't know if portions of sure road, I know it's a bus route, but portions of sherrod could be open and so the spillover from the park could extend out because it's going to spill over doris. I have a long-term question because I was discussing this with someone and they said it's wonderful, but as the city reopens, it would be very helpful to have streets in their clothes for additional pedestrian and bicycle traffic, so that people feel safer traveling once the city is open for business and I just put it out there, so the discussions out there for are for everyone to think about and their elected officials. Thank you very much dan yeah and I would absolutely agree with both doris and brian, that, like it would be very sad to have a summer in bay ridge where there has not been a stroll of some kind, even though it would not be a organized stroll with actual people like we'd have to enforce social distance, but just opening up one of these avenues sometime this summer or multiple avenues to let people walk and enjoy the sunshine even for extended periods of time. That would be amazing and keep the spirit of what makes bayridge so special and one of the I've had friends, who've moved here and that's the first thing they knew about bay ridge and it's the thing that kept them here and I just love to not see that go away diane. I have two questions. If, for example, we would consider closing offshore road, would they would they reroute that the the buses that go along the shore road, including the express bus, etc? Would they reroute it to maybe a ridge boulevard or you can't go all the way through narrow, so that might not be a consideration. That's my first question and I want to second what dan said I mean walking along third avenue. Maybe that would absolutely help us support our local businesses as well, and so I would be in favor of something like that. Okay, yeah, sorry, I don't know the name host from bay ridge. I already spoke. That's it lori, okay, all right everyone! Thank you very much. I would like. If we have a motion to adjourn, I've got a question. Do I have a second? Yes? Oh hello? Yes, hello thanks mark. Thank you mark. Thank you mark thanks joseph thank you good meeting, thanks lauren good night, all right. Thank you. Everybody. Thank you for your coordination.",
        "summary": "I want to first talk about how, during this time, many organizations, including you know, for example, not only your organization, but we saw organizations like bravo great community organizations that have stepped up, and I want to thank all of them for what they've, done.\nUnfortunately, sadly, my office has had to help hundreds of people in our district apply for unemployment.\nSome people are afraid about their business with the future when the state has set up a mental health line which I'd like for all of you to share in your social media, networks.\nYou know in the vicinity in the area, and we want to prevent that from happening and get this information out to as many people as possible, and that number is 844.\nI've been working with the governor's office to get down state to get the whole state really reopened in that sense, but as of right now, it's 49 out of the 62 counties, so we're still pushing for down state, If anyone has a story to share with me that I can then give to the governor about how this is impacting real people.\nYou know looking for ways that we can reopen our economy and get people back to work.\nSo I just want to start off by expressing my condolences to anyone here tonight who may have lost a family member, a loved one, a close friend, and I definitely want to take a moment just to remember all of the people here in bay ridge and southern Brooklyn, who we lost, especially during the height of the pandemic.\nA lot of our seniors have not had access to food, so I just wanted people to know that we have been pretty busy signing up.\nUp, please don't hesitate to reach out to my office, and I know: In addition to signing up seniors for food, you may have seen whether in the papers or in the social media, that I was also out there delivering PPE door to door.\nIf you don't know, consider yourself notified and informed when I get off this zoom, I will make sure that josephine has the flyer and will ask if maybe the community board can share it on their page.\nThere's a lot of still a lot of grim news out there, but we do look like we're coming down the other side of the mountain and doing what we can here passed a bunch of good legislation last week to help our local small businesses doing everything we can to try to support them to make it through this tough time.\nThey're, really trying to ramp up testing The only way we're going to get ourselves out of this doing the best we can thinking forward about the summer figuring out, beaches and street fairs, and that kind of stuff doesn't look like much of that is going to be happening, but we do need to think creatively, And you'll see more and more people out and about on the streets who are just fed up with this We are demanding some new guidance, so we can move forward safely, but we can have some semblance of the summer.\nSo I, know that we're all working really hard to try to increase access to food in a bunch of different ways, but it really tells us it reminds us just how lucky a lot of us are that we can put food on the table for ourselves and our families, and so many of our neighbors can't the emails that I get at two or three o'clock in the morning from people who are still, you know dealing with frustrations with the unemployment system, and you don't know what they're gonna do.\nThis is what does it look like when our businesses reopen what creative steps we have to take to support our local businesses on our avenues, whether they are bars, restaurants, shops stores , I, think we have to come together and really think outside the box about ways to create sustainable economic models for them to be able to reopen and stay open once we're out of the other side of this.\nSenator I'd like to now move over to the public hearing portion, and I invite doris cruz, the chair of our zoning and land use committee to present on the BSA special application, doris dorsey, might still be muted.\nThe committee met to discuss the BSA board of standard and appeals, application, 2019 275 b7 for a building proposed at 9201 fifth avenue more easily recognized to us as the kentucky fried chicken site, and the application is for a special permit.\nIsn't working Zoning issues can be confusing arcane and if anyone has any questions, confused want more information feel free to reach out to me or to the district office, because it really helps to get the confusion.\nThe district office continues to work remotely on day-to-day issues, as well as preparing for committee meetings.\nThe communications committee will be meeting and reporting to you next month, but in the interim, please make sure you, like our pages.\nWe welcomed, michael madden, rachel cramer chris yadoli, terry naruho, and chris cyret from the new york city, parks, department and also present at the meeting was liam giordano from senator andrew gnardis's office.\nThere are few parks within this area that also prov dedicated space for a dog run.\nFollowing the board meeting a few questions from board members and the public were that were forwarded to the new york parks and we received the responses, and I will go through those now.\nJustin hyatt made a motion to write a letter to the new york city parks department in support of the design as presented.\nWith you know, the park and walking a dog there at night, and I was very happy to hear that it will be well lit, because the area right now is very dark.\nNo, I just wanted to add that the parks department is requesting just an endorsement of the design, as it was presented.\nI think a lot of the questions about hours of operation and all can be addressed when the parks committee joins with the councilman's office to work on forming a friends group, as we have with other dog, runs in the district, and I think it is important.\nI just wanted to give a final comment of like I'm, really excited to see so much attention being paid to the southern part of shore road park lately, especially with the new ramp just north of this, and now a dog run.\nI. Think that being indicated that that's something that would be worked out with the friends committee and with the parks department, So right, now, the only thing they're asking us about is the design you know as to the hours of operation.\nSo I'd, like to thank all the members of the nominating committee for serving and I believe and therefore we will be able to all vote next at the next June meeting.\nWe could ask him if he's had these types of issues, how he's handled and how he will continue to handle as we approach the summer months, yeah, especially like this coming weekend and the weather gets warmer in Manhattan All day long that people, you know they came in parties.\nWe've always had a situation by the park on 67th street between third and fourth avenue has had really a growing homeless encampment, especially during these difficult times, and so I just wanted to raise that issue once again, as that, it being an issue of concern for our community and I will tell you that I did speak to captain conwell and he did raise that issue with me today about homeless in the northern section of the district, and they are working with DHS and outreach, and I will relay that specific location to him as well.\nSo I, don't think, there's been any proposal in our district or having you know the open streets, but that doesn't mean that they're there aren't considerations for that.\nPeople from other neighborhoods are going to start coming to our area.\nThey said it's wonderful, but as the city reopens, it would be very helpful to have streets in their clothes for additional pedestrian and bicycle traffic, so that people feel safer traveling once the city is open for business."
    }
}