{
    "YoutubeMetadata": {
        "author": "BCB8",
        "channelId": "https://www.youtube.com/channel/UC6iGdyvRLkyl2PuWSASkhzA",
        "title": "Land Use Committee Meeting 9/3/2020",
        "publishDate": "2020-09-03",
        "shortDescription": ""
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "BCB8",
        "normalizedName": "Brooklyn Community Board 8",
        "twitterName": NaN,
        "youtubeChannelName": "Brooklyn Community Board 8",
        "youtubeChannelURL": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
        "twitterHandle": NaN,
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "Zoning right here, yeah and so expect a lot of private applications. The problem with that is that you don't get the infrastructure improvements that you need when you start adding, leading and adding ahead of that, I'm surprised. Gibb is not one he's the one that asked for the meeting. Oh lord, does everyone haven't had a good summer so far, but it's still a few minutes. The meeting was supposed to start at 6 15, and so we got five minutes so hopefully, hopefully more people will come on in the next five minutes. Okay, my memory is getting short here. So will you monitor the chat? Please he's muted, she's, muted, yeah, I'm sorry, I I'm gonna have a problem helping because I'm a little distracted, I'm doing something else at the same time, so multitasking- I am I'm okay, I would love to. You certainly can ask me the next time: okay, but I'm kind of multitasking right now trying to be obedient. [Laughter], we'll see shouldn't be two people on tonight. This is what you call show and tell well there's something nice to speak about. So that's good. Absolutely my mother used to says poor dog doesn't wear their own tail. You got that right, okay, so miss neil. Are you guys back in the office more now or not as much or okay? So until I can test negative for copied, I won't be able to be back in the office like officially. We are going in for the sole purpose of trying to get everything organized and ready for this upcoming meeting season recognize michelle, and I recognize that kovid is going to make pretty much all of the 2020 2021 meeting season committee and general board virtual. So we are just trying to get as much accomplished in the office as possible, minimizing our interactions with each other, and so we can determine whether or not I'm contagious or, if there's anything to worry about. I don't particularly feel comfortable being around people, so you know it's that. Do you know who gave it to you. I am 99.99999 positive that I got it in the right aid on st john's place between kingston and albany on march 17th, when a very nasty person in response to me asking her to please back up a little bit when the social distancing requirement was only three feet and she was less than a foot behind me coughed directly in my face. Oh my god that I I'm 99.999, confident that that's when I got it because I started developing symptoms, approximately eight days after which, at that time in march, was you know the incubation period and also that was when cv-8 and cb9 was literally the predominant hotbed of new york city's povid 19. You know virus. We have a lot of inter intergenerational households in this in this district yeah yeah. So people are sharing all kinds of closeness, and this is what you get well, I'm glad you're better, considering that you're had to stay out for two weeks to make sure you were okay, I was out for over a month I was out twice. I got it twice wow or I'm a long hauler and they just haven't identified what lung holders mean. Gotta, love being me, looking at people who've had it and recovered to get there to get some part of their blood. I'm trying to think what plasma you know. You know one of the reasons why I was so gung-ho about getting tested in july. I'm sorry late, June, not only because you know we were getting michelle and I were getting tested to reopen office, but also because I wanted to go to mount sinai and donate my plasma. But in order to donate plasma, you have to test negative while testing positive for antibodies, and I tested positive for both and they were like yeah. No, please stay away, so we haven't gotten that far yet okay eligible. Finally, now after waiting the requisite eight weeks for newton's thing to get tested again, so it's literally just finding a convenient testing site that isn't the same testing site that I went to before, which was city md. So that's what I'm looking for right now and I'll be getting I'll get tested again, and hopefully it comes up negative mm-hmm. They should have a site up here on eastern parkway and ocean avenue. I want to go like I don't. I did not enjoy my experience with city md at all from start to finish, so I would hope to avoid them entirely, but I mean I'll take whatever at this point: there's Brooklyn hospital 35th street and what first avenue remember I was in and out of there in 15 minutes, 20 minutes. Oh, so I'll definitely look into that, because I would. I would really like to just get the monkey off my back, so to speak, just be able to relax and let my guard down just a little bit, apparently we're back to normal, but where it feeds normal. Where is this requirement? This is [Laughter]. We have ben verde. That name is familiar online and mr barrack, who changed his name to btac. That's okay! Thank you for coming, mr barack. We are waiting for give veconi who asked for this meeting and it's a celebration of sorts blow. Our horn a little bit, I think everybody got copies of the infinity benefits agreement related documents that ellie perriente provided at the finally approval by the by the council. So once that was done, we were able to. He was able to register those documents with acres, automated county registration information system, the county clerk's office, where all the deeds have to be registered. So all of those things, if you didn't get in your email, it's all available at acres areas, hey gab, hello. How are you doing I'm doing? Okay sounds good, but someone please remind me who ben verdi is, since he didn't respond to my question. You can unmute yourself, mr birdie. No he's ethel he's a he's, a reporter for the Brooklyn paper. He wrote the story that was published today. Okay, all right, so we're three minutes into our allotted time for our celebratory meeting, the marks, a successful completion of a effort to get community planning into a neighborhood rezoning. That's been stalled, so mr bocconi, take it away, unmute yourself sure. So, as ms tyus pointed out with the city council's approval of the grand Pacific rezoning, the agreements that the community board reached with the developer, emp capital became effective and the restricted declaration was registered with the the governor finance and and, as you saw that's now available on acres, we also expect there will be a memo of agreement that that plays out. In summary, on the existence of the community benefit agreement. Community benefit agreement itself is not filed on acres and it's not going to be distributed publicly, because if we were to do that would impair our ability to potentially negotiate similar agreements with other developers in the future. If we laid out, we made public all the terms of that agreement related to its various enforcement provisions. Future developers could look at that like a floor and essentially you know, use it as use it as a way to negotiate better terms for themselves. So we don't we're not interested in that and for that reason won't be distributing that. Given the fact that we've heard of the last land use meeting that the department of city planning now does not foresee being able to complete the euler process for the impromptu zoning during the course of this administration, it may be that we'll have cause to use a similar strategy in the future. Should we be presented with other private uloc applications, and- and I guess that's about it- I think we've already kind of been through with the general structure of the community benefit agreement and the nature of the the controls and enforcement that are in place with respect to grand Pacific. But I'm also happy to take any questions from folks about that. Don't everybody speak at once. Mr barack, can you add your take on this trial that we've been through? Would it take a year for this year and a half? Can you speak to that? Mr barack climbing speak to your experience, what you saw as we went through this process and what you think of the end result? Well, certainly, you had a developer to work with, and I think part of the key was getting clarity on what you meant. As beneficial use, I believe spock in the beginning was like well if it was a bakery that was deemed as a beneficial use, but that was not one of the uses on your list, so it was getting the developer to understand what the uses were. Trying to accomplish, I think, was important, and the unique thing here is. This is an avenue site where the crown from the community board wasn't asking for industrial type of artisanal type uses, but the developer put that out there and it gave the community an opportunity to leverage a little bit of additional community value, bringing something that was meant more for the mid blocks on an avenue site. Okay, can you mute your microphone? Please there's a lot of noise. Yeah I'd like I'd like to second richard's comments. All I all of those were in fact the key factors here, and I would say this opportunity also presented us with a chance to develop this structure with the restricted declaration and the cba as a set of tools for the future. So I think there's some value in that as well. I should also say that and give credit to kind of everybody who participated in this. As richard pointed out, the developer, ellie perriante was quite, was quite coming and being interested in working through this arrangement and on the community board side, miss tyus and rob witherwax, and myself spent a bunch of time with mr perriente and his attorneys ironing out kind of the details of this. So I very much appreciate the help of all of the folks from the community that participated in this and rob who's not on this fall was really helpful to us as well, so to give him give him credit as well. Mr viconi, can you remind us how many housing units would be brought online if we were to go forward? Yes, I can but you're gonna need me. You're gonna need just to give me a little bit of time to pull up the bulk analysis. For that I don't have the figures at the top of my head, but I can get it. We have the chair of our housing committee on the call, miss granville, so we're wondering how we can pick up from this success and go forward with them crown. Given the budget cuts that the pandemic is forcing on the city, everybody, the city's talking layoffs of one type or another, from one service agency or another. But if we can find a way to get end crown to move forward, then we have those extra housing units. Looking at the chat, I thought I saw a question pop up. Oh wait! A minute go back question. Yes, peter has a few questions: hey phil! May I speak? Yes, hey hi yeah! This is too precious. I was one I was the person who requested that the cpa be shown to the committee, especially if this is a precedent setting effort. I think that the onus of the imperative is really on being public and showing the public what the cba looks like both in terms of because it could, in theory, have more in it than what the the the record the records that we've been shown. So, as a member of the committee, I would just request that the cba be shared. Second, it there's other reasons because of the who's, the signatory on the cba and looking at who signed what that's helpful and you know as if you recall, I personally did express some concerns about a adding another component to a euler process which involves negotiation with the community board. Given that developers do lobby community board members, we you know the this community board has heard richard lobel several months ago, make state as much so. I think it would be really helpful to see that cba. I think that will help us judge the the strategy and will help us judge the you know, as a judge, just in essence just see that the cuny board is transparent. I think that's the number one first stop, but then second thing is: I actually, as I recall, working on the third or the fourth thing now peter grads. No, this is one is a request that the cba be shown to the committee and made public. This is this. Is why ritual meetings don't work very well and is it when people talk over each other? Okay, second, is that the, as I recall more than two, there were two plots. I think that were up zoned and two different owners is what I think we were initially told. So is that still the case or is that? Are both lots owned by the same property owner now or can you just address that issue as well, so number one? The cba should be public, especially if this is precedent. Setting and second the can. You clarify who owns what lot and who signed the agreement and whether this agreement covers the multiple lots that were up zoned so miss ms tyus. If you like, I can speak. Let me answer this, please, mr viconi. Okay, sure, that's fine! Okay, a lot of our board members want to be spoon-fed information. That's publicly available to try to cut that. I am looking at asking dcp to come down and talk to land use with a brief, maybe an hour, to spread over a couple of different meetings for training in land use planning other than that, I'm looking at bringing people in from the american planning association to give people training in land use planning in new york city if you're interested on your own. If you can go to the website for the american planning association and see the materials that they have there we're starting to turn towards equity, racial equity and social equity and planning and environmental equity and economic equity and planning, and all the things that we have in the backs of our minds for what we want to see in our community district. Okay, the cba was a lot of work. Mr crassus you've asked four or five times now for a copy. A digest of. It is available on the automated county registration information system, acres, which all which covers four counties of new york city registration purposes. Please mute your microphones, ms neil. Can you mute everybody? Okay, all right so so to answer mr crassus's questions that were repeated. Four times, in addition to the emails that he sent earlier, we don't want to circulate the cba now, because dcp is not able within their budget. That has been strained to go ahead with them crown. So we expect to see unless we put up a hell of a fight, we expect to see a lot of private applications coming through all right so and the more people get a chance to study what we did with the first of its kind. People will try to find ways and arguments to pick that apart and make it unusable for future applications. Okay, so another thing that folks on the land use committee need to know is that property owners come to the land use committee and then to the full board based on what they told the land use committee as an application. That's required under the uniform land use review procedure. So it's not lobbying. It's a standardized legislatively required application. Mr crassus, it's not lobbying okay, so we just want to be clear about that and if you have curiosity about who owns what this is publicly available information on acres, automated county registration information system, I think they cover all four borrowers, except for staten island. That's the only one that's left out! If you want to see staten island, I think you have to still have to go out there. I wonder about that, but that may not be accurate. It may cover all five boroughs by now, I'm not sure so. Mr viconia is there anything you'd like to add to my explanation. Yeah. I just briefly wanted to say again an explanation for why it is not wise for us to release the documents that were signed by emp. Emp did not sign our agreement unmodified, they did negotiate and we did make certain. We did make certain concessions that we thought were reasonable. However, we don't want future developers to get the benefit of what they negotiated. We would want to be able to start at a higher level, and you know seek terms that were as favorable to the community board, given whatever future circumstances exist as they possibly can. So, by releasing the specific terms, we would just be undercutting ourselves, we would be giving future participants the benefit of the legal advice that emp got, and it's not it's not wise to do that. There's no problem with reviewing the whole structure of the way the cba works, but when we get down to the to the nitty-gritty and the very specific provisions of enforcement, again, we'll always want to seek the best. The best terms we can possibly get for the community board. I did want to say I don't know if this is what mr crashes was getting at, but there are other lots that are included in the grand Pacific rezoning and at one point I think, probably the committee members remember there was a suggestion that owners of a couple of those other lots be given an opportunity to accept the same terms that emp did for the in exchange for the same community benefit. We tried in good faith to secure that agreement from those other owners and we were not successful. They ultimately would not agree to the same terms enp had they wanted more terms that were more favorable to themselves and we did not feel like that was in the community board's interest, so he did not. He did not make that agreement with the other owners and consequently their lots did not receive the upside now just to be a little clearer on I'm sorry, I just misspoke, they did not receive the r7d upzoning. They received the r7a episode that otherwise would have been what would have been the density associated with a lot on the avenue under the dcp framework. Okay, specifics always help now. How does that happen? That happens because city planning doesn't do what they call spot zoning. I have a piece of land like ellie perriente head. I put it in for a up zoning city planning in their quest for harmony on the skyline, will stick in other neighboring plots and lots to give a structure to what their visual image is for that and that's how you get these other lots. Coming in this, one that gibb was just referencing was, is across the street from the main applicant's property. So and that's a problem. It's a problem for us as a community for city planning as an agency. They save money because the studies that they do with the limited staff that they have this gives them more reach and import for a particular project and just that one or two buildings, so they'll add in some other buildings nearby to broaden the scope of the changes in the work that they're doing with environmental impacts, studies and so on. So that's part of why that happened, and it can happen again. This is a standard policy for city planning, so we will continue to work with city planning towards the m crown neighborhood rezoning, especially because a number of private applications coming through and new and larger buildings going up will put so much pressure on the existing infrastructure that we're just asking for problems. So we need to get that done. Mr barack, I wouldn't say that the department of city planning sticks those extra lots in I'm, not privy to the conversations the planning has with applicants, but I'm sure there's an explanation from a sound planning judgment why the application goes beyond properties controlled by the applicant, but it leaves the city council to its own right. Sorry for my other phone ringing, so basically city planning, you know, works with the applicant. The applicant then puts forward the application, and the council has the right to reduce the scale of the zoning. The count could have removed the other lots in this case. They chose a zone that was in scope that was generally consistent with some of the m crown maps between the community board and city planning, so the other lots could have been totally cut out. They could have been dealt with the way the council dealt with them or they could have gone through as the applicant filed, based on their conversations with city planning in the at the outset. Thank you give anything else you need to add. I think, we've. I think we pretty much covered it. From my perspective, it looks like ms lazar has a question that she wants to ask: okay go ahead, ms lazor hi. Thank you for recognizing me and I am very much in favor of the idea of getting training on land use because, as a newbie, I need it. And of course I have a question and you know maybe this is just not clear to me because I'm a newbie or it's because this whole process of getting a community benefits agreement- that's enforceable, is kind of new. But that being said, my question is so when we voted on, you know to approve the well, and it was this very complicated, like conditional sort of approval that we did for this for this project. You know, I guess I understand what you're saying about not wanting to encourage other lot owners in the area from trying to get rezoning. You know, while we're still hoping for m crown to go through, but I'm wondering if, when we did, that sort of complicated, provisional or contingent vote did we like did we have the full content of what the community benefits agreement was going to be yet or was the was the community benefits agreement further negotiated after the community board had its vote on this. We had a basis for certain types of zoning and uses within the zone, especially in the residential mid blocks, and that was a concession from the developer to the community. We were looking for jobs that paid a living wage in the community, and so the resolution that was passed by the full board enumerated those use groups and we're looking for that sort of economic development to bolster the types of jobs that we have available in this community district. I see yes, mr go ahead. Sorry, I guess no- and I remember you- know the resolution and and all of the principles behind it. It's more just like me, trying to remember get my head wrapped around the order of things, because I had the vote, but I'm just I'm just wondering. Was the community benefits agreement, part of things further negotiated after our vote, or did that negotiation thing happen before it happened? After and gibb? You can pick up the trail from there sure yeah. So what the sequence of events was like this, the the developers had come to us and said we're proposing this rezoning. We know it's. We know it is a slightly greater density than exists in the framework and in exchange for that we're willing to do this. You know provide 25 of our ground floor as restricted uses that are the job creating uses the community has identified. So at the same time, that offer was made to the community board. We also discovered that the developers who had done the rezoning for a 1010 Pacific street and had made similar commitments, but had done so only through a letter of intent with the city council member, had sold their lot and those commitments were no longer enforceable. So it was a little bit of a you know. Fool me once shame on you twice sort of shame on me. We did not. We did not want to accept that type of an offer without some more substantial enforcement provisions. We didn't know yet what that would be at the time the community board voted on them, but we knew we needed. We knew we needed a way to enforce performance on the community benefits that the developer had promised. So what happened after the board took that boat? Is the community board a team which was miss tyus? Mr witherwax and myself worked and worked very closely with some of our other sort of partner resources and crafted the community benefit agreement. We then presented that to the emp folks and spent about six weeks kind of working out the terms of that, in a way that everybody could agree to. Our initial terms, I think, were you know, were probably more more restrictive than where we ended, but we ended in a place. We thought was fair to everyone. So to answer your question, sarah, the at the time that the board took its vote, which I think was in november. I think it was the november general meeting we had. No, we had no text of an agreement, only the desire to have something that had that could be enforced as opposed to simply having a letter saying a developer has an intent to do something and in fact we do have something that has relatively strong enforcement provisions through the department of buildings and also through also through specific money, remedies that the community board. Can I see a bunch of questions in the chat, so I'm gonna? Yes, mr crassus is asking the resolution was for r7a the developer receive r7d, I'm not sure what resolution he's referring to the community board. At the november general meeting, the development the developers proposal, his ulip application was for art was for r7d at the november general meeting. The community board voted not to support that application unless there was a way to get a binding commitment for the community benefits that he had promised, and that was, and that was later achieved. So actually, this is peter speaking, I'm just reading a resolution. I think it's the right resolution and it's the number one. The first item says that the area be rezoned south of Pacific street, be zoned to r7a, slash, c2-4 and well. If the outcome is r7d, so I mean this raises even a larger question for me in part, this plays into the following back up about the process. Here you know this is the. I think their article that was released today called a precedent setting as a first time thing. There isn't there's been a negotiation. That's happened after the resolution from the community board was passed. The it just makes sense to me that you would want to that. The onus of the I mean the real imperative here is that the public be in a position to assess the value of what's happened and look at perhaps how the process could be improved if possible, because we also have the a number of you. We have other lots that aren't included in the agreement but did get up zoned as well. The developer received a bonus because of signing on to the cba received a bonus in terms of far in exchange for delivering a 25 of the ground floor for the designated uses. So I think, and to just to reiterate the developers do lobby community board members and they have to disclose that publicly in records and we've had that happen with community board members here. So as far as I know, so I think we should I'm just you know again reiterating that releasing the cba be extremely helpful and because we will want to if you're, expecting individual applications to come down the pike. I think it's much more important for us to be able to look at how this works because you're, actually there are multiple routes that the community can take relative to these things, not just resigning ourselves to a cba. So that's why I just suggest that we illuminate this process. So let me let me speak to the resolution, because I'm looking at that right now, so the resolution was to withhold support for grant. This is from the november 19 general meeting. The resolution was to withhold support for the rezoning until the f until a set of conditions were met. The first condition was that the boundary of the area to be rezoned be limited to block 1125 lot, one which is the block controlled by the applicant, and, if that's not possible, that the area to be rezoned south of Pacific street be zoned to r seven, a c two four. So let's take that one. So in fact it was not possible to limit the rezoning to only the lot that was controlled by the developer, for reasons that mr barack alluded to earlier in the discussion. But in fact the lots south of Pacific street were limited to r7a c24. That was the final result with the city council. Second point in the resolution was that the applicant make a binding commitment to allocate at least 0.25, far of the commercial ground floor to m crown uses and that the commitment takes a form that provides for monitoring and enforcement and survives transfer of ownership of the project of the subject properly, and in fact that condition was also met. That condition was the cba and we can. We can talk about how the cba met each one of those criteria that the board agreed to that in the resolution, and just let me just briefly cover the last one. The third, the third requirement was the applicant further commit to limiting the height of the proposed development to nine stories, and you can see from the restricted declaration that was circulated earlier. That condition was also met, so the conditions in the board's resolution to to provided support were fully met. There's no question about that, and if this ties will allow I'm happy to talk about how the community benefit agreement specifically addressed monitoring and enforcement and and transferability, I think you need to do that. Mr picone, okay, so monitoring and enforcement under- and this is- I think this was described in the Brooklyn paper article today as well. Monitoring and enforcement is a function of the restricted uses appearing on the certificate of occupancy for the property and on plans submitted to the department of buildings, so the developer will have to identify specifically which 25 of the ground floor. Commercial space is restricted use when he applies for a building permit and that area will have to be called out on the certificate of occupancy, so that provides an enforcement mechanism through inspection by the department of buildings. Now the second part of that is once he's got a building violation. Is that enough to make him want to comply? Our view was no. That would not be enough to make him want to comply, so under the community benefit agreement. The developer is also subject to remedies: monetary remedies in the event that he receives such a violation equal to the difference between what the going rate is for commercial space and the rate being paid by tenants who are performing the who are who are doing the types of uses that the community board has called out effectively we're taking away the incentive for the developer to cheat, because you'll have to pay a difference in what the rental value would be into a fund that will be managed by the friends of community board a for the purpose of encouraging manufacturing uses in community district aid. So that's so there's a money remedy that goes that goes beyond the the building department violation, but is triggered by the building department, violation and then with respect to transferability. Again, I think somebody who's just joined. Maybe they need to mute. I think there's somebody dialing in who needs to knew colin user number, five, whoever you are. Can you mute? Please sorry. What was that? Please? We need to mute colin user, five, okay, I've muted, all participants. I will mute them again. I don't know how to mute the callers, because this is this is not a, I think you already know, but everyone's muted. So I don't. I don't. Okay, I think I think we're okay now, so I was I, the provisions related to transferability. What we didn't want to do was to create a situation where we have a community benefit agreement with developer a and then that developer sells the property to developer b. Who turns to us and says: well, I never signed the agreement, so it doesn't apply to me and again this if you'll recall. This is something that directly flowed out of the experience with 1010 Pacific street. In this case, what we were able to secure and which would be a part I would suspect of any future. Similar agreement is what's known as a restrictive declaration, that's filed in the chain of title with the property, the restricted declaration was actually as filed was actually what we distributed earlier today to the committee, so the property title as maintained by the city of new york, provides for the restricted use and that provision will be binding upon any future owner of the property, and likewise the community benefit. Agreement itself also requires transfer to any future owner of the property. So all of the again, both in terms of monitoring through the DOB enforcement through money damages that are collectible by the community board and also a restricted declaration that runs with the land. Those things satisfy all of the requirements of the second provision of the board's resolution from the november 2019 general meeting. Thank you, mr viconi. Are there any other questions in tonight's 15-person audience? Thank you all for coming any other questions. Well, it seems as though there are no more questions, our next meeting as a larger group. The full board will be next thursday and we'll go over the census. We need to kick up our responses to the census and what was the other item is neil next thursday full board. We've got the census and voting yes, shelley warrell from u.s census is on the agenda as well as matthew pitt from the new york city board of elections. Yes excellent, so I understand there's some issues on both of those subjects. Then, in october we should have as a land use committee. We may have the application that was put over for 9.59 sterling place. I'm not sure I just got a text message saying that contract has expired, so I'm not sure. What's going to happen, and then in november we will be working with city planning in the land use committee meeting for november to revisit what we can do with imground going forward, given that the budget has been shrunk substantially, mr barack is, are you have any advice for us going forward on those two projects? Yeah? I would use the time for m crown in terms of a potential rezoning when you walk the neighborhood look at things where you think you might see opportunities for enhancement, whether it's street crossings, whether it's lane reductions just anything that might be a quality of life benefit and bring it to the community board's attention, give explicit locations on that and start compiling a database of the type of things that you'd like to see embellished through or rezoning. Thank you, mr bearack. Any other commission questions. I see a comment from ms wetterberg miss tyus there there's there's a request from miss lazar to make an announcement and miss wetterburn did have a key point that I think she wanted to articulate. Okay, miss wetterburn. Would you go ahead? You have to unmute yourself, okay, all right yeah, it's pretty much in the chat. I mean one of the conversations we're. Having is what is the content of the community benefits agreement and why don't we want to disclose it broadly? And you know it's key that we do have the enforcement mechanism and there are only a couple of ways that you can effectively do it and have the transferability so having something tied to the deed. So to speak is one way we can ensure that we don't get bamboozled again and trust me. People will be trading properties in the m crown zone for a while, so they're not going for public funds they're, not using the benefit of a municipal borrowing. You know, as they did with atlantic yards, which we could have had more enforceability of the community benefits agreement if they had something called a bond covenant which would have tied them to what they promised and given that this has come coming from the community and coming from the community board per se, we have a limit as what we can do with private property, and this is the best way that we can make sure that some fashion of our vision comes forth. Thank you, ms lazar. You have a statement question, I'm sorry yeah! Thank you yeah. I guess this is just. First of all, you know what ms wetterburn just brought up is totally along the lines of the things that I would love to learn more about in training. For all of this, you know whether it's like strictly land use and zoning, or if it's just in a broader sense, some of the ways that restrictions work or don't work. All of that I would like to know more about, but secondly, I so I sent an email to both you, ms tyus, and to miss george as well, and I think you sent out you forwarded the message, but it was just about it was about the eviction moratorium. You know the most recent updates and also the beginning of a of an eviction defense network in well. It's Brooklyn wide, I mean central Brooklyn is, of course you know hardcore into it from the beginning in setting up this network, but I would I I'm hoping that we'll be able to get the word out, not just among people who are already plugged into the tenant movement, but also just among neighbors, who are willing to participate in helping to block illegal evictions. Yeah oh wheels. The materials that you sent the flyers notice that was mailed out in the e-blast, I believe, ms neil, can you confirm that ms neil you're, muted? Okay, I did ask for e-blast to be sent out on that and for it to be posted on the board website. Great- and I appreciate it- I mean just today a neighbor of mine from my previous apartment. You know he contacted me because somebody got their housemate illegally. You know threw all of their stuff out of the apartment. You know and pushed them out, and this isn't the first time that they've tried doing this since the pandemic started, and you know- and this is completely illegal- but this was another follow-up, so the guy who this happened to it was a neighbor who reached out to me because the guy he's it seems like his mental health is deteriorated during the pandemic. You know like lost weight, much less communicative than he was before isolating a lot more and his neighbor was wondering about what I mean it's hard when somebody's clearly in a mental health crisis- and he had asked me about who would be best to contact for something like this, because he didn't want to necessarily call the police because he didn't- and he also didn't want to necessarily call the department of health homeless services and that's the reason. Why can I call you after the meeting? Yes, thank you. Okay, all right is there anything else in the chat that I need to look at okay, so this has been revelatory. Mr viconi, I salute you. Thank you for all your hard work on that cba. That was some amazing stuff. It's a team effort couldn't have done it without you and mr witherwax and some other folks who will remain nameless for now who are who are very helpful. Subject matter, experts to us tweak my memory recall here. I think we had a little bit of serendipity that perriente wants to use that ground floor for early childhood education. So it was it dovetailed nicely yes, so it was good fit with what we both sides wanted. It was perfect, so all right, so unless there's anything else, I'm going to close the meeting and ask you all to join us again next thursday for the full court meeting, and so you can hear about ways to encourage your neighbors to vote and answer the census. We have to beat that drum. Otherwise we're going to be up the creek without a paddle, I don't mean that new tv show either and then october. I gotta find it we'll see, what's happening with that, if 9 59 sterling is coming or not, okay, anything else any other questions. Well, the meeting is adjourned. Thank you. Thank you very much. Thank you.",
        "summary": "Negative mm-hmm They should have a site up here on eastern parkway and ocean avenue, , there's Brooklyn hospital 35th street, and what first avenue remember I was in and out of there in 15 minutes, 20 minutes He was able to register those documents with acres, automated county registration information system, the county clerk's office, where all the deeds have to be registered, he's a reporter for the Brooklyn paper, The marks a successful completion of a effort to get community planning into a neighborhood rezoning So, as ms tyus pointed out, with the city council's approval of the grand Pacific rezoning, the agreements that the community board reached with the developer, emp capital became effective and the restricted declaration was registered with the the governor finance and and, as you saw that's now available on acres.\nWe made public all the terms of that agreement related to its various enforcement provisions, Given the fact that we've heard of the last land use meeting that the department of city planning now does not foresee being able to complete the euler process for the impromptu zoning during the course of this administration.\nShould we be presented with other private uloc applications, and- I, think we've already kind of been through with the general structure of the community benefit agreement and the nature of the the controls and enforcement that are in place with respect to grand Pacific Trying to accomplish I think was important, and the unique thing here is This is an avenue site where the crown from the community board wasn't asking for industrial type of artisanal type uses, but the developer put that out there and it gave the community an opportunity to leverage a little bit of additional community value, bringing something that was meant more for the mid blocks on an avenue site.\nLooking at bringing people in from the american planning association to give people training in land use planning in new york city, if you're interested on your own, we're starting to turn towards equity, racial equity and social equity and planning and environmental equity and economic equity and planning, and all the things that we have in the backs of our minds, for what we want to see in our community district It is available on the automated county registration information system, acres, which all which covers four counties of new york city registration purposes, Four times in addition to the emails that he sent earlier, we don't want to circulate the cba now, because dcp is not able within their budget We expect to see a lot of private applications coming through all right so and the more people get a chance to study what we did with the first of its kind So another thing that folks on the land use committee need to know is that property owners come to the land use committee and then to the full board based on what they told the land use committee as an application.\nWe would want to be able to start at a higher level, and you know seek terms that were as favorable to the community board, given whatever future circumstances exist as they possibly can So. By releasing the specific terms, we would just be undercutting ourselves, we would be giving future participants the benefit of the legal advice that emp got, and it's not There's no problem with reviewing the whole structure of the way the cba works, but when we get down to the to the nitty-gritty and the very specific provisions of enforcement, again, we'll always want to seek the best The best terms we can possibly get for the community board.\nThey chose a zone that was in scope that was generally consistent with some of the m crown maps between the community board and city planning, so the other lots could have been totally cut out or it's because this whole process of getting a community benefits agreement- That being said, my question is so when we voted on, you know to approve the well, and it was this very complicated, like conditional sort of approval that we did for this.\nSarah, the at the time that the board took its vote, which I think was in november, I think it was the november general meeting we had We had no text of an agreement, only the desire to have something that had that could be enforced as opposed to simply having a letter saying a developer has an intent to do something and in fact we do have something that has relatively strong enforcement provisions through the department of buildings and also through also through specific money remedies that the community board Yes mr crassus is asking the resolution was for r7a.\nThis is something that directly flowed out of the experience with 1010 Pacific street was actually what we distributed earlier today to the committee, so the property title as maintained by the city of new york, provides for the restricted use and that provision will be binding upon any future owner of the property, and likewise the community benefit So. All of the again, both in terms of monitoring through the DOB enforcement through money damages that are collectible by the community board and also a restricted declaration that runs with the land."
    }
}