{
    "data": {
        "YoutubeMetadata": {
            "author": "QCB4",
            "channelId": "https://www.youtube.com/channel/UCiPmRHmvikHuAkUSe0LWAeQ",
            "title": "CB4Q June Board meeting",
            "publishDate": "2020-06-19",
            "shortDescription": "",
            "lengthSeconds": "1:06:31"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "QCB4",
            "normalizedName": "Queens Community Board 4",
            "twitterName": "Queens Community Board 4",
            "youtubeChannelName": "Community Board 4 Queens",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCax45Lao4YHsuBewj0H0hZQ",
            "twitterHandle": "@QueensCB4",
            "dateCheckLast": "10/8/2020",
            "status": "stale"
        },
        "properties": {
            "videoURL": "QeNf4ZZxqiU",
            "fillerWordCount": {
                "uh": 3,
                "um": 10
            },
            "readTimeFullTranscript": "35 min read",
            "readTimeSummary": "4 min read",
            "wordCountFullTranscript": {
                "guys": 20,
                "evening": 17,
                "phone": 14,
                "sir": 13,
                "police": 10,
                "president": 10,
                "sites": 10,
                "information": 9,
                "report": 9,
                "member": 9
            },
            "wordCountSummary": {
                "information": 4,
                "police": 4,
                "census": 4,
                "president": 4,
                "vendors": 4,
                "cash": 4,
                "summer": 3,
                "business": 3,
                "balance": 3,
                "stop": 2
            },
            "fullTranscript": "Three for the painful police. Unfortunately, it was onion. We were unable to use it and we ended up using the office budget. Instead, I have to go on the record that it was not that City Council. It was not automatic money. It was the board office budget actually paid, so we're not seeing. He does not seem to be getting a stipend for the third year in a row. It's been two years Betty. Hopefully it happened, but it happened if nothing else, Cratchit getting a touch, but mordy does not that later and the last thing I want to report on is this and you guys everybody knows John Wayne, who I believe might be on the call, as well as the New York Hall of Science, was now under some form of your management, at least, if you outreach division and it seems that we're all getting together on what they call the Elmhurst Corona coalition and what the owners Coalition is basically and again, I would love for John to be able to speak, but we have a chance to do so. Nonetheless, I will send you guys notes it's basically a coalition for a lot of different community groups. We have groups as puzzled soul, I can't name all but assets. All the Queens Museum make the road Elm core new life CDC a lot of groups are getting together and we're going to be using the opportunity for all of us to get together and make like a one- stop shop for all things of a community outreach that includes helping education, community welfare awareness and fundraising. We're going to have a lot of several different groups, make this big function and see before as well as always, and thanks John for recommending it. They are asking us to work with them so, as I received more information, I'll continue to attend as many as these people, as I, possibly can I only think, maybe one or two more phone meetings, but if you are interested in any information or anything regarding this Elmhurst Corona coalition, in conjunction with the Hall of Science and a lot of different community agencies, please do reach out to me personally see Casson y', all at CB, nyc.gov or qn0 for at cbiit. Nyc.Gov and I'll send you what information I have as I receive it, but for now we are not committed to anything which there as a supporting arm, to help move this and again guys I'm going to let you go with this chances are throughout the night. I will report as we go I and just you know, there's a lot of word out there about riots and looting and everything. Please do not forget the fact that Covid-19 is a professional, real track, guys wearing masks. Do not the warm weather, fool you and remember the good. The news will come to you. Stop looking for new, stop search the internet for cures- Kovach. All these things. When there is something out there, it will come to you. I'll spend 24 hours a day over the Internet, so Lou I'm good to go on my side. If anything else comes up, of course, I'll let you know but yeah. My report is over. Thank you. Okay, I'll now go through the board members list and allow each board member to speak as I call your name. It will be C Scully, yep I'm here, hey Lucy, hello. So any questions reports anything you want to throw away. No, it's the lawn. Let's go on you good all right! Next, you got it. Okay, Charles, Chung, King, Mr. Chen is here disparaging things last time, I sent the email to Governor Mayor or the intelligence office Queens your state, all the media's, including Chinese media, but only a new, your time to respond me with the computer that information that that's about it. Nobody mentioned about it, Thank You, Mr. Chung. Thank you. Thank you. Welcome! Yes, we actually do have somebody here in a second see each an you can call me Andy good morning, you're going to get a good evening. Nd welcome aboard nice meeting. You guys nice meeting it. So any questions concerns comments you got for us, but just you know, I'm learning, still learning, while you guys, oh good. Thank you. Thank you. Okay. He is here, stay with us good evening. Everyone nothing to report. Thank you! David! The Linda I do not see here. No Linda is not here alone. Okay, I'd also like to welcome new board member. Yes, she is in fact here good evenin, miss D S good evening, how's, everybody not too bad great, well happy to be here. Thank you all right, Dunstan, no I do not see Michelle next, no sir, yes, Mara Lena is here. Oh was that Lou I'm, sorry Gonzales Oh Kristen, no Kristen is not here. No Kristen is not here. No I do not see Vincent hello, Michelle Dunstan is here. I am here. Oh I did not want to say anything, I'm glad that I finally got one I just been on the phone and I'm and you guys are doing a great thing work. Thank you, Sir, sorry about that. I was muted. Okay, no sir he's not here moving on No Salvatore Lombardo, no sir we'll know also remember no. She is nothing, no also a new member, so nil, my yes! So no is not fact here, good evenin one! It's just happy to be here, you know, has a new member are no fall- off courses at the moment. Thank you. Looking forward to working with you to know, welcome aboard, thank you so really quickly. I do want to acknowledge. Please understand for the board: Nosal have called in it's not that we're not acknowledging it's just, there's no way to physically know if you are there, so if you dialed in the via phone, we are not taking formalized attendance on this. So if you have not, you will not get an absence. However, if you are there thanks for coming in to turn those, but you won't be able to actively whenever you're ready, Thanks, okay, no Sylvia Maude, no sir! Yes, Matthew is here good evening good evening, guys you could. Can you guys can hear me? Yes, Sir, hey everybody hope everybody's doing well, but nope, nothing to report. I am concerned about the census falling behind everybody's attention, because everybody's focused on other stuff I do not know if the board wins of doing anything. On that regard, let me know. Second, we have a kind of jerry- rigged situation here where Rovi Nia is following the meeting on my speakerphone. So I just wanted to offer the opportunity to say hi, Romania speaker, it will come. Thank you so much for Mina God bless thanks man. You know so Lou really quickly. A Matt can I. Can I address about that as far as the I can't say, we're actively doing anything because I can't say we really are. We did just before the whole cocoa, but I think we did go, that's blazing and had a job, fair and all that, and it was very successful. Obviously, as you know, Co it happened and we got slowed down. We do, however, have reps from the Census we're reaching out to was not going to do much more community outreach because, as you could imagine, more than ever, our numbers are lower and then the European I think reeling in a 30 percent. I think very low, but I have any contact on to just this past week with somebody for the census. They are with us both channels, but we do not. We do not know, what's going to happen it that but I promise you I do not believe our census chair is in just yet Christian Gonzalez, but I have been in contact with her and we'll do the best we can. I I'm not sure this breath here from Senator Russell's office, but I do believe. That's more evening, they're holding a town hall. If that's those stands, that might be a good place for us to see what the latest is with our communities, but I think we shared that flower with you. If we did not will share with you this evening or very lose probably tomorrow morning about that's all, but it's taking place I believe tomorrow evening. Thank you, so Edgar Moya tried to dial in, but I think he's I do not think he's in just yet he might have dialed in via phone, but he is not in right now. No I do not see her Sandra's, not hearing the next good thing. Yes, Mr. Rule is your just bear with us I'm here. What are you never bloody and I want to say healthy for the next two months and stay away from everybody and keep a distance and keep on watching the hand and everything so I want to request everybody. Thank you so much Mr. rule no sir. She might have dialed in but she's not going to listen. She knows Alex. Thank you. Thank you. Thank you. Pin their eyes, no Ashley! Yes, Ashley is here: it's our name, hi everybody good evening, nothing to report good evening. Actually Thank You Oscar wheels. No Oscar is not here. I'm! Sorry, excuse me, no Oscar is he oh excuse me Oscar I'm missing a man. Sorry, there you go okay, hi, guys, how's it going I'm going to see my comments for the committee afterwards. I just hope that we all see each other in the fall and that's it. Thank you. Thank you. Sir Yo man, no Sir, Mr., Romero Christian is here Christian O'mara, hey everybody, Thank You, Mr. Chair, nothing to report. Besides a warm welcome for Albany members. Thank you. Thank you. Sir Nando Ruiz. No, sir, welcome aboard I'm click on how I finish everybody it's safe summer and I'll. Also do tea. I will understand obvious things on workers, a hospital workers, police members of committee, Board that I working, maybe steak and gab. What can I say: I'm falling asleep. Thank you! Yes, Lucy is here you hear me. Yes, Lucy, good! Ok! Thank you, I! Just wonder if he could hear me. I, just now got a text from Ruby Mohammed she's on the phone she hears everything, but she was not able to you know to let you know that she's none, but just got it now and as for the census, the Queen's General Assembly and the presence of his doing a phone in the predominately for Mandarin and Cantonese Chinese people, that's who they want to get onto the census. If anybody's interest to call their office, maybe Joe will bring it up if he's on tonight, and that might be a way of you know an ting of those numbers for Queens. So if anybody's in just get in touch with the borough president's office, and that's it thank you so much root Lucy. You know what I'm talking about here. Thank you for the beautiful card. Thank you. Thank you. You're. In my thoughts all the time red Sevilla, please no I do must see him Alton, Derek, Smeath, no again, Alton I believe he might have dialed in. He did call me earlier with admission how to get in, but I do not see him, but if you're here Alton, you know thanks for coming up and all do okay. Gregory is here near me good evening, all again welcome to the new board members I look forward to meeting all of you when we see each other next, either in person or virtually I, do want to say black lives matter and I'm, very thankful for the diversity that we have here on the board. I've learned so much from all of you and I really feel that you know this board is stronger because of the diversity that we have and a special thank you to all of the black board members in during this difficult time in the country and around us. Thank you. No I do not see the one. No next shuttle is here much alone. Thank you, sir I know she is not here. No zetas, not here Rosa Wong, no siree, Minhwan Yang, not at the turn. No sir. All right I believe the next sure, beginning with the US Senate, all the Schumer representative, no sir, nothing Kristin Gillibrand! No sir, okay from the House of Representatives race me. Yes, we have Christian representing a congressman. Ming Christian, Thank, You, Christian, Thank You, chair on behalf of Congresswoman Mang, just hoping and wishing everyone's family still remains all healthy and well to update everyone. The congresswoman returned to DC twice last month. The first was to help pass the House Democrats. Fourth Coronavirus stimulus build Heroes Act, which put families and frontline workers first and the second time she. The second reason was to vote on the House passage of the Paycheck protection program flexibility bill and that really provided more flexibility for the already program for small businesses and the Senate finally followed- and passed this bill-. So on the legislative front, we're making some progress, we're trying the Congress congresswoman, is hearing everyone's concerns and is advocating for these necessary bills and pieces of legislation. Here on the local side, our office remains working remotely, but that does not mean we're far away. You guys all should have my cell phone directly to reach me. If you have any issues- and you can definitely reach our office number and someone should give you a call back in the next 24 hours or less, we have answered many constituents and continue to answer many constituents on a range of issues, but we're happy to always chat if you're, just looking at chat about sort of the situation, that's going on now around the country and your ideas, concerns or any proposals you might have. The congressman is always happy to hear those. So that's all I got from the congresswoman side. Wishing you all a great and I yield back my time, Thank You, Mr., Chair, Mr. Chair, if I may also I, want to just add to the fact that a Christian and I and the congresswoman earlier this year, cuz he before pardoned up with Pakistan Bank and on Memorial Day. We were actually out there giving away some masks. We kept caused some masks from the mayor's office. Most really. We even got some from the controller's office and it's our intention to do a mess, give away sometime within the next seven to ten days. But we did have a very successful people gave away a Christian about a thousand masks in about our forty 45 minutes between just yeah was amazing. No thank you. Thank You Christian definitely saw the need in our community in our area. Giving away a thousand masks in 45 minutes shows that everyone is in need and we're happy to be there, and thank you for partnering with us. You got a man. Hopefully we do it again. Lou you ready. Yes, we love. We I'm going to show here, Michelle hi everyone- and this is Michelle from the office of congresswoman Olga self Cortese, welcome new board members. I have a few legislative updates to the congresswoman recently introduced the pro prohibiting chemical weapons and law enforcement act, and she did so last week. It bans tear gas which has already been banned from war since the Geneva Protocol in 1925, and so it's encouraging the ban of tear gas by federal law enforcement as well as local law enforcement. The congresswoman also co- sponsored the justice and policing Act of 2020, which was introduced by House and Senate Democrats, and responds to calls to address police brutality. And, lastly, the congresswoman voted in support of the Paycheck protection flexibility Act, and this new law will make improvements that Paycheck protection program, also known as PPP, which is currently the federal loan program for small businesses struggling due to Coba tonight. Some community updates, our district office is excited to share that we hit a milestone and we opened our one da the 1,000th case to assist constituents Oh friendly reminder. Our office helps with any federal related cases. May it be immigration, as is around eighty percent of our cases, as well as issues pertaining to veterans, benefits, Social, Security, IRS, postal services and I briefly want to touch on the census. So I know, as mentioned earlier, East Elmhurst Corona are currently around forty percent. That is a 10-point jump from last month, but it's still well below the national average, which is around sixty percent right now. So it's important to you know, get the word out and thank you for the board for the work that they're doing around the census. It's particularly with the Count Committee and similar to what Christian mentioned our office is still operating via telework. We are available via phone and/or, be a website, so please feel free and reach out and we're more than happy to help and we've been able to assist folks during this time. Thank you. Thank you. Thank you. So much Michelle, New, York, State Assembly I, do not believe we have any rep from Barnwell's office here. No sir Jeffrey on Audrey, no Rep, no Lena Cruz Alex is representing something woman. Cruz yep. Yes, thank you. Okay, so we continue to give out food in diapers every day for Sunday's and food is first, come first serve and that begins at 12:30, and it goes until food rent, l, diapers, we've changed up the process, whereas before is kind of we set it for one day and have everybody come, but we found that the need is so high. We've created a process so that people would make would have to make appointments a lot more. A lot easier, more streamlined general we're continuing to work remotely. Do you feel General, Services I'm. So far we fielded about 350 cases in scope and began, 294 of which are with regards to unemployment. So people are it's still a number one issue for most people. If you are having an issue, if you need any of our services, you can call us seven one. Eight four, five, eight five, three six seven and we're starting this weekend, and we also did so a couple weeks ago doing business last. There's small businesses to be open, so we'll be out there on Saturday small businesses giving out masks you can send dieter and just informing them how what the process will look like when they start Camille Ben, the congresswoman, Assemblywoman sensory guards- and he you know thank you guys- are doing well from the New York State Senate Michael, generous. No sir Jessica Ramos I'm. Give me a second we'll hold on I. Do not think we have anybody here from Senator Alice's office, no Toby stavisky! No, sir! Yes, we do have Jessica here, Jessica, that's good evening, aye good evening. Everyone I want to start off by wishing everyone a happy Pride Month we're just going to go into highlighting a couple of top- level announcements. One NYC care is going to be expanding to Queens four months ahead of schedule. This is a citywide effort to guarantee health care for all New Yorkers by providing access to low- cost and no- cost primary care for those who are ineligible or can't afford insurance, and it helps fight the health care disparities that have been made clear by Koban 19. For more information on that, please go to NYC care, DOT, NYC phase, 1 a reopening began last Monday industries that can now reopen include construction, some retail manufacturing and wholesale trade. Our dedicated business restart hotline is eight SBS for NYC. That's eight, seven, two, seven, four, six, nine two and workers who call 3- 1- 1, will be connected to the department of Consumer and worker protection for immediate assistance. If there are concerns of their employers either not practicing safe workplaces are not providing them things like PPE. The city is distributing two million face, masks citywide to small businesses, their employees, SBS and DC. Wp are working with business serving partner organizations throughout the five boroughs, including in CB for the Queen's business outreach network on 40Th, Road and Corona, or more info on that I can send you guys the link with SBS. It is on the agency's Twitter account that helps the task force on racial inclusion and equity announced the restaurant revitalization program last week. Which- excuse me one minute: I'm, going to step away questions I'm going to meet Mike. Okay, the Task Force on racial inclusion and equity announced the restaurant revitalization program last week, which is focusing on the 27 communities that were hardest hit by Cobin 19, and this includes community boards for Corona. This program is going to support unemployed and underemployed restaurant workers with grants up to$ 30,000 each to subsidize wages, of$ 20 per hour for at least six weeks. The initial goal is to save a hundred restaurants, acrosss the 27 communities supporting 1,000 workers, we're looking at our daily health indicators which continue to remain below the thresholds, and we expect Phase two of reopening to begin either at the end of June or the beginning of July, we're leaning towards more likely the beginning of July. The mayor announced a plan to expand a restaurant outdoor seating once the city enters phase 2 to temporarily use space to support the city's restaurants while maintaining social distancing, and this will include curbside, seating, open streets and sidewalks eating. Lastly, just trying to highlight all of this, the city is now capable of performing tens of thousands of Cove in 19 tests per day. One day last week we reached 33,000 people for an interactive map that shows all known testing sites. Please go to nyc.gov, slash, Kovach testing or call 3- 1- 1. We are encouraging all New Yorkers to get tested, especially those who have recently attended a protest if you need a hotel to self isolate. If you live in and enter in a multi- generational home I want to you know, isolate away from your grandparents or parents, please go to Nyc.Gov, slash, Covid-19 hotel. Our tests and trace core was launched on June 1st and includes over 2,500 community Engagement, specialist and case investigators speaking for a distinctive languages. If anybody has any questions, I'm happy to answer them, so Jessica in this so I mean so alright. Actually we have a question that's pending, but it actually plays into what I'm trying to ask you as well. Alright, so we understand we're going into you know. Phase of opening up the main issue is, of course, and this question that is asked on the panel. It's that the social distancing is just not being and I'll give you an example. Today was my first stop going back on a week or so, and I was mortified over what I saw all over Crona plasm, nonetheless, not to mention the fact that, of course, the food vendors and mask vendors and glove vendors and every kind of vendors possibly out there, but there is literally no social business thing more. So there is a coded testing truck that has people literally shoulder- to-, shoulder with each now. Of course, we understand that NYPD's on the point being enforcing yet, but it's still a concern. You know we seem like we could take a really huge step back if we're not careful with this, so I do not know where we always enforced me on this type of stuff. We're not looking to get anybody arrested, of course, but there has to be some kind of initiative to make sure we did not go back to the dark ages. That was two months, so it is a valid concern, but specifically around public plazas such as Corona Plaza, which is already infamously known from not being very enforced, so we just eat just unlike it'll print that out right, so largely our social distancing ambassador, our social distancing enforcement team has been made up of multiple city agencies parks, and you know, public parks. Pd has been a part of this as well. It's small businesses. You know those agencies get involved, but I think as we're looking at some of these community spaces, we're looking for community partners who may be interested in helping us just get that word out, give out masks. You know it's we're not trying to get anybody in trouble, we're just trying to focus on education, but especially as we talk about opening some of these small businesses up with open restaurants, the responsibility of managing the crowd that you know builds up in front of a restaurant is going to be the responsibility of the business owner. So we're hoping really that this is like a you know, everybody kind of chips in looks out for each other, but all we can really do is educate. We can't force people, you know we're not trying to get anybody in trouble, and so it's kind of this balancing act. Okay, thank you! Oh that's! The guy have a question for you. This is the Walker regarding this phase, one reopening of construction is that specifically construction sites, or is that the sites, their offices, which might be in an office? The target of this was supposed to be construction sites, so do be, for the first 30 days, visiting all construction sites, making sure that the different requirements for operating are being followed and just really practicing an education campaign to make sure everyone kind of gets on board after 30 days when you're talking about offices are these offices that are on site of construction sites or off- site yeah office buildings which are connected to those sites, but do not necessarily totally support those sites. Maybe some of the individuals at their office, you know, are key personnel to the site, but not all of them, and yet I know of at least two companies who reopen their offices. This past Monday kind of under the guise of oh we're in phase one but I said I, do not think so. Yeah Lou, if you like, you, can send me the sites and I can ask DOB to check it out and again we're not trying anybody in trouble. Just trying to educate offices generally are supposed to be slowly opening in Phase two. So if you'd like to send me those two sites, I'm happy to look into those okay, yeah, no I'm good to go. Thank you. So we have a representative who's, somewhat kind of fumbling to get in, but I also heard he may be popping in, but right now there is no represent from where his office. Yes, we have Kelly here from Danny Tom's office good evening. Everyone Ellie custom member Johnson I, wish everyone well and healthy. This update, so our office continues to work, remotely he's based in our office and leave a voice message. One of our staff will get back to you once maybe student message and SMS in 24 hours, our office number seven one, eight zero, three, six, three seven three again our office I'll continue to provide flexible legal service hours. We provide immigration, legal service and journal. If you need an appointment of these, please call us and then we can set an appointment, so the legal appointment can be. Can you take by home or Hong Kong? So it depends on how you like it and then basically it does it for from our office. I wish everyone. So Lou I'm deported before you can see me Thank You Kelly, by the way before you continue, of course, do so, but we do have a represent from lawyer's office, so we're just going to get on a minute I'll, let you know when we get her on, but you continue everybody else, no, sir, and we just we just got ta represent it from Barnwell's office. Just came in as well, but no nobody from the broker. Okay! Well, let's go back to bond well I proceed ahead, hi. My name is Angela I'm from Assemblyman member Brian Barnwell's office. We hope that everyone is okay, the circumstances we also want to. Let the community know that we will be our office, will be hosting an I lag event and giving one second sorry it'll be it'll, take place on June 18th and if you need to RSVP for the appointment, you can reach us at our office number, which is seven one, eight six five one three one, eight five, and also to let everyone know that our office has also created a Covid-19 community resource guide, which includes information and resources for individuals. Compact impacted by Covid-19, and we would like to share this guide with our CB4 community. Our office is o, is functioning and opened through teleport. So if you call our office, we will be. We will continue to serve our constituents and thank you so much for having me on your call. Thank you so much so really quickly. I'll! Let everybody know that, as is tradition with us anytime, that we receive, and we do these meetings and we send you go, we will send your follow up and unless follow- up email will give you all the resource guides all the contact info. You will reach people that you represent an elected official or anybody. Please get it to us and we'll be sure to send it out also loo. So we do have a represented from Moyers office. We have very nice on the phone Perez on the phone, but in the meantime please check your email because there is a rep, not sure I'll check for you, but in the mean time we do have Berenice on phone from lawyer's office. In the meantime, good evening, everyone I get to meet everyone and welcome to new Community Board members. My name is Barry knees. Never Eddie, Paris and I missed the Chancellor's. Ladies on her Council member, francisca Moya I joined them. I've been with this office since March I just want to get some updates. Of course, the councilmember, where she could be at tonight's meeting, but at the moment he's on virtual town hall with SBS and DOF, but we would also like to inform you for the upcoming Town Hall we will be having next week with the BOE. It would be on Tuesday June 23rd. Please follow us on Facebook get more information in regards to the event. I would also like to give an update in regards to the police reform legislation. We support at the city level we're working on the bill that would repeal the resume sumption for NYPD officers and require NYPD officers to be at my si residence president, and we are also in support of Intro 5:6 a which is to ban chokehold. That's about it am I on. Thank you. So much really have a good evening. Everyone! So much Barone's appreciate that ok, so it seems that loose stepped off for a second. Of course, you go a little bigger so really quickly, alright, so Lou. What I would do is I. Maybe if you know, if you just acknowledge the next speaker- and we actually have somebody from the borough president's office who is going to speak and we're going to unmute them right now, so just you can continue with the controller's office. Castellanos have somebody James. Thank you. Yeah I could not figure out how to unmute I. Guess you do it right. Okay, so I got a few updates for you, I'm, going to say first that our officers recently released the city's quarterly cash report and the city's cash balance projection. So these are the stats for the third quarter of the current fiscal year. That means it's actually looking at January through March. So it's not capturing much of the time when the pandemic started and when the shutdowns happened. So the numbers are not as bad as probably many people would think the city's cash balance for cash balance is actually lower than it was around the same time. Last year, but you know I think what more people will be interested in is the fourth quarter of current fiscal year in those numbers and report on that will come out. You know in the near future, but that probably will happen for the summer when there's no meetings, but just people look out for it if you're interested next thing is that there has been a annual claims report that was just released. The annual claims report shows that the number of claims put in against the city decreased compared to last year and also compared to the year before. The number of claims settles therefore also decreased and the largest cost to the city or the NYPD claims against the NYPD resulted in the city having to pay about thirty. Six percent of the total money that was paid out was due to NYPD related claims, but the Good News here is that the total amount of money in claims paid out due to NYPD related incidents was actually lower this year compared to the year before and the year before, that, so we're trending in the right direction. There I also want to say that the office is continuing to do the MWBE workshops, those in the minority and women- owned business enterprise workshops. This gives people information about how to help kick- start their business as the phases continue and as more businesses reopen. If you do not fit any of the identity categories of minority and women- owned as a minority or a woman and minority is defined in this case as people of sub- saharan African descent, people of any Latin, American descent and people of a South, Asian, Southeast Asian in East, Asian, descent, I think also Pacific Islanders. If you do not fit any of those categories and you're, not a woman, you can still sign six in 37,000, so it'd be a slight reduction there, but not by laying off anyone. Just not hiring new people, as the people currently in the NYPD retire and I can smell sorry right, Rishon, yeah, exactly so, I'll send the links to you and you can send it to send it out in the email I. Thank you. Thank you. So much James, the New York Public, Advocate, domani, Williams or representative I. Do not believe we have a representative here this month, no, the Queens Da office, no, none that we can not another. We can see here right, but Christie. No, you hold on I want to see if we were able to get him with Christina were we able to get John Parrott hold on yes, oh there he goes John I can pocket. Everyone hear me I. Can everyone hear me? Yes, Sir go for it, so John, sarcone, E I'm here representing the Queens borough president's office. I just have a couple of quick announcements to make. First off on behalf of the borough, president I wanted to welcome all the new appointees to community boards for as well as returning members, the birth president wanted to prioritize the census, she's encouraging everyone in Queens, so you fill out their senses that they have yet to do so, and she also wanted to remind everyone to vote on June 23rd. There is still time to grab your absentee ballots, so please try to do that before the deadline for upcoming events. We have our annual pride event, which will be June 18th. At 2:00 p.m. we have a Queens borough president's recruitment, fair June 24th at 2:00, mind you! These are all virtual meetings that you can access on our website at Queens, BP, org, two, more events for you. We have the president's annual Philippine Independence Day event, which will be June 24th at 5 p.m. and lastly, her celebration of Jerusalem, which will be on June 25th at 5:00. We do have a staff member in the office between the hours of 9:00 and 5:00. The phone number is seven one. Eight two, eight six three thousand I encourage anyone who has any issues or questions to call and as we work remotely, I will be able to follow up with any concerns or issues going forward and I want to wish everyone a happy healthy summer. If anyways any questions, I'll be more than happy to answer. Thank you so much John Liu, you do have represent a gear from the DA's office or Mr. Rod Lee Charles. If you may, can you guys see me I'm? Sorry? Yes, we can hear you go for good evening. Yes, thank you. Everyone for having me I do not have anything to report just wanted to. Let you guys know you do have someone here on behalf of Melinda Katz. Listening in anything that you need to know, you can follow us on Twitter at Queens, Da cat and also our Instagram. Once again, I do not have anything to report at the moment. All right. Thank you for having me. Thank you. So much. Okay, Lou yeah I do not believe we have any more from the electrodes okay, oh yeah, I think we do not have any a speaker. So it's committee reports at this point. Okay, so I'll just go by memory. So first this census we know Kristen- is not in Nexus Consumer, Affairs, so Alex. So as we have talked about phase one started last week, the city is slowly opening lead. The neighborhood has dramatically changed since it's been open. I know a couple months ago, it's ghost town, but now I'm really happy to see so many stories, starting to be open. I think there has been a concern with the bars I've seen a number of those on social media people kind of concerned about people, not social, distancing from what I understand the bars are allowed to serve liquor outside, but they're not they're not allowed to permit people to gather in front of them. So hopefully people start to hear that and discourage people gathering and then well yeah. You know I belissa, environmental. Yes, she has Oscar, yes, yeah, okay, I just thought much to report just that some information I think beginning June 15, which was on Monday another stop a lot of stores stopped carrying plastic acts. So you know, if you guys, hopefully I'm hoping you guys, bought some reusable bags, because a lot of stores already stopped giving away plastic bags. So just do your part- and you know it's good for the it's good for the city and it's good for the for the planet. So that's all that I have and just have a good summer guys! Thank you! Do they know they have anybody actually getting summonses for the plastic bag ban. Is that even like remotely in the Fed? Is happy? Okay, that's what I thought: okay I'm sorry I was so disconnected from that yeah. You asked my block already. They stood. They stopped with the plastic already so I mean I. Do not know what the public, except whatever they have left in stock when it comes to passing packs they probably giving that out, but as soon as they finish, what that I do not think we're going to have another stock of it. You know we should ask about that. When do they plan to implement the hold or take the hold off of the plastic bag situation? Maybe can Christina? Can we Oh Mia Jessica, really quickly Jessica? Maybe you can not speak to us sure. Give me two seconds: Jessica I, as I understood it. There was a delay in this. I. Do not know that there was a firm date put in place. I remember in the earlier chaos of the Covid-19 pandemic that there was mentioned that this was a delayed enforcement. Okay. Thank you. So much all right now go to the next committee report. Health bear with us. Ashley is here with us hi everybody specific to helps to report, but I just want to encourage our body to please keep wearing face coverings when they go out continue to social distance, we're seeing the numbers go down in the state and in the city. So let's just keep it up and also I'm going to say thank you to everybody. Who's been out volunteering either with giving up mass or giving out food I want to shout out Michelle Dunstan for coordinating all the volunteer efforts and LeFrak and know just with helping to make sure people are getting fed and I just want to say, happy, Juneteenth, happy, Father's, Day and everybody enjoying your summer. Thank you so much Ashley, that's true! Happy Father's, Day, you're, right, you're, right Mr., so nothing to report specifically about parks, but I did speak to Christian earlier today, because the news was announced that the USTA is going to hold the U.S. open without fans. Already some of the pro players have come out and said you know good luck! You know getting us here. It's a really selfish decision and I fully. You know, as the vice chair of the cab for Flushing meadows- corona Park I, fully stand by that same sentiment, I think it's a completely selfish decision. You know a year ago Christian and myself, Mara Lena and many elected officials stood with Scott stringers team. You know when they released the audit that the USGA has underpaid the city, three hundred eleven thousand two hundred and two dollars, so I'm, probably going to be creating a petition of some sort, because if you're not aware, there are sort of two entities that are associated with that Park one being the alliance for Flushing meadows-, Corona Park and, quite surprisingly, the board voted to have Danny's ouster, the president of the USTA, as the chair, so I really feel that you know with parks being what they are, the lifeblood of the city. Now more than ever being needed. I do not feel someone that makes a decision to jeopardize players and also jeopardize the safety of the community. I mean, as we all know it takes over the entire park and the entire surrounding area and I do not see that any different. Now that they're just going to broedcast it because there's still players, security and other things, even if it goes on so just look out for something like that, because I really feel like I need to. You know make the voice of myself and my neighbors heard that this is not the right decision for our community. Thank you. Thank you good. What can you hear me? Thank you. Okay, great. We met June 9th. We had a phone conference and I'm very proud to say that we also had a quorum with all that's going on. Let me just give you what went down on cert for Queens division 2, which handles 3& 4 in Queens. I have to make this clear that we do not get funding, no compensation for all the volunteer work. We get a lot of people assume that we get compensation. That's not the case for cert and I'm very proud to say that we have some members. They are out working with the military, doing distributions with boxes that range 25 to 30 pounds still today and I keep very grateful for this, because this is what gets down to the churches and to the other not- for-, profits that put out there, the politicians, offices and other religious groups so I'm very proud of that. We also are doing survey still for the homeless and for the Covid-19 victims. Looking for hotels, that may have more room and another thing, which is the buddy check, we're continuing with that, whereas we check to see if neighbors need food or just some companion over the phone. So that's what Sir been doing silk for the last couple of months, Fire department! So far, we have not gotten anybody that come down with Kovac recently. Is you know these things change overnight, but we're very happy that no one has in there from our fire Department division. We have three of them. What has been happening as people are cooking, more and forgetting to turn off the knobs so as far as I've been happening in the kitchens and with electrical appliances. So, if anything that, if you can remind your neighbors, not to forget it, sometimes we do put something on simmer and they forget it's not, and therefore we have us have a small fire. The next thing is, we got the police to talk about their kovetz and nobody has been affected. They were all good. They been very busy attending the marches in Brooklyn and they have I asked them. Do we have enough coverage here in our neighborhood as they're being sent elsewhere? They said yes, they have been working very closely with the 115. They do have quite a bit of shifts, starting from 5:00 a.m. to 5:00 p.m. it's 12 hours, and many of them can even stay longer than that. So they're really feeling the pressure of trying to keep up what's necessary for our community they've been busy at the Queens Center Mall and the Queens Place Mall. There has been some youth from the ages of 12 to 18 and up trying to get in especially near where target is luckily they've been a lot of man powers down there right now to prevent it. So hopefully this will escalate. As you know, we had the letter sent out from our politicians about that they might be looted. This was last weekend we had many stores along Roosevelt and on junction Boulevard that put a lot of wood barriers up. Luckily, nothing happened. A question was asked from our member child asked me about: did we have enough manpower, especially near Elmhurst, Avenue Roosevelt, both the 115 and 110Th again covered all the areas and if anything they were stationed for there he nobody was taken away. So that means that we had more than enough to handle the situation. I asked about what went up in crimes. Burglaries are up and cars were another issue. A man delivery's will get out of the cars forgetting to turn off the key. Take the key out of the car and the cars were stolen. So I was a big thing that happened. Everything else went down, Grand Larceny, all the assaults that all went down. So that's good news. As of what we got is a report. Another thing is we brought about domestic violence, because that was something that the one had also brought up. I have the telephone number for the precinct they've been busy? Also going to these marches I did give it out in October I'm, going to give it out again seven one, eight four, seven, six, nine three two one I did not hear anything- they're far from 110, but it's good to know that we have someplace to still reach out to if things start to get worse again being that we're in hard times with money and family issues, and such I asked if any of the neighbors or police were under any tension. Sometimes when we're under all this tension with what's been happening, the Covid-19 and the marches and protests was there any people being hurt by things being said so far, nothing's been reported to the police department or the community at large. So that's good news I'm very happy to hear that they're doing outreach now for the homeless, along Broadway with some of the churches. Again, that's continuing they've been hitting parts of Whitney Avenue. They are going to continue to keep that up again, it's very hard to tell these people to move forward. It's one of these issues that we are still trying to come back, they're working closely with breaking ground, and hopefully they get them off the streets and with the help of cert they'll, go to some of the hotels that we've set up for them. Repeating some of you got some good waivers from CB4 office. Christmas incident very important you're going to get in different languages. English special you are not allowed to sign for the owner. Only the owner or someone who's responsible legal is possible for the building or businesses are only to sign that you were not, even though you may want to help. You do not sign for that. As soon as you can get, the men I know that John we're certain police officer is working now on covering a lot more area, so you can get those waivers in would help they've been covering my first street and my first place on 43rd and 43rd for fourth Avenue and the overpass of the Long Island Railroad. So the more we get in more coverage, you can Mario's we can cover. Hopefully we keep up with it liquor licenses. We asked a lot of questions about SLS and, of course, some of the some says they've got from the police and they questioned us and, of course, we're going to give him a little break during this time and hopefully they'll be able to handle some of the situations. One question that was born from Clara is about the security cameras John, where cert was not able to get a full count on this cameras that were active or shut down are not working. If he's going to try to work on that, the following me so we'll find out more about how that's panning out. Another thing was about gangs. We saw a lot of gang- related problems in these places. We wonder if they're threatening a lot of people, the police are looking into it. They they're doubt they're documented. In our report. They were gang- related they're, going to look further to see if this is spreading, and hopefully it's not after all this little bit. But it's an issue they're going to look into and that's pretty much that's pretty much it at this point. That's my report so again happy Father's, Day to everybody all the grandfathers as well. No, you know maybe less unmuted I know I have nothing to report. Yeah I know I mean he might be. He might be there. I do not want to say he's not here, but you know Alton. If you are there, we know she's here, Thank You, Alexis committee reports and item seven. We really accomplished back along with item four for so we're nearing a German and I. Just would like to thank everybody for coming in on these meetings. I do not know what will happen in September and it will get very interesting because we are supposed to have a board election by the end of the year and the committee needs to be formulated. I believe in October I believe October to nominate people for positions on this. It's rather important I hope we can meet again, but I have no idea what, when that's going to happen in the meantime, I just like to wish everybody a very safe and hopefully as happy. You can be summer to you and your families, and would you like to say anything yeah, it's more than you again. Thank you, everybody. You know it's been. It's been a rough year, but I've always had the support of the board, so you guys make my job. So thank you. Like 90 years, oh I took a year again. Thank the board members. Welcome aboard this is not the way we normally function. He may seem like you're in the dark, but rest assured you will hear from us berries the entire process president's office. The Chipola members was somewhat delayed, but you will be hearing from the port office very soon. Any questions concerns. Please do not hesitate to call us. The number is not three one. Four one is in fact two one, four two. So if you eat at the office, seven one eight, seven, six, zero three one, four two or just email us that Q+ 0, 4@, CB, DOT, NYC Govt, alright guys enjoy your summer. Thanks for everything and I hope you guys Rock thanks good night! Thank you.",
            "summary": "All, the Queens Museum make the road Elm core new life, CDC We're, going to be using the opportunity for all of us to get together and make like a one- stop shop for all things of a community outreach that includes helping education, community welfare awareness and fundraising.\nPossibly can I only think, maybe one or two more phone meetings, but if you are interested in any information or anything regarding this Elmhurst Corona coalition, in conjunction with the Hall of Science and a lot of different community agencies, please do reach out to me personally see Casson y', all at CB, nyc.gov or qn0 for at cbiit.\nLast time, I sent the email to Governor Mayor or the intelligence office Queens your state, all the media's, including Chinese media, but only a new.\nIt's safe summer I will understand obvious things on workers, a hospital workers, police members of committee, Board that I working, maybe steak and gab.\nShe hears everything, but she was not able to you know to let you know that she's none, but just got it now, and as for the census, the Queen's General Assembly, and the presence of his doing a phone in the predominately for Mandarin and Cantonese Chinese people.\nIf anybody's in just get in touch with the borough president's office, and that's Gregory, is here near me: Good evening, all again welcome to the new board members I look forward to meeting all of you when we see each other next, either in person or virtually I, do want to say black lives matter.\nIf I may also I, want to just add to the fact that a Christian and I and the congresswoman earlier this year, cuz he before pardoned up with Pakistan Bank and on Memorial Day. Some masks from the mayor's office.\nKnow, get the word out and thank you for the board for the work that they're doing around the census.\nWp are working with business serving partner organizations throughout the five boroughs, including in CB for the Queen's business outreach network on 40Th, Road and Corona, or more info on that I can send you guys.\nPhase of opening up the main issue, is, of That the social distancing is just not being Today was my first stop going back on a week or so, and I was mortified over what I saw all over Crona plasm, nonetheless, not to mention the fact That, of course, the food vendors and mask vendors and glove vendors and every kind of vendors, possibly out there.\nThe community know that we will be our office, will be hosting an I lag event and giving one second sorry It'll, take place on June 18th, and if you need to RSVP for the appointment, you can reach us at our office number, which is seven one, eight six, Five one three one, eight five, and also to let everyone know that our office has also created a Covid-19 community resource guide, which includes information and resources for individuals.\nWe actually have somebody from the borough president's office who is going to speak.\nOkay, so I got a few updates for you, I'm, going to say first that our officers recently released the city's quarterly cash report and the city's cash balance projection.\nSo, the numbers are not as bad as probably many people would think the city's cash balance for cash balance is actually lower than it was around the same time.\nLast year, but you know I think what more people will be interested in is the fourth quarter of current fiscal year in those numbers and report on that will come out.\nYou know in the near future, but that probably will happen for the summer when there's no meetings, but just people look out for it.\nThis gives people information about how to help kick- start their business as the phases continue and as more businesses reopen.\nI'm here representing the Queens borough president's office.\nI wanted to welcome all the new appointees to community boards for as well as returning members, the birth president wanted to prioritize the census, she's, encouraging everyone in Queens, so you fill out their senses that they have yet to do so, and she also wanted to remind everyone to vote on June.\nFirst, this census we know Kristen, is not in Nexus Consumer, Affairs, So. As we have talked about phase one started last week, the city is slowly opening lead.\nOkay, I just thought much to report just that some information I think beginning June 15, which was on Monday another stop a lot of stores , It's good for the city That's all that I have and just have a good summer, guys!\nEverybody specific to helps to report, Continue to social distance.\nSo nothing to report specifically about parks, but I did speak to Christian earlier today, because the news was announced that the USTA is going to hold the U.S. open without fans.\nAlso going to these marches I did give it out in October I'm, going to give it out again: seven one, eight four, seven, six, nine three two one I did not hear anything- They're far from 110, but it's good to know that we have someplace to still reach out to if things start to get worse again being that we're in hard times with money and family issues, and such I asked if any of the neighbors or police were under any tension.\nWith what's been happening, the Covid-19 and the marches and protests, was there any people being hurt by things being said so far, nothing's been reported to the police department or the community at large.\nAs soon, as you can get, the men I know that John we're certain police officer is working now on covering a lot more area."
        }
    }
}