{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "title": "Top chat replay",
            "publishDate": "2020-09-21",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        },
        "properties": {
            "fillerWordCount": {
                "uh": 278,
                "um": 525
            },
            "wordCountFullTranscript": {
                "people": 104,
                "dog": 98,
                "park": 69,
                "run": 67,
                "parks": 60,
                "lot": 57,
                "trash": 47,
                "thing": 43,
                "time": 37,
                "area": 36
            },
            "wordCountSummary": {
                "people": 25,
                "park": 17,
                "dog": 13,
                "lot": 10,
                "run": 10,
                "riverside": 9,
                "area": 9,
                "parks": 9,
                "trash": 9,
                "committee": 7
            },
            "fullTranscript": "Okay, we're live streaming all right. We have participants for you're. Who are we somebody's here and not listed? Maybe me mark linda natasha, that's it so far and we have no attendees so far as I could tell I haven't let them in yet: oh yeah, okay, that's right! Yeah! We've still got ten minutes yeah. I may pop up and do a couple of other things and return unless they have any really hot topic to talk about before we start, please know nope we're good. You know I wrote to my, except today I wrote to my old boss from years and years ago, at greenville and her roommate at cornell was ruth bader ginsburg and when and when she was inducted, joyce was there. So I wrote her this note. I just said you know, for us: we've lost an icon and it's heartbreaking and for you, you've lost an old friend because they stayed friends from the time they were like yeah in undergrad together. Well, that's the personal for the country. It's very concerning right! Now, oh yeah, I'm not very optimistic. No indeed, I'm just trying not to get totally depressed. Just when we think nothing can get worse, something goes I'm going to pop out for a moment, I'll be back very good. It was something different wasn't it I mean that was just. This is oh where's clary she had to pop out for a second she'll, be back yeah, but in a couple minutes I'm going to let folks in because sometimes it takes a minute yeah, I'm only going to stay on the call for an hour. So, okay, I mean it's really about the dog run yep. I got a. I got a new case today or a new matter, so I shouldn't talk about that on we're, live streaming, never mind. I hear about it, though, in the balls of degas, oh kind of fun, a real dig up, we hope so because otherwise the amount of money that somebody's spending for it would not be. You know, oh mark, that's exciting. I have this one client who anyway I shouldn't talk about it on live stream, but anyway, well I'll give you a call tomorrow. I have my 6 45 bni workshop tomorrow, bni networking meeting tomorrow morning, 6 45 ouch every tuesday morning. I just joined this group and it's they're really dynamic. They're really dynamic a lot of attorneys in there, but it can only be one attorney in each category. We should talk about, but it's a fun group and a lot of what upper west siders. So nice tell you about it and if you want to visit, you can do that. So you can add one more thing on your plate. Put one more thing on your platter: yeah! Really, oh goodness, all right! I'm gonna start the webinar. Just because that way the attendees will come in and we'll see who they are and yeah you've got. A lot of people got four more minutes, yeah a lot of attendees signed up for tomorrow night. So what's tomorrow, night hhs, oh thank god! I'm not there! Sorry you'll be there. I will see my new bike in the background. I was wondering what that was. Is that a bike yeah it'll go into the bedroom when we start entertaining again, but I gotta tell you it's so cool barbara adler turned me on to it, and so I bought one and it's like I cancelled my membership to my health club today, oh wow, okay, I'm just talking about the bike. Barbara! You you've got it right, yeah, it's right there. You can see it oh yeah great, to keep it in the living. Hi elizabeth hi, hey everyone! How are you she's back? I'm back. Let's see who else is who else has joined us? We are live streaming and recording russell gray, barbara elizabeth great so on our committees. We're still missing ken susan and doug from the committee. I think, is that it do you not have a quorum yet well, we actually don't need a quorum because we are not having a resolution but like, but ken promised through the minutes. So that's important, yeah, that's important! Isaac. Zach may want to speak on the first issue. So maybe evening, hey zach good to see you you're kind of in silhouette there zach peter wright, is joining the call, and so is some jan applebaum. So I think they all might want to say something. Of course. We expect that barbara. Do you do you know? Do you know if elaine boxer is joining us who elaine boxer elaine did not come to the meeting? She had a conflict and jan who's, one of the spokespeople instead sure jan started the dog run with me in 1996. yep, which one first iteration. Still there all right. We have robert espia who's, our board member. You might want to make him a panelist. I sure will I'll be right back to him. Give everyone, and apparently we have helen rosenthal lots of times it's julian logs in with oh, that's right and we've got erica overton and there's only one name on the attendees that I don't know and maybe should elaine has joined us. Okay, I want to promote peter wright as well. Peter is expected he's here he's in the panelists he's in the attendees. Oh good, great, okay, good! Well, I mean we know. We know we're going to call on people whether they are participating their panelists or attendees, so they don't necessarily have to be switched over, but it's okay. I think, if they're panelists they can be seen right. That's the idea, oh, is that the idea that attendees can't, I guess that's right and doug climbing's there too. What about doug mcgowan, don't see him yet don't see him yet and or we're missing. Let's see, susan is with us. It's literally 6 30 guys so a little bit late, okay, well elizabeth up to you, we can start. We normally do sure. Should I make my announcement or do you want me to wait on that and just no you were making one? Yes, while we're waiting for people, since there are so few people on the call, I don't know if we've opened it up to participants but for anyone I will be leaving this committee in the coming months and you know look forward to clari and mark discussing who will be the next chair. Many of you know I'm running for Manhattan borough, president I'll leave it at that, but I feel like it's really important: to have sort of non-partisan leadership on our committees and in our leadership on the board. So looking forward to working with you all in hopefully a different capacity in a year's time, but I will remain on the board, but there will be a new co-chair of this committee within a month or two so leaving it at that very good. Thank you for making that announcement all right now that we've done that and thank you, elizabeth, I didn't expect the announcement, but it was your announcement, but it's welcome and thank you for doing it. Elizabeth and elizabeth, your your blast announcement or whatever your whatever, what you call what you sent out looked very nice, graphics and very nice message the other day announcement to the public. So should we start yes, I know we have everybody here on the dog run. So let's start that and doug mcgowan's logging into so that makes all the committee members so can coughlin is going to be taking minutes tonight. He volunteered when I recruited him, is the best way to describe that. I guess so. Thank you, ken thank you ken. So we have three sort of oh. I know cindy's not with us, or is she simply with us yet so in the in the realm of in the realm of announcements, yeah- and I guess it's now safe to to say cindy resigned from community board seven today, because she is now the chief of staff to council member helen rosenthal wow. What happened to marissa is now the district manager of community board five in midtown Manhattan. Congratulations! All around wow you're following up jesse beaudine jesse beaudine, is the district manager just of community board four right. He went from gayle's staff to that. So that's right. He went from yeah yep, that's great anyways. Where does all this go? Given that helen has withdrawn, she's turned out and she's withdrawn from her city-wide race peter it may be. It may be a short tenure. Fine. The short answer is that she's still got a year in office before her term limit expires, and so she needs the staff. I think that's the short answer, but let's not talk politics, let's talk parks. Well, we will change politics. We will certainly miss cindy, but it means we've got all of our committee members on now and a couple of other board members and we have matt genrich, who is the park manager for a whole lot more than roosevelt park but including roosevelt park? So let's start with number one. I actually don't have the agenda in front of me, but it had two components. One was an update on the renovation of the park in general, where we had started to see some concerns, not that we can do anything about it, but started to seek some concerns about the surface, for the dogs to walk on and maybe jan can give us a minute or two on that, and then the primary aspect of this item was to hear from the friends of theodore roosevelt park a proposal. They have to add some sound deadening, plantings and we'd. Ask them to, and I know that they've done some leg work with the museum and with the parks department and with the dog run. But maybe we can ask jan, is if she's the right person, jan to just give us a little update or linda, if jan is not available to do that. A little bit of an update on the just the renovation itself is. Jan here is jan with us. I didn't see. No, I don't see her, but peter is very knowledgeable. Elaine boxer just came in oh so elaine can do it, yeah, hey! No, I didn't just come in. I was just made a panelist yeah good highlight so. First of all, I just wanted to thank this panel. It was my intention to come to a community board 7 meeting and thank you for all your support of the run and to have a big ribbon cutting, but Covid-19 19 seems to have postponed that so the issues with the run- and I am sort of relating this on behalf of the community- we're very delighted to have a run that drains. It's very nice. Of course you know this being a public amenity. Public has a lot of opinions, and so I have gotten some feedback. One of the most passionate ones is that the surface itself seems to be irritating and perhaps even dangerous to the dog's paws, and I have a unique perspective on that, because what happened back in the fall is that I was briefed by steve simon that the contractor said they could not access either pea gravel, which was what was there before or brownstone screenings, which are what are used in riverside park. Those are two very standard crushed stone or small pebble materials that are used in dog runs and for some reason we were told this cannot be sourced anywhere and just candidly, you know my opinion. Is I find that hard to believe. I don't know how it's possible not to find a commodity like that, but that's what we were told, and so instead, this substance, called rice, gravel was proposed. It was tested for drainage. Properties is what steve simon said and it passed that test, and so it was installed in the run. So the feedback that I'm hearing now is that this rice gravel is very small and sharp, and it may not be suitable for dog's paws and what's happening, is they run through it and it's very small and sharp it gets between their toes? There have been lacerations. I think. That's personally, my opinion is that's something we should really look at. You know the surface was not tested on dogs, it was tested for drainage. So that's a concern. Some other concerns that I've heard are that it's very hard to walk through, because it was very deep. It's like being at the beach. Apparently, some dog was playing and turned, and slipped and injured its leg and people are complaining that they can't walk through it. I can only attest you know. My personal observation is that my own dog she's attending this meeting, my own dog, goes into the dog. Run, doesn't really run around and kind of seeks refuge on the concrete platform where there's no pebbles. So you know there may be something to this idea that maybe that wasn't the best material to be used. I think if we could wave a magic wand and have unlimited budget, there would be a bulldozer that would come in and scrape out all of these rice gravel pieces and put down something rounder like pea, gravel or something more proven like the brownstone screenings from riverside park. So that's the feedback. I don't know what to say about it's deep and the dog turned its ankle. I kind of feel like that's. What's gonna happen if you put the proper depth of pebbles, but I could be wrong about that. There were also just a couple of other complaints that there are fewer benches now than there were prior to the renovation, and this has become an issue also with Covid-19 19 social distancing, that you know, people are kind of one person to a bench or one family to a bench and there aren't enough of them and they can't really sit next to each other. So there's there have been some jokes about bring your own beach, chair and finally, and if matt genrich is on here, he is looking into this, but humorously the lockbox for the tools that we use like the rakes and the shovels was installed in such a way that it's like a chinese puzzle. It's like a chinese puzzle box, so you can't actually open it and- and so that has been referred, I understand back to the contractor so that we can use the lock box and put our tools in there yeah. So I think that's the update. Like I said I we're just so grateful that the renovation is even done. The small dog park looks great in its new location. The fences are sturdy. It's really nice to have the ADA platforms, but I have been hearing and seeing some issues with the pebbles. Does anyone have any questions for me? I have a comment that if you can hear me, this is bob espierre robert yeah. We will call on you and it's fine to go ahead, but we're going to call on the chairs will call on people to do comments, but go ahead, go ahead as as she's speaking the young. Lady speaking, I looked up. I googled p gravel and I see here that it's available in at lowe's, and they have a note. You know the way having no kind of stock or whatever it says. You can pick it up now. You know we're talking about volume, but I think somebody should put a call into lowe's, even if we have to take out to new jersey or wherever and pick up, you know a ton of the stuff, but this nonsense that it's you know they tried whatever and they couldn't find it just you know, I'm glad she made the comment. I'm sorry, I forget the name of the moment. It's just nonsense so that, according to google and according to lows, we can get it. Robert would first of all would that only a ton were needed, and second it's never that simple with the parks department, but let's get some other. Thank you, though. I'm not surprised at what you found out. Let's get a couple of other questions in from from board members and then from other community members. If there are any elaine, I wanted to start out with a couple of questions. The do you recall, and I don't know that we ever saw a breakdown on the budget for the project, but the gravel itself. Do you recall you know what the relative price we know? I think the project was 650 000 of new york city money. Do you recall whether the gravel was you know, 100, 000 or 20 000, or what it what it was as a component? I don't. I can look that up for you, even while we're talking I'll see if I can find it because rich weil, who's, one of the volunteers, actually put in a foia request for the winning bid and everything's outlined there. So I can look that up, but I don't recall I'll. Take that I'll. Take that away no big deal. I mean I don't know that, there's anything we can really do, but let's take other questions from committee members and then other board members and then community members. I guess I'm looking for people to put up their hands. Is that how we want to do it no or well? We can be a little more informal. Can I reply to the other question about yes, so, at the time when we found this ridiculous, we actually made phone calls to contractors and stone suppliers. Material suppliers in the area and both pea, gravel and brownstone shavings were in fact available. They were purchased by the ton. I think by the truck is five tons and we were sending this information to parks, basically saying it's not available here. It is there's also a contractor that I forget her name, but over in riverside park, there's a wonderful woman who is sort of responsible one of the architects. I think she's british she's, scottish, it's margaret bracken. Yes margaret she sent me this backhand yeah. She sent me the name of the contractor that they used to do the the rent like the upkeep. The periodic upkeep on the dog runs in riverside park and said he's great and he's got the brownstone screenings no problem, and it's really not that expensive and in fact, we in bulmur's dog, run started planning how we're gonna raise five thousand dollars every two years, just to get a dump of the stuff, because it needs to be replenished over time. So that's my answer to the question. We really did not understand how it was not possible to source this material and we suspected it had to do something with preferred relationships or a lack of understanding or lack of commitment to getting the right thing. Elaine. One more question on mr mean we'll turn to others. Do you have do you have any understanding now? And you know none of us on the committee. I think has any expertise linda might, but you may have a lot more as to whether it with the correct material, whether some of that could be put on top of what was put there or is it a question of if this material had to go? Is it doesn't have to go? I don't know, and I think my instinct says it might have to go, although not completely. It's not like. You have to scrape out every pebble the reason being that if there's small, sharp shards then once you put the other material on top, it's just going to mix all together and there will still be small, sharp shards. The other thing is that I, you know it's already deep pebbles, that people are complaining that it's really hard to walk through. So if you put more on top, I think that problem will get worse, but I'm not you know a materials architect. So I don't know the answer. But I'd say it's probably not a good idea to just dump it on top will also probably exceed like the bathtub lip. That goes all the way around like there's a certain depth. It can go to and then all the pebbles will start to to go into the rain garden and into the museum like near the museum garage it'll spill over. That's my best guess. Thanks elizabeth we've got three hands up from the committee ken natasha and linda alexander, none committee board member elizabeth. Should we just take those in order yeah, I think so. I think the only thing I'd like to add just yeah, as somebody I think, is the only peony co-chair who has a has a dog who had a dog who went to the park and who now is a puppy who, hopefully will go there in the future? I think we want to do what's best for the environment and, for you know the neighbors as well, so I'll leave it at that and look forward to hearing from everyone else tonight, barbara. I know you have strong opinions about this and I'll leave it at that all right. So, let's turn to can try. Everybody should try to keep their questions and remarks fairly brief, ken natasha and then linda alexander and then we'll go to other members of the public. Okay, hi elaine. I know whether we've actually met we've corresponded by email quite a bit, so it's nice to sort of meet you. I had two questions, one, I'm just trying to get a sense of how widespread this problem is among dogs. Is it certain breeds or certain sizes, and what percentage would you say are complaining of this and not the dogs but the owners? It's really hard to say I don't have. I mean we have 800 known members, but I have no idea sort of what level of folks use the run or are not using the run now, because the pebbles, I can only speak anecdotally, that I've heard the complaints and the other thing that I think is very interesting that I noted to steve simon. He asked me how's it going and I said I've noted a lot of people exercising their dog in the yard, just west of the dog run. So we've got this beautiful facility and you're breaking the rules and you're on the lawn. So I don't quite know what to make of that other than these are people for who, for whatever reason, the lawn is preferable to the thing that we just made. So I think I don't. I can't give you a percentage. Maybe you know, jan and jane. Did that survey and there's a bit of a selection bias there, but they might have a better sense of just the numbers of people who are complaining, but I do see people in the grass instead of the run- and I also feel like the population in the run- is a lot lower than what it was before. We did the renovation, okay and you don't think it's just a matter of reducing the depth or the volume so that it's harder and not as not as sandy we're not as deep that will solve the problem of people feeling like they're walking through the sand at the beach, and that allegedly, is why either a human being or a dog twisted their ankle. I don't want to dismiss that concern, because if people feel that's a valid concern, let's investigate it. My bias was kind of like well you're. Just not used to the fact that there should be a certain depth of pebbles, but then again, if you go to riverside park, 72nd street 87th street, somehow that surface is firm and it is possible to walk on it. So I don't know if it's a matter of just reducing the depth of the pebbles to solve the beach problem. I think that will not solve the lacerated pause problem. Okay, next is natasha. Tasha. Are you on youtube? Yes, I am hi elaine. Actually I wanted to bring up the issue that elaine herself brought up about people using the grassy area. Just west of the dog run. I've seen it. I see it every single day. There are at least eight dogs in there with their owners and they jump over the fence, there's not even an entrance to that triangular area and I'm just trying to understand why they are there. When this brand new dog run is there, and maybe it's these issues that elaine is highlighting, but frankly, even when during the pandemic, when park's usage was going up a lot and we didn't have this brand new dog run, I didn't see that grassy area being used as a dog run ever then. This is a very new phenomenon. I think you know. We've talked about enforcement and I would bring that up again, I'm not talking about ticketing, anyone or anything, but just some person of a party, a security guard or a parks employee. Someone telling these people that this is not right. The parks department spends a lot of money, maintaining our grassy areas, and this is just wrong and it's all about like creating bad habits that just seem to get on re, keep getting reinforced. That and I don't know if to me, it seems like there's a small dog's area right next to the garage within the bulmur's dog run, and I see very few dogs, if any ever in there, and I'm wondering if elaine knows anything about that and also finally, I'd read this report, maybe last month that the dog run got flooded, and I was wondering if somebody has you know some background to that. Was that, like what was the cause of that? Thank you elaine, the last two questions for you and then I want to turn to matt to see if he can tell us anything about the lawn and enforcement on the lawn, but elaine you want to respond to the other. Second, prior to the renovation, there were rarely dogs in the small dog run. Either people prefer the larger run. In fact, we would talk to people who were constantly treating the smaller run, not as a run for small dogs, but a place to take their problem. Dogs so you'd, see large dogs in the small dog run that they wanted to separate from the general population. I don't necessarily believe the lack of use of the small run is indicative of anything wrong with the renovation. I think it's sort of consistent with habits prior to the renovation. I did hear about the flooding, but I heard two different things about the flooding. I heard that it flooded was one thing. The second thing I heard was that it was intentionally flooded to test their drainage system like there was there were hoses running like to flood the place. I don't I don't know which it is, but I, but I can say we had some pretty heavy rains at some point since it opened and the place was dry elaine. I read a different version shortly after and I don't know if which one is correct, but the version I read was that somebody had by mistake turned on a valve and let water run, but let's turn to matt genrich. If we can for a moment if matt is with us, I think who manages this park for the parks department, as well as a whole lot of other parks and see if matt can tell us anything not just about that which should have a pretty straightforward answer, but about the issue. Natasha particularly highlighted and elaine, as well of the many dog owners using the lawn where it should be, no dogs instead of the dog run and what the enforcement is there. Matt are you with us? No, yes, no people either nobody's supposed to be yeah. Let's hear from that, if we can is matt unmuted and able yes, can you hear me? I hear you I just don't. I have to move my screen there, you go so first. I just wanted to address just the concerns about the surface of the gravel or just confirm like we are aware of the issues from the doggrun community. We are looking into it. You know I don't. I don't have an answer for what can be done about it. You know tonight, but we are. We are aware of the concerns with the surface of the run and we are looking into it, steve simon's, working with our capital team, as well as other people, to see what can be what can be done and the other concerns, as well with the with the lack of benches in the run. And then you know we're still. I need to follow up with the contractor on the toolbox that you had mentioned, but we will get that taken care of. So as far as the mysterious flooding of the run several weeks back, we had to the the museum. The water to the park is run by the some shutoff valves within the building of the museum and the fountain needed to be readjusted, and so once the fountain was readjusted, the a valve accidentally got turned on. It's called a bleed valve for the irrigation, and it's only supposed to be turned on when you're winterizing the lines. So once your irrigation system kicks on and the bleed valve is on, then all that water is going to come out of the bleed valve and when the irrigation is running. So that was what caused the flooding of the run, so you know we're not ex not expecting that to happen again. It was just kind of like a fluke thing. So, let's see what else the use of the adjacent lawn, which is the lawn, is signed. You know it's a. It is something that myself and other parks employees regularly. You know if we see people on the lawn, you know asking them to get off the lawn. You know pep and with our with our enforcement numbers, you know they can't be running over to the park. You know every you know few minutes to get people off of the lawn, so I think it's more of just re-educating people and you know reminding people that the dogs on the lawn are not allowed, but I will say that it's not only dog owners that I've seen that I've had to ask people to remove from the lawns before there has. There have been people other than dog owners using the lawns when they've been signed as they're closed, matt does pat, do pep officers ever go to that area and the other forbidden lawns and give and if they do they give summons. As ever I don't know the parks enforcement's route, but I have you know, made them aware of this issue from time to time, and I asked them to go over there and do spot checks, but I can't tell you, as far as like enforcement of you know, numbers of tickets or anything like that. They usually try and educate people first, rather than doing summonses yeah, I think elaine had her hand up yeah. I want to comment on this because the bulma's dog ground association obviously does not support the use of the lawn. I think one thing that happened during the renovation was we were sending repeated messaging. Please do not use the lawns. Please wait for the renovation, and now what's happened is the renovation has opened and they don't like it so now, they're not waiting for anything so now they're in the lawn. I think that might be part of what's going on here, so I have a couple of suggestions that might help one is that there actually is a portion of the fence that has been opened. That is, like the south east corner of that lawn. If parks wants to go and close that firmly that might help, and then the second not the main lawn that's on 81st street, but that little lawn, that's just to the west of the dog run. There's an opening in the fence sort of on the dog run side on the south end all right, we'll take a look at it and then the other thing I might suggest- and I can work with you on this mat if you want is we could put a sign a little laminated sign that bull, moose dog run sometimes puts up in the run at that spot. Basically saying, like you know, dog owners, please use the dog run if there's a reason. Why not please email, bulmusdogrun gmail.com with your feedback sounds like a great idea. Elaine thanks, madame elaine, we have still hands up from. Can I just say just one point of clarification: there's actually no signage around on that grassy area, saying that people are not allowed in there or dogs are not allowed in there, so I would really advocate for proper signage. I know in the event that these pep officers cannot be at every place at all times. I think some new signage would be very helpful. Maybe we're talking about a different lawn, because at the entrance gate there is a sign that says the lawn is temporarily closed, correct and then yeah inside that specific lawn there may we, I think we might be there's multiple lawns in the museum, so we'll circle back and check on that. Okay, thanks matt, we had waiting to speak from the committee and then I haven't even looked at other attendees yet, but we had linda barbara try to be somewhat brief. I don't we hadn't really planned to spend this long on this part of this issue, but we want to air it, and then susan after that, linda alexander hi, elaine back in 1994 95 96 before when peter was we started working with friends, the dog run surface was dirt and the dogs were getting sick and we all organized. We worked with parks department, we didn't have a budget. I think we raised thirty five thousand dollars every six years. We were not great fundraisers, then incorporated in 1998, but before that we made a deal with them. When we got the pea gravel- and let me say this- the pea gravel we got, everybody complained about too some dogs loved it and some dogs didn't. They also complained that it would we what the parks department would do is line well every other month. They would give us a lime thing. The dog one was closed for two days and everybody would of course, invade the lawns. So what we did and you're not going to love this is that we organized and jan will tell you, because she was on the noise patrol. We organized our community of dog runners and we gave assignments that, like during periods like when people are on the lawn, there would be three or four of us and say get off the lawn or hey your dog is barking too much. Would you mind giving it a timeout and coming back and of course sometimes it cuts us out now people weren't quite as violent as they are today, but I hope it. But it is one thing to like organize the community to like actually have like spotters and saying: please help us. You know: we've got to get you off this lawn and we've got this dog run and if you can't stand the pebbles go into the park into central park and that may be the alternative. Unfortunately, so it's a little bit annoying, but it's organizing thanks, linda barbara, then susan schwartz, then we'll look at the public for hands barbara adler, yeah I'll. Be very brief. I'm really sorry that jan isn't here tonight. She I expected that she would be on the call. She was particularly upset about the small dog issue and she has a small dog. We had a lengthy meeting which I'll discuss when we get to the next issue, but it would and jan held her little dog almost the entire time until I think she couldn't hold the dog anymore and when she put the dog down here immediately, went on to where the two benches are in the opening to the dog run. It's raised a little bit and the dog got off the gravel and it seemed from watching other people that this is this surface somehow needs to be remedied. If nothing else, at least this small dog area should be remedied so that little paws don't get hurt hold on one second, barbara, there's a sound of cutlery in the background whoever's got the kitchen action if they could mute. Unless it's barbara I was I was trying. I was trying that myself and I was unsuccessful and starting out where it's coming from I'm not hearing it now. The only the only other thing I wanted to mention was that we, somebody from 81st street, sent us a video of all the little dogs that are using the the grassy area. Right now, outside of the dog run, I can share that with you. If you want to see it, but I think you know, and when we spoke to somebody on the way out she said listen, you know my dog can't use this dog run. You need to do something about the gravel and I think you'll find that, once the gravel is changed that the problem disappears. So thanks, barbara, the cutlery problem has not disappeared, somebody's doing it in the background, susan schwartz then will turn to the community. It's a real quick thing just about the the lawn elaine clarified for me that you're talking about a different lawn, it's a triangular one. That's got no signage, but the one that's just south of 81st street on the weekends. In particular, I see large groups of people there relaxing and enjoying the lawn, even though it says lawn temporarily closed. I don't know how they get in there. They obviously climb over with you, know, lawn furniture and all kinds of stuff, and I think it's just really frustrating to me that the lawn is in bad shape and there's central park so nearby, where they could just lounge around, but they seem to not want to follow the rules. I find that incredibly frustrating. I know that we have a real shortage of pep officers but matt. If they are there, I'd be really curious to find out when they do go. Clary was asking: do they give summonses, and is that their? Is that something they should be doing? Well? I don't think that matt probably has nothing more to tell us on that than he did a moment ago. So yeah, it's something all looking to look into. I don't have the information on number of summonses and visits, but it I'll relay that back to them I mean I'm not asking for the number. I'm just curious is that the protocol is that the is that the expectation that, when they do go, that they will be giving the summons, or is that not the appropriate expectation? You know, I think it's situational. You know it depends on the situation they're not going to go and give someone a summons every time. It's you know, parks enforcement does a lot of education and before they start issuing summonses out to people okay. Well, that was my comment in the chat and that's the reason I wanted to say something was because it seems to me that doing education when there's a very large sign in english, which is the prevalent language here that says, law enclosed. If you're lounging on lawn furniture you had to stop and blow up that you probably would benefit from a summons. That's all I have to say about it. I know this is separate from the dog run issue and I don't mean to distract, but I find it very frustrating when we talk about education, there's a sign that says: don't do this and people continue to do it. I think we need to focus this conversation, as the co-chair of my last co-chair meeting of this meeting on the subject at hand. So, let's move on. Thank you agreed. Thank you, elizabeth. Let's see if any attendees, yes, we've got erica overton, peter armstrong and daniel atha all wanted to speak and we're not even on the main part of this dog run. Discussion which is about the proposed peter wright, also has his head peter. Oh, I don't see his. I may not have just scrolled down far enough yeah. You got it now sure. Okay, no worries we'll get peter for those erica or peter ronson. Just for the moment, if you want to speak about the proposed landscaping hold off on that. Okay, because we haven't had the presentation on that we're just now trying to really wrap up on the problems with the renovation does erica. Is that what you want to talk about? Maybe it is erica unmuted I got muted, no okay. Can you hear me right now? No, I just wanted to address one of elaine's points that my former colleague emily kaitlyn lottery. I think you've spoke to her in the past. She is, she left us to go to grad school, but I just wanted to follow up, because I wasn't sure your conversation with steve simon about the about the different types of gravel and, if there's anything, we could do to help I'll put my email in the chat, and this way we can continue working together on this for sure. Thank you by the way. That's in case anybody doesn't know. Erica overton is the deputy chief of staff for assembly member, linda rosenthal, right, okay, who was next peter? Did you want to speak on this aspect or the next part of this? Peter ronson is peter there and unmuted. I'm sorry, yeah he's you should be on mute. Peter. Are you with us? No, I cannot mute myself. You want me to speak clary nope. I don't not yet we're not on that part yet peter. No, I'm not on that part. I'm on this part, okay, but I called on peter arms and then we'll call on you, okay, peter first hi I'm. This is peter arnson from the columbus amsterdam bid, and I just wanted to say that a couple of organizations up in our neck of the woods have taken things into their own hands or they used to the morningside dog run used to be run and they would get material from parks and spread it and it seemed to work fairly. Well, I'm not sure if that's still how it's done and the 111th street garden community garden ordered 20 tons of pea gravel that they spread themselves on in on a saturday. I don't know whether that's a possibility, but it would be a fast way of dealing with things if the rice gravel could be put into what are called gator bags, which are large, two yard bags and parks could take it away. I just offer that as a fast way and fast and cheap way of dealing with it. So, okay- let's hear from peter wright on this part of this item and then yeah well, when we get to the second part, I'm going to defer to barbara we've done a lot of work. But let me let me let me get into a reality check, since I don't work for the city, so I don't have to be nice. A pepsi are gonna, come in your dreams and I hope anyone we don't have any five-minute responses to what I'm saying. I've been doing this for 25 years, not in your dreams. It ain't gonna happen. Last year, commissioner silver promised us for the parks without borders, summertime peps, which are a level lower than the peps, but they were there for the lawns, but with the with the budget, cuts they're not coming. Second point: you can you can close a fence, they'll open it? You aren't gonna, you aren't gonna, do anything by closing those fences, because we've done it over and over and over with ADA of venus. Our gardener and I happen to agree with elaine and others that until the surface thing is resolved, the dogs are going to be on those lawns. Last two points: brownstone chips which I was involved in a long time ago are soft, but my understanding is they're porous, and so they absorb a dog pee and bacteria and they're not as sanitary as pea, gravel or whatever else, and the last point is our group went to other dog runs to see what was going on riverside at 72nd, clary near you, carl scherz and tompkins square, and guess what most of them are as hard as a rock and sand. There's no surface left so in terms of it's so nice they're doing this, for example, riverside at 72nd. I didn't find one single brownstone chip. That's it thanks peter daniel asa. Did you want to talk on what we've talked about already or do you want to talk about the proposed landscaping coming up imminently, daniel aytha? Can you unmute, or do we have to unmute him? I've unmuted him. I think okay great well thanks for the opportunity, I'm daniel atha with the upper west side, neighborhood, naturalist group and the new york botanical garden, and to follow up with peter on the back to reality is, I think, a lot of our problems stem from not taking the ecology of the site into account and in Manhattan square, which is what roosevelt park used to be called was put there. It was designated as parkland because it was dark and swampy and nobody else wanted to build on it because it was. It was undesirable land, so it was set aside as a park. It's always been swampy, it's been wet and the museum is there. We can't do anything about that, but I think it would behoove us the next time when we are considering the sighting of different park, features to take the ecology into account, so the dog run, bull, moose dog run was put in a dark shady place which is prone to flooding. That's not a great place to put a dog run, people like to be in the sunshine, especially in new york city, where we all live in canyons. So, just real quickly on that, I think for the future. It would be wiser to think about the ecology of the site and how people are going to interact with that, and it probably would have been better to put native plants that like to shade and that, like moisture to grow in that site, rather than trying to re-engineer nature, is to work with nature rather than against nature. Thank you thanks daniel, and just to summarize, for a moment with elizabeth, where we are now on this. Before we turn to the proposal for some landscaping, it sounds like. First of all, the drainage is fabulously better than it was before and nobody's that's, not an issue, but, and some of these other issues like the toolbox and the benches, are at least under discussion and are not big ticket items. It does sound like there's a pretty serious issue with the gravel type of gravel. I just want to remind people, and some of the members of the committee were not with us back in elaine will remember 2006 or no 2000. Whichever year it was when cb7 actually had a resolution on the dog run where we were supportive of the renovation, but we urged that public money going into it be limited. We urged the that private funds be raised for beyond the basics. It turned out that we already have six hundred fifty thousand dollars of new york city money in this, and we are certainly grateful to gail brewer and helen rosenthal, and I guess that's who our electeds were on it. But we do have that background from cb7, and I don't feel comfortable at this point asking new york city to put a lot more money into a different surface. But so I'm not. I don't think we have any resolution about this tonight, hadn't planned on it anyway, but I think we all want to really encourage, as matt suggested, that dpr is taking this real seriously and working with the dog run folks to see what can be done and please come back and tell us you know in a month or two where this is yeah. Can I make I'll make one 30. Second comment on the three dog runs. I visited yeah. I was very surprised to learn. You know that karl schers and tompkins square and riverside we're all financed with private funds, yeah completely and tompkins, which exactly doesn't have the bears for it in the middle of it ten years ago. It's they have a website, a dog, a dog road website raised. Are you ready for this 420 000 private dollars? Well somehow here- and this was a disappointment I think to us over the years after our resolution was passed. We never saw any real private money being raised here. Elizabeth, shall we turn now to the other part of this, which is the presentation that peter has told us. Yes, absolutely thanks, guys thanks, sorry, yeah barbara, are you ready, yeah, I'm ready and I'm not sure if you gave if mark, has slides or not that you see that he does. I just thought I would give a very brief overview of friends of roosevelt park for anybody. I'm sorry barbara! Before that, do I have something from you? Yes, okay, I'll! Look for it while you're talking. Excuse me: okay, if you can't find it, I don't know if I know how to do it, I certainly have it I'll look for it. Give me one okay. Thank you sound about 10 days ago mark roughly, I sent a revised copy to you mark a few days ago, and you said you're going to review. You can look for my email. Okay, go ahead, barbara, okay! So thanks! So thank you for giving us this opportunity to tell you about this project which, as you know, is informational. Only at this point. Friends of roosevelt park is a 501c3 not-for-profit that takes some partial responsibility for the care of the park, including establishing green life, which is a hands-on program. Teaching horticulture to high school students, the friends and the museum of natural history have a memorandum of understanding and the friends does receive some money from the museum each year with bulk of contributions raised from the community. Much of that from buildings across the street on 81st street peter wright who spoke tonight is the long time president, and he may want to add some stuff to this. I'm a board member of the organization and, as linda mentioned, bull moose dog run originally was built in 1998.. Ever since the dog run opened, there have been noise complaints due to the barking. Sounds that reverberate against the brick wall from the museum garage, which forms really the back wall of the dog run, and this has continued as a major concern and major problem. Ever since 1998 we've never really been able to help them, but we feel that now we really have an opportunity to do that, and so we we are proposing that we put in a row of evergreen trees in the this. Well wait a minute: why don't you go to the first, the first photograph that thing that sort of flustered me? Okay, so at the back of the entrance to the dog run this being the entrance to the dog run, there is a fence and between the fence and the brick wall there's a small corridor. The original intention of the friends group was to put a row of evergreen trees along there, but parks was I mean. The museum of natural history was opposed to that. They cited three reasons. They said that one of them is that, unfortunately, that area is what they called a rat card or I'm not sure, maybe that's peter wright's terminology, but he said it was a rat card or they did not want any additional rat burrows to be to be made there by the rats. They were concerned that the trees might have roots that would infiltrate and damage the brick wall. That is the foundation, of course, for the garage and third, there is an underground water system for the area, and some of the underground system is located back there. Okay, so we gave up that idea and instead we thought well, we can put the row of trees just in front of the fence and in back of the bench that you see there and friends of roosevelt park would pay for this in its entirety and if you would go to the next slide, please so this is the rest of the dog run. We would install a row of evergreen trees, evergreen trees, that do not grow higher than 12 to 14 feet, and we cited a particular variety which I'll show you in a minute, and we feel that first of all, the trees are used for sound modification, sound buffering, and we feel that this, if nothing else, I mean we, it would be untried in this particular instance, but we feel that it could only help and at the very least, it'll look beautiful, so so that you could go to the next slide. Please, okay, so in the front of the of the dog run. Is this large bioswale at the time when we had our meeting a few days ago, which was attended by numerous people, including bonnie williams, who's, the deputy chief of staff for operations for dpr matt gender gingrich? Was there? Were people who live on 81st street jan from the from bulmas was represented peter? I was there linda? Was there she's also a board member friends of roosevelt park, and there was nothing planted here? It was just the way you see it, and friends also said that we would step up and to further make a buffered area. We would plant something like boxwood that would stretch the entire length in the front, which would happen. That happens to be really an excellent plant for a bioswale, much to everybody's amazement about two days later, suddenly that entire area was planted now you know a bioswale is a natural water, filtration system, and it depends on the roots of the plants. I have since spoken to matt, who was nice enough to call me and say that a mistake was made. Nobody quite knows. Maybe matt can speak to this a little bit more. Nobody quite knows what happened, but that the plants aren't set in stone that we can still potentially do the plants that we want to do, which would have made a nice green year-round, green evergreen hedge in the front of that area, and you know maybe they can move those other plants back or at the very least they can put them somewhere else. So could you please go to the last slide. So these are the trees that we had in mind. They're called emerald green arborvitae trees. They have a root system that grows straight down, rather than growing out will not impact on the garage. A question was raised by jan who sent me a long email afterwards, very thoughtful, very nice email and she expressed some concern that if the trees get too bushy that it might bother people who are sitting on the benches there and but we said it's not really an issue because with a hedge trimmer, we can easily take care of that and anyway. So this is our proposal there. When we left this was an extremely collegial meeting. I was thrilled and I think we were all really happy that the bull moose people and the people from parks and from 81st street and from the friends of roosevelt park all seemed to be on the same page that we all wanted to do something that could help bonnie had a few questions. She said that a little research would be done. Another meeting would be held, and so that's where we are right now and we'll really look forward to getting back to you. If you'll have us to tell you what's happening next, barbara initially, you had some weeks ago. It has to have us on the agenda for our support, and now I think you've said that this is informational, and I think we appreciate that. So we're not looking to do a resolution tonight. No, not at all, that's great. I want to ask you a couple questions, maybe just one or two and then do questions from others. My question is back. First of all, first of all, you haven't shown us a photo of boxwoods. I know what boxwoods look like and there are a lot of different varieties, but how tall do you happen to remember what type of boxwoods and how tall you'd anticipate there being in the bioswim? We had not researched boxwood, but we would find a variety that does not go over the fence or it would be kept trimmed so that it would not go over that fence and, as bonnie williams pointed out, something that we hadn't even thought of, and that is that by making a barrier so that dogs that are outside the dog run can't look into the dog run, it would also it would stop a lot of the barking. You know from dogs who want to get inside and you know, conflicts between them. So I don't know we just thought that was a win-win. I'm sorry, my question really. My other question goes back to probably your first or second slide of concerning planting the arborvitae all the way along the front of the fence along the wall. Are you anticipating any kind of tree pits or how would because that's the that's where this problematic gravel is- and I know that some of the people who use the dog run want to have it maintain its largest possible square footage for dog use? So what would these trees be sitting in? Would we lose any square footage with tree pits or anything like that? No I mean we'd probably have to remove the gravel and put soil in. I don't think you could plant them right in the gravel, that's there, but no you it, but it would be a wall of trees, but it would be right up against the back and again, like I said you know, this is looking looked in, is being looked into by numerous people who have a lot more expertise in this area than we do so I mean matt or peter, or somebody else may have other things to add about this right now. Okay! Well, let's go on to the questions elizabeth. It looks like the only other participant who's got a question or a comment is natasha, so go natasha hi! Thank you, barbara for the presentation. I was just it's not clear to me if, by planting all these, it's going to be like proven sound mitigation. Is that yeah? Oh absolutely. In fact, this particular variety of evergreen tree is used for just that reason for sound mitigation. Okay- and you didn't mention the museum being present at the meeting. Yes, they were exactly and they were all so fine with it. Zach campbell was at the meeting and zach's with us tonight. Isn't he yes? Okay, thank you. So that was, I think. Natasha was the only committee member with a commenter question. Let's turn to I know daniel atha again and but before we even turn to daniel atha does zach or matt or elaine representing the dog run, want to address this before we turn to the community sure. So I have some insight when we restart when you research what happens with the plantings in that area. I just have some advice that folks check with whitney tolcate and the architects from parks who originally designed dog, run my understanding of that area that has been suddenly mysteriously planted. I don't think it's a nefarious plot. I think that was actually part of the plan. That area is referred to now as a rain garden, which is that's a bioswale, a rain garden. Yes, so the plantings that are in there I mean just the question that I would ask is: are the proposed plants compatible with whatever that was? It was designed to have water-loving plants in it? So just probably someone should just check and make sure- and I also just want to validate- because it was just a question about removing gravel and putting tree pits. Barbara you're talking about the area between the dog run and the path right, not in the dog run behind the benches. Behind the benches is where we're talking so you're talking about planting things in the dog run, yes behind the benches right between the benches and the fence, so they look beautiful. But I'm just saying I think dogs are gonna pee on that. So we've already discussed that we don't really think it'll be an issue. I can. I just mention one thing: you know I built that bioswale or what you? What do you call it again, a rain garden on the corner of 76th street and columbus avenue in that streetscape block that the columbus avenue bid built about nine years ago, and we had it planted with native plants, most of them all of them actually perennial, and we have never ever had any kind of issue with it. So I am a huge advocate for rain gardens and the other thing is that, on the other side, up against the schoolyard fence between 76 and 77, there are these undulating tree beds and we planted large trees and again, mostly perennials, although every year they put in annuals and parks did not want to put any kind of barrier to protect it from dogs, and the fact is that I have seen numerous dogs peeing on these plants. In the beginning, I used to go over people, and I say oh listen, please don't do that, but I realized that you know I'm not there. All the time and the dogs are gonna pee, whether I'm there or not, and they have thrived those trees and those plants are gorgeous also this year. For the first time, the annuals are beautiful and I realize it's because it's the kids who trample those and not the dogs at all the kids aren't there this year. So all right. Thank you, barbara. Let's check in with zach if he wants to say anything matt if he wants to say anything, we've covered elaine and then back to daniel atha for a moment, zach anything from the museum thanks, clary I'll, be really brief. I just want to say first off a thanks to peter. You know: we've been going back and forth coordinating on this for a while and trying to work with the friends group and they've been very good to work with. In terms of some of the concerns that we raised, I think barbara nailed all three of them. Basically, we just want to make sure that whatever is planted is planted at a sufficient distance from the the wall and the foundation for the garage. It avoids any of the irrigation systems that are in the area, and it also takes into consideration that the space in between where the existing fence and the wall is sort of a peter's favorite term is a rat highway, though I don't know, if that's the technical term, it's an area where some of our exterminators bait heavily and we notice that when there is activity, that's a hot spot, so we wanted to make sure that access to that area was maintained. I think the only other thing that I would add is that if the proposal moves forward and working with parks, we would just want to make sure that our security group is involved in the next meeting, so that we can coordinate if the if the plantings are going in and ahead shape, to make sure that the line of sight is appropriate for for our security in the area. Thank you, zach matt. Did you want to add anything on this part of the discussion? Matt gammage. Do we still have math? I was trying to unmute myself, so you know this is just something that we're exploring with friends of theodore. Roosevelt on the dog run and it's something that we'll continue to meet and talk about. We want to make sure that all parties are on board. So we'll continue to explore this, and I would imagine before anything's done, we would present some sort of final plan to the community board, but I can't speak for friend the friends of I guess on that. Well, we'd be happy to have you back. If it turns out that everybody's totally in agreement, then maybe we don't? Maybe you don't need to come back, but we'd be happy to have you back so unless I'm missing something we just want daniel atha daniel. This is your second time up, so be concise. Okay, thank you sure barbara. I just wanted to congratulate you on the bioswale and the planting there in front of that school there at the thank you, the market, the flea market. That's there, those big trees are swamp, white oak trees, those are native to the new york city area, they're, fantastic trees. They survive the climate and the pollution in the city very well, and they also attract a lot of insects which will attract a lot of birds, so those are some of the trees that have crickets in them and also have cicadas. So if you enjoy hearing crickets and cicadas out in the countryside, when you go and visit out there, you can have that in the city too. If you plant more of the swamp white oaks in particular, they love those. So I'm very glad to see those there swamp. White oaks would not do in the dark. Shady wet place down there by the bull moose dog run. The arborvidi is a fantastic choice that is a native plant, so there are birds and insects and all kinds of diversity that's adapted to that species. So I congratulate you on the choice of the arbor vidi for that, on the other hand, the boxwood- I don't recommend you plant that it's a very finicky plant, it's not native to our area. It is very intolerant of salt, probably ammonia, which is contained in dog urine and for some reason, boxwoods they'll just up and die all of a sudden you'll have a hedge of boxwood. Three of them will be dead, they are very delicate plants, they don't do well in flooded locations, and they don't do that well in the shade. So some alternatives, I suggest, are wax myrtle they're, dense evergreen. They don't grow too big. They can be sheered and trimmed off at the top, and also juniper red cedar right difference. Virginia would be great choices. That'll give you a little more diversity, it'll be more interesting than just having a solid line of one particular species and those are all native. So thank you very much. That is fantastic. Thank you! So much yeah and clary, just as the co-chair of this community for at least a short amount of time. I just I just would like to you know, get a sense really quickly. These issues have been permeating and the dog run for the better part of my I've lived in the neighborhood for 25 years, my entire adult life, I'm 47.. I've lived here this dog run and the issues here have been going on forever and what I find so striking about this conversation tonight is that issues seem to still come up about it even after we thought we had a good plan for it. So what's really the issue- and I know originally, it was the noise and neighbors having an issue with the noise, I have to say, with the noise of all the things we're dealing with in this neighborhood right now. That is the least of my worries. I think, if we care about the environment, if we care about like fixing things and making things great maths, brought up some good suggestions on trees and whatever. Why didn't that happen sooner? Why was nobody thinking about this when we put in the plans, I have photos from you know from when I was there. You know I've been there several times over the last few weeks and it's like everyone wants a renovation of the renovation, but how can we stop renovations and actually get something done here? It is my question. That's all I ask, for I feel like we're. The parks and environment committee we want to get something done. We want to make it responsible both for the people who care about their noise issues, but also care about the dogs and the reality is the dogs, it's a dog run and let's make it a safe place for them too. That's all. Okay, barry and elizabeth peter wright has his hand up. I think he didn't see it, but in fact I'm not saying it. It's not a virtual hand. It is a physical hand, so I thought I'd mention it. Of course peter, and we hope you'll be the last word on this. I hope so. First of all, elizabeth, I know only one thing from what you said about the noise you'd only want 81st street. Neither do I a couple of just more facts, because barbara gathered this star, I live on 69th street, where there is a main egress into central park and there are dogs barking all the time, and I deal with it because that's part of living in this city, I'm sorry but sorry, peter. I am all right. I just want to say a few. A few specifics. First and answer elizabeth to you, because I I've been around the 20 years since the park renovation of the planetarium went up, and I think the answer to what you're saying is that this is the first time and barbara adler coordinated this all the stakeholders got together. I think that's the planning board 81st street, the friends, the museum anyway, two other specific observations in terms of the size of the dog run and how it would net down this dog run is 13 000 square feet and it is as large or larger than any other one I visited carl scherz, for example, is only six thousand feet. Second, observation is because we have too much history on this jan applebaum said. Is there an alternative, such as putting up noise, reducing panels in front of or on the garage wall? And there are two answers to that? It didn't come up tonight, but I want to bring it up number one 81st street hired some acoustical engineers 10 years ago. I have the information and their answer was. It doesn't work. Second, if you somehow say well what the heck? Let's do it zach? I think advised us that we'd have to go through landmarks. It would be a long, drawn-out tedious process, probably resulting in a no let's not have another word on panels. This committee spent so much time with so many people talking about panels at a time when peter is remembering we that was going nowhere, and I don't disagree with you- I mean I know what you're I mean. I've supported you on a number of things. I continue to support this effort. I want to do what's best for the neighborhood. I just see this as something that where we need to we're not taking a vote tonight, it's good to hear everyone's voices, but I don't see this as something that we will be able to make a resolution on tonight and nobody's asking us tonight. Elizabeth yeah, so, where we are, I think, is that on the first thing we were talking about the problems with the renovation. We hope people are talking about that in good faith. I really hope that the contractor can be held responsible for the wrong product, but it sounds like parks. Department may have allowed the change on this. It's great that everybody's talking to each other, if you guys come up to a point where everybody's in agreement you're welcome to come back. You're welcome to just tell us the good news I think totally. I totally agree with that. Okay, because we have spent so much of our lives. Talking about this dog run. I agree with elizabeth it's a sort of a lot of time on this dog. I remember the first time around too oh yeah, the first barber, the second, the third baron and barbara voted against it in 1998.. I have no recollection of that whatsoever, linda. Okay, no recollection all right! Thank you. Everybody on the jog run. Let's turn to our next item, and actually I don't have the agenda in front of me, but I think our next item was going to be generally and I think we can actually cut through it. A lot was going to be talking about in connection with our needing to do our district needs statement and without cindy with us tonight. I think this will be maybe even a lot more direct than it would have been. Otherwise, we are not going to be further advised by cindy tonight. She's done a fabulous job along with mark and her colleagues on the DNS, which none of the rest of us ever want to face, but we have to face it. So we have to do our district needs statement and they're really two parts of this and the format has changed over the last several years and not for the easier to do for the harder to do. One is there's this sort of general touchy-feely kind of document about all the things we care about in our neighborhood and our needs. That's been drafted from time to time and amended over the years, and a very good job was done over the years by mark and mel weimore and cindy and I'll get back to that in a moment, and then there is the aspect of which we have much historically has been a much bigger deal for this committee than other committees, which is our list of budget priorities, and in that regard, in the past we always worked with dpr every year and we had a meeting and we got their wish list and we had our wish list and we reconciled them best. We could and we ranked them- and that was a separate process until a year or two ago, when that all had to be folded into somewhat false or somewhat strange categories in the district needs statement. So on the second part, there's really nothing to talk about tonight, because thus far, we've not been able to arrange a consultation with the parks department. If we have to we're going to have to try to resurrect what our list was last year, what their list was last year, try to figure out which projects have gone forward and take another look at them. But there's really nothing to talk about that tonight. What we wanted to do tonight was well. I had a discussion with, and elizabeth was unable to join us, but had a discussion with mark and cindy a few weeks ago about the approach. The approach for our committee for the DNS is going to be to identify and just try tonight to just come up with some items that occur to us areas within our purview of parks and environment that have been impacted by Covid-19 and we're going to amend our or edit. Our district needs statement this year, primarily talking about the impacts of Covid-19 on the issues that concern us in this committee. So I'm going to name a couple of them that have occurred to me and look to other people to come up with some that occur to them now or maybe, and it's if others come to mind and we'll look to the community as well. If others come to mind later, we still have a little bit of time. We got a little bit of an extension for our committee, but not a long one from cindy and her well cindy was, and now whoever's mark who's chairman committee. Now I'm not sure we're going to have. I don't think it's fair to ask somebody to chair that committee yeah a month before all of this has to go in, so it's going to be yours truly, ah, as if you're not doing enough these days. Thank you mark for everything you do so we're just really looking for ideas here of ways in which Covid-19 has impacted our, as I said, our parks and environmental issues, and I'm just going to run down a list of some. I came up with and see if people have others and we can't put numbers on these, some of them can be turned into budget priorities for specific projects, but probably not for the most part, because the facts are changing every day. When you hear this list, you'll know that, like a month ago, three weeks ago, the situation was one thing and now there's sort of some programs are coming back and there's more money and then there's less money and it's very hard to keep track. So we can't talk in terms of dollars. We could talk in terms of impacts. Are you okay mark? So the first thing I have on my list is obviously overall budgeting and money for parks, sanitation and whatever other environmental, related city programs. There are city budget items. I don't think if we have some specifics, we can. We can talk about them, but these are moving targets and, as we'll hear later, from natasha who's become our maven on trash removal in our parks, the facts change every day the money changes who's doing it who's not doing it changes every day. We'll hear more about that. So, overall, obviously we talk about the impact of Covid-19 on the budget, the city budget, for programs I mean for programs in the park. I don't think we know yet at all what the impact is going to be on capital projects. Certainly we don't know for sure. Yet what the impact is going to be on capital projects that were already approved, such as the rotunda and the marina, going forward the capital projects that are further behind in the process. Big questions, we don't know the answers, but certainly on the expense side. We know we see, we observe cuts that have been very devastating, but the facts are changing every day. So that's my number. One observation is budget, and some of these overlap. Second observation that we've seen talked about in the press is more private cars on the street. It overlaps the big policy concern. We have in cb7 about fewer people taking the subway and the bus, that's more an issue for our transportation committee, but we've read, I think, all of us that they're more private cars on the streets and that leads to issues of concerns about pollution and concerns about well, that's a biggie, and maybe people in a moment can comment more on that next one I that kind of overlaps. It is a little bit on the other side of that is concerned about electric vehicles in the parks. We have an issue going on with revel, which is I'm not going to go into detail about that tonight, but which is started up again after a few people got killed and now they've got new procedures, but all some of us have seen rebels in the park. This is not just a Covid-19 issue, but Covid-19 has, I think, impacted it as more people are not taking public transportation and they're using primarily riverside park, but other routes as well to get where they're going, and we started seeing more and more electrified vehicles of various sorts in our parks competing with pedestrians on pedestrian paths before Covid-19 we're seeing more of them. The next issue I note is in our parks. Impacted by Covid-19 is the perception of crowding whether there are actually more people or not, but with some people wearing masks, as we should, and many people not wearing masks and people sitting on benches, not wearing masks and almost no runners wearing masks and some bicyclists not wearing masks. There's a sense. I think many of us have that the parks are less welcoming, more crowded, more stressful because of the mask issue, which is likely to be with us for a while. Then we have issues also largely in the parks is our purview, but also throughout the district from environmental point of view, which is garbage. Pickup natasha is going to talk more about that in our parks, but if there's less garbage pickup and we also have jake russell who's- a guest of ours tonight is going to talk about the individual block initiative that he started, which is great he'll, probably do that during the tasha session section. So the less you pick up the garbage the more you have concern about rats all around we're the environmental committee. We care about rats, another issue that is changing all the time. All of our composting programs, including street side composting, which was had been slated to expand, but instead it was completely eliminated during the worst of the copic crisis. The composting at deposit sites at the green markets were all stopped for budgetary reasons. Some of that is reversed. We, you know, can't put numbers on it changes every day, but it certainly had a an impact from Covid-19. That is by no means reversed. The last thing on my list and then I'll turn to others to make other suggestions is the plastic bag law got completely bollocksed up with Covid-19. Apparently, that's not the only thing that bollocks did up: it got bollocked up in litigation, and but there it was due to be enforced. Last March, it never was now there's an announcement it'll be enforced in a month, or so at least with warnings, but I think the experience many of us have at supermarkets is. They won't accept. Like somebody's email said this, the other day they won't, they won't put purchases groceries in the reusable bags that people bring. I know I've been receiving tons and tons and tons of new plastic bags at grocery stores, so that all partly at least as impacted by copic seems to have been a setback to that environmental issue. Anyway, that's what I've got so and ken if you didn't catch all that we can catch up with it tomorrow. I want to turn to others to see just on issues we can identify that have been in our parks and environment that have issues we deal with that have been impacted by kovic. I see natasha and natasha. The trash pickup will save for the next session of this, but can oh, I actually had a different comment. Oh okay, sure, actually it's just an add-on to things that you've already identified electric vehicles. I want to say that that's just that's not just an issue inside parks, it's an issue everywhere on the streets as well, and they go very fast and they're. They come in all sorts of shapes and sizes, and I think, as more and more people are avoiding public transportation. Instead of you know, buying an old-timey bike, people would prefer an electric bike or some sort of an electric vehicle. So you see them not just in parks but also in streets. So we should make a note of that and you already noted composting, but I would also add e-recycling to that electronic recycling, which has also just disappeared at least organic composting, has come back in some way shape or form, but not e-recycling, very good point natasha. I haven't followed that issue at all. Composting is not fully back and is certainly not moving forward, but yeah good point about e-recycling and clari. I would just jump in as the co-chair to say that we are the parks and environment committee and I think we need to be doing as much as possible related to the environment, and I think natasha has some good great points there and one of the additional things just on the on the vehicle piece that you know. We've talked a lot about and I think this committee several of us, are on both the transportation and the parks and environment committee. I do think that these new modes of mobility are things that require. You know are things that I have been a champion for. We put it in our district needs statement and our statement for the transportation committee a year ago, two years ago. I do think now that we know that they're on the roads we do need to have. You know that mentioned in our statement and making sure that things are. You know safe, green, clean and equitable are things that require. Oh, that sounds like me. I don't know somebody has. Let me let me interrupt. I'm sorry, somebody has our live stream up and there's a tape. There's a sound there's, a few second delay. So unless you want to hear this speech by me again, whoever that is, please mute. The live stream portion of what you've got up on your computer and then you'll only hear us once great. Okay, oh very nicely for the environment committee. We need to have make sure that, especially when it comes to transportation, which you know, I think you know we can differ on how we feel like mass transit is being served right now. I think many of us feel like that is the most green way to get people around. But in the absence of that, if there are these new modes, making sure that our committee weighs in and makes a statement about how they need to be safe, clean, green and equitable, and that to me is really important for our statement of what we say this year, because it's a very unique year. We hope so. Yes, thanks elizabeth the only hand other hand I see up is ken's right now, but we'll survey the list again just in case and then return to the community, ken okay, we've sort of skirted around a huge change, which is the dramatic increase in bicycling. Most of the vehicles going through the parks are not electric they're human-powered and this is happening nationwide. I was just reading that google announced that their searches for bike routes as opposed to pedestrian routes or car routes, are up 70 nationwide. So it's not just us, but it, but it's particularly dramatic in new york, where so many people are avoiding mass transit, and you know it's affecting cyclists in particular, because, unfortunately, we have a very substandard route between 72nd street and 81st street, which we've collectively called the rosenthal bypass, and there have been problems with it: they're very steep down hills. So it's very unfortunate that this is coinciding with a dramatic increase in bicycling and also south of that there's this terrible pinch point that if you don't ride a bike here, I don't know about it, but it has narrowed the bike path to half of its width and pedestrians and cyclists are sharing what was once the bike path and cyclists are literally going almost handlebar to handlebar passing each other, and I understand that's supposed to go away in a week or two, but it's been. It's been up now for a few months really with no signage warning. Cyclists are coming from what to expect and just on that point, while I'm on the subject, I'm I was going to propose a new business, and maybe I should just do it now that, regarding the rosenthal bypass that we, I would like us to ask the DOT whether that alternative bypass actually meets bike, lane and ADA requirements, because I understand that it doesn't. But I think we need to ask D.O.T whether it does officially. As a committee yeah, I mean I don't. Let's talk, why don't we talk to mark? I'm not saying we shouldn't, but I think we ought to talk to mark about the process on that. There may be a way to ask a question without having it be the committee that asked the question and it's also a transportation. Clearly, you know it's a joint concern. What well? I don't want to take away from your budget discussion, so I'll be glad to talk about that at the end, yeah, okay, so also I was at the end I'm going to mention some composting alternatives that I've discovered right. So I mean can we could do that under updates or if you want to just do that now, because we've mentioned composting well, you've got the you've, got the clean up thing: that's in the offing, so maybe you want to get to that sooner than later. Oh all, right, I'm not sure what you're suggesting mark sorry, I just I'm just mindful of the of it's now eight o'clock and I went on you have another agenda item that you want to spend some time on this overlaps with that. So all right! Well, let's then hold off and just for a moment then see if anybody else has any. I want to look at the attendees see if anybody's got their hand up. I think we lost a lot of attendees, maybe we're here for the last item. I don't see any attendees hands up, I'm going back to panelists, which is committee members and board members elizabeth. You see any other hands up. I don't so. I see you oh good, oh peter, I didn't see right, okay, peter arnson, hi, yes, peter, hey peter! How are you sorry? I did. I was just typing stuff in because I am gonna have to run. I just wanted to really quickly say in terms of long-term goals or on the budget priorities. I would really like to push for the organics to come back to residential areas to residential pickup. It's huge because it allows for meat and waste paper. That's been contaminated with food. It allows for oils and cooked foods which are not part of composting. I do the composting, but the organics was just, I think, a really key things key thing also in terms of controlling rats. It has been that was part of the reason that our area was designated as a target area was to try and control the rats. The other thing that has happened with transportation is pushing for a gas tax to support the mta, and I think that would be incredibly important. I think andrew alpert asked for like a two cent gas tax. I mean I have no problem with the two dollar gas tax, but that's my own thought on it and then. Lastly, support of regular volunteer work in the parks or with trees. We've been doing this tree stewarding and it's kept trees alive, and I just think that if that could spread to other parts of the city, I think it would be possible positive I've. What I've seen of the parks is that they're all heavily used and there's a desperate need, for you know getting people involved with spreading compo, not spreading, compost spreading, mulch or potentially even weeding, if there's somebody that could work closely with the volunteer groups and train them. So I don't know if that works for parks or not, but it would be something to explore people that works very well in riverside park and just well, I'm not sure how it works in central park. They have their own very, very robust, professional structure. What about in tr park are do. Are there volunteer, gardeners, barbara and peter? I don't think they have yeah before we do that. I just want to respond to peter peter arnstein on this, so I work in my day, job at the world economic forum and we're doing a lot on there's a trillion trees initiative that we're working on that is, a combination of federal state and local governments signing on and everything that you said is exactly what we're trying to do with cities across the world. So I mean we can't talk about this offline, but I feel like it's exactly a type of initiative we would. We would like to get you involved with so partly in my capacity as co-chair of the committee, but, more importantly, in the in my work at the forum, I think there could be some opportunities there. So thanks. Thank you, john. Of course you may I just wanted to note that the two cent per gallon gas tax recommendation was adopted by the community board and by the full board in July. So that's we've actually done that we're not just talking about it all and, of course, because we said so it'll happen right peter. I just wanted to follow up on. You said with what you said with one question, because I have to say: I'm not sure I grasped this or understood this before there's a difference between organics recycling and composting with organic organics recycling, taking oil and soiled paper. So what we had before was street side composting, not organics. Is that not right where we had or was it? Was it the broader organics that we had on boxes on some streets? We, the boxes, are allow for the whole range of things they allow for meat products and for paper plates paper, napkins oil. Those are some of the things that are out of the ordinary bones. You cannot take those to the the farmers markets right, the green mark. The green markets have been composting, but the street side boxes were a broader, organic. Okay, that's a news to me and very helpful to know. Okay, we do know that the organic rese that is composting has been restored to the green market at 97th and columbus is that where it is, but not anywhere, not any other green market in our in our district? Yes, so it that's it is that it elizabeth for comments anything on this any member of the committee or for that matter, the board, or for that matter, the public that, I think something I mean. I just want to remind everyone. This is climate week, it's climate week globally, climate week in new york, city and years past, we've done a ton of events across the city related to climate change and those are still going on virtually so check. The internet check everything that's going on, but that's it's really a priority of of a lot of us this week and just want to call attention to it as the parks and environment committee. So true, all right. Next item on our trash nav, our park trash maven natasha, who is trying to keep up with all the developments, he's going to talk a little bit about what is going on with trash in the parks and then we've got jake russell, I think, is his name with us who has started a fabulous program of volunteers on city blocks. Natasha tell us a little what you know sure so, actually before I do that, I did want to address a few things that were just brought up by elizabeth and also by peter talked about some volunteer efforts at in the parks like tree stewardship, and in my conversations with riverside park conservancy, I learned that they used to have these kinds of programs they're. You know all set and ready and geared up to have exactly three stewardship type volunteer programs. In fact they used to have such corporate events done, and they would make actually a lot of money from those they would also have church groups and school groups come in, but none of that they can do in the times of Covid-19 because they said that kind of work involves people getting very close to each other. A lot of volunteers who come have minimal experience in gardening. So they do need a lot more guidance. So they're not doing anything like that as yet, and then so far, at least and then elizabeth mentioned climate week- and I just wanted to let everybody know that this saturday is national public lands day, and I know that also because of riverside park conservancy because they are having a major cleanup day on saturday. So you can, I believe, still go to their website and sign up for it. Last saturday there was an event. It was called coastal cleanup that was a global event coordinated all across the world and in fact I went- and I volunteered on that during that event- and it was very well organized- it was very enjoyable. You know it was a very nice two hours in the morning spent out in the park, so I would highly recommend these kinds of events to anybody who wants to get some gentle exercise and also a nice time spending outdoors. So coming back to the agenda item. Basically, the genesis of this was that we received, I believe, at the community board, some complaints about riverside park, looking very neglected and trash ridden, and that kind of coincided with 3-1-1 complaints about trash in our green spaces. Actually doubling- and so sorry was nice enough to put me in touch with kristen mead, who is the volunteer coordinator at riverside park conservancy, because this issue started specifically with riverside park, and I had a conversation with her and you know a lot of what she told me was very sort of instinctual things that we've been discussing in over the summer in various meetings. The fact that parks usage has really increased a lot and the park's budget has gone down, has been slashed by 84 million, maybe even more. They used to get seasonal workers, but I think throughout the parks network that has those personnel have been cut by 45, at least at riverside park. Conservancy no overtime has been approved, so you know that's why the park was in the state that it was and add to that. You know the sorts of programming that they had, that they would usually do with their volunteers, like I said, required a very different setup. They it wasn't, you know, set up for the times of social distancing and mosque wearing at all. So one thing that she clarified for me was that riverside parks- conservancy is mainly responsible for landscaping, but it is the parks department that is responsible for trash collection and over the summer, for all, for due to budget slashing bin flipping within riverside park was cut down from three times a day to two or maybe even one time a day, and that's why these trash cans were overflowing and as a result of that, they decided to reach out to the public kind of, in a way that you know they hadn't really done before their plan was to their plan was to actually do a public outreach where they could get ideally people to come in three times a week during the week, preferably in the late afternoon. Time frame the rpc would hand them gloves and trash bags. They would go and collect whatever trash. They would see and then put those bags next to whatever trash cans they would see, and then the parks department would come and collect all that trash. So initially their idea was to get assistance in this form, but I spoke to kristin again today and she told me that they had actually kind of moved away from that approach, probably because she didn't say it, but my guess is that you know they would have to have you know already in this environment of personnel shortages. They would have to dedicate one person at some point in the park. You know for a couple of hours, handing out, masks and gloves and trash bags, and probably those personnel can you know their time can be served better elsewhere within the park. So at this point she said that they are looking for. They are still looking for citizen volunteers, but their outreach is now different where they want people to come in use their own gloves their own trash bags or whatever plastic bags or whatever you want to bring in with you and do your own trash collection and then just leave those bags next to any trash can within the park, and hopefully that will be collected. She thought that it would just make a huge difference. What she has seen in the last month, or so is actually kind of an outpouring of a citizen volunteership already where people are simply coming in, like people will walk their dogs, but then you know, have a trash, grabber and one hand and a plastic bag and a in another hand and then collect you know by the time they're done walking their dog. They would have collected a lot of trash and I asked her what it was and also what they're organizing now are these big events which they've organized in the past also, but they don't happen that often like the coastal cleanup. That was a global event. It happened on saturday, the national public lands day, which is happening this coming saturday about the group cleanups. She said that they're just about to start those now in very small groups, 10 to 15 people per group and they charge about a hundred dollars per group. For that- and she was actually saying very pleasantly surprised that that group effort is actually now sort of they've. It's actually completely booked out until I think October. She said that they do have it's easier to get spots on the weekdays rather than the weekends. So if people are interested for a hundred bucks, you know get like your friends together and go spend a few hours in the park cleaning up during the week, and I asked her and then there were a few other announcements that actually came out from the conservancy. Officially, for instance, they announced in early September that the green keepers from goddard riverside had been retained to help with cleanup. But this is a program that costs money. It costs 240 a day and they want to keep it going as long as they can, of course, but they are actively asking for donations, for you know of 240 dollars a day if anybody can make that they also. She also said that some other organizations, somebody called an organization called repair the world. They will probably I'm not sure if it's a done deal or not, but they will probably start working with them by the end of September to help with clean up there's. Another organization called trash hero that has volunteered with them in the past, but the last time I spoke to her, she wasn't able to get in touch with them. Everybody was out of town and you know in the end I asked her. What is it that you would like from cd7? What can we do for you and, apart from saying, to spread the word, she also said it would be really helpful to educate people on taking their trash out with them like not to even use the trash cans within the park, because they just get filled up very quickly. So whatever you bring in you just carry out, but I did ask her if there was any signage to this effect and she said no, there wasn't another thing that she said was that the park looks. You know the trash is a problem in all our parks and definitely throughout the entire throughout the entire riverside park. But she said that the problem is most dire between 120th and 150th street, where people come in to and so there's a lot more trash and probably different kind of trash that collects more over there. So a lot of their efforts are kind of cleanup. Efforts are kind of concentrated outside of our district. You know in the northern part of the park. They also announced their north park initiative. I think it was last week, which was also meant for obviously the northern part, but it included a lot of sanitation initiatives. For instance, they said that the goats will be back next year, not in part they've. It involves a lot more capital projects, also, but everything I believe, 120th street and above so you know. That was basically my what came out of my calls with her. So at this point, they're not really organizing any cleanups where individuals can go. You know and be supported by a riverside park in terms of gloves and garbage bags, but they're highly encouraging people and they've actually seen a significant uptick in people just arriving at the park with their own materials and collecting trash. As much as they can that's good news natasha because I mean I have to say, I still see a lot of trash, but let's see, if anybody are you done, because I think if anybody, I don't see any hands up with questions for natasha, but it's been a really helpful yeah. I know I also asked her. You know the mayor announced his cleanliness initiative. He had. It was a three-part plan that he announced last week. I asked her if she knew whether riverside park would be the beneficiary of anything like that. She wasn't aware of that, but one can hope and on a indirectly related topic. We were talking about composting and you mentioned the 97th street green market which we'll be collecting on fridays from 8 to 12 30. But what I also learned was that there's actually a pop-up organization. Actually I don't know. Oh it's called. I don't know what the name of the organization is, but every wednesday from 4 to 6 p.m. You can drop off your food scraps at west 107th street and columbus avenue near the city bike dock at the mobilization for community change garden. So I guess yeah, so we actually we put that on our on our social media for seven, because there, sadly is only one location that 107th street location right now. Hopefully there will be more, but we did flag that and put that out over the last couple of days. Yeah. In fact, when I said 97 was I incorrect was that is the green market. The 107th is the community okay, but the only official one has been the 107th and let's just move on just in the interest of time. Okay, when we get to it, okay, so the next thing then- and thank you natasha- that's really helpful. Keeping up with that question, yeah, of course, ken just for the minutes natasha. I didn't quite understand the groups of 10 to 15. People can come into the park and do cleanup, but they have to pay so she said that they're in the process of starting. It almost sounded like you know, they're piloting this program again, but only like 10 to 15 people, and it won't be. You know, I think she it's not clear whether it was for weeding and planting or whether it would be actually trash collection, but she said that they are for these kinds of groups. We are charging a hundred dollars. My impression my impression in the past was while dpr and actually we've got jeff martin here who can talk to us but who runs who manages riverside park, but my impression in the past was that dpr did trash cleanup, but these these special events, the charitable ones and others were things like the. If people know what the rip-rap means, the all the platinum and jetsam collect that collects itself along the edge of the river that the the events were more that than you know, yesterday's sandwich jeff just before we go on slightly, do you want to jeff martin, who is the manager of herbicide? But is there anything you want to add on this for us jeff? If he's here, he was here, I'm here, yeah you're always with us. Thank you. Okay. Can you hear me yeah, okay, good, so again, yeah there's a lot of challenges. You know all over the city with just basic things right now like like trash collecting and litter, pickup and and natasha's right, it's up to dpr to do the basic maintenance. The conservancy consists mostly of zone gardeners which do help because they do help throughout horticultural areas and maintain them, and when that happens, you know we find that there's a lot less garbage being deposited in portfolio areas. Whenever horticultural errors are left unkept you'll find that they become magnets for trash. So we're really happy that conservancy is there to help us with things, so it does contribute to helping keep the park clean and everything. So and yes to the point where we've had a decrease in personnel, we have not been able to hire any seasonals seasonal staff. This summer, all our seasonal positions were cut and we have less of what are called our pop workers, our parks, opportunity, workers. We've have been extending them. You know periodically, but I've lost a couple here and there I believe, I'm down to about 17 of them right now. I've had them for quite a while, and sometimes they have training days. They. Of course have days off, just like everybody else, sometimes they get sick so on any given day, I might not have much staff and every morning I have to go over with supervision. You know what are we going to do with staff today? Where can we place them? What looks you know like? It needs more attention, and so it's a challenge. I try to keep an eye on the parking as best I can, and you know I try to point out things that need to be picked up sooner than later, but we also have challenges with homelessness. We have challenges with graffiti art that needs to be taken care of as well. So all these things, plus, you know just more people in the parks. You know it's all true, it's it makes it more challenging to keep up with the regular basic needs of the parks. So looking around the city, I'd like to think that riverside park is actually a much cleaner park than many of the places you may see around the city if you travel around. So I think that's fortunate and I think it's nice- that the people on the upper west side are very good about trying to do the right thing about trying to use the trash cans about trying to take the litter with them about being responsible after picking up after their dogs, I'm very fortunate to have the good neighbors around the upper west side as community partners and to help keep roadside park clean. So you know it it's you know challenge you know we're trying our best we're constantly reallocating resources to keep up with things. So we do appreciate all the support from the community and we hope for continued support, and I just asked for patience a little bit of patience. Now the busy season is starting to wind down. Hopefully, maybe they'll see more indoor spaces being used if the phobia crisis starts to wane and that would certainly take a lot of pressure off the parks in general as spaces that most people congregate. So we'll see how it goes and, like I said, I'm proud of my parts workers. They really do work hard, I go around and they look some of them. Yes, some of them are not as hard working as others, but many of them do. I see most of them on task, picking up fearing graffiti doing all these things. So you know, I have to say, I'm very proud of my staff in general they're, the ones who make it a clean part jeff. I wanted to ask you a question that relates to a little bit to what you just said. You know everybody's been saying that our parks are so much more crowded because of covenant and attributing it to people wanting to get out and in the air, and they can't interact with people elsewhere. They can't interact at all, but it can't and can't you know it can't be in close indoor places and also that basically nobody's been able to go on vacation anywhere. They can't travel so, but do we really know I mean? Are there statistics? Does anybody count people do we really know that there have been more people in the park this summer and now that it's getting to be fall, or is that just something I mentioned earlier, which is you're so trying to stay away six feet away from everybody else and not get breathed on that? It seems more crowded. Well, I can tell you that, especially in the north part of the park west, harlem piers and in the area of 10 mile playground fort washington, I would say- there's definitely been a huge increase this summer in the amount of people using that area, not only on the weekends but on weeknights as well. So, even though that area is not within the confines of cb7, it's still part of riverside park and it still demands a lot of our attention. So, in terms of the areas around like the middle park, landscapes and all that it's hard to tell, I think, like areas like the south lawn by 72nd street seem to be pretty crowded these days in that area. A lot of people are sitting. A lot of people are using the basketball courts at neufeld, and since we've opened up the playgrounds, I've seen a lot of increased activity in there. No, I don't have anybody counting with the you know. I wish I had hard to do. Yeah it would be nice. I think the only thing that we might be able to divulge from that is cell phone. If you could somehow contract cell phones, that's something that if the cb7 committee possible, if you have the wherewithal to to track to get that data from cell phone companies yeah, you might see definitive proof that more people migrate to parks than before. But from one of our committee, one of our community members saying 10104, is definitely more crowded. Let's turn to the very patient, jake russell, who was going to tell us in just a few minutes about or take a few minutes to tell us about the trash program. Thank you jeff, but the trash program that he has initiated black. What's it called black by black or something like that? Jake? Are you still with us? Yes, I sure am. Can you hear me? Thank you. We can good deal. I think thanks jake, yes, absolutely yeah. It's called one block we got started about a month ago. The predominant ask for volunteers was that they volunteered to pick up trash on one block twice a week. So in the last month we're up to about 400 volunteers. We have 100 coverage from 70 to 96 from cpw to riverside wow, and we have about 25 coverage from 96 to 110.. We are focusing primarily north of 70th, just kind of stacking. On top of what lincoln bid is doing so that's been in place once we started gathering momentum, we've done four or five group cleanups this past weekend there was about 105 volunteers that went through riverside park. We started them in eight different groups, starting at 106th in groups of eight every five to seven blocks and then the new big pivot that you'll start to see this next week. Columbus avenue bid is currently doing this with a DOE fund between 70th and 83rd, where they have people go through bag. The trash cans at the corner place a new liner. We are doing that from 83rd to 96, on columbus, so just stacking on top of what they're doing and then we're doing that from 70th to 96 on broadway and amsterdam. So we have three full-time employees that will be starting in the next seven days through the ace program very similar to the DOE fund. They will be working between five and six days a week, we'll see what the demand is, and that first month has already been funded through the private donation of and cut bill, le name and we'll be looking to expand that program up to 110 as quickly as possible, but that is the kind of summation of it as it currently sits jake. What I just didn't quite get is because this is fabulous. What are your people doing between 83rd and 96th, and columbus and 70th and 96th and broadway? What is the? What is what do they do? Yes, we have three full-time paid employees through the ace program which is very similar to the DOE fund. They will be walking the sidewalks picking up any trash that they see and then, when they come upon a corner trash can they will be emptying that trash can into a trash bag, tying it off, setting it next to it, placing in a new trash bag and then the next time they come around to it. Once it reaches three quarters full, they will pull that trash bag, tie it and place a new one in so there should be no more overflowing trash cans on columbus, amsterdam, broadway 70 to 96 starting next week and clari. If I could just jump in, I was there two saturdays ago for what they did in what you all did in the corner of the museum of natural history on a first in columbus, and I think it's great, and there were so many people out there. We want to support. I think this effort and the fact that it's grown so much based on what you said jake is good, and I think we wanted to bring you in to have this conversation tonight to make sure that if there's anything, we could do as a community board to support you. We continue to do that. I know mark was there that night is that day as well? If he has anything to add, but you know again, I think we need to do this block by block and was great so thanks. I could jump in on that with that cue with thanks to elizabeth and a quick shout out to the stark brothers who used to be beacon, hardware who coordinated with jake so that they gave out supplies so that the volunteers that jake was so ably attracting had something to work with, as well as very sporty t-shirts. By the way, I'm envious. But I wanted to highlight one other thing that I took away from that morning, which was jake's emphasis with all of the volunteers that he attracted, and there were plenty. I mean this was a really inspiring turnout of folks about the way in which jay, jake and the and the organization was speaking to their fold and emphasizing the positive that they were going to leave politics at the door, leave dissension at the door. There's plenty that our folks are concerned about in our district, and this was not the forum for that. Jake was very clear, that this was a positive, progressive message and that they were putting it into action and as much as we need the streets cleaned up in the way in which jake's organization is now implementing. That we also need the positive aspect of what that contributes and how to contribute. So I'm grateful for both the work and the way the work is being done. If that makes sense, thanks for watching on the other side of it, though- and I completely agree with what both elizabeth and mark have said, but on the other side of it, picking up trash is a municipal should be a municipal obligation and should be reasonably handled under a municipal budget, and so this the need for this fantastic turnout. We weren't having great trash pickup before, but clearly the budget cuts with Covid-19 have so exacerbated it that this fits very much and that's why we've had the presentation tonight really fits very much into our district needs, a component about trash pickup and, in general, the loss of municipal funds that have, on the good side, led to a great deal of fantastic volunteer work, but that's not how a city should run its basic municipal services. Volunteers have had to step in and it's they've done a fabulous job, but in a way we hope it won't be permanent, at least won't have to be any other. Questions for jake has a question for jay yeah for the minutes jake. I agree with clary fantastic work, but this is what the city should be doing. What is the name of the group? Is one block? That's correct. It's one word. We just put the two words together: o n e b l o c k, one block. Okay, and what is your? Do you have a title with them founder yeah he's made it all happen. Jake has made it all happen, fantastic jake is it. I put the email address and the facebook and instagram links in the chat. So if you want to catch them yeah, is it formally organized as a I don't know whether it's 501c3 or whatever, that formally organized to take donations and deal with all that stuff? Yes, all that incorporation is in the works, it will take a couple of months, but that is in the works, and then you will see at the corners. We did a gofundme that paid for all the nice t-shirts, it also paid for 20 000 trash bags, and so you will begin to see those trash bags with the with the one block logo at the corners I did want to briefly see. I saw a comment about supervision, particularly of the paid workers, the budget that we have raised for that includes three paid workers plus their supervision, so that will be supervised work and then there is just another comment on riverside park. If someone wants to break that up into small geographic areas that has been what's worked with, one block is just asking people to take a very specific area. They find the area, that's important to them, that they're at all the time, and that's why the group grew so quickly. It was a very small, very specific ask: have you had it with regard to riverside park? Have you had any discussions with kristen or who natasha has been talking with about, because natasha has been a fabulous intermediary here, but it sounds like maybe you're talking directly to the riverside conservancy could be really helpful. Yes, yeah we had. We had some wonderful conversations with kristin. They were very busy this past weekend and so there's you know trying to balance all the needs of training, volunteers and also just getting the trash picked up. But yes, we've been in touch with them and we've been told that you know we definitely want extra help. Great okay. So the last thing, thank you so much jake, it's fabulous. The last thing we have always on our agenda is just updates on committee business and we've overlapped a lot of that already, but we do have some projects, particularly in riverside park, to talk about briefly and ken. You had a little more on one on some topic. Also, oh cherry walk, but something else yeah. Well, I had one other compost alternative on sundays, from 12 to 1 on west 90th street, between columbus and amsterdam, the the sidewalk outside of the community garden, the west side, community garden, they're, collecting, compost starting yesterday, compost, not organic right, yes, just food scraps and they asked me to spread the word. So I'm great we've done it updates ken. You want to talk about what we you learned by chance, because I don't think we learn directly from yeah, so the cherry walk is going to close September 28th, which I guess is monday, for they didn't say this in the press release. But I understand it's two to three weeks, which is a lot shorter than we'd, feared for to deal with the this is fema money sandy money to deal with the shoreline problems as a result of sandy riprap and such unfortunately they're not going to be doing the repaving or fixing some of the worst pumps on the cherry walk because it's a different pot of money, and I don't even think they have the money for that yet so they can't do it simultaneously, but they have to do this soon or they're, fearful they're going to lose the money, so they dpr is going to be putting signage up for the many hundreds and thousands of cyclists and e-vehicle users now for alternative routes. Riverside drive also they're, supposedly going to be directing people on paths through the park between 100th street and 125th, and so but the trade walk is not going to be usable, for at least two to three weeks could be a lot worse. I hope it does turn out to be just that long often, yes, predictions like that often are too optimistic, but we hope we hope yeah. I have a couple of others and other people may have others they're, actually a lot going on, but in case anybody missed it or just has a brief question. There were two important announcements from we got from steve simon. Actually they always want to tell us the good news, and so I sent this around- I forwarded, I think his email about a week or ten days ago, after so many years and ken and mark go all the way back with this. The work going on in the northern end of riverside south, which was the first section of the park to be built and over the years, developed a number of number of issues and with usage, it became clear that the area could be better deployed in some ways, so that work started and it started the 14th. I think I do ken do we know. Does it remarked? I don't think anybody told us how long it's expected to last and I could not get an answer on whether anything will be closed or detoured while it goes on, but in any event it you can see that it started and it is going to at that part of the park completely separate bikes and pedestrians until they get to the bottleneck at 72nd street. Nothing is fixing that, but that's good news that after so many years, that's finally going on, even if not as expansive or extensive work, as we were looking at a few years ago many years ago. The other thing is that phase five of riverside park south is scheduled to open what was the date somebody mark elizabeth or whoever September 30th. I think, and that's going to December 30th gonna, add lawns. It's going to add, I think, there's a new dog run, it's going to add a playground and there's a dog run the playground that is being renovated, the one that was there on 66 is being changed. It's a lot of improvements right and it's going to add a dedicated bike ramp from 66th street down to the bike path to the greenway, so that after and this has been years and years and years and years and years- and it's missing a very important element that we may never see, which was the comfort station and concession that was very essential. That was an essential component, but that was never bid and we don't know whether we'll ever see that, but still very good news. Other updates on. Let's see we on our last week, what about the the ball fields and the maybe since our last meeting- maybe I don't know if there's been any update there, but just at 72nd in the area again in riverside, where there's been a change in how people are looking at the or how the parks has opened playing fields right that has happened. Maybe jeff could address that. Certainly the basketball court, some, I think, jeff talked about it earlier in the playing fields and the baseball fields. I don't know jeff if you're still there. I think there is yeah. There's been some movement on that in the last over the summer. Well, they got reopened and they're very popular. This is our September meeting, so I know that this happened since July, so yeah jeff. I know there are some updates there. Well, the ball fields like all well, many of the ball fields are opened to the general public. As you know, we don't have any sports permits, but recently that did change. We now have youth leagues, the people advocated for opening the permits for youth leagues. So that's the case, so I did notice on my permit list like west side. Little league, I believe, is going to be using some of that space. So and I don't know what the progress right now is exactly with the rotunda project. It probably is being delayed until this winter or early next spring. So we'll see how that goes, but I'll check my permits, as I just got up an update today, but I didn't have a chance to really go over it in depth, but I know that the youth leagues are starting and we also have outdoor learning spaces in the parks but they're, mostly in the lawn, the passive areas, and that mostly up along the riverside right now for those outdoor learning spaces are those in any way formally established. Or is it just some school or a group comes and sits down and the schools have to put in the permits for them. So you may see outdoor learning environments in there. The schools are allowed to bring things with them to help facilitate the outdoor learning, but they're not allowed to store anything there, and so they have to take everything back with them at the end. Can you give us a couple of examples of schools that have in our district that have outdoor permitted outdoor learning spaces? I believe there's a montessori school, I'm not I'm. Sorry, I'm not familiar with all the schools in the area, but I think there's a montessori school. I think there's also a jewish school that has a permit for around there. I know that the space is being used around the islands like around like 114th 11th. The 111th panel is being used for these, so these are like the islands in the middle, but I have to check the permit list. I mean it's being it's being updated, constantly yeah, I'm definitely not trying to put you on the spot. I think at all. I think the one thing I was reading about was just the sort of a lot of people had reached out to us about the use of the space for soccer fields and other things, and it sounds like that has changed with the mayor and you guys are all on top of it and the conservancy and the parks department is on top of it. So just wanted to make sure if there was anything that needed, because we haven't met since sept since July. Just there was any change to that. A lot of parents and people have been asking about it. So thank you. Thank you for your patience with us as we've asked these questions and really appreciate it. That's fine! Yeah again, like I said, the sports. Youth leagues are the ones that are probably going to be occupying these spaces, especially right. Otherwise, if they're not there that other people can use them as long as they're abiding by the rules, that's fine. I constantly have to tell people still it's not a dog run that space by father a ton is, I have to tell people it's not a dog run. Yeah. There's a fellow there, who's whacking golf balls a lot and he's kind of like turfing it up. You know, I you know try to let these guys like no. This isn't like yeah trump golf course right. You know it's like it's like. You have to be patient, but I like I said I understand people. This is the place to go, so I'm trying to be as patient as I can, with everybody jeff and also matt. We I mean, I think, that's actually part of your job to be with us at our monthly meetings, but we very much appreciate it anyway and it's always. We learn a lot from both jeff and matt about things we want to know about. In our parks, jeff mentioned the rotunda project, which all of us on the committee know is a massive project. I have been trying to get a an update on it with a little bit of detail. So far I have not been able to connect, but I hope by next month we'll have a better handle, because there's a lot of a lot of impact that on the right on the on our district from that once it starts anything else tonight, susan schwartz, I've got two questions, one is big and one's really small. The big one is any update on the harlem mirror and the lock like when that's gonna happen or anything about it. I haven't heard anything new. Has anybody heard anything new since it was approved? No, I haven't heard anything new right. I mean. I think this was the last season for the concession. Anyway, I think the concession no the winter there was winter as if it were able to be opened, which I'm not you know, I'm not your source on that, but if it were able to be open, they would go through the winter season before the concession runs out. So when was it supposed to start the women's until the end of the contract, which would have so in effect, Covid-19 didn't really delay the project itself because they would have had to let the the the contract run out. It's just that the facility is not being used because of Covid-19, not because of the project. Yeah, it's definitely fallow, but is it supposed to start up in this? Will the construction start in the spring then at the earliest? I think is the answer to that question. Okay, I'll just your other question, susan. The other question is really minor, but there are two water fountains right at the very south side of the reservoir and that are just have been historically just not there at all, and I'm just wondering if there's any way, anybody knows why they're not functioning and how we could get them fixed. Well, we don't have a central park person here tonight, but susan, I put you and sent you in the direction the other day with a different question to caroline greenleaf: go ahead and ask her directly she's sure, that's okay, just say who you are and yeah you're right sure I think on behalf of yourself and not on behalf of the poor, that's true it might be more comfortable. We came from you cory or elizabeth. I mean it's part. The parks committee asking you know because I've put a number of 301 complaints about it and I've tried to talk to parks workers about. It seems like it's just sort of strange that it's such a way. Where are these fountains at the very south side of the next to the the pump house on the reservoir? Send me an email about that I'll dash off yeah. Mark really is that's great. It's a minor thing, but it's you know it's such an important spot and it is well trafficked yeah sure it's not minor. If you need a drink, I think we are indeed so. We've got no resolutions we'll be back together. The third week in the third monday in October, whatever that day, is the 19th. Thank you, everybody tonight for being with us special thanks to jake for hanging in there. So long for us appreciate it. Yes, thank you jake and everyone and look forward to working with you guys, jake look out because next thing you know somebody's going to try to recruit you for the community board, be careful yeah. I think I'm focused on picking up trash right, actually jake and I met a year ago talking about that very thing, and I think he found more gainful employment in the community. So, let's not fix the problem with that he's already. You know right and big thanks to jeff and matt. I know everybody else said it as well, but it's really great having you guys here, especially at the end when we're trying to catch up on things. So thanks so much totally agree. Thank you. Thanks mark for organizing all this bye, everyone bye everybody. I guess we're done.",
            "summary": "Since there are so few people on the call, I, don't know if we've opened it up to participants but for anyone I will be leaving this committee in the coming months.\nMany of you know, I'm running for Manhattan borough, president I'll leave it at that, but I feel like it's really important, to have sort of non-partisan leadership on our committees and in our leadership on the board.\nLooking forward to working with you all in hopefully, a different capacity in a year's time, but I will remain on the board, but there will be a new co-chair of this committee within a month or two so leaving it at that very good.\nWe will certainly miss cindy, but it means we've got all of our committee members on now and a couple of other board members and we have matt genrich, who is the park manager for a whole lot more than roosevelt park, but including roosevelt park?\nIt was my intention to come to a community board 7 meeting and thank you for all your support of the run and to have a big ribbon cutting, but Covid-19 19 seems to have postponed that so the issues with the run- You know this being a public amenity.\nI, think if we could wave a magic wand and have unlimited budget, there would be a bulldozer that would come in and scrape out all of these rice gravel pieces and put down something rounder like pea, gravel or something more proven like the brownstone screenings from riverside park.\nThere were also just a couple of other complaints that there are fewer benches now than there were prior to the renovation, and this has become an issue also with Covid-19 19 social distancing, that you know, people are kind of one person to a bench or one family to a bench, and there aren't enough of them.\nActually I wanted to bring up the issue that elaine herself brought up about people using the grassy area.\nThat elaine is highlighting, but frankly, even when during the pandemic, when park's usage was going up a lot and we didn't have this brand new dog run, I didn't see that grassy area being used as a dog run ever then.\nIt seems like there's a small dog's area right next to the garage within the bulmur's dog, run, and I see very few dogs, I'm wondering if elaine knows anything about that and also finally, I'd read this report, maybe last month that the dog run got flooded, and I was wondering.\nAnd, then I want to turn to matt to see if he can tell us anything about the lawn and enforcement on the lawn, but elaine Either people prefer the larger run.\nIf parks wants to go and close that firmly that might help, and then the second, not the main lawn, that's on 81st street, but that little lawn, that's just to the west of the dog run.\nDon't we hadn't really planned to spend this long on this part of this issue, but we want to air it, and then susan after that, 96 before when peter was we started working with friends, the dog run surface was dirt and the dogs were getting sick Department, we didn't have a budget.\nOnly the only other thing I wanted to mention was that we, somebody from 81st street, sent us a video of all the little dogs that are using the the grassy area.\nIt's you know, parks enforcement, does a lot of education and before they start issuing summonses out to people And, that's the reason I wanted to say something was because it seems to me that doing education when there's a very large sign in english, which is the prevalent language here, that says, law, enclosed.\nIs, I think, a lot of our problems stem from not taking the ecology of the site into account and in Manhattan square, which is what roosevelt park used to be called was put.\nThat's, not a great place to put a dog run, people like to be in the sunshine, especially in new york city, where we all live in canyons.\nIt would be wiser to think about the ecology of the site and how people are going to interact with that, and it probably would have been better to put native plants that, like to shade and that, like moisture to grow in that site, rather than trying to re-engineer nature, is to work with nature rather than against nature.\nIt was when cb7 actually had a resolution on the dog run where we were supportive of the renovation, but we urged that public money going into it be limited.\nNobody quite knows what happened, but that the plants aren't set in stone that we can still potentially do the plants that we want to do, which would have made a nice green, year-round, green evergreen hedge, in the front of that area- They're called emerald green arborvitae, trees.\nShe expressed some concern that if the trees get too bushy that it might bother people who are sitting on the benches there And, but we said it's not really an issue because, with a hedge trimmer, we can easily take care of that And I think we were all really happy that the bull moose people and the people from parks and from 81st street and from the friends of roosevelt park all seemed to be on the same page that we all wanted to do something that could help bonnie had a few questions.\nAre, you anticipating any kind of tree pits or how would because that's , know that some of the people who use the dog run want to have it maintain its largest possible square footage for dog use?\nLike I said you know, This is looking looked, in, is being looked into by numerous people who have a lot more expertise in this area than we do , I mean matt or peter, or somebody else may have other things to add about this right.\nSo you're talking about planting things in the dog run, yes, behind the benches right between the benches and the fence, so they look beautiful.\nI think the only other thing that I would add is that if the proposal moves forward and working with parks, we would just want to make sure that our security group is involved in the next meeting, so that we can coordinate if the if the plantings are going in and ahead shape, to make sure that the line of sight is appropriate for for our security in the area.\nI just wanted to congratulate you on the bioswale and the planting there in front of that school there at the thank Those big trees are swamp, white oak trees, those are native to the new york city, area, they're, fantastic trees.\nFirst of all, elizabeth, I, know only one thing from what you said about the noise you'd only want 81st, street.\nThe approach for our committee for the DNS is going to be to identify and just try tonight to just come up with some items that occur to us areas within our purview of parks and environment that have been impacted by Covid-19 Our district needs statement.\nI, don't think it's fair to ask somebody to chair that committee So we're just really looking for ideas here of ways in which Covid-19 has impacted our, as I said, our parks and environmental issues, and I'm just going to run down a list of some.\nYou hear this list, you'll know that, like a month ago, three weeks, ago, the situation was one thing And now, there's sort of some programs are coming back and there's more money.\nPeople are not taking public transportation and they're, using primarily riverside park, but other routes as well to get where they're going, and we started.\nWe need to have make sure that, especially when it comes to transportation, which you know, I, think you know we can differ on how we feel like mass transit is being served right, now.\nI think many of us feel like that is the most green way to get people around.\nSo, it's not just us, but it, but it's particularly dramatic in new york, where so many people are avoiding mass transit, and We have a very substandard route between 72nd street and 81st street, which we've collectively called the rosenthal bypass, and there have been problems with it It's very unfortunate that this is coinciding with a dramatic increase in bicycling and also south of that This terrible pinch point that if you don't ride a bike, here, I don't know about it, but it has narrowed the bike path to half of its width and pedestrians and cyclists are sharing what was once the bike path and cyclists are literally going almost handlebar to handlebar passing each other, and I understand that's supposed to go away in a week or two, but it's been.\nSeen of the parks is that they're all heavily used and there's a desperate need, for you know getting people involved with spreading compo , not spreading, compost, spreading, mulch or potentially even weeding.\nAnything on this any member of the committee or for that matter, the board, or for that matter, the public that The internet check everything that's going on, but that's It's really a priority of of a lot of us this week and just want to call attention to it as the parks and environment committee.\nChurch groups and school groups come in, but none of that they can do in the times of Covid-19 because they said that kind of work involves people getting very close to each other.\nThe genesis of this was that we received, I believe, at the community board, some complaints about riverside park, looking very neglected and trash ridden, and that kind of coincided with 3-1-1 complaints about trash in our green spaces.\nSo sorry was nice enough to put me in touch with kristen mead, who is the volunteer coordinator at riverside park conservancy, because this issue started specifically with riverside park, and I, had a conversation with her You know a lot of what she told me was very sort of instinctual things that we've been discussing in over the summer in various meetings.\nOf, in a way that you know they hadn't really done before their plan was to their plan, was to actually do a public outreach where they could get ideally people to come in three times a week during the week, preferably in the late afternoon.\nIn, like people will walk their dogs, but then you know, have a trash, grabber and one hand and a plastic bag and a in another hand and then collect you know by the time they're done walking their dog.\nIf people are interested for a hundred bucks, you know get like your friends together and go spend a few hours in the park.\nShe also said it would be really helpful to educate people on taking their trash out with them like not to even use the trash cans within the park, because they just get filled up very quickly.\nShe said that the problem is most dire between 120th and 150th street, where people come in to and so there's a lot more trash and probably different kind of trash that collects more over there.\nIt involves a lot more capital, projects, also, but everything I, believe, 120th street and above You, know and be supported by a riverside park in terms of gloves and garbage bags, but they're highly encouraging people and they've actually seen a significant uptick in people just arriving at the park with their own materials and collecting trash.\nSo looking around the city, I'd like to think that riverside park is actually a much cleaner park than many of the places you may see around the city.\nThat the people on the upper west side are very good about trying to do the right thing about trying to use the trash cans about trying to take the litter with them about being responsible after picking up after their dogs, I'm, very fortunate to have the good neighbors around the upper west side as community partners and to help keep roadside park clean.\nThink we wanted to bring you in to have this conversation tonight to make sure that if there's anything, we could do as a community board to support you.\nThe last thing we have always on our agenda is just updates on committee business and we've overlapped a lot of that already, but we do have some projects, particularly in riverside park, to talk about briefly and ken.\nThe work going on in the northern end of riverside south, which was the first section of the park to be built and over the years, developed a number of number of issues and with usage, it became clear that the area could be better deployed in some ways, so that work started and it started the 14th.\nMaybe I don't know if there's been any update, there, but just at 72nd in the area again in riverside, where there's been a change in how people are looking at the or how the parks has opened playing fields right that has happened."
        }
    }
}