{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCMYlXK0jyerVnc3dmz-vjCA",
            "title": "November 2020 CB8M YEL Committee Meeting",
            "publishDate": "2020-11-24",
            "shortDescription": "",
            "lengthSeconds": "1:10:30"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "qiEhbPgljnQ",
            "fillerWordCount": {
                "uh": 103,
                "um": 131
            },
            "readTimeFullTranscript": "44 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "students": 87,
                "school": 35,
                "hunter": 29,
                "faculty": 29,
                "program": 27,
                "education": 18,
                "day": 14,
                "college": 13,
                "opportunities": 13,
                "schools": 12
            },
            "wordCountSummary": {
                "students": 20,
                "school": 13,
                "hunter": 12,
                "college": 6,
                "faculty": 6,
                "day": 6,
                "education": 5,
                "internships": 5,
                "opportunities": 5,
                "student": 4
            },
            "fullTranscript": "We're close to starting time, I'm gonna, as is my excuse me, my habit. I'm gonna make a few introductory comments and allow people to show up, for you know the first minute or two after the session has formally started. I'm remembering that back when I was in college, no class started more than you know before seven minutes after the hours. So in this era of Covid-19 I guess with the advantages such as they are of being able to have online events, we can start more promptly than that. As I did say a moment ago. We are quite thrilled and excited to have you, professor Rabb, as our President of Hunter, as our guest speaker tonight and I do want to say, I mean we are, of course, very fortunate to have such a great public institution here in our community and, as I'm sure most of us know, it's very highly ranked both in terms of the quality of its academics and scholarship, but also- and I'm pleased to say this, because I discovered about 10:12 years ago. I'm really a teacher. I've been doing some college teaching in a variety of areas, and most of my teaching has been. In fact a portion of it was at the community school CUNY school professional studies was online and most of it was for first generation college students. So this field of you know college education, making opportunity available to our students from all you know all walks all communities. All backgrounds is both very important and very exciting to me and I'll just comment briefly. That of course, Hunter has a broad program in in the liberal arts and social studies and, of course, it's great school of social Work, and I'm going to mention, as I tend to do some things that are not directly germane. But my grandfather was actually a college, professor, a somewhat different field. He was a chaucer scholar, but my grandmother was a social worker and you know in the course of her years had spent time in that field and I mean I. Think we all know it's a hugely important field, and perhaps especially now in this era of Dovid, you know having skills not just in more analytic disciplines, but also in the arena of social work and understanding how we can support our students and our families and our community in having a more healthy environment and looking out for their social and emotional needs is hugely important. Having said that, Taina again I want to thank you for setting up this session and I want to turn it over to you. I am most thankful and excited for what you've done and for what we will experience. So please, it's all yours. Thank you. So much Peter and thank you. President Rob for joining us I did notice that our esteemed council, member Ben Kaylos, is on, and so I wanted to give him an opportunity to say a few words anywhere that Taina and Jennifer R is a place. I want to be by way of background I had the opportunity to work with Taina when she worked with Jennifer and I worked for Jonathan Bing, a former assembly member Jonathan Bing, and we had a good time and I learned a lot about precision and being effective from President Rabb. Also just a big fan of her for sending her daughter to the best high school in the city of New York, which are arguably it might be neck and neck with hunter's program, which he also runs. I want to thank Peter Patch for his leadership of the education committee. He was actually a participatory budgeting delegate. For me, he decided how to spend a lot of my money. He went around to every school in the neighborhood about what their needs were and I think he set aside 35,000 for about 10 schools that ended up going to laptops. Those laptops went home with kids when the pandemic started, and so, whereas, for the rest of the city, kids were scrambling, trying to get 300,000 laptops and there's still 60,000 kids, who still don't have it while we're learning remotely all the kids in our districts got to be whether or not they lived in the district and Peter actually made sure those laptops went to schools that didn't have kids who lived in the district. So thank you Peter, so you want to respond to that. No I just want to you know thank you for what you do in support of our community and I'm a bit of an addict around education and higher education. So I'm just thrilled to be a part of this and thrilled to do anything. I can to support you know our pre-k, our primary school students, middle school, high school and all the way up to college and beyond. Thank you and I see a lot of vips on this call, so I don't want to get in trouble by trying to acknowledge all of them. I just want to thank President Rav, because she she's got something. That's incredible and important, which is vision, and so we have a shortage of nurses. In our city we had a shortage of nurses going into phase one. We have a shortage of nurses going into wave two, and if we listened to President Trump, we would have a nursing school. We would have a nursing school that is educating. Students primarily of Color hunter, does a better job at it than almost anyone else. We've been changing what the racial inequality looks like in our city, and we would have been in a situation where we weren't struggling to open schools, because we didn't have nurses, and so we did get nurses to open our schools, they're contract nurses, these aren't like full-time jobs, and so what I will just mention to community board eight? Is we literally have a hole in the ground? It is one of the things that I am most unhappy about as council member that this is not something I was able to necessarily get done yet I hope to get it done. I'm hoping that the board would consider passing a resolution to say please fill the hole in the ground with a school for nurses as soon as possible, so that we have enough nurses in our city for our children, for this pandemic and the next and for our hospitals and this pandemic in the next and so happy to work with all of you and just I just want to thank our president ram for all of her leadership. Her vision and Abby Damski from my team is going to be sticking around to take notes, I'm going to hop to the next event, which might actually just be tucking in my daughter, and thank you all for what you do. Thank you so much Ben, I'm so I will turn it over in short order to President Rad, but I want to go over just a few housekeeping items. Thank you everyone for joining this evening and to those of you watching, live stream or that will watch the recording later just a few housekeeping items. Everyone other than the speakers are on mute after President Raab is done. Presenting and speaking I will open it up to Q&A. You can raise your hand virtually by going to the bottom of your screen and raising your hand or if you are joining us via phone, please now star nine to raise your hand, and we will call on you. We ask that you keep your questions and comments just on topic and then just to give a little bit of context, president Rob, and to everyone joining you know. We on this committee have spent a lot of time since the pandemic hit in the spring, having a lot of conversations about K-12 and early education through twelfth grade needs in the community, so talking to a lot of parents and students and teachers and representatives from the DOE about the realities of remote learning. The concerns that parents had in the community and I think you know really that's a priority and I, don't think we spent enough time really thinking about higher education, and so, as we talked about in the committee, we said you know who better than to have on you know than the president of the premier institution of higher education in our district and in our community, and so I'm going to turn it over to you. We're really excited to hear about just hunter updates in general, but really life in this Coba 19 world for hunters, students faculty, you know and administration. Thank you so much President. Well! Thank you so much for having me tonight. It's just a really it's an honor and it makes also life feel like normal, because we're back at a community board meeting and what's more important in the neighborhood congratulations to Russell on your new election. We look forward to working with you and thank you leader for all of your leadership and partnership over the years. Peter, thanks for shouting out to Taina Tai represents the hunter motto for which we're really proud, which is the care of the future, is mine, and we ask every student when they graduate whether going on to pre-med or social work, as you said, or work in business to take a part of their vision and their passion and remember to give back, because this premier, public institution gave them this priceless education at a price they can afford, and certainly Taina and all of her work and certainly on this community board, has done that Peter. You may you're interested in hire. Ed I know you have a business background. We have launched a new business certificate at Hunter College. One of our initiatives, which I think everyone this committee would relate to is that the we believe deeply and passionately in a liberal arts education. We give one of the finest in the state, but we also think it's important for students to have skills in which they can enter the job market. So we like to match a history or an english degree with a business certificate, so students can compete when they get out. So if you ever think you have some adjunct, teaching you'll give us a call, and we can talk. Tai asked me to talk a little bit about how a large, wonderful, urban educational institution has become a really vital remote institution, and this has not, of course, been without its challenges, as all of you have I'm sure, experienced in your own professions and personal lives, but we're really proud of what we've been able to accomplish and each time I have a meeting with students or faculty I. Ask the question: where's the silver lining. What have we learned? What can we apply from this really tragic time to help us do what we do better in the future, so March 11th, you all remember, was a day where you know just a few days before that the government officials were still saying we would not be ending face-to-face activities. We would not be going remote, March 11th, really with no warning. We get a phone call from the governor announces that all classes within a week will be online, so we had a challenge of taking 3,000 individual classes and moving them on to remote and then a few days after that challenge would be implemented. The entire state went on pause, so we first really looked and said: how can we take this commuting school, the school of 24,000 students and make them the best remote learners they could be? And the first thing really is something: ty just spoke about the address that the committee has been working on, which is this issue of a digital divide? This issue that, if you're going to learn remotely, you need the hardware and the software to be able to do so, and even just surveys that we had already done. 25 of our students said they didn't have their own computer, but even for the other 75. What they soon realized was that even when you have a computer, what is the bandwidth does? Is the cat? Does the camera work? What is the Wi-Fi in your building? Do you have to share that computer with your little brother, who also has to do his work for school? So what became a challenge was soon approaching a crisis, and we raised about 300,000 in both cash and in kind to immediately get computers out new laptops out to our students and then, of course, a big challenge. When you have a situation where you don't want encourage students to come on campus, so we mailed many of these, so we could get them to students soon. We started to buy Wi-Fi, boosters and other equipment, so students could continue to to learn. The second issue was you: have your computer you're beginning to learn, but the stress in your life is so intense. Our student body has almost everyone has one job. Some have two. Some have three: their parents are often in industries that were deeply affected by the economic shutdown. So we had very serious economic pressure on our students and began to raise money and gave out about a million dollars in different level grants to students just to help them pay rent, stay above board and move forward again. We also began to expand our food pantry, which had been on site. You don't want to encourage students to come on site, so we began to have a mobile food pantry and fine. We used our experts in geography, our Gis system, to say: where are the hubs of hunter students? Where could they walk 10:20 blocks and pick up a food basket pick up some technology and by then we were thinking. What else do they need? We found that our dance students needed bars, so they could do ballet exercises. We found that our music students needed electronic drums and keyboards, so they could practice at home. So we started to use these vans to distribute food and technology close to students, homes and we're really proud about how that worked, and then we moved all of the student advising online and I think you know. Peter mentioned some of the things that have worked. We've found now that this there's an intensity about the one-to-one on a remote session. Students are tending to show up on time, they're tending to show up more often we're doing mental health sessions online. We're doing more group counseling online and the students are showing up so we're hoping that this, while nothing really I think replaces one-to-one advising we feel like this is going to be a way to expand this student's support that we're going to be able to give when we're through this real challenge here. The second piece of the equation when we went remote quickly, was to support our faculty and I. Think this is a subject. That's not getting enough attention in the K212 space. You know Taina when you're talking about addressing that in the committee and also in the higher ed most of our faculty are used to what we call chalk and talk they're in front of a room they're walking around. They have a big personality to be a great lecturer. They write a little on the board. All of a sudden they're, now talking to a zoom screen and remote learning is not the same as online learning. You think through a class, you think what would be synchronous? What is asynchronous, how do you use materials now, these really heroic individuals overnight are told you need to deliver your content online. So we have really tried to meet them and support them, and we've really invested in the spring and a lot over this last summer to support their being the best remote teachers. They can be and there's a lot of professional development. There are tricks. There are ways to do things, there's better projection, there's equipment and just ways in which faculty have felt online learning becomes more effective. So we've tried to assess what works we tried to. You know, borrow the best practices and give our faculty the training and then for them also the hardware and the software that they need to succeed and we're not there yet there's a we still keep learning and all there's all sorts of new challenges. One of the issues that's using is really a challenge at higher Ed is how do you give tests now? How do you do assessment and there's certain faculty who feel very strongly against online proctoring? They feel that it really with students who and even look at our own screen right now. You think about a faculty member, giving a lecture those of you who we can see each other. We can connect, at least in our eyes. People don't have their cameras on, for whatever reason it's so much harder for a faculty member to teach to you know: 30 black squares, but sometimes students just can't put on a camera they're embarrassed about their home life. They don't have the privacy, they don't have the bandwidth in their computer if they turn their camera on, they lose the sound. So now we're going to bring on a proctoring system that relies on a camera. Is that right? Is that wrong? Our nursing and other faculty would say you have to do it because they're going to have a high stakes, nursing exam at the end of their academic career and, if they're not ready to take a single high-stake test, they're not going to be a nurse. So it's these are the things that you would not have expected, but continuing to support. We just made a change. Historically, we've had a child care center. That's only been available for our students. We just changed our charter, so they can accommodate faculty. We found that some faculty find it difficult to teach from home. So we have offices set up for them that are cleaned and are safe and have good technology where they can come on site and teach remotely from a room at hunter. So it's a little counterintuitive, but you know we set that up for our students, our faculty now and we've also offered them the child care. Notwithstanding. All of these challenges hunter had nine valedictorians in many nine valedictorians and they were the American Dream two came were not born in the Us one was in Turkey, the other was from India and five were first generation Americans from parents in Turkey, jewish refugees from Syria, Russia Pakistan and the Dominican Republic, and we like to tease the other two were from upstate New York, which is also sometimes almost considered a hunter, a foreign country. We had two of them won full rights and one was a loose scholar. I mean it's just that's the kind of thing that keeps you going you're in the middle of a pandemic, and you get this great news. Pivot on to summer tell an interesting story: I wrote a daily news, op-ed and basically said summer is for school and I. We asked every faculty member advisor to take this to heart. Think of it, our students were not going to get that perfect summer internship. They were waiting for, they weren't going to get that travel fellowship and if they did, they still couldn't travel. They couldn't study abroad, they weren't going to even get going to get a job and they weren't going to get that fun, just maybe relaxing counselor or lifeguard or babysitting job, because nobody was hiring anyone to do any kind of work. So we said you've got to go to school because that's what your job is right now stay in school move ahead. Take the class you need towards your degree. We had a 39 increase in undergraduate summer school this summer. It was so exhilarating to think that we had helped students do something towards their future and it we invested. We took a million dollars and we paid for almost every one of those students about half of their tuition, so we incentivized them, but it was well spent money to see these students moving ahead. Then we got to fall and CUNY announced we would be online again, but with a little more planning this time they said you have some flexibility. How do you want to approach this and I thought it was important to ask the students and faculty what kind of in-person connections were important and what made sense to push the envelope a little bit so the first people that absolutely said they needed to come back and remember only come back safely and we'll talk about that in a second were our bench scientists and within two or three months by September 47 investigators who have labs at hunter and at the Wild Cornell Belfor. Building where hunter you know, has a floor, we're back in their labs. They are, they have safety plans. Everything has to be approved. They have- probably you know, one-eighth of the graduate students and post-docs and very few undergraduates that they would have had crowded in their labs, but they are doing their science, and this has just been really extraordinary. Then we start to think about what could be taught and what should be taught when we knew the safest thing was to still stay remote, and there were three things that were important to the faculty and to the students to do some in-person learning. The first were the sciences, so chemistry biology, computer science all had lab classes, and you can see here. The students are in masks, they're six feet. Apart, every city every class had a safety plan. Everybody that enters any CUNY school must fill out an app that asks. If you take it, if you have a temperature who you've been contract, tracing information, whether you've traveled and unless you get a clearance, you can't come on campus. So the sciences again 92 percent of our classes are still remote, but those eight are meaningfully on campus and the students are deeply grateful. Second area of classes that were important to bring back were in the arts, and some of you may have visited our beautiful downtown Tribeca facility, where we've moved our Mfa and BFA in art, love for you to when we fully open to come down. We have extraordinary artists, there's an article in the times today about one of our great artists, Derek Fijord, who is just an amazing artist, an Mfa graduate and we have 121 studios there. 115 students have returned to their art studios again safely. They everybody has to fill out the form when they walk in every day. They have safety plans in their studios and faculty, as you can see here are coming. Everyone is very spaced apart, but here's a class where they're talking about a piece of art that a student has done and they're doing the critique, and they just you can't do that over a computer. So we've met we've done that and the third area takes place mostly at our Brookdale campus, and that is in nursing and in physical therapy and there's a two of our physical therapists. You can see them all. They have facials. They have masks, they just felt they. You and I went down to watch one of the classes, and you see you know some. Eight people pushing people in a wheelchair. Coming at you. They were training how to take someone out of a wheelchair and put them on a flat examining table. You can not teach that over the internet. You just can't teach it digitally. You can't teach how to take blood pressure. So these clinicians just said we know we're health professionals. We can do this safely. You need to trust us, so we have made it possible for them to teach their classes in person safely and I. Don't want to jinx anything and say knock on wood, but there have been no incidents of sickness. It's you know been, we've done a good job and we've been very fortunate. So that's what we did with classes and then we opened up certain spaces for students and again the general rule is please stay home but, as you know, with our population most often first generation serious financial challenges for so many of them, not living in apartments with a lot of space or privacy or quiet to study. And so every day we open two floors in the library and every day we have at least 100 students who come on campus to just use the library to take remote classes at hunter, because that's a safe space for them. So we thought it was important. We do it safely, as I said, but to give them space and they're very grateful, and we have some other students, also in our some of our special education classes, where students have to learn certain modeling behavior working with disabled students. So there's certain places where we really needed to have these on-site exercises. The other student spaces that we've opened we've had some music practice rooms open for our musicians. Next semester, we're talking about having some dance studios, where perhaps one student could practice. You know safely by themselves- and you know we it's it's very moving to me- that it will have students who will take the subway every day to come to hunter, because this is a place that she that they can focus and feel like they're, a student and finally, we reopened the dorms just at Brookdale, and we have about 200 students living in the dorms, we're hoping to have some financial support for others to join them next semester. Again, we and I'll show you a very quick little video I, challenged the students and said I'm very nervous about having you know a group of 20 year old students living in the dorms. You hear these terrible stories you read about you know: can you really? Will you really not get too close? Will you really not get too social? We know that's the fun of college, so Maha you can just show it's a very quick little story about how the students responded when I said you better, be safe, hey, Brook, Dale, my name is Raf and I'm the residence life. Commissioner, for this year we are living in some pretty crazy times, but we as a Brookdale community, are making the most out of these hard situations. For me, and for many of you, rookdale is more than a college. Dorm it's a home here are some things we can do to keep it. That way. Put your mask on at all times, outside your room and around campus always maintain six feet of distance at all times. Sanitize your hands at all times also make sure to take advantage of the sanitizing stations around campus, make sure to only enter your own room, to prevent the spread of possible infection, don't go to one another's rooms following these rules. Keep our campus safe and healthy, so I think they did that to prove make their point because I challenged. They said. If you're going to move back, we've got to be safe and we're very proud actually and now we're testing students as they leave for Thanksgiving. Most of our students won't go far, but we are doing a whole testing protocol. The. Finally, we opened our historic hunter campus schools, our K-12. We have invested real thought and analysis on how to do it safely. We determined that one of the best ways to reduce the density of a K-12 that was located in one building on 94th street was to give the 9th 10th 9th through 12th grades and most of the 11th and 12th are going remote. They have some activities but to move those 9 through 12 grades to our social work, building in east Harlem. That has allowed us to create much. You know less density in each one of the classes from K through eight. So, unlike so many of the public schools in the neighborhood, our k-6 students are going to school four days a week full days, many of you may have walked by you've, seen we were able, through parent support to rent tents, and we have our seventh and eighth grades going two days a week on campus. So we have you know this summer. Some students are still remote, but about 60 of our population comes to campus and the parents and the students were, it was just so moving to see them come back and how happy they were to be able to learn on site safely. So every desk is six feet away. Everybody wears a mask: there's sanitation stations, there's all sorts of checks on ventilation. Every room has a special air filtration system, so we have taken safety as a top priority, but it's very meaningful to have opened the school. We have closed now because of the board of Ed, but the wonderful Terry Rozen Deutsch who's with us today, who many of you know is helping us monitor the situation, and so we can all learn about when we can go back this, the parents there have very interestingly raised money and they are doing saliva testing and a very large percentage of the students are participating, and so far the last you know, weeks at four or five weeks since been effect. There's been no cases picked up in the tracing. So again, it's a big initiative, but we feel strongly that these students, particularly the young ones, that k through 6, really need the on-site connection. As I said, I always ask for silver linings and with all the ups and downs, we were really incredibly like just overjoyed and proud that a few weeks ago, U.S, News and world came out with their new rankings, and hunter College has moved up six places in the last year to 17 in the regional university north, which is our categories, and we are fifth among the top public schools in our region to do a sixth place jump in a year, as was particularly a crazy year like this, was pretty emotionally rewarding for us, I'm just so proud of our students and faculty that made that possible. Last week we founded that hunter was named number nine out of nearly 1500 schools on college net social Mobility index, which measures how students move up in economic ranks as they graduate and move on to their careers and how we help low-income students really make a difference to a couple. Few final points: one I really wanted to ask all of you to tune in and join us for programming that we're doing on a regular basis that we call hunter at home. You know, while we can't be on campus, we really want to send the wisdom, the knowledge just the pure enjoyment of our faculty out to the community. So some of the fact the programming is about the Covid-19 crisis and science and some of it. We just like to really tell the world the types of things that our faculty know. So we had a couple of programs on animal behavior, one where we zoomed elephants in from Thailand. We have a top one of the world's top scholars on the Beatles our world. Our class creative writing program contributed to talks by two authors, our art history program, and that has a number of people, including a program coming up right after Thanksgiving by the extraordinary Nary ward, one of the great african-american artists known for his big public sculptures. So we're going to put in the chat what we call hunt the on demand from hunter at home and we hope you'll check out some of the great hour, so programs that we've done with our faculty on their research and we'd love to get all of you to send us emails or lists and we'll send you information about upcoming programs. Then of course, this summer you know in the moments where we're really trying to catch our breath with Covid-19. We really had to have a deep reckoning as the rest of the country did on the issues of systemic racism after the murder of George Floyd, and we convened a task force to advance racial equity. We have about seven or eight tasks subcommittees very busy, looking at recruitment admission pipeline programs how to enhance our curriculum and also started a really interesting digital program, called speaking of justice, in which we have addressed issues of monuments of code, switching as pro the issues of protesting, and we engage a lot of our alums and our faculty, and we have breakout rooms after for conversation and again would love the community board to be engaged in these conversations, because we all have so much learning to do so. We are moving ahead, we're persevering, we're trying to be there for our students and our faculty and what is a difficult time and then I think. All of you know there is the overlaying challenge of the state budget. I. Think most of you know that, notwithstanding our title is City University of New York. We are a state-funded institution. The board of trustees usually passes a budget in June. There has been no CUNY budget this year, so for the first four or so months after the June deadline, we were giving 1:12 of our yearly allocation minus 20 and in the last four months we've been given that same amount of money month, you know money to cover four months: minus 20, so it is a very tight exercise for us. We are trying to do all we can to support our students to continue to raise money to do that, and we are just hoping that there will be federal support for the state that will allow CUNY to continue funding us more sufficiently. So that is, you know just another challenge late on top of what we're going through with the pandemic, but as I tell our students and faculty we're hunting purple we're going to move it through we're strong we're going to persevere and I'll end again with what I always love our silver linings. Notwithstanding all of what's going on, we just got in the last two days. Some really incredible news. We have I, think I know which side you have first Maha. Yes, so we have two young men who graduated a year ago, both of the Macaulay Hunter Honors program, who are were accepted into Yale Law school I. Think some of you may know Ed Friedman who's, an extraordinary advocate for disability rights, we're just the most eloquent spokesperson, has worked in the mayor's office in that area and safe who we you see in the Zaharian is a loose scholar, so he's currently in Indonesia and just another real commitment to public health. So it was really just exciting to hear this news and the week before we had two students who were named Schwartzman scholars- and this is a program started by Steve Schwarzman and who- and he commits to a paying for a year to live and get a master's degree in Chinwa University in China and Margarita Lavapitch, who you see, graduated in 2017 from hunter. She was born in Belarus, came to this country when she was 14, studied science and honors at Hunter College and was accepted to the Mount Sinai Medical School, where she's a third year student and then just was made a schwarzman scholar. She already has two patents and has started a company to for products to support retina health and she's, going to be an ophthalmologist and a true american gene story. Hassani Arnold, you see next to her graduated in 2019. He is an lbgt advocate. He is someone who did our flagship chinese program, so he is fluent in Mandarin spent a year already living in China and all and comes from a father, a single father who spent much of his life homeless. So he is the ultimate american dream story, and next to him is Nebras Ahmed who will graduate in June? Nebras is a Goldwater scholar, which is one of the really prestigious undergraduate science fellowship awards and Nebras has been, is an alternate for Schwartzman and we hope that he will also be accepted into the program. So just when you think the challenges are just deep and so challenging. You would hear these stories about these young men getting into Yale and these three wonderful people being at Schwartzman and alternates, and it just meets know that the hunter motto is moving on that we're caring for the future and that our students are going on to do great things so I just I. Thank you so much this opportunity to update you on the neighborhood higher ed I. Do hope that you will still keep thinking about our students for internships, even if they're, remote and I hope. All of you will think about our faculty expertise. I. Think it's not just boasting to say we have one of the best urban planning programs in the country. Our faculty are always available to help think through problems. Our school of education is, you know this is a focus of this community of this committee is trains one out of every 10 New York City public school teachers, so we would love to work with you on neighborhood problems, even in the remote context, so Ty Peter. Thank you so much for having me and thank you for all you do for our community. Thank you. So much. President rob it was enormously helpful, deeply, insightful and I. Imagine you all agree very inspiring, I think just so proud as an alum of the college. You know I've always said I. You know, for those of you that are getting to know me and me to the board. I I spent two years working at Hunter College after graduating from there and then I went on to Princeton University thanks in large part, due to President Rob's mentorship and I still believe that, after attending Princeton University, the smartest people I was ever surrounded by were at hunter College, just truly some of the most inspiring students, nimble and independent and and just go getters, and so I'm thrilled to hear that things are going well at hunter. If you have, you know, 10 minutes to answer a few questions, I can open up for Q&A like I mentioned. So time is a little limited. If you can raise your virtual hand or if you are on the phone, please star nine and we will call on you and our wonderful district manager will Breitball will unmute you. So we have a couple people who have raised their hands: Lindsay, Cormack and Rebecca Dan Gore after that great let's go with Lindsay hi. Thank you. President Rob, I'm a parent of a daughter who's in the third grade at Hunter, College, Elementary, School and I. Do not envy any of the administrators challenges of figuring out how to open when to close and this thing, but we ended up having our daughter leave. This goal for a year take a leave of absence because we really didn't have a lot of transparency on some of the decision making until like the day before school opened. So I wanted to know moving forward. Given that my understanding is, the union is outside of the DOE Union and the rules of the DOE, maybe don't apply to our building. What do you think would be different this coming spring or does it seem like it will stay the same in terms of the decision making that happened in the fall, so I think we're trying to get to continue Lindsay to learn from this situation. I think it's something we've all thrown into and we're continuing to think about. Refining and I think you could you'll. If you talk to parents, who've been sending their students, there have been changes and we're continuing to refine the health protocols and also the learning protocols, and so I can't answer your questions specifically, but I can tell you that we are committed to continuing to learn and I, and you do raise an interesting question. We do have a independence from the DOE over the years. We've often followed their model and we opened because the governor and the mayor said that public schools should be open, but we also opened because we believed in as I said, for students in that particularly the k-6. This contact is really important and you know I think you all know in this committee, in your average public school in this neighborhood, students that are in the k, through 5 space, have school one day a week, sometimes two, if they're lucky a lot of it density, whatever is happening in the public schools. We're really proud that we've been providing on-site four day a week. Work for our students is it is things perfect? No, but we like to continue to learn and hear from parents about how we can improve, but we would like to our goal is to try to stay open as we can and to continue to educate our students and hope that you and your family will return and consider returning. Thank you. President rabbit I think you got a thumbs up from our committee member Ramy, who is a high school student, say hi Romney and has been really helpful in giving his perspective as someone who's in school, but learning virtually Rebecca Dan Gore. If you could mute her, please hi. Thank you so much for coming. This has been super interesting. I'm glad to hear that the libraries are open a little bit for us study, tall type activities, but I've been a little concerned about undergraduate and graduate access to printed materials. I understand that the library is working hard to ensure they have access to online resources, but especially when you're in your kind of upperclassman years, those books can be an extremely unnecessary cost burden to have to find elsewhere and I was just curious. What if there are any ideas to kind of improve access, since they can't check them out? Well, we it's very interesting. We are also trying to work through that because, in the very beginning and I think it goes a little to Lindsay's point how things started. One way, we all keep learning to try to make sure that it's safe to allow students to check out books we haven't done. It's been advised against to do any kind of reserve for the reasons that are obvious. But if people need books we will get them the books as I know, faculty have come. Sometimes we can get them that day. Sometimes we will deliver them the next day, but I don't think we really solved the what would be the reserve textbook. So we are welcome to all ideas if students are finding that is an issue for them and they can't access material digitally things in the stacks we can. We will deliver we'll, send them to homes, we'll deliver them to the front desk, but that what would have been that Classic reserve book is not deemed safe right now. So I don't know. If you have a good suggestion for that, no I'll think I'll keep thinking on it because, of course, we can't just scan all the books and send it to all students. That's I'm pretty sure again, but there's a lot of copyright laws, but do keep letting us know because that again it's just it's a brave new world. There's so many things that these are first impression and we're all trying to learn and all ideas are welcome. You know in whatever creative way we can be yeah I think it's especially important for the non-required books, the kind of research book students turn to when they're writing papers, or these s et cetera, all right thanks so much I, think Trisha and then Elita, please hi, President, Rob I have two I. Think related questions mean I apologize if I missed this, but I'm curious if you could just clarify if you are providing any testing sites for your own students and faculty to get tested at for the virus beforehand or before they leave for Thanksgiving, and I'm also curious about your messaging, for presumably the students who go want to travel potentially out of state to be with their families for Thanksgiving. What's your policy and what is your messaging on when they return on how they should be quarantining or how or are you mandating testing if you could just talk a little bit more about those specifics and I'm sorry if I missed it before? No, it's a great it's a really good question. So one thing: that's interesting about a hunter that you don't have even in the Sunni in other schools is most of our students. We did a survey and a very small percentage were from out of town and we don't think most of them will actually be traveling out of town. So we are nonetheless, we are requiring all students who are in the living in the dorms now to be tested and we're testing on site. So we're just started that this is new for CUNY and we're ramping up. So it's a really great question and you know we thought it was something the chancellor decided really thought was important to do in the dorms. It's also been interesting, many of the other CUNY dorms, and it was advised that we've considered closing the dorms to your question. To not let people come back because of the concern of spread. I just felt that the students who have chosen to live in the dorm, not with Standing Covid-19 and the risks they did so because they need to be there. So we've decided we are keeping the dorms open, we're going to look at the tests. Those students come back and we are applying the quarantine rule that has been in effect by the governor that, if you've been out of state, you have to quarantine for two weeks when you get back, which is why I think most of our students are not going to leave the state so we're here, and we haven't decided that we're talking about what kind of testing we will require when students come back and that we'll have that about to announce that in the next day or so we're doing the testing before they leave we're doing looking at testing when they get back and we're encouraging not to leave the state, and we will require quarantine if they do and we're just really I think we'll I think from that little video. You can see the students themselves they're, taking this very seriously, which is we're really proud of them. Thank you we're just about out of time but Elita. If you want to have your final remarks or questions. Thank you mostly remarks. I did I'm just curious about quarantining in a dorm, though, and how that works when meals are generally taken, at least from when I was in college in a cafeteria I had a question about that, but I also really wanted to thank you for being here. I know how hard Taina worked on this program and to see someone from a premier academic institution, not just in our neighborhood but in the city and the state spend your evening with us is really remarkable and so important. So thank you. Well, it's! No! It's actually really completely. My honor! So tell me your question again: I, just just how quarantining and adorable so no it's really it's. So it's interesting because again it's you know the CUNY dorm, it's just a little less conventional, so our Brookdale dorm didn't have a meal service, but so students, you know often they have kitchens on each floor and so obviously that doesn't work in quarantine. So we have made a commitment if students had to quarantine, which was mostly anticipated, you moved in and you had according to before you got here. If you came from another state, but if you moved in and you were exposed to Covid-19, you would have to quarantine for two weeks and we have made a commitment with that. Seamless would deliver you two to three meals a day and that we would pay for it. So we're really hoping this doesn't happen, but we do have a plan in place that it would. That would be our situation, because exactly why you asked you know you can't go out nobody, so it would be delivered and we would pay- and it was you know, a little price ranges and things that we had worked out before we have isolation rooms. If someone did get sick and they need to be, they would be immediately isolated before they were transported to get care. So there was a very rigorous reopening before we could get CUNY approval to be able to open the door. So it was a lot of details, but the testing to the questions I was just asked is something that we just added for the thanksgiving and some came from the governor's guidance and we're just working that through now and we'll learn more. Thank you all right. Well, thank you. I apologize that we took so much of your time, president Rob, but thank you guys for joining us. Thank you. So much wonderful! Thank you! Everybody thank you for all. You do for the neighborhood really appreciate it bye. You have a great night. My thanks, I think she signed up for nonetheless, yeah I wanted to leave it to you to close off and well. I'm also interested in I mean to extend. There may be interest on the community board or within the community to look at how we can support hunter in one area in particular. Is this point that she made about? You know finding internships, whether they're, remote or on-site at a particular location, because one of the things that I've got particular attention on is how we improve the bridge say between our great institutions like hunter and help. People find you know, opportunities and work experience in what I poetically refer to as the real world. It's something I'm going to be looking at in contact. I, know, there's a point person hunter who is responsible for those programs, but I just want to open that to anybody in the community who may have thoughts or ideas about where the you know, opportunities like that might be available and to head off the question. Sorry Alita before everybody's, going to ask it for the last three summers in a row, we've had the honor in our board office of hosting a hunter college intern through the jfu program. So before anybody asks about it, yes we're doing our part. We love our hunter interns in our office and the jfu program. If you don't know about it, go check it out. It's one of the best, the folks that we've had from there are just all brilliant. So just had to give my little plug for our awesome interns that we've had. Oh, it's perfect thanks well, and it came up in another meeting about kids or maybe from Gal Brewer, not having internships leading to some potential conflicts and confrontations on the street and other incidents. And so we were posting something I know: Brian Correa among people, a board member was looking for opportunities and had some with someone that he was working with. So we could post at some point for people who both may have internship opportunities, which of course, are probably more difficult now, since there are no offices but but also for people who are looking for internship opportunities, yeah and I would just add. We talked about this at the last meeting and I'm working on really compiling a Google doc of local institutions that offer different unpaid internships, and so I should have that ready in the next few weeks, and then you know I think that could be working that living document that we could add on to, but starting with certain local institutions, I think that's great. Thank you so much yeah sure so. Peter I'll turn it over to you. I, don't know if you wanted to see. If folks had other questions. I know president is, you know, has signed off, but I didn't know if folks had other relevant questions for the committee, so I'll leave it to you to close absolutely. If anyone has questions or comments, you'd like to add one thing: I have oh Romney, please go ahead, yeah, so adding on to that I, don't know what month it was I believe it was our June meeting or may meeting I one of those meetings. It's in one of our minutes, but we discussed it was actually the primary secondary topic of one of our meetings was summer youth employment program and at the time of our meeting the summer, Youth employment program actually had been defunded as an effort to cut costs from the city and for it there was a there's, numerous reasons behind it and the primary one was cost secondary. One was the fact that there were no businesses that were able to even take anyone else because they couldn't even afford to hire their own employees and then, but thankfully, actually not long after that. We met about. We discussed this in one of our meetings. The summer youth employment program was refunded in part, I, don't think it was totally refunded, so get President. Gail Brewer has been doing a wonderful job with that. I myself would might have interned for her office and I would highly recommend anyone to apply. If you are a teenager, it's an excellent learning, experience and I, and just as a community board that I think that is very important, especially as youth and Ed Committee that are. You do need these opportunities in order to a get into schools such as hunter, but as well as get valuable working experience and career interest and what, while the we as a community board, are doing our part, there's always things that we can be doing more, such as encouraging youth to apply, because many youth don't understand how important internships are and that's part of the school's jobs. But it's also part of a community's job is to help our students out. So it's just my two cents there. Thank you. Robbie I, think that was more than two cents I, I'm buying it by three I won't say how high I'll go in terms of paying for it, but I'll definitely invest in what you're suggesting inside others to look at how they can do the same. Any other thoughts or comments actually I know someone here was actually a graduate may still be on the call, a graduate of the urban planning program. I, don't know if she'd be interested in making some comments about your experience and what doors, what kind of opportunities that open for you? It's Melanie. Would you like to make a comment? It's Melanie Bro yeah. They just unmuted me. Thank you, hey everybody! I'm Melanie Rowe I, full transparency, I'm Peter's niece, but yes, I'm a graduate of Hunter's urban planning and policy program, their graduate school program- and this was really lovely to hear you know obviously like as a as an alum, I'm like not tapped into like, what's happening day to day, but it's really lovely to hear that hunter is, you know, is really centering like student, and you know faculty safety and that's like really lovely to hear, but on you know the conversation of like internships and out you know after graduation opportunities or even like, while you're learning I work for a non-profit in the city that works on community development. So I'm definitely someone who's very interested in figuring out opportunities for to get. You know current students to do internships at my organization, but we're also a member organization that works with 80 plus community groups, grassroots organizations. You know, affordable housing, non-profit developers, all over the city who are constantly also looking for interns to help with their work. So you know definitely think of me and my organization as a resource. I'm gonna. Add I'm happy to like add my like contact information to the chat. It only goes to the host so I'll, but I'll send it and they can feel free to have connect me to folks who need it so yeah. So. Thank you, terrific. Thank you Melanie any other particular comments. I am in the process and we'll be speaking with. You know. Tyina, and you know other members of the community board about our December meeting. I in you know. Truth in advertising. I had not actually formally planned to have a session, because I thought things would be a little crazy by the week of Christmas. But what does occur to me and I'll just mention it in case against any interest, is perhaps a session focusing on the issue of career planning, career preparation in the past, actually working with with veterans in a variety of places. But one of it was a series of programs we put on at John Jay College, focusing on you know how you do go through issues around job search, put together a resume prepare for interviews all of those wonderful things, and if that would be of interest, it's certainly something that we could look at or present a somewhat brief program and then I discovered 10:12 years ago. I'm really a teacher when I'm teaching I always say things I shouldn't say so: I have to throw in something that I, probably shouldn't say, and so here's my favorite thing that I shouldn't say which is I. After college I went to business, school I went to a great business school on the West Coast called Stanford after that, I actually did some further graduate work and doctoral work at a school on the East, Coast called Harvard and, as you know, probably the typical business program is two years. Excuse me, but I now do something. I call my five-minute Mba. So as a portion of that I would be happy to present and the point I actually mean this fairly rigorously. It's only partly tongue-in-cheek that in five it usually runs more like 10 or 15 minutes to give anyone who's interested a sense of what the two-year program provides and a a framework for thinking about any activity you may have. It could be creating a project to make it happen. It could be a a non-profit, you know, or social enterprise you'd like to make happen. You know, or it could be, the next Google or Facebook you want to be. Captain gives you a framework to think about how to plan, for that put the logic together, and it's a starting point for that kind of conversation. Having said that, any other particular comments or issues or things people like to put on the table I want to. Thank you all for coming. I want to thank you again. Taina wonderful session and I mean I knew we had a gem. You know before she started speaking but as she spoke and what particularly grabs me, among other things, is not just the thoughtfulness of all the steps that she and the whole hunter team have put together to address and respond to these challenging times. But the wonderful success stories and I know it was just a few but highlighting those students, I had and looking up at what was going on in hunter I had seen that they had a Marshall fellow and a Rhodes scholar and I hadn't heard about this short-term program. But you know those things naturally are exciting. You know enlivening and certainly get my high level of interest I see Marco. Do you have a comment or question? I see your hand raised? Oh thank you. Peter I didn't know that no doubt well, I think my impression is on affordable. Housing is not to put people in a physical space. Affordable housing is to provide a physical space and to provide a means to go to the future, meaning that these people it has needs to have a help and education, especially to demonstrate that education is the base of for the future and I think this community. We should concentrate with so many teachers that we have in the community, or they can create some mentoring programs, especially for low-income families, and this is social justice by the way that to work directly with with these two developments that we have in homes and Isis and to see maybe create a mentorship program for those people that actually that educate them to see that the future for them is not to continue to live in those in those developments. The future for them is that is the ways to do better and to have other housing opportunities, like everybody else. So I think the committee should be oriented to bring those people, because that's a disparity, I'm gonna, give an example. I'm gonna use the example of the one fellow community member I was in the funerals of Michelle's husband and one of the remarks that one of the doctors said in the funeral said they never hear the F war from Michelle's, father, Michelle husband, I'm sorry, and that called me my attention, while in the poor communities the F war is more traditional and more prevalent, rather that in the Michelle's family, so who has more chance to succeed in life? Obviously, initial children's I'm trying to make my example very straightforward. So the point is if those minorities that have a big deficit in the language, I'm one of them by the way and the issue is cut them not only to level the education and the knowledge, but also to explain to them that affordable housing or to live in these developments is not the right thing. This just only the beginning. This is just only an emergency moment, so I think affordable housing, for my point of view, is more than to give a physical space is to give education to help them inventory is to give enough opportunities or jobs. It's all of that and education is the main idea. All of that and I think that's my comment. Thank you. I just want to briefly underscore that Marco. Thank you very much for you know making that suggestion I totally buy into that, and perhaps again as part of the a December session, we might look at how we can just you know in terms of both individual initiatives and possibly developing programs. I mean I actually, just as one example was putting together a program on career coaching and a program on entrepreneurship at the Lenox Hill neighborhood House, which went on for like four sessions and think about ways that we can do things like that to support and extend you know our array of experiences backgrounds and perhaps open some doors. You know for those in our neighborhood and and our neighborhood housing I think is something perhaps worth looking at Greg Morris come to. Think of that, please I see your hand up love to hear your comments. Yeah hi. Can you hear me at all yeah just very quickly. I just want to say thank you for referencing Isaac's, the Isaac's home development. On the executive director tomes and Peter, thank you for your presence at Isaacs Homes or at least the senior center to talk about that entrepreneurship component and the opportunities there to Marco's point I just want to make it known that there are lots of different ways in which our residents of Isaac's homes could use support and investment, coaching guidance at all age levels, so specific to the education in particular to the young adults who live in the development. There are lots of different ways that the Isaac center is invested in that and I look forward in 2021 to working with the community board to really support those residents, engage those residents and further to help them build their success. There's a tremendous amount of resilience, passion, focus, diligence and hard work in the community. There are disadvantages, so I look forward to working with the community board to address those disadvantages, overcome them and ensure that every resident of Isaac's homes is on a path to long-term success, especially the children of the Isaacs Homes development. Well, I just want to thank you for that. Coming Greg I know you've been doing that. You know ongoingly and exploring ways that we can collaborate participate, perhaps launch a new program, or even more than one new program to support, as you say, people at all ages, starting with young people in high school, helping them think about. You know, beginning to think about the issue of employment, career opportunities, mentorships internships and so on, and then the same thing for adults, continuing education and procedures love to have that conversation look forward to it. Any other quick comments. Having said that, I want to thank you all for participating I want to. Thank you again. It's been fabulous, really fabulous thanks. Everyone thanks will for all your help likewise, and thank you for your your intern will. Thank you for making that happen thanks. You all have a great night have a great thanksgiving and we will be in touch to have a session.",
            "summary": "And I do want to say, I mean we are, of course, very fortunate to have such a great public institution here in our community and, as I'm sure most of us know, it's very highly ranked both in terms of the quality of its academics and scholarship, but also.\nIn fact a portion of it was at the community school CUNY school professional studies was online and most of it was for first generation college students.\nSo, this field of you know: college education, making opportunity available to our students from all.\nAnd, of course, it's great school of social Work, and I'm, going to mention, as I tend to do some things that are not directly germane.\nAnd, perhaps especially now in this era of Dovid, You know having skills not just in more analytic disciplines, but also in the arena of social work and understanding how we can support our students and our families and our community in having a more healthy environment and looking out for their social and emotional needs is hugely important.\nI can to support you know our pre-k, our primary school students, middle school, high school and all the way up to college and beyond.\nWe on this committee have spent a lot of time since the pandemic hit in the spring, having a lot of conversations about K-12 and early education through twelfth grade needs in the community, So talking to a lot of parents and students and teachers and representatives from the DOE about the realities of remote, learning.\nWe're, really excited to hear about just hunter updates in general, but really life in this Coba 19 world for hunters, students faculty, you know and administration.\nPeter, thanks for shouting out to Taina Tai represents the hunter motto for which we're really proud, which is the care of the future, is mine, and we ask every student when they graduate, whether going on to pre-med or social work, as you said, or work in business, to take a part of their vision and their passion and remember to give back, because this premier, public institution gave them this priceless education at a price they can afford, and certainly Taina and all of her work and certainly on this community board, has done that Peter.\nWe give one of the finest in the state, but we also think it's important for students to have skills in which they can enter the job.\nWe started to use these vans to distribute food and technology close to students, homes and we're really proud about how that worked, and then we moved all of the student advising online.\nWe start to think about what could be taught and what should be taught when we knew the safest thing was to still stay remote, and there were three things that were important to the faculty and to the students to do some.\nSo every day we open two floors in the library and every day we have at least 100 students who come on campus to just use the library to take remote classes at hunter, because that's a safe space for them.\nI, challenged the students and said I'm very nervous about having you know a group of 20 year old students living in the dorms.\nWe know that's the fun of college, so Maha you can just show it's a very quick little story about how the students responded.\nAs I, said, I, always ask for silver linings and with all the ups and downs, we were really incredibly like just overjoyed and proud that a few weeks, ago, U.S, News and world came out with their new rankings, and hunter College has moved up six places in the last year to 17 in the regional university north, which is our categories, and we are fifth among the top public schools in our region to do a sixth place jump in a year, as was particularly a crazy year, like this, was pretty emotionally rewarding for us.\nOne I really wanted to ask all of you to tune in and join us for programming that we're doing on a regular basis that we call hunter at home, You know, While we can't be on campus, we really want to send the wisdom, the knowledge just the pure enjoyment of our faculty out to the community.\nWe have about seven or eight tasks, subcommittees very busy, Looking at recruitment admission pipeline programs how to enhance our curriculum and also started a really interesting digital program, called speaking of justice, in which we have addressed issues of monuments, of code, switching as pro the issues of protesting, and we engage a lot of our alums and our faculty, and we have breakout rooms after for conversation and again would love the community board to be engaged in these conversations, because we all have so much learning to do.\nYou know just another challenge late on top of what we're going through with the pandemic, but as I tell our students and faculty.\nYou would hear these stories about these young men getting into Yale and these three wonderful people being at Schwartzman and alternates, and it just meets know that the hunter motto is moving on that we're caring for the future and that our students are going on to do great things, So I, just I.\nDo hope that you will still keep thinking about our students for internships, Even if they're, remote and.\nOur school of education is, You know this is a focus of this community of this committee is trains one out of every 10 New York City public school teachers, So we would love to work with you on neighborhood problems, even in the remote context, so.\nI spent two years working at Hunter College after graduating from there.\nLike I mentioned, President, Rob, I'm, a parent of a daughter who's in the third grade at Hunter, College, Elementary, School and I.\nThis goal for a year take a leave of absence because we really didn't have a lot of transparency on some of the decision making until like the day before school, opened.\nYou know I think you all know in this committee, in your average public school in this neighborhood, students that are in the k, through 5 space, have school one day, a week, sometimes two, If they're lucky.\nBut we would like to our goal is to try to stay open as we can and to continue to educate our students and hope that you and your family will return and consider.\nI think you got a thumbs up from our committee member Ramy, who is a high school student.\nI did I'm just curious about quarantining in a dorm, though, and how that works when meals are generally taken, at least from when I was in college in a cafeteria I had a question about that, but I also really wanted to thank you for being here.\nI know how hard Taina worked on this program and to see someone from a premier academic institution, not just in our neighborhood but in the city and the state spend your evening with us- is really remarkable and so important.\nThere may be interest on the community board or within the community to look at how we can support hunter in one area in particular, You know finding internships, whether they're, remote or on-site at a particular location, because one of the things that I've got particular attention on is how we improve the bridge say between our great institutions like hunter and help.\nI, know, there's a point person hunter who is responsible for those programs, but I just want to open that to anybody in the community who may have thoughts or ideas about where the you know, opportunities like that might be available and to head off the question.\nSorry Alita before everybody's, going to ask it for the last three summers: in a row, we've had the honor in our board office of hosting a hunter college intern through the jfu program.\nSo we were posting something I, know, Brian Correa among people, a board member was looking for opportunities and had some with someone that he was working.\nSo I should have that ready in the next few weeks, and then you know, I think that could be working, that living document that we could add on to, but starting with certain local institutions.\nYou are a teenager, it's an excellent learning, experience and I, and just as a community board that I think that is very important, especially as youth and Ed Committee.\nYou do need these opportunities in order to a get into schools such as hunter, but as well as get valuable working experience and career interest and what, while the we as a community board, are doing our part, there's, always things that we can be doing more, such as encouraging youth to apply, because many youth don't understand how important internships are and that's part of the school's jobs.\nWhat's happening day to day, but it's really lovely to hear that hunter is, you know, is really centering like student, and you know faculty safety.\nOut you know after graduation opportunities or even like, while you're learning I work for a non-profit in the city that works on community development, So I'm.\nYou, know current students to do internships at my organization, but we're also a member organization that works with 80 plus community groups, grassroots organizations, You know, affordable, housing, non-profit developers, all over the city, who are constantly also looking for interns to help with their work.\nBut, the wonderful success stories and I know it was just a few but highlighting those students, I had and looking up at what was going on in hunter.\nWe should concentrate with so many teachers that we have in the community, or they can create some mentoring programs, especially for low-income families, and this is social justice by the way that to work directly with with these two developments that we have in homes and Isis and to see maybe create a mentorship program for those people that actually that educate them to see that the future for them is not to continue to live in those in those developments.\nYou know, beginning to think about the issue of employment, career, opportunities, mentorships, internships and so on, and then the same thing for adults, continuing education and procedures."
        }
    }
}