{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB10",
            "channelId": "https://www.youtube.com/channel/UCXIJgqnII2ZOINSWNOGFThA",
            "title": "Community Board 10 Police and Public Safety Committee Meeting",
            "publishDate": "2020-11-13",
            "shortDescription": "",
            "lengthSeconds": "0:39:50"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB10",
            "normalizedName": "Brooklyn Community Board 10",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "QmT_UnDwn34",
            "fillerWordCount": {
                "uh": 80,
                "um": 88
            },
            "readTimeFullTranscript": "26 min read",
            "readTimeSummary": "4 min read",
            "wordCountFullTranscript": {
                "restaurant": 23,
                "music": 20,
                "bar": 19,
                "bikes": 15,
                "owner": 12,
                "bike": 12,
                "e": 11,
                "liquor": 9,
                "premises": 9,
                "food": 9
            },
            "wordCountSummary": {
                "premises": 6,
                "restaurant": 6,
                "stipulations": 5,
                "owner": 4,
                "bar": 4,
                "bikes": 4,
                "food": 3,
                "level": 3,
                "bicycles": 3,
                "state": 3
            },
            "fullTranscript": "Okay, we are live now streaming on YouTube, so Madam chair. You want to open up the meeting. Yes I do by saying thank you to everyone for coming to be with us this evening. Still under lockdown, you know stay safe, I wish I could be with you all, but not for us not for now tonight we have two restaurants asking for liquor licenses and then a a report from our 6a precinct also with us right now is Matilda frances, our Assemblywoman Matilda. Are you just joining us to say hello and to watch or you want to say something: oh I wanted to attend for as long as I can I have a number of meetings tonight all happening at seven. So that's my luck tonight, but I certainly wanted to stop by and see greet everybody and just say thank you for the work that you're doing I had a really great meeting with the 6-8. Recently, I'm happy to see some of the offices there looking good and we had a really informative meeting and I just want to keep my ears open. I have some staffers on the call as well. I see my legislative director jake goldfinger is here. We want to just make sure that we know what's happening in the community and keep our ears open to know what we can do with some of the issues going on. Okay, great, thank you. So much so with that. I will begin with the first store or establishment on the agenda, and it is a request for alteration of certification for liquor: beer, wine and cider for Sam's bakery llc doing business now, I. Have it as townhouse lounge. Is it town house it's Townhouse 275, that's the working name, but the official name on the liquor licenses: Townhouse, Lounge! Okay, that's the way it'll stay for me, okay, so this is an alteration of an application of the lounge located on 93rd street. The owner ziyati who's right here is taking over. The adjacent, did I touch something I think you know no I did. I'm I was trying to share my screen and I'm having a little bit of difficulty. Very lovely background, though. Thank you, sorry go ahead here. I am now too bad. No, I'm not going to have to rejoin I. Think. Can you hear me? Oh yeah, we still see you can see and hear you I have the open, zoom meeting screen there we go okay, so the owner, Robert Ziati, who is here with us tonight, is taking over the adjacent premises, formerly known as Kimchi restaurant, on the corner of Third Avenue, it's located on 93, 9324, Third, Avenue and thus creating one large establishment. This application has the certificate of occupancy a menu and photos were provided. There will be no use of outdoor dining and they will only be background recorded music and occasional live jazz music. There is no adverse history associated with this owner. So I open this right now to the committee for any questions that we can ask Mr Robert Zioni. As you can see him here, any questions Judith is trying to talk, but I think she's, muted yeah. Can you unmute Judith Judy you're muted, hold on Barbara. Could I ask a question while Judith is working on her audio? You said that we do not have any adverse history for this location. Does the owner plan on having any type of music, because that's usually problematic when there's music, and especially with amplified music I, just read that he will only have background recorded music and occasional live jazz music, as he had before, so the if I may, the the corner, which is going to be a restaurant, is going to have no it's going to probably have no music, so there's music in the bar. What this is this is not so much about the bar itself. The bar just plays recorded music overhead whoa. Okay, the bar has recorded music playing overhead in the bar, but the restaurant is just I, do not I, do not I mean I, do not know quite yet, but if anything it would have either similar or none so I do not think there's going to be like we're not going to play like live music in there and we're not going to play any more music than would be would be at the bar. As you can see, the picture of the bars in the back and the corner is what was kimchi and so yeah that that's going to be just a full-fledged restaurant. That's not going to involve any in any of the stuff that the bar does now it. Let me speak to it's. It is going to be one entity, that's going to essentially be working and owning both places. I'm not re! I'm not like blowing out the wall like the whole wall and combining it making one piece I'm going to be blowing, I'm going to be putting as you can see, on the screen on the top. In the back of the kitchen, I'm going to be putting like a little hole in the wall like a window so that we can put food to the back and drinks to the front. That's all I'm doing to come quote unquote, combine the spaces. If some of you do not know that Kimchi in the middle of Covid-19 closed after being there almost 20 years, 19 and a half years and I mean God bless them. They did not miss rent one month in 20 years, and you know it was God bless them. They were great people really great family and I just told them. You know, look just leave everything the way it is. Let give me a couple months to figure it out. Let me in the bank figure it out and they did and that's where we were at now and you know honestly people came and tried to take advantage a little bit of the whole Covid-19 situation asking for like half the rent. You know trying to get bargain deals, trying to get this trying to get that no one's taking away my nine thousand dollar mortgage so I could not I. Could that just did not sit well with me and I just financially could not do it so I kind of bit the bullet and I said you know what I never have the opportunity to do this 20 years, I'm under somebody else's lease and my wife and I sat and thought long and hard and said you know what let's give it a shot? Let's do it. Let's combine it with the bar it'll, bring some more business to the bar, that's off the avenue and you know give it a cuisine that does not really exist in the neighborhood and as far as we're concerned as a primary cuisine, and you know that it gives us the best chance to be successful rather than just accepting rent every month. You know and it's our building, I'm the building owner by the way, I'm not just renting right. So that's a big deal by the way. I would never open a restaurant unless I either had a previously existing, successful business or I own the building, so I would not be a renter personally, so it worked out. So we have this one opportunity to do it and that's what we're doing so and the other thing I wanted to mention. You said there won't be any outdoor seating. We are fully going to be taking advantage of the outdoor, dining New, York, City, Nightlife thing right, probably not and in the short term, probably next year, but honestly if they did not make the outdoor permanent I do not think I would have done this. It's the Covid-19 is too, you know it's too much of a moving target, and you know I have no problem investing money and it's a lot of money by the way, I'm sure if anybody's ever opened up a restaurant you'll know it we're putting a lot of money into this, and if I did not have that ability, I probably would not have done this. So I will be using the sidewalk and street capabilities which I've already applied for by the way and I have we were approved for the bar I did not do for the corner yet, but there's no reason the corner should not get it as well. Okay, so I'll just change that in my report, yeah also, if it helps at all Kimchi before had Lee had they paid for outdoor seating years ago, two three years ago anyway, so they that was okay there and they just they found it did not help them much. So they let it go and they also had a liquor license in the corner as well so and which they also did not find. Did them anything for that did not go well with korean food or something, and they also let that go so it does have an existing history of both outdoor seating and a liquor license. So we're not looking to get a new liquor license we're just you know by the graces of the SLA, it's an extension into an adjacent property which happens to be my property. So that's that is essentially the long and short of it well, I think formally, it goes down as an alteration of your origin, correct and, more importantly than anything is it's free, so it did not cost anything to do an alteration. Anybody else from the committee who would like to ask some questions: Judy. Oh there you go. Yes, thank you. I think Mr Ziadi answered my question regarding food and I. You know thank you. He certainly was gave an elaborate explanation of his food service, so I appreciated that you're welcome. Okay, great. So what happens is that we basically raise emotion that is in the negative. So how the committee works is that we say that we, the committee, moves to deny this application unless the owner agrees to the following stipulations and basically for this premises, it's pretty standard. Okay. So I'm going to move that we deny this application unless the owner agrees to the following stipulations: that the premises will continue to operate as a restaurant, that there will be no sale or consumption of alcohol on the premises until appropriate authorization is issued by the SLA that the hours of operation, as you stated, will be Monday through Sunday from 11 A.M to 11, P.M, that the doors and windows are to remain closed in coordination with any amplified music that they will only be recorded. Music and occasional live jazz music, but the sound level will remain below the level permitted by the New York City Noise Code that there will be no use or music on the outside of the premises that the licensee shall not use any promoter or have promoted events that there will be no smoking permitted and that the applicant agrees that, should it change its method of operation, it will give notice and meet with the Community Board and the committee at least 45 days in advance of any such change. So Mr Zioni. Do you agree to those stipulations I do, except for one it's not a disagreement. It's the bar already under normal non-coveted circumstances on Friday and Thursday, Friday and Saturday closes at 12, 1 and 2. God knows when we'll get back to that, but I would I mean the bar on its own, like we're not going to have people cooking until 12, 1 and 2 o'clock in the morning on your application, I believe said: 11 A.M to 11 P.M for the restaurant, yes, okay, so the restaurant and the bar are kind of like are separate entities, although it's the same llc that owns both of them. They both are operating kind of in one is a a mixology cocktail bar and one is going to be essentially a ramen noodle bar, and you know how do you work with this? Do they make a a correction to the to the application that we had yeah, so we have to formally because it's an alteration application actually consolidates the two uses to one license so in the application it covers. The license covers the both as one establishment. So then we would have to distinguish in the in the steps. You know that it has to be one time it just. It can't be time a for this and time b for this, so we'll have to you know, amend that application. So we could amend the the steps. Okay, so is it just possible for me to you guys brought up something that I did not even I did not even think about. Maybe I should just make it till well. I mean they're not the same times every day, so I mean I could if we could just restaurants or not right, oh okay, so if that's, if okay, so then it would take on the hours hmm. This is a. This is tricky because your latest hour you're saying it's 2 A.M. Yes, none of them. We never open later than 2 A.M with the with the bar, but the bar. You know it's a bar, so it kind of makes sense. Now. The interesting thing is the bar does not open until 6 pm, but I think it has to start changing to 11. That's fine, that's fine. Both of them at 11 is fine. I have no problem with that. But yes, like you, said most restaurants have different hours. It should take on the hours of 11 to 11, except for probably Friday and Saturday yeah. All right so I'll just write that down and then Josephine you'll discuss it with him that it'll be here. Yeah can I, can I think about it just for a little bit and then amend the thing. Okay, let me just talk to my Gm and talk to my wife and stuff like that yeah all right, Josephine yep, that's fine! Thanks for bringing that up! I did not even think of it. Okay, so for the committee he has agreed to the stipulations and they will work on the Friday and Saturday. Do I have a second to this motion. Second, okay, all in favor are we going to do a hand, raise or you're going to do a roll call, guys I think we could do a hand raise okay yeah, because I have everyone on one screen: okay, very good, a formal hand raise or a hand, raise no I, see the hands all off. Thank you. It's my hand. Okay, I could see you all, so it looks unanimous. Thank you, okay! Thank you! So much robert. If you'd like you can leave you know, you do not have to say. Thank you. Thank you very much. How do I follow up about the times? I will I will email you or call you tomorrow, robert? That sounds great to if just for your thoughts, it's Thursday Friday Saturday, that's it. The other ones are fine all right. Thank you guys. Thank you. So much and good luck. Thank you very much. Well, we have a question: how about the new menu you'll consider continuing the wonderful kimchi you can young soup. That was literally my favorite thing in Bay Ridge and I'm so sad, it's gone so you have it they're, though, that soup are you talking about the devil's soup? What James used to call the devil's soup, the red One? That's the one, yeah I think we have a cold I found a japanese, a japanese chef already so you'll be happy to know. I'll try my best good luck! Thank you guys. I really appreciate it great take care. Thank you. So much. Thank you cheers all right. Next on our agenda is a report from the 6a precinct so take over gentlemen, so maybe I should say by way of backgrounds is. This item was added to the agenda following a resident who spoke in public session about concern about you, know: e-bikes and mopeds and motorized scooters riding during open. You know, as we have restaurant seating outside and there were several complaints from seniors who were frightened board. Member Dean Rasina, who is here I, believe he commented at the meeting or sometime after the meeting that we should have the precinct come and give us some stats about enforcement and I'll turn it over to you. Hi everybody, I'm police officer, Mike Manafinto from the city I, do committee affairs I'm here with my partner Frank regards to the e-bikes. They are almost legal. All right, I think the next few weeks they will be legal like as bicycles are they have to follow the same rules as bikes. I know, there's a lot of them on the road right now, but they're almost essential, they're, essential workers right now, because they're doing food deliveries, they're essential right now we are enforcing someone's if they're on the sidewalk they are being enforced. Okay, it's not like we're looking away, you know with a blind eye. They are being addressed. We we did initiative. Yesterday we wrote 25 summonses to the e-bikes, we're going to do probably one or two a month initiative, 40, z, bikes, because there is a big concern in the community. They do go pretty fast and they're quiet. You really do not hear them coming, you know, but on the sidewalk you're talking about right on the side like walking the streets like yeah, I'm saying they are, they are in danger. They are but, like I said, they're going to be illegal, they're legalizing them so they're not going to go away, there's going to be more of them on the road, but just let you guys know we are enforcing it. It's not it's not. We do not take action. We are like I said we did initially essay 25 was written, we're going to continue enforcing this. They have to abide by old bike. They have to travel the same flow as traffic. Wear helmets yield the pedestrians okay when they're turning, so they still have to wear the light like reflectors and lights. So these are all things we're going to enforce. I'm going to pass it to. We have our traffic office here: okay, they're! Actually, writing these summonses they're just going to go by what kind of forcement we're doing. Okay, great hi good evening, I'm office Eric Miller from the 16th recent highway team. I'm one of the four officers that does the summons Jordan is precinct how's everybody doing here. What are you doing so far, very good nice to see you likewise I'll give you a breakdown of whichever one we have just pick it back up said we did issue 25 moon violations to e-bikes in the commands. Yesterday we're going to detour platoon on our operation. Pretty much then we wrote 12 total. We wrote about throughout nine traffic tickets for bicycle E-bikes, not stopping for red lights. He wrote another seven of them for being on the sidewalk for them for having too many riders, which sometimes you'll see them. They'll have a person sitting on the back or on the front, and it's not under seat, but that's too many riders. That's awesome illegal! It's not a traffic violation that we do wish for someone's explore. We have one for a bicycle ride. I found a photo of order, as well as little e-bike fail to get a ride away from pedestrian. With a walk signal explained, we will, we are out here enforcing them. They said they are going to be legal very soon they are essential employees. Most of them do food deliveries, but we are acting for operations. We have some questions, I. Think barbara, that you wanted Jill. You have to unmute yeah, I'm off. Can you hear me? Yes, okay, I'm just curious. If they will be legal, do they have to be registered and if not, how are you enforcing the summonses that they're getting? How are they enforcing the payment of them and if they do not pay what you know downfall of them not paying? Do they get their bike? Taken away, I mean to answer your questions as far as them being registered. No, they do not have to be registered. Just like a regular bicycle. It's not to be registered, there's no place on bicycles. There will be plates on e-bikes, therefore they won't be registered as far as issuer summons them. We do have proper identification from the issue in the summons, which therefore has an identification with an argument with their name. Once we submit that summons to New York City dmv, it creates in the database and if they do not pay that dmv can handle. As far as further enforcement. You know the rational warrant to defending the same as you can stop on. The car will notice it out for non-payment, pretty much yes, okay, so just one more question, then, as far as not being registered, they are not like a bike, they are a motorbike and they do go quite fast. So why does not the city feel they need to be registered so I? What I would answer? Maybe I can answer that question is jill. The City Council has just passed recently passed legislation, so I think that's a legislative issue as far as their legalization and on the state level too I mean there's new state and city regulations that have been passed and maybe something our Tnt committee could take a look at because right now the registration I believe is not required. So they're not required as a as a motor vehicle to be registered or licensed they're. Considering an e-bike to be classified as a motorbike. The yeah you broke up a little bit: they're categorizing, the e-bikes they're, not categorizing, is the same as like a moped or a motorcycle, so it it's kind of like a gray area. We understand because it is not mechanically powered. You know it's not like you're getting on there with a pedal and pedaling it so, basically they're just taking that and they're going to classify themselves bicycles, not as like a moped or a motorcycle. That's where that comes in I got a question: yeah Chris, yeah I just have a question: does that include the bikes that look like vespas? You know they're, like the scooters that are electric. They do not have plates and you're riding around. Do you wear these guys? Yes, because I thought an e-bike had to be pedaled like a moped yeah, they are, some are pedaled and some are right. Some are pedaled and some are not so. Okay, hey everyone. Two questions under the new law is: are there any throttle restrictions or are all e-bikes going to be legal, because I understand that they can be quite fast and powerful, depending on how high the throttle goes? I'm sure I'm not using the correct terminology, and my second question is it sounds like you. Officers have issued a good number of summonses and do you is it your sense that the grounds for the summons? Is it a question of people, not knowing the law, or is it a question of sort of willful disregard or being under pressure to get the food out fast from the restaurant or why are so many people getting summonses? I'm not questioning your issuing the summonses. I'm just wondering why people are doing things like going the wrong way on a one-way street. If you can even generalize about such diverse circumstances. So the question so I'm officer poison, I'll, answer that question. So what's up fairly recently, they did not have laws set in stone, so these guys were able to basically do whatever they wanted to do so. They're unaware that they have to fight like a lot of stuff that they're getting before they're completely unaware that they can't do it. I'm just saying most of these people were just on regular bikes up to a few months ago until they realized that I could get further from a to b. In this you know e-bike, so they probably just show me the same rights as a bicycle, which they probably do not know the rules of a regular bike. You know so, but now they feel they're getting the destination faster. Now, with these bikes, you know, I mean which makes sense, given that everybody wants their food five minutes ago. Is there anything that you can suggest? That would be useful, maybe coming from the community board as far as outreach goes and educating these e-bike riders about what's expected of them? That would help both their safety and also the public safety. Well, we were actually talking about this earlier. This there should be like a safety course, a biter, safe safety course for a lot of these individuals. They do not. You know they do not know the road you know. So we have to come up. How do we issue these courses? You know you put it on the register like the restaurants that they have to instruct these. You know motorists I do not know, because it's not I do not think it's limited to restaurants. I mean we're. Seeing such an explosion in the use of you know not only pedal assist I would put in a different category, but the new scooters that are you know very much. Recreational and I do not think that's a bad idea or suggestion to have it's, because if they're not lice required to be licensing, they do not go through driver safe. You know safety and I. Think that's a really good. You know suggestion I think it's not a bad idea, because we, you know on my way here there were two mopeds on the bike that did not appear to be restaurants and they were riding on the sidewalk and it's very dark now so I think you know some education, maybe something we could tackle. Marty I would agree with that. Yeah I'd be happy to help with that. I mean I. Just did some quick research on Google to see what the state of the law is and it seemed very confusing and unclear, and so, even if somebody riding one of these bikes wanted to know what the state of the law is and what their requirements were, it would be hard to know. I've seen little pamphlets give away pamphlets on bicycle safety in many places, ranging from bike shops to court to restaurants, and so I do not know. Maybe something like that is available that we could generate and make available to people. So they understand that there are rules, they're required to follow and how to learn more. If they're interested in not getting summonses, which I assume they are and I mean I would say our biggest, you know who we hear from a lot of our seniors, because these they're so quiet and you know really when you're on the sidewalk, the unsteadiness. There is concern. So we thank you for for coming tonight and for sharing that and I think it's something that we should work on as a board. Thank you, everybody. We have Ruth and then Sandy yeah I just want to add to that. You know when you look at the people who are delivering the food. These are the people who are making the less the least money around and if they're going to be ticketed, it's really pretty sad. I'm sure that the restaurant owners are not absorbing those tickets, so you know we want to educate them, but you know ticketing is well, you know, could we feel very punitive to them? But as far as educating is concerned, I would target the restaurant owners also for educating, so they can pass on the information or the brochure that you're planning on doing delivery. People right, but I also think that the city has to maybe put something on the news you know and hit also the small cable stations in different languages, because there are people who are not associated with restaurants. I mean there is. There are people around the corner, and this woman. She rides her five-year-old child on the back of her moped, with no helmets in the dark I mean. So there really has to be a lot of education about that, and you know I sometimes ride a bicycle and I'm old now, but I know that you're supposed to go with the traffic, you know I think most people know they're supposed to go with the traffic and they just do not. So you know offices whatever you can do to make this safer for all of us, the pedestrians, the other bike, the bicyclists and the cars. We thank you for that. I have one question: okay, yeah I just wanted to ask about the the thrust type mufflers that are going around the neighborhood at night. I know a few people on shore road were complaining about them. Have you guys done anything about that? Is there any laws about that? You know the loud mufflers these they cost speeding, doing the donuts yeah we've. Yes like shore road and these cars. With these like aftermarket mufflers, we have issues summons for that. We've a few months ago, we actually towed a few of the cars. Okay, it's it's they're popping. They sound like gunshots. We get a lot of complaints about these, but we are assuming summons. Is yes, okay, thank you. We have done a couple of initiatives with one second I think precincts the 666 and highway unit so and I know we are probably going to continue those going forward right. I also remember from our last general meeting that I believe that Senator Grenada said that the the fines have gone from 100 to a thousand dollars and I. Think that begins in December. Is that correct? Remember, hearing that josephine? Yes, I! Do yes, I do not know when the start time is, but I do when it kicks in, but that law was changed, which I think will be helpful right. Sandy yeah, going back to the motorized bicycles, I! Think from what I'm hearing, we're still in the infancy stages of of this and I, think there's there's nothing more, that the police department can do besides what they're doing now and that's enforcement, but I think we need to maybe have a meeting with maybe our councilman to find out what's going on with at City Council, because the these these motorized bicycles are not considered motor vehicles they're not being registered, they do not have plates what happens if, if there's an accident with a with a pedestrian and somebody gets hurt what happens if these bicycles hits another vehicle and there's and there's damage, there's no insurance, so I think I. Think I have more questions of the city council than I do of the 68 precinct at this point. Okay, thank you! Okay, jail! You have something to say: no, can you say something? I'm sorry! Yes, Michael no I just agree with Sandy. That's all sorry. I agree with Sandy yeah. Oh you agree. They said you disagree. I agree with sandy that we should. We should have a meeting with the city Council, because my first question you know, involved the same issue so yeah, very good, okay. Well, they had what Sandy said. I'm sorry real quick, but if one of these e-bikes strikes a pedestrian or a car, we do handle as a police accident report. Just like we do two vehicles, you know so it does get reported. They can't leave the scene, they have to do the scene, but there's no recovery for injury or personal damages and loss. Well that what I mean yeah okay, they do not have insurance right. Okay, are we good with this officer anything else? I'm good thanks. Okay, good thanks guys for your service. Thank you guys, bye-bye all four of you. Okay, let's move on with our next and last report, it is where is Enzo I saw Enzo there. He is okay, hello, hi Enzo. So now we have a request for a new application for liquor, Right liquor, it's a full all premise: yes, okay, liquor, beer, one insider for Fra, Vemma, Corporation, doing business as a bono, Sera, restaurant and pizzeria. The premises is located at 6522 and 6524 11th Avenue, I'm just fixing my report here. This is a new application for this. As a full restaurant, the owner, Vincenzo Triola Street, three Triolo is present with us. This application has the certificate of occupancy photos of the establishment, are that or which are still under repair. We do not have a menu as of yet, but this premise was formerly known as La Sorrentina Pizzeria and a restaurant and restaurant now I see outside. You have the structure for outdoor dining and that's going to be permanent for you until then we you know they we could be open. Full capacity. Excuse me said it again until we open the we open the restaurant with full capacity right now. We'll just do the stand, the regular stand that we could put outside, okay, so you're going to keep that on. You you're not going to continue that after Covid-19 is over no okay and there will be only background recorded music, no adverse history associated with this address and the owner is also an experienced restaurant owner with a restaurant named sal's family pizzeria, located at 384 broom street in Manhattan. As you can see, you have the pictures that I have right now. There's the man standing on the counter fixing yeah. We just get what happened we're doing it. We give them a fresh coat of paint to clean up and nothing's going to be moved. You know from the old we're just going to clean the whole place because it was shut down since it's covered right and we just give them a new fresh coat of paint. Try to fix whatever needs to be fixed. Perfect, all right. Anybody from the committee that like to ask some questions, any questions, yeah Barbara, Yo, Sandy well I mean this establishment has been around for quite some time. Josephine I do not think I. I've ever heard any adverse history at all, so I mean I. I'm just happy to see that this established opening back up because it's it was very sad to see it go in first place. Yes, I, agree, I, agree with the Sandy, I'm happy to see somebody transition into a new. You know like a new business, but I mean it's. It was a very well maintained and well-run establishment. So I think this will bode well for the new owner and the community. We appreciate that anybody else from the committee- hey Steve. There is none, as you saw before, Vinnie. What we do is we send up a motion to deny the application, unless, under the pretense that you will agree to the following stipulations and those stipulations are basically the same as the prior restaurant, I'm going to read them so right. Now, I'm going to present the motion to deny this application. Unless the owner agrees to the following stipulations, but the premises will operate as a restaurant. There will be no sale or consumption of alcohol on the premises until appropriate authorization is issued by the SLA you all you too also have. The hours of operation will be Monday through Sunday 11 A.M to 11 P.M. The doors and windows are to remain closed in coordination with any amplified music. They will only be background recorded music and the sound level will remain below the level permitted by the New York City Noise Code. There will be no use or music on the outside of the premises. The licensee shall not use any promoter or have promoted events. There will be no smoking permitted and that the applicant agrees that, should it change its method of operation, it will give notice and meet with the community Board in the committee at least 45 days in advance of any such change. Do you agree to those stipulations? Yes, I do? Okay, do I have a second to this motion. Okay, Ruth give somebody else a chance great. Thank you ruth all in favor, it's unanimous okay, so Enzo Josephine will call you to to sign off on the the stipulations. Okay and, of course, you're- welcome to join us at the meeting on Monday evening when we bring it in front of the board, but Josephine will contact you regarding the signature. Okay, thank you very much. Okay, thank you. Thank you have a good night. Hopefully we see you for the for the Pasta lots of lots of good luck with the restaurant. Good luck to you. Thank you very much have a good night. Thank you good night. Anybody else have any other business you'd like to bring up this evening. How about motion to Adjourn? They do have emotions I! Guess we have that all right! Everybody see you Monday evening, nice all right. Everybody have a good night.",
            "summary": "We want to just make sure that we know what's happening in the community and keep our ears open to know what we can do with some of the issues going.\nThe owner, Robert Ziati, who is here with us tonight, is taking over the adjacent premises, formerly known as Kimchi restaurant, on the corner of Third Avenue.\nSo I open this right now to the committee for any questions that we can ask Mr Robert, Zioni.\nWe are fully going to be taking advantage of the outdoor, dining New, York, City.\nIf anybody's ever opened up a restaurant you'll know it.\nI, think Mr Ziadi answered my question regarding food and I.\nHow the committee works is that we say that we, the committee, moves to deny this application unless the owner agrees to the following stipulations and basically for this premises.\nSo I'm, going to move that we deny this application unless the owner agrees to the following stipulations: that the premises will continue to operate as a restaurant, that there will be no sale or consumption of alcohol on the premises until appropriate.\nBut the sound level will remain below the level permitted by the New York City Noise Code that there will be no use or music on the outside of the premises that the licensee shall not use any promoter or have promoted events that there will be no smoking permitted and that the applicant agrees that.\nGod knows when we'll get back to that, but I would I mean the bar on its own, like we're not going to have people cooking until 12, 1 and 2 o'clock in the morning on your application, I believe said.\nA a mixology cocktail bar and one is going to be essentially a ramen noodle bar, and you know how do you work with this.\nThe interesting thing is the bar does not open until 6 pm, but I think it has to start changing to 11.\nThis item was added to the agenda following a resident who spoke in public session about concern about you, know, e-bikes and mopeds and motorized scooters riding during open.\nAll right, I think the next few weeks they will be legal like as bicycles are they have to follow the same rules as bikes.\nI know, there's a lot of them on the road right now, but they're, almost essential.\nYou really do not hear them coming, you know, but on the sidewalk you're talking about right on the side like walking the streets, like.\nWe are like I said we did initially essay 25 was written, we're going to continue enforcing this.\nThe City Council has just passed recently passed legislation, so I think that's a legislative issue as far as their legalization and on the state level.\nI mean there's new state and city regulations that have been passed and maybe something our Tnt committee could take a look at because right now the registration I believe is not required.\nAnd they're going to classify themselves bicycles, not as like a moped or a motorcycle.\nIs it a question of people, not knowing the law, or is it a question of sort of willful disregard or being under pressure to get the food out fast from the restaurant or why are so many people getting summonses.\nWith these bikes, you know, I mean which makes sense, given that everybody wants their food five minutes, ago.\nYou know you put it on the register like the restaurants that they have to instruct these.\nI think it's not a bad idea, because we, you know on my way here there were two mopeds on the bike that did not appear to be restaurants.\nSo I think you know some education, maybe something we could tackle.\nEven if somebody riding one of these bikes wanted to know what the state of the law is and what their requirements were, it would be hard to know.\nPeople right, but I also think that the city has to maybe put something on the news you know and hit also the small cable stations in different languages, because there are people who are not associated with restaurants.\nYou know offices, whatever you can do to make this safer for all of us, the pedestrians, the other bike, the bicyclists and the cars.\nBut I think we need to maybe have a meeting with maybe our councilman to find out what's going on with at City Council, because the these these motorized bicycles are not considered motor vehicles they're not being registered, they do not have plates what happens if, if there's an accident with a with a pedestrian and somebody gets hurt.\nWe should have a meeting with the city Council, because my first question you know, involved the same issue.\nYou you're not going to continue that after Covid-19 is over no okay and there will be only background, recorded music.\nIs we send up a motion to deny the application, unless, under the pretense that you will agree to the following stipulations and those stipulations are basically the same as the prior restaurant, I'm going to read them so right.\nUnless the owner agrees to the following stipulations, but the premises will operate as a restaurant."
        }
    }
}