{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UC8TUdmcifcSYU7tUl5EFVGA",
            "title": "October 2020 Arts \\u0026 Culture Committee",
            "publishDate": "2020-11-10",
            "shortDescription": "",
            "lengthSeconds": "0:46:23"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "qP0UXIQ68vk",
            "fillerWordCount": {
                "uh": 48,
                "um": 193
            },
            "readTimeFullTranscript": "22 min read",
            "readTimeSummary": "3 min read",
            "wordCountFullTranscript": {
                "arts": 17,
                "culture": 13,
                "calendar": 13,
                "museums": 13,
                "evening": 10,
                "chat": 10,
                "holiday": 10,
                "member": 9,
                "lights": 9,
                "website": 8
            },
            "wordCountSummary": {
                "arts": 10,
                "culture": 7,
                "museums": 5,
                "member": 4,
                "places": 3,
                "list": 3,
                "resource": 2,
                "calendar": 2,
                "institutions": 2,
                "information": 2
            },
            "fullTranscript": "Hi, oh, how are you, how are you? Oh fine I was having all sorts of I had to change computers. My writer was not working, I've been going through Hell and I'm so glad you had half an hour to give me here. So, okay, so I just wanted to make sure that you can see it. Let me put subtitles on so I can see it too show subtitle. Okay, do you see it? Oh wait. Let me go hold on I got it wait. You should be able to see it. What do I click on closed, caption yeah? We see it, we see it. Oh I see it. Okay, good and Shatik you're recording right yep, I'm about to go on facebook live at 6:30. Okay, wait. Are you guys still there? Yes, my connection is unstable. Let me put an ethernet on okay, it might help. So are you? Are you guys still there? Yes still here. Do you hear me just I can't bring it oh here it is I found it. Okay, good I could not see you I. Now, I can't see you again. Oh I see I had it hidden. All right good, so this should be good all right hi. How are you thanks for joining us? We are just waiting for a few other folks to join before we get started hi everyone thanks for joining us, we're just waiting for a few other folks to join before we get started bye, okay, Shatik! Let let us know when you're ready for us to start I'm ready: okay, hey, derek okay, so we're on Facebook live now: yep, okay, great hello. Everyone welcome to community board tens arts and culture committee meeting this evening. We're very happy to have you. I am the vice chair of the arts and culture committee. Unfortunately, our chair is out sick and won't be able to join us this evening. But I'd like to first start by having our CB10 members and arts and culture committee members go around and introduce themselves briefly, and then we can have our guests introduce themselves as well. Tiffany. Do you want to start us off hi everyone? My name is Tiffany Reeves, I'm a CB10 board member, a member of arts and culture and transportation Committee. Thank you, derek you're, muted, good evening. Everyone sorry about my background: I'm driving trying to get home I'm trying to get this debate, but I'm Derek Perkinson, a community board member I sit on two committees: talks and safety and health and land. You excuse me and- and I'm happy to be here today- guys yeah thanks so much derek Shatik good evening. Everyone Shatik Mitchell, District Manager, Community, Board Tim. You can't see my face right now, because I'm battling allergies and stuff, I'm not feeling really well but happy to be here and good luck heading to meeting Jericho. Thank you! So much and we'll continue shadow Smith. Can you introduce yourself hi everyone, Shadon Smith, Community, Board, 10 member and also I'm a newly appointed member to the arts and cultural committee? So this is my first one. Oh welcome thanks! So much very happy to have you and then we have Amy. Would you mind introducing yourself hi, I'm really delighted to be here: I live in community board. 10 and I have had the hardest time making it to any meetings. It's been years since I've been to a board meeting, but I was able to make it to this meeting tonight, so I'm excited to be here and feel very welcomed. I also, in addition to working at an arts granting foundation during the day, I also am a freelance director and am a volunteer managing director for the League of Independent theater, so very excited and interested to hear what is going on in my very own district. That's great Amy what arts foundation or are you at I'm at the Andy Warhol Foundation for the visual arts? Thank you so much for joining us Seth. Would you mind introducing yourself? Yes, I'm sort of in a similar situation. I have moved around to different districts and recently figured out. I was on the border of community 10 and so I work in book, publishing and used to do a lot of volunteering and in terms of tutoring and also sort of helping people transition from college life into more of like a study, or at least a freelance style career. So I've just been trying to figure out ways to re-engage in the Covid-19 era and I wanted to check out one of these meetings. Well, thank you so much it's great to have you and we hope you'll come back and I think Tamara Martin, one of our committee members and board members just joined us Tamara. Would you mind introducing yourself hi Tamara, Martin, Community Board member, welcome glad you guys are able to join us thanks so much tamara all right? Well, why do not we go ahead and get started? There is a lot going on this evening, so we do want to be conscious folks time, but our one agenda item for discussion is the the arts and culture museum resource calendar that our board member Tiffany Reeves has been working on Tiffany. Can you kind of give share, give us an update on the resource calendar and you know part of the reason you know we are developing this calendar. It actually came as a result of one of our previous committee meetings and recognizing in these challenging times with cover 19 and the pandemic, that a lot of our arts institutions are really having to adapt, whether it's that changing their working hours and social distancing to really moving into a more virtual space in order to share their exhibits and their work. And so what can? The arts and culture committee would like to do and is working on really gathering and information on a lot of our museums in the area and obviously in the Manhattan and upper Manhattan area, so that we can share that information via our website and use it use it as a tool and a guide, for you know just members of the community so that they can still find creative ways to enjoy art. You know to access it, no matter their situation, whether they have to be sheltered in place or if they are able to get out in a limited capacity. So with that context, I'm going to turn it over to Tiffany to kind of give us an update on that project. Yeah. So you said everything Jerica in terms of setup, so I guess the next step is just to share the calendar with you guys to show where we are so I'll share. My screen in just a second but I want to share it with the committee and with the community members just to kind of understand where we are with it. So, as Jericho mentioned, we want it to be sort of. If you are feel comfortable, going out right now and doing something in a socially distant manner or if you do not, and you want to stay home, we want to still offer the arts and cultures in this. The general community options and resources for what museums and institutions and galleries are doing in and around CB10. So we have eight institutions on our list right now and you'll see where I'm going with it. Great share can I get a thumbs up. If you can see my screen great, thank you so you'll see where we're going with it right, it's similar to myself studio museum in Harlem, and it's talking about what events and programs they have as well as the description of. If they're, online or virtual or in person and sort of like links to each of those resources, so what we wanted to do was potentially turn this into an actual calendar. So it's so people can see sort of if there's something happening on a particular day. Although some of these things are throughout, you know, multiple months so for the for the committee right now. What we wanted to do was just share where we are with the museums and institutions we have, and if you have additions we would love to include them right. I only have we only have eight here right now, but obviously there's many more that you know are not here that we can talk through and then we would just add what resources and events and programs they have. We would add, links to them date. Any information we would have. We would just have it in this one resource, so our community just has a one-stop shop for things happening in and around CB10 Tiffany. Can you just read through the list of museums and so and then I want to open up the floor for the rest of our board and our committee? I'm sorry our community members to see or flag any museums that they think we should add that we may not have on this sheet excellent. So first we have studio museum in Harlem and yes, they're still going through their renovation, as we all know, but they do have some online pieces and exhibits. So that's what is the resource there? The Schomburg Center, the National jazz Museum in Harlem, Sugar, Hill children's museum and when I was doing some res when we were doing research there, it was really interesting to see they do actually have some stuff, that's in person on the weekends specifically for children, but they do have some virtual programming and different pre-recorded activities as well the met. So we know they have the met cloisters, which is closer to uptown, and then we have the fifth Avenue location, which has many different visits and virtual endeavors as well. The museum of the city of New York, the wall. I, do not know this. One that George would give this one to me on the wall. Rich gallery I think it's defined by Columbia. They have a really cool I. Just looked online today, really cool online exhibit right now and then the El Museo Del Barrio thanks Tiffany, so board members community members are there any museums that we do not have on this calendar that you think it is important for us to add. This is Shatique. I did not see. Maybe I stepped away for a second. The jazz museum is that there yep we have that one shotiq I have it in the screen. Now I'll see ya. Anyone else go ahead. I wanted to include the Caribbean Cultural Center on 125Th street I. Put it in the chat. Oh great, okay, thank you, yeah that one is actually community board 11. it's on east side of 125Th Street, but that's fine for our sheep because we have obvi. The coursers is outside of CB10, I'm pretty sure correct, so we're just trying to yeah we're having there's a lot of these there's a lot of these outside of CB10, so that this column here just has. If it is I think in and around makes sense for the community just because you know we want to just make sure we're as robust as possible, I agree. So the yeah some of these a lot of these are not okay, sorry and it's just museums right, not all cultural organizations, but just museums, I think it's a discussion for the committee. We have galleries in here, I think if it makes sense- and you can learn from it, then we can talk about it. Is there one particular you had on? No, it's just there's a there's, a lot of cultural offerings, so I, just you know, I, could understand. It makes sense if you're just going to narrow it to museums, so I did not want to offer. You know like the apollo has like online programming going on. I mean I'm playing, I'm throwing a blank right now, but there there's a lot. I just want to I just wanted to make sure like if we're just going to focus on museums and not to offer other places Jericho. What do you think? You know? I'm happy to open up the discussion for the the group this evening. I think I'm open to being more inclusive and giving folks a diversity of experiences. I just want to manage how much we add to the calendar and share I. Think I think the apollo is great, so you know I would suggest we add it. I also just want to flag we've been joined by another one of our committee members, Miss Deborah, Gilliard Deborah. Do you want to just say hello and introduce yourself briefly? Yes, Deborah Gilliard, proud to be a member of arts and culture and a member of the senior task force. Thank you. I think. The list is very good. Thank you. Thank you, Tiffany, for putting it together. I think we have crystal mckay as Well crystal. Do you want to say hello I do not think we hear you crystal. Oh, if we're still not hearing you crystal, but if you want to say hello in the chat, we'll take that too so I also, we've also been joined by the chair of Community Board 10 cicely Harris Sicily. Are you available to just say a quick hello to our committee and our community members? Hello, hang on hear me. We can hear you. Thank you so much for joining us, Madam Chair, hi Jerica. How are you doing well good to see you too, I'm glad to be here. I do not know if Barbara will be able to make it were you able to share the email with the website for Harlem holiday lights was sent today, no she's the email she sent before they had the you just put yourself a mute sicily, all right, sicily, I do not know you may be frozen, but we will come back to you. Why do not we go ahead and introduce have the other folks that have joined us Chanel Washington? Do you want to unmute yourself? Okay, Chanel may be tied up. I know she has a bunch of zooms or some other meetings at this time. Diane. Do you mind? Would you mind saying hello to the group? Thank you so much for joining us all right. Why do not we go back to the discussion? I know people are going to be popping in, and so one of the the items that should don raised was expanding the list to other arts related or cultural centers, beyond museums, and so you just I, just want to open the floor for discussion. You know I am open to that. Maybe we can see if there's a critical mass that has an interest one way or the other. So if you are unable to speak, feel free to drop a note in the chat. Otherwise, if you are able to chime in, please do so and unmute yourselves, hey Jericho. This is again I wanted to recommend the Alexander Hamilton Museum Okay Alexander Hamilton House, his son, I'm Saint, Nicholas, Avenue and I. Think it's like 140th for 141St street I think they have a museum there as well great. Thank you. Shatik Deborah, Tiffany, Derek, Crystal, Tamara Diane Seth. Do you have any additional recommendations for museums or other cultural places that we can add to this calendar folks that you think it would be worthwhile to you know, elevate and raise up for our community. I, do not have other recommendations right now, but I agree with shadon that we should open it up. I think it should just expand to the needs of the community, and if you know other resources from other institutions are or are wanted, we should definitely add them to the list and I also think too it can just be an ever evolving list like we could put it out and then say you know, we'll update it in real time and be able to just push that resource out to the community as we get updates so tiffany. What do you suggest as far as communication? Do we want? Do you? Do you want folks to email you directly for ads? Do we should that go into shatiq? What I mean? What do you? What do you recommend I'm happy to take them directly, I! Think it's easier just from a streamline standpoint. I can put my email in chat too, so you can just send me all the you know. The apollo esque editions, I can add those and then I guess two Jericho. The next piece would be talking about the just wider distribution to the community and what we think is the best strategy there. Okay, shatek I, do not want to to impose on you right now, but if you had any thoughts about distribution from the community board itself to the wider public, I know we have. We have our instagram page. We have that as a social media channel, but it would it be feasible to host this calendar on our website sure we can post the calendar on the website and we could also send out in our e-blast great yeah. We could probably use Facebook too Shatik, I'm wondering if we can do that in some sort of easy way for people to just click through yeah we can. We can post it on Facebook as well great, so does anyone have any other comments or thoughts on the calendar or any points related to it that we should discuss this evening? Well, I agree with the e-blast, maybe like a monthly type of blast, so that we could add some and take away some, so it would always be like current got it fluid type of current. You know information from my standpoint. All that sounds great I know. I typically get a lot of emails from different institutions with you know, new exhibits that they have out, and so you know to you know to our the best degree that we can, if we're able to keep a fairly current calendar, I think that would be ideal. I see, Sicily is back with us Sicily, I'm not sure if you're able to speak at the moment, but we've pretty much covered our agenda item for this evening. What I was interested in doing is opening up the floor for old business and then new business. As far as old business is concerned, I do not think we've ex we've discussed the holiday lights activity or event this year in any great detail, but I do not know if you are on you're able to speak. If you have any information or if there's an email that you can share anything that you've heard from Barbara Askins regarding that and cb10s participation, you know for this year, so Eric, I'm sorry, I'm having technical Dis difficulties, plus I'm like another zoom. At the same time, so I know we all know what that feels like to be. Yes, sorry, so so really quickly, yeah I do not think bar will be able to dial in, but we are going to be participating. We do have a float, so it's only going to be it's not going to be a parade this year. A lot of it will be virtual, so it will be a caravan field. There only will be three to four floats in the caravan, so we can't call it a parade. It is a caravan and we will have a socially distanced Caravan, meaning there will only be probably three to five people on our float. But what we want to do, that's really important. Is we have a website, so I do not know if that's Vincent t jerk I'll send it to you tonight if I, if it has not just put it in the chat sister. Thank you thank you that we can upload things. So an idea I was having I had was that maybe we can upload pictures from last year and that the individual folks of the arts and culture committee you all can do like one or thirty second videos just talking about the importance of cheer the importance of Harlem holiday lights, especially this year, and then we can populate our our portion of the 125Th Street Harlem holiday lights website. So every organization that's participating, has their own little website within their website, so different links. So we can populate ours. However, we would like so we can talk about maybe, like those individual videos, I plan to do one I want you all to do one if you can or want to, and we will put them up there on the site since we have to have a very socially distant caravan. This year, there'll be little spots throughout Harlem, where we could place community board members and we can kind of like broedcast a live from that area, and we just have to work that out with how we would dial into zoom. But those are the ideas that we're thinking of to have more involvement from the community Board in our group. Since it is it's, it does have to be socially distant. So those are the things that we're talking about. There will be a vip reception, probably from a Manhattan borough president, but it'll be probably over zoom or something like that, and we're trying to figure out really cute and creative ways to be interactive and engaging, but still use the technology and the platforms that are out there. So that's a just a brief update, but I'll. If you put I, know Shatik said he put in the chat, but I'm jared offering it to you and george as soon as I get off this zoom on the email. So you can have a look at it. Okay, I'm just clicking on it. What is the date? I'm scrolling I do not see it. I'm missing it sicily. Offhand! Do you recall what date this is in the time frame, so this will still work I! Think it's going to be the weekend prior to Thanksgiving or the weekend after on thanksgiving okay. So that's still up for debate. Okay! Yes, it's really up to NYPD, because we have to provide escorts for the caravan and then they have we're not going to. Of course, I do not think they're not going to close the streets, but they are going to make it easier for us to go up and down the streets, and it's going to not just be on it's not going to be just on 125Th Street. It's going to go through out. It's going to go up, Frederick Douglas, Boulevard, I, think over to 116th down Malcolm and make a big square like that. So it's an extended route that we have to work out with NYPD got it then. My last question: my apologies for peppering you with them I, really love the idea about having individuals record videos, how I know you said you're going to do one. How long would you recommend for folks like what is your sense of? Is it just a minute, a minute and a half two okay seconds to a minute 30 seconds to a minute and then so they're going to be the teasers, and then we might want to think about recording something for day of to put in the Caravan video. So we always compare it to like a dnc convention or something like that where they had the live and the recorded. So we want to make we wanted to have a good mix, but I like each yeah. That's great I love that I'm sure that Barbara will keep you posted on timing and dates. Although November is coming up really quickly here, it's almost here, so we can definitely I. Think use our list serve and be able to reach out to folks and put a request in for videos. As we get more information aside, you said three to four floats. What other organizations do you know of that are having floats, because that may make us be conscious of the content that we share and what we're saying, depending on what other messaging might be out there? Well, the bid of course and I think CB 9 has one and I'm not sure the other one it might be just B's. Actually, all right, that's great! So I want to open back the floor up for this topic. Does anyone have any thoughts, ideas, questions, suggestions on how to make our participation in this year's holiday lights really pop and resonate with the community feel free to raise your hand or unmute yourself? Okay, all right! We need nothing in the chat. Okay, oh hi, Diane you're on mute. Can you unmute yourself? Okay, go ahead! Oh we still can't hear you can you do you have? Is your volume up? No, not yet chanel, but you feel free to chime in anytime, I. Think we're calling so diane. Are you going to send us a note in the chat perfect? Thank you, Chanel good, to hear from you. We were just talking about holiday lights and sicily informed us that it will be happening in a more socially distant way that there will be three to four floats this year. That will be able to have three to four floats with only a few people on each of the floats CB10 will have a float, but it will be a hybrid holiday lights where it will be both virtual and outside and in person, and so one of the suggestions from our chair was opening it up to folks to provide short 30 seconds to one minute, teasers about their holiday light experience previously or now, and that we can share virtually before leading up to the day and then also hopefully have a virtual component on the day as well, and so we would just open the floor up for any ideas or thoughts. Chanel I see your hand up. Do you do you have any ideas that you want to share with the group? You just need to unmute yourself, I, think we lost Chanel, so, okay, so I just want to be conscious of time. Are there any? Does anyone Chanel's back on, but is there anyone else that wants to jump in or share any ideas or thoughts on the holiday lights? Go ahead, Debra, Unmute yourself Shatik! So just briefly, last year I did not go on the float. I stood outside the office. I think I was the cheerleader, so I was cheering you guys on and it was so nice seeing the colorful floats go by and seeing everybody waving and screaming. So that was a lot of fun because it was a lot more floats and other things and then I think Emblem Health right next door. They had food and cookies and stuff. So they had something for people to the different stores and stuff had also had something it just took you guys a long time to turn around and come back out. Come back, I'm not sure how far down you went but I know. I was waiting a long time and I said well where the heck cuz I was waiting for to come back. So I could wait before I went home, but it was just as nice and colorful just standing outside, watching it and stuff. That was a lot of fun with the music coming from the different stores. The apollo had a dj and they were, you know they had music and people was dancing. So when a whole 125th street was lit up, but I know now it's going to be different with social distancing and I do not know if all the stores are going to participate like last year, but it was just as fun just watching everything yeah I think that's helpful. I mean I was on the float and I got down at some point as well. I just think it was great. It was a great event for the community and you know I look forward to doing it in a safe way. This year, though, you raised a good point. You talked about food I, do not know, if is it possible sicily for us to maybe have on station somewhere like giveaways I do not know what materials we may have still have left in the office. There may not be any, but I do not know if there's any CB10 swag or anything that we might be able to share out at any of the places where we'll have board members that are not on the float, just a thought or idea as we're trying to spread the word about the community board. That's a really good idea. I do not know if we have anything on hand on our budget. This year has been cut, but but maybe we can think about some giveaways that we can do even maybe station ourselves in front of the building 215 like we did before and maybe do a quick grab-and-go thing so yeah. Let's think about that, that's a good idea, great any other thoughts, ideas, suggestions on holi! Are this year's holiday lights event? Okay, hearing none I just want to move over on our agenda to new business. Is there any new business that board members have that they'd like to share this evening? Hearing no new business from board members? Is there any new business from any of our community members that I have joined us? Is there anything that you'd like to discuss, share any ideas that you may have or any issues that you want to raise with the committee go ahead, Amy wanting to be conscious of time and of the fact that I'm new to this, I'm not sure if this is something that you've maybe already discussed. But I was curious if the community board is aware of these open culture bills that are before the New, York City Council and if that's been discussed in any way and if there's been any thoughts shared about those bills. Okay, so I can't say in any of our recent arts and culture meetings that we've brought that up or that's been discussed, but I will say you know we have a November meeting. That's coming up for the community board itself. Is there any bill that is timely right now? Is there anything that is up for discussion anytime soon, because I just want to make sure if there is that we elevate those conversations or if we can hold to our November meeting? Thank you. There was supposed to be a vote on it. October 15th, but it got pushed sometime in the fall so depending on when the November meeting is it's very possible. There's no date for a vote at this time on the open culture bills. Okay, that's helpful Amy if I would suggest, if you would not mind, just shooting an email to shetty Mitchell Shedtik, if you could put your email in the chat, our district manager, so that just flagging that for us, so that we can make sure that we stay on top of it and discuss anything before there is a vote upcoming and we obviously, as arts and culture committee, do not want to miss anything. That's going to be pertinent to our work and to the focus of this committee. So thank you for that. Oh Shatik has added his email in the chat. Thank you very much, shatik. Okay. If there is not any additional new business, I think we can move for adjournment because I think we've covered a lot of our discussion items. Would someone like to make a motion so I'd like to make a motion to adjourn this tonight's arts and culture meeting? Second, thank you all in favor, say: aye, nay, okay! Well, this meeting has been adjourned. Thank you so much for joining us this evening. We will see you back in November Amy. Please share that information, because we want to make sure that we elevate it in our discussion all right. Thank you all and Tiffany. Thank you so much for leading in this effort and putting our calendar together and please everyone feel free to reach out to tiffany and share with her any additional cultural institutions or museums that we should add good night. Everyone. Thank you.",
            "summary": "Everyone, welcome to community board tens arts and culture committee meeting this evening.\nBut I'd like to first start by having our CB10 members and arts and culture committee members go around and introduce themselves briefly, and then we can have our guests introduce themselves as well.\nI'm trying to get this debate, but I'm Derek Perkinson, a community board member I sit on two committees: talks and safety and health and land.\nCan you introduce yourself hi, everyone, Shadon, Smith, Community, Board, 10 member and also I'm a newly appointed member to the arts and cultural committee.\nSo we do want to be conscious, folks, time, but our one agenda item for discussion is the the arts and culture museum resource calendar that our board member Tiffany Reeves has been working on.\nIt actually came as a result of one of our previous committee meetings and recognizing in these challenging times with cover 19 and the pandemic, that a lot of our arts institutions are really having to adapt, whether it's that changing their working hours and social distancing to really moving into a more virtual space in order to share their exhibits and their work.\nThe arts and culture committee would like to do and is working on really gathering and information on a lot of our museums in the area and obviously in the Manhattan and upper Manhattan area, so that we can share that information via our website and use it use it as a tool and a guide, for you know just members of the community so that they can still find creative ways to enjoy art.\nBut I want to share it with the committee and with the community members just to kind of understand where we are with it.\nYou are feel comfortable, going out right now and doing something in a socially distant manner or if you do not, and you want to stay home, we want to still offer the arts and cultures in this.\nI'm sorry, our community members to see or flag any museums that they think we should add that we may not have on this sheet excellent.\nI just wanted to make sure like if we're just going to focus on museums and not to offer other places.\nI think the apollo is great, so you know I would suggest we add it.\nThe list to other arts related or cultural centers, beyond museums, and so you just I, just want to open the floor for discussion.\nYou have any additional recommendations for museums or other cultural places that we can add to this calendar folks that you think it would be worthwhile to you know, elevate and raise up for our community.\nI think it should just expand to the needs of the community, and if you know other resources from other institutions are or are wanted, we should definitely add them to the list.\nAnd I also think too, it can just be an ever evolving list like we could put it out and then say you know, we'll update it in real time and be able to just push that resource out to the community as we get updates so tiffany.\nWe've discussed the holiday lights activity or event this year in any great detail, but I do not know if you are on you're able to speak.\nSo, an idea I was having I had, was that maybe we can upload pictures from last year and that the individual folks of the arts and culture committee you all can do like one or thirty second videos.\nThis year, there'll be little spots throughout Harlem, where we could place community board members and we can kind of like broedcast a live from that area, and we just have to work that out with how we would dial into zoom.\nThere may not be any, but I do not know if there's any CB10 swag or anything that we might be able to share out at any of the places where we'll have board members that are not on the float, just a thought or idea as we're trying to spread the word about the community.\nIf the community board is aware of these open culture bills that are before the New, York City Council and if that's been discussed in any way and if there's been any thoughts shared about those bills.\nAnd we obviously, as arts and culture committee, do not want to miss anything."
        }
    }
}