{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB14",
            "channelId": "https://www.youtube.com/channel/UC_BAkpXTYFoKdHVRvswVgtg",
            "title": "Board Meeting",
            "publishDate": "2020-12-08",
            "shortDescription": "Monday, December 7, 2020",
            "lengthSeconds": "1:44:27"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB14",
            "normalizedName": "Brooklyn Community Board 14",
            "twitterName": "Brooklyn Community Board 14",
            "youtubeChannelName": "Brooklyn Community Board 14",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_BAkpXTYFoKdHVRvswVgtg",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "QqGo8ZDo0tk",
            "fillerWordCount": {
                "uh": 435,
                "um": 282
            },
            "readTimeFullTranscript": "57 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "youth": 36,
                "program": 29,
                "staff": 24,
                "programs": 20,
                "bylaws": 19,
                "health": 18,
                "summer": 16,
                "report": 15,
                "care": 14,
                "speaker": 14
            },
            "wordCountSummary": {
                "staff": 7,
                "manager": 5,
                "youth": 5,
                "bylaws": 4,
                "period": 3,
                "public": 3,
                "pandemic": 3,
                "hearings": 3,
                "course": 3,
                "care": 3
            },
            "fullTranscript": "Okay, this meeting of Community Board 14 is called to order on December 7th at 6:34 pm under the applicable statutes of New York state, the charter of New York City boards by laws and Roberts rules quarter. The board's policy is to encourage detailed public discussion of matters before the board at our commute at our committee meetings and our public hearings. Consequently, except by board members, there will be no public discussion at our regular monthly meetings of matters about which a public hearing or committee meeting has been held. Specific service, delivery requests or complaints should be brought to the attention of the district offices staff by calling the board office during regular business hours or by visiting our website anytime. Other matters of civic interest must be brought before the board during our public comment period, which is which will begin tonight. After all, other business on the board's monthly meeting agenda has been concluded. No partisan political appeals or advertising of for-profit enterprises will be heard, wishing to speak during the public come period. We're asked to pre-register at this time I'm going to ask the board's secretary to take attendance and I. Don't think we're gonna do the roll call, attendance and we'll, as in past meetings, take the attendance off of source up and appear on our participants list. Having said that, though, Anya, can you help me with that? I'm counting 25. We need 26 to have quorum. It's gonna give me one. Second, we have no very good okay, so that I the minutes were distributed and at this time I will entertain a motion to approve. Second, it's been properly moved and seconded that the minutes of the November meeting be approved all in favor, say aye or raise your hand, aye, bye, I, no I think this might have been easier if I just said all the polls say no, that's what we did in the past. Anyone opposed okay. That motion then carries district manager, Sean Campbell hi good evening, everybody just a few quick announcements for and in reminders- and we have a lot of this on our web page, which Anya continues to heroically update on a daily basis with a lot of information. So please check it out and check it out frequently up there on the website. You will see that public comments are being accepted by the MTA regarding fair and toll increases, the changes the hearings are being held on a variety just, and there are instructions on how to register to speak at that. There are also public comments being accepted through January 9th. Regarding the brownfield cleanup at Fort, I'm sorry 1640 Flatbush avenue. You might recall that is a development site that our board has approved for residential development that actually to sign up for that public hearing. There's a link on the front page of our website. Right now. We may switch that up and move it over into projects, but you should be able to find it on your website or email us. If you're interested in can't 1620 Cortelliu road, an item of great in our community will be heard by city planning on December. Oh sorry, I thought he had the date in front of me. It's December, 14th I, believe Wednesday, the 16th, yeah and so instructions on how to register to testify at city. Planning's public hearing is also on our website, I believe and it's up on projects attached to the 1620 Cortelia Road information right. So for those of you who want to say things, there's a lot to say things about, then we also there have been some questions about snowplow for the season and center train for snowplow many weeks prior to this and went through and drove the districts, and it's changed somewhat with some of the outdoor dining in terms of what equipment they're going to use in certain places, but they've got it they're all planned, but they're ready for it to snow I, don't know if the rest of us are, but there were some questions about outdoor dining and the responsibilities regarding snow and support and equipment and guidelines. Really, regarding that so department of Sanitation, recently I just came out with those guidelines. They have a little poster and they're ready for that too. So, for those seeking information on that it is now DSNY has now prepared it and are ready for that as well. That's really it for me tonight! Thank you, Dr Sean, Anya Sean! Do we have any elected officials who have joined us tonight? We do have Lien Weinstein on the line Weinstein on the line with us right now. Oh my that's right! Assembly mama! Would you please address the gathering here? We've missed you, we haven't seen you in a while. Thank you ed. Well, this is a much easier forum to get to than a normal board. 14 meeting so I do appreciate the fact, especially that meetings are on mondays. I am mostly in Albany and then when I'm in Brooklyn, even though board 14 only takes in a small portion of my district I know a number of the people who are board members. We keep in touch and I really just wanted to take an opportunity to say hello to people to obviously wish people a happy holiday season. I urge people to stay safe and I want to let you know that my office has, as do I, believe most of the other elected officials, but my office has masks handsets small bottles of hand. Sanitizer gallon balance, bottles of hand, sanitizer that can be distributed, we've been giving them to synagogues, churches, community organizations. So if they're in there is anybody on this call or if you know of an organization that either is in my district, that serves my district that could use these supplies, especially now, as the virus is increasing in parts of our community. Please reach out we're making these supply these supplies from the city in the state they're in my office, I'd like to have an empty office, because that means that we've been able to distribute more of the of these supplies than we have in the past and I did want to. Let people know that my office for the first, several months after the pandemic started, we were always remote. The office is now open on a almost full-time basis, with part-time staff, so that everybody has room to distance most things constituent issues. Community issues can be taken care of online on the phone, but we are available for appointments for issues that need in-person visit, whether it's signature notarization. Something like that. So really I just wanted to say hello to some old friends and new friends and for those who aren't aware my the 41st assembly district in terms of community board 14 kings highway is the southern border Avenue. At this point, Avenue and I used to have more of 14 but Avenue end and then to 8:19 18 19 street over by Bay Avenue, so and starting over by the Philip Howard Flatbush Avenue area, so again just stay safe, happy holidays and anyway, ed or the board members that I could be helpful. Sean just you know reach out to me and my staff. Thank you so much assemblymember. Thank you assemblymember. We always appreciate that and appreciate your staff as well. They're always responsible, so thank you. Ed Assemblymember, Bobby Carroll is also with us right now. Oh my assembly, member Carol, please good evening. Community Board 14, it's wonderful to be here. Let me echo what chair Weinstein just said. You know happy holidays, I know: Hanukkah is starting on Thursday, so happy Hanukkah to those who celebrate and if you celebrate Christmas Merry Christmas later in the month, happy Kwanzaa, I, hope. Everyone also has a great new year and stays safe and socially distant, as we try to get out of these last, hopefully, four or five months before we start seeing a vaccine and trying to get our city or state or country back on a more normal footing. I want to echo what I believe Sean had said before about testifying around the MTA fare hike and what is going on. The MTA is in unbelievable stress and a giant deficit, but what it shouldn't be doing right now is raising the fare on strap hangers bus riders. What we need to do is we need to make sure that we get federal relief and we also get state relief through certain tax raises and revenue raisers, so that we're able to balance the budgets of the MTA, the state and our city and not on the backs of working folks, because we need people to go back on to the subways. We need people to go back out there and we don't want to see a truly doomsday scenario where fares go through the roof and services are cut and, of course, the MTA has currently proposed a possible cut of 40 percent of service on our bus and subway lines, and over and almost 10,000 employee layoffs that we're going to be going up to Albany at the beginning of the new year and the most important thing we're going to be doing is: how do we balance our state and city budgets? There will need to be revenue raisers, there will need to be borrowing, there will need to be smart judicious cuts and we will need federal relief and hopefully abide in administration will produce a lot more federal relief than the Trump administration has my office 2 is currently open, but we will be closing for the holidays for about 10 days around December, 22nd 23rd, and then we are we're closely monitoring the Covid-19 situation and what is going on and how the city is reacting. I know that we've reopened schools again this week, the elementary schools, if you have any issues around school closures, around closures or zones, please feel free to reach out to my office, worked with assembly member Simon today to put out a letter around middle school and high school programs for autistic school-age children in the nest programs that have been shut down and trying to see. If we can reopen certain programs for children in special education, which I think is very important and necessary, but I will stop there happy holidays. Please be well and stay safe. If anybody has a quick question, would love to answer it, but I know you got a big agenda in front of you. We can take one question in one question: okay, hearing that thank you so much assemblymember, yes, I have a question. I'm sorry! This is Harriet Hunt! Yes, no Mr! Yes, Mr Assemblyman, Carol, yes, I wanted to know like what plans do you have of helping with the 1620 Cortelli Road project? As you know, safe could tell you. We've reached out to you and I just wanted to know what your plans were. Helping us move forward so 1620 Cortelia road is outside of my district, that is a assembly woman, bashat's district. It's a couple of blocks, I think it's about two or three blocks outside of my district. You know: I am familiar with the project and development issues are very difficult and that part of Dipmus Park, Victorian Flatbush, is a low-slung neighborhood, and you know I'm concerned of buildings that reach new heights in the sense of I do think we want to make sure that things are proportional. I'm not 100 sure what the height of that building is what the density is of that building. I also want to make sure that we keep supermarkets in our neighborhoods, but I do believe. The key food would come back after the construction, but I I've taken no formal position on the project and usually I wait for my colleagues who actually represent the area to make decisions and I don't know if Assemblywoman Bashad, Senator, Parker or Councilmember Eugene have I do think. There's a real balancing effort. I just worked on a rezoning issue with council member Lander at Park circle at the border of Windsor terrace in Kensington, where we were able to get three stories taken off a building that was looking for a rezoning and I think that was very fruitful and I do think. Smart community engagement with both the owner of the property, the developer and community residents is a way to kind of is the best way to kind of go forward for these types of projects. Thank you for that question and thank you. Assemblymember Carol, Mr, Chair Glenn Woolen also had raised his hand. Okay, sorry I forgot to take it down. After sorry, it's gone. Okay, do we have any other elected officials with this at this time? I don't see any term I, don't either yeah fine thanks, honey. Okay, then we'll go ahead with the chairs report and yeah. There are no public hearings or executive committee meetings to report on this evening, but I do wish to make a few announcements number one. A belated welcome to our new board member Zach Khan Mr Khan has already joined us at committee meetings and public hearings and I really appreciate his willingness to jump right in the true board, 14 spirit. We have a full 15-member board now and I'm pleased that there's so much community interest in working with the board. Remember if you're, not a board member but wish to participate on our committees. Our bylaws allow us for public members. You know on all standing committees so feel free to join in, even if you're, not a board member, please let us know if you are interested, whether you're, a member or not all meetings of community board 14 are open to the public. Please continue to join us and encourage your neighbors also to join us number. Two I want to provide an update on the bylaws committee. A few members have volunteered, but I do feel that it's important that the committee reflect the diversity of the board and we have not yet achieved that goal. So I'm asking for volunteers again, especially women and people of color, to consider this one more time. Please I hope to appoint the committee prior to our next board meeting. We have several people who've already signed up, Glenn Mullen, Steve, Cohen, Joe Dweck, and you know I I'd like to see more so consider that. Thirdly, community board 14 has been asked to serve on the former ps9 Psn 90 task force chaired by council member Matthew Eugene and the Brooklyn bubble. President Eric Adams the Task force will work simultaneously with Hpd's procurement process to prepare recommendations on development details such as income levels or other characteristics of the affordable homes, ideas for the youth, educational and vocational training, space desired ground floor uses, site layout and building design historical memorial installations and more I have asked district manager, Sean Campbell, to represent the board and to report back to me and relevant committee co-chairs along the way the community, Environment Committee will have a report on their recent meetings with HPD and EDC later this evening with more detail on the project and that about does it for the chair support report and moves us on to tropical committees. Mr chair. If I may, a point of information Jonathan does here in terms of the bylaws committee, could you just remind us what the purpose of this bylaws committee convening is what like the proposals were or the scope of it that was proposed for it to be formed? Well, historically. Well, let me say our bylaws have become somewhat outdated I for one of a better word and not serving the purpose that we need for the board, and there have been many comments. If not complaints about that- and you know, over a period of years, actually we've been trying to you know, bring a bylaws committee into effect to kind of look at the bylaws revise what needs to be revised and so far it's been touch and go, and we've been somewhat unsuccessful at getting that point. So at this point, I'd really appreciate, seeing you know a more diverse kind of committee here. You know, like I, said especially women and people of color for coming forth to participate on this John I. Don't know if that answers totally your question, but that's kind of a historically where we are, but I'm sure that there are some other issues that you know if you would like to mention please too I. As for me, I, I'm just I know that we did a bylaws revision back in 2015, 2016, 2015, yes, 2015. and so I. That was predicated on us. A handful of specific needed changes and I believe that a lot of the interest at that point was around addressing those concerns and so that my question mainly was and I appreciate the historical context. I'm sure there are a lot of the new board members who don't know that, but I also was wondering if there was one or two of the key complaints that might be the driving force, because Johnny can I. Oh I'm, sorry too, I'm just gonna say because that might actually clarify maybe, but in particular I mean in general. It's a good thing to have diversity on a bylaws committee, but maybe also to clarify the implication and then maybe that will also help jog some ideas from certain members of our board who want to partake in it sure. But my recollection of the genesis of the conversation was questions about our lack of specificity in some of our personnel action language in the bylaws, so that did start the conversation and then there was a question at the time at the very beginning of the executive order that allowed us to hold board meetings remotely in a way that's still comported with the open meetings law and whether or not there needed to be questions about voting. You know, clarity on terms in terms of how we would vote if there is a an election that is a where there's contenders in election. That is something that we escaped any problems with, because our vote for executive committee was held prior to remote meeting, but some of our colleagues in Brooklyn and I suspect citywide had real hurdles in terms of how to conduct their vote. So those were two issues that just were batted about and there wasn't a specific. We need to change bylaws, the Dorner for it to say tax. There was a question about whether or not they're as tight as they need to be, and if there's enough information enough language in there now regarding how to handle things remotely I hope that helps it does Sean. Thank you very much for heading to that. Thank you, John and thank you Sean. You know it's nothing better than a great district manager, so that are there any additional questions on the Bylaws Committee Nina has a hand up. Steve Cohen has a hand up and I think Steve. Cohen might also have a memory on this yeah. Thank you, Mr, chair yeah. The only other thing I remembered going back last year was I think there were some changes to the process by which community boards evaluate membership and commitments to diversity and the city charter that was recently adopted. So I think there was some discussion of like oh should we incorporate some of that into the bylaws or at the very least you know, because the last round of bylaws was before that you know: should we review the language just to make sure you know all our you know, cross lines are dotted. That's that thing also I see that Shaheed in the chat seem to express joining the bylaws Committee. If I'm interpreting his comment correctly. So that might be. Hopefully that is super groovy, but I do want to say that any board member who wants to be on this bylaws committee. Please email us in the office at the info address and we can capture some things in the comments, but they don't become part of our records. So Shaheed I know where to find you, but if you could send an email that would also be great or give me a call thanks, and that goes for everybody. Please email us in the at the info and thanks to Israel and Duane for both sending an email. Just now on this. Thank you for volunteering, fantastic Nina, yeah well, I have before I volunteer for something that I can't handle can could I have some idea of what kind of a first of all how many? What kind of a time frame are we looking at in terms of getting this done and how much time do you think is going to be involved approximately well, the I mean there is no real time frame because you know this is something that's been going on a long time. I of course, I would love to see it. You know see some resolutions come forth, you know as soon as possible, but there's no real rush or real timeline. You know to that extent. As far as how much of your time this will take up, which seems to be part of your question, it would be you know, like any other committee meeting, you know when the committee meets, and you know not all committees, all right. You know most committees do not meet on a monthly basis. You know so and I'm sorry to interrupt again. I won't make a habit of it, but the last time we did have a bylaws committee. There was a monthly meeting until the issues until the bylaws were reviewed, so it was one meeting per month in addition to any other meeting requirements that board member has thank you, Sean Joe Please, based on what Nina just said, which is really important. Maybe we should press the issue and start the ball going forward, as we say in football, so maybe the folks that have including Shaheed who who's ever signed up or interested in being on the Bilo's committee. Maybe we should all get a copy of the current bylaws. Maybe you should schedule something working so we can have something in progress, so we start to address it. That'll give us some forward motion rather than being nebulous and in the process. Thank you, Joe great idea, and what I'm going to ask is that you know I'm going to ask the district manager when we get a full complement of people. You know we'll give it maybe a little time for all the volunteers to come in and then go ahead and set up a meeting. I will make every effort to be present and we'll get the ball rolling. As you said, I didn't know, you were a football fan. Oh okay. Anyone else just wonder a little bit, because that wasn't really football terminology. Joe has a hand up. I was on the front line, we're not that smart Steve go ahead. Mr chair I, I'm a little confused as to direction of this change of bylaws. Since I was on the last a number of years ago and I remember going through whatever need to be gone through. What items are we addressing to be clear that need to be addressed? To make change? Well, I mean you. Several items have just been. You know spoken about. You know why? Don't we do this? Why don't we set up this meeting and during the first meeting, all that will be, you know, will be taken care of any questions about what needs to be done. Why we're doing this? Why there's? You know why there is this meeting to possibly revise by laws. All those questions can be answered in the first meeting. So if you don't mind come out to the first meeting and you and anyone else who might be interested even if you're not really interested in serving as a member of that committee, maybe you can come out and offer some enlightenment or become enlightened yourself. Sean will you're welcome Sean, we'll put the information out, as you see that, once this meeting is set up, that it'll be publicized and you know everyone invited who would like to be. Thank you, okay, you're welcome. Is there any other discussion on the bylaws? Okay, then, let's move on to the topical committee report, starting with youth services, any of the chairs available here we're both available I just figured that if you I'd give you the first pick, if you wanted to sure you worked particularly thank you Jonathan good evening, everyone thank you for always taking the time out to participate in these meetings. You know our community engagement is critical to you know, helping us move ourselves forward, as our society is changing on a regular basis. So I on behalf of myself and my coach here, I know that I want to thank you guys for coming out to this meeting and also for our youth, Services Committee meeting. So our meeting was held on Monday November 23rd. We invited speakers from the Department of Youth and community development for New York City, as well as the Vista program. Through the mayor's office of Immigrant affairs, we asked the representative from the Department of Youth and community development DYCD to speak to the workforce, connect programs that they offer. Specifically, we were asking about the SYEP program which, as you guys know, we have been hosting a youth conference for well over a decade now that's been very successful and has been anchored around helping young people find jobs during the summer on internships during the summer, and we've been heavily dependent on the DYCD application process and program and providers to accomplish that. So, with everything going on with the pandemic, we wanted to make sure that we had a better understanding as a committee and as a board and for the community what the path forward look like from DYCD and their programs, so I presented with Sarah marks from DYCD and just to give you some of the highlights of the meeting which is available on the community boards YouTube page for review. If you'd, like pardon my scruffy, look at the time, it hasn't changed much since I'm growing my afro up for the next couple summers, so we discussed with Sarah what the DYCD programs were. I'm just gonna highlight a few of them, so DYCD programs are delivered by local and citywide community-based providers. Dycd itself acts as an administrator to these programs for granting funds, and then the providers themselves facilitate the program. Dycd operates after school programs via their cornerstone compass Sonic, which is spelled S-O-n-Y-C as an acronym and beacon programs. They offer as well through those programs in some cases, in parallel adult literacy programs at several of their sites. The DYC workforce program themselves connect and serve 14 to 24 youth. The main program like I, said that we focus on is SYEP, which is a summer youth, employment Program summer. Youth employment usually employs somewhere near upwards to or just above 70,000 young people for six weeks every summer because of the pandemic they've they had to pivot and reimagine the program for this past summer, doing it completely virtually creating a bridge program so to speak, but they were still able to provide services to a significant number of youth across the city. The numbers we got was were 35,000 youth total across the city a little over twelve and a half thousand youth in Brooklyn, and specifically in CB14, approximately four and a half thousand young people were able to participate in the summer youth Employment program. The primary providers for summer youth employment. This past summer, in community board 14 were the council of jewish organizations of Flatbush, which many of you may know them as Kojo, and also Canba Kojo. Specifically, they highlighted a point that Kocho worked with 40 years old students or 40 young people, rather with my in partnership with modernity's hospital to examine barriers that candidates face while trying to enter into that industry specifically focused around diversity. So these young people had an opportunity to do some really good work this summer, and we hope that program is expected to come back next summer, fully funded as of right now in the planning there's, an understanding that it will be fully funded. This year was funded at 31,000 31 million dollars rather, but the expectation is that next year in 2021 that the programs will be fully funded, so we can expect to see. Hopefully our numbers go back up to near 70,000 kids for during you know the service of 70 or opportunities for 70,000 kids over the course of the summer. Through that program they also spoke about their advance and earned program. Advanced urn is a youth. It's a program targeted to youth age 16 to 24, where not in school, and not working to help them achieve their long-term career goals and educational goals includes a literacy and math skill programs high school, equivalent test prep, as well as recognize training programs in various industries to get these young people credentialed and certified. In some cases offering internship programs it's a six month intensive program. So it's a lot longer than the typical DYCD summer youth employment program, which is six weeks. This is six months they're being offered remotely at the moment. There's several programs throughout the city. We were told in Brooklyn that program is administered by opportunities for better tomorrow, which is known. You know locally as Obt so and specifically, Obt is offering a digital marketing program. However, if you check the board's website, you can get a link out to the Dytv programs, and you can also find out about some of the other opportunities that are being offered through the advance and earn program around the city. And hopefully you can get some of the young people enrolled or recommend them to these programs to get themselves enrolled and find some opportunity. Lastly, the other program I wanted to kind of highlight, was the learn and earn program which is focused on high school, juniors and seniors. That program provides participants with academic support, college application, assistance, workforce readiness, training, service learning and leadership activities. It's a that is also a six week summer program. But again it's focused on specifically high school juniors and seniors. There's several other programs quite a few to go into. We encourage everyone to check out the board's website and also the DYC website, which is you can find it Nyc.Gov forward, Slash DYCD, so please go check them out. I, don't know if anything additional you had to add here, Jonathan for the DYCD update no other than it sounds like they're planning for things to go back to normal next year and that's good news to all of us. Hopefully it stays on track for that. Yes, the second item on the agenda for that evening was- and this is part of an initiative that at the board will we're trying to start a youth committee, we're trying to encourage our young people, our youth, to engage with the community board specifically, but in general, just a community in general, getting out and being civically engaged and hopefully building out the next group of us, those people that want to participate in their community and make a difference. We had a presentation again from representatives from Vista, which is which I found out after the fact was. This is an acronym for volunteers in service to America. It is similar to the Americorps program or part of that kind of catalog of programs, and the primary responsibility of Vista is to, according to their site, is to support NYPD government agencies to lift New Yorkers out of poverty by increasing effectiveness and efficiency for the agencies that they're supporting. In our specific case, they were running, they run or help organize youth leadership councils. So we were hoping for some direction from them and advice from them on how we could better engage our young people in again forming a youth committee and building out that program. The goal again ultimately is to have our young people participating in the board. We've discussed several different ways that they can participate. The hope is that we'll have a youth committee that will be able to have representatives on you know, sit with each committee of the board to have full engagement with the board, so we're hoping through some direction from Vista, and we're also going to be continuing to reach out to other community partners to just learn how we can better engage our young people and get them involved and correct me if I'm wrong here Sean our goal is to kind of start engaging in our young people sooner rather than later, so that we can start the process of building this up and building a base of young people that can engage and move this forward. So we don't want it to kind of stagnate over the next couple of months am I, correct, Jonathan. I've heard of the committee church on that, but I think that we have a lot of I think we have a good platform to spring off of, and now I'm mixing up my sports metaphors, but I think. Certainly, we've got to talk about what the youth conference is going to look like this year and I think that forming a youth leadership Council of our own could be part of that discussion. So I'm still very excited about it and appreciate the enthusiasm from all of our co-chairs of all the committee and I just want to add before you know, I pass it on to my colleagues like just a reminder like our that the CB 14 news conference, which actually was an started by chair Ed Powell and a few other board members has I know when I joined the board. I was amazed at how many young people the board, was helping. Last this year alone, I mean last year we had a great turnout. The previous year we had a great threat. Even this year, pre-pandemic, we were literally at Brooklyn college. The day just decided, CUNY decided to shut down, and we were there with over 600 students or 600, because young people, I'm learning from friends and family members you're always in the teaching mode, but there were 600 kids and their parents and I think it was some 60 something plus organizations with the hope not knowing what was ahead of us, but the hope that they were going to have opportunities for internships for during the summer. So this is something our young people are interested in and we should continue to encourage it. So, whatever it looks like moving forward, we encourage board members to participate in it, get companies, friends, organization, whatever you can get us to help us move this forward to help our young people find activities that are productive and worthwhile to keep them out of trouble to keep them engaged to get them ready for the workforce to get them ready for college. Let's continue to do that, so the mic or the platform to my co-chair I, echo everything that Dwayne said, and you know working with as a staff member when I was a staff member Edward's, coach of the Committee and Doris Ortiz, our former district manager and I believe Mary Walters was your co-chair at that point. Still was it Beverly and I'm trying to remember it goes back, but yeah I mean that there's a lot of history to what our youth Services Committee has done over the years with the youth conference and, quite frankly, so many of our board members president and those who have moved on have played an integral role in building it up to what it is today. So of course it's a big thank you to all of you and the community at large and, of course, the district manager staff, which is the linchpin, I, think of actually making sure it happens. All of us are very nice to have and we're important, but not nearly as crucial or critical as the district manager's office, especially with Sean all these years now, Sean I think as district manager. You have more years than not having helped make sure that the youth conference continues to live on, given its history. So again, thank you for that. The one thing that I want to just highlight in that we will have to meet again and we're going to talk about what the youth conference will look like and depending on what restrictions may still be in place during the pandemic and how that looks. Certainly, we have plenty of models of virtual events. If that's the way it has to go, if that's the time frame, we pick depending on everything, falls into place. There is one more thing, though, speaking of Youth Leadership Council getting people engaged at a young age, the New York City, Civic, Engagement, Commission and I want to thank Michael for reminding us about that in the chat. Michael Cedillo one of our board members, because I almost forgot to bring it up, which the NYC Civic Engagement Commission recently was formed by referendum on the charter. Revisions, I think, two years back, two three years back, I, don't remember exactly when, but recently, and one of the initiatives in getting more people involved in the process is extending participatory budgeting, but specifically for youth. So there is going to be an opportunity to allocate, through a participle, to participatory budgeting process, specifically only designed for youth to partake in of a hundred thousand dollars on projects around the city that they will get to weigh in on, and it's gonna be youth between the ages of nine and twenty four. So it's a pretty huge range, but they do all qualify as youth I remember when I used to qualify as a youth, maybe some of you I still do I, don't know, but they're going to be starting. This process, you're working with Corvo New, York's leadership, centers, participatory, Budgeting, Youth, Fellowship program. It's called it's our money and, to sum it up, if you want to find out more information about it, go to Participate.Nyc.Gov again, that's participate.nyc.gov and you'll be able to find more information how to get involved in that process as well and we'll be here to keep finding new ways to serve young people in our district and beyond stuff I'll. Leave it to you during or I'll turn it back to our chair. I'm fine! Thank you. Everyone have a happy holidays. Thank you, guys, excellent report, wealth of information, Mr chairman. We do have Councilmember Kelman and, of course, before we move on, we have to acknowledge a councilman and ask him to speak if nothing else, because he was a former board member of court for 2014. Well, thank you. Mr chairman, you know. I still am a board member I, just don't get to vote anymore, but yes, first John, I, think they're, I, think I. Remember when you and I were both youth on this board doing the work you were doing, I remember when John started and for Dwayne I wish. You know I was listening, I chimed in towards the end councilman, dutch and I had a town hall tonight that just ended but I you know I was listening to you speaking I wish there was a way and I bet. Jonathan could figure it out somehow not to put a pressure on him that we could actually figure out the number of youth that Community board 14 helped over the total years that John and the board have been doing this work going back to when Terry was district manager, because this work is incredible and every year there are more and more kids that get help through this work- and you know, then they go on they're, not kids anymore, and is there if there was ever a way that total number? It would just be interesting to know, because this is really important stuff and the number of lies that have been affected just by that one night. That effort, I'm sure, are incredible. I don't want to take up a lot of time because I know you're already an hour into the meeting and I just showed up. So I'm gonna defer any substance as I usually do because I don't have substance but I'll defer to another time really I just want to tell you all I miss you all I love you all I miss seeing you in person. We have to take it this way. Some of you I do see from time to time, but the rest of you I just want to wish you all a happy Hanukkah, Merry Christmas, a wonderful new year, happy Kwanzaa, whatever you're celebrating even if it's Festivus just enjoy, may this time next year be a time that we can all gather together and be in person when we're celebrating, but for nothing else. I hope, God willing to see you in a 2021 which ought to be way better than 2020 was stay healthy, be well and thank you, council, member, for those heartfelt remarks and I'm sure that the feelings are mutual transportation committee hi, it's Joel Siegel. How are you doing tonight? I don't know I missed the beginning of the meeting, so I don't know if Sean announced it, but this morning I got a message from the 70th precinct that they're having their having a traffic initiative with the chief of transportation over the next two weeks from today until Sunday the 20th. It's a high visibility initiative. They will concentrate enforcement and education on the entire corridor for two weeks and involves summonsing as well as numerous outside units, including traffic enforcement agents, tow trucks etc. So that's from the 70th precinct, so they encourage people to follow the traffic rules and egg regulations so as to not be stopped by law enforcement and another item I plan on attending this there's a information session and Q&A with the New York City Department of transportation. This coming Thursday at six o'clock, maybe Sean can post this on the website. Citibike is expanding to in Sunset Park, South, Slope and Windsor Terrace. So if you want to learn more about that, you might want to participate in this information session for this coming Thursday. That's it! Thank you Joel! Thank you! Public Safety Sean. Did you want to comment on that? No thank you Joe for putting that information out there thanks. Okay, public safety, yeah. We have a report from meeting that happened this past week on Wednesday two and I'll. Just give you a quick report as quickly as I can get to it. I'm going to do a reverse order this time, because there's a lot that has to be said about from the precinct, so we'll start with Canberra. First, we had representatives represented by Rick Rodriguez, although Canvas serves a variety of issues such as economic Development, Youth, Development, Family support, Health housing, legal services, just to name a few Rick gave us a more in-depth understanding of the unit of family support services, any person who is a victim of an assault of any kind. They should contact his office to avail themselves of the various services that he has to help them. This includes. If someone lost a family member to violence, there are ways to get compensated for a variety of items, including burial services, and in my report, I will send in to the office, will have the contact information just to jump on what was just mentioned. Deputy inspectors report is number one. The traffic initiative that's being put in place was is clearly from 12 7 through 12:20, and it is on Coney Island Avenue. So that's where the initiative is, it will involve as with as well as outside units, including traffic enforcement, tow trucks, I'm not quite sure what that's all about, but that's what was sent out to people now. The second part of the report will go through the first part of the meeting which dealt with the state of precinct and how they saved the information given by Deputy inspector David Wall commanding office at NYPD 7-0 precinct. During this past period, November 2-29 that 2020 there was a 14 increase in robbery. People should be aware of sales on the Facebook market, they're just trying to sell you something and once they get your money, they're added a picture and you get absolutely nothing scams, they're still attempting to get people's social security numbers and other personal information under the guise of speaking to Nyd or Social security, police and threats of being arrested. They are targeting not just the elderly at this time. They are talking everyone, young and old. They don't care about the agency, apparently kids under three still get credit cards. Somehow there were three additional rapes this month. One we all know about was in Paul of a medical office. The perp was arrested and is sitting in jail. There was a second rate, I, don't recall the incent itself, but there wasn't. Then there was a 16 year old had some connection with a 25 year old boyfriend that is under investigation. Burglaries, went up from 11 to 14, mostly commercial, be aware of street entry to basements of stores. Also, you mentioned, you know it's outside. You know. When you go downstairs to the base distorted to go to the basement. That's apparently the way some of the people been getting in. He also mentioned that there was only of all this of all the incidents. Only one store had an alarm that went directly to the police department. As far as grand losses were concerned, there was an increase in vehicles stolen due to keys left in the car. There's also been fire shootings. As we all know, there are some cars that they're trying to say they put on these paper plates that are being used, they're looking into that, but he did want to warn everybody to please be aware: don't leave your keys running in the car and going out even for 10 seconds, because somebody jumps in your car gets stolen. Okay, that's one thing, but how much can you live with that? If your car was used by that perp in a drive-by shooting and somebody got hurt? So please keep that in mind, secure your car but put out of sight as far as the source will. He said there were four shootings this month. There was one arrest with that. He also mentioned that of based on a question that was asked. He said of the 30 burglary arrests, 15 of them were recidivists, and only three of them are sitting in jail. This is something that I want to mention that this committee will be looking into to clarify as to where is the justice for this horrific statistic. In addition, we hope that we'll be able to enlighten the public regarding this matter in one of our future meetings. Holiday tips online purchases better, instead of sending it to your home, send it to the local store and pick it up from there. It's much safer. You also mentioned when you take your credit cards, don't attach it to your cell phone and your money, because once you lose one, you lose them all. If you don't lose them, you have them again and as far as cars are concerned, please leave items that out of the vision of anyone looking into it. He did mention that he's looking to increase the presence of officers subject to the budget, obviously for the weekends from Friday through Sunday. He did also one second and let's see, what's taking, there's one more thing here. Ah, two more things: okay, he mentioned that there is a meeting for the NCO letter b as in boy at 1087, Ocean Avenue, on December 9th at 7 pm. The NCO D for David will have a meeting at 157 St Paul's place on 12:16 at 7 pm. There will be a virtual meeting at 7:30 for the 70th Community Council meeting I, believe that is on the 21st at this time. The Public Safety Committee wishes all faiths a happy and healthy holiday and new year to all it's back to the chair. Thank you. Sweet Chairman Powell can I just ask a follow-up question. This is Stephen Cohen, of course, Sv I meant to make the meeting and I wasn't able to just because you mentioned the paper plates issue. Is that something that if people see paper plates in the community because I know some of the shootings that happened over the summer, that those were the paper plates? So is that something that the police is encouraging presidents to notify the police? If they see them or is that overkill? Because there are enough legitimate paper plates out there, that people shouldn't take that step well, any of the paper plates that apparently do not look legitimate. Obviously the police department would like to hear from you know from the community or if they see them, let's say, for example, driving erratically, and you suspect that maybe those are false paper plates. They would like to hear about it as far as real. You know, paper plate that are being issued by various different agencies. You know whether it's New York New, Jersey, etc. It is what it is, but yes he's very interested. He will be investing. He is investing currently about those paper plates in the use of crime. Thank you for that. No problem, human services Ed. It's joked. What can I say about the steward memorial anniversary of the debt of the murder of Dylan Stewart was a jamaican accountant that came here to New York and when he had his first daughter, he decided to change his life to try to make to try to do more for people he became a New York city cop. He was assigned at the 12th midnight to 8 a.m, which is the most difficult portion of the day. That's when all the bad things occur, he stopped a regular person on a he stopped a regular. The traffic stop going through a stop sign. The person pulled out a gun and shot him right between his vest. It went directly to his heart and he still followed that Perp Dylan Stewart was such a tremendous person. He used to go after he would arrest somebody. He followed them up and tried to get them. Food tried to straighten them their lives out. He was an unbelievable person and his loss is unbelievable as well. He was not just somebody who died tragically, but his life was just an enormous loss to all of us and I wanted to tell everybody about it. Thank you, Joe for adding that human services, even everyone, Joanne Co-Chair, Human Services Committee, acting chair of the census, 2020 Complete Count committee task force with regard to the census task force. Cisno report we're waiting until there is some decision making on the part of the bureau and the incoming administration, whether or not they're going to truncate the count or perhaps add a mid census account in five years. With regards, we have a report for a committee meeting that occurred on Thursday November 19th also conducted virtually. We had two agenda items. The first agenda item was from the mayor's office of Immigrant affairs. It was a lovely presentation from a fellow she provided a tremendous amount of information Germain to immigrants and then also coordinated with the Covid-19 pandemic, providing information from all spectrums. With regards to obtaining I d and even sadly, if you have a family member that has passed due to Covid-19 how you can receive a stipend to help to intern your family member, so very informative. I know the board office has all that information if any of our immigrants in the community should need information for those services. The second agenda item was regards to the Kingsborough jewish medical Center, acute care bed closure if you're not familiar or did not attend that meeting. Kingsborough Jewish medical center, which is located on Schenectady Avenue closest to Winthrop. It is an acute care hospital with an adjoining nursing home and full of full disclosure. I am a staff member there as a registered dietitian. The acute care beds will be closing as of December 31st. This is both a measure to provide attrition for Medicare and Medicaid safety net beds and to reimagine the merger between Brookdale Kingsborough, Jewish, Medical, Center and interfaith medical center. As one system called one Brooklyn health, we were joined by myself, who is a staff member other staff members by several doctors who are also public health advocates. We had a representative from Diana Richardson's, the chief of staff from Diana Richardson's office, who was very deeply involved in the decision making for the transformation, and also for the director of communications from one Brooklyn health system or kingsborough jewish medical Center directly. So the discussion really centered around what are the implications of closing these acute beds during the pandemic? It is the opinion of the public health experts, the physicians that are attended, that this is poorly timed. So recently, this is the this announcement occurred. After our meeting, but the governor Cuomo has asked all hospitals to increase beds by 50 to accommodate what we are expecting or what is actually the second wave of Covid-19 patients who will need acute care. So it remains to be seen whether or not those beds will actually close on time. I can say from experience and from a report that the beds that we have not stopped admissions at the hospital and it is the beginning of December. We were expecting admissions to stop, so you can find, of course, the full details of our committee meeting on YouTube, but it was a very productive discussion. I think that our committee meetings and those that attended from the community and that attended from the board outside of the committee found it very relevant and important to form an opinion and discuss it within our community. Whether or not we should be closing a hospital at this time. I want to, on behalf of the committee, to wish everyone who celebrates a holiday in December, a happy holiday and I want to wish everyone a happy new year. 2021 will continue to be a very challenging year. I know no one wants to hear that, but this is how, from a perspective of a healthcare worker, this is how it looks. I really want you to remain diligent and vigilant, and please do you know I wish you the best of health in the coming year and the rest of this year, and that's all I have chairman. Thank you so much. Thank you, Joanne, a very informative report and by the way, thank you for your amazing work on the census. Thank you so much. It was really my pleasure. I can't wait to find another. You know over overarching topic for our committee to really dive into. There are so many very important topics that we need to address, particularly how public health is social Justice, how public health is a matter of race and I? Look forward to working with the committee to find the next topic that we can really apply ourselves to and create and really engage the nonprofit roundtable to work in the community and be unified. Thank you again, education, libraries and cultural affairs chairman. Is it all right if asked Joanna question real quick I'll, hear you Mr Amber? Yes, of course, please do ask me a question awesome, so Joanne by any chance when governor Cuomo made his announcement, did he say by what time they would I guess notify the various hospital systems? Whether or not the expectation is you know in the king's book Jewish center, the closure by December 31st circuit would be postponed. So you know, let's delineate, what's going on so one Brooklyn health system is carrying out the orders of the New York State Department of Health to go ahead and merge the system and close the acute care beds so that those buildings can be transformed. So, let's just identify the closure has to happen before the transformation. So once the closure happens, the transformation of that building will occur and those spaces will become acute. Sorry will become outpatient and ambulatory care. So now that- and that's really the elephant in the room is if the state is the architect of the closure, but yet they have turned around and said we need all hospitals to expand. There's been no information that has been conveyed to me as a staff member, whether or not we're gonna hold off on closing the bed, and we did already once postponed the closure of these beds. That was supposed to happen for the somebody has their somebody needs to mute themselves please. So we already postponed the closure of these beds, which was supposed to happen in June we halted or they halted that so that we can care for the first wave of patients. We really I do not know what is going to happen. The most up-to-date information that I have is the agency nurses that are working in place of staff nurses that have left, because when we know that we're closing staff, of course, is going to find more stable jobs. We do know that agency nurses were asked to extend their contract by seven days, so it's possible. We will still close on the 31st, but then the agency nurses will stay for a week just in case, but we don't know it's really all in flux and what's at stake here is patient care amongst a second wave and then also the staff that is left to care for the patients and how we how they are in limbo. So I hope that can answer your question, but the state is the architect. The administration of one Brooklyn health is carrying out the plan, so I know that there is a lot of money at stake and I'm not sure if any of that money has been distributed. I know that the actual closure of the acute care beds is the demarcation of when perhaps the 700 million dollars will be distributed to the system. Okay, thank you Joanna. Thank you very much for that. I appreciate it. Of course, sure I just interject here sure, okay, so I am a medical provider at Brooklyn at the king's brook and to the best of my knowledge, they're moving ahead. I know that they've had trucks outside that I've seen other places they move medical beds and other equipment out and in some cases, move it in so I. Don't know whether the plan is that they're reopening floors at Brookdale that have been closed in the past. You know, then, I'm not at that end to see what's going on, I also know that they've been, you know, posting things to the nurses. You know that and other staff that are part of 1199 to contact them about finding other jobs, other assignments either in the hospital or elsewhere. So it seems as best unless they come to a screeching, build on. All of that, it seems that they're moving ahead with closing those units and the feedback. I've gotten administration has been, they kind of go oh well, and it is what it is well I mean Nina I understand where you're coming from, but we are still operating 143 beds. We still have admissions coming into the hospital. We still have what's called k1a beds in the emergency department that are holding patients until we can actually admit them to the transition floor, which is burger. Four, so as of right now, today we are still taking patients. We have not closed any units and we were supposed to have closed another unit by now, so I think they're just waiting they're waiting yeah that, but even though they have opened a resource center for a staff, it's not anything. Really, it's not a telltale sign that this is actually going to happen, but it's also not a child television. It's not going to happen yeah! We can help facilitate on this. We do have other agenda items on that. I think the chairman wants to move on to I, appreciate the conversation and let me know if you want to facilitate more, but if we could move on ed sure thank you, Sean Education libraries and cultural affairs. Thank you, chair Powell, so the education, libraries and Cultural Affairs Committee on behalf of myself and co-chair Carl Henry Caesar, will we're having our we'd like to invite everyone to our Monday December 21st online meeting at 6:30 pm. At that meeting, we will hear from will get an update on public schools from Professor David Bloomfield of Brooklyn college. Also, the Brooklyn public library will update us as to what is going on at the library these days and Flatbush development corporation will also present as to I guess their what's going on at Ftc in terms of cultural affairs and any education related items that they can provide. Information on I know that, as fee mentioned, there's also the community council meeting that night at 7:30. So we will try to move through our agenda expeditiously because I know how many of us can not get enough. Ed Powell led online meetings in a month and I don't want to deprive anyone of that and speaking of Claire Powell I just wanted to echo Ed's comments earlier about welcoming non-board members to committees. I think you know I said something to that effect. Two months ago we did get someone a non-board member to join our committee, which was great I, think we can actually accommodate one more. So, as Ed said, if there are non-board members who are interested in topics of education, libraries, cultural affairs, especially because education is a really big topic right now, with all that's going on. Obviously this academic year. So please reach out email the board office for those who are interested. We'd love to you know, consider your membership. That's all I have thank you chair. Thank you. Steve community. We had a meeting on November 30th of this year online and the big topic was development of 2286 Church Avenue, which is an affordable housing development they're at the Rfq stage. At this point, and everybody seems to like it, it's a vacant lot. So it's not really controversial. It's affordable, which people like and at this point what they want to do is they're bringing in an urban archaeology firm to look at site to see if there's any historical significance to it, because they found some human bones there recently and they want to make sure that it's not all buried around or anything else, but other than that it looks like it's moving forward and no one seems to be opposed to it at this point anyway, but give it time. Thank you. Okay. You're welcome, okay. So this brings us to our public comment period board. Members are expected to remain for the public comment period and because we're meeting remotely all speakers were asked to pre-register via email to the board office. Any member of the public who was not able to register in that fashion in time can follow up directly with the board and staff will do their best to include announcements on the CB14 website. Matters of civic interest and announcements of public events are invited. No partisan political appeals or advertising of for-profit enterprises are permitted. Each speaker will be permitted to speak for up to three minutes and may not receive additional time from another speaker. The board has an obligation to conduct its business in an orderly manner. Any person preventing the media meeting from continuing will be muted and possibly disconnected from the meeting. The intent of the public comment period is to permit the board and the community a chance to hear diverse perspectives on public issues. Accordingly, we ask that groups be represented by a single speaker. In other words, you know just be respectful of the other people who are waiting to speak, and you know not continue to talk about the same topic with every speaker. You know, okay, it is now 7:55 p.m, and I'm going to ask the board staff to conduct the order of the speakers, starting with the first. Thank you. We have eight registered speakers and I will just read their names quickly, so that everyone who has pre-registered knows that they're on the list we and these are in order. So please listen to the order that you're in and we will announce you as well. Nancy Lulu from the Brooklyn Da's office, followed by Eileen Newman from the Brooklyn borough president's office, Andrew Olsen from OEM Monique, Chandler-Waterman, health hospitals test and Trace Adrian, Mclean, NYC health and hospitals, rocky Batacharia, Brooklyn, public library, Lisa, Lowe, N, Power and Ilana Reinhold's, safe Cortelio. So we'll begin with Nancy Lulu from the Brooklyn Da's office, please good evening. Everyone hope everyone's doing well, it's good to see everyone virtually and I wish. We could see each other in person, but hopefully soon I would like to extend greetings on behalf of District attorney Eric Gonzalez to each and every one of you, the district attorney's office remains active. We continue to work to make sure the community stays safe. Most of us are working remotely. I just have one quick announcement. You know keeping things light. The Brooklyn district attorney's office is holding an annual holiday toy drive. Although our holiday celebration will be so different this year, we didn't want to miss out on the opportunity of putting a smile on children's faces and therefore we are asking for donations can be mailed. You know for toys. New toys donations can be mailed to the Brooklyn district attorney's office at 350, J Street 19th floor as well. They can be dropped off to the Brooklyn district's attorney's office at the lobby. Drop-Offs will be mondays, December 7th, the 14th and the 21st from 2 from 12 to 2 p.m. And lastly, I would like to also remind everyone with the action center's phone number. If an individual would like to address a matter, have us look into something or to file a complaint to please reach out to the action center at 718-250-2340 and I could personally be reached at Luluan, Brooklynda.Org and finally, on behalf of District attorney Eric Gonzalez. We would like to wish everyone a safe and happy holiday season. May the year 2021 be a better year for everyone, and I would like to thank community board 14 for their efforts, district manager, Sean Campbell, chairperson, Ed, Powell, Anya and all members. Thank you so much for allowing me to speak this evening. Thank you and yeah. Who do we have next? Yes, so Eileen Newman will not be speaking this evening. So next we have Andrew Olsen from OEM Andy. Are you there? Okay, we'll move on to the next speaker chair. We have Monique Chandler Waterman from the Brooklyn Bro outreach director of health and hospitals, trust test and trace hello. Everyone. Can you hear me? Yes, okay, perfect yeah, so thank you so much to the board. Thank you to the chair. Thank you to the district manager for y', all working so hard and all the members of community board 14. As you said, my name is Monique Chandler Waterman, actually, I live in community board 14 as well. I am the new outreach director for Brooklyn for test and trace with health and hospitals. My job is to connect with people like you, community stakeholders, to make sure we get the word out on the ground, make testing everyday language to remove the stigma. So what does that look like? We did a day of action. For instance, on the junction we put up a table, we put up a tent, we give people literature without four core which is wash your hands wear face covering or mask I'm covering your nose in your mouth stay home. If you do not feel well, this is not the time for perfect attendance stay six feet apart and the extra is get tested as often as possible. Somebody like me, that's out on the streets all the time, I would say every two weeks and monthly is what we suggest for people who are out and about. We are very concerned with the holidays coming up and how they just pass with people gathering. We know that you miss your loved ones, so do I, but we can not gather if the person does not live in your house. The rule of thumb is don't have them over your house because, when you're at home, you are comfortable, you take off your math, you you're not as heightened with the being have being cautious with over 19 and it spreads and not everybody can body can handle coping 19. Some people can be positive, have no symptoms at all and be okay and get through it, and some of us, you know, have succumbed to the virus, so we're gonna make sure that people are not gathering. Let's do stuff, like virtual meetings like how we have here decorate your house go Carolyn, Right, Ed and Sean yeah could sing very well. We can go outside people house and do some Carolyn Shop online, please shop online as much as possible, but don't break your bank account, but you know what I mean and do not travel, but if you have to travel be prepared. So when you enter New York state, you need to have a test 72 hours prior before arriving to New, York state and then four days after you need to take a test and of course both those tests has to be negative. If not, you are in quarantine for 14 days straight. Our team will follow up with you and if you do test positive at any time, just know that we are here to take care of you. We have a take care program. We can assist you with food delivery, medication door, walking hotel stay whatever you need. So please just follow the protocols on this behavior to ultimately help end the spread, the rapid spread. As we know, we are up to 5 activity rate in Brooklyn and New York city I should say, and we want to do what we can to prevent. So if the community board is doing any events, we would like to partner where we could help you with give out mass. We have mass that we can help you distribute and literature to prevent cover 19, so let us know or any partners. That's on the phone and Joanne has spoke about doing some civic engagement. This is a campaign Joanne. So if you want to get your hands up dirty with helping me out with getting this word out in the community, especially to the youth, I would love that and thank you for all that you have been doing. Thank you. As everybody know, I came from a youth program, I'm a founder of a youth organization, so I love all the work and we've been part of the youth summit for years. So you have been doing a great job. Peace and blessings. We're also going to have a holiday pop-up on the junction on 2-4, on December 20th I'll, give you more information. I know my time is limited, but thank you so much for giving me this platform to speak. I, don't know if we allowed to take any questions, but please I defer it back to the community board staff to, let me know the next steps, but thank you, peace and blessings. Thank you for that thorough report. We don't typically take questions if anybody has questions that they want to email and I'll pass them on to you to get that back out. Unless the chair wants to do this differently, that's tip. That is typical, though okay, my information is in the chat for anybody who knew I'll, put it in again, fantastic. Thank you. Okay, our next registered speaker is Adrian Mclean from NYC health and hospitals. Hello good afternoon, like to thank community board number 14, for you know giving us this opportunity to come and speak to you this evening. My name is Adrian Mclean, I'm a community liaison worker with New York, Health and hospitals, Gotham health. I'm just going to speak to you quickly and briefly about a program that we have entitled Gotham health work initiative. We know that we're possibly encountering a second round in regards to this pandemic. We care about our small businesses. I mean we know that they're an integral part of our economy, so we want to make sure that they're, safe and sound. So what we do is we offer a program which allows the employers to keep their employees safe. We offer services such as cover 19 testing, as well as the primary and preventive care services. We also offer women's health Pediatrics Behavioral Health as well. It's something that is available to all members of the public, as well as to the employees and their families. You can get these services at any of the Gotham health community clinics also, just briefly, we also have a number of covered 19 testing sites in your area, one at Midwood pre-k, which is at 1223 Coney, Island Avenue. This is open from Monday to Sunday nine to seven a.m. They have the rapid test there, which takes about 15 minutes as well as the nasal and the antibody test. We also have testing available at Cumberland, which is at 100 North Portland Avenue. They test Monday to Friday nine, to three thirty and Saturday and Sunday ten to two, as well as testing at the East New York area at 2094, Pipkin Avenue. They test from Monday to Saturday nine, to three thank very much for your time. I appreciate it I hope everyone enjoys their holiday and everyone keeps safe. If you have any questions. I'll post, the email address and phone number we've been contacted in the chat. Thank you very much. Thank you. So much next speaker, please. Our next registered speaker is rocky batacharya from Brooklyn public library hi, I'm a staff member at the Medwood branch of the Brooklyn public library and even though the Brooklyn public libraries, the Midwood branch, is not open to the public. At this time there are 27 other branch locations in Brooklyn where patrons can come for put quick transactions. Basically, holes pick up and book returns. Materials that are checked out during this time are not occurring any fines, and this is also true for the materials that were checked during the time that the library was closed. The only branch that is open for grab-and-go service in our district is the Cortellio branch masks are required for both patrons and staff. The with the city's test and trace core library staff have distributed more than 54,000 mass and reached more than 19,000 brooklynites, with information about essential resources such as pre-testing sites and emergency food relief. We hope to continue our partnership into 2021 with outreach regarding a safe vaccine. In addition, Bpl's business and career center has entered a partnership with the community service society of New York to offer individualized assistance that can address personal financial concerns. If you have questions about credit or debit would like to manage your money better and make progress toward a financial goal or looking for resources to ease a financial crisis, you can call our main number at 718-230-2100 to make an appointment with a coach from the financial coaching corps. All coaching is done virtually and by phone or through Google Meet. Lastly, I wanted to say that the Brooklyn public library has also formed a partnership with sky packets to provide free, Wi-Fi connection 300 feet in all directions from library buildings, and this will eventually be rolled out to 44 branches. Midwood is one of the branches. That's going to get this enhanced service due to difficulties with the contractor we haven't, we won't be able to get it by the end of this year, but we hope to get it in the first few months of 2021. That's all I have to say right now: okay! Well, thank you. Next speaker is Lisa Lowe from n powers. Let's see her chair, I'm going to announce. The next speaker is Elana Reinholz from Save Cortalio Hill. Can you hear me? Yes, I'm sorry, it's prime time cooking in my house, so I apologize for the noise hi. All thank you. So much for having us here I do want to say that I'm from save Cortaliu a grassroots group of neighbors. We just started organizing for the first time we're about 150 strong in the last six weeks and this all started after the community board meeting that I attended and I loved. You know getting in and civically engaging so I just wanted to give you guys an update and then ask you guys a question as well: that's! Okay! So I'm ilana I live near the building and I watched the CB meeting, which was very contentious, and you guys had a lot of thoughtful debate and one of the things that left an impression on me was the supermarket access and the architect in my building. Our co-op board president ended up letting me know that there's no way that the supermarket could be open for two years during construction, so I didn't know. If people who voted were aware of that and that started there. You know you kind of pull a string and I'm a business owner I do things all in or I, don't do it at all and I just started talking to community members on the street. I've talked to about 250 people offline online. In the last month and after the CB board meeting we had about 45 speakers. Come to the borough, president call to speak against the upzoning of 1620 Cortelliu and one spoke for it, and so that's one of my questions. If you guys were aware of kind of like the giant community conversation, that's happening and with that said, there's a lot of stakeholders and partners that have joined the conversation. We have some talking points as well. I'm happy to drop it in the chat. A lot of them were aligned with all the conditions on your vote, but some go further. Mary. Let's for ins, for instance, sorry is a phd. Who did a study we actually see there may be 100 people losing their jobs from the supermarket, as well as the laundromat and some other things along the lines of pollution and infrastructure. That was mentioned so with that. If it's allowed Ed or Sean to continue this topic, I know you said you didn't want people to speak on the same topic, but we have a teacher here from Ps139 Donna. We have the Megan. We have the parent coordinator, Megan here as well, who may want to make a comment as well as Harriet Hines. So with that I'm just going to turn it over to you. Yeah go ahead yeah, you know. Our policy is that you know one speaker can not receive additional time from another speaker and that you know we've asked, as I mentioned in my comments, that people sign up by you know to speak by contacting the board office via email. I. Think they signed up. I'm done. Did they sign up? Oh wonderful? No, there are not additional speakers signed up this evening. Ed and just to the board has already adjudicated this topic and actually our comments. Our recommendations were due to City Council back at the beginning of November. We actually turned them in I think three days late, so the platforms for additional comments are the borough president also held a hearing and I think his comments are due this week, I think even tomorrow, and then of course, that's part of the reason why I did announce the city planning public hearings at which I'm encouraging all community members. Still, you know who are interested to participate in that and any comments, as the chairman mentioned earlier, comments that we're not able to make it on to the meeting tonight and we do want to encourage people to pre-register, can be sent to the community board made part of our public record, okay, so yeah. My question at the end of the public comment was just if people that spoke in terms of their approval, conditional approval was based on the supermarket being saved. I didn't know if they're aware of that additional information where the supermarket will actually be forced to shut down, there's actually no functions. There's actually no mechanism in place for boards to withdraw support. If additional information was mis presented to the board, that will become part of a recommendation, I'm sure City Council will frown upon it. City, council and city planning just here to bring it up and I know that Harriet and Megan also signed up to speak, but I'm not sure if they're on the list, I'm frank, but they did not, and so I want to encourage them to email info at CB14 Brooklyn with very sp. Be specific about wanting to speak that isn't a lot of the language that goes out in a reading notice and just this is Anya from the office just to clarify on that topic a little bit when you do register for a webex link that doesn't necessarily put you on the secure list so for anyone out there, which I would like to speak next time. Please just make sure to send me that in an email and I'll get to that list, okay, but John Oros is asking you to speak. I think he's on the list to speak. This is the chairman's ed. Do you want to go ahead? First of all, excuse me just a moment: are there any additional registered speakers at this time? Yes, we have one registered speaker, Alicia Goodridge, from Assembly member Richardson's office. Then we need to continue with that speaker if that person has already registered I think we should move on to that person. Okay, Miss Goodrich from Assemblymember Richardson's office, hi good evening. Everyone hope everyone is well just a quick stop in this. Send greetings from Assemblymember Richardson and hoping that this year end that we're all safe and healthy and wishing happy Hanukkah, Christmas Kwanzaa and a prosperous, healthy, safe new year, and we look forward to seeing you in 2021 there's a lot of work to do just joining this meeting and learning so much I actually live in community board. 14 and my colleague has been stressing me to be sure: I become a member, so I will do that in 2021 for sure, and we look forward to future work and once again greetings from the assembly member we'll keep you posted on anything, that's going on in the new year. We are still doing our food distributions around the district. We have three locations, one is London's Leonardo Baptist Church, which would be the closest on this end and, of course, Beulah, which is further up and Crown House Jewish Community Council. So we're still doing the food work and making sure that we're taking care of our community. If there's anything that is needed, and if we can help please reach out to us, our number is 718-771-3105 and district 43 at NY Assembly.Gov. Thank you. Have a great night, thank you, miss Goodrich, and one additional thing that I wanted to mention is that I did receive a message from one of our elected officials, staff, member Pierre Gideon, who works for assembly member Rodney shot, and he is watching on YouTube. It's therefore unable to bring greetings assemblywoman, but he did ask me to mention that her office has been in touch with the save Cotelli movement and that they have been in contact with multiple members and have partnered with district leader Josh Pierre. Who is familiar with this effort, since we have no more registered speakers at this time, I will accept a mis, a motion to adjourn second, the motion. Second, all those in favor, okay, happy holidays meeting us to charmed at Anya at 8:18.",
            "summary": "Okay, this meeting of Community Board 14, is called to order on December 7th at 6:34 pm under the applicable statutes of New York state, The charter of New York City boards by laws and Roberts rules.\nOther matters of civic interest must be brought before the board during our public comment, period, which is which will begin tonight, After all, other business on the board's monthly meeting agenda has been concluded, No, partisan political appeals or advertising of for-profit enterprises will be heard, wishing to speak during the public.\nFor those of you who want to say things, there's a lot to say things about, Then we also there have been some questions about snowplow for the season and center train for snowplow many weeks prior to this and went through and drove the districts, and it's changed somewhat with some of the outdoor dining in terms of what equipment they're going to use in certain places, But they've got it.\nI am mostly in Albany and then, when I'm in Brooklyn, even though board 14 only takes in a small portion of my district I know a number of the people who are board members, And I really just wanted to take an opportunity to say hello to people to obviously wish people a happy holiday, season.\nI urge people to stay safe, And I want to let you know that my office has, as do I, believe most of the other elected officials, but my office has masks handsets small bottles of hand.\nLet people know that my office for the first, several months after the pandemic started, we were always remote.\nThen to 8:19 18 19 street over by Bay Avenue, so and starting over by the Philip Howard Flatbush, Avenue area, So again just stay safe, happy holidays and anyway, ed or the board members that I could be helpful.\nEveryone also has a great new year and stays safe and socially distant, as we try to get out of these last, hopefully, four or five months before we start seeing a vaccine and trying to get our city or state or country back on a more normal footing.\nYes, Mr, Assemblyman, Carol, yes, I wanted to know like what plans do you have of helping with the 1620 Cortelli Road project.\nThere are no public hearings or executive committee meetings to report on this evening, but I do wish to make a few announcements.\nNumber one, A belated welcome to our new board member Zach Khan Mr Khan has already joined us at committee meetings and public hearings and I really appreciate his willingness to jump right in the true board, 14 spirit.\nEven if you're, not a board member, please let us know if you are interested, whether you're, a member or not all meetings of community board 14 are open to the public.\nThirdly, community board 14, has been asked to serve on the former ps9 Psn 90 task force chaired by council member Matthew Eugene and the Brooklyn bubble.\nI have asked district, manager, Sean Campbell, to represent the board and to report back to me and relevant committee co-chairs along the way.\nAnd you know, over a period of years, Actually, we've been trying to you: know, bring a bylaws committee into effect to kind of look at the bylaws revise what needs to be revised and so far it's been touch and go, and we've been somewhat unsuccessful at getting that point.\nYou know, like I, said especially women and people of color for coming forth to participate on this John I.\nI'm sure there are a lot of the new board members who don't know that, but I also was wondering if there was one or two of the key complaints that might be the driving force, because Johnny can.\nIt's a good thing to have diversity on a bylaws committee, but maybe also to clarify the implication and then maybe that will also help jog some ideas from certain members of our board who want to partake in it sure.\nThen there was a question at the time at the very beginning of the executive order that allowed us to hold board meetings remotely in a way that's still comported with the open meetings law and whether or not there needed to be questions about voting, You, know, clarity on terms in terms of how we would vote if there is a an election that is a where there's contenders in election.\nHopefully, that is super groovy, but I, do want to say that any board member who wants to be on this bylaws committee, Please email us in the office at the info address, and we can capture some things in the comments, but they don't become part of our records.\nOkay, then, Let's move on to the topical committee report, starting with youth services, Any of the chairs available here we're both available.\nSo I on behalf of myself and my coach here, I know that I want to thank you guys for coming out to this meeting and also for our youth, Services Committee meeting.\nWe invited speakers from the Department of Youth and community development for New York City, as well as the Vista program.\nThe mayor's office of Immigrant affairs, we asked the representative from the Department of Youth and community development DYCD to speak to the workforce, connect programs that they offer.\nSo, With everything going on with the pandemic, We wanted to make sure that we had a better understanding as a committee and as a board and for the community what the path forward look like from DYCD and their programs, so I presented with Sarah marks from DYCD and just to give you some of the highlights of the meeting which is available on the community boards, YouTube page for review.\nWe were hoping for some direction from them and advice from them on how we could better engage our young people in again forming a youth committee and building out that program.\nThe hope is that we'll have a youth committee that will be able to have representatives on you, know, sit with each committee of the board to have full engagement with the board, so we're hoping through some direction from Vista, and we're also going to be continuing to reach out to other community partners to just learn how we can better engage our young people and get them involved and correct me if I'm wrong, here, Am, I, correct, Jonathan, I've heard of the committee church on that, but I think that we have a lot of I.\nI pass it on to my colleagues like just a reminder like our that the CB 14 news conference, which actually was an started by chair Ed Powell and a few other board, members.\nSo, Whatever it looks like moving forward, we encourage board members to participate in it, get companies, friends, organization, whatever you can get us to help us move this forward to help our young people find activities that are productive and worthwhile to keep them out of trouble to keep them engaged to get them ready for the workforce to get them ready for college.\nLet's continue to do that, so the mic or the platform to my co-chair I, echo everything that Dwayne said, and you know working with as a staff member when I was a staff member Edward's, coach of the Committee and Doris Ortiz, our former district manager.\nOf course it's a big thank you to all of you and the community at large and, of course, the district manager staff, which is the linchpin, I, think of actually making sure it happens.\nOne thing that I want to just highlight in that we will have to meet again and we're going to talk about what the youth conference will look like and depending on what restrictions may still be in place during the pandemic and how that looks.\nThere is one more thing, though, speaking of Youth Leadership Council, getting people engaged at a young age, the New York City, Civic, Engagement, Commission and I want to thank Michael for reminding us about that in the chat.\nI, don't want to take up a lot of time because I know you're already an hour into the meeting.\nAs, we all know, There are some cars that they're trying to say they put on these paper plates that are being used, they're looking into that, but he did want to warn everybody to please be aware: Don't leave your keys running in the car and going out even for 10 seconds, because somebody jumps in your car gets stolen.\nI know the board office has all that information if any of our immigrants in the community should need information for those services.\nSecond agenda item was regards to the Kingsborough jewish medical Center, acute care bed closure if you're not familiar or did not attend that meeting.\nAfter our meeting, But the governor Cuomo has asked all hospitals to increase beds by 50 to accommodate what we are expecting or what is actually the second wave of Covid-19 patients who will need acute care, I can say from experience and from a report that the beds that we have not stopped admissions at the hospital.\nSo, you know, let's delineate, what's going on so one Brooklyn health system is carrying out the orders of the New York State Department of Health to go ahead and merge the system and close the acute care beds so that those buildings can be transformed.\nThe, most up-to-date information that I have is the agency nurses that are working in place of staff nurses that have left, because when we know that we're closing staff, of course, is going to find more stable, jobs.\nI just wanted to echo Ed's comments earlier about welcoming non-board members to committees.\nTwo months ago we did get someone a non-board member to join our committee, which was great I, think we can actually accommodate one more.\nMembers are expected to remain for the public comment period and because we're meeting remotely all speakers were asked to pre-register via email to the board.\nAny member of the public, who was not able to register in that fashion in time, can follow up directly with the board and staff will do their best to include announcements on the CB14 website.\nMay the year 2021 be a better year for everyone, and I would like to thank community board 14 for their efforts, district manager, Sean, Campbell, chairperson, Ed, Powell, Anya and all members.\nThank you to the district manager for y', all working so hard and all the members of community board 14.\nAs, we know, We are up to 5 activity rate in Brooklyn and New York city I should say, and we want to do what we can to prevent.\nThe, with the city's test and trace core library, staff have distributed more than 54,000 mass and reached more than 19,000 brooklynites, with information about essential resources such as pre-testing sites and emergency food, relief, We hope to continue our partnership into 2021 with outreach regarding a safe, vaccine, In, addition, Bpl's business and career center has entered a partnership with the community service society of New York.\nThis all started after the community board meeting that I attended and I loved.\nOur policy is that you know one speaker can not receive additional time from another speaker and that you know we've asked, as I mentioned in my comments, that people sign up by you know to speak by contacting the board office via email.\nThink his comments are due this week, I think even tomorrow, and then of course, That's part of the reason why I did announce the city planning public hearings at which I'm encouraging all community members.\nStill, You know who are interested to participate in that and any comments, as the chairman mentioned, earlier, comments that we're not able to make it on to the meeting tonight and we do want to encourage people to pre-register, can be sent to the community board made part of our public record.\nThere's a lot of work to do just joining this meeting and learning so much I actually live in community board."
        }
    }
}