{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB6",
            "channelId": "https://www.youtube.com/channel/UCKaVsnwHRM6uXG-_rrWwHqA",
            "title": "Brooklyn Community BoardGeneral Board Meeting",
            "publishDate": "2020-12-09",
            "shortDescription": "Agenda- https://bit.ly/12920agenda",
            "lengthSeconds": "1:33:32"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB6",
            "normalizedName": "Brooklyn Community Board 6",
            "twitterName": null,
            "youtubeChannelName": "Mike Racioppo",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCKaVsnwHRM6uXG-_rrWwHqA/videos",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "qVsbQrOIN2U",
            "fillerWordCount": {
                "uh": 328,
                "um": 234
            },
            "readTimeFullTranscript": "52 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "chat": 24,
                "parking": 19,
                "zoning": 18,
                "building": 17,
                "design": 16,
                "rezoning": 15,
                "place": 14,
                "canal": 12,
                "promenade": 12,
                "changes": 11
            },
            "wordCountSummary": {
                "rezoning": 7,
                "parking": 6,
                "building": 6,
                "promenade": 6,
                "landmarks": 5,
                "design": 5,
                "planning": 4,
                "zoning": 4,
                "canal": 4,
                "space": 4
            },
            "fullTranscript": "Foreign, hello, everyone y' all look so great beautiful people. Thank you, flattery will get you everywhere. I tried, you have the right bridge this time. Leroy, yes, I had to go back to my son and tell him I need a Brooklyn bridge and he found it for me. So well welcome everyone. Thank you for joining us tonight. I'm Peter Fleming, the chair of Brooklyn community board six and welcome to the December community board six meeting. Obviously you know we're continuing to meet in this manner because of you know all the things that are going on in our city and in our state today, I'm coming to you live from Asbury Park, New Jersey, something that the pandemic allows me to do, because I can host from pretty virtually pretty much anywhere. So again, thank you all for joining us. Some of you may have an agenda that has the elections committee listed on it that was resolved last month with the re-election of the existing officers. So we will not be covering that we also will be covering things in a slightly different order, because David Briggs has a he's been studying for an exam. So we're going to take pity on him and after we do the executive. My report and Mike's will go right to David to go through his motions and then we'll let him get some rest so that he's ready for his exam I. Don't have a lot to say other than you know. I'm it's good to see everyone looking so well! You know my now, I, don't say: I have any strong impressions of all the things that are going on. I had a Facebook friend, a woman I grew up with whose mom recovered from Covid-19 and she's 88 years old and she's doing okay. So it's nice to know that you know just because she was elderly that she didn't automatically. You know see the worst of it in bulletins. This is not exactly news, but for those of you who didn't read Mike's message, we expect city planning to certify the Gowanus rezoning on January 19th and that will start our time, clock and we'll schedule our hearings based on that. It's entirely possible that, and we expect that we will have presentations in both landmarks and land use and economic waterfront development, because they both have different perspectives to lend to it, and we hope that they will agree on the ultimate. You know disposition of this because of the fact that we're not going to be able to give you every detail when we vote on this ourselves, I urge you, if you're able to sit in on you know at least one of the presentations from city planning at either landmarks and land use or economic and waterfront development, so that you know the basic details and understand what you're voting on and I'll ask. You know Ty and Mike to make sure that everyone on the board is aware of when those zoom meetings are being held so that they can listen in on them. And you know it's not necessary that you participate in those meetings unless, of course you serve on those committees. But even if you just listen into the presentation and hear some of the questions, it'll give you a sense of what the community is feeling what you know concerns you know some of our landmarks and land use gurus have on it as well as the economic waterfront development people, so that when we ultimately vote on it in either February or March, we will have you know. You'll have a well-rounded perspective, so that's the only thing that I have other than to wish everyone a happy holiday season, whatever holiday it is you'll, be celebrating in the next few weeks. I hope you had a safe and happy thanksgiving and that you have a safe and happy Christmas. My husband and I will be spending Christmas in Asbury Park, so we put up our little five foot pink tree and we're gonna go from we're gonna go from there, so I'm gonna recognize our district manager Mike Graciopo, to give any remarks that he may have and then we'll move on to the landmark and land use items so that David can take his leave and get his rest and be ready for his exam, so Mike. Thank you, Peter I'll. Be brief. Just following up on what Peter said, you know, of course, my newsletter as people know, I do give alerts about the upcoming meetings and things like that, but also and we've gotten more views than we used to all. The meetings are up on YouTube and I. Do link to a google drive with the presentation, materials and things like that, and if you have trouble finding it I mean they're on our website on the archive page after the meeting happens, it just goes and says view this meeting on YouTube it's there. But if that is you know, if you want to just reach out to me, I'm always happy to reply Mike Bkcb6.Org and if you want to sign up for the messages for the newsletter and things of that nature, just you can send me an email go to Brooklyncb6.Org and sign up or text Bk CB6 to 22828 I'll. Be brief and good luck to David on his test and oh one other thing. The and Eric Mcclure reported this as I know. He attended Boroughboard last night. The applications for New board membership are open until February, 12th and I just found this out and I know people that know from previous years. I would I'll send it on if you're on the list to be renewed, I will send you a reapplication reminder by Friday, but you will still have to February, but the earlier the better and once you send it in. Let me know, in which case you know, I can make sure the president's office knows that you still want to be repointed and things of that nature. Anyway. That's that I'll and, like Peter, said happy holidays. Just before we go on to David and David, remember you have to unmute when we vote. As we did last time, it seemed to work out if you are against a particular motion. Please note it in the comments and we will you know we'll take note of it from there. You know most of this stuff isn't terribly controversial so, but if you do wish to be- and if you are abstaining, please say that or and if you are abstaining for cause, please indicate that it is for cause because that counts differently. But if you can, you know do that in the comments. Obviously, if any vote is close, we'll figure out another strategy, but for now we're going to work with noting in the comments, if you wish to vote against a emotion, so I'm going to turn it over to David Briggs who's going to present the landmarks and the land use items as I understand it. Thank you Peter and thank you for the kind words about my tests and thank you Mike and thank you to those in the chat, I blessed. Anybody think I'm testing for the Nasa Space program. I'm actually testing for passive House certification. It's a pretty energy, efficient way of building and I hope to get to become an expert at it. So anyway, for a more sustainable city. Okay, so we're going to start off with 433 9th street legalization of third floor rear windows and the park slope historic district extension I think ty is going to bring it up here so before we go through it. Just to give everybody a little background here, this project had gone through landmarks and then the owner changed something without going back to landmarks, and so now they're asking us to okay it after it's been complete. So it's there's a site plan. Go to the please here's, the elevation of the building on the block, another view from the top another view from above, please, okay, so on the left, is what was approved by landmarks and one on the right. What's on, the right is what actually was built. You can see that the two windows that tie is circling were not installed, as approved on the left and from our understanding from the architect's presentation. There are two bathrooms here, so the owner decided to put two much smaller windows in and that's the extent of the application Ty was there more I think there was a couple of views across the way to show that this is not dissimilar from a couple other buildings to go through the slides yeah. So there I'm sorry just go back one yeah, so the one on the left is our the subject: property. The one on the right is across their rear yard across the donut. Looking at another house that has the two small windows on the right, so they felt there was some precedent go to the next line. Presumably that's the bathroom they're saying that those two windows were for are in bathrooms. Yes, but this is just another view, doesn't really tell us a whole lot, keep going ty is there another slider. Is that it? That's the last slide? Okay. So if you go, let's just go back up and look at the photo I think that's probably the best thing the photo the one after this yeah. So there were some comments. Allison Glenn and Joanna contributed to the comments. Quite a bit we as a group as a committee, we expressed a bit of disappointment that the owner didn't go through the proper channels at LPC and decided to request forgiveness rather than ask for permission. However, despite that we, the committee, we did not have a quorum, so we'll need a motion. The committee did recommend to approve it with the following condition that the those two dark window sills should be painted to match the rear wall and color and those that were present at the meeting unanimously approved. It can I ask for a motion from the floor. Please to that effect. Thank you, Jerry. Second I. Second, it. Thank you. Okay. Any discussion on this comments. Questions anyone hearing, none I'm going to call the question all those in favor, please say aye if you're against, please note so in the chat. Hi looks like the motion passes. I didn't see anybody being against it. So David. Your next motion, please. So the next application we looked at was for 282 Garfield place. This is a post approval application for changes to the rear elevation design that was originally approved at staff level. So this is a little odd go to the next side. Please ty, okay, so there is a there's some more drawing, though again, I'll just get an overview here on the left is the existing elevation in the middle is the elevation that was approved at staff level by LPC and on the right. There are new openings proposed, not from down available tai. If you could circle where it was, you go to the center elevation, the top right window, no, the center elevation, yeah I. Think it's one of the is one of these two windows. That's going up there. Maybe it's the one on the second floor, yeah I think it's actually the second floor. Okay and apparently that triggered the public review. Otherwise it would have been considered at staff level, so questions and comments again, mostly from Allison and Joanna, and since it was this is the only thing we were really looking at just reorganizing the windows and moving that stained glass window up. We recommend and again we'll need a motion and we recommend that it be approved as presented I honestly, like the new one better. To be very honest with you, so yeah can I have a motion to that effect. Please a second Bridgette! Thank you. Any discussion on this hearing. None we're going to vote all those in favor, please say aye if you are against for any reason, please note so in the chat hi. Thank you. Everyone I didn't see anybody against David your next motion. So now we moved to land use and I thought. If it's okay, we could do Monondox project first yeah, okay, so this is a proposed rezoning of a lot. That's just north of the Smith and 9th street station, elevated railway. So the first part of this is Monodoc's background. I'm just going to go through this. They obviously are a well-entrenched business in the community they're currently located on the canal next, just north of third street. This is just another aerial view. Well, I'm sorry, let's go back hi, so the yellow there, the Huntington Street site, is where they want to move their offices. It's in the IBZ. Sorry go ahead, ty, so here's a site plan. What's in the yellow-line there is where the proposed rezoning will take place. Just south of public place it's and it's just outside of the rezoned area get going. So that is the lot in question. Lot number eight! That's where they're building their project but they're asking for the entire block to be rezoned. Keep going digital map, keep going, there's a site where, as some of you may know, school buses are parked currently and the existing bulkhead keep going. Some more images from the 9th street bridge looking north looking down towards where the buses are from I think this is Hunt Huntington, Street, yeah and Smith yeah. Looking East keep going ty. So it's currently an m12. If memory serves m21, sorry right, you can see a circle in the red there on the zoning map, so the far is 2.0 and the maximum height of the front wall is 60 feet. If we go to the next one, what they're really looking for is to reduce the on-site parking requirement, the height and bulk of the building, even though it's going to be a different zoning district will not change. Here. Are their plans yeah so they're going to an m23 which has a lower parking requirement? What we can do so you see the far from two three is the same, and the maximum height is the same, and actually there are no parking requirements. So this is a rendering of the building the architect of Rector Dattner architecture is president, as well as escape to present the promenade keep going all there's right, detailed plan there showing a little bit more about the promenade which and eventually hopefully, would connect to the subway entrance if that area just below the site was able to go under and wrap around the ninth street station. Thank you. Todd keep going here's the plan of the promenade conceptual design at this point and I should point out. I mean I think this is obvious to most people on the board that this is just a design. All we're really here to consider is the rezoning keep going. Some views of the building that currently got designed by Bernheimer Architecture Ariel Bird's eye view of the promenade conceptual photos, a section diagram showing how the street end will be terraced down to the canal, providing more absorptive soft edge rather than the typical hard bulk steel sheet piling, and this is a little further along where you have the promenade, where people are walking and Florida police with guns drawn home and more details of the promenade and for those who were you know following the zoning it's you know, this is somewhat similar to I think what aspirationally is being considered for the promenade along the canal like it's as it gets redeveloped. If the zoning goes through, the health director of L.A County, which I've seen is hospitalization by the way someone's got their mic. Somebody who was talking about hospitalization rate, could you please mute your line? Thank you. So here's a view of the building from the east side of the canal. If you can imagine floating off the edge of the F train g train platform, looking towards lower Manhattan in the background there, the green roof on top of the red section of the building, keep going die and I think that was about. Was there any more time? Is that it that's? Basically it okay, so there we, there was quite a lengthy discussion about this, particularly about the public amenities along the canal and the activity and the proposed retail and also boating access from the canal, which was not shown any of the renderings there's. Also apparently, Brad Lander's office is in conversation with the developer about the amount of dedicated industrial floor area that will be part of the new development. My someone else can correct me here. If I'm wrong, I asked the question and I didn't get a super clear answer, but I believe the non-doc is going to take about a it's about 90,000 square feet, but it's going to take about a third of it and I think the negotiation on it more and the Monodoc Occupancy is defined as industrial and the additional amount that's being negotiated somewhere between another 10 or 15 percent of Florida. Does that sound right? Those are those at the end of the meeting yeah that sounds right. David, okay, are you? Did you mean it? David I didn't hear that it was an additional 10 I thought that and that it was at the most they were planning to get secured was 10 to 15 percent. Not additional Well Madonna has taken a third of the building, so that's 30 right, but we're talking about that's what they're using now, but what the argument, but the what their discussion is about what will be required in the future and that that's the point that we kind of I don't think we have I, don't think they they've come to any decision, but what I heard them say was. It was only 10 to 15 percent would be secure going forward if monadnock ever left, I couldn't okay, so that's you might I. Honestly, it was unclear to me yeah I, think because they don't have a number. They haven't come anywhere, but I think that's why there was some clearly some disagreement because they might be at 30 now. But the question was: what: where are they going to wind up? Okay? So that's something that we can certainly comment on again: we'll need a motion. We have to have a motion. First, please yeah. So I made the motion at the committee and I'll. Happily do it again. I just want to say that I think Ariel is right. It's not clear whether we're targeting the 33 plus or a restrictive declaration requiring at least 10 or 15, but the motion says that the application is approved contingent upon a restrictive declaration being reached with the office of Brad Lander. So we don't need to negotiate that because they are and I just want to say that the other thing that came up is I've been advised that, in addition to the requirement that they reached this restrictive declaration, I also said that we should encourage them to provide a more active, more inviting public amenity along the waterfront. So it's not the typical passive couple of benches and a walkway at a dead end might encourage the wrong behavior. So David I will make that motion to accept the application, with a restriction that they reach an agreement with Brad Lander's office on a restrictive declaration for the industrial use and to request a more creative use of the community space so as to promote the best use. Well, I think what I wrote down, because I hadn't gotten there yet, but to design a more creative public amenity along the promenade based on the committee yeah. The concern was that, unless we use words other than encouragement, if we require a more creative use, it is more likely to get involved included in the department of City planning's consideration. If we just say encourage, you know the creative use, it's going to be less likely to make it through into the final decisions. Okay, we have a second can I ask David a question sure David. You said that we're actually voting on the only thing that we're voting on is the change in the parking requirement. Technically, that means that the drawing and design of the building, as well as the public amenities on the waterfront can change. Is that correct? Is that what you said almost I said what we're voting on is the change in zoning district zoning designation, not just the parking right. So if I may comment, we have no guarantee that let Jerry finish this. We have no guarantee that the final design of the building or the amenities will match anything that was like was presented. Is that correct, I believe so? Yes, but I think Mark was running. This portion of the meeting mark did I. Think you just wanted to add something yeah two things one is in addition to their office space. Their construction yard will be there and with regard to the waterfront design, some of that is included within the zoning changes they're requesting the actual promenade is not technically as shown, but it was reviewed and discussed together with the conservancy and Andrea Parker commented that it is a more robust proposal than that which took place, let's say in light stone in other areas, thanks mom Peter, Mike, yes, go ahead. I just want to like ask: is there a caveat that we can put in that the community be notified of the air and the water testing during the construction and making sure that the community is advised when the construction is happening? What's going on like having a newsletter given by the company what's happening, because the community needs to know because it's by the Gowanus and the EPA has found that the Gowanus is very toxic and we're just very concerned about that as a community member myself. So is that it would that be an appropriate caveat for the I? Don't know if that needs to be in the motion or if we just ask them for that, you know update, usually when that kind of thing happens, unless it's a huge development, we just usually ask them to keep us surprised and to you know and to make sure that their neighbors are opprised to their activities. Anybody else have a thought on that: yeah they've, already hello, they've all they've already upgraded the bulkhead, the along the canal. So the likelihood of some interference with the canal in the future is minimal. I, guess I'm still thinking that we're getting kind of we're buying a pig in the poke on design of the building the way in its appearance, the green roof, because since we have no control over that, they they're pretty pictures, but we don't really know what we're going to get and that's concerning for something that's being right on the canal that we have no control over what it looks like and no guarantee that it will resemble what's presented. What was presented in their presentation so is pretty big, that's something that we can have and why don't we have it here? It's a zoning change, it's not a BSA action, so you don't get specific there. You go! No I understand that. I'm wondering if we can include them if we can request in our motion for them to come back with their design for find some kind of approval or review so that we can have some input in the design in the final accepted design. That's what I'm looking for Glenn's my question: I have a question shouldn't. They come back because it's being stated that they're negotiating with Brad Lander's office. When do we get the information from that negotiation, whether or not it's 33 plus or it's just 33? Some kind of addendum to that in the motion can I make a recommendation. I mean this is a ULURP action and it's a straightforward rezoning, so I think we should vote on that. I think we could certainly add to that. I mean look, there's a lot of moving parts north of this site, public place, obviously being a big one and I see someone's here tonight, probably to speak about the part. That's proposed there. I think Mandark doesn't strike me as being on a reasonable group of people and I think we certainly could say we request that they come back with their final design and I think we'll have a better handle on what, if it's appropriate, not because we'll have a better handle on what's happening with the rest of the rezoning, because they have to go through the entire Euler process before they start committing funds to completing the design of this new building and the promenade. Is there any reason why they can't just have it be part of the rezoning? What too late to include that plot? That section and that parcel within the overall zoning? It was not included. Oh I'm sorry, you mean this part is part of the mapping. No, it is too late and it's part of the IBZ. It's not part of the rest of the area you mentioned about the subway station entrance. Is the plan to allow people to go up that promenade and get into the subway from there on that side, the property that is just to the south of them is controlled by the MTA right now, so they the MTA, would have to grant access and make that final connection I mean to Glenn's point with a dead end. It would no longer be a dead end if they could get access across that property to ninth street. Can we ask for that to be in there somewhere that be reviewed when the school is when planning takes effect for this, when the school planning is going at that be looked at? Would that be a possible way of getting us at least to say something and to re-look at that I? Don't see how the owner of the property has any I'm just asking I, don't know I, don't see how menadaca can control that what I heard is David. Just forgive me. I heard that the school issue for the Euler was gonna be totally put on the city portion that it wasn't going to be part of the discussion of the whole Euler of the Gowanus rezoning. Is that true? That's why what school issue you guys talking about the building of a school they were, that was going to be part of development on public place yeah, but that's I think at least according to the last presentation. That's at the other end of public place. It's not near this lot! Okay, but you know the city is supposed to be in charge of that. It's not the it's not going to be part of the development. The city will cite the schools. There is no school proposed for this site. Okay, so since well go ahead! Well, what I was going to say right since we're really only talking about the changes to the parking rates? Couldn't we just add to the motion as a friendly amendment to Glenn's motion what Jerry was saying in terms of having them come back to us once they have their final plans? Yeah! That's what I was suggesting. I'm sorry, but I didn't hear again is it is Glenn accepted as a friendly amendment? Well, this our vote is going to go to city planning, Brad's going to have a say on this I think, since it seems to be understood that monotonous is a reputable company a long time, neighbor that we could also just ask them politely keep us informed. We would like to see your final plans and know what we're getting you know as a trade offer are supporting their Euler request. I, don't know that we need to put it in the motion because it we can ask for anything and we can ask for more creative use and we can ask for the restrictive declaration to be negotiated, but anything more than that I think is out of our jurisdiction. I, don't really think it's out of our jurisdiction to just ask them to come back. I. Think a lot of us have been around a long time to know that even great developers sometimes change their tune, sometimes once they get our approval so to just say to them. Once you get your final approval to come back to the board just to show to us, it's not something that we can disapprove that they can't build, but at least keep us abreast of what the final plan is. I, don't see why that would be out of our purview. I just don't know what the mechanism would be once we agree with their request. Nothing really obligates them to come back to us. Unless we ask them nicely, it's not going to be part of the Euler. You know, there's not going to be any kind of you know restrictive Covid-19 on the land. That requires them to come back and knows what the building looks like so I agree with Glenn on this, because part of this whole rezoning conversation and what's come up in the IBZ conversation is the look ahead and a reduction in the changes to zoning and parking. So monotonic is first to the table with this, but yeah. If we can add some language that keeps us in the loop and helps us work with them as neighbors, it's always a good thing, but the parking is something that the Ibc has been asking for a very long time. The developers representative said in the chat that you know they would be happy to keep us apprised of design changes and everything like that. So I don't know. If that's something that we can accept or do we need to have more formal language in the motion. If someone has some specific language in order to incorporate this without over complicating it, I'm happy to listen to it. Well, if the developer has said this in the chat, isn't that good enough? These are public meetings. It's good enough for me, it's good enough for me too. Anybody can go with that jack. I would go with that. Okay, I'm good! So can I read the motion again? Yes, please, okay, recommendation! Go ahead, Ariel, okay, so the change from m21 to m23. The only difference is the parking which is terrific and I. Don't think there was any discussion about that. Everyone seemed to be in favor what so one thing I do wonder about is, and I hadn't had a chance to look at this before the meeting last week, but in going from M1 to M2, you lose out on use group four and five and use group. Five is business and professional offices. So one of my questions is: I'm not sure I'm wondering about the conversation that Brad Landers Office is having, because I thought they said that they were going to be having offices up there and that's not allowed in them too. I think unless things have changed, it might change. I'm not a total expert on this I was looking at. You know some of my old documents on this, but I I'm just wondering about, and maybe well you know us you know more about this because you know, if all you know they really wanted, is the reduction in parking. I'm not sure why that wasn't. There are other ways to do that. I happen to think the m23 is a better zoning tool for an IBZ, and so I'm very much in support of that. I'm just wondering to me: the use is very important. It says pretty clearly no business and offices are allowed and also in nursery schools or child care centers. So that's fine. That's totally fine, but I'm just wondering if anyone can explain why they're having the discussions with that lander's office about percentage of manufacturing and office space, can anyone offer an answer? I'm not familiar with their direct conversations, but I know that Brad has been very strongly advocating for the IBZ to keep that type of use and anyone who's. Looking to do anything I think he's holding us to a standard in the Ibc that we're requesting that you know remain industrial and keep that type of use, so I think he's doing that part for us and Monadnock is contributing to it and you know voluntarily trying to come up with some solutions. So that's all I know about it and that zoning, the media metaphor, the M2 M23, is the one that they're targeting for the Ibc so which is important, I, don't think they're necessarily targeting anything, I. Think the studies and the conversations that we've been having with regards to the IBZ is that it, given all the information that city planning has accumulated from us and other property owners and businesses that it will be used on a individual basis, a case-by-case basis with developers or project or property owners that come to DCP and the iibz looking for some relief, whether it's for parking or some growth to sustain their businesses, so I, don't think, there's any overall goal for any one specific zoning which could be a problem because everyone could be looking at. You know 20 different things, but again I think this is all so in terms of the use. Then I would just say: David in terms of the I would say we should go out. I mean he is not out of scale, so yeah I think, instead of just going to agree with whatever Brad Lander's office says. Since an M2 shouldn't have office space, it really is meant, for you know it can do retail stores and stuff, so maybe they're trying to keep it I, don't know, I'm not sure you know, we don't know what the uses are. Maybe he's trying to be very specific about uses I, don't know how prescriptive we want to get but I think at least we should go in and say that 30 is what we're looking for. You know, I, don't know that we would not do it, but I don't think we should just say whatever Brad's office says is good for us. You know, I think we should be a little bit more. A little more. You know, definitive about what we want to. The offices could be an accessory used to the construction activities, so that may be how they're getting offices in there. Yes, Paul I'm curious when you were on the call. The other night were you under the impression that it was just ten percent, because you didn't I noticed that you were. You seem to be okay with it, or were you on the impression it was 30, plus 10 percent? No I was under the impression that it was their use, plus an additional amount to be negotiated and I think. Another question that was unclear is with, if Monotonok ever decided to relocate or shut their business, that 33 would remain industrial use so yeah. That was my understanding and I. Think Ariel clarified it from her understanding. But again you made it clear that it was confusing to begin with, but yeah. If I may, it was clear from the conversation with Landers Office that lander is in favor of this project, with the caveat that they have to work out some agreement with regard to permanent space, which, in other conversation I would I was told, is likely to be some maker space and that kind of use and the intricacies of negotiating that are far beyond this board. With our understanding that we would like to make sure that there are still manufacturing uses is a very good idea, but trying to be prescriptive on that only will lead us to be ignored rather than to actually advance our purposes. Perhaps that communication should be with Brad's office so that his negotiations, you know at least understand what our position is and what our goal is sure. I agree with you Peter that we can separately ask Brad to keep the industrial percentage as high as possible and they'll negotiate that and the second question I had was about the area way along the canal, because I know at some point they were saying they weren't going to require it in the IBZ, because that was going to be an onerous amount of cost to any IBZ owner trying to do anything on their property. So I wasn't clear. Is that a is that set back along the waterfront something they're giving to the public, or is that a requirement? That's a requirement in the Ibc, so anybody in the IBZ is that going to become part of I mean that was I. Just that's what I'm asking I don't know. If that's going to work with whole foods, we have it with lows: I think it's any waterfront development earlier that department of City planning was mandating what they were doing there. Okay, is it worth hearing from Tom Mcmahon he's the he's, adding things to the chat? Technically, no one, you know they're not permitted to speak, I mean you're free to repeat anything. He puts in the chat, but if we can avoid departing too much from our general rules, we're probably safer that way. Okay, so Tom has written offices are allowed in this zoning. I'm assuming it's under one of the other use groups or as an accessory use and Tom you're. Welcome to reply in the chat to see if I have that correct. You do say the only changes for the parking, maybe the only material change that the change is the zoning district. Is that also correct? I'm waiting to see if he writes back. He also said that the discussion with Brad Lander's office is over preferred uses or maker space. Just encouraging. You know less office and more industrial manufacturing use. So Tom is writing. The only change is to waive the parking but you're asking for a new zoning district. That's how they get the waiver of the parking. There are changes in you. There's also use changes, yeah that that's I'm sorry yeah. If it was a waiver in parking, we just would be dealing with that we're changing the zoning district from m21 to m23 they're, saying the zoning change itself eliminates the parking requirement. Okay, so Tom says yes, that is how you get the. That is how you get the waiver, according to city planning, okay, so they're getting the waiver on the parking, because they're changing the zoning district, so I would suggest we. If look. If we want to encourage more diversity of use or more industrial space, then that should be part of the motion. Otherwise I still say we should just stay with the original motion and then ask them to come back. They've already said it in the chat that they will so we could also encourage them to share their design for the esplanade to produce the best public amenity possible that will discourage negative use. Eric's got his hand up Erica Peter. If I can I would call the question for the original motion I'll. Second, that and David. You were going to read the motion again yeah, let David read the motion, please. Well, let's see recommendation to reprove rezoning contingent on outcome of restricted declaration negotiations with the following condition: design a more creative public amenity along the promenade based on the committees and communities. Feedback sounds good to me. Okay, so again we're going to presume you're in favor of it unless you post in the chat that you're against. Do we have a definite second on this I seconded the calling yeah Jerry Gary saw the motion. Okay. So again anyone who's against this. All right, no objections David in your next motion, please, okay! So the last thing we looked at. Actually we looked at it before Mondoc was Dcp's presentation for zoning for coastal flood resiliency DCP is seeking community feedback and comments by December 28th. They took us through this presentation. It's pretty detailed, ty I guess we can just run through it yeah there are 44 slides, so I'm just going to scroll through. If you want to okay, so there was a look back in terms of what happened in Hurricane Sandy, where the floodplains are what the projections are in the future and how they intend on dealing with resiliency issues along waterways in New, York, city I would just reinforce. This is not just for Gowanus. It's for all waterways. There's a lot of detail here, as you can see in some of these photo in these renderings they're, raising yards they're, putting a plug encouraging flood panels, elevating mechanical equipment, simplifying the procedures, keeping residential units up off the first floor. There's been some interim measures that I've seen over red hook. I know keep going ty, I'm just looking for stuff. That call so, as you can see, Gowanus is in this blue boundary, which expands above beyond the one percent plug plane zone. Sorry, I can't see all this other chat in the way here, I'll keep going ty. As you can see, the design flight elevation is quite a bit high in some of our communities. They expect it to get higher and the additional height required to meet. Some of these new regulations would be exempted from zoning restrictions on height. You would start at the floodplain base elevation rather than the street elevation, which is where you usually start I'll keep going and you can see depending on just the I'm sorry ty, just go back to that. Just for a second you can see, depending on whether you're in a yellow zone or a red zone. Your design, flood elevation, where it's measured from, can change they're trying to encourage some flood proofing of ground floors. In the you see on the on both slides there, the wet I guess what they call wet floodproofing, where they have these panels that open and close, so the waters can go in and out in spaces like garages. So what's the motion on this, so we essentially we the committee just recommended to approve it as presented. We did ask them or encourage them to reach out to other community groups, particularly the Kag and resilient red hook, to seek input since they had not been approached yet I know there has been a lot of public meetings around this. It was just those two groups hadn't seen this, maybe members of that those groups have, but not the entire group, and certainly with I, would say on behalf of the Cag, where I am a member, given that all the things that are intersecting there in terms of super fund and how the zoning effects that this is another piece of a very complex puzzle and they did assure us they would come back to us now, there's a long process here to get this approved. Like Ariel, you had a really good point that I tried to write down here about it had to do with the fact that they were making special considerations for nursing homes, but- and you pointed out well, it shouldn't just be nursing homes. It should be for the entire community. My point was more that if we can live we're trying to make a case for living in flood zones, so if we can live in flood zone, everyone should be able to live in flood zone and so right they were making, and so it's kind of a this weird thing that well you know it's not good. For some people, so that was it and I. You know I conceptually get it, but it opens up the door to a lot of other concerns that a lot of people have about living in the flood zone and so I feel like that's that doesn't send a great message. We should be building to be able to live there or not. You know, and that's what that was like. It was well said: David am I correct that you did not have a quorum and you need a motion on this. You are correct, sir. Yes, before we discuss further, let's have a motion: don't move any discussion beyond what we've already had just one point I want to make. We saw the preliminary to this to the zoning to these changes to the zoning. Probably two and a half three years ago and I just want to say I couldn't make the meeting, but looking at the presentation, the day of and afterwards I think it's improved from where it was, and it's about as complete as you can get. Yes, you can make it more complete. There's a nice example in there on one of the slides of a building, just a new building on Van, Brunt, Street and red hook. Multiple with multiple rooms, I think it's about five six stories high. The way they made the entrance to the ramps to accommodate not only regular people, but anybody who's handicapped, so that raising the building does would not present a problem and I. Think it's a great addition to the zoning code. I agree. Anybody else: okay, we're again, I'm gonna assume that you're in favor of this, unless you post in the chat that you're against it, please again, if you're explaining for cause. For any reason, please note that okay, that motion passes. Thank you, David, good luck with your exam Peter. If I may just indulge me for one minute, I just want to say before I sign off here that you know it's been a rough year and sometimes a very emotional year. I was on a memorial service. Virtual call the other day for my aunt and I just want to thank everybody at the community for staying involved and staying committed and I all I wish. All you, the best holiday season, you could possibly have a drink. Have a cocktail? Have a sip of water I, look forward to seeing all of you in 2021 good luck tomorrow. Thank you. Good luck. So one of the first thing we're going to do is we're going to go back and we're going to approve the minutes of the last meeting. Once again, if you have any desire to a any changes to suggest, please put them in the chat and if you wish to either abstain or vote against the approval of those minutes. Please note that in the chat as well- okay, we're gonna, but can we have a vote, please that in favor of the we're proving the minutes, then aye? Thank you. Everyone do we have anyone that has signed up for community session which we're going to do. First, we have one abstention, noted Peter. We do have one member kitty, yeah, Max, Thayer I, see your name there. If you'd like to speak, you have up to three minutes. Please I need a second I need a second to do it. Second, that's me: okay, Max should be unmuted now yeah. Can you hear me now? Yes, oh great, thank you so much I appreciate again, you have three minutes. Did anybody see me or is it just audio? Okay thanks and I'm not sure, actually how many people are at the meeting? Does any does anybody know I see like 20 people on my screen, but I'm not sure there's like 30 or 40 of people here, okay, great 66, 30 or 40 people here, oh great! Well, thank you very much for giving me the opportunity to say a few words. My question really was just about how you guys, as representatives of the community, are getting information about what the community wants and how you guys make your decisions based on that, and just as an example, you know myself, along with a few friends, formed our community group Gowanuslands.Org this summer, the idea being to advocate for a park a community park on public place. We've got a thousand signatures now on our petition for that proposal. So a lot of people in the community are really interested in the park. But you know: that's just a thousand people there's thousands of people in the community, so what we've decided to do is to do a statistical, professional pull of the community to get a sense of you know how many people throughout the community are actually interested in having a park on the site and we'd be happy to share that those results. You know with you guys as well as we do it, but that kind of got me thinking for major decisions such as the rezoning. These are affecting a lot of people in a big way where they don't really have a vote on that. You know, there's no like voting process for that, and so my question is you know? How does the community board make a decision on that? How do you guys think about what the community wants, and how do you take that into your own decision making process? Do you have tools to do that? Is there kind of any polling you're doing or like a voting process, or is it just kind of like what the individuals feel like or how they get influenced at the Community Board meetings? I'm genuinely curious, so I don't know if there's like a if this is a time exchange I'll give you I can give you a brief answer. You know in normal times you know most public input is gathered at committee meetings. Community board meetings are open, but only community board members can speak, but our committee meetings pretty much. Anyone who asks to be recognized can speak. So when an issue comes up such as the rezoning, we would ordinarily hold one or more committee meetings and we would offer people an opportunity to state their position after they listened to the appropriate agency making. You know a presentation, you know. In these troubled times our meetings have moved to zoom, so we, you know we're doing this all on online, but you know, and it remains to be seen how unwieldy a process that turns out to be with the rezoning. You know not a person terribly inclined to prayer, but that is something that I pray about. Occasionally because I, you know, I'm not sure exactly where that's gonna go, but mostly you know it is. You know committee meetings where you know that kind of input is thought we ask the committee members to you know to listen to what the community has to say, and you know to use that in making their decision- and you know as a former chair of landmarks and land use, I can say that we always paid. You know a good bit of attention to the comments from community members, so you know that perfect or not. That is you know, that's the effort, that's the efforts that we make and you know generally it has worked in our you know to everyone's benefit. Not every decision we make you know has universal appeal to everyone, but you know we do what we can and you know we're governed by the city charter and that's the kind of input that they suggest that we need to see again and it remains to be seen how unwieldy a process that becomes with not being able to hold in-person committee meetings over the winter. So there's the answer to that question and I'm happy to, and if you know, if you want any further conversation on that, just ask Mike and I'll, he can put you in touch with me and I'm happy to have a private conversation with you about it at your convenience, I'm not sure if I'm still muted or not, but thank you for the answer. I appreciate that I've been thinking about this a little bit. You know over the past couple months, so I appreciate it again. If you wish to have a private conversation on it, I'm happy to talk to you about it. Yeah that sounds great I'll reach out through to you and Mike. Thank you yeah, and it says he can put you in touch with me. No problem, so we're going to move on the next committee to hear from is permits and licenses, and that would be Rachel rage will remember to unmute yep hello, so we had one applicant and we did have quorum. So the applicant is was two sorry 285 Nevin Street, which was the former freaks mill site and the two men that are going to be running the cider. It's going to be called Victor right. Let me see yeah Victor and they have a long history of running businesses. The one was the opening executive, chef of buttermilk Channel and the other one owns and runs French Louis and so the new restaurant. This is the new collaboration between the two of them, and so they we did have a quorum, and so we, the motion, was approved. So that motion is on the floor. Are there any comments or questions about it? Again? Anybody having a comment or question. I'm sorry, I'm hearing voices, but I'm not sure if that's just background hearing, none we're going to call the question if you're, not in favor of this motion, please note so in the chat. I do just want to say sorry, we did have community members that did appear and they had a couple of concerns just about the noise, because there had been some issues with freaks mill and noise. But at that point the when they started discussing that they assured the community members that they would post signs to be kind to your neighbors and things like that and that they would work with the dialogue if there were any issues and then the community members were very excited about having them be part of the be opening there, so it really did turn around great again if you're. If you are against this motion, please note so in the chat either that you're against or that you're abstaining with or without cause. Otherwise we're going to assume that you're in favor of it anybody hearing none. We approve that message. If you are a representative of an elected official I, ask you to just please note your presence in the chat so that Mike can keep track of them and text them to me. Otherwise, I'm going to start with the first one I see, which is Dan Wiley, representing Congresswoman, Nydia Velasquez. Okay, thank you. Thanks yeah thanks Peter, where to begin I, just topped off a Gua's conservancy meeting, which is their annual meeting, and they had a lively conversation about infrastructure net zero. Csos park maintenance, how to program and get access along the canal and, following the rezoning very carefully so I just wanted to highlight one thing that I mentioned the congressman met with the regional administrator and, of course we kicked off the dredging of the Gowanus canal, main water body, and she also was very interested in an EPA participating in a public meeting kind of like what you were at a conduit for with DEP and the infrastructure, and that was a great meeting on infrastructure that really got into a lot of weeds, no pun intended. But since EPA has a water division that is in charge of the Clean Water Act and there's a long-term control plan and this univised storm water management rule and all that other stuff. To try to have a further discussion. Epa will be reaching out to the agencies to see, if we'll do another meeting to unpack that a little more a lot going on. Of course, with the last mile delivery, it's the holiday season, we've been getting complaints about the Van Brunt Post Office, one two, one: five and the postal trucks parking and personal vehicles parking. All over the place, of course, and I have a three-year-old too so parcels. You know it's a huge issue: there's almost five million square feet of space, that's accounted for between red hook and sunset park, both sides of Gowanus bay for last mile delivery logistics. So it's showing the demand, but we experienced that in holiday season, particularly with all these packages and so the issues of the truck route. You know we continue talking with DOT and the other agencies for red hook, but also how to manage with existing postal service. And the interesting thing is some of these. Last mile delivery companies have outbid the Us postal service that you know the Us Post office that actually leases some space around Gowanus to manage its trucks and his parcels so just want to highlight. This is something you know we're trying to work on and very concerned. And, lastly, it's not in the district per se, but the metropolitan Detention center. You might have seen an op-ed in the New York Times today opinion our editorial board article about conditions and in the facility with the outbreak. You know like 60 inmates and our concerns about the measures that are being taken by the facility and better communication and trying to see what we can do. So we put a letter to the warden and we've been working with the number of advocacy groups and federal defenders and, of course, that's in community board. Seven but I thought I'd mention it, since it is the federal prison in Brooklyn just to yourself so I guess I'm over my time, but from Congresswoman to view Velasquez, Happy Holiday and stay safe, great I understand that state Senator Cavanaugh's on before we let him speak I know. Mike has a comment that he wants to make. Oh thanks, Peter I just want to say. I know this is a very weird thing, but there are people in the chat, impersoning, other people and like so specifically I'm gonna, say it's Salvatore and Amelia I know who they are I know the actual people have reached out. So please it's just if you oppose, like making sarcastic comments either way. Please, like this, the amount of complaints we've gotten about the chat and the comments and how vile it is. You know through the roof, so please like, otherwise it's going to be impossible to keep having the chat because it distracts from the presentations and we have your public emails. If that's the case, so please just and it's all on the record so and I share them. I, don't really I, don't know too many people that would want to read them, but please sign up as yourself, I guess. If you want to do that anyway, yes and tell you guys, I know you're here, all right that was it and then I guess jump on to Mr Cavanaugh, State, Senator, Brian, Kavanagh I, have to say I've been on a lot of zoom meetings and that's a new concern. The impersonating in the chat room problem. So I'm glad you're addressing it. I'll be brief. I know you found that you got a long agenda and you know the hours apologize. I'm just arriving after we've had a bunch of meetings tonight, but just a very briefly, you know the update brief update on housing issues. You know we have. We are at a point where evictions, although there are still lots of protections that we've put in place, they have resumed in New York, the first New York City eviction that we know of was a couple weeks ago in Brooklyn, not in your catchment area, but not too far, and you know that's going to accelerate unless we can reinstate the eviction moratorium that had been in place. We've been urging the governor to do that. That's basically effectively a partial moratorium. You know that limits that ability that activity, but does not prevent it from the CDC and also from the governor and the courts, so we're working trying to work with the governor to get him to just do it through executive order and if not I and others have been pushing to legislation. That and I think it is urgent that we do it. We also are trying to upgrade a. We have a modest program, that's intended to cover rent of the media's people. It's called the emergency rent relief act. You may have seen that there were some concerns about you know not all the money is only 100 million dollars to begin with, and not all the money was spent, we're working again with the governor's office to try to retool that program to ease the eligibility criteria and get more relief to more people. Just we are also you know we're ending the calendar year. Our fiscal year runs April to March in New York, so we're still in the midst of the 2020 2021 fiscal year, we're still estimating about a 15 billion dollar expense budget deficit. For this coming year, this current year and an additional 15 billion dollars in the next year, that's going to be very challenging. We are talking about whether we can, whether there's any steps you can take before the end of the calendar year or early in January, to begin to raise additional revenue, mostly focusing on taxes and other things that would fall on people who've done well during this pandemic. You know, but people with large incomes notwithstanding the economic activity and we're talking about quite large, you know potentially millions of dollars in actual income, but we're still working through a lot of proposals there and we'll try to keep you posted about that. I just want to note on governor's island, of course, officially in New York falls in Manhattan community board one's jurisdiction, but it is a you know, a very large piece of largely undeveloped land that is gonna get developed and it is geographically actually closer to Brooklyn than Manhattan. I know that Brooklyn community ward 6 has scheduled a meeting with the trust for Governor's island, which is the public entity that matters the I manage the island to present on this very extensive rezoning proposal. I think that is scheduled for the 21st of December in your waterfront committee and Manhattan community, where one is moving forward on the clock on the Euler, but I do urge anybody on the board and really anybody hearing tonight if you're in Brooklyn. This is an issue that brooklynites should get involved in there's a huge opportunity there, but also a huge potential impact. If you're proposing to build 360 story, 360 foot buildings on that island and a whole complex, it's going to have an effect and also there's. Obviously, questions about the limited access brooklynites have to that to the many amenities that can come with that island, so I just wanted to put in a plug for that today. Community board, one also has been expressed a great interest in hearing from people directly if they're interested in brooklynites as well as manhattanites, so yeah I think you know you could, if you're hearing this and have an interest you can contact me Brooklyn Manhattan, give me a read one directly other than that. You know we continue to. You know: try to address the many issues that arise from the pandemic I. You know I, think you're, all familiar with that. We are available to assist with organizations and any of your efforts, including we still have access to you, know PPE and other resources that people may need. So please do contact us if you or any organization you're connected with need any assistance with that I think I will stop there other than you know. I assume this would be the last full board meeting before you know we get into holidays, so I just wish all of you happy holiday and I know it's been a tough year, but hopefully a happy and prosperous and maybe better in many respects, 2021 to everybody and I'm happy to take questions or comments if people have them. Thank you, senator. Okay, we're going to hear from Megan Flynn from Brad Lander's office, hi everybody. So a couple of updates. One of them is that we have some new social media handles that we're using so we're kind of slowly, switching over some district stuff to NYC district 39. So that's Twitter, Instagram and Facebook. So please follow us. There obviously, like Brad, still has his twitter and we'll be tweeting, but we will be tweeting district information from those accounts. So please go follow us there. We our office, has a vast amount of hand, sanitizer and masks. So if you are interested in need more- or you know want to give them out- please email us at Lander, Council.Nyc.Gov and we'll try and either coordinate with you to get someone there. If you want to come pick them up or send them over to you in the mail we're repurposing fresh direct bags, so you can drop them off in a couple locations in CB6 and then we get we've been giving them to food distribution sites. So in park slope you can drop them off at 2:56 13th street, between Monday and Friday, from nine to six in Carroll gardens at 71 3rd place, Monday through Friday nine to six and in Cobble Hill 359, Henry, Street Monday to Wednesday nine P.M to six and an update we've had from parks is that the parks department reached out to us to let us know that they will be reactivating most sport field permits this week with clear guidance going forward and then permits in orange and red zones would be rescinded in yellow zones. Teens would be under heightened restrictions, but permits will remain in place. I know a lot of people had reached out to our office about that. We also wanted to note that you know we know this is a scary time for small businesses and we're working on our small business lease recovery program. But in the meantime, for the holidays, you can support local businesses by giving out digital gift cards that the 5th Avenue bid has, and you can learn more about that on their site, the other 5th and a happy holidays and happy new year, and if you guys have any other questions or concerns, you can email us at Lander Council.Nyc.Gov thanks and Happy holidays, great Edward Cerna from Bill De Blasio's office, hello, everyone, Edward, stern, Brooklyn, bro director for the mayor's office of community affairs. For those of you that don't know me, I'm Daniel, Abramson's predecessor, I, came on shortly before the shutdown. So you know for again for those of you who don't know me happy to see you all just quickly. The city is facing a number of challenges right: the economy still recovering from Covid-19. We have cases going up, but one of those challenges is blood supply. Last week the city launched the give blood campaign and we're asking New Yorkers to step up and 20,000 New Yorkers more to step up and donate blood by the end of the month. There are some incentive prices that are being given out, but your donation can literally save someone's lives. So, if you're able to please visit Nybc.Org Givebloodnyc, so you can donate the gift of life essentially. Secondly, today the mayor announced that the city is expected to re, receive 465,000 doses of the Covid-19 vaccine by the beginning of January, in accordance with state and CDC guidelines. Initial doses are expected to be given to nursing homes and health care professionals performing high-risk activities and then heading into the spring of next year to ensure equity and distribution. The city will also privatize prioritize. Excuse me, vaccination for residents and communities of color in the 20s neighborhoods that have been disproportionately hit hard by the pandemic. A similar process would also take place for the modern vaccine, so we just really need to stay strong, absorb social distancing through these last couple of weeks and the holiday, and then hopefully you know what we will get those doses and make them widely available. My email is Eserna Cityhall.Nyc.Gov. So if you have any other questions pertinent to the mayor's office, please feel free to reach out. Thank you and happy holidays great. Thank you. We have Taika from Scott Stringer's office, hi, everyone. My name is Taika Haraguchi and I'm the Brooklyn bro liaison for Comptroller Scott stringer, it's great to be back here tonight with community board. Six I just have a couple of announcements, so our office just released our annual making the grade report. This is an annual report that issues letter grades to city agencies based on their level of success, spending with minority and women-owned business enterprises. That's what M/ WBE stands for. The grades are based on the framework of local law 1 of 2013, which set M/ WBE participation goals for mayoral agencies. So each year this report assigns letter grace to 32 mayoral agencies plus the comptroller's office, unlike other M/ WBE reporting produced by the city of New York, making the grade measures the actual spending of each agency in a fiscal year. So the goal of this report is to shine a light on the city's spending with minority and woman-owned firms and to encourage all city agencies to increase M/ WBE utilization. In order to further increase transparency, our office has created a set of dynamic, interactive maps that illustrate the city's spending with certified M/ WBEs by race, ethnicity and gender community district and borough from fiscal years 2011 to 2016. So these maps highlight where M/ WBE spending is and is not happening and can be used. You know as a tool to better understand the M/ WBE landscape in New York City. The comptroller has made this a priority and we know that the city and all agencies can commit to improving their mwb letter grades, because we've seen quite a few improvements internally as a result of our own advocacy in this area in comparison to when we began seven years ago. So just a couple of quick examples. For instance the comptroller appointed a chief diversity officer seven years ago and director of diversity and Bureau Asset management, with the result that today our cabinet is very diverse. It is 70 women and 38 people of color, the mayor followed suit, and he also issued an executive order to appoint chief diversity officers and the charter commission codified the M/ WBE program. You know we made it a goal to hold city agencies accountable, so we graded city agencies on nwbe spending. We surveyed 500, plus M/ WBEs on the impact of cover 19, so that resulted in New, York City, going from 21 to five underperforming agencies, and the controls office will now require the mayor's office to submit justification from M/ WBE goals during registration. This also resulted in 77 new women and people of color on corporate boards. 13 corporations that now incorporate the Rooney rule and now U.S companies are committing 1.5 billion for early stage managers that fall under the requirements of a M/ WBE letter grade. So I'm going to drop this report in the chat box so that you can see further some of the work that we've done here and finally, we also called for direct support to help New Yorkers experience the homelessness as winter approaches and to move homeless, the homeless population off the streets into shelter and housing for the sake of brevity, I won't dive in, but I will also provide this report in the chat box. Thank you very much. We have Donna Newton from Joanne Simon's office. Please remember to unmute yourself: yes, thank you hi everyone. Thank you. So much for inviting me I want to keep it really brief. All of the people who are representing electeds here tonight, who've, spoken ahead of me, have covered off on a wide array of topics that I know are of interest to all of you. Joanne sends her best. She was speaking this evening at a ranked choice, voting forum, so she couldn't be in two places at once. Essentially, I just want to say both myself and Olavia. Bello have joined Joanne's staff as of last week, so we're brand new and we're absorbing everything and I've been a fly on the wall at several of the meetings, including and the hearings that and you all have opened my eyes a great deal I. Thank you all for that. In terms of updates, you've heard a lot from everybody. I'm not going to bore you with any stuff that you don't that you already know. I would like to point out that today in the snow and the wind Brian Cavanaugh was there as well. The groundbreaking happened under the Brooklyn bridge on the Emily Roebling Plaza, which will connect the two areas of Brooklyn bridge park which we're excited to see, and we think that will be a great thing and it's supposed to be completed in a year, so we'll see about that also Joanne was part of the group that heard testimony this morning from a number of law students who had it had enormous issues with the online bar exam that happened in October of this year, and definitely people are seeking to make changes for that. As we all know, I think many people here who are in attendance now are have first-hand knowledge of how difficult education is through a virtual platform. The other thing, I just want to say, is often usually at least four out of five days during the week. We're going to try to have somebody actually in the district office on Smith Street. If you ever need anything, you want to stop by please. You know there will be a plexiglass panel between us, but we're happy to see you always happy to get your emails happy to get your phone calls want to know. What's going on with, you want to know what you're thinking and we want to wish you and your families and everyone that you love the very best of holiday seasons in a much better 2021. great. Thank you. Donna. Now we have Lauren from Methodist Hospital hi. All thank you for having me good evening good, to see you all. First off I just want to say thank you for your patience. As we've all been doing, the water main work. That's been going around the soap. There are some entrances that have been rerouted for visitors and patients and even staff. So we apologize for the inconvenience. There's gonna be more water main work next week, but hopefully it will wrap up and no longer be normal. Operations will be underway as normal as they can be. In these circumstances, I also wanted to announce that the center for community health is going to be opening late, January 2021, that's the new ambulatory care facility across the street from the hospital. The first services to come online will be our cancer center on the top floor and much thanks to Eric Mcclure, who chaired our construction task, Force Megan, Flynn, Leroy, Branch and Emily Raquel may, who have sat on the construction task force. It's been a long time in the making, and we are very grateful to the community board for sticking by us and with us as we've gone through this process. We also just to let you know there are a number of virtual support groups and programs that are happening at the hospital that have continued to happen. Breastfeeding support group, Stroke, Support, Group, Ms and Alzheimer's support groups, so I will put that information in the chat and if you have any questions and I'll put more information about the center for community health feel free to reach out. Thank you thanks very much Lauren for joining us I appreciate it. We missed somebody earlier who wanted to speak in a community session if Eric Bath is still on you're. Welcome to speak, I didn't see him, but I just wanted to make sure I, don't think he's on anymore Peter. Okay! Is there any other elected official representative that didn't get a chance to speak hearing none? Is there any new business? Also hearing none again happy holidays to everyone? I wish you know the best holiday of whatever it is you're going to be celebrating in the next few weeks, be safe, be careful so that when we are ultimately able to gather again in person in 2021 that your smiling face will still be with us, so happy holidays to everyone and thank you for joining us tonight and we will see you the second Wednesday in January be well next year, Happy holidays. Thank you. Bridget, bye, hi Dan stop trying to make him be quiet. He said.",
            "summary": "You know we're continuing to meet in this manner because of you know all the things that are going on in our city and in our state today.\nThis is not exactly news, but for those of you who didn't read Mike's message, we expect city planning to certify the Gowanus rezoning on January 19th and that will start our time, clock.\nYou know at least one of the presentations from city planning at either landmarks and land use or economic and waterfront development, so that you know the basic details and understand what you're voting on.\nYou know some of our landmarks and land use gurus have on it as well as the economic waterfront development people, so that when we ultimately vote on it in either February or March, we will have you.\nJust, following up on what Peter said, you know, of course, my newsletter as people, know, I, do give alerts about the upcoming meetings and things like that, but also and we've gotten more views than we used to all.\nLet me know, in which case you know, I, can make sure the president's office knows that you still want to be repointed and things of that nature.\nObviously, If any vote is close, we'll figure out another strategy, but for now we're going to work with noting in the comments, If you wish to vote against a emotion, so I'm going to turn it over to David Briggs who's going to present the landmarks and the land use items as I understand, it.\nOkay, So we're going to start off with 433 9th street legalization of third floor rear windows and the park slope historic district, extension.\nHere, this project had gone through landmarks and then the owner changed something without going back to landmarks, and so now they're asking us to okay it.\nIf we go to the next one, What they're really looking for is to reduce the on-site parking requirement, the height and bulk of the building, Even though it's going to be a different zoning district will not change.\nSome views of the building that currently got designed by Bernheimer Architecture Ariel Bird's eye view of the promenade conceptual photos, a section diagram showing how the street end will be terraced down to the canal, providing more absorptive soft edge rather than the typical hard bulk steel sheet piling, And this is a little further along where you have the promenade, where people are walking and Florida police with guns drawn home and more details of the promenade and for those who were you know following the zoning.\nBut the motion says that the application is approved contingent upon a restrictive declaration being reached with the office of Brad Lander.\nSo David I will make that motion to accept the application, with a restriction that they reach an agreement with Brad Lander's office on a restrictive declaration for the industrial use and to request a more creative use of the community space so as to promote the best use.\nThink what I wrote down, because I hadn't gotten there yet, but to design a more creative public amenity along the promenade based on the committee.\nThe concern was that, unless we use words other than encouragement, If we require a more creative use, it is more likely to get involved included in the department of City planning's consideration.\nTechnically, That means that the drawing and design of the building, as well as the public amenities on the waterfront, can change.\nI said what we're voting on is the change in zoning district zoning designation, not just the parking right.\nWe're buying a pig in the poke on design of the building the way in its appearance, the green roof, because since we have no control over that, they they're pretty pictures, But we don't really know what we're going to get.\nAnd I think we'll have a better handle on what, if it's appropriate, not because we'll have a better handle on what's happening with the rest of the rezoning, because they have to go through the entire Euler process before they start committing funds to completing the design of this new building and the promenade.\nI heard that the school issue for the Euler was gonna, be totally put on the city portion that it wasn't going to be part of the discussion of the whole Euler of the Gowanus rezoning.\nWhat school issue you guys talking about the building of a school they were, that was going to be part of development on public place, I think at least according to the last presentation.\nWell, What I was going to say right since we're really only talking about the changes to the parking rates.\nI, Don't know that we need to put it in the motion because it we can ask for anything.\nSo I agree with Glenn on this, because part of this whole rezoning conversation and what's come up in the IBZ conversation is the look ahead and a reduction in the changes to zoning and parking.\nRepresentative said in the chat that you know they would be happy to keep us apprised of design changes and everything like that.\nSo one thing I do wonder about is, and I hadn't had a chance to look at this before the meeting last week, but in going from M1 to M2, you lose out on use group.\nSo one of my questions, is: I'm, not sure I'm wondering about the conversation that Brad Landers Office is having, because I thought they said that they were going to be having offices up there.\nThe studies and the conversations that we've been having with regards to the IBZ is that it, given all the information that city planning has accumulated from us and other property owners and businesses that it will be used on a individual, basis, a case-by-case basis with developers or project or property owners that come to DCP and the iibz looking for some relief, whether it's for parking or some growth to sustain their businesses, so.\nYou, know 20, different things, but again, I think this is all so in terms of the use.\nI think, Instead of just going to agree with whatever Brad Lander's office, says.\nIf, I may, It was clear from the conversation with Landers Office that lander is in favor of this project, with the caveat that they have to work out some agreement with regard to permanent space, which, In other conversation, I would I was told, is likely to be some maker space and that kind of use and the intricacies of negotiating that are far beyond this board.\nThat communication should be with Brad's office so that his negotiations, you know at least understand what our position is and what our goal is.\nI agree with you Peter that we can separately ask Brad to keep the industrial percentage as high as possible and they'll negotiate that and the second question I had was about the area way along the canal, because I know at some point they were saying they weren't going to require it in the IBZ, because that was going to be an onerous amount of cost to any IBZ owner trying to do anything on their property.\nYou, know less office and more industrial manufacturing, use.\nOkay, so they're getting the waiver on the parking, because they're changing the zoning district, so I would suggest we.\nWell, Let's see recommendation to reprove rezoning contingent on outcome of restricted declaration negotiations with the following condition: design, a more creative public amenity along the promenade based on the committees and communities.\nYou know how many people throughout the community are actually interested in having a park on the site and we'd be happy to share that those results.\nWhen an issue comes up such as the rezoning, we would ordinarily hold one or more committee meetings and we would offer people an opportunity to state their position after they listened to the appropriate agency.\nWe ask the committee members to you know to listen to what the community has to say, and you know to use that in making their decision.\nAnd I'm, happy to, and if you know, if you want any further conversation on that, just ask Mike and I'll, he can put you in touch with me.\nI'm hearing voices, but I'm, not sure if that's just background hearing, none we're going to call the question if you're, not in favor of this motion, Please note so in the chat.\nCsos park maintenance, how to program and get access along the canal and, following the rezoning, very carefully, So I just wanted to highlight one thing that I mentioned the congressman met with the regional administrator and, Of course, we kicked off the dredging of the Gowanus canal, main water body, and she also was very interested in an EPA participating in a public meeting kind of like what you were at a conduit for with DEP and the infrastructure, and that was a great meeting on infrastructure that really got into a lot of weeds.\nLast mile delivery companies have outbid the Us postal service that you know the Us Post office that actually leases some space around Gowanus to manage its trucks and his parcels.\nI know the actual people have reached out.\nI, don't know too many people that would want to read them, but please sign up as yourself, I guess.\nWe are at a point where evictions, although there are still lots of protections that we've put in place, they have resumed in New York, The first New York City eviction that we know of was a couple weeks ago in Brooklyn, not in your catchment area, but not too far, and you know that's going to accelerate.\nThis would be the last full board meeting before you know we get into holidays, So I just wish all of you happy holiday.\nOkay, we're going to hear from Megan Flynn from Brad Lander's, office, hi, everybody.\nI know a lot of people had reached out to our office about that.\nYou know as a tool to better understand the M/ WBE landscape in New, York, City.\nWe're going to try to have somebody actually in the district office on Smith Street."
        }
    }
}