{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB1",
            "channelId": "https://www.youtube.com/channel/UCMYlXK0jyerVnc3dmz-vjCA",
            "title": "Transportation Committee Meeting  2020 11 05 18 40 44",
            "publishDate": "2020-11-05",
            "shortDescription": "Brooklyn Community Board #1 Transportation Committee Meeting  11-05-2020",
            "lengthSeconds": "2:24:49"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB1",
            "normalizedName": "Brooklyn Community Board 1",
            "twitterName": null,
            "youtubeChannelName": "Community Board",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCG5fH7ZKjO3bS7BB33MjAXA",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "QXQFzN6ebok",
            "fillerWordCount": {
                "uh": 280,
                "um": 414
            },
            "readTimeFullTranscript": "86 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "parking": 128,
                "street": 56,
                "bike": 51,
                "space": 42,
                "streets": 27,
                "facility": 26,
                "lanes": 25,
                "lane": 22,
                "plan": 22,
                "term": 21
            },
            "wordCountSummary": {
                "parking": 41,
                "space": 17,
                "bike": 12,
                "term": 7,
                "lanes": 7,
                "street": 7,
                "streets": 7,
                "facility": 5,
                "lane": 5,
                "regulation": 4
            },
            "fullTranscript": "Construction for the New Kosciusko Bridge after the completion of the bridges department, was designing plans for regulated parking and biplanes. The unfortunate circumstances of the pandemic have altered the time frame on these projects. We believe that this proposed parking facility is now needed and will add to the positive, ongoing changes to the neighboring communities of Williamsburg and green. This proposed facility will have regulated parking and continued maintenance and service and I said to the community. This would be the first step to install the future bike lanes and other amenities and I'll hand off to my deputy Jimmy, hey good evening. Everyone. This is Jamie Resc, I'm a debut director for parking management and society, and we are here tonight to present to you the proposal to regulate and provide the new maker Avenue municipal Parking field. So now, if I need to share the presentation, do I have the access now to do so. You should just make sure you can see the controls. If you don't I'll, don't do it again. So I see in my sittings here chat with everyone bowling sitting info I didn't see, share screen on the bottom. All the way on the bottom stop video and then share so Carlos. If you have it, can you share it and let me see if I can do it. I can not see the sharing screen in my end here file, let's see if I make it full I can't do it it's not coming up. Can you guys see this? Can you allow Mike to share the screen? It's going to him now? Okay, let me let me make this full size, so we can see. Clearly, can you guys see this now it went to Jimmy, so I mean I can not see in my end here, like I, I'm checking the sitting, I'm using my tablet, so I don't see shared screen as I'm doing with other programs. So I'm not sure if that's fault on my end or I'm not really well expert with Webex Share content, I'm looking at share content share new whiteboard. Okay, you guys are that's not it, and so let me try. It again share file. Okay, these are my zoom backgrounds, but that's not what we want. I mean I. Have it here Michael? Are you trying to share the screen? Yes, I am okay. Let me see if I, if so, I try now you guys can see it in my. Do you guys see anything I try something, I'm not sure. If it's visible now we went to Jim. It went to Michael, I'm looking at a White board yeah. Let me take that off. I'm going to go to share. Oh here we go. I can get this up. Just give me one second folks, I apologize for the delay share screen two. Can you guys see this? Is it visible, yeah, that's perfect. Okay, all right, so Jimmy just tell me advance I'll move it forward, for you still start for the delay, folks, so Mike Avenue Minnesota Parking facility. Our unit is parking management facilities and today is the date November 1st 2020 next week, the project purpose and the current condition. So the project purpose we New York City. We try to regulate the parking facility on the BQE, as Carlos mentioned earlier, through mirror parking for this area and that will help us to promote turnover and reduce abandon of vehicles, reduce vagrancy, reduce illegal dumping. Schedule, cleaning of the fields provide more parking for area they optimize parking design, as well as provide spaces for persons with disabilities. Next, please, as you see from the picture, this is basically the current condition. That's when we went in, we have a household waste dump site society is being used as a legal dumping site for household waste. As you see in the picture, next, please go ahead right as well as construction waste dump site, as you see also on the picture, an authorized disposable of construction waste found on the site as well. Next, please, also in the current condition, we found that some of the area of the site is being used as a makeshift shelter, as you guys see on the two picture. That's are we representing right now? Next, please, the current condition. Currently we have a cleaning regs, which is the location, is treated as an on-street site with alternate side parking regulation for street cleaning. As you see the regulation, the parking the side parking regulation is as follows: Monday and Thursday 11:30 1 pm, as well as Tuesday and Friday on the other side, from 11:30 to 1 pm the Asp mandates moving of vehicles, thus reducing capacity so people technically they have to move their vehicle during this time. Next, please the project details. So the project detail. The project area lies between green point and Williamsburg neighborhood site located on Meeker Avenue between Metropolitan Avenue and Morgan Avenue, underneath the BQE. Next, please, that's. If you look that's the location which is, we have three phases next, please so we're looking at phase one at this point in time, folks phase one we are focusing as Mike mentioned right now we are working in phase one. That's technically. If I know that some people went to the side this morning or yesterday, and they looked at the location, that's technically phase, one as Michael mentioned, that's what we are focusing right now. The project benefits, so the product improve long-term access to retail. As we see that the area there has been changing and commercial parking, promoting commerce for the area, provide long-term parking for workers away from the store fronts area and freeing up curb spaces for residents, provide cleaner, safer environment for motorists, bicyclists and ditch train, as well as metered regulation, will make it easier to provide maintenance, upkeep and enforcement, as well as a turnover competing cuts and the availability of parking. This facility will provide parking options that will increase the parking supply overnight. Parking will be available, but the mere regulation prevent long-term storage of vehicles, so the competing as we're all seeing now, with the advent of more restaurants on the curb the demand for the curb is continuing to grow, and you know this is another thing that we feel providing additional parking amenity but a complete parking structure. This is not just parking, it's just a use for all users, bicycles, speeds and so forth, and, as we said, you hear me yes, and we would also you know we would work with you guys. What are the hours of operation that makes sense for the community board in the neighborhood and then the overnight parking would be for free, so folks that come in after a set of time, they can leave the vehicle overnight, get up the next day and go to work. So it would provide another mechanism and again a regulated, a larger parking area for them to use sorry sure and actually to add to Mike and I mean. Our survey saw that a lot of cars has been there for long period of time. So that's technically is going to help the resident as well as Mike mentioned overnight. He can park their vehicle there, so the project benefits park and ride option. The site is located by the Lng trains, the subway lines. It's a project site location by the stops of the two subway lines, provides opportunity for park and ride normal street station for the L line, as well as Metropolitan Avenue station for the G line. And if you see the map, that's a blue DOT. That's where our the whole project for Maker Avenue, which is, as we mentioned earlier, three phases and, as you see that's, where is that subway stations are located which is closer to the facility, the proposed facility. Next, please, the project benefits maintenance and upkeep during phase one, the site, preparation, parking, maintenance, crew removed, 60, tons of household and construction debris from the site. The side will be cleaned and maintained regularly. The defective lights will be replaced. As you see, on the picture, there is numeric location. The light is off, so that's something is going to be taken care of improving lighting and safety in the area. That's happening now, we're doing the lights now we're, irrespective of what happens. Snow removal will be provided for the site as well. The field inspection will be done regularly to ensure safety and serviceability as well as meet our parking regulation will be enforced. Next, please phase one cleanup. We are here showing some picture of before and after how it was looks before and how it looks now. This is the first pictures second here also before and after. If you see a lot of garbage a lot of construction, waste and household waste, and as you see the second one, that's how it's been cleaned and our crew working on the back there next, please also there's a second, also a third picture showing before and after this is overall this little debris that was dumped construction debris. There was a giant granite block that we found we had to actually break it up. Somebody dumped it there 60 tons, we have a receipt, I mean 60 tons garbage. That was I mean it's a lot of garbage. Was there remember all that debris takes up space that people could be using next, please future opportunities which is bike lane, so basically I mean regulating making this parking regulate the area that is going to prepare the way for a lot of amenities on the future in the near future. So the implementation of this facility provide a canvas for future bike lanes and other amenities. Parking is working with other DOT divisions to ensure that those future bike lanes and other amenities can be accommodated there. Duties are also working on the design of bike lane and plans to return in the spring, with the plans which reflect previous workshops and community conversation. At this time, the demand and utilization of the facility will be better defined to accommodate and comprehensive design that serves all, as Mike mentioned, that we are pursuing. Now we are pursuing phase one, which is that's going to give us like a clear idea how we can move forward with the second and the third phase. We feel it'll be a good limit for what does the community what's going to help the community the most you know we want a complete facility. We will work closely with our bicycle folks, because that's important this has to serve all modes of transportation and that's mission. Critical, but I know that you guys have been working with Sean Quinn Ted, some other folks. We work closely with them also you know, but we felt that they have a timeline. We could get this thing in see how it works, get a sense, put a tone in the pool first and then, as it goes, modify it payment markers we're. Putting down. Can be removed, we're using you know not temporary, but ones that can easily be taken up to modify this to accommodate the bike lane future operated also, there's other more opportunity. The car share parking spaces, which is we already accommodate in our other parking fields. Around the five boroughs, the site can be used to house vehicles in car sharing program which can potentially reduce personal car ownership, improve access to services, reduce congestion and, as well as improve air quality. We're excited about the potential for the car share, because if one car share spot can take five or six vehicles off the curb in a residential neighborhood I mean that's a really good thing, as we can see it and it helps the environment. It helps a lot of other good things. It's very green for us to do so. These are the things that we would be looking to push and move forward with, and we see it as from experience. We see it successful on the other parking fields, we hold like almost 31 parking field on the five boroughs and most of this parking off street parking field has car share and it sees the program has been succeeded and started with pilot I believe now they have it as a permanent program. Well, we would the car share, folks that we worked with. We would work with them and obviously the key community board to see where it makes sense. How many would like to put out there what people typically don't like is. Oh, this is going to take away my existing parking, but since we are cleaning this area and providing more parking, this would be some. We wouldn't be taking away from anybody to provide this amenity. Next, please av charging station, which is I, believe everyone talk about electric vehicle and av charging. This site also can be used as a host ev charging station to provide charging opportunities for people whose electric vehicles- this is a very the location. There is a plus and it's a central location I mean like serve a lot of I mean the area. It's it. It's a very it's going to be demanded demanding us, like. We see other facilities, the location for this facility, it's a premium location, so we believe that there's high demand for this, and let's look at it this way, there's a mandate for the agency to go all to electric and said time. This is what we want to be able to provide to reduce co2, Nox, Ppms and so forth. So the ability to have this may be something that precipitates the ability of other folks to say. Well, I know that I can charge somewhere. I may not be able to charge in my garage, but I can't enter this across the street or under the BQE or in the neighborhood. So this is just another thing that we'd be very excited. If we can do this, if this is something that works for you, folks, there's something we would love to see in there also I believe my next I believe the last. This is the last slide. Yeah I mean we this slide. Actually we showing what we did in Gowanus parking field, which is technically that is very similar to maker under this expressway before Gowanus, I'm going to give you like a quick background of Gowanus is located under the third avenue on the BQE. Originally was a municipal parking field, the sale was closed in 1998 for construction of the elevated highway above the site also was mostly used for long-term car storage, which is quietly. We see that's happening. Also in maker, similar to maker Avenue site illegally, dumped garbage was found at the site. Surface asphalt was not in a good condition. That's also something we worked at and we fixed it. Many cars were parked unsafely, sometimes the sidewalk blocking history and access, etc, and now after next, please- and now you see after we started actually this project as a pilot industry city, as he asked us if we can regulate two bays, which is from 35th to 37th, and this pilot I mean we did it like for after we activated this two bay I mean that they came back, the community board, they came back, they said guys come continue and we need to regulate the whole area there. So, actually we succeeded of providing phase two, which is also included additional five days, and now we are working with phase three, which is going to provide six days, which is by the end of this year. We will have almost from six five two, that's almost 13 bays is going to be regulated by the end of this year and the bay is from one Cross street, as Jamie said to another, not a parking stall, but from one Cross street to the other yeah, which is from 30th street until 43rd street by the end of December. Right now we have active from 30 to 37 street, that's already active and it's being regulated and, as you see beautiful, clean people loved, it is I mean it's. We get like a very positive feedback. We got yeah. This is one of the ones that folks really liked and I think it served a niche, and there was a need for this thing, so we you know, that's why we did expand it and that's one of the things that also said. Well, maybe this is a good fit for the Amica area, so we felt Gowanus was a successful program and a successful facility. So we believe Mika would be. We would be the same. I want to add, also go on. Is we have like almost from 90 to 95 percent occupancy? So that's one of the highest facility after we regulated the area. So that's technically the end of our presentation and if you guys have any question, we are welcome to hear it and we're gonna answer it at the rest of the weekend. Okay, now, if I can get things back to where we were, it's always good. It's easy to get here and hard to get back to where we should be so you know we wanted to just go over this with you, folks we're interested in working with you. If you know we can see the design the layout so forth and so on, we could put pavement walkings down there that could be easily removed when the bike lane comes through and the final design is I know they're working on it now and I know it would be great to have the cuscus go connected. All the way through, you know, keep people from riding in the street so forth, and so on. So we would be very excited about you know, being able to be a part of this overall plan, provide this amenity for all. Okay. Thank you all right. So when I first saw this come through, it just came through as an email as a as a notice to the community board. You know that this was going to happen and you know we have meetings with D.O.T and with some groups going as far back as I think 2015, and maybe even before that we had a formal presentation in September of 2017 about general improvements to Meeker Avenue and in all this time, I don't remember ever and I looked through the presentation from September and I. Don't really remember seeing an emphasis on any kind of you know parking proposal or anything like that, and then you know just looking at the portal. You can see that there's an abundance of requests for bike infrastructure and other things to happen there and then all of a sudden we get parking. And yes, there are more restaurants operating along that corridor. Now not a lot of retail, and so you know I had questions. People came to me with questions and and then on the Facebook Community page, not the community board page but the crowd source page for north Brooklyn. There was a lot of animated concern that the city was going to favor parking and car culture over things that we've been asking for sorry, my dog been asking for you know a long time and even in the schematics from the September presentation. There's you know kind of table set up makeshift parking space, not part, not park space, but like recreation area type things, and when we were talking about the K Bridge completion, and this came up both on its own but also as we discussed the egress and entrance to the new Cambridge Bike lanes and the problems with the connector up there, Michael, I'm sorry, Michael I, believe you have to close the screen. I don't have the control you're still on the presenter. I can't close it I thought. I did. Oh all right, I! Think I'm sharing your screen wait. One! Second, stop sharing how's that better, yes, okay! Anyway. So all this to say, you know, there's been a lot of discussion about more people friendly uses for for the stretching interrupt to you, but it seems we still. We can not see each everyone, so we saw it for a little bit. We went back to a white language, that's the same with everyone or only me. Blank page and I just see everybody across the top. You see everyone. Oh I, see some people, but no I thought. No, I'm not Eric. What presentation in September are you talking about September of 2017? Can you I mean just remind? Are you talking about the workshop that we did for visioning under the yes? Okay? So that wasn't a presentation. It was a workshop about possibilities. Sorry, yes workshop! Yes to be clear: it's a workshop yeah! So we weren't proposing anything. We were out there, I'm not saying that you did, but what I am saying is that a lot of people did and then you know when it came up to. Where is it now? You know and then the we didn't make the present the workshop presentation, someone at DOT did- and you know when they did. You know I'm looking at it now and I'm seeing 125th street Manhattan Plaza 100 at Manhattan, 125th street Plaza, there's people doing Tai, Chi or yoga, or something there's a big like big connect, four and chess okay. So whatever and I know that you did that as like a visioning thing for people to get people to talk in the breakouts and I understand that, but that was I. Think you did that, because you were responding to other meetings that we had previously about the three sections of Meeker and how they, how Meeker Avenue proper was going to be. You know, repainted and made safer and Et cetera, and then that conversation came out of that. So I'm not saying that DOT proposed that they were going to do these things. I'm just saying that as a community, sometimes with D.O.T, sometimes in private I know, Transalt did their own workshop two or three workshops about this time. I guess it was 2016. right. So you know so all that kind of came into this number 17 presentation cut to now. You know where, in the community's mind, you know we understand that the the bureaucracy grinds slowly, but I think that the general feeling was that we were going to see. You know like I, said more people friendly uses for under the BQE. Not additional. You know additional car infrastructure, and the other thing too is you know: I haven't used it in a long time, but there are often times where you know: I've had to use the BQE for parking. I know, there's a lot of other residents that do rely on the parking for alternate side days to get in there. It's kind of like a thing that we've had since, and you know if anybody on the committee got a chance to read Jerry's email today, you know when Robert Moses like toured the BQE through through the neighborhood, a lot of the people that lived through that you know at least they were like. Well, at least we have some parking and you know that's hardly a compensation, but for a very destructive project in the city going back before all of us most of us were here anyway. It just there's all that and then just to have the announcement that you know we were gonna. Do this phased in metered parking, I think it just came to a shock to a lot of us now. I appreciate the presentation. I do appreciate all the cleanup that's going on down there because it was really. It really started with the Covid-19 lockdown that had really started to get out of hand that a lot of the dumping happened. So you know we do appreciate DOT and sanitation cleaning the job that was all D.O.T. Okay, all right, so D.O.T. Thank you. You know we're grateful for that. But now you know there's this question of you know what really is gonna happen there. So that's my statement, I'm gonna! There are other people that have more fine-tuned comments, so I'm gonna, I'm gonna start recognizing board members I can't see hands raised, but I see, Karen's hand raised and I can't see. Everybody on my screen, unfortunately so feel free to jump in and whatever, but be respectful of each other, and please mute if you're, not speaking, all right, so I'll recognize, Karen and then Willis and then William and I'd like to have Jerry say something if he's amenable to it after William, if that's fine, okay and then we'll jump into the public, unless there's any other board members that want to ask questions first, okay, the advent of the immediate parking is, what's also going to precipitate return, a constant cleaning and maintain the site, but also it creates the canvas, as I said earlier, for the bike lane. This makes it so that, when the bike lane is ready to come through, this area is ready to go so it comes spring or next year and the bike lanes coming through it's there. This is not a and I apologize if it seems like we're going to put park in your name, but no. This is a shared facility, otherwise we would just say no. We want to do parking. This is the way it is. It's got to work for all and if it seems as though this is being pushed and rushed apologies for that, okay and maybe earlier workshops or things, but we are willing to work with you folks on how this would best serve you all right. Okay, fair enough Karen I mean this even goes years before 2017, when we had. You know the workshop with D.O.T transportation, alternatives and concerned citizens years before that, actually we had a walk through with the council member Antonio Renoso, which we went over all of the safety issues. How you know it gets neglected, sanitation doesn't clean enforcement. So all those issues, if you know we had the cleaning underneath and if we had the enforcement, we wouldn't have these illegal dumping. You know concerns right now that we have I agree due to Covid-19. You know a lot of people, unfortunately, there's a lot of homeless- and you know it's underneath the BQE, so they are camping out there. This is definitely not what the community wants. You know as far as needed parking I totally understand that now, like especially around you know, Metropolitan Avenue, there's more restaurants and you know sidewalk cafes. But if you really look it's residential, you know going from saying the huge chunk in the middle is more residential than commercial. Then, once you get to Avenue by Kingsland, then it's industrial and a lot of residents actually park underneath the BQE I know, there's a lot of storage issues which I totally agree. If we could get, you know rid of that storage issue and address that again, that's enforcement I think we could clean up without having to have meter parking number. One number two I am concerned about the media parking because again, there's also workers, okay in the industrial area that rely on parking underneath. You know that you know have to take their vehicle to and from work, and they do rely on. You know the parking underneath Meeker Avenue, so I'm not understanding why we need to do the whole entire stretch. I understand this is in phasing and why aren't we just cleaning up and doing enforcement? Why do we need metered parking which is going to really hinder the community? So, and can you guys just go over the times and the costs again you haven't set that up. Yet we will. We would work with you, I guess. The first thing is we're looking at this in three phases, so the test would be: let's see how the phase one works. Okay, if the second area you want to do a park or something different, then that's what you guys would do, but we were looking at the first area to see how it works. We would say what do you folks think the time should be? How does it work? For you know the thing is we have a finite amount of staff and resources for cleaning, so we clean the facilities that we needed. That's the way it works with this facility. We would be there. You know a couple times a week to make sure that this thing is cleaned. You know, I can't guarantee that, because I have other facilities that we're looking at the Gowanus were expanding other things where staff would be deployed for this. So you know it's difficult to say and I get where you're coming from. Why can't you just do? Why do we have to have this, but that's part of the processes of how we do this with the parking it's to provide? You know a mechanism and also without the parking and the regulation, people don't leave people I'm going to leave my car there for a month. I'm going to do this, I'm going to do that. There is no nothing to turn it over and I'll. Tell you this. You will see what you know. The Asp is going to be much more rigidly enforced than it is now it's just coming. You know, they've cut it down, so you know I, think that's something else that you will see, but you know it's something that we thought and we do feel this way that this would be an amenity that we would work with. You not tell you because well we're just going to put in no, we would work with you sit down. We get some sense. We send you some plans. Does this make sense? Is it not? Are there more ADA spots for persons with disabilities, which is critical in this day and age? You know and the cost share and the you know, I'm not saying the college share is going to pop up, but we would push for that and the charging stations too so that you know there's cleaner vehicles but I understand what you're saying. Is this a faded complete it's going to go from end to end and we're just going to push it through? No we're going to work with you guys. That's why we're here and I just Mike, if you if I may, add one more thing. Also in regards to the Asp, as Mike mentioned, it's gonna come and with our proposal we will have our meter regulation, which is that's actually going to benefit the people who wants to park there for a long time. As you mentioned the worker, he doesn't want to come and move his vehicle from 11 to 1 just to park his car, but with our retention, it's going to give him the time, whatever the time you want to park. If our regulation is going to be from eight to ten, for example, he gonna be secured, his spot is gonna, be secured. He doesn't have to come and move his vehicle back and forth. That's nice regulations for longer term and the immediate proximity of the train station so that people can use it and not park. It not go through the neighborhoods and block drones, but at a cost. That's the whole thing now they have to add. Okay, they they'll have to add that as a cost. Yes, it's I, understand that, but also there may be driving into your neighborhood to get on the train and parking on your side streets in your residential neighborhoods. This is a mechanism to make sure that doesn't happen as much. It's up, I understand what you're saying and why do I have to pay for this, but you know this is an amenity. This is a clean. It's well lit it's safe! It's enforced, there's Pd here, there's things that go with it. Well, so for the bicyclists too, that debris won't be dumped on a bike lane or things of that sort. So there's this I guess what I'm saying is: I would hope that we could portray this as a complete package, not just a parking field, but a complete facility that serves all skateboards bicyclists pedestrians people going for a walk. You know that's what we're hoping to do, because does anybody want to park right across the street? I understand not, but look at it. Look at the pictures the before and after and talk to the people over by Gowanus. They were very play a little apprehensive, very pleased with it and from a residential school believe us. We want it cleaned up. We want to clean that, but we also want it as a public space for pedestrians for cyclists and a balance to have also, you know parking yes again, I agree with you, it's a disaster under there and it has been a disaster for years, and this is part of the problem again. If we, you know, if sanitation and if we had better lighting, if it was safer, I, don't think we would be having those issues but, but I'm just saying you know, we'd be willing to work with you on this you're right. It has to be cohesive and it has to be something that everybody gets their fingerprints on. That's not a problem for us, it's not a problem because you don't want to make enemies. You want to provide something that works for folks. So if there is a better balance of parking and these other amenities, then that's what we'd be looking for. If it's not the right thing, then it's not the right thing, but you know we want it to come to you rather than put it in put the meeting and say well, it's done, but you know when we started to take a look at this thing and said you know what let's reach out. Let's see what these folks think, let's see what makes sense for the majority of folks. We can't satisfy everybody and we all know that. But what can we do to satisfy as much as possible would be? The second base would be, you know, only a sliver of parking, and maybe you know more of a park setting or, as you said, some of these other amenities, but then you want, you got to get parks in there they're going to be willing to do it also, so you have to get other folks to come in okay. What's the time, what would be the timeline- and you said spring D.O.T should be coming to us with a proposal for a bike in I thought they were working with you already as I understood it. They have been working with you folks on the bike lane I know that they're trying to they listen the bike folks. This is what they do. They live for this, so we, when we talk to Sean, go ahead. Rhonda yeah, so they told me that they think that they'll be ready to come to the community board with a proposal for the Meeker Avenue Bike Lane in early 2021, that's the that was confirmed as recently as this afternoon. I'm I have reservations about this because once this is installed, you're gonna, you know you're to put all this infrastructure in and then come early next year after we decide. You know bike lanes in open space you're going to take the infrastructure out. It's not that Karen. To be honest with you, it's pavement markings, it's small pedestals for meters, they're, doing that there is not I'm a civil engineer by trade. It is not a lot of infrastructure at all. In fact, Carlos specifically use pavement markings that we could scarify and easily remove. So if one side's got to go, it's got to go. If that's where the bike lanes going, that's where the bike lane goes I again, it's my bike. I like to have a safe place to ride my bicycle around Juniper, Valley, Park and so forth. I get it and I and they get it for a lot of other folks and better that they've been riding through a bike lane through this neighborhood, then on the side street of people desperately getting on the BQE. You know it makes sense and that's what we want and again Sean Quinn Ted Wright, the folks that do this. They are mission critical on this very serious, I'm just curious because with money you know the city's in a is looking at a really steep budget crisis. On top of the problems that it's got already so I mean you know, this is staff hours that have already been dedicated to painting these lines and putting in these meters and or the towers for the meters. I know the meters aren't in yet you know. So it's already a lot of money been spent on this and you know how do you go back to the city council and justify tearing something out that you put in I mean obviously they're not going to ask you this? It's not that explanatory, but I mean you know if you're moving money around in the department, you know and then all of a sudden you have to like rip this up to put in you know like bike lanes or other kind of like things that the community's been asking for. You know I, I'm to Karen's point I and given history of not just your agency but other agencies, you know once something goes in it's very hard to take it out. You know so I think that's to be very honest with you. This is not a high-end item. Pavement markings are not high-end items. The people working this. There are two people that worked on it. Two people, one engineer and Jimmy- has been working on this thing. Pedestals could be taken out. What is the cost of providing safety for bicyclists? It doesn't make a difference. It's safety, you know, I can't speak to what's happened in the past or what's been negotiated before I can only talk about what we're looking at now and to say that we want to work with you. We want to make sure that this is a combined facility and if I was sitting on the other side of the screen with you guys, I'd probably be saying the same thing you said: you'd do this, you didn't do it. When it's going to happen, you know I can't say when it will or not, especially when we receive an email, basically saying that you don't need community board approval and you're going to do it anyway. But what did we do? We came to you anyway. We came to talk to you to see what makes sense came to let you know that we are interested in doing the bikeway. That's what we came to so come back to us when you have a complete package, not just piecemeal. What you want to do, let's see some of the things that the community wants done. Let's look at the complete package, I'm sorry who's speaking. It's a district manager, Jerry Esposito, okay, Jerry! It can go back to the way it was if this is what folks want, but you know what we tried to provide a mechanism to clean this area up. You know the bicycle. The bike lane will come, but when the bike lane comes and if it's all full of debris and mess, the bike lane isn't going to come, it's going to be another challenge, so you know that's a false threat. It's not a threat he's not a threat. We're trying to work with you all right, William, Willis, Sorry, Wills, yeah, I, just I want to kind of echo. What Jerry's saying is that he keeps saying that you want to work with the community on this and you're here to make this happen, but everything that the community has been talking about- it's not being presented here, and so it's a non-starter. No one said when we had all this vision. All this work was done led by the community in conjunction with D.O.T party and better utilization of the space and, frankly, the fact that I don't understand the relationship as to why this is Dot's responsibility and not sanitation's responsibility to clean up the trash. But people have been complaining and filing through one on comments for years about the illegal company, all the schools, local residents and businesses, and the fact that we're you know it's great that it's clean now, but, frankly, that's not something that we should be utilizing as a rationale to accept a plan that doesn't meet any of the needs that we desire. So if you really say that you're here to work with us, as Jerry said, you need to come back with a full plan that addresses pedestrian safety, bicycle access, use of public space, etc. Okay, you can go back and report what you folks feel. You know we were trying to provide something that would help the community I, guess that this is the feeling that the community itself is in. You know in the chamber of Commerce and other folks. Don't want to see this. You know I, guess we'll have to get more from our borough, commissioner, and see where this goes. You know we came here. The area is in disarray proposed to clean. It up goes to help regulate it. We felt that, and we know for a fact that the additional parking would take the demand for the remainder of the network, the local streets and so forth. Yes, people want free[ _ _], but they still they're going to get all controlled they're going to have to be moving around also, if other folks come into your neighborhood they're parked on your streets. If that's okay, this is but again when you provide this and first of all, it's only there's two points. This is what we're proposing to try and we said to try it out. You know: I guess: I'll have to talk to the borough, commissioner, and see where we go with this, but you know we had thought that this would be something that folks would welcome, because it gives you the parking it gives you the other amenities it keeps it clean. It paves the way for bike lane we're not doing this without the bike lane. You know, although I see there's you know concern that this may not come to fruition, but that's not the case. Okay, so Simon, please meet your Mike William Hi William Vega here and for our colleagues in DOT. We do thank you for cleaning up the streets, but I said before this should have been done by sanitation and no reflection to you and your team, but our regulation with DOT as far as the community was grand street, with the shutdown of Dale Train or not shut down. That was a disaster and we were there at community bar meetings. I wasn't part of community board, but it was felt very strongly by cyclists on the people that drive cars, the people on the businesses, the business improvement, district and Karen's industrial providers that nobody was listening to and DOT just went ahead and did what they wanted. So that is real current history, I'm right now getting Texas and emails from community members of our community, and everybody opposes this and I'll say 80 are saying this is just a way to create more revenue for the city possessing a deficit. So it's a lot of distrust. The past history, not you guys were not involved, but that's the climate. You know, I think a lot of this could be done and I have to be very honest with you. I live near there and I get calls and I go there with my neighbors to check out the chase out the drug dealers that's jumped up on Saturday. They had a little party of 100 kids. You know all that so enforcement is 24, 7, okay, so now they have an area, that's cleaned out and they bring it they're very sophisticated. They bring their boom boxes and lighting multiple colors like this girls from the 70s, so there it has to be enforcement and yeah Monday. We picked up 11 syringes in that same spot. You cleaned. Okay, that's the real world. Okay, and the thing is when we had these conversations. I wasn't part of community board, but I was part of community, so I can speak on that part and I also know the restraints government has so I. You know I work for city government as well, but the impression that we got and we were waiting for it and I'm hoping you work with transportation and services, I'm also a member. Those are my folks is that safety number one which should not be relying on meters being stored. It should have been the number one priority of city government: okay, number, two, looking up to the homeless people, what social appetite group is helping you with the homeless, because those are folks that don't live there, because they're mentally well they're, sick and who's looking after when they chase them out where they go, helping them go and find some[, _, _] or not, because I'm worrying about those folks, they're also part of our community I, said my peace. Thank you, okay, thank you. William Jerry did you want to? Did you want to say anything else? Do you want to get in there other than D.O.T speak with forked tongue. I said other than that. I have nothing else. To add I mean they sent us an email. They tell us. This is what they're doing this is what's going to happen. They don't need community board approval, I mean now we're hearing a totally different story. But again, if this is the beginning of this, you know this wonderful area. That's going to be under the expressway that they're going to promote and do then, let's see the full package because they certainly can't be trusted. Let's see the full package come back to us when you have a full package to share with us, not just a piecemeal address to a situation that sanitation was addressing a lot of those sanitation issues until their hands were tied by a homeless services. Saying that some of this was the belongings of the homeless people and couldn't be removed, and the problem only exacerbated would cover with a lot of the homeless camps that appear underneath there and hopefully those people's belongings weren't thrown away with the Buku tons of garbage that D.O.T removed. You know, I mean again, let's see the full package where's everything that was discussed in those charrettes that you referenced and all of these good things that were going to happen and the bike lanes been so long and coming. It was supposed to be ready in time for the opening of the Cascusco Bridge, and that didn't happen. Well, that's not true. There's a bike lane connection that was is goes to the Kosciuszko Bridge and at that time we told you we'd be coming back with the proposal for Meeker Avenue and that's what they're going to do. How long ago was that absolutely when how long ago did they open the bridge it wasn't? It was this year yeah I, guess it was last November that we or December right well that connector meeting I think it was like right around Christmas. And yes, that's. You know everything moves everything winds up taking longer than we expect, but, like I said, my understanding is that bikes was going to come back to the community board representation okay in early 21 and as far as the email that I spent. That said, we don't need your approval. This is what's coming, I absolutely sent that because you know I, I'm a messenger and that's what I was told to send, but it sounds like we took decided to take a gentler approach and come to you and say that we want your input so and then do what you want. Well, you obviously I guess you can see the future I can't I, don't know that my understanding is we're going to take into consideration any position that the community board puts forth to us at this point. But if we're not doing a parking facility, we're not going to be maintaining the facility I mean that's. Our parking group can maintain this facility if it's a paid parking lot. So that won't be the case without that, okay, any other any other committee members want to weigh in Simon. Maybe yeah is it Simon? You hear me yep go ahead yeah before I heard somebody mention the idea of maybe doing maybe not doing the whole plaza, maybe just immediate parking, only maybe part of it. You know that's just this idea is I. Think it's maybe if they have to do something this maybe consider just doing part of it not. You know. The current proposal is three blocks again. The current proposal is for phase one, which is only three blocks. What's the limits there Mike the three blocks, yeah Jimmy Metropolitan, to learn at a time and see how it goes. I mean that's. Actually, our approach I mean as Michael, keep mentioning in the beginning, and it's going to open I mean the road or prepare the road for all the ideas you guys I mean or the community needs. If you did the three blocks, these are the three in the media, proximity of transit and also the feeling was. We would see how does it? How does the community react to it? Is it used? Are people of people coming to use the facility if they're not and then we'd be set in a better position for the bike lane to come through as well? That's what happened in Gowanus, they started with two blocks and Zinzi asking us to start expanding. It has DOT done. Any data collection is in terms of how many times available hours of the day is projecting losing this is there a way if we move forward to monitor the impacts on parking and residential free parking? That's more! You know all the valuable parking is not here. You know it's like you're charging people to park in the most undesirable spot. So what is the mechanism to monitor how it's being used right? Now so we can actually quantify if it's valuable in terms of an actual parking lot or not. Well, truly that, let's look at it this way you there is no traffic data available right now, that'll tell you anything due to the Covid-19 and what's happening, you know and realistically I'm a traffic engineer. It's just the new norm hasn't settled in we don't know what's going to be happening, but does that mean we can't do some monitoring to see? How is it working? What are some of the areas that we want to look at? We could do post monitoring. Let's see how this thing works, let's see if it makes sense, I think what he's asking, though, is for wait hold on Michael hold on I. Think what will is asking and will correct me if I'm wrong, but I think what will is asking is, as you were, designing this idea for under the BQE. What metrics were you looking at on the front end to say? Oh, let's put in metered parking, that's a good idea for this spot. I! Think that's what he's asking not how we're going to monitor it once it goes in, but like what led you, what numbers led you to figure that this was a good fit, but both of those yeah I can't quantify what it is. We know that there was walking underneath there we knew there was debris we felt there was vermin, it was unsafe conditions so forth and so on. We said: well, you know if we did go in there and we provided a needed parking facility for at least three blocks to see how it works. That would give us a better idea. Did I do an overall regional traffic study, a simulation network model? No, that wasn't done and the truth is there's nothing that really exists right now. That would give you that you know I hear what you're saying. Listen, I hear what you folks are saying, we're saying, give it a try. It's three blocks see if it works, does it provide relief? Is there other things that you can do see what happens on the next three blocks see what happens afterwards. It's I can't say how do I put this. We took a look. We should be potential benefit to the neighborhood. That's what we're proposing! Okay, any other committee members want to weigh in speak now, all right. Let's go to the public. That has a lot to say: I think will. Can you I can't okay, so here's what I'm doing I have my phone I? Have my screen, I'm taking notes, so it's I can't switch back and forth to see who's raising their hand in the comments is part of the problem here. Well, there's a lot of comments that have come in and I. Don't know how valuable it would be to go through each one of them. I think what would make the most sense is to call on people to either have their hand up or have made a comment to better express that, because also we've had a lot of conversations in some of these comments. Sure I don't see any hands up in the guests, but if you can, please I defer to you and recognize them sure, okay, so the hands that I see up. So, let's do that if anybody else wants to speak who's on the attendee list. Please put your hand up so that see Kevin Levera and everybody else. Please meet Mike's, so the only mics that should be open right now are wills and mine. If that's all right, thank you and no once somebody speaks okay, do we have Kevin Lecherro? It has to be unmuted, somehow I think Marie has to do it. Maria there, I'm here just somehow, I lost that whole panel. So give me a few seconds. Okay, so it's Kevin Lucero's that he's actually named in the okay I, can see the chat. Now. Can you hear me? Yes, Kevin, go ahead, hey! Thank you guys, thank you to the community board for addressing this today. It's really important a huge disappointment, I think from the community as a whole that this is what D.O.T is in the middle of doing right now you know: there's been community visioning on this space. You know I know Karen. As you were saying, this has been an issue for a long time, but there's been community visioning on this space since 2015, real substantive community visioning I mean you know with the BQE you're talking about this highway has divided this community in half for three generations. You know you, the Mount, Carmel Church was torn down to build it in the first place, and ever since then it has existed. As you know, parking fields and a massive highway I know so has talked about how you know when you were looking at gang violence earlier on, the BQE was the dividing line. You know you look at asthma rates in the south side of Williamsburg. You know you look at all the homes that were turned on to build it in the first place and at a pivotal time in this, where this community has said we're starting to think about and talk about what the space can be going forward into the future, whether it be parks or basketball courts, whether it can hold storm water, green infrastructure parks, you know, whatever it may be paid parking was never a part of that conversation. It you know I, not in any conversation, I've ever been a part of have I ever looked at, read or heard anyone in this community suggest paid parking. You know and you're talking about 25 acres of land from Barrington all the way up to the creek. You know hugely valuable to the people that live here. You know, I, don't particularly care, honest well, I care about this I, don't know, I'm sorry. It's buffering I care about how people feel about it. Here in Greenpoint and Williamsburg, and in the lead-up to Covid-19 we were talking about community visioning in partnership with El Printe and St Nix Mount Carmel Church, north Brooklyn neighbors, all the high schools along that route, the Newtown Creek Alliance transportation, alternatives every single elected office as well as this community board. That was what this community was discussing. You know it was delayed because of Covid-19 and because of everything that all of our community has been through, and now we're being essentially told is that we're gonna pay now for the privilege of having these massive 10 massive parking fields to cut our community into it's totally unacceptable. You know and I think the idea is so insulting that you know we're being told it's almost extortionist to say: well, how are you going to take care of the bike lanes if, if there's all this dumping under the BQE? Well, how is DOT planning on taking care of the bike lanes that were promised before all of this, when paid parking was not part of the equation? You know this reminds me so much and it's so upsetting of what this community was facing with the pipeline before all this as well, where national grid came in and said, oh well, now we're coming to you and talking about what we're willing to do for the community after the work has already been done. You know, I, it's I, don't understand how that can be. You know on the you know, DOT should be able to clean and maintain bike infrastructure that it puts in regardless of whether or not they're charging people who live here to park in a space that has been, you know, mismanaged not taken care of for the better part of 60 years. You know the DOT does maintain in cleaning spike lanes. We were just saying that if I just may finish, we were just saying that this would help to pave the way for it, but I am not saying that DOT when they put their bike lanes in, would not clean and maintain them. No, sir, I'm sorry because I we have it all. We have it recorded here. What you were saying was: how are you expecting to keep these bike lanes? You know free of the type of dumping that happens under the BQE if nobody's paying a park underneath and I'm clarifying that right now, the D.O.T would maintain it, but since you're recording it, I'm clarifying that we would maintain our bike lanes. That's important for this community to know, because we expect those bike lanes to be put under the BQE like they were promised. You know, I mean this was I. Think the idea of also saying that 3 out of 10 of the parking fields is not that much. If there's ten parking fields between the top of the bq, we're talking about in metropolitan, there's ten, so three out of ten, it's not nothing, it's one! Third, it's nearly a third and those are spaces. We didn't. We never promised to put the bike lanes under the BQE. We said that we were going to come back with a Meeker Avenue Bike Lane proposal. I was at all of those meetings, so we are going to be coming back. We are coming to you with a Meeker Avenue Bike Lane proposal, but just it was never promised that it would be under the BQE. That was one thing that was speculated the map that was put out and I believe it was in, and you know, there's people on this call that could correct me. It was shortly before Covid-19. It was maybe two months prior to Covid-19 showed a green line that traced the route of the BQE that connected the new that connected the Kosciuszko Bridge to the Williamsburg bridge, and that was what they were talking about in terms of bike lane infrastructures. Now, maybe that was outside of the BQE, the space underneath or maybe it was inside, but that was maybe it was right, but it was not but you're saying that there was a specific promise made, which was not the case. That's all I'm saying to you, okay, I. You know, I, think that I, because you do have you know an attitude that you're like stating this with well I. Think that perhaps you know the attitude and feelings of this community might be sharper towards this plan, because this community was not consulted about what the plan is. That's what we're doing right now, we're consulting with after we were notified. So you know the reason that this is on the agenda is like I explained at the beginning of the meeting, and if you weren't those of you that weren't here for it, we had received the notice that this was going to happen, and then that generated this meeting. But there was no conversation about. Let's have this meeting, so we can talk about putting in this parking. That was not the way that was not the timeline for the way this happened. It's not the way that it came to you I sent you the email that I was told to do that this was coming and then basically, you asked for us to have a meeting to discuss it and we, you know you asked us, come to the full board meeting we agreed and then you came back and said: no, don't come to the full board meeting come to this meeting and we agreed and now we're coming with a different position that we're willing to listen to whatever it is. You want to say so: I, don't I, understand Ronda, but hang on yes, Rhonda and I'm glad that we're having this meeting and now we're hashing this out, but I think it just needs to be clear, and this isn't to any anyone. Personally, this is you know, whatever the department. The reason that the community gets hot is because of the timing. Wasn't done right now, I know, that's not your call. You are the messenger. However, you need to take it back to Keith in team decision making to say you know going forward. It has to be. We want to do this. It's a major thing to happen in the community: let's have a meeting and then discuss it so that that's all I'm going to say about that and Kevin is you know a long time grew up here. You know he's venting frustration that I think a lot of people have about the way that this was rolled out and I'm glad that we're at this point now that we can have a discussion to figure out what's going on, but I just want to make that clear that the timing is. What really has you know shaken the hornet's nest on this particular issue, but, let's all you know get calm now and figure out what the best way to move forward is. So thank you, Kevin! Do you have anything else? The community opposes this at whatever temperature it is conveyed to D.O.T, whether that is cool or hot. This is something that the community is in opposition to because they were not consulted. You know they're being consulted now that the work is happening, which is not a real true consultation. You know it's not and I think it's a little bit insulting to folks who are taking their time, who aren't paid to do this, to tell them that? If something is that it's not, you know and I, we want to see this something we want to see this space as something that is healing for our community. We want to see this space as something that is a benefit to our community and something that our community has real and true input on. You know, and there is a body of work, and there is a record that shows that input over the course of the last five years and the fact that it's not been incorporated here and now up until this point, you know I think speaks volume volumes about the process moving forward, I hope that I'm wrong and I'm looking forward to visioning sessions that involve the community on this, whether they're, hosted by DOT or by this community. Okay, the vision I just want to say this. The visioning session that was that happened in like 2017 I, we're in a different time. Now than that and we're not we wouldn't. We wanted to hear what people's ideas were, whatever they were, but at this point, if you wanted to put in a park or basketball courts or open space or something that doesn't involve D.O.T infrastructure, there would have to be a comprehensive proposal on who is going to pay for that and who's going to maintain it, because we're certainly not in the business of maintaining those things. I mean you talk about. If it were like a park, then obviously we'd have to be parks. Department, I know that there's a new park that came from the Kosciuszko Bridge project, that's the skate park and I assume that's being maintained by the Parks Department. Okay, just that was an existing park, which can anyone hear me yeah you cut out, but go ahead. That was an existing park that they did. They they they're building a new park way underneath the Costa Casco Bridge. That has nothing to do with this and right. But Rhonda I understand your point as far as you know, in whatever the community wants is basically going to need funding and whether that funding comes from, you know, state the city or parks. But again it goes back to what the community has been wanting and asking for and short term. It was bike lanes and some open space, and we even said just have planters or whatever short term until we were able to secure, you know through maybe our elected officials or you know D.O.T or parks for long-term planning. But you know the meter parking in the email. Just you know, I want to point out. It says: okay, the regs would be from long term from meeker between metropolitan to union, so long-term parking from 7 A.M to 7:00 to 10 pm at a dollar fifty per hour 15 hour limit. Then you have the same thing: Meeker Avenue between Union and Lawmer. Okay, then Meeker between Lammer and Leonard, which is short term okay, which is more residential. Just want to you know, point that out from 7:00 a.m, to 10 p.m, which is maximum four hours, which that's not even retail. Over there, so I'm just like, and then in the email, it says that the growth in the community is housing, hotels and commercial activities. Not in this stretch and who the heck cares about the damn hotel, they should have their own damn parking. Why should we be accommodating a hotel? So I'm sorry, but this is not cool. It's just not cool okay, well, go ahead. Yeah Kevin Dugan has his hand up. Okay and I just want to make I'm trying something. Now that I can get into the chat I'm trying to cut and paste the chat into a separate, notepad and I'll try to work that in so that everybody's comments are reflected in the report for the record as best I can. Okay, so, okay, so I'm sorry, Kevin Dugan is that right, yeah hi, it's Kevin, I'm with Brooklyn paper. Thanks for taking my question. I've two questions for DOT, the first one: when will this phase one? If you do proceed with it, when will this go live and how long is the test phase for well? It depends on where we go from here. I can't say what we're saying: I've been working with the broken Borough commission's office and see what we would do. Okay, so it sounds like there's no set timeline or date for this yet, and can you explain you said that you know you can't maintain the facility unless it's metered parking? Can you explain what that means? Does that mean because of the revenue that you get from the meter parking that allows you to pay for the maintenance, or can you just kind of explain why it can only maintain a facility if it's meter parking staff that maintains parking lots maintains active facilities that we have needed parking in? That's where we deploy our staff. So if this became a facility that has needed parking, we would deploy staff to go and make sure that people aren't blocking or dumping debris. If this is not that you know, then I guess, maybe it would fall back to sanitation or somebody else, but we would not be maintaining this if it's not one of our parking facilities. Now, I'm not sure if there's other mechanisms for this, but you know that's what we're seeing at this point. Yeah. First of all, I'm not I. Don't have authorization to speak to the press, so I don't even want to answer questions that are put to me from the press. Well, I'm a representative of the public as the press, so you can speak to me like a member of the public. Well, you already identified yourself as the press, so yeah I know, but like the press is basically like the public, it doesn't have to be a division between like who you can answer and who you can't. This is a public meeting. So all right, just wait. Ronda wait! That's a fair point! The press is the press and Kevin. You have to be if this is, if you're having this conversation for a article, that's one thing, but if you're quoting agency representatives for the article or, if you're, just asking for yourself, because you live on Meeker, that's one thing, but if you're saying you're from the Brooklyn paper and then you're planning on quoting people that you know I just want to be clear that that's not kosher. So no I'm not trying to do it. For my own personal reasons, I just don't see the reason why you know agency representative can't speak to me as a member of the press. That's not for me for not my decision and I'm not a I'm. Not you know, I, don't not high enough rank to I just know what I'm allowed to do and what I'm? Not so sorry I, don't want to take over okay. Thank you all right. Actually we have a press office. So if you wanted something up the press office, we could set that up too absolutely. But, as Wanda indicated, you know, okay, trying to be honest and open here. Okay, because we don't make statements to the press necessarily either as community board members, unless you know it goes through things, so I just want to you know just be clear and I also actually want to comment on something else that Mike said and I'm not. You know he doesn't deal with bike lanes. He deals with parking lots. You know. So in some cases the bike lanes are maintained by sanitation and in some cases D.O.T maintains bike lanes and in some cases, parks Department maintains bike lanes. So I just want to be clear on that. Okay, thank you, I will yeah. Okay next is Alex Rodager yeah hi thanks so much for the opportunity to speak. I'm a local resident that lives off Meeker and I thoroughly agree that underneath the Williamsburg bridge is a dirty depressing place, but I just wanted to make note that it is also a very vital parking lot, especially with street cleaning. I really have no idea where I'm gonna park in the near future and it may not look like an inspiring place, but it is really an essential amenity for the neighborhood and I really don't see in any way. How like short-term paid parking is going to benefit myself or anyone else in the community, and it does just feel the way this has been presented is that is we're getting kind of bulldozed with the idea that, because of the pandemic, I got dirty under there. So now they're going to take away our parking and charge for outside people to come for like four hours at a time and then leave and now I, don't know where I'm gonna find parking so anyway. Thank you very much. I appreciate the presentation. Thank you Alex! Well, sorry, I! Don't know if there's a response to that Lincoln wrestlers. Next, all right go ahead. Lincoln, I'm sorry, I'm biking! Of course you are okay, good yeah, okay, great! Well! Thank you, sorry about that. Thank you, Eric and will, and thank you dog for joining this conversation. I mean it sounds to me. The process was not great for how we got here, but if I'm hearing you all right, you're saying that you're listening carefully and gonna and care about the feedback that you're getting from community world one and community board members in this process, which we appreciate and I hope that you're hearing that short-term parking isn't meeting any of our community's priorities or needs and I. Think as Rhonda knows. Well, you know, there's been years of advocacy and planning and organization from the community around how we can make Meeker move and have bike lane space and have open space and really brighten up and enliven. This depressed area under the BQE and I feel like what hasn't been said. But what is but reading between the lines is that there's a budget crisis going on DOT, like everybody else, is trying to figure out how they can raise some revenue here and there and thinks that some short-term parking here would be beneficial. And for that reason, but it doesn't actually meet our community's needs and I think what Jerry said earlier in the meeting is spot on come back to us with a comprehensive proposal. When you have a plan for how we are going to make Meeker move and have an opportunity to evaluate this bike lane that will much more effectively meet our needs, then how parking does or does not complement? That is a conversation we should be having at that time, and so I do hope and I would like to just ask directly. Is this proposal on hold as a result of community opposition? How is DOT proceeding from here and thank you again, so I'm sorry is it the formal position of the community board that you're opposing the proposal? All right is that what he's saying I didn't understand the question wrestler yeah I mean how about this. If Community board, one were to officially oppose this proposal is D.O.T going to adhere to that recommendation. Rhonda Ronda I have a question. Yes, I believe we talking about comprehensive plan and I, I'm not quite sure what the comprehensive plan is going to entail. If that's going to entail the bike lane and the parking or I'm keep hearing I understand like parks and other amenities, which is that's, I'm not DOT, technically we're not going to be involved of this full or, like the huge I, mean the bigger plan. So when I mean let's be realistic here so from our position as DOT, when we're talking about future plan, we're talking about the bike lane and the parking am I correct from Dot's perspective, that's what we would be talking about, I, don't I think the thing that happened, that the point is that the community board comes back. We would take it, definitely an advisement. We would reassess what we're talking about. We take a look at what we're doing. That's what we're saying. So you know we're here, because we wanted to get out with and say. This is what we're looking at short-term parking doesn't work. Does long-term parking work, how the operations work? What are the hours operations at work? You know we again, it was the goal or desire was to work with you wasn't to say. Oh, this is all there is to it. You know- and this is how we would be able to help you. Yes, we were taking an advisement and I would see where we go with. This I would work with Keith and the Broedcast in his office. I, don't know what else we could say: okay, okay and Jimmy. Just to answer your question when we talk you, this is probably your first meeting on this with CB1 about this. As you've heard, we've had years of conversations about Meeker, and so, when you say comprehensive plan where what we're saying is, you know all the stuff that we've talked about in the visioning sessions and then maybe like this parking thing for like one small section, something like that, that's just it just to kind of answer your question and clarify: will who's Next Elizabeth Adams, okay, hi everyone? Can you hear me? Yes, Elizabeth? Are you representing? Yes? So thank you all for thanks, Eric and the committee for holding this meeting, and thank you DOT for being here. So our office has heard numerous requests for bike lanes open space, pedestrian space cleanups of under the BQE, and this is not a request that we have heard from community members under the year over the years. So you know I think it's very understandable that residents have a lot of concerns and have raised a lot of questions over. You know how this came to be how this was presented, why this was presented at this time at a place where it seemed like it was already decided. You know it's on behalf of the council member I think we have a lot of questions as well. As folks have said around the community. Visioning that's happened since 2015. There are a lot of requests and a lot of community proposals to look at and to look through for considering what would make sense for this space. You know I think, there's a certainly not no shortage of material and ideas to look through on dot's behalf as a place to start and the process here definitely kind of took us back a little bit just getting notified via email at the time of other of you know of everyone on this call so and I do also just want to echo and I think it's important to distinguish that this plan needs to be done separate from needs to be discussed separately from the cleaning of the space. You know our office has made requests for cleanups of the illegal dumping for a while and community members have made these requests for years, and that is something that our city has a responsibility to address. That is why, as Willa said, we have a department of sanitation that should not be, as you know, a goodie or something offered as to debate to move forward a plan. Then I do think it's important that we not kind of use extortionist methods to make decisions around parking when we have such urgent public space needs for our city and then I. The last thing that I want to just highlight is which I think Karen spoke to really well as well is I. Think what I have not quite seen here is is what needs really are being met. You know, capacity and resources are really tight during we are in a pandemic, and so I think it feels really striking to hear that this is where you know we're putting capacity and resources to when the needs around bike lanes when the needs around shifting our priorities to thinking about the future of our city that is rooted in open public space, accessible transit, other types of a public transit that reach our communities is so urgent. You know, and so we're tight on expendable resources to try something out or to try pilots, you know, and as Karen mentioned, you know, I think it's not even I, don't quite see how this would even bring in potential revenue for DOT. If department parking is isn't what meets the need over. There is isn't what fits into an assessment of a retail of restaurant of commercial usage, so I think from the council members perspective. We would like a better sense of what those metrics what those you know, what needs dctc is being met here and then I do also just want to shout out and appreciate. Jerry's call to make sure that we are not displacing people's belongings during cleanups. The council member has really made it a priority to make sure that we are not doing sweeps of people who are experiencing homelessness and so that it's important that we're talking about cleaning up our spaces and our communities in a way that does not displace people's homes and livelihoods, am I not much on the homeless kitchen. Who is that I just call a store? Bro, let's go ahead. You know during our cleanup just to prepare this site. You know we were dealing with the homeless and the encampments and they were very cooperative moving their stuff, but we've had we have a lot of experience dealing with homeless. We in our 20-minute parking facilities, municipal pocket cities throughout the flag, boroughs we've had numerous cases of homeless people. You know camping out in our lots and we involve homeless services. You know, and especially during the winter times when temperatures drop, you know below freezing. You know we reach out to homeless services, to get these people, and you know and offer them services to get out of the call so we're very sensitive to the needs of the homeless and again the people that were there. We asked them to move and they moved their stuff. So we could work was homeless services on site with you. When you did this removal move and they moved was the agency homeless services on site with you. When you did this removal, we asked them to move and they moved their balloons. Like you didn't work with you didn't it wasn't a joint agency thing where homeless services got with D.O.T and, like a community officer, went out with you guys when there's no cooperation with homeless services with the homeless, we involve homeless services. Okay, in this case, we didn't need to they moved on their own, got it okay. Thank you. Okay, I, so I'll entertain a few more comments from the public like I said: I am cutting and pasting the the chat as best I can. Just have a few more hands raised: okay, so just it's 8:17 now or 8:13 I, don't know, but I'll. Let's do three more public and then we'll move on. If that's, okay, all right, I think there's only two people that have their hands up still two more. Let's limit it to two and then we'll move on, I'm sorry I jumped over you will. What was the name? Hey? Can you all hear me? Hey? Oh I got you, okay, hey Willis! Thank you great thanks. So it's Katie and I run the north Brooklyn parks alliance and we work with a couple of transportation agencies. State DOT, running the under the K Bridge Park, which is the space under the BQE on the Newtown Creek under the Kosciuszko Bridge, which we maintain alongside the state as well as city D.O.T, as a public plaza partner, and so you know we do have experience with transportation and some of the ideas coming out of D.O.T have been incredibly innovative and really, you know big ideas in terms of revenue generation in terms of transforming open streets into public spaces. In terms of you know, transforming spaces under elevated expressways, like the L Space guidelines that came down so I. Think. Another thing that we're experiencing is disappointment that some of the inspiring movements coming out of D.O.T itself aren't necessarily representative of the proposal and that you know the elements that that are kind of a perfect opportunity at this moment, not only as the community and the city is rethinking the BQE entirely, but we're also rethinking how to approach open space and public space, and you know it seems like an optimal moment to really push the mark on this. The space you know both in what you've been researching and what our community has been working with DOT on those ideas. So I guess I'm curious. You know the folks either from open streets or public plazas. You know they should be part of this conversation as well, because some of the elements there are some of the elements that the community has talked about, and you know the maker moves or some other workshops, and so not only the features of under of the space itself, but also opportunities for revenue generation. So I think, when you ask for proposals of how something could happen, I would say: well, let's look at some case studies of what's already happening, either with DOT or with other agencies, and the last thing that I'll say is you know. The pandemic has obviously presented some major fiscal challenges, but it's also presented the extreme need that our community and communities throughout the country in that are, you know, densely populated the need for open space, and so I think that in our community, where there isn't that much open space, the few opportunities that we have to create space for the community to use beyond just revenue generation, but actually for recreation transportation. You know community gathering, culture, social distancing. You know that those are all elements that we had hoped to see here now. So I think you know also what you're hearing is just a general disappointment from some of the things that the movements that have been coming from the city that are really forward thinking and innovative. That's a really great comment. Katie! Thank you. Eric. If I may ask questions, I'm sorry who's that Carlos go ahead. I mean Jeremy, so so I, I'm hearing the open space, which is that's great and definitely I, believe I'm believing in open space and all the initiative, and so it just I mean from the community extent viewpoint I mean: do you guys need the whole area to be open space or you're? Still thinking about parking on this area, like you planning to eliminate all the parking, it's just there to be a kind of open space, I mean with a lot of initiatives or you're gonna still maintain some parking well, I. Think there's been a lot of different voices, calling some calling for no parking, but I. Think parking is gonna, remain in one form or another, at least for the next generation, until we figure out a better way to get around. So, yes, the parking I think not speaking for anyone or everyone, but you know I think just realistically parking is gonna have to stay, but maybe not for the entire stretch. You know, we've seen a lot of different plans that you know take it out of some places, create full play areas or just open space areas or whatever, but I mean. This is why we've been talking about this for five years and more because you know we keep coming back to the idea that we need, like a concept, comprehensive plan that, like explains how we can do the things that the community wants in a balance. So you know I, don't know what else to say to that: I don't know if Karen, if you have a better way to put it, I'm going to reach out to the Plaza folks, I'm going to reach out to the bike. Folks, I'm going to reach out to see how we can put together, something which is more comprehensive and a proposal that you folks could take a look at you know. As I said, we hear what you're saying and I'm a New Yorker we're all New Yorkers we understand. So what we will do. Is we hear what you're trying to say and I said we'll, take it all to advice, but I'm not gonna make promises one way or the other, but I hear what you're saying and you're looking for different uses. You don't want parking from one end to the other. You want other amenities. We can talk to these folks see what they have, what other ideas they have because there may be more. You know when we first initially proposed this. We said well, we'll put this thing in we'll see. If it works, does it just supply any benefit of utility to the neighborhood, but it seems as though you know folks is feeling as well you're just going to do this and that's it. So you know I have to talk to other folks and ramp it up and see where we go. You know I'm trying to be fair. Okay, thank you. Michael can I just say a point. Don't think it's fine go ahead. Sir go ahead. Yeah I just want to retract what I decided in the beginning of before I heard. All the comments and I do feel that we should go back to the drawing board and again when this plan is out here, we should look at all the avenues hearing from all the parties, Community board and all the neighbors and the businesses- and you know see what's best, you know, as was mentioned for all the comments you know so I do think that we should, you know, make your new, maybe a new character and discuss again ideas hear from everybody. You know. Thank you. Simon will the last speaker from the public yeah Thomas, Hoshi, okay, Thomas! Are you on hi there? Can you hear me? I can great so my name is Thomas. Huji I am one of the co-chairs of the transportation alternatives. North Brooklyn activist committee and I appreciate everyone's time, so I'm just gonna. Keep this brief. Two points it seems like from my perspective, it seems like D.O.T is basically trying to upgrade the parking facility so that they can charge for it and that what that's going to create is a kind of a disincentive for D.O.T to ever change the space from parking to anything else. Once you're generating revenue from the spots- okay, well, let me finish and then you can respond once you attach a pricing mechanism to it and you have revenue you're, not gonna, lose that revenue. On top of that, once you attach a pricing mechanism to the spots, what it's gonna do is gonna create more turnover for the spots right now. The local neighborhood kind of just uses them all. The spots is long-term parking, there's some turnover once it's priced you're, going to see more of that which is actually just going to induce more car trips to the neighborhood, which is actually what we need less of. First of all, it's obviously an environmental justice community because of all the pollution, the history of pollution, the BQE, obviously not to mention the long-term greenhouse gas emissions that you'd be inducing and honestly, the more car trips, the less safe that pedestrians and vice lists are going to be and transit riders. Obviously we don't really feel that DOT has a good track record of building actually protected bike lanes. So, even if you are promising one here by inducing more car trips, you're going to create more conflict points which will lead to more injuries and hopefully not fatalities- and we just don't trust that the comprehensive plan will be done in good faith. So that's all I have to say thanks glad we got somebody from Ta in here I. You know, I, think that's a point. That's been brought up so I. Don't think we need to go back to unless you feel strongly Michael that you want to respond to that. But I think you've addressed that already I think I have okay, okay, so I'm going to close this out. I want to thank D.O.T for coming and making this presentation Michael we'll circle back at some point, and you know there's a lot of things going on in the city right now and you know, but we really have been looking to get something done under the BQE for more than five years for a long time, and you know we really not need to get the ball rolling on something going forward, because you know everything takes 10 to 15 years to you know from plan to implementation, and you know if we've spent the last five just talking. You know the next 10 really need to be about getting something something finalized by you know like 20 30 or something like that like we really need to start seeing something happen under that BQE that everybody can enjoy benefit from, and you know just be useful for the whole for the whole neighborhood of north Brooklyn. So I'll leave it at that. If there are no other community member Community, Board Committee member comments, I'll close it out and we'll move on to the base license and what I'll do Eric I'll be reaching out to you and Rhonda and Keith, and opening up the dialogue to see where we go from here. Okay, I appreciate that Michael. Thank you! Yes, okay! Anybody else! Thank you all right! Thank you all right, good night. Okay, all right so and thank you public for sitting through that I know. I hope, you'll, take this back to people that couldn't be on the couldn't be on the meeting, because I know there is a lot of you know. Concern about this in the neighborhood and I think I've done a fairly decent job of cutting and pasting the chat into into a document. So hopefully we can actually because we don't always we're not always able to pull this back up. Yes, just as an aside, if this was a pre-coveted meeting, it would have been standing room only oh, no I totally you know, and for them to try to sneak something in on the cover of Covid-19. You know and like I said- and you know the email you received from Ronda was: this is what we're doing live with it. You know it's just it's unfortunate right, I think you're, right Jerry, you know it's yeah and the whole idea that they're, you know graciously having this dialogue with us. If you know, if we hadn't pushed it to them, we would have been looking at parking spots next week. Absolutely I walked at that corridor multiple times a week and they are very far along, like those towers are in like there's a lot of work, that's been done in there and it probably started even before we got that email. So all right, well, we'll hold them to coming back, and you know not doing this parking thing or whatever I. You know. I probably should have done this, while I had them in the room. But does anybody want to entertain a motion on approval of this I? Don't even I'm not even sure Ronda you're, still there, okay, I am all right. I see you, you know, I think the public is going to want to see action from us. One way or another, so you know I, don't I'm not going to make the motion? Obviously, but if anybody wants to entertain a motion on this item now remember this does not require DOT pro approval, but they are now in good faith. You know looking for dialogue with us on this issue, so I'll just leave it at that and if there is nothing we'll move on to the next site, I think you're being over ambitious. When you put the word good faith in, perhaps the motion of the committee to vehemently oppose might be in order. I'd be happy to get it on the record and make a motion that we don't support the current plan. Okay, you want to state that a motion to even though they don't need our people, a motion to deny the plan as presented to the community board, how about a post yeah add to that they should, as Jerry said, come back with a comprehensive plan or package close. The plan is presented and return to board with comprehensive planning. I'll say if I may comprehensive plan based on previous discussion on usage, fair everybody good with that. Okay and well, if you're good with it, I'm just gonna, make that one motion: Karen: okay, fine, who was the second on that William Vega. Okay, take a second okay! Let's do, let's do roll call? Well, okay, let's do roll call so Simon, wiser you, there still Simon wiser going once she's still here. Did everybody leave going on come on people stay to the end, William Clagspot? Yes, I'm for the motion. I agree. Thank you, sir I didn't hear. Aaron I just wanted to point that out here. I actually got booted off, but okay, sorry, okay, that so that you're in favor of the motion. Aaron did I hear that right, correct in favor of the motion to oppose okay, Willis. Obviously, okay, Karen, let's see is Kevin Costa still on here there he is I. Am here? Okay, yes, okay, Brian Vega! Yes, okay! Sorry is Abe. Still here deeply vivids. Yes, there he is Abe. What's your vote? Ultimately, I'm a feeling? Yes, okay, thank you did I miss anybody. Gina did I get you missed me! I'm sorry! Yes, okay! Yes, sorry! Thank you all right! Okay, I! Think! That's everyone! Anyone opposed any anyone opposed going once only twice anyone abstain, okay motion carries okay, thank you. That closes this item and okay. So thank you. So we will now move on to the base. Renewal license is Marie. You had said that they wanted to come and present did they said that they wanted to come and share their new programs. Okay, are they related, but they're doing you know to help the public and they did not show or answer they did not. Okay, we don't have any complaints about petroleum, no after 50,000 years of being here. Okay, so I'm sorry, I didn't want to do that. Okay, so we need a motion on the base renewal, Karen oops! Oh wait! Hang on one! Second, sorry: where are you there? You go okay, so that's motion to approve Karen can do I have a second Simon seconds all right. Well, let's try to do all in favor, okay, this will be easier and anyone opposed going once up opposition twice: okay, abstentions, going once going twice: okay, unanimous! Thank you all that was nice and easy. Okay. So now we have old business and will you send me an email saying you wanted to talk about a bunch of stuff, so I will recognize you does anyone else have old business before I go to? Will I'm sorry just it's just getting late and you know we have to not see who's president, so yeah, okay, all right, go ahead! Well, I. Don't want to have necessarily a super long conversation, but you know the open streets initiative. There's been significant conversation online on Facebook about it. There's been started by the group. That's been maintaining a lot of the open streets in the neighborhood to continue it and expand it, and there are very there's just a lot of really intense opinions on both sides and I. Think you know the main issue is that we've? Never you know with Covid-19 it's just like. We never really had a thorough discussion with DOT about the program and some of the streets were suggested by the council members and some were suggested by individuals or organizations you know, and so there's you know, people are being impacted for good and for bad on both sides, and it just seems like there needs to be a really as much as is possible, a better engagement process and opportunity for people to talk about the pros and cons. I personally feel like the streets that were chosen like. If we're going to be talking about open streets, we should have a bigger conversation and not just looking at the ones that were chosen in the middle of a pandemic, a rest decision in my take and that we have you know big conversation about the value of it and what places could benefit from it and what places are not benefiting as much so I just want to raise it because there's been I mean some of these threads on Facebook are just hundreds of comments back and forth, and that's it would be. You know insane for the transportation committee to not acknowledge this major issue. That's happening on our streets right, thank you for that will, and you know, maybe we'll god I hate to do it. On this platform, though, because exactly what you said there's like so many people that went and like Jerry said if this was like a in-person meeting, we would be you know: we'd have people out the door so, but you know people can write in their kind. You know it doesn't have to be the end of the conversation. So let's make it an agenda point for the next transportation committee meeting and Guy Karen. We should have D.O.T come back to us sure regarding just what their analysis of how well the open streets did it impact. As far as you know and transportation, any streets got clogged. What were the issues because, currently right now as it stands like the NYPD, is not putting up, I mean there's issues currently with open spaces, so I think those are some of the things that we need to address but like on those groups, they there was. A lot of you know concern about removal of parking which I don't know. If that proposal, I didn't get to read the petition, but you know I think there's a little bit of misconceptions too. Going back and forth. You know on Facebook, so I think first step is: let's get dotn? What's the status you know, can we do better Karen? Can you just clear I kind of lost you when I was type? No, it's my bed. What were you saying about NYPD and no? They there was times where they were removing. You know the horses and you know not putting them back and just you know it. It's not running. You know some of the streets are running better than others. So I just feel like those streets that had a community partner, you know, seemed to work better than the ones that were relying on NYPD to come and put up the horses and remove them. So I'm just saying I think I, don't think NYPD had a lot of clear guidance either I mean I think they were just like here deal with this on top of everything else you're dealing with, so you know it. First and foremost, I would like to get an update from DOT on the open space program. Currently, the other thing is, as here you know say, for instance, I know Gina's on the call, but you know we're asking for you know one street to be. You know, shut down as well. So right now, there's no mechanisms. You know the ot is like. Oh no, that's not this permit! You know. That's not. You know, that's totally separate, that's the mayor's office, so we don't even know what that process would be and if there's a mechanism right now so getting D.O.T, maybe and somebody a representative from you know, the mayor's office I think would be helpful too yeah. Okay, I'm just throwing it out there, no I think the mayor's office needs to come because, like this came from the mayor's office, this didn't start with D.O.T. So exactly go ahead. William it is 100 mayor's decisions. These are political decisions. They're not well thought out. I mean we're struggling with small business services, with the outdoors sitting for restaurants. Now for stores, open stores, a lot of things are planned now. Last thing they deal with. Is enforcement and everybody's passing the book as a community board members in a community we have to have a thoughtful conversation. Long term like Willis, said right now, it's just find any open space available. Also again, I have my reservations. We got into the meters, that's also the city, starting a lot of initiatives are going to be really focused on revenue. You know, so we have to be be very. How can I say this? We have to be very clinical, you know and I do feel they were saying. If you don't get the meters, you can't get the streak, that's really that's sanitation's job period, yeah, that's right! So I think we have to very clinical know about who, when we talk to them, where is this revenue going they're going to generate? Is it going to go back to community or to the city general park and the other things is what what can they do for us? We have to get all these other partners. I know EDC and as well as my office, with the division of neighborhood development has already contracts about open space. I'm waiting to see what they're talking I always get very suspicious when Edc has their hands personal I think everyone's suspicious. When EDC gets involved, yeah there's a lot of players nobody's gonna. Do nothing not just let's be real. This is because it's some money to be made sure. Okay and we have to be conscious. It's okay, but we as a community got to get a piece of the pie. That's what I always get objected. You know whatever comes with you know, building these big projects. They make a lot of promises. When all is said and done, we get shafted. So we have to be. You know very clinical, very on top of it and and I appreciate, Jamie I, don't know if he's still there his input, everybody's, we're all aligned. You know. What's the old thing show us the money? Okay, I, just again, you know it's. What are the benefits and I know some streets worked really well and others not so much so I'm hesitant and I would definitely like. Will you know we need a dialogue, a real, comprehensive dialogue regarding this. Okay, all right so we'll put that we'll put that on next month's agenda and we'll take it up in a more serious way and we'll see should get NYPD in here too. To talk about it too. Well, did you want to say something yeah? Well, real, quick, no Hidalgo's on the line or he's good in the chat with his hand ray so, okay go ahead. If he can speak, though yeah, please go ahead. Noel you there hi I! Think you finally unmuted me. Can you hear me yeah? We got you okay, great hi, for those of you who don't know me. My name is Noel or Noelle. I'm a gemini I have two names: I'm a nearly 20 20-year resident of Greenpoint I live at drinks and monitor Mcgoldrick Park, I'm one of about a hundred different volunteers that have been helping maintain a few segments of the open streets. Karen I absolutely agree with what Karen said. There have been some really successful implementations of the open street here in north Brooklyn, we formed a community coalition that essentially kind of stepped in when the when we didn't see a full partnership from the NYPD. I would like to point out that there are two precincts that this involves: the 90th and 9-4. We essentially stepped in to help bridge a relationship between these streets and the precincts and the community businesses and the residents. We put out a petition this past week, essentially asking for a formal conversation with the DOT and in that petition, we're also including a number of street treatments temporary street treatments that would help ensure that the open spaces and the open streets that we have now would be essentially be a stop gap to whatever that formal conversation of whatever formal treatment and permanent treatment would look like we're. Looking for the open streets program to continue, the mayor is, has sent out messages saying that they are going to be looking at making the open streets permanent, and so we want to ensure that there is proper community dialogue with the community board, with businesses with residents and respective agencies, to ensure that the open streets program moves forward in an inclusive way. There's been a lot of misconceptions, but there's been a lot of misstatements on the north Brooklyn civic, Crowdsourcing, Facebook Group. I'm happy to address any of those specific needs, but I want to make sure that this particular committee knows that the coalition is actively working with the DOT and actively working with both precincts to address any of the security and safety and accessibility needs, we're also maintaining the different barriers. So we've been making sure that the barriers go up and down on Drigs and Russell in regards to Barry Street, it's been a different story. We've had some problems that, because the two precincts weren't taking them down, essentially the community has interpreted that the barriers stay up. 24 7, so we've been in a situation that the barriers have essentially been staying up on. Berry Street, the precinct on the night and the ninth floor has gone through a few times and they've started to remove the barriers which creates an inconsistency, because the community still believes that the Berry Street is an open street 24 7. So we would love to figure out how to ensure that the open street implementation, as it is right now, is safe for all users and would love to have the formal conversation on how to make the open street permanent. So you tell us when and where we need to show up and we will be there. Okay, thank you. Nolan again, you know I've seen all that you've done with trying to maintain those barriers and stuff like that. It's a real yeoman's job and you guys have done a great job and I love anything that bridges. You know NYPD with the community to get everybody talking and getting everybody on the right page, especially you know like we were saying, but for Dia NYPD was just like left in the dark like here deal with this thing, so for you and your you guys to go out and like make that bridge, I think it's really important, especially in these times so stay tuned. No, it will be on the agenda for the next meeting. I don't know if we can unpack everything that needs to be talked about from your perspective, but we'll start there and hopefully maybe we can get some other meeting together that meets everybody's concerns. So well was there anyone else that wanted to talk on this? No okay! Well, we'll leave it to no, because I think he represents a big voice in the community and we'll for the moment we'll. Let him speak speak for that and all right we did have an email anybody else for old business, doing what's going twice. Okay, we did have a request that came in via email this afternoon. I'm not sure if that person is still in the room. Let me just find it sorry bear with me sorry Aaron! So Kelly are you still in the room in the chat? Yes, oh great, okay! Good! Thank you for hanging out through all that. Let me just get your name typed in here. Okay, go ahead! Sure well, I sit on the board at 184 Kent, which is between north third and north fourth street. As you know, our building takes up the entire block between north third and north fourth streets and the entire south side of our building runs alongside North third street, of which a stretch is between River street and the water. It's a dead end, I'm sure most of you are familiar with that area, as that is also adjacent to the River street, lots that are up for rezoning now owned by two trees. So, on that stretch of street one side is our building and the other side is that lot? The lots that two trees just purchased, that street is a little bit unique in that it's a short stretch of street between river and the dead end. There are 11 to 12 parking spots on the south side street, depending on the sizes of the cars that are parked there and that side of the street is unregulated parking, no street cleaning regulations, no parking regulations whatsoever and that side of the street is used for long-term parking. We've actually had vehicles that NYPD has had to remove because they were being used as storage facilities had flat. Fires were sitting there for months at a time and then on the north side of the street is a no standing any time zone that is also very unregulated and because of the nature of the stretch of street being that it's a dead end very close to the water and Un Invisible because of the empty lot and the buildings that are under construction. It's become over many years, I'm talking five to ten years, a hangout spot for people to come and loiter to do. Drugs to litter, to you know, just really disrupt quality of life loud music partying. A couple weeks ago, we actually had an entire video shoot that was going on with cars lined up horizontally on the sidewalk film crew. Music I wish that I could share. I actually have several photographs and videos of what goes on that stretch of street, but the reason that I wanted to speak with you tonight and I've spoken with Eric about this. I've spoken with Ben solitaire in Levin's office, I'm very close in touch with the 94th precinct. They did make that stretch of street an actual open street. As part of this program that you all were just discussing, they provided us with those wooden horses, but I'm sure, as you've seen around the neighborhood as soon as someone knocks one of those over or runs it over they're, pretty much unusable and that's what's happened to ours. They're left, we've just have wood shatters and they've not been replaced, and we still have this issue of quality of life and safety. Frankly, on that stretch of street, which is a point of direct access to the water for pedestrians, so you know it's a combination of quality of life of the residents of my building, along with all the people that enjoy the waterfront, which, as we know, is a lot of people at this time, and so I just wanted to hear your thoughts on what may be a better solution than hoping that NYPD will help us enforce parking, which doesn't really seem to be working as a solution right now. Okay, thank you and Aaron. Sorry I didn't recognize your name, but yes, we have spoken before and I think in the conversation that we had with Ben that you know we felt like you had done all your due diligence you'd reached out to all the agencies that needed to be spoken with and I think you'd organized your neighbors to to deal with it. You know, I, don't know it's I, it's a really frustrating thing, because I know it's hard to get enforcement over there and it's. It needs to be like a constant enforcement because of the way the crime issues that the way it's being used. I, you know, I, don't know I'm still kind of stuck on ideas. Maybe thought was if we could get and I think it would be from D.O.T approval to make both sides of the street no standing and have no cars on that street at all that, perhaps we could, at our own cost, install some planter blockage to actually block the street from vehicles similar to what two troops did at Grand, Ferry Park now I, never I I've been trying to investigate how they got that done, because what they essentially did is there's a similar. There was a similar issue in the no standing parking area directly in front of Grand Ferry park in between we're right at the entrance of Domino Park near Grand, and there were people loitering there. You know sketchy things going on and basically 90th suggested two trees that they purchase, something to block that area from cars, and you you'll see that there are giant planters there now I, don't know how they did that. But you know I know that our board on our building would be willing to do something similar, but we obviously can't overstep our boundaries and block a public street without permission to do so. Any anybody have wanna weigh in on this yeah, maybe I kind of make the cleaning like your asp once a week, cleaning or two weeks. You know I used to clean up the streets. You know I'm actually sorry to interrupt. William I actually have requested directly department of Sanitation for street cleaning regulations to be added to the side of the street, where there is parking right now, and they argue that the street cleaning machine can not turn around in the street, because it's a dead end and there's I mean the cars like I said parked there for such a long time. There's so much debris and garbage that's built up under those vehicles. So I don't know. If that's true that the machine can't get down there, I don't know what the deal is. With that wait, I mean there's dead, end streets. All over Manhattan, like I, alternate side. I was on a job the other day. They had it so I. You know, I mean what about an email from them. That explicitly says that that's crazy about the Plaza program, Karen yeah, can that street maybe be a plaza and then you're building partners to maintain it to keep it clean. That would be fantastic. How do we do that? You go through the DOT site, you put in a request and I don't have it offhand, but let me find it I'll send it to you, okay and then yeah, but it needs a project partner, but I think that's already baked in the cake, because your building is so organized. My only concern with that would be in the overnight hours. Yes, you would be able to get like planters and things like that in there to block the traffic, but but that people would still be able to still be in there. I mean but I mean that's New, York City right I mean it's like unless the cops are in there, you're kind of stuck, but at least it would like cut down on the cars with sound systems coming in and like turning it into. You know a disco, you know the other thing is and I know nobody likes speed, humps or whatever, but if they're I think we, you said that they were racing on River street for a while. Yes, right so I mean speed, bumps I know that worked on I can't believe I can't think of the name of it, but the street it's the first street in Queens we're next to the cemetery that stretch what the hell is, the name of that street Karen. You know that street like when you first get off the bridge. It's the first right, the Green Point Avenue bridge. It's the first rate you make whatever that street is. It's revealed a couple years ago they had a huge problem. I think somebody actually crashed and died in a racing accident over there and I'm on that street all the time and they put in speed and there's tons of industrial traffic there, but they did it in a smart way to where the trucks didn't have to bounce over it. They made like these cutouts, so the trucks could line up. It's actually really smart engineering, so I mean I know we don't like speed bumps in CB1, but I mean that might be I mean if it's a problem that NYPD just can not enforce I mean this is one of those situations where we really need to look at it to see. If that's gonna, you know cut that, just anything to make it undesirable. Sorry excuse me for them not to use it, but in the meantime yeah we could talk about the Plaza program. Erin I'll dig it up, but I'll send you the link, it's on the DOT website, but I'll, okay, great, okay, good and then I think that would I think that would be a plaza. Although again I don't know, does your building have security. Yeah I was going to add that on we actually, I'm not sure if you're also familiar with the shore public walkway, that is directly in front of the gym of our building. It's a covered walkway between north third and north fourth streets right along the water attached to our building. So we've had some safety issues in that area as well, which is a separate area, because it's something that we are in charge of that was an agreement that was made with the city when the building was renovated. That's neither here nor there, but we do have security on staff in the summer every day we we'd scale it back in the colder months, but yeah to your point, you know if there's a plaza and people are rowdy, we can certainly have security enforcing things there much easier than cars for sure, and if there's no alternate side parking, there's no regs there, then it's even easier. You know, because you're not removing parking technically, if there's no regulation there, so yeah definitely look into that. I think that might be a benefit. Okay, Aaron! You have a lot under your space so to your building. Right am I wrong on that is there? Do you have a garage? There is yes, okay, all right! So it's not like people that live in your building are like doing car storage on that spot. They have a place to go if no I, don't yeah and I. Actually part of my you know every all the work that I've done was just kind of finding out if those cars were people who live in the building and they're, not so I think, like I, said before they're kind of being used as long-term storage by people in the community. Who are, you know, happy to find a place to park that has no rules, yeah sure, okay, all right! Well, you know you and I have talked it's on the record now it'll be in the report, but but we'll circle back and we'll just keep an eye on it and see what we can do and you know we'll keep Ben included because he's been helpful in this as well and we'll just absolutely thank you all so much yeah thanks Erin anybody else with new business going once going twice all right. Okay, thank you all for sticking it out. I'm just gonna try to keep this chat open for a minute to copy any last comments. Anybody else have anything hey, Aaron. Sorry I was having a hard time. Kevin had asked early about if the recording is gonna be available to the public. I know, I, don't know where we ended up on that with other communities. I, don't Marie. Do you know if we're able to archive these yet or what's going on I? Don't I forget yeah they, their webex is no longer providing the link right. So we have to see if we can do YouTube on them right. Okay, so that's what we're looking at right now! Okay, thank you chat. Okay, good sorry, just bear with me, while I save this, and then we can all obsess about the vote. Count. Okay motion to adjourn, Karen, William, okay, thanks everybody, I, don't know when the next meeting is I'll. Let you know and we'll see you all on Tuesday, okay, goodbye! Yes, we are putting the minutes. All of the meetings are going up. The committee meetings, the board meetings they're all going up on YouTube. We started doing that already: it's not something we're looking at we're doing it already. I'm sorry, Jerry I can barely hear you. I'm sorry I had my microphone up. We are putting the meetings up on YouTube the board meetings and the committee meetings. It's not something we're looking into we've started doing it already. We will continue to do it. Okay, great. Is there a way to put like a link to those on the website? Do you know, because Maria are you getting the link up on the website? Were you able to do that not yet okay, all right, but but they can find it if they I guess if they, google, CB1, yes, okay, all right great I, don't know if Kevin's still in the chat but I'll make sure that he gets that message and if there's nothing else. Thank you for enduring two and a half hours. Thank you to the committee. Have a good night, all right, good night, guys good night, you.",
            "summary": "We believe that this proposed parking facility is now needed and will add to the positive, ongoing changes to the neighboring communities of Williamsburg and green.\nWe, try to regulate the parking facility on the BQE, as Carlos mentioned earlier, through mirror parking for this area, and that will help us to promote turnover and reduce abandon of vehicles, reduce vagrancy, reduce illegal dumping, Schedule, cleaning of the fields provide more parking for area they optimize parking design, as well as provide spaces for persons with disabilities.\nWe have three phases: next, please so we're looking at phase one at this point in time, folks phase one we are focusing as Mike mentioned right now we are working in phase one.\nIf I know that some people went to the side this morning or yesterday, and they looked at the location, That's technically phase, one as Michael mentioned, That's what we are focusing right: now, The project benefits, so.\nParking will be available, but the mere regulation prevent long-term storage of vehicles, so the competing as we're all seeing now, with the advent of more restaurants on the curb the demand for the curb is continuing to grow, and you know this is another thing that we feel providing additional parking amenity, but a complete parking.\nWhat are the hours of operation that makes sense for the community board in the neighborhood and then the overnight parking would be for free, So folks that come in after a set of time, they can leave the vehicle overnight, get up the next day and go to work.\nLane, so, Basically I mean regulating making this parking regulate the area that is going to prepare the way for a lot of amenities on the future in the near future.\nParking is working with other DOT divisions to ensure that those future bike lanes and other amenities can be accommodated.\nDuties are also working on the design of bike lane and plans to return in the spring, with the plans which reflect previous workshops and community conversation.\nActually we showing what we did in Gowanus parking field, which is technically that is very similar to maker under this expressway before Gowanus, I'm, going to give you like a quick background of Gowanus is located under the third avenue on the BQE.\nI mean that they came back, the community board, they came back, they said guys come continue and we need to regulate the whole area there.\nWe, will have almost from six five two, That's almost 13 bays is going to be regulated by the end of this year and the bay is from one Cross street, as Jamie said, to another, not a parking stall, but from one Cross street to the other.\nYou know we have meetings with D.O.T and with some groups going as far back as I think 2015, and maybe even before that we had a formal presentation in September of 2017 about general improvements to Meeker Avenue and.\nDon't really remember, seeing an emphasis on any kind of you know, parking proposal or anything like that.\nThere was a lot of animated concern that the city was going to favor parking and car culture over things that we've been asking for sorry, My dog been asking for you know a long time and even in the schematics from the September presentation.\nThere's, you know kind of table set up makeshift parking, space, not part, not park space, but like recreation area type things, and when we were talking about the K Bridge completion, and this came up both on its own but also as we discussed the egress and entrance to the new Cambridge Bike lanes and the problems with the connector up.\nAnd I know that you did that as like a visioning thing for people to get people to talk in the breakouts, And I understand that, but, You, know, repainted and made safer and Et cetera, and then that conversation came out of that.\nYou know where, in the community's mind, You know we understand that the the bureaucracy grinds slowly, but I think that the general feeling was that we were going to see.\nI know, there's a lot of other residents that do rely on the parking for alternate side days to get in there.\nIt's kind of like a thing that we've had since, and you know if anybody on the committee got a chance to read: Jerry's email today.\nYou know when Robert Moses like toured the BQE through through the neighborhood, a lot of the people that lived through that.\nFirst, okay, the advent of the immediate parking is, what's also going to precipitate return, a constant cleaning and maintain the site, but also it creates the canvas, as I said earlier, for the bike, lane.\nApologies for that, okay and maybe earlier workshops or things, but we are willing to work with you folks on how this would best serve you all right.\nDo we need metered parking which is going to really hinder the community.\nOkay, If the second area you want to do a park or something different, then that's what you guys would do, but we were looking at the first area to see how it works.\nYou know a mechanism and also without the parking and the regulation, people.\nAlso in regards to the Asp, as Mike mentioned, it's gonna come and with our proposal we will have our meter regulation, which is that's actually going to benefit the people who wants to park there for a long, time.\nYou know: that's what we're hoping to do, because does anybody want to park right across the street.\nWe want to clean that, but we also want it as a public space for pedestrians for cyclists and a balance to have also, You know: parking.\nYou, know bike lanes in open space you're going to take the infrastructure.\nAnd I and they get it for a lot of other folks and better that they've been riding through a bike lane through this neighborhood, then on the side street of people desperately getting on the BQE.\nAnd, then all of a sudden you have to like rip this up to put in you know like bike lanes or other kind of like things that the community's been asking.\nWhen it's going to happen, you know I can't say when it will or not, especially when we receive an email, basically saying that you don't need community board approval and you're going to do it.\nWe're trying to work with you all right, William, Willis, Sorry, Wills, I, Just I, want to kind of echo.\nThis work was done led by the community in conjunction with D.O.T party and better utilization of the space and, frankly, The fact that I don't understand the relationship as to why this is Dot's responsibility and not sanitation's responsibility to clean up the trash.\nIf you really say that you're here to work with us, as Jerry said, you need to come back with a full plan that addresses pedestrian, safety, bicycle access, use of public space, etc.\nWe felt that, and we know for a fact that the additional parking would take the demand for the remainder of the network, the local streets and so forth.\nYes, people want free[ _ _], but they still they're going to get all controlled they're going to have to be moving around also, If other folks come into your neighborhood they're parked on your streets.\nI, wasn't part of community board, but it was felt very strongly by cyclists on the people that drive cars, the people on the businesses, the business improvement, district and Karen's industrial providers that nobody was listening to and DOT just went ahead and did what they wanted.\nBut again, If this is the beginning of this, you know this wonderful, area, Let's see the full package come back to us when you have a full package to share with us, not just a piecemeal address to a situation that sanitation was addressing a lot of those sanitation issues until their hands were tied by a homeless, services.\nI mean again, Let's see the full package where's everything that was discussed in those charrettes that you referenced and all of these good things that were going to happen and the bike lanes been so long and coming.\nYou know everything moves everything winds up taking longer than we expect, but, like I said, My understanding is that bikes was going to come back to the community board representation.\nI, don't know that my understanding is we're going to take into consideration any position that the community board puts forth to us at this point.\nYou know it's like you're charging people to park in the most undesirable spot.\nWe said: well, You know if we did go in there and we provided a needed parking facility for at least three blocks to see how it works.\nIt's really important a huge disappointment, I think from the community as a whole that this is what D.O.T is in the middle of doing right: now, You, know, there's been community visioning on this space.\nYou know you look at all the homes that were turned on to build it in the first place and at a pivotal time in this, where this community has said we're starting to think about and talk about what the space can be going forward into the future, whether it be parks or basketball courts, whether it can hold storm water, green infrastructure, parks, you know, Whatever.\nYou know it was delayed because of Covid-19 and because of everything that all of our community has been through, and now we're being essentially told is that we're gonna pay now for the privilege of having these massive 10 massive parking fields to cut our community into it's totally unacceptable.\nYou. Know on the you know, DOT should be able to clean and maintain bike infrastructure that it puts in regardless of whether or not they're charging people who live here to park.\nYou know free of the type of dumping that happens under the BQE if nobody's paying a park.\nThat's important for this community to know, because we expect those bike lanes to be put under the BQE like they were promised.\nYou know he's venting frustration that I think a lot of people have about the way that this was rolled.\nWe, wanted to hear what people's ideas were, whatever they were, but at this point, If you wanted to put in a park or basketball courts or open space or something that doesn't involve D.O.T infrastructure, there would have to be a comprehensive proposal on who is going to pay for that and who's going to maintain it, because we're certainly not in the business of maintaining those things.\nAs far as you know, in whatever the community wants, is basically going to need funding and whether that funding comes from, you know, state, the city or parks.\nJust you know, I, want to point out, It, says: okay, The regs would be from long term from meeker between metropolitan to union, so long-term parking from 7 A.M to 7:00 to 10 pm at a dollar fifty per hour 15 hour, limit.\nJust, want to you, know, point that out from 7:00 a.m, to 10 p.m, which is maximum four hours, which that's not even retail, Over there, so I'm, just like, and.\nOkay, So it sounds like there's no set timeline or date for this yet, And can you explain you said that you know you can't maintain the facility unless it's metered, parking.\nIf this became a facility that has needed parking, we would deploy staff to go and make sure that people aren't blocking or dumping debris.\nThis is not that you know, then I guess, Maybe it would fall back to sanitation or somebody else, but we would not be maintaining this if it's not one of our parking, facilities.\nAs community board members, unless you know it goes through things, so I just want to.\nI thoroughly agree that underneath the Williamsburg bridge is a dirty depressing place, but I just wanted to make note that it is also a very vital parking lot, especially with street cleaning.\nHow like short-term paid parking is going to benefit myself or anyone else in the community, and it does just feel the way this has been presented.\nNow they're going to take away our parking and charge for outside people to come for like four hours at a time and then leave.\nThe process was not great for how we got here, but if I'm hearing you all right, you're saying that you're listening carefully and gonna and care about the feedback that you're getting from community world one and community board members in this process, which we appreciate and I hope that you're hearing that short-term parking isn't meeting any of our community's priorities or needs and I.\nWell, You know, there's been years of advocacy and planning and organization from the community around how we can make Meeker move and have bike lane space and have open space and really brighten up and enliven.\nWhat is but reading between the lines is that there's a budget crisis going on DOT, like everybody else, is trying to figure out how they can raise some revenue here and there and thinks that some short-term parking here would be beneficial.\nIf, that's going to entail the bike lane and the parking.\nThat's, what we would be talking, about, I, don't I think the thing that happened, that the point is that the community board comes back.\nA plan, Then I do think it's important that we not kind of use extortionist methods to make decisions around parking when we have such urgent public space needs for our city.\nSo I think it feels really striking to hear that this is where you know we're putting capacity and resources to when the needs around bike lanes when the needs around shifting our priorities to thinking about the future of our city that is rooted in open public space, accessible transit, other types of a public transit that reach our communities is so urgent.\nYou know big ideas in terms of revenue generation in terms of transforming open streets into public spaces.\nAnother thing that we're experiencing is disappointment that some of the inspiring movements coming out of D.O.T itself aren't necessarily representative of the proposal and that you know the elements that that are kind of a perfect opportunity at this moment, not only as the community and the city is rethinking the BQE entirely, but we're also rethinking how to approach open space and public space.\nYou know the folks either from open streets or public plazas.\nThink you know also what you're hearing is just a general disappointment from some of the things that the movements that have been coming from the city that are really forward.\nI mean: Do you guys need the whole area to be open, space, Still thinking about parking on this area, like you planning to eliminate all the parking.\nIt's just there to be a kind of open space, I mean with a lot of initiatives or you're gonna still maintain some parking.\nYou, know, I think just realistically parking is gonna have to stay, but maybe not for the entire stretch.\nYou know there's a lot of things going on in the city right now.\nSo, all right, well, we'll hold them to coming back, and you know not doing this parking thing.\nOkay, You want to state that a motion to even though they don't need our people, a motion to deny the plan as presented to the community board, How about a post.\nDon't want to have necessarily a super long conversation, but you know the open streets.\nSo I just feel like those streets that had a community partner, you know, seemed to work better than the ones that were relying on NYPD to come and put up the horses and remove them.\nIs it going to go back to community or to the city general park.\nAnd I know some streets worked really well and others not so much.\nYou know NYPD with the community to get everybody talking and getting everybody on the right.\nFrankly, on that stretch of street, which is a point of direct access to the water for pedestrians, So you know it's a combination of quality of life of the residents of my building, along with all the people that enjoy the waterfront, which, as we know, is a lot of people at this time, and so I just wanted to hear your thoughts on what may be a better solution than hoping that NYPD will help us enforce parking, which doesn't really seem to be working as a solution right, now.\nAnd, I, think in the conversation that we had with Ben, that you know we felt like you had done all your due diligence you'd reached out to all the agencies that needed to be spoken.\nLike I said parked there for such a long, time, There's.\nYou know that street, like when you first get off the bridge.\nTo your point, You know if there's a plaza and people are rowdy, we can certainly have security enforcing things there much easier than cars for sure, and if there's no alternate side, parking, there's no regs there, then it's even easier.\nYou know, because you're not removing parking technically, If there's no regulation, there.\nSo I think, like I, said before they're kind of being used as long-term storage by people in the community."
        }
    }
}