{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB6",
            "channelId": "https://www.youtube.com/channel/UCKaVsnwHRM6uXG-_rrWwHqA",
            "title": "October 29",
            "publishDate": "2020-10-30",
            "shortDescription": "Meeting Agenda:\\nPresentation from the NYC Department of Transportation regarding curb changes at 69 Van Dyke Street in order to facilitate emergency vehicles.\\nPresentation from the NYC Department of Transportation on the Open Streets program.\\nReview of Resilient Red Hook resolution to remove Van Brunt St.,from Beard St. to Bowne Street as a truck route.\\nIntroduction of the new Comanding Officer at the 76th Precinct, Captain Vitaliy Zelikov.",
            "lengthSeconds": "1:22:40"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB6",
            "normalizedName": "Brooklyn Community Board 6",
            "twitterName": null,
            "youtubeChannelName": "Michael Racioppo",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCKaVsnwHRM6uXG-_rrWwHqA/videos",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "r1y8AnA-fPU",
            "fillerWordCount": {
                "uh": 172,
                "um": 200
            },
            "readTimeFullTranscript": "44 min read",
            "readTimeSummary": "5 min read",
            "wordCountFullTranscript": {
                "truck": 52,
                "trucks": 42,
                "hook": 38,
                "streets": 37,
                "route": 31,
                "noise": 28,
                "barriers": 27,
                "street": 24,
                "motion": 22,
                "decibels": 13
            },
            "wordCountSummary": {
                "truck": 10,
                "hook": 9,
                "trucks": 6,
                "noise": 5,
                "street": 5,
                "route": 4,
                "traffic": 4,
                "ups": 4,
                "port": 4,
                "quality": 3
            },
            "fullTranscript": "Jerry, do you want to do your portion first, you're, muted? I did that out of consideration and then I forget to unmute myself. I had told the new CEO that we probably would not get to him before. Seven. Okay, not sure he's ready. So, okay, can we just jerry I'm here and I'm ready whenever you are. If you want me to go first this morning, safety part first, if it's okay, there's an echo yeah, it seems like yeah. You should mute yourselves while other people are talking. If not you'll get the feedback. Yeah I mean and be before. We start you folks will have to bear with me it's my first time hosting a CB6 meeting. So I'm not sure of all the features that I'm going to need to operate here. John, you said everybody was muted. That might have been automatic, but you should be able to unmute yourself, though it might be it. I think so for myself and cv6 members and any invited guests who are presenting have panelist status. I think everybody else probably does not, which is why you would be muted. But if you do have questions- and you can't unmute yourself- please put them in the chat I'll, make sure we get to them and we're recording the meeting for posterity. If I actually would ask if there's a member of the committee who might not mind taking notes, because I think we'll need minutes as well, somebody willing to enable to do that, I can do it thanks Evan, I appreciate it. Just general top line would be fine, because I can go back to the video and fill in any details, all right, jerry I'll turn it over to you and let you run the first part of the meeting. Okay, thank you eric. My name is Jerry Armour and I'm chair of the Public Safety committee for some of you who have not been on the committee for a while, since we have not met for a while, so that introduction is over with. Let me just start by saying about two months ago, deputy Inspector, Megan O'malley was transferred to Manhattan north as that as their new commanding officer, which is for her a promotion in additional responsibility subsequent to that or probably within hour. After that was announced, captain Zelikov was announced as the new commanding officer of the 76th precinct. Captain Zelikov had been an executive officer of the precinct about two years prior to his appointment as CEO. He spent four months in the precinct as the Xo, which in our case is very nice because he had a leg up on every other new CEO that we've had coming into the precinct as a commanding officer. He knew something about the precinct. He knew where red hook was. He knew where cobble Hill was not. He knew where Carol Gardens was. He understood, Court, Street and Smith Street. He did not have to learn it. He even knew where to get good coffee so without further Ado captain Zelikov. If you would like to tell people a little bit about yourself and what it's like coming to the precinct pause. Yours sure thank you jerry for the very kind words I see some familiar names and faces in this meeting. Like Jerry said, I'm captain Vitalia Zelikov, I'm coming here from the 70th precinct, which covers Flabbush. Before that I worked at Coney Island prior to that. I worked here in the 76th precinct covering couple Hill, Carroll, Gardens and Red Hook, I'm very happy to be back here. I am like Jerry pointed out, I'm somewhat familiar with the community, and I really enjoyed my time here in the past and I'm really happy to be back here. I've also worked in my past and I have 16 years in this department. I've worked in Staten Island. I work in Manhattan Brooklyn north East New York Crown Heights, so I I've been all over the place, but you know I'm really glad to be back here. So I'm looking forward to working with everybody here and and a great partnership in the years coming. So thank you again, Jerry. Thank you. Everyone do. We have any questions for the captain. I usually have a problem remembering to call inspectors, because I meet them as captains and for a moment I nearly called captain Zelikov, an inspector which would have been interesting. I'm sure he can't wait anyway. Do not do that means he's leaving you do not want that to happen. I'll stick around okay go okay, jerry! You can come over here. Just do not devote me down. I can't hear them. Okay, do we have any questions, if not we'll I'll turn it over back and turn it back to Eric it's yours. What's going on? Oh, not anybody! Sorry! I had a spinning beach ball there for a second. Thank you Jerry. Thank you captain for joining us. So we have a couple of transportation items on the agenda for this evening. Leroy. Do you want to go first, or do you want to? Let me let the red hook folks go first you're muted, my brit, my lip reading is not so great emily. The reason red hook can go first. Okay. So let me just pull up the agenda, so Alex welcome the first item on the agenda for transportation. This evening is a request from resilient red hook to the Community Board, to endorse a resolution they've put forth to d- list, Van Brunt Street from bone to beard as a New, York, City, Truck, Route, so Alex I will let you introduce yourself. I am letting you share your screen. Okay, that's good to go! So whenever you want to bring that up, you can do that. But why do not you guys introduce yourselves and give us the best of the screenplay yeah? Okay, hi everybody, I'm Alex Washburn and I'm the Secretary of the brazilian Red Hook Committee and the chair of the land use subcommittee for that, I'm coming to you from Van Brunt Street, on in red hook. This is our office and home and community center and right out, the door is Ben, Brunt, Street. So right here in red hook, and thanks again for having us having us here tonight, I'm here with Ezra hi everyone and we're here to tell you a little bit about the issue of trucks on Van Brunt Street, which is which is pretty serious and we've been bothered by this. For quite a long time. I was actually just at the red hook, houses with councilman menchaca, who implored me to help in solving the problem of trucks on Van Brunt, which is really gotten to a breaking point with us. So that breaking point resulted in a resolution that our committee pass, and this is a resolution that asks to d- map a portion of Van Brown Street from the city's official truck route and I'll show you more about that in a minute. I just want to emphasize. You know how thankful I am that there is this process and that there is this committee of the Community Board and so many concerned citizens here to listen to us tonight. We're very grateful for that from red hook, and we know that, especially in this time, change happens from the ground up now. Just to give you a little bit of background on myself, I used to work the top- down route. I used to be the city's chief urban designer at the Department of City planning. Before that, I used to work for Senator Moynihan many years ago, when I was the the only architect on personal staff, so I've seen the world from that top down attitude and I've always wanted to fight against it and over the course of my career, I've worked my way from the 63rd floor of the Chrysler building to the ground floor of a row house in red hook, and this is where I like to be, and so this resolution that I'll present to you from my neighbors here in red hook addresses the topic of trucks on our main thoroughfare, Van, Brown Street, so maybe that'll share the screen here. The city truck group is currently mapped in a in a way that includes Van Brunt Street as a shortcut to a more substantial route that works off of Hamilton Avenue Hamilton Avenue is an eight- lane, major thoroughfare, and it has through Delavan Street at the North and Bay Street at the south, two arms that come into red hook we're a mixed- use community. We are residential, but we're also industrial. So I want to say up front: we have nothing against manufacturing and trucks. In fact, we think they are necessary to our neighborhoods continuing development and character, but we think that this mistake in mapping by city DOT has had a huge number of unintended consequences that allow, in fact encourage trucks to use Van grunt as a shortcut to the two arms coming off of Hamilton Avenue, Delavan and Bay Street in accessing both our own manufacturing areas, but also in short- circuiting and allowing people to avoid traffic on Hamilton Avenue and come through our neighborhood. So what we want to do is take rid of that shortcut, so we we've created a we've created a resolution, and that resolution has several points that it brings up. First of all, it points out that Van Brunt Street- it is our main civic thoroughfare in the neighborhood. The existing truck route is incompatible with those necessary community uses on Van Grunt Free, our b61 bus route, our bicycle infrastructure, our residences, community facilities, schools, churches, local businesses. All these things that are never meant to be mapped with truck routes are here and what really scared us into action, and any of you all have been to red hook lately will see them going up the last mile warehouses they are coming, they are almost here and when they arrive, the way they operate is that they will have 53-foot trucks coming in all night and they will have panel trucks going out in the morning and coming back in the afternoon, it's going to be a 10-fold increase on the already considerable truck traffic that we have I'll show you a few pictures here to illustrate some of the points in the resolution. Well, if you've been down to Van Brown street and seen these trucks on it, they cause confusion and delay. Any of you guys have, you know, will understand what that means. In a in a narrow street and of red hook, they block the free flow of pedestrians, cyclists and vehicle traffic. They shape the foundations of our neighborhood houses. You know this is something that, unless you live in an area that is built on former islands and martians, you can't quite understand what happens when a multi- ton truck going 35 miles an hour above. The speed limit hits a sewer grate that Sewer Grate has a physical connection to your house and it transmits the full vibration of that truck and it shakes our houses. We can't sleep at night and our houses are coming apart. You can also see that having trucks like this endangers the safety of residents and kids. I have five kids here on that I've raised on Van, Brown Street and it's just an incompatible scale, given that we do not that this is a self- inflicted problem that this is unnecessary to the effective movement of goods and services in our neighborhood. We believe that this is an unnecessary and redundant loop which encourages truck traffic through our neighborhood, and it is exacerbating both the harm to us and our houses physically through shaking through breathing, through the particulate matter that comes out here, but also through noise, and I'm going to show you a little bit here about the noise that is out of the ordinary. It's extraordinary look at the this is a table from the city, environmental quality review handbook. That tells you what is an acceptable noise and gives you different baselines to help understand what volumes of noise are reflected in the way you measure noise, which is called decibels. So a jet taking off at 500 meters is 100 decibels. A freight train is 95 decibels. Now, when you get into a suburban area with medium density, transportation, 40 to 50 decibels is what you can expect and inside your house. The city says that okay 40 to 50 decibels, 45 decibels is actually kind of a maximum target noise to have inside your house. You know so when I first saw this I'm like oh wow, 100 decibels, the jet taking off. That's just twice what we're supposed to have is noise inside our house, but no, I you got to realize this is something called a logarithmic scale. Every 10 points is a doubling of power, a doubling of intensity of noise, a doubling of the pressure on your eardrum, so to go from 45 decibels to 95 decibels. It's not just 50 decibels of change. It's a change in pressure of almost 40 times the difference, 40 times more pressure on your eardrum in that change in noise. Okay, that's the background. Now this is pretty scientific stuff, so we felt we needed some help here in red hook, and we talked to this group called sonic sounds of New York City they're, a group of professors at Nyu's center for urban science and progress here in Brooklyn next. Their mission in their project involves noise monitoring on a city scale and they use the latest stuff machine learning technology, big data, but they couple it to citizen science to you and me working with them to report and analyze and hopefully mitigate urban noise pollution. They've received a lot of funding from the National Science Foundation and they have the full support of the city agencies. They are for real. They are an established and very important group. Next now here is a picture of their one of their researchers. Charlie Midlars, Professor, Charlie Midlar, is coming to my house in my gallery and installing a noise sensor right there above my door with his graduate students. This noise sensor has given us a full year of noise data and we have through a camera that was recently attached or attached last year. It has given us a collaborative corroboration of visual and sound so that we can understand where the noises are coming from that video. Here's, a video showing what we see so there's a truck going by seeing through the camera, and there is a recording of the sound superimposed on it as it goes by, and you can see that at the peak when that truck hits that sewer grate, we hit almost 100 decibels. We hit the jet engine at 500 meters. It is a shock of noise that is driving us crazy next now, if you plot this out in more scientific terms, this is called a violin graph on the left is the ambient noise with, in other words, the world without trucks, and there the average decibel is about 60. You know a good old, New, York, City Street, hey frankie, how you doing that kind of noise, but the part on the right that is when a truck passes and you can see there maximum decibels, 98.6 decibels jet engine at 500 meters. This is a huge difference between what is ambient and what the trucks do and that difference between these two blobs. That's what is killing us next yeah. This is, I just wanted to reference this city, environmental quality review table I'm an architect, so I work a lot with this sort of stuff too, and just to show you the you know the marginally unacceptable noise differences we are so far up over the scale. We are beyond the clearly unaccept unacceptable noise scale here and it's not something that we're saying anecdotally. This is what's written in city, environmental law. Next, so noise itself has a lot of detrimental impacts apart from driving us crazy, which is the sort of easy way of saying it has very specific impact on cognitive development for kids, on attention, memory, reading and verbal skills. Why is this important? Well, these trucks go by ps15. This is where we're educating our kids. This truck route goes by our best school here and the noise also because of the pressure on your eardrum. It has a detrimental impact on your on your heart health, on your blood pressure. It causes your blood pressure to rise, and we have enough problems now, especially during the pandemic and the stress that we're going through and today marks the anniversary of Hurricane Sandy, and we had our climate March today that the last thing we need is outside trucks coming in or putting up our blood pressure nice. So all these things that it does decreasing working quality, increasing physical tension, increasing blood pressure and all the changes that your body does I'll, leave that to the academics and to their studies about what this does, but as people here in red hook on the ground. This truck noise is just we do not it's unacceptable, it's just unacceptable to us and it's unnecessary, so we would like action now. The studies are suggesting that the trucks causing damage show it. Now we have data that proves it now and we are worried. The last mile warehouses are that are coming into operation, are going to make the problem 10 times worse and they will create a facts on the ground scenario which will allow government to avoid us to stiff arm us. In fact, we are worried about the logical approach, which would be to say, let's do a truck study. Well, you know, let's do a truck study, that's what the trucking companies want us to do, because they know that buys them time it causes. It gives them time to change the facts on the ground and have trucks here, both in the middle of the night and in the middle of the day. You know I I'm all for traffic studies, but invoking them now as a solution is like Donald Trump, saying you'll get my taxes when the audit is completed when the study is completed. What we're hoping for is action now suspend this segment of truck movement on Van Brunt right now. Let's find alternative routes that do not go through our residential cores, either Van Brunt, Street or the houses, and then we can do a truck study. Well, I can't wait until that's over. Thank you, okay, thank you very much questions jerry, I'm not sure it's questions. Can everyone hear me? I think I am muted myself. Yes, a couple things that I want to point out. I do not disagree with that. Maybe Van Buren Street is not the ideal truck route. It's far from it, but the picture you showed where the tanker truck was turning on to Van Brunt Street. I think it said hazardous material or something shows actually cars illegally parked on a corner that was daylighted to allow trucks to turn and that truck was coming out of the industrial manufacturing part of red hook on the West side of red hook. So how is the truck going to get out? It can come in your suggestion to have it come in, I guess down the other truck route on the east side of red hook and then come across. They can still use Van, Brunt Street. In fact they can. Even if it's the map, they can use Van Brunt Street, because the truck regulations say that they can take once they're off the truck route, the most direct route to where they have to be. That would be Van, Brunt, Street, so deep mapping. It would not! Oh, I understand why you're saying it for health reasons, I do not think would get you the desired results. A couple more things when you talked about ps15 you have a ps15 is set significantly back from Beverage Street and separated by an open area of the schoolyard. So I'm not sure, and as far let me just add one other thing, the actual bike route in Van Gaal Street is not. I'm sorry in red hook is not on Van Brunt Street, it's a shade route. The actual route is inlaid a conover, nobody uses it. I will grant that I'm not sure that either inlay to conover or Van Brunt is good for bikes, one because of traffic and two because of the condition of the streets or the cobblestones. So I find myself torn on this resolution because I'm not sure it would accomplish what you're trying to accomplish the trucks will still come down very broad street and they will do so legally with or without a truck route or an official truck route designation. Well, let me respond yep, okay. So the key to understand here, though, is that we're trying to create an open, jawed truck route rather than the Van Brent portion, which creates a short circuit. So when you're saying like that hazardous materials truck, let's say it's trying to go to the future ups site right now on the in the west of red hook as part of the remediation, which is I'm guessing, might be one of its possible destinations. It would be able to access that site via either Ferris street, and what we would ideally like is for it to access that site through the Port authority property and the marine terminal entry on Hamilton. So that would be the western draw. The eastern jaw is Bay Street and the question is: can we remove the Van Brunch Short circuit between those two which would maintain the direct route from either of those western or eastern jaws? There is an advantage to being a senior on the transportation committee and on the board community. Board six has gone on record a great number of years ago, trying to get to port authority to take Hanover Street through the container port and open it up for trucks. That would be something that would make sense now to follow up on we're still on record. It's never been withdrawn because of what you said. I just remembered that, and that would be a great way to then there would be a substitute for Van Brunt and getting the trucks in and out exactly and exactly the ups coming in and the other development on conover and unfairness. That's going on forgetting for a moment forgetting about the last mile warehouses over by ikea and the private school bases school following a follow- up on that the community board put on record a great number of years ago. You guys would be something that would be very helpful, but right now, even taking it off the route, they would still be able to use it and it could not be enforced so that I'm not. I can't see what we would accomplish and, quite frankly, I do not see D.O.T sort of falling into line. Let me respond. The other thing is I'm going to ask the chair, I'm a former chair. I do not know if we want to do cross- conversation. Do we and if we do it's fine, jerry I'll, allow I mean I can recognize John, I'm Alex, I'm happy to let respond to that. Well, I guess my response and again I appreciate your. You know your long perspective on this and I think that's wonderful. That CB6 is on record for the Port authority access. What I, what I would say is that, given you know my early experience, I think we can be tremendously effective. Now, with this bottom- up pressure, combined with our top- down connections, the current head of DOT is polly trottenberg. She was my replacement at Senator Moynihan's office. When I went to found the Penn Station Redevelopment Corporation. I know her. I can talk to her through Carlos through others. We can. We can put this pressure as long as we stand up as a community to say that it is that is bottom up. I think it all starts bottom up, but I am fully prepared. You know with all the resources I can bring to the table and others that I know to make sure that DOT does not ignore us that the port authority does not ignore us. My biggest accomplishment when I was the when I created the Penn Station Foundation. I got the port authority to put in 80 million dollars into that project, even though they kicked and screamed and fought to try to stay out of it. I'm definitely a veteran of fighting within government. Thanks Alex, I'm going to take some more questions. John santor! You want to go ahead. Hi I was. I live in Sunset Park, John, St Pamper. Here I live in 56th street, but I wanted to listen to the meeting because of the last mile trucking facilities, and I guess I'm trying to touch base on where the where people are at on this. I was planning on waiting until later in the meeting, but because it just got brought up. I guess what I'm most interested in right now is. It seems like Mr Washburn is implying that there is actually an existing violation of law regarding noise violation and noise levels. If I understood him correctly, so I just I just wanted to ask if the board, I am aware of the letter that Mike sent to DOT, but I'm just wondering if the board has any additional information pertaining to air quality or noise quality or anything else that is potentially being violated by the now been out for distribution centers in red hook, because I'm sure you've heard that 280 Richard Street is also going to be the site of an Amazon facility as well. We do not at this time to my knowledge, those are all as of right projects and none of them have come before the board. So I'm, unfortunately, I'm going to need to stick to tonight's agenda, but but certainly something we would be open to discussing in the future in greater detail. Okay, thank you. Thank you, Eric yep leroy. You want to go ahead. Yes, as most of you know, I work for D.O.T, but right now I'm putting on my red Hook resident hat. I live in red hook. I'm a member of the board as Jerry I've been around for a long time. So can we get the trucks off of Van Brunt Street would be the greatest thing we ever could accomplish. I do not know I'm speaking as a red hook resident, not as a D.O.T rat wanna, make that clear, okay, but I can I can honestly say I do not see that happening. I do not see us being able to just automatically take it off the truck route without having an alternative place. To put it, and so I think the best course of action would be to try to get Conover, Street or inlay street, and that would be going to the port authority in EDC and working from that perspective, and if we can get them to do that to at least open their eyes to the idea of doing that, then I can see how we can move the truck route, but borrowing that I do not see DOT taking it off the truck route without having an alternative for it. Okay, thank you. Leroy Vann, hey thanks! So I'm a physician, so my feedback to you is going to be a bit different. I can't speak to the to the architecture points and the the actual geography points, but a few pieces of feedback. So you talk about absolute noise levels and I get why you reference that and there and it makes sense compared giving comparisons, but your comparisons are all prolonged noise. You know the airline, obviously that's not as long, but a lot of things you talk about. Are you know in the order of tens of seconds, if not minutes, if not hours, so you might want to tailor that a bit more, because what your, if I understand correctly, what you're pointing out is a very short, loud, sound and so what the effects of those would be- and I would I do not know if you'll have medical professionals as you progress this further. But the moment you start saying you have evidence that it has health effects. Even if I I'm sympathetic to what you're saying I immediately would push back and say what evidence and where is it and it kind of detracts from the your point, I think because then the argument becomes about the evidence, the medical evidence versus your point about disturbing sleep, disturbing productivity or whatever it may be, and I would focus personally my biases I'd focus more on the sleep, because there's a lot of data to say disrupted sleep does lots of bad things: cardiovascular, disease, anxiety, depression, you know, decreased work, productivity, so on and so on. So right, just a few of those in terms of you know, kind of a bit of feedback in turn concerning how you're presenting the the acoustic data thanks man Jim, I'm you had your hand up, he's, muted right now, yeah okay can am I heard or no yep. We can hear you okay, so I have I'm also part of resilient red hook, and I have been speaking with with the EDC, and they told me that they were discussing the options that they have with ups and they're in conversation with ups, so which is very positive, and they are well aware of what we've been trying to push out of red hook to have the trucks come in at from Hamilton Avenue and then also have them go in through pier 10:11 12 and out on king and Ferris Street, and this way they'll be right across the street from the ups terminal, and that would also be beneficial to the other businesses where they're doing whatever they're doing down at that end of the neighborhood. So this way they would be able to avoid Van Run Street. In addition to that, I know that in the past, from the different access point of court street instead of having the trucks come down, Bay Street. I know that in the past there were talks with John Quadrozy. To have him do a land swap and have Herkimer Street possibly be available, so that this way he would give up Herkimer Street for a piece of property and red hook, and this way that would avoid these trucks going by the parks on Bay Street as well. So I mean, I really think that we need to come up with some kind of a comprehensive plan. We do have. You know a lot of a lot of information available. We are extremely limited in getting these trucks in and out of red hook. I mean now. You know if you look at the at the Amazon site. If you do a little research during the course of the day, they could possibly be having and they're, not the busiest Amazon site and they're only 300,000 and something square feet as opposed to what they're putting next to ikea at 640, columbia and they're. Doing one minute a truck every minute is one truck, so they're doing 60 trucks an hour. So I mean these are things that like Alex, is bringing to our attention, and you know, instead of like ups, is going to have a 100 1.2 million square foot and I do not know how many levels they're going to win the pudding there, but I mean these are concerns that we have and it's not only the noise. It's a few years ago we had buildings collapse, I'm on Richard Street, one block East of Van Brunt, and when I have tractor trailers coming by my place, you know I my building is an old building. It's over 100 and something years old and the whole building shakes as well. So I'm in an industrial area, I have a machine shop. I've been down there for 50 years. I mean this is what we do. I I'm constantly calling you one to come and have them repair streets so that this way we do not have that problem. But you know with Van Brunch Street. It's really not an industrial thoroughfare. It's more now commercial there's the school kids are crossing people. Are there on Saturdays sundays, walking across the streets. I mean it's something that we really need to address and I think there are options, but we have to spend the time to look into it and, like I said I have been in talks with ups and with personally and with resilient red hook and also with with the EDC and with poor authority thanks Jim any other questions. Somebody want to entertain a motion jerry. You know you your point about and leroy, I think also to it to a degree. Dot's hesitancy you know. Certainly there are some constraints facing DOT, but if there is the potential with EDC to po, possibly act on Conover Street, it might help if we were to underscore that by sending a letter that resilient red hook is requesting. So I will leave it up to you guys, I'm not I'm not saying we should not send a letter. I'm just saying we have to be realistic if Jim and I like some of Jim's like actually I like a lot of his ideas, not some. If he's been able to have some conversations with ups and EDC has always been a stumbling block on any of the improvements that we were thinking of making down here, it's not just on the Conover street by through the container point or not. So I'm not saying we should not send a letter. I'm saying we have to be realistic and maybe what we need to do as a community is all work together and come up with some alternatives. The letter saying take it off is fine. It should be followed rather quickly or relatively quickly by some suggestions and ideas similar to what Jim said, including some of his. That would be very helpful. I think that nobody has a claim on being on having all the good ideas and if we have some of them, let them use it. Leroy Joanna Smith had a question about 53-foot trucks posted in the chat. What was it are all 53-foot rigs illegal on all New York city streets. Why is not the 76 precinct enforcing how about dot's freight team and NYPD highway responsibility? Eric? I heard that 776 priesthood was involved in something else. Can you just repeat that was that for us? Yes, captain just a question about truck enforcement of illegal 53-foot trailers, sure well technically, 53 for 18 wheelers as they're commonly known, they have a very limited access route throughout New, York City and a truck route map was posted earlier the so these trucks are not allowed on the parkways, for example, Ocean parkway down further South they're not allowed to be on any commercial vehicles not allowed to be on such roadways belt parkway they're allowed on designated truck routes. The problem that will have is once the truck is off that truck route. Like Jerry pointed out earlier, the truck is legally allowed to take the most direct route to its destination. So that's where we'll encounter issues as far as enforcement is concerned, highway patrol they they're subject matter experts as related to a large commercial vehicles, but their responsibilities are mainly on the highway or when the truck is involved in an incident, if there's a God forbid, a serious collision, etc. So that would create a challenge for us. As far as enforcement is concerned, I mean enforcement generally is not. Is not an issue we'll send our resources wherever they're needed, but in this case you know that there may be an issue with just to enforce just truck presence. You know, but again we'll be able to cross that bridge, maybe limited if that truck route was amended and removed. But you know until then it's if the truck is legally there they're legally there you know. Obviously we could not force any other violations. You know any traffic laws, but just the mere presence of a truck there if they're taking the shortest route to their final destination. That's legally they're allowed to do that. Thank you just so. Everyone knows DOT, there's two things here: D.O.T does not have any enforcement in in our trucks in enforcement powers. That's it's all on the NYPD we're also very shortly hopefully before the end of the year, coming out with the the study that we did in terms of trucks in general, throughout New, York City, there's a comprehensive thing that we did so that hopefully, will be out before the end of the year. I I'm in agreement with jerry in terms of I do not know how should I say this, I do not know if just saying just take it off the truck route is what we as a community board, want to say. I mean that's. The ultimate goal is to get the trucks off and broad street. Do not get me wrong, I'm in agreement with that as a red hook. President, I'm definitely in agreement with that, but I think it should say something much more than just take it off the truck route. I think we as Jerry was saying we need to come together. We need to have a comprehensive statement and it being inclusive of those alternatives and how we can work with those different other state agencies to make this happen and DOT as well, but just to say just take it off the route as the as the letter, I'm not sure. That's something that we should do right off the bat anybody else, committee members so Jerry. Do you want to make a motion that expands on what yeah I was I'm going to try I'll put it this way. I do not have the resilient red hook motion in front of me. I will to see if I can. No, I think, community Board six. We will supports the motion as presented and in addition that we support a we will be presenting a within our letter. We will be presenting some alternatives, so I guess my motion is that we support the Red Hook Zayn's brazilian project's promotion to olive to d- list Van Brunt Street. As a on the official New York City Truck Route Map. We also will include in our letters some alternative ideas so that the trucks in the long run to the last mile facilities that are planned for the future will be able to get that to those facilities. We will present some alternatives, including the or supported motion years ago, of opening up inlay street through the container port. For in that I should have said, for example before that. Okay, that's my motion. Okay, any discussion on the motion. We do need a second, oh we did we needed a second madeline was that you, okay, madeline seconded any discussion on the motion hearing and Jim. I see you have your hand up, but once there's a motion on the floor, you have your hand up once there's a motion on the floor. I have to get a big echo there once there's a motion on the floor. It's only it's only. I have a question eric yeah go ahead. What happens if we recommend that they map the street and it's done what will happen to those trucks going through the rest of red hook? Did you hear me yeah? I did yep yep and if you could mute, I'm getting I'm getting echo from you. There seems to be a delay, so there seems to be a delay, so I well the trucks are going to be there regardless. I think the question is whether there's a better route for them than Van Brunt, which I think is the gist of the question here, and certainly the port authority facility on the West side seems to be a better alternative. So I think that's what we want something we will add in the letter as Jerry described in his motion as a recommendation, I just wanted to make sure that Jim's suggestions, especially over by on the east side, coming into red hub, make sure that I would like that added to it as well. In fact, if that's a friendly amendment, I accept it and I think that we will look at the Eric. I think, before the letters written, we should look at the recording and pick up exactly what he said. I know I was not listening that carefully, which is a good idea, Herkimer Street and using that to get them away from the park and the new school. So I think just take a look at the recording and ask Mike to pick up the correct as the correct words that Jim used yeah. I think that makes sense, given some of the challenges of working with a virtual meeting rather than in person, makes it a little trickier to write the resolutions. So, although what's being built on Columbia and Bay, is going to preclude all of this, because the trucks are going to have to come down bay anyway, just an aside for any of you who are interested the one that's being built right next to ikea that last mile warehouse does have on the web a brochure you can take a look at the at what this thing is going to look like it's humongous, it's called 640 Columbia Street, take a look and cry all right, any other discussion on the motion hearing. None! We will go ahead with a vote then I guess, since some folks are muted, if you could just use the raise hand, function or physically raise your hand if your if your screen is active, some folks do not have video on, but in any case. So, if all folks in favor of the motion would please raise your hand, please raise your hand and hold them up I'm in favor. I can't raise my hand, but I'm in favor thanks pauline all right, so I have thanks following him proposed Van. I see your hand. Is that opposed- and I see here- is that opposed I could not go. I could not take it down, so it seems unanimous would want it. So it seems unanimous. The original motion at some point, or just like put the language in the chat or something so I can write it down within that yeah Evan. I think we'll just add it after the fact so yeah. Thank you all right, thanks very much Alex thank you for joining us feel free to stick around for the rest of the meeting. If you'd like Leroy, I think is it you or emily who's going to present the next portion. Emily is okay. Emily welcome, hi. I attended a one team meeting, Sorry Transportation Committee meeting all the way back in March, and so I have not seen any of you guys since then, but thanks for having me here, I'm here with first I'll, be talking about 69, Van, Dijk Street and what we suggest for that site. So I have yuri he's an engineer from key civil engineering. He has, I do not know if I sent you the drawings beforehand, he asked for it right before the meeting. He did not send it. No all right, I think if you make me a host or Muriel host, we can pull that up to show you what we're talking about. Okay, it shows all panelists should be able to share screen. Okay, hello. This is yuri from key civil engineering and I'll share this screen of the drawing that we prepared, and so what we are here coming to you today is we are presenting to you informationally what will be happening on this site in regards to Beer Street, so got does support the applicants being civil engineering requests to expand their curb cuts on the Beard Street side of their site, and in order to do that in order to facilitate these larger vehicles that they have coming in and out of this place, they would need these extended, curb cuts and so DOT in order for the safety and keys of in and out of the site would support their applications. But in order to do that, there is going to be removal of parking along Deer Street, and then here you can sort of talk about your site all right, so this site is going to be a verizon maintenance facility, so parking up all their trucks, as well as having a truck bring in the poles. So if you look here, we have a schematic showing the poles on the trailer carried by a truck, so it'll be a 24 hour open facility that will be here for emergency responses and we are having the trucks with the poles come down. Bh street enter into this site, go to the site, drop off or pick up the polls here, these four cribs that we have and then it would leave the site through this 60 foot, wide, curb cut and go down be a shoot again. We are based on the truck movement with the poles. We need to remove on- street parking. Basically here I won't be a street and then yeah and then just that's about it. Yeah it'll be one- way, move into the the lot with the big truck at this 48 foot wide. Curb cut and one way out, the curb cuts will be used for the smaller trucks will be used as a two- way to get in and out and there's also a curb cut on the Van Dyke Street and that will be used for the smaller trucks. It's a 30-foot wiper, but there yeah so pretty much we're here to sort of you know present that information that they will be removal of parking in order to facilitate access to this site and how much how many parking spaces are you talking about? So we have about 65 feet here and then we have about 97 feet here, so approximately 160 feet of street frontage that will be removed and what's the current regulation there, the current is no parking, Tuesday and Friday midnight to 3 am and emily does. D.O.T have many figures on parking utilization here. If I I'm recalling that stretch, that does not seem to get a lot of. I really hear anything right. No, it's not with me it's by the water. It's very people left the the drawing with the base path. I think that would be contextualize it a little bit better for everybody right so yeah. The parking will be in this stretch of street questions from the committee jerry. A couple of things did you do as far as parking utilization during the day, the in the showcase, the refrigeration company? That's there between Richards and Vin Brunt M freed. I think it is that street is currently parked during the working day constantly it's parked in it's hard to find a spot. However, I'm just so did you do any outreach to those people to let them know that the place where they parked from Van, Brunt and Hunter Richards is going to they will be losing their spots, because we also have a small sky. I think it's called sky boom whose workers park there they are a crane company. Has anybody done any kind of an outreach to these folks from the applicant or verizon or no? We did not do any outreach to them. Okay, and is this not going to be entirely for verizon trucks, correct, yep, there's, also an office and slash dispatch? The office is not there yet. The only thing. That's here is the near the building near the proposed building towards the Beard Street side. You have a transformer and other electrical equipment not sitting five six feet above the ground, so my question is: if this is for all trucks and emergency vehicles, why are there handicapped spots inside so designated with signs so based on the zoning code? The outdoor storage of utility vehicles requires parking spaces and based on the requirement of parking spaces, we need to provide handicap spaces as well. Interesting, okay, I did not know that and also for the office which will be built after yeah based on the base. Okay, so can I see readiness you have applied to the old DOB for the building, correct yep. I see it there. Okay, I'm just concerned about what those two business. Thank you Sir, I'm just concerned about what we're going to do with those businesses between Richards and Van, Brunt and free, it's either refrigeration or store or display cases in stores they parked there between the bus, stop, which is near Van, Brunt, Street and Richard Street. That, during the day is parked in entirely with both well, actually only on one side, one side, both sides, one side- is already no parking anytime. The north side is no parking anytime, it's the south side where they can so other than that I mean you know. I know that the utility companies are considered unique in both statements. The regulations they're considered their vehicles are emergency vehicles. So I'm not I'm not against the curb cuts. I'm just hoping that somebody did some outreach to these folks, so they know what's happening before waking up one day and pleasure to say there are no signs that even talk about the current regulations because they somehow have a tendency to disappear whenever D.O.T puts them in. So I'm just worried that that's going to happen when these signs are put in, but that has nothing to do with the application. That's the thing that you easily repaired other questions from the committee or from the public. I do not see madeleine, you would unmute there. You go okay, Eric! I it's just like one more thing: with more traffic truck traffic coming down, Van Brunt Street, I mean this is getting absolutely crazy. This is just additional. You know to what we were just talking about yeah and certainly not the last or the no I'm afraid not. I mean I mean I think the committee's got to start paying a little more attention to what the heck is going on in red hook, but I do think that we were going to need a real, comprehensive look at it from yeah and from department of buildings. You know I understand what these products are as of right, but you somebody needs to look at them in totality and not as individual Silos yeah. I know. Okay, that's about all! I have to say right now, Erica. Unless there's some other comments, I'm willing to make a motion to recommend. I do not see any other hands up Gary. So why do not you guys? I do not. I do not see any hands, but you see more than I do. Recommend approval of the application for the curb cut for the parking lot on beard between Richards and what the heck is that low street. Again, the white and dwight the expanded curb cut on Van on Beard Street recommended before somebody seconds that Joanne Brown has her hand up. No, I know oh no. I would just wanted to ask the question I, but what well, when they be doing all this traffic came rather with the? What would they say? 18, wheelers and everything? Are they going to be that covering up those 18 wheelers when they be going through red hook, because they already have enough asthma and all the pollution and stuff that's going on dead already now and then between the regular traffic, the bicycles and go with their little scooting school scooters? I think you call them scooters, I'm not sure yeah, but then two, but then who is going to be brother monitoring? You know like I was watching it and I do not see like a bike, a bike, a bike sign. You know telling the world when it's stopping and go. You know because the bike is just going on going on, but then sometimes the trucks do not even see them, so is there any way that they can like brother B would be more responsible because of the pollution, the asthmatic rate and all that and everything else that's going on, including this here cold war stuff, that's up in there as well too. I'm just asking a question yeah! No. I think I think it's a very good point and it gets back to the earlier discussion about a need for a comprehensive approach to all that's going on in red hook. So well, not necessarily a point for this particular motion. I think it's something that we will visit with the board office and pursue with the Department of Transportation and city planning. So thanks for that, okay, because I'm learning how to work, I'm learning how to work this device here. Okay, we're all we're all doing that believe me soon. Thank you, oh well. Okay, dude! Thank you very much! So jerry, were you complete in your motion? Yes, Sir! Okay, do I have a second madeline any discussion on the motion. All right hearing none, I will call the question then, all in favor of Jerry's motion to support the application. Please say aye or raise a hand or any opposed any abstentions, leroy all right, I think so. It was unanimous with leroy abstaining. If, if I mistook your vote somehow, please just let me know we'll we can always patch this up in a minute. So, but as far as I am concerned, the motion is passed thanks, emily and yuri for the present all right. Thank you. Thank you. Mike also asked me to come tonight to get a update on Oakland streets yeah. Are there any specific questions that you have here not from me in particular, if you want to just give us a little overview on what's going on and then if people have questions yeah so in terms of open streets, we're currently in the stage of evaluating all the open streets that we had opened from March onward, and we would love to hear feedback on what is working and what is not working and that's something that you can email me and I'll redirect those comments to the Appropriate Union unit. Sorry, but we since then, since the first iteration of open streets, we've had more programs, it went from open streets to open streets, restaurants to open streets learning and the newest iteration now is open storefronts, which ground level retail stores are able to sell their wares and their goods on the sidewalk as long as they maintain eight foot clearance and a five foot minimum height maximum height of their display. So that's pretty much all that's going on in terms of open streets. If you have any specific questions on any specific open treats that you would like me to answer I'd be happy to jerry. It's not a question. It's a comment. We have a number of residential streets off court in Carroll, gardens that were open streets. There's one in red hook that reed Street between Conover and Van Brunt. It's an open street for the restaurants, Brooklyn crab and hometown Barbecue yeah, and what I've noticed is that the barriers are there and then they are broken. It seems that either the motorists or the delivery in some cases on Reed Street. I know it's delivery trucks. It seems like that. The it's open season on barriers when you put them on, opens on the open streets and I'm wondering instead of using police barriers and plastic barriers if something more resilient sort of like what the police department uses when they set up those aluminum barriers for demonstrations, I'm not sure that that's possible, but something that will actually let these streets function as to what they've been programmed yeah. So it's not really a question. It's more of a if the program's going to 16 it has to be. It has to be that cars can't go down the streets. I know between court and henry is supposed to be an open street and the barriers are not there. They're, not even on the corner, crushed they've they're no longer there and it can't function now. I do not know if the people on that block here. I do not know who destroyed the barriers. Maybe they did themselves, but it seems to me that if the program's going to succeed, we have to find a way to keep those barriers in place and the streets actually closed. Yeah and so that's a complaint that we've heard across the city. Unfortunately, those barriers are not under the jurisdiction of ut those come from NYPD and we have seen many of the barriers that were, you know, used being destroyed. I've seen it all, but what makes it you know more successful is having a partner, a community organization or a partner in you know, holding responsibility in that street we've seen streets like those have a higher success rate than those that were to be managed by the local if jerry, if I can shine in and just because I I'll speak for you a little bit captain. Unfortunately, it's a matter of resources. The NYPD does not have enough resources to provide the barriers that you're talking about throughout the city. So it's just a matter of resources in terms of the specific barriers emily is 100 correct. It is great when we have a partner to be able to open and close the street, and we would need especially at Reed Street. We would need the partner to notify us when those barriers are damaged, so we can work with our partners at the NYPD. The barrier unit to replace those particular barriers- unfortunately not unfortunately, fortunately, as you may know- and some may not cars- can go down open streets, so you can't prevent them completely so that the barriers have to be able to be moved and put back and that's when a lot of them get broken, because if I'm a delivery car driver, I do not feel like getting out my truck to move the barrier, so I can drive down so I'll, try to squeeze past it and, unfortunately that do not always work. So I wind up running over the barrier. So a lot of times, that's how barriers get broken, but we would need our partners to let us know to see if we can get the barrier unit to replace those barriers at those particular locations. So you're right! Thank you for that and I'll also piggyback on the use of barriers. So the police department has two types of barriers. The barriers that we're talking about are the big blue wooden barriers and we have the the metallic barriers they'll link together that we used for useful parades and other functions. The barriers distribute from the barrier section which is located in Queens. Unfortunately, these bare these wooden barriers that we're discussing that they were not designed to be used for long- term functions like like open streets typically I'll give an example is today at the climate rally, climate change rally, barriers set up as to be visible to prevent any vehicular traffic from entering the event and the police officers, usually in the past, was assigned to this location or intersection to maintain that barrier. Now with the open streets, the barriers are set up and pretty much essentially they're loaned out to that area and they're, not man and therefore they're at those locations for a long time period they do break some of them are old. Like you mentioned they may get hit by a car. They get moved out of the way, so they take a lot of abuse so far, you know if luckily reed street is a is a it's not a very heavily trafficked area. So that's positive. If anybody does encounter barriers that are broken need to be replaced. They could let the police officer call the prison, mainline and, and probably take care of that. I guess. In light of the conversation, I would say that streets like 4th Fourth, Street, fourth place second place in Carroll gardens which are purely residential, and you do not have a partner to put the barriers back and forth and so on. Maybe something like those little tiny streets that are literally one lane wide. I'm not a good candidate for open streets, whereas some commercial streets are a better candidate and maybe at some point D.O.T should evaluate the program and fine- tune it a little bit. I think it's a good program, but maybe the streets that were originally picked because of Covid-19 and haste and so on are not the best streets yeah. We are in complete agreements with you jerry. I think this point now is the point where DOT is really analyzing, everything as a whole and looking at it. You know in a different light and from that we've learned what works and what does not and the more feedback we get from the community the easier it is for us to kind of guide what is wanted versus what can sort of be cut out eventually, okay, thank you. I mean it's good to hear since I know from the residents on those blocks. Initially they had no input into the decision and they some of them. Some of the residents were not happy, but the point is they may be better blocks in that area. There may be additional blocks that would function better around some of the schools. Ps 32 29 a lot of places where it might be better for that to function around ps15 and red hook, the s27 and right hook. So I'm just saying that if you, if what you say is true, it's being reevaluated, that's great to hear and I'm going to mute myself at this point, that's it well. I eric, I think what could happen if being in contact with the board the board office, if there are specific locations throughout CB6 that they're getting constant complaints about that, a list should be generated and that should be sent to emily, and then we could look at those. We definitely are out there reevaluating, because I have I myself and I know emily has we've gone out throughout CB6 and spent. You know probably 20 minutes to 30 minutes at particular open streets to see if they're being utilized and how they're being utilized they're, putting together a report on that as we speak. But I would say if there have been specific locations, that the board is getting complaints about unless should be generated and sent to emily great anybody else. Have questions about current open streets or open streets you'd like to see oh yeah John Hesty here. Are there any plans to expand open streets to additional streets? Is there a way to nominate new streets so for the current iteration of open streets? No right now we're not taking any recommendations, our requests, but what we are looking at now is on open streets learning, which is providing open streets for schools. Those are being evaluated for the children's safety, so I believe that program only is until November, 30th. Okay, any other questions all right emily. Thank you very much for the update. We appreciate it and leroy. We will definitely take that up with the board office and let people know that they can funnel concerns or requests through the board, we'll make sure we communicate those to you guys, yeah. My email is in the chat too. So I'm sorry tell me about anything in the board: great yeah, all right, thanks everybody for, for bearing with my first time, trying to run a zoom meeting for the board. I appreciate it appreciate everybody making the time for it. I believe we will be meeting next month as well, but we'll send that information around probably the third Thursday, our regular monthly meeting, if you want to just note that on your calendar and we'll confirm it as soon as we can. Okay. Thank you Eric. You did a great job every day, thanks guys good night, everyone good night, everybody good night, everybody, okay, I do not have.",
            "summary": "If I actually would ask if there's a member of the committee, who might not mind taking notes, because I think we'll need minutes as well, somebody willing to enable to do that, I can do it thanks, I'll turn it over to you and let you run the first part of the meeting.\nThat breaking point resulted in a resolution that our committee pass- And this is a resolution that asks to d- map a portion of Van Brown Street from the city's official truck route.\nThis resolution that I'll present to you from my neighbors here in red hook addresses the topic of trucks on our main thoroughfare, Van, Brown Street, so maybe that'll share the screen.\nThe city truck group is currently mapped in a in a way that includes Van Brunt Street as a shortcut to a more substantial route that works off of Hamilton Avenue Hamilton Avenue is an eight, lane, major thoroughfare, and it has through Delavan Street at the North and Bay Street at the south, two arms that come into red hook.\nThat allow, in fact encourage trucks to use Van grunt as a shortcut to the two arms coming off of Hamilton Avenue, Delavan and Bay Street in accessing both our own manufacturing areas, but also in short- circuiting and allowing people to avoid traffic on Hamilton Avenue and come through our neighborhood.\nWe believe that this is an unnecessary and redundant loop which encourages truck traffic through our neighborhood, and it is exacerbating both the harm to us and our houses physically through shaking through breathing, through the particulate matter that comes out here, but also through noise, and I'm, going to show you a little bit here about the noise that is out of the ordinary.\nThis is pretty scientific stuff, so we felt we needed some help here in red hook, and we talked to this group called sonic sounds of New York City They're, a group of professors at Nyu's center for urban science and progress here in Brooklyn.\nYou, know a good old, New, York, City Street, hey frankie, how you doing that kind of noise, but the part on the right that is when a truck passes and you can see there maximum decibels, 98.6 decibels, jet engine at 500, meters.\nThis city, environmental quality review table I'm an architect, so I work a lot with this sort of stuff too, and just to show you the you know the marginally unacceptable noise differences we are so far up over the scale.\nLet's find alternative routes that do not go through our residential cores, either Van Brunt, Street or the houses, and then we can do a truck study.\nWhen you're saying like that hazardous materials truck, let's say it's trying to go to the future ups site right now on the in the west of red hook as part of the remediation, which is I'm, guessing, might be one of its possible destinations.\nSix has gone on record a great number of years, ago, trying to get to port authority to take Hanover Street through the container port and open it up for trucks.\nHere I live in 56th street, but I wanted to listen to the meeting because of the last mile, trucking facilities, and I guess I'm trying to touch base on where the where people are at on this.\nIf the board, I am aware of the letter that Mike sent to DOT, but I'm just wondering if the board has any additional information pertaining to air quality or noise quality or anything else that is potentially being violated by the now been out for distribution centers in red hook, because I'm sure you've heard that 280 Richard Street is also going to be the site of an Amazon facility, as well.\nAs most of you, know, I work for D.O.T, but right now, I'm putting on my red, Hook resident, hat.\nThe best course of action would be to try to get Conover, Street or inlay street, and that would be going to the port authority in EDC and working from that perspective, and if we can get them to do that to at least open their eyes to the idea of doing that, then I can see how we can move the truck route, but borrowing that I do not see DOT, taking it off the truck route without having an alternative for it.\nIn turn concerning how you're presenting the the acoustic data I have I'm, also part of resilient red hook, and I have been speaking with with the EDC, and they told me that they were discussing the options that they have with ups And they're in conversation with ups, so which is very positive, and they are well aware of what we've been trying to push out of red hook to have the trucks come in at from Hamilton Avenue and then also have them go in through pier 10:11 12 and out on king and Ferris, Street, and This way.\nAddition to that, I know that in the past, from the different access point of court street instead of having the trucks come down, Bay, Street.\nTo have him: do a land swap and have Herkimer Street, possibly be available, so that this way he would give up Herkimer Street for a piece of property and red hook, and this way that would avoid these trucks going by the parks on Bay Street as well.\nAnd, like I, said I have been in talks with ups and with personally and with resilient red hook, and also with with the EDC and with poor authority Certainly.\nAs, a on the official New York City Truck Route Map. Ago, of opening up inlay street through the container port.\nI attended a one team, meeting, Sorry Transportation Committee meeting all the way back in March,, I'm here with first I'll, be talking about 69, Van, Dijk Street, and what we suggest for that site.\nIt's, just like one more thing: with more traffic truck traffic coming down, Van, Brunt, Street, I mean this is getting absolutely crazy.\nMaybe, they did themselves, but it seems to me that if the program's going to succeed, we have to find a way to keep those barriers in place and the streets actually closed.\nIt's just a matter of resources in terms of the specific barriers It is great when we have a partner to be able to open and close the street, and we would need especially at Reed.\nUnfortunately, not unfortunately, fortunately, as you may know- And, some may not cars- can go down open streets, so you can't prevent them completely so that the barriers have to be able to be moved and put back That's when a lot of them get broken, because if I'm a delivery, car driver, I do not feel like getting out my truck to move the barrier, so I can drive down So I'll, try to squeeze past it and, unfortunately, that do not always work."
        }
    }
}