{
    "data": {
        "YoutubeMetadata": {
            "author": "QCB1",
            "channelId": "https://www.youtube.com/channel/UC7mzGyidMH5QGLgE3_Xowgg",
            "title": "Community Board 1",
            "publishDate": "2020-06-17",
            "shortDescription": "",
            "lengthSeconds": "2:57:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "QCB1",
            "normalizedName": "Queens Community Board 1",
            "twitterName": "CB1, Queens",
            "youtubeChannelName": "Community Board One Queens",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCU7eHMXuvqtsAzGxvP6FXRQ",
            "twitterHandle": "@Cb1Queens",
            "dateCheckLast": "10/8/2020",
            "status": "stale"
        },
        "properties": {
            "videoURL": "R4EKhX8Gqio",
            "fillerWordCount": {
                "uh": 1,
                "um": 24
            },
            "readTimeFullTranscript": "96 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "bike": 114,
                "lane": 85,
                "lanes": 56,
                "work": 32,
                "traffic": 31,
                "cyclists": 27,
                "parking": 27,
                "census": 26,
                "design": 23,
                "vehicles": 22
            },
            "wordCountSummary": {
                "bike": 45,
                "lane": 33,
                "lanes": 14,
                "traffic": 10,
                "parking": 10,
                "work": 7,
                "proposal": 6,
                "vehicles": 6,
                "design": 5,
                "route": 5
            },
            "fullTranscript": "Madame, chairman of the board, Marie Tony Olli. Yes, the meeting is being recorded. Can we all just recite the Pledge of Allegiance? Please I pledge allegiance for. Thank you. If you could, because I believe you might hear what you said. Please her pain. It's the district attorney on I know I'm, looking for her name right now, Madam District Attorney! Are you on the recording at this point? There are several phone numbers under panelists. Can you acknowledge yourself? Mari I do not acknowledge that she's here at this point, I'm sorry Madam, Chair, Oh, miss Marie. You are muted need to unmute yourself. Is the presenter here going to the goldfish I do not see them arriving as of yet we do have the person from the Census Bureau here, if you'd like to go in that direction and start that way. I'm cousin, Denise Vista, with Amato Law Group I, was not able to hear the chair for a while apology and Rob Heineman with goldfish was also here as well. Everyone. My name, is Denise Vista I'm with the law firm of Amato law group. We're here tonight in connection with goldfish Swim School special permit application to the board of Standards and appeals they're seeking a special permit, pursuant to section 73:36 for the Swim School to be located at 33-, 12 36Th Avenue in Astoria. The property is located on the southwest corner of 36Th Avenue and 34Th Street, and it is zoned M, 1- 1. Currently, the property is improved with a vacant two- story, building that some of you may recall was formerly utilized as a nightclub. The property owner has filed for and obtained work permits for Exterior renovations, which are slowly getting back underway, as well as interior renovations for the Swim School. The area surrounding the subject. Property is a mixed- use, there's some light manufacturing, commercial, retail, some multifamily dwellings and some educational uses and the Swim School will be located within the within the building. It will consist of an approximately seventeen hundred and eighty- one square foot. Swimming pool, they'll be drying areas, rinsing areas, there'll be a spectator area. I see that Florence's. Yes right now, yeah. Thank you so once she brings that up, you'll have an idea of the floor plan for the school, but so, while we're waiting for that to come up, I can just tell you a little bit about goldfish, so they specialize in swim instruction for infants, toddlers and children from basically the ages of four months of years olds. The most popular age group is between four and six years old. The class ratio is for students to one instructor, although semi-, private and private lessons are available. There are always three lifeguards on duty when the children are in the pool and for those of you who have video it in Florence. If you could maybe just go back to the floor plan on the second slide. Thank you can get an idea of the layout, so you see the pool those small wares just to the south of the pool or is the viewing area for the parents and the spectators. There is the drying area, the changing Hut's for the children to change after the lessons, and maybe if you just want to go to the photo, then so you get a better idea of what the swim school will look like these photos are taken or another. It said that was muted at an existing Swim School in Farmington yeah. We do I do not usually when I speak, I'm, sorry, so I'm getting back to the swim school. So, as I said, there will be there'll, be four instructors. Excuse me for students to one instructor, there's always lifeguards on duty, as you can imagine, that's very important, and if that I'll, just so the Swim School that you're looking at here, like I said, is it is in Farmingdale in Long Island's. There is a second one in Garden City on Long Island as well, and then there are two approved schools in the city, one in the Gowanus section. Excuse me a Brooklyn, and these seconds that was received in Turnpike you're gone LAN Oaks received approval from the BSA in 2009 issues, so with that I just want to give a short. Yes, thank you so much Michael, okay, too heavy on Elizabeth. Did you have any questions? No I have no questions. If there are any questions, I can let you know what the what the committee had discussed. Unless you want to go to the questions. I have a question in ours when there's not being used for the children, will it be available for adults and the other part of the question is: do you have any accessibility for you, wheelchair users to use that pool whether they be children or adults? We will have Rob Heineman with I'm goldfish respond to those questions rather I believe you're on the I am I'm here Denise. Thank you. Yes, with respect to the first portion of the first question, you asked no, we are. We are specifically engaged in teaching young children how to swim. The pool is purpose- built for that for that endeavor and we do not offer any type of adult swim classes. Just so you understand, the pool is four feet at its deepest point: a tapers to about three feet: ten inches on either end and we keep the pool water temperature at about 88 degrees and the amp our temperatures at about 90. So we're trying to provide a nice environment for young children and teaching them this life skill and then, as it relates to the pool being handicapped accessible. Yes, I believe on the floor plan. If you go back and look, you will see a notation, but code does require that we have an ad a lift available for use for anybody who is in need of such equipment. Okay, thank you. Zone chlorinated salt, water. What's the composition, how is good? How is it going to get discharged and also what about venting who's? There are you? Do you have been singing available, so I'll take the first part of the question. It's a typical chlorinated pool. We believe that to be the safest and most sanitary, we do utilize a self- generating chlorination system, but essentially it's what your you're used to and what's been around for a long period of time and then as it relates to ventilation. The pool area itself is governed by humidification unit and that dehumidification unit obviously allows us to discharge invent and circulate with the open air, just as the customer area will be with respect to the rooftop units serving that. Thank you question. Marie Dominic, hey Sir, Robert Dan's question had a two part about handicapped accessibility and I did not hear the answer to that. Yes, the it is handicap accessible pursuant to code were required to provide a lift, an ad, a lift which will allow anybody who needs that to have access to the pool, and will that so then the entrances is a code compliant for, as for a new use right, yes, so in actuality, the envelope of the building is being renovated. Currently, by the landlord and as a part of that renovation, they will be providing a an ad, a accessible handicap ramp along 34th Street, which is a main entrance to the Swim, School and 88 bathrooms, and all the ADA requirements as if it was a new use correct. It has to be because it's a new build. That is correct, though everything will be 88, compliant all bathrooms, changing Hut's etc. Thank you does anyone else have a question: okay, the recommendation at the Menus Committee is that correct, yes, okay, I, understand, Da Katz is on the line so good evening. Everyone and if she is welcome good evening Marie nice to see you, hello Florence. How are you all of you know? I came on just to see all of your living rooms. That's the only reason I came on so I could see your kitchens your living rooms. It is good to see everyone. First of all, let me thank the leadership for the work that it does Florence and Marie for guiding. So many and all the work that you're doing it is amazing to me that there's coated there is all the responsibilities of taking care of our relatives hold on. One second guys give me a second okay. Thank you, those responsibilities for having children at home while doing our jobs, taking care of our parents taking care of ourselves home schooling, which anyone who is homeschooling I'm with you right there. It is one of the most arduous part of this process, but all of you continue to do the work on Community Board, one you're still zooming in you're still doing the work that needs to be done. You're still doing your voting, you're still working for the people of Queens, County I think it is remarkable and I. Thank you for your true dedication. You know I now the District Attorney now about five and a half. Well, since I have been the District Attorney we've had the bail laws changed twice, we've had the discovery. Law has changed twice, we've gone through a pandemic. We and we're still going through it. We have a national crisis when it comes to equality, acrosss, the country which I have joined in full force, and we are here today trying to reopen the district attorney's office and moving on. So it has been quite an amazing time for us. So, first of all, you know I welcome everyone to please follow my district attorney accounts on Facebook on Twitter. You will see my speaking out on George Floyd on the police officers from Minneapolis on the equity that needs to enter our system and all the work that we are doing on it. I've been very outspoken about it and I look forward to people actually viewing it and following the page that you can keep up- to- date. But in the meantime, during all of this, that is happening. We have 700 employees at the DA's office, 320 lawyers and the rest as support in various capacities, mostly paralegals and CPAs. We have formed many bureaus for the protection of the people of Queens County. One of the first things I formed is the conviction Integrity Unit. It already has over 40 cases that it is reviewing to see whether we have innocent people in jail to make sure that we are reviewing the cases where the fresh eye I hired a counselor, an attorney from the Innocence Project to make sure that Bureau is run properly. We have also started the cold case Bureau because, as you as you find, people were innocent, they are now cold cases, and so sometimes that works together. Sometimes it does not you'll see every week or so on. My Twitter account. It asks you as people who are following it, whether you know anything about the cold case that were investigating, and it's quite interesting to see. Some of them are from the 80s. Some of them are from the 90s, and so please take a look at that. We've also found the housing and worker Protection Bureau. That Bureau is specifically to protect workers and specifically to protect those either in the workplace documented or undocumented, who feel that they need protection or feel that there's no other way to report any wrong doing, and so we are looking forward to that Bureau growing. It also goes down to work sites by the way. So, if you're working on a work site and there's a death on that work site, we send down an ad a an investigator that has experience in engineering or construction or management so that we're not totally relying on the site inspector for the information we've also formed bureaus of hate crimes and the Bureau of hate crime now has its own leader, its own bureau chief. It used to share a bureau with another unit. It now has its own Bureau to try to go after those that prey upon us for who we are, who we love. Where we come from a religion, we practice all that comes with it and they are in a very aggressive Bureau, and so please, if you know anybody or you have any hate crimes, please feel free to report them. At the same time we have arraignments, we have everything that is going. We are doing it all virtually right now. The only thing that happens, on- site every single day is arraignments and most of the executive staff and Chiefs are on site. But we do the arraignments on site because if anything goes wrong, we want to make sure that people's rights to an Iranian more than 24 hours are never violated. Then if the ideas are at home, we can't do that. So we do it on- site. I. Just would like to point out a few things. If I can I domestic violence, we believe is under reported to a very large extent. We believe that people are trapped in their homes. There are no police that are stopping by the homes, which is normally the case, or if you had reported a domestic violence occurrence, someone was prosecuted for it. We know that you're a victim, normally the police, they would come by your house, but now it's a pandemic. That's not happening and they're doing everything they possibly can I believe that, for the sake people, but if you're not in a house seeing the children seeing the victims, it's hard to sometimes catch it, so please check on your loved ones, also check on those that are alone during this pandemic. It's very difficult when you are is not- and you know, there's no family with you I'm very honored and I'm very privileged to have my two children with me every day, but not everybody has that so please check on them and at the end of the day you know we are here for you still just because I'm in another office, it's a different type of job. We are still here for the community and working with the community in different ways. I am starting to form the pre- trial diversion programs. They got a little waylaid during the pandemic, we're working on making it so that you do not have to plead guilty for drug rehab or for mental health illness or, if you're, a veteran veterans court that you do not to plead guilty to get there, and so all these things are happening at the same time. So, please, you know I just want to thank everyone for the work that they have been doing. I do want to encourage everyone to vote, no matter who you're voting for I. Do not care I. Just want you to vote. You know we are worried about the turnout. This year we have different types of voting for the first time, early voting and absentee voting. So please make sure you do that and I'm sure you've heard from every single elected official to please fill out the census. It's urgent that you do that. It is just so important for us to get the funds we need for education, but that's not why you had me on the call so I'm just going to say thank you for all the work that you are doing and please we are here, follow us on Queen, CA cats on Facebook Twitter and keep in touch with us. If you need us we're here, I'm happy be happy to cut answer questions if you had any cats, I'm, sorry, Murray district, Ernie cats, well, first off! Congratulations! I have not seen you since you moved into your new office at home as it were, but I have not seen you correct congratulated you on your victory. I would just like to throw in that the jury. Duty experience is something that is commonly held in Queens as being one of the most miserable things that can happen to you and my own experience of standing in front of Bernal Hall in the rain for more than an hour at 7 o'clock in the morning is something that I can tell you about in person. I won't waste everyone else's time, but I would ask you to pay some mind to when jury duty starts back up again to keep social distancing coded in mind and also to try and figure out a smoother system than the one we currently have I appreciate the thoughts I will talk to us, talk about it as well. You know the county clerk as well, but thank you and we are anxious for juries to start up. You know grand juries, I can't hear you cut out their ego mom for those. Thank you for letting me know. I will talk to the clerk the county clerk as well. You know we control a lot about juries and grand juries, but not everything so I try to work together to make it a better experience, and you know I'm anxious for grand juries to start again. There are people who are having preliminary hearings right now, instead of grand juries. Grand juries are absolutely the better process and maybe the rights of having a grand jury exists. So we are looking forward to them starting again and I will keep it in mind. Thank you. Would anybody else, I guess the DA in question. You have questions in chat Marie. Please look at your trap. I'm looking also and Kathleen have questions Marie I'm asking heavy to her question. Why are you there was before me though? Channing was before me. Can you hear me George or let's see you, can you mute your computer? Please George Alexei I think I'm more I to know that the mere get on a mute we can hear the background. George I do yeah Kathleen was before me, but I guess I'll go and maybe after me, okay great. So you know a few months ago, it was reported that the one 14th precinct had the highest stop- and- frisk rates in Queens and I'm. Just wondering whether or not there have been any conversations with them about that. Since stop and frisk is illegal, so I'm just wanted your talk, so we have not had reports are stopping first there. Well, we've had his reports of COBIT violations. So what was happening as people were getting arrested or dat for not social, distancing, I said I refused to prosecute for that, and so they became much less very quickly. Since I was not going to write them up and I was not going to prosecute them. Then we had the curfew, which also I said you do not want that being used as an excuse for stop and frisk. So I will not prosecute for curfew violations so that came into the office. Also they were 343, they were dismissed. If that was the only thing we were prosecuting for we were done with that. It was not going to happen. Protesting I, always say people say to me. Was there any arrests for protesting? Is a constitutional rights? You do not need to give anyone permission to protest and we did. We actually came out from the protests which we also dismissed so at the end of the day, I'm happy to talk to the 114 and see if there was any reports that we should know about, but that's how we handled it. So we handle it way. That said, we were not prosecuting normal men, you have stop and first they use it as an excuse right. They use something else as an excuse and since I said, I was not going to prosecute those other things. We've had less and less right, no I! Thank you for that. I was actually referring to pre Covid-19. The report that came out pre Covid-19 about the 114Th having the highest, stop and frisk rates, and do you know where that report was I? Can yeah I mean maybe in February that it came out so and Alissa see whether it's still happening right? Also, we can look back at the incidents back then, but we can also, you know, keep a watchful eye on. What's going on right, now-, oh and captain Iman! Now, if you had a question? Yes, actually, first, we did hear that you might have contracted the virus and I hope that you're over it and that you're not having any lingering effects. I'm. Okay, thank you very much. Ma'am I did that's good here. Secondly, when people actually are arrested and brought in, can you tell us what kind of social distancing and sanitation procedures are being used as they're processed and, if they're being held, you know for hearing or something like that, because we do know that right now, the Kovach spread is very dangerous in places where people are held in close confinement. Sure. So you know the interesting thing about running many offices in my life and in my past life is that we actually saw this coming very early, so we started realizing that grand jurors we're not showing up a lot earlier than a lot of people realized it. And so we started taking steps to make sure that if we had to go virtual to keep everyone safe, including defendants, that we could do it almost immediately. So we got virtual for everybody. The a DA's, the defense counsel, the defendant and the judge. We're all virtual and what would happen in processing is if they showed symptoms of Covid-19, they're normally processed through Rikers. If they had to be pricey, not Rikers, Red Hook, if they had to be processed at all or Manhattan, if they showed symptoms of Cobra, if they did not show symptoms of Kovin, they were normally and processing on their own with social distancing and then transferred to Rikers. I will tell you that, after, like after the Co vid started, we let out about 200 people from Rikers, so we did about thirty on our own. The first few days with the Defense Council, where we just decided and made a decision that someone who is doing a City sentence at Rikers. So if they were sentenced to six months- and they did five months- you know- and it was not violent crimes or sexual abuse crimes that we redid time served so that they could social distance better and then there was about 120 or so there were parole violators and if they were not offenses that we would prosecute for or prevail on, we said we have no objection to letting them out so I think. With all of that happening, we have done our best to social distance. I, think the correction officers osea the office of Corrections Administration Court Administration did their best as well, and we were lucky that we saw it coming so we were able to set it up. Thank you, I think we have more Indian Alberti. Did you have a question? Madam chair a question? Okay, yes, I have a question: how is an Ala birthday here? Can you please Budi is speaking right now, one so good! We appreciate everything is which you do not. Now everything changes many things about the safety of the people. You can have a handful, they deal with it and that Ping's is going to be a change and honey Serfaty of the people. What do you think about that? Did someone else here? Maybe so better I did not really hear everything. Were you Rudy? Were you asking about changes? The strangest police, the company's fine, but you know state and government- and the ones going to be affected on the certainty over the people. All these changes, I think you know you're going to have a big job, stable I think it is a big job, but I think it's a big job for this country. I mean there's a reason. There was such anger in the streets of the United States I mean you know so immediately with George Floyd I think it brought out a lot of past inequities in the system and I've been very clear about it. When I rallied a few times, you know and went out, but also we put our money where our mouth is by not prosecuting for a lot of things that I thought should not be prosecuted on lower level crimes. I think there's going to be differences and I think those differences are good, I. Think at the end of the day, though, equity in the system does not mean it's less safe. Equity in the system actually means it's more safe to make sure that we are utilizing resources. We have to get younger people out of the system to make sure that we are training police officers to approach people in a better manner to make sure that acrosss the country they realize the system has not been very fair and it's been a lot of inequities, acrosss the board and I think the one thing that is amazing about all these protests. That happen is number one I think you're going to see a lot of good changes in the system, while still making sure we're prosecuting. You know we have a lot of shootings that are happening in the borough of Queens County. My numbers is especially in Queens South I prison. You know we need to make sure that we keep our streets safe, but at the end of the day, I would argue that trying to get people out of the system and trying to do pretrial, diversions and teaching and cure violence and drug rehabilitation, and all of that, when we hell is probably going to keep people safer than they ever did before. Good question I have a question: yeah I got time for two more I'm, just letting you know, yeah I wanted to ask about the hate crimes Bureau and does the hate crimes Bureau deal with issues relating to crimes perpetrated against people with disabilities, and if it does, how are you out reaching to organizations for people with disabilities to let them know that I think we should do that more so, whether or not they attack you because of your disability and I. Think, at the end of the day, something may not be a hate crime or it is, but we should be prosecuting for those that are targeting those that are disabled, so I'd love to work with you on that and are reaching out to different organizations. I think that's a great idea. I mean I contact you on the instrument yep. So let me give you my direct email goes right to my phone. Is cats at Queens Da? Okay, very good! Thank you! Okay! This is Richard cuz I mean how you doing Melinda very good one question: what's the DA's position, the quality of life issues particularly having to do with outdoor dining and alcohol being served outside, and some of the rowdy is not that we've been singing and also I'd, like your take on why it sees many of the demonstrations that have been happening in Queens have been pretty violence free compared to the other boroughs. And what do you tribute that to I do not know what I attributed to I can only say this to you between me and between me and the borough, president and police and the Cure violence groups and the protesters we've been in contact a lot and so whether that helps at the end of day or not I do not really know, but I do know that when we had issues we were able to call up people straight away and say what's going on out there and how can we help and I do think that camaraderie is somewhat helpful at the end of the day, but I can't tell you that's the reason. I can only tell you that it was much more safe here. Protesting was active and thousands of people in Queens County were protesting, but you're right we did not have the looting. We did not have the arrests for protesting some of them. Maybe that I refuse to prosecute some of that, and maybe you know it's calmed things down a little bit, but I do not know the answer, but I think it's. It says a lot for our communities. I will tell you that the I have not gotten any cases on outside dining and all of that I just have not gotten any cases on it. I can't see a world in which there would be a priority for me to prosecute, but I do think in neighbors neighborhoods. They also can't disrupt communities and so I think it's a balancing act and I'd have to look at each case that came to us. Okay, thank you. We just have not had it. Yeah thanks had a blast watching comes in public, that's Da have any plan in targeting placard abuse, look 88, violations by the 114 and 108 three things. A DA violations would not I believe come under my purview, but we are more than happy to help look into it. Yeah I've never been asked that question about ABA violations in a building in a city building. It would most likely be the Department of Buildings that should be notified on any of those violation of the penalty. They've, considering this placard abused by the 114 and 108 three singers, I'd have to look at the cases. I have no idea, I. Think look at the end of the day. The problem really is not if a police officer has a placard or someone has a placard, they're only allowed to use it in certain locations if they're not doing that, we might be able to be helpful in getting them moved and making sure that they are following the rules. So I'd be happy to try to help someone that has individual issues like that. Please email us we're happy to help as long as we can and we'll work on it together. Okay, thank you. We you gave us kindly your email address, so anybody would any further question. I'm sure will email you. So thanks for the time and Murray I will go Murray just so you know in Florence there will be someone at your community board from the DA's office every month, so we will now have a representative there to take back any constituent issues or anything that we can be helpful with or even if you just need information on a case or something like that, we're happy to help within the purview of how we can it's cats at Queens, Da, DOT org. Thank you. Thank you for being here. Thank you. Thank you pleasure my pleasure. Thank you. Thank you good to see it right. Next up is project manager. The device unit of the Department of Transportation, miss Eileen Bochy. Are you here, I mean yes I'm here, Sir just a point of order. There's somebody posting in the chat box. As me. It's not me I, it's very helpful information, but I'm not posting it. Okay, thank you for sharing that Helen. Okay, I'm. Sorry I'm miss Botti movie presenting the Crescent speed protected bike lanes. Okay, thank you. Can you all see the screen of that working? Well, yes, great thanks. Everyone we were happy to be here tonight, share our proposal for the Crescent Street protected bike lanes. My name is Aileen Bonnie I'm, a project manager with the bicycle unit. Awesome with me tonight is our deputy director of the bike program Shaun and Macias, as well as representatives from the Queensboro Commissioner's Office. So this presentation has a lot of detail. It should take about 20 minutes I'd like to hold our questions until the end we're going to share some of the background on. Why we're proposing this route and some of the details on what the project looks like how it would work? So, hopefully, a lot of these slides answer your questions, but I can always flip back to them afterwards to further clarify. So over the last few years, we've seen a growing interest in cycling in Astoria and improving bike access throughout the area, starting in the summer 2017. With the introduction of CitiBike, we saw a lot of new people riding and in the first full summer of CitiBike being in place 2018 there was a tremendous amount of ridership from that system. We continue to hear some interest and growing interest in connecting cyclists to the various bridges throughout the neighborhood and out of the neighborhood, particularly the RFK Triborough bridge and the Queensboro Bridge. Many of you may have already been aware of this plan, but last summer Duty released a plan called the Green Wave, a plan for cycling in New, York City, and although this is a conceptual level map on the screen, that's included in the plan. It does include a protected bike lane that runs north- south in Astoria, and so overall, this plan calls for building out a connective network throughout all five boroughs to link neighborhoods together, and so we are here to make good on that commitment to bring a protected bike lane to Astoria. So when we look at protected bike lanes, we've gathered data over the years to show that there are significant injury reduction, all user groups- that's people, driving people walking on people biking and that protected bike lanes are where we have the data to demonstrate this change, but overall there's a 15 percent drop in crashes, with injuries for all those user groups and when we look just at the pedestrian crash data, that reduction is even larger, so it makes a big difference for people driving, walking and biking. Not just cyclists, and the photo here on this slide shows a bit about. Why that's the case, protected bike lanes can help to calm traffic, shorten the crossing distance for pedestrians and calm the turning vehicles with some of those painted markings that you see with the islands. So this map shows the existing bicycle network in Astoria. What you see here are not the blue lines are the standard or conventional lanes. Those are just the striped bike lanes that run next to the traveling. The pink lines are the shared lanes or sharrows, which are helpful for connecting different bicycle routes together and the dark green lines are the protected bike lanes. Those run mostly along the waterfront along the west side of the neighborhood through a story a park and also the northern edge of the neighborhood on 20th Avenue and down at Boyd, Avenue north, and so the neighborhood is challenging to navigate as a cyclist. There are some streets that do not continue all the way through some destinations that are just tough to get to so our next step in building off the network is bringing a protected bike lane to the middle of the neighborhood and also building out some additional connections. So people can reach that protected lane to start thinking holistically about how to do this. We started a workshop process in February on this year and we hosted this to gather feedback about the routes and designs and various destinations that people wanted to connect to. Prior to the workshop, we conducted a pre- meeting to speak with Community Board leadership, some representatives from elected officials, the workshop included different exercises with maps for participants to jot down their ideas, show different routes that they're interested in. We also talked through a lot of photo examples of other projects to basically talk through what was possible to bring to Astoria, and so the workshop was heavily attended. We had more than 120 people attend. This workshop in February vast majority were residents of the district, and some of the themes that we heard from participants were an overwhelming support for a bike lane that connected the RFK and Queensborough bridge together this bridge to bridge connection specifically on Crescent Street. We also heard a general preference for protected bike lanes were ever feasible. Instead of standard black bike lanes, we heard an interest in more east- west routes. In addition to north- south routes and in terms of design. We also heard that there was a desire to see intersections improved so that there's better visibility between people driving and cyclists and pedestrians. The number of elected officials have shared their support of a crescent street path. Making these bridges and another theme that we heard at the workshop was Mount Sinai Hospital, which is on Crescent Street. There are a lot of questions about how this would work in front of their building and so we're continuing to meet with them and discuss how the design would function at their location. We've spoken with them since February several times so also at the workshop. In addition to this broad overview of where people want to connect to and what these routes would be, we talked about two different design concepts for a north- south protected bike Lane. The first one is Crescent street number, one on the map linking the two bridges together. The second concept was 31st Street under the NW elevated tracks, we're presenting the Crescent Street proposal tonight. Some of the reasons why or that this is a simpler or more standard and that we can implement when a quicker time frames it's less resource- intensive, whereas 31st Street involves significant, concrete construction for singles, like boarding islands. Also Crescent Street is something that's been in the public eye. Remember a lot of interest in this route. People have been talking about it for quite a while, and it's widely supported by advocates, as well as area elected officials. So this map shows how a conventional bike route network and a protected lane along Crescent Street would fit together. So at the workshop, in addition to speaking about protected bike lanes, we also shared plans for a an expansion of the conventional and shared bike lane network. So what you see the thin purple lines that are dashed demonstrate where those connections would be. We have that information available online on the workshop presentation and I also have that tonight. If there's any questions on any of those routes, those are simple bike lanes that do not change the travel lanes or the parking lanes just very straightforward, and this would complement a Crescent Street protected path. If you're riding north on Crescent Street cyclists can continue on to the RFK bridge, bringing you to Randall's, Island and continuing on to the Bronx. If you're writing stops on Crescent Street, it links you directly to the Queensboro Bridge, which is the main access point into Manhattan for cyclists in this area. So recently, D- O- T has been introducing temporary bicycle routes throughout different neighborhoods in the city to provide quick short- term transportation options for this time, when it's challenging for some people to travel by subway and bus when those options are limited and we do expect to see more people continuing to ride as this goes on, it allows for people to social distance. There's also been tremendous amount of delivery. People are receiving, so bike lanes help facilitate those. Currently, this is a work in progress. We have started installing this between Queens Plaza north to 34th Avenue. This involves barrels and signs. It's very temporary we're continuing to work on some adjustments that we can bring more signs complete some temporary markings to really clarify to drivers and to cyclists how this is supposed to work. As I mentioned, it's challenging the barrels can moved so we have limited staffing but we're getting people out there to adjust the barrels move them back into place, hang signs, and so the temporary design is actually somewhat similar to the standard design. I'll share. Next of what our permit proposal is. Essentially, it involves either repurposing a parking lane or a travel lane into the to a bike lane, and so, as I mentioned so far, the barrel lane is in place between Queens Plaza North to 34th Avenue, the first block. We use the additional travel lane on the east side, that's repurposed into the bike lane and then the majority of the project is the green line on the map from 38th up to 34th Avenue, where the parking Lane has stripped it off from the curb in place of that second travelling. So the bike lane is separated from the travel lane by that what we call a floating parking lane and so to get into our standard proposal to the design following the temporary route. Preston Street is a commercial and residential corridor. Some of the challenges along this corridor include the lack of a dedicated space for cyclists, especially on the portions, where we have not been introducing the temporary lanes. Yet it's not clear where people should be riding without the markings and so on view blocks that are wider and you see in the photo on the left. This is a wide roadway with two lanes, two travel lanes and two parking lanes and all that extra space really allows for vehicles to pick up speed, creating and unsaved condition for cyclists and for other road users. The photo on the right shows some of the more narrow blocks and in those locations, there's limited width and it's quite uncomfortable for a cyclist or a vehicle to pass one another as a space is very constrained. So the project route of Crescent Street is located in a vision, zero priority corridor, which means that it has a relatively higher rate of crashes involving pedestrians, and so this is a high crash corridor with nine people killed or severely injured over a five year period. The chart in Grey shows the different user groups. Pedestrians, cyclists, people traveling in cars, and what you can see here is that people all different types of users are experiencing injuries along Crescent Street and, as I mentioned earlier, these complete street redesigns really bring the ability about in the potential to reduce some scratch race. Well, we have the data to prove that these types of designs that we're proposing tonight and that we've installed previously over the years, how that trend of 15% injury reduction, so the majority of our project proposal includes a parking protected bike lane and before we show this. The cross sections for this I'd like to explain what that involves. So these two photos generally shown that the parking projected bike lane includes a bike lane running along the curb this specifically as a two- way bike lane one in each direction. It then, is separated from the moving vehicles by a painted buffer in a row of parked cars so rather than a barrier, it's a row of parked cars that provides the separation from the moving travel lane. This design has a number of benefits. It can calm traffic by using a more standard traveling with short drivers. It makes it more predictable where pedestrians and drivers can expect to see the cyclists, because they have a designated space in the roadway, and this is a more user friendly design for people of all ages and ability. So it'd have that ability to invite new cyclists, it's more encouraging for people to get out for recreation. But importantly, it's also an important it's a commuting route. So it creates a new transportation connection at a really important time, as I mentioned earlier, that we expect to see a lot more people starting to ride as their main transportation choice. So going through the different project segments will go back by block these sections are broken down based on the existing conditions of the street, so we're going to start at the southern end and we'll work our way toward the north. So the first segment is two blocks between Queens Plaza, North's and 40th Avenue on Preston Street. These each have a different design, currently Queens Plaza north from 41st Avenue, and that very first block after the Queensboro Bridge we're leading to the Queensboro Bridge has three travel lanes, two lanes that go straight onto the bridge and one lane that turns right onto Queens Plaza. North I should mention that in developing this proposal, we've conducted traffic analysis, taking into account the traffic volumes the turning movements, the signals to ensure that this design is something compatible with those volumes from what we saw during that traffic modeling is that at this location, at Queens, Plaza north, the right turns are very light, so that right turn lane is very lightly used. So the proposed condition repurposes one traveling on the east, curb into the two- way bike lane, and then it combines the other lanes together into two. So people can still turn right onto Queens, Plaza north, it's just a combined through and right turn. What this does is also cleans up the intersection. This is a very challenging location. As many of you know a lot of times, people will use that third right turn lane to kind of jump ahead of the other cars, and then there are three lanes merging together into the intersection. So by simplifying it and bringing it down to two lanes, it actually cleans up that interaction and should reduce some delay there. The next one between 41st Avenue to 40Th Avenue, currently has one travel lane and parking along the West curb. So in order to provide some additional capacity and take off some of the pressure in case there are backups leading toward the bridge. We are introducing a second lane in the performance condition along the West curb so with these two blocks combined in the proposed condition, it actually creates more consistency from block to block from blocks have two travel lanes as well as the bike lane, and this should also take some pressure off of what some drivers do when they block the box and things like that. The next section is between 40Th Avenue to 38th Avenue and also at the northern end of the project, from Newtown Avenue to Hawaii Avenue North. Currently, there is one traveling with a person layin on each curb our proposed condition: repurposes the parking lane on the East curb to the to a bike path. The photo on the upper right shows an example of the existing conditions, it's quite narrow for cyclists traveling in two directions, with the parking on both sides, so the proposed condition would mirror the image that you see on the lower right. What this uses here is a painted buffer and flexible delineators to separate the vehicles from the bike lane and with the parking along. The other curb the flexible delineators here actually allow for emergency access for emergency vehicles if there is a need to pass them since there's only one traveling. The next segment is the largest portion of this project, and this is that parking protected bike, Lane design we talked about earlier. This is between 30th Avenue to 30th Avenue, where there are two travel lanes as well as parking on the East Curb and the West curb the proposed design repurposes, the second travelling along the East curb into what we call floating parking Lane, and that is very similar to what you see in the photo on the lower right, where they're still loading and parking on the East curb. But it's pushed off in the curb- and this is also what we've been already introducing with the temporary bike lanes with the barrels. So we've been able to take a look at some of the interaction of how that's working as I mentioned earlier. We did look at the traffic volumes and turning movements and so at key locations where we saw that there is more traffic along this stretch, we're planning to introduce some right turn lanes, leading up to the intersections, as well as some rush hour regulations on the West side to alleviate places that have a little bit more traffic. But generally, this is the cross section that appliance to that whole segment. The next section, the last section is between 30th Avenue to Newtown Avenue. This is a short three block segment that is a two- way street. It's the only portion of Crescent Street. That's to way so it's in a bit of an anomaly. When we looked at the traffic data, we saw that very few people were travelling north as opposed to the vehicles traveling south most of the traffic was southbound and there were very few vehicles, turning right off of 30Th Avenue to the north. Additionally, there are other streets directly to the East and west of Crescent Street that allow from northbound access, so there are still options for circulation throughout the neighborhood. The proposed condition mirrors the same section that we previously just shared. It's that parking protective design of parking on the West Curb loading parking on the East curb with a single travelling in the middle, and so this creates consistency throughout Crescent Street and we basically repurposed the northbound lane into the floating parking lane at Mount, Sinai Hospital they're, located at 30Th, Avenue and Crescent Street. So they do have an entrance onto Crescent Street, as well as 30Th Avenue and some loading in the rear. Since they have some unique loading needs. We proposed some special markings that would accommodate their needs. So throughout the city, when we've installed protected bike lanes at unique locations such as hospitals, Health, centers schools, hotels that have some different unloading and loading needs for passengers, we use special. So typically the bike lane is green. So one of the things that we propose here that's different is that we do not use green paint. It's something that alerts cyclists that something different is coming up. We also paint a wider space than the buffer, so we shrink the bike lane a little bit shrink the parking late a little bit. We provide a wide area where people can eggs with their vehicles in that tan paint that you see in the photos and in the cross- section. Some of the other warning markings for cyclists, Chevron's, crosswalks, yield, teeth and importantly painted rumble strips. This is something we've used in a lot of locations that it's a few layers of paint and it's several stripes, and so when a cyclist rides over it, they can feel several bumps and it alerts them that something is changing ahead, that they need to pay attention to. So, in our conversations with Mount Sinai we're working through some of the finer details on some regulation updates and some design updates to this that will meet their needs and ensure they can continue their operations optimally. So, when does redesigning the street to include the parking protected bike lane, it allows for an opportunity to introduce pedestrian benefits at the circles that you see on the map in orange. All of those intersections we are able to install painted pedestrian islands which help to shorten the crossing distances and also something that we call offset crossings which you see in the photo on the lower left offset crossings are a design that includes a longer painted pedestrian island that opens up the sight lines and also markings and some vertical elements that really slow down the drivers as they take that turn so in this photo. If that vehicle were turning right, they would have much better visibility and be slowed down in advance and be able to see that person crossing with a stroller, as well as the cyclists traveling through the intersection, so something that really cleans up the intersection, but also allows for an area for vehicles to queue as they wait down at Queens. The north and Crescent Street there's also an opportunity to realign the curbs and build out a curb extension to help clean up the intersection as well and improve some of the queuing between the bridge and the Green Bay impressive Street. So we just shared a lot of cross sections. A lot of different sections and I just wanted to give you an overview of how our proposal actually really breaks down into two different design types for the bike lane. There's a parking protected bike lane. That's shown in green on the map between Newtown Avenue, all the way down to 30th Avenue, and that mirror is the photo that you see on the upper left. And then the rest of the project on the northern and southern ends is the delineator protected, Lane or Lane separated with different vertical elements, and those are the narrower blocks. So I'd like to share a few more details just and how the design works. So in places with existing driveways, the driveway access is maintained with markings, as you see here, those dashed markings in the photo and in the diagram, and it tells cyclists that there's a driveway coming up, but it also shows drivers appe have a lot of room to enter and exit their driveways with all of our projects. There's an opportunity to improve crib access through visiting any curb regulations or meter updates. If there is interest we're always able to look into that as well as potential for loading zones and other tools, and generally as I mentioned, we are adding some of the right turn lanes and some of the rush- hour lanes, there's different places where the street opens up a little bit more than just the single travel lane. And so one of those examples is at these drive waves. There's some extra flexibility where you know a vehicle could pull over to drop someone off without blocking the traveling, but without encroaching on a bike lane as well. So overall, our proposal seeks to connect the Britta's together. The RFK bridge in the Queensboro Bridge closed different gaps in the bike. Lane network provide better wayfinding, história and the challenging street grid, and we better connect cycle throughout the area. We hope to begin implementation of the protected lane and the conventional and shared lanes in 2020. We continue to explore other opportunities for additional routes to the East West as well. At this time, I'd like to open up to questions I have a question is he's on his way in to turn up yet ok, yeah I have a question about inclement weather, snow ice, sleet things like that on the lanes that have the vertical elements between them and the debt and the curb will a snow plow be able to get in there. How will that be cleared for people to use the lanes on this design? We do maintain enough clearance for the perfectly protected section and also the delineator section, and what about the vibrating, the bumps on the surface, where it's not smooth? Will the plow scrape that off when it goes over, so we've used that a number other number of other locations throughout the city? To my knowledge, that has not been scraped away from the plows, if it does, if markings are worn away, you know we work to replace those, but generally they're, pretty long- lasting for this, and the green paint has a textured quality that lasts through the winter very strongly. With this material that we currently use. Tommy I have a question. My question is yes what you're throwing okay? My question is in sections: they need to be protected, the same way the actual streets are and it's you know. You often have conflicts between vehicles and bicycles and pedestrians at intersections, particularly when they're making cars are making right turns. Bicycles are going straight through the neighborhood that there are other situations like this. You know, we've always felt that I've always felt that no protected bike lanes should be built unless it has traffic controls. You know I've seen some of them on Second Avenue in Manhattan places like that, but I think that at this point, since bicycles are going to become such a large part of our transport community for the foreseeable future, I think we start. We need to start to build infrastructure that promotes safety, not just on the streets, but also through the intersections. It's been very dangerous and there's too many times myself as a driver, I've made a right turn and we've had a bicycle. Come up on the right- hand, side what people are most drivers traditionally have not been taught to look now. We are learning to do that more often, but disasters have been sold close so many times and I really think this is just as important as putting up Jersey barriers. Thank you. My question is, am I sorry for I get sorry? I did not get an answer. Yes, so what I wanted to explain again is the intersection design that is included in this proposal. It will be on the other side of the street here it's on the right side of the street. What this is it's an offset crossing, it's hard to see it in this photo, but this is a longer pedestrian island that opens up the visibility for people making the turns and then slows those turns. So this is. This is a newer treatment that has been included in some projects throughout the city, but you may not have seen it yet at some of the projects you've traveled through it will include more markings such as some of the green bars as well. That really highlights to people driving that cyclists are passing through and then the turn in a way that their sight lines are improved. Well, I'll have the traffic controls on Second avenue worked out. Is there an issue why the city does not want to continue that practice? So one of the reasons why the bike lane is along the east side of Crescent Street is oh, that turns the left turns which would run acrosss the path or actually a lot lighter, even on the other side of the street. So we do not anticipate, you know heavy conflicts in some of the ways that you would see on Second Avenue, for example, so this product does not include the separated phasing along the whole corridor. Necessarily, this is more achieved with this offset cross in design, hey Alicia, ISM, Olivia and story for 63 years, president of the Civic Association I, had a lot of people have run about the bike. I it's okay, now problem is how many people cause they use. It is society straight for goodbye Julie. Okay, if you want to put him on a Main Street like it only fresh, 730, fresh, three Stanaway Street thought all those commercial profit would be the biggest make. This fine and I think one reason unchristian speak. If you go toys, Avenue and 38Th Avenue is school. We split, there is food side, pardon process, two lanes how they can have the piling. Besides the point hold this item- Linea I know you say that the a what he called the accident interview where he is especially do you have here in Estonia, I, see a historian and I use impression. Freak many times might be once every day, I never see a bike through the between us I say: dead, mass below Otto or even a 41st having to patient, even say a company with the body plus all this money we spend. That is vitally you when important. They break traffic. I use my Farah all over the city of the neighborhood here now. What is the budget I'm not and for this byte link? That's what my purpose is and what is getting a story on what she's been used, especially beside the addresses the now we have a more modest coder for the restaurant in which user they're all over the place. So this is Nicole Garcia, hi. Everyone hope everyone is safe and healthy, I'm, the Queensboro Commissioner for DRT. For those of you who do not know me what I will say is that the materials that Eileen had mentioned they are part of our in- house resources. So you know we can do a calculation. I'll have to get back to the board on that, but these are really in the operating budget. I mean my agency manages all of the East River bridges: we've resurfaced six thousand miles of streets. What I can say cost- wise is that the treatments that we're proposing in this design are paint and delineators and some signage. So it's really pennies on the dollar. When you come when it comes to, you know the budget of D- O- T. The reason why we are proposing this bike lane is to make it safer for cyclists, and obviously you know where we do put these protected lanes down. They tend to be safer for all street users, especially for pedestrians. So you know the cost. Calculation I mean implementation, wise in- house materials. We use in- house crews, it's part of our business as usual' expenses, but what we've really found and I think what New Yorkers really appreciate and what our city needs are safer streets and especially in the time of Covid-19, where some folks are still trying to figure out how they're going to get to school to their families to work. A north- south connection is going to provide a reliable, safer transportation option for the folks in Queens, and particularly in your community board. I do not see and I mean if you want to use it in Main, Street I use it. Yes, I do the whole over what is going on Thank You Helen who's. Next Calvin are you with us Helen I asked question just a minute I'm trying to go in order here right town, but can you on your self? Thank you. Thank you. The there's a pop- up lane now for Crescent Street, which is intended to help us during Kovach, because biking has increased it's very obvious visually, as you're driving as you're walking, there's more cyclists using the Queensboro Bridge to get to Manhattan, that's not being very well maintained and I'm wondering who responsible for its maintenance and how often is being checked in on. Thank you. Yes, so the temporary Lane, as I mentioned earlier, is a work in progress. Still, we have not fully completed it. The barrels do get moved out of the way, unfortunately, but we do have staff rotating through the area to check move the girls back, we're getting more signs posted very soon, as well as some police interference to clarify it has been challenging in terms of the materials and staffing that's available, but now that we're getting closer to more of our typical operations, that's something that we see that we'll be able to improve. So, yes, it's been challenging. It's not always ideal in the way that it's set up right now, but it has given us a chance to see a lot of different curb uses that we can accommodate and design interventions to include with the more standard proposal, so in some way, as we've been able to really test out the new layout as well. Thank you. So this is Samantha Taub off I was the planner for CB one for about five years and now I'm taking on more of a bike role, but just to let you know, I personally am out there once or twice a week. Moving the barrels back and I see what you're talking about. Yes, the barrels are constantly moving around I did drag I. Think about you, know, 15 barrels today into the correct location. So yeah, it's it's an uphill battle. It's very difficult we're trying to make sure that we're out there as much as possible. I know there are a few people from our bike unit that are also tasked with going out once a week. So you know generally I think we're out there probably four times a week, but it is four times a week, I'm getting a confirmation from our deputy director and it is still very difficult. They do move and we're trying to keep a handle on it. So I appreciate that. Thank you. Tom Ryan, you had a question tom okay hold on hold on I just said: unmute, okay, quick question that just came up with a committee meeting, especially you're on the outer world way of Queen's Queensboro Bridge what- will vehicles and there are dozens of different vehicles, are actually authorized to ride. In the bike lane I mean I mentioned one like a Hoover crafts allowed to ride in them or segways allowed to ride in them, I mean that, because, obviously there's various legislation, because you know E bikes, obviously are now authorized if they go with certain miles per hour. What is in what is permissible in kind of the VTL? The vehicle traffic law you know is obviously you know words on paper. We would refer to NYPD, as they are our partner in enforcement. What I can say is things like and if anyone you know is a rebel or I've heard, other people call it rebel the mopeds, those are not supposed to be in bike waves. Those are you know, licensed vehicles. I, would you know defer? You know some people have those like Electric, skateboards and stuff, like that. Those are not as it's written in the ad code. They are not supposed to be using bike lanes and some of them are motorized. Some of them are like have one wheels. Obviously, you know I have to work with the 114 to see how they would interpret that you know it's words on a page and I have to get their interpretation of you know the e- bikes, verses, I, guess, Electric, skateboards and I think you said segways to my knowledge, that's not in the VTL. Okay, that's a problem too. It seems like every powered two- wheeled vehicle is using the bike lane sort of as an express lane. That's a danger not only to the bicyclist but also to the cars. So that is an issue that I think should be addressed yeah. So we can take that back to our policy unit, obviously, and John who's. A borough planner for your area, obviously will bring this back to her counterparts at PD. I mean. Is there a particular motorized thing? That's not a bike. I know you said the like segways and stuff like that. What is your biggest concern right now? No sir just seems like any powered wheel vehicle it's being used as a bike lane and there are pedal, assists no I know that I'm saying I'm going extreme you're saying with Uber Craft and segways and the scooter the electric skateboard you skateboard. So without going to any specifically the concern that seems like everybody, who's on the car or a truck or motorcycle, using the bike lane as a express lane, and that's concerns me as a as a driver. Yeah we'll have to get further clarity. I actually did not ask a question, but I have a question. If you go back to your page, 24 and I'll, it's a few things about the specific markings, but I do agree that a patek protected bike lane a protected bike. Lane is a game. Changer I do cycle every day at work. I'd say that all the time it's a game changer, but when it's not protected and it's parked in by delivery vehicles, Police department and other vehicles, it could be it's very dangerous. People have been killed with people Park and bike lanes, and a bike has to go out. It's a protected bike. Lane we'll get we'll get kids on bikes, I know. What's my question. My question is here your cell, your showing on paper the green going through the intersection and I? Think that's really important. I find frequently that turning vehicles do not maybe do not realize that a car, a bicycle is a vehicle I find that vehicles would not cut off another car in to their right or their left. So I would request some education, maybe some signage that emphasizes that a vehicle whether it's got two wheels and it's a bike or it's a car. There are rules of the road and I know the rule is if you're turning you have to. You know sorry give way to two vehicles going straight: can we educate the community so that everybody, so that interface of bicycles and automobiles and an interface of pedestrians, is more, is more managed and the role the rules are? People are educated? Thank you. I have a question. Are you there Kathy I'm here sorry I just had to unmute myself? Oh thank you. So I just had a comment. I know that it's been discussed a lot of times tonight. Cobin we've seen a huge increase in cyclists. I, fully support this plan. The north/ south connection I think it's appropriate for Crescent Street to be this north- south connection. I know this was discussed. East- west connection was brought up at 30 power and the meeting in February, but I just wanted to. You know again reiterate that I think that 31st Avenue is an appropriate East-. West connection again appreciate all the hard work that Tod is put into to the Crescent Street working. It's great excited to ride on it, but that I just ask that you continue working with continue working with our community. You First Avenue, can really provide that East- west connection, not only in Astoria but out throughout or out through Woodside, through Jackson Heights, really connecting more of Queens. So that's just my two cents and again thanks to do T4, Thank You Jesse, the America. Do you have a question? My pronouncing your name correctly yeah. Thank you. I've been using the Crescent temporary Bakula lately for the last month or so, and I've noticed that there's a lot of potholes on Crescent between 38 Avenue, all the way to Queens Bertha. What was what will be the best way for us to flag that to you in order for that to be repair, because you're definitely challenging, and sometimes you have to get out of the bike lane down to the traffic so I. Will you know that will be something that we need Nina to me taking care of? Yes, a number of potholes were just recently filled already on the route, and we are working to see whether there is surfacing that's feasible in advance of the marking. So we're taking a close look at that as well. Double check, yeah and I'll. Just add that you know to both Samantha John and I, as well as I mean we've been speaking with our roadways chain. Obviously alternate side parking has been suspended for a very long time, probably the longest in the city's history and for good reason. You know people you do not need to leave their home should not be leaving their homes, etc. I think it's ending next week, I'm not sure I have to double- check, but when that does get lifted like the mayor did that a couple of weeks ago, just so that the Sanitation trucks could get in when we sent our crews out and we've sent them out several times to Crescent Street, we can't get to all of them like in the parking lane, or you know, people as they were when meeting to the temporary bike lane. They might have been parking in that temporary bike lane on. So we are aware of it. When SP is lifted, we are going to try to get a crew out there to kind of almost follow DSN Y. So when the cars are gone, we can kind of get to some of those potholes that we have not been able to get to. But we are monitoring. Okay, I have a question from a public member here, Marie one second Marie, yes, I never got to answer to the car education course in the Dominic answer. There was no answer that act. There was no answer to Dominic's question. Yes, oh you just spoke and then went straight to the next question. It was about turning cars in the right- of- way, Mm-, hmm. What was the response sure with some of the designs? We do include signage that warrants vehicles to yield as they're turning yield to bikes yield to pedestrians. We also work sometimes with our street ambassadors, our education team to send them out distributing flyers and about the rules of the road, something else that we do typically with implementation of a project like this is post fliers along the route that help explain how some of these elements work. So we'll take a look at that. Thank you. We are kind of recycling because we have not been able to do kind of art in person, Street, Ambassador, engagement and as soon as you know, pause is lifted and we're able to do that safely. We will, but just the other day, I was driving around the borough and I did see some outdoor advertising, so I guess we're recycling some of our vision, zero ads and we do have a citywide campaign. I have not heard in the radio in a long time, but we do have campaigns specifically focused for drivers to slow their turns to five miles per hour. So I know that there are posters in several places throughout the city, so there is kind of that type of touch point with the general public. I have a question: did you have a question as well? Actually I just wanted to bring out to the larger group a couple of the smaller details we discussed on the transit committee meeting about this presentation, notably Helen I, believe brought up the kind of sewer grates that the bike lane will be running through which are not too good for bicycles, and we also discussed the creation of a bicycle lens traffic signal at Queens Plaza to protect bicyclists as they make that right turn acrosss. The two lanes of traffic toward the bridge, Helen or Dominic. Was there anything else we discussed along those lines that we should share with a larger group, any other yellow liberty. Have you guys dressed the issue of people using wheelchairs, powered or manual travelling in the bike lane quite often which a users would rather ride in the street, because then they do not have to go up, curbs and down curves and all those issues so have you guys addressed it and if so, what's the? What are you doing? I'll just add and I have not had this question in some time, but obviously you know we do have a policy division and within that policy division we do have someone who specifically deals with people with disabilities and advises our urban planners and designers and engineers, etc. I'm going to have to bring this back to them. Obviously you know it's that gray area again, where you know her. The VTL, the vehicle traffic law I think how it's how it is written, says that you know my clans are for bikes, but obviously there's been change, you know, there's pedal- assist bikes are allowed to use it, etc. So we really have to take that back. I do not know if NYPD has a position on that. I would be interested to see if someone in an electric wheelchair has ever been summonsed, because you know people need to have an accessible way to get from point A to point B I'm, not the authority on that and I'm going to have to take that back to legal and I can consult with NYPD yeah, just a little more on that and that people with powered wheelchairs, where there is no bike lane on just a regular old- fashioned Road. If they are in the right hand, lane a car would be able to go to the to the left lane and go around them, and there would be no problem. But if they're in a protected bike, lane and bikes want to come behind them or whatever there's going to be a traffic jam in there. And so you know that's why my question is here: he's on chat and he says wheelchairs can use the bike lane using bikes I'm. Just passing that on okay pleased to meet you the question from the public. If you do not mind Commissioner or whoever, why is the lane on the east side when the connection to the borough, protective Lane is on the West side of precedent? I ride this commonly, and you have to credit for us, the car lanes to get to the bridge for I guess the trade- off is that drivers are less likely to see bikers when making my journeys. I wanted to hear your analysis of that trade- off. That's Angie Gower. Somebody onto that! Please! Yes, so there are a few reasons why the bike lane is along the east side of the street. One reason is that it has fewer intersections that conflict with the bike lanes. So, for example, there are a number of what we call t intersections that come in from the West side, but they do not continue all the way through Crescent really just kind of end. So there are, there are much more of those along the western, so there are fewer intersections on the East curb. There are also lighter turning volumes along the east side, so we just saw heavier right turns then left turns along this corridor. Looking at the traffic, the typical traffic volumes and then yes at the Queensboro Bridge, there will be the design will clarify how to cross over and which phase to cross over during. But generally you know, those are a few of the reasons you know. One more reason is that with the southbound bikes here, let me just show up an image that will better illustrate so in this sections, where this bike lane is separated with the painted buffer and the delineators, the bikes that are going in the opposite direction of traffic, then northbound bikes. It gives them an option to be farther away from the moving lane than if they were on the other side of the street. So that's one more design reason, so this bring the bike lane the bike that is traveling with traffic, it's still separated by the painted buffer in the delineators, but this gives more space between that contraflow movement. Okay, thank you and I'm, going to read another question: if that is okay from the public, much of the city has a huge problem regarding vehicles, parking and bike lanes, putting cyclists at lists and lack of enforcement. I've said vehicles: how is he ot making sure that the sections of the new pair that are talking protected will prevent others from entry since till evening? This can just be dripping all over. So with this section, where we have one traveling, it is important to provide the ability for an emergency vehicle to pass through that bike lane and for sweeping and sanitation as well. One thing that we are, including with this proposal is there, are a few locations where we're updating some of the regulations on the West curb which can be used as a quick pull over spot for delivery instead of blocking a bike lane, so we're taking a close look at the regulations to make sure there's a little bit of wiggle room to prevent some of that behavior. Thank you any other board. Member have a question. Yes, I have a question. After assuming all this is all in place, and we have all these bike lanes and I'm going down. I'm a bike rider and I'm going down, Crescent, Street and I decide. I do not want to ride in the bike lane. I want to ride in a regular lane, am I then going to be subject to getting a sign, a summons, a ticket or anything like that? What will what will happen in the future with this is Shaun Macias, deputy director, so generally, cyclists can travel anywhere a vehicle travel. So if there is a cyclist, who's, comfortable riding with traffic and decides to pull out of the two- way path and move into the travel lane, I believe they're free to do so, you know just depend on the confidence you know of the cyclists deciding to take that Lane. So at that point we would have the same problem we have now in his traffic lanes being shared. Is that correct? Yes, but the difference is currently. You do not have a protected option so in this proposed condition, you would have that protected option and if someone is confident enough to travel in the cab travel Lane and they can do so, but folks who are new or to cycling or perhaps not as confident will have a safe space to travel. Thank you. Thank you. There's any other bullet moment have a question. Okay, we've had several letters: oh I'm, sorry, we just had. We have had seven emails, mostly in support of this bike, lane and I'm, going to ask Amy and Richard to read them into the record. I go first, you go first, okay, the first one is from Todd Schultz. His email says: please make a permanent protected bike lane on Crescent. It should be a protected bike lane with immobile physical dividers between bikes and cars, from Astoria Boulevard to 59th Street bridge. This would protect cyclists, comp traffic on Crescent and improve the environment. So that's from Todd Schultz. Next one is from Professor Patrick reading and he writes dear Queens Community board. I am writing in support of the bike lanes being planned for Crescent Street between the Triborough and the Queensboro Bridge. This change is long overdue, as this is one of the most dangerous to Lane one lane roads we have in Astoria the other is 33rd Street between Northern Boulevard I live on Crescent Street at 32:21 Crescent near Broadway, where a speed camera has recently been installed right in front of my house. It has made no difference in reducing motor speeds, Bikes cars, motorcycles and routinely drive- by here that speaks of up to 30 to 40 miles per hour. Pedestrians routinely jaywalk acrosss Crescent on 33rd Avenue and 33Rd Road, so this is especially dangerous for them. Too. I go out of my way to avoid using Crescent Street when biking with my children, because of its danger now I can safely bike them down to LIC without having to add an extra mile to the route or biking through industrial areas near 21St, Street I can't wait for this bike lane to be implemented. The coronavirus has made biking even more popular and we have one of the safest lanes already over on Jackson Boulevard, but it's not very close to most residents of our neighborhood. This would be a game- changer for transportation in our neighborhood. Next one is from Nicholas Lo simply writes hi. The new bike lane is absolutely important to those of us who bike from Astoria to Manhattan. It saves us from the unsafe routes that put us in danger and put drivers in impossible situations to Mora. Let's say this one is from Gabriel Torres and he writes resident of the area for 28 years and I've been dreaming of this day, since, thank you so much for putting these in finally definitely need some more bike parking stations in Astoria as well. It would be it would really help along the Crescent Street bike lane with all the supermarkets and such again. Thank you. So much for this and I have one more from Jesse thistle who writes I'm writing to share my support for a two- way bike lane on Crescent, Street I'm, a nurse and bike commute bike commuting. Is the quickest and most reliable way to get to and from work, especially during the early mornings and weekends. Crescent Street is the ideal location, because it's the only direct route for people living north of 34th Avenue I'm, also hopeful that the addition of the bike lane will help slow traffic on the street, making it safer for pedestrians, okay, I have four more also. The first is from Jennifer chocolate party and as a longtime, Astoria resident mother and frequent bicyclist I'm excited to learn that a permanent Crescent Street two- way protected bike. Lane is in the works, especially since the temporary one is an absolute deathtrap. Prior to the current pandemic situation, I was a frequent bicycle commuter going from a story of park area to Midtown or downtown via the Queensboro Bridge. Crescent is the most direct route down to the bridge. For me, but coming back home has always been a challenge because there's no logical northern route, it is not putting me a mile or so out of my way in additionally when I want to write into Central Park with my kids. Getting to and from the bridge always requires an extra mile or more to ensure our safety, we're forced to bike well out of our way to write on the Vernon Boulevard bike lane. This would be much more convenient to have a direct South, direct south and north route on Crescent, not to mention I'd, be able to avoid a few Hills, which is a big deal when I'm riding with 40 pounds of a five-, year- old on my bike. I do hope that the bike lane on Crescent is approved and no one is willing to cave into the where will I Drive and where will I park. Folks. I truly hope that my safety and that of my children will be more important. The second is from Daniel Brown, dear community board. Members I would like to say that the recent bike lane has been an absolute, absolutely terrific and welcome addition to Astoria. Prior to this, there was no safe method in order to travel from a story to other parts of the city, specifically through the Queensboro Bridge I've never felt as safe as I have, while riding through a street and no longer have the anxiety of either checking over my shoulder for a speeding, car or concerned that someone would open their car door directly into me and push me too. The moving traffic I've also visited local stores and restaurants, which I would have otherwise not visited because of the cars on Crescent Street and traditionally moved way too fast for comfort. However, there are so many downsides to this bike lane, as it is not fully protected. Many drivers ignore the temporary bollards and parking lanes too, for cyclists to swerve in and out of traffic endangering ourselves and the drivers who try to avoid us. I've also seen some of the bollards knocked out of position and into the bike lane, because it's not truly protected. It's still for very safe and worried that this eventually will deteriorate further and the lanes effectiveness will be diminished. Lastly, I would like to say that, with everything that is happening during Colvard, 19 I am looking for new ways to travel, to and from work while having to enter a crowded, subway I, generally love taking public transit, but will be limiting my commute in order to reduce the chances of coming into contact with the virus. I've noticed many other people choosing to drive cars rather than to take public transit, so there'll be more people on the road moving faster than before. So a safe route to work is needed now more than ever. I would like to thank you for your work and helping implement this bike lane. As it's truly been a life, changer I went from a casual CitiBike rider to someone who feels much more much more confident about riding and my bike and commuting visiting friends and frequenting local businesses. I look forward to joining the zoom meeting tomorrow and hearing the folk plans moving forward. The next is from Scott Phillips, an avid cyclist who takes the opportunity to use his bike whenever weather permits, I strongly support the construction and maintenance of a permanent bike lane on Crescent Street. We currently have partial bike lanes on 29th and 28th streets allowing for bike travel to and from the Queensboro Bridge, but they are neither adequately maintained or protected when traffic increases drivers often take their road rage and careless habits out on law- abiding bicyclists I have seen it and suffered from it several times. A protected bike lane on Crescent would increase safety and traffic flow for commuting, Astoria LIC cyclists tremendously and serve our community well, I'm, Scott, Phillips and last. This is from our Assemblywoman Arabella Samantha's respected members of Queens Community Board. One I write to express my support for and encourage you to vote in favor of their proposed bike lanes over Crescent Street Astoria. The Transportation Committee has rightly expressed their support for this issue, and it is my hope that the board will do the same and approve this proposal. Having a designated bike length lane for bikes is crucial to protect the safety of our districts residents according to the Department of Transportation Creston Crescent Street is a vision, zero priority area, meaning that it is an area in which at least nine persons have been killed or severely injured. Within five years, between 2013 and 2017, the street has seen a total of 241 injuries and two deaths. Bike lanes can help decrease the amount of injuries and fatalities in this area by separating bikes from vehicles and increasing the predictive predictability of cyclists locations, so the drivers can bypass them. In addition to improving the safety of our community bike lanes will promote participation in physical activity and support cyclists, who are of all ages. Bike lanes will also encourage alternative modes of transportation that decrease our emissions are an environmentally friendly. This proposal will also close several gaps in bike routes and the last cycles to access the RFK and Queensboro bridges safely. For these reasons, I strongly recommended to support the proposal for the Crescent Street bike lanes, protected bike lanes and vote in favor of the proposals. Thank you and I look forward to working with you on this issue. Arabela Simotas! Thank you! That's it are you okay. Would you like to give the I bomb is not there? Yes, Bob, calm, steady, sorry, but something again committee's recommendation. Yes, he crepitation Committee had a farm. They voted unanimously in support of the Question Street Bike Lane, with the stipulation the duty would accommodate any specific matters or issues raised by the Community Board office. In regards to the finalization of this plan. I do not think I can make I'll make a motion yes and make a motion to approve this proposal. Really a second I'm, sorry, Louise I said I. Second, it thank you yeah thank. Is anybody opposed I'm trying to do it the easy way anybody opposed? No okay, unanimous, thank you so much ADOT and Tom for stepping up and all the board members for their input and the public. Thank you, righty. Thank you. Mr. Jim, Kim who's been waiting. All this while I to inform us on the census. Are you here? Yes, thank you very much chairman and also district manager and over the board member Yo many board. One members I have two big news: first I'm going to go breeze through this and keep it very short. But, more importantly, your district is doing fairly well. The 2020 census responds so, as you know, March 12th we kick to US. Census Bureau kicked off the 2020 decennial census and where we invited every household to respond to the survey, we were seeking other households to respond online telephone or by mail. So far nationally. On average, we have a 61 point, four percent response rate. Your state has to be six point: seven percent response rate New, York City, the five boroughs at fifteen 1.9 percent Queens currently has 51.9% now. Having said that, the Committee Board one area, Astoria older storia, Woodside and parts of Long Island City- is currently yet 52.7%, so your district is certainly doing well for that matter. So we appreciate everyone who has responded to the survey. Let me also provide you some update on. We had to make a lot of operational adjustments due to the Cobie 19, most significantly for the public. We have extended the self- respond response period without being October 31st instead of July 31st. Had this been an almost a situation, our census response period would have had ended next month on 31st. However, we've gotten three month extension to make sure that everybody exercises social, distancing and all of the state and local guidelines. Thus we have extended through March 31st. We will begin what we call a non- response, follow- up, that is the door- knocking for those who did not respond on their own online in California, that's going to start on October in sorry, August 11, where we are going to dispatch our Census Bureau representatives to collect the survey responses. So you know we hope that from now until August we have, we continue to increase our response rate so that we reduce the number of home visits. That's one to save us a lot of time and, of course, money also I wanted to let you know that we do have a self- response rate map that is available to the public by visiting the 2020 Census Gov, where you could look at your community. How well your community is doing. We divide each individual geographical region and by what we call census tracts in your district. There are 52 census tracts and those are those boundaries that define specifically streets and the housing units that are present in those street boundaries. So some areas we are doing very well I've, seen upwards of sixty seven percent. In your district, which is phenomenal, but then I've, we've seen as low as thirty eight percent, so we need there are areas where we need still a lot of work to be done. Let me remind everyone of some of the survey awareness and for the purpose of security. Census Bureau conducts a variety of surveys throughout the year, in addition to the decennial census, which is the our largest or most the largest operation that we conduct every ten years so do not be alarmed if people get contacted by Census, Bureau or other than the decennial census. Secondly, there's a lot of fraud that of first unfortunately during the decennial census, other criminals are take advantage and exploit people during the census period. So we want to remind the public that the Census Bureau during any of their surveys would never ask for social security, number financial account numbers or solicit money or anything on behalf a political party. So if any of those are being asked by alleged census representative, it is a fraud. We ask that you report those activities by calling 1- 800 nine. Two three eight two, eight two, eight hundred nine two, three a 2, a 2 and also you could visit 2020, Census Gov and, in every view, some of the latest information. We heard that there was an incident where, during this stimulus fund issuance that it was, you know, it was required that they provide certain information in order for them to receive census information. Your friend, who receives the most funding, which is untrue it, since this is not tied to any of that. So if anyone's part of those type of incidents of please report of those activities and finally, I would like to ask for your help. We do need to continue to promote the census, educate the public, raise awareness about the importance and the safety of the census. As you know, federal funding is tied to the census representation and in the Congress, as well as local government on to some institutions then depends on the population of our neighborhoods, so it is very important. It funds a lot of the public programs, transportation, infrastructure, Health, medical care, supplemental nutrition, certain education, a lot of the programs for seniors and children. So a lot is at stake, so we ask that everyone not only respond to the survey but also help us to continue to raise awareness. So my message to you is very simple: today: you understand your community are the people and their priorities and their needs, and you know how effectively deliver the senseless message to them in ways that Census Bureau can never cheat. So please help us are you? Are the trusted voices of your community, educate them on the significance of the 2020 census and encourage them to respond to the survey? I am here to help anyone who's willing to work with us to help raise awareness. We have promotional materials. That's available and I could certainly come out to your community audience and provide census presentations. We could also help them. You know answer any questions and address any concerns they may have. We are getting married once we are social distance and guidelines are lifted to go out to the community and help people complete the survey as well. For those that are having difficulties of filling out the survey. There are phone numbers that are available on dedicated phone numbers for 12, non- english languages, so those language options are available and as well as online responses, there are 12 nine English languages available as well to facilitate any language things. So with that said, I would like to thank. You may be board one for doing an excellent job in promoting census for us- and you know, I- think Rick I think I heard Rick Kazami a couple of weeks ago. We did a similar event where I was invited to speak during the old Astoria Neighborhood Association meeting. So those are the kind of outreach and the support that could give us help us reach your audience. Thank you. Thank you very much. I believe we have a question as to whether there is any applications for enumerator or census takers positions still available. Yes, so we are still accepting applications. It's an online application, 2020 census go or slash jobs. We have suspended the hiring process during the coab in 19, but we are currently in the process of processing the applications that we have received in the past. So, yes, the opportunity is still there, so please go online and buy it's$ 28 an hour for their services but, more importantly, they'll be helping their community. Thank you. Thank you. So much for the information, Mr. Kim. Thank you! Thank you! Elected officials or their representatives. Is there anyone here, I'm Joe, no silly? No, okay, I'm! Looking right at you! Yeah I'm, here, I'm, sorry, baby, Marie, I'm, sorry! This is Vanessa Marie! Yes, I'm! Sorry before you before you move forward. I'm apologize for jumping in I just wanted to just mention something other than what Jen had said about the census currently. Well, we work while we going through to bring in the working on getting the new and the enumerators that have already filed I'm reaching out to you all my board members and anyone elses over here that we're looking for space where we can look at for space where we can hold training. So if anyone has a know of a space where we can hold training for our numerators as we start to bring them on board that you can reach out to Florence and get furnace, it's okay. If you do not mind that they can give, my number out is nine one, seven, three, four, eight nine one, eight one is where we're looking for a space where we could not get so allows us to be able to do some training, and they can go through me for that side. Whomever's willing to allow us to use their space I really appreciate it. Thank you. Everyone, Thank, You, Marie you're, welcome, okay, Joseph Hey folks, thank you. Madam chair, Thank, You, Florence and all board members hope you're, all well and safe quickly. Tonight. First of all, Sharon Lee burr prison, Sherilee Center regards welcomes first time appointees to your new gig and wishes you the best and, of course, welcomes or returning members. Besides all that sit on the board early voting is now election, June, 23rd and absentee ballots are out. We can't stress how important it is for folks to get out and vote now. Quickl a couple of quick dates. Events and Murray or Florence will send them out to you to all bar presidents. Events. Pride event is June 18th at 2 p.m. there all can be on the website. Logged in on the website, obviously virtual the recruitment Fair third one in a row third month in a row: June 24th at 2 p.m. Philippine, Independence, Day event, June 24th at 5 p.m. and celebration of Jerusalem event, June 25th at 5 p.m. and I. Thank you for the time, Madam, Chair and all be well Pinkie count any books. You have you not muted. We can't hear you try again. Yes, oh I want to reiterate the importance of the census obscure. He writes throughout the coronavirus crisis. Now you bring in an asset to your mind. Now you have to face the microphone we can't hear. Oh I know what I had my phone on top, not better yeah. Okay, sorry yeah! That's something blocking it! We're trying to provide an extra thirty, four billion in federal funding, the New York state, an additional 17 billion for New York City, tighten up oversight on the Paycheck protection Act to look into. Why so? Many large corporations we're taking past taxpayer dollars that were intended for small businesses, we're consumers, not-, for- profits and small businesses will grant a moratorium on all debt collection until 120 days. After the end of the whole: 19 crisis, during the crisis, negative consumer credit reporting will be banned and all covered 19 related medical debt reporting that we permanently bad with providing 25 billion for the funding to the US Postal Service to keep its solvent, which is especially important that voting by mail which remember the ballots, have to be sending off at the Senate today to get your absentee ballot. Finally, the bill would send an additional let's check that everyone was eligible in the last time around, but this time it would include additional payments with attendant children over the age of 17 I'm, also working on landmark legislation to provide businesses with access to in sherman insurance payments to help them stay whole. My pandemic risk insurance, Act or Priya his model on similar legislation, I champion after the 9/11 attacks, and you could not even get business insurance for a hot dog stand in New, York I think Priya will not only start to help businesses now that act is an important resource going forward. I've also introduced important bills to help out the brave heroes on the front line of this crisis. First is my student debt forgiveness, the frontline health care workers Act, which would do exactly what it sounds like eliminate student loan debts for anyone in the medical field directly working on the response. The Covid-19 other legislation is a broad compensation fund for the families of frontline workers who pass away as a result of 19 our postal workers, grocery store, clerks transit workers, nurses and so many others are putting themselves a great list of contracting code 19, while continuing to work doing essential jobs. We should honor their bravery and commitment to their communities by collectively ensuring that their families are not left in a financially precarious position. While they deal with the emotional tragedy. The loss of a look against the back of Koba 19, our nation is confronting the shameful reality of continuing and ever- present. Inequality sparked by videos of the gut- wrenching murder of George Floyd Mr. Floyd's life was stolen by an officer whose beauty was supposed to be to serve and protect not to be two eyes and kill. I believed to see that this officer was arrested in charge, but so much more must be done to stop our nation's vicious cycle of police brutality. It should not take a viral video or national outcry to recognize the allottee of this or to ensure that justice is served. Our nation can finally tackle this crisis that has taken the lives of so many is innocent black people and lobbed their communities. You must do more to hold our police officer countable and to dismantle the racist power structure that allows this kind of violence to fester. I am incredibly proud all those peacefully exercising their constitutional rights and protest. I've witnessed firsthand people on the street, exercising de- escalation tactics and self policing. Those opportunists would use this moment for their own personal and financial gain. I would do everything in my power to see this nation finally realizes its radical promise of universal equality. You can see the legislative proposals I am supporting to achieve just that at House, Gov issues, combating police, violence, that's on our website. We are living in a historic moment and our actions today will determine our tomorrow. So, thank you very much for having us thank you, Florence Thank, You Marie. Thank you there. Any other elected official representatives on the poll would like to speak good evening. Members and leadership of community board 1. My name is Marcus Bettinger and I'm, a caseworker and Phil representative for the office of congresswoman, Ocasio Cortes, and you do not know me because tonight, I'm filling in for Daniel Vaughn Thea's, but thank you for having me a few updates for from our office. The congresswoman has asked me to acknowledge this remarkably painful moment for black Americans. As she has said publicly. She is also hopeful that this moment marks a turning point: the beginning of the end of oppression and the start of true economic and social justice and equity. For all. There will be a lot of work to do in the days weeks, months and truly years ahead to make that hope a reality. While much of this change will need to take place on the city and state level, the federal government also has a huge role to play. A couple legislative updates. This week we introduced our office, the prohibiting chemical weapons and law enforcement act to your gas was banned from war by the Geneva Protocol in 1925. This bill would ban the use of tear gas by federal law enforcement conditions, state and local law enforcement eligibility for grants on their compliance with the ban and established I'm sorry, any establishment of policies ending its use. Among other items. We also co- sponsored the Justice in policing, Act of 2020, the Democrats response to calls to address police brutality. The legislation would 1, establish a national standard for operation of police departments to mandate data collection on police encounters, 3 reprogram, existing funds to invest in community-, based policing programs and 4 streamlined federal law to prosecute excessive force and establish independent prosecutors for police investigations. Additionally, the congresswoman signed on to representative Jana Presley's the people's justice guarantee, which guarantees proposals to compact mass incarceration by expanding access to restorative justice, inking the cash bail system, implementing minimum sentences, terminating solitary confinement pending the death penalty. She also joined a resolution authored by representatives Presley, Omar bass and Lee, condemning police brutality and racial profiling on another topic. In honor of Pride Month on June 1st, the congresswoman, along with representative Maloney co-, sponsored House, Resolution 989, expressing the sense of the House of Representatives that blood donation policies in the United States. It should be equitable and based on science. Long lines of the census, despite the disruption that Covid-19 has had since is 2020, is still ongoing, as Mr Kim mentioned. If you have not yet please complete the census at my 2020 census, gov a story and Steinway are doing really well so far, so we should apply to everyone who has committed to getting a complete County. We have already counted upwards of 55 percent in most of the CB1 region, and this is on par with the state and ahead of the city and New York 14. So thank you for your hard work, but if you have family members or friends who have not completed the sentence since and sorry, please encourage them to do so on constituent services. We are very pleased to announce that our office has reached 1000 cases. I myself am a case worker for the office. We have reached 1000 cases. That means we have served over 1000 constituents on issues ranging from immigration and Veterans Affairs to Social Security and, more recently, the economic impact payments. Our office continues to assist constituents which federal case work remotely I am at home in Ohio with my parents, but I am working on cases every day. So we continue to accept cases at our web- site. Ocasio- courts hairs that house that dove or over the phone, the office number and with the office number one you call you either get someone who answers or you can leave a voicemail and we check every single voicemail. The office number is seven one, eight, six, two five, nine seven zero and thank you for the time and I'm happy to answer any questions you might have for the office. Thank you. Thank you. So much is there any other elected official who wishes to make the statement? I'm. Sorry I do not mean to interrupt good evening everybody. My name is Victoria I'm from Assembly Member bar Mel's office. I. Just have a brief few updates. So one our office has put out our Koba 19 resource guide. We're continuously updating it to make sure that it has all the up- to- date, information and resources that may be accessible to you on the city and state level, also including some nonprofit resources. This Thursday partnering with Nylag we're offering free legal service consultations from home. So if you have any legal questions that you want to kind of talk that over with please reach out to our office, you can sign up by calling us or by emailing us directly, so you can email, Barnwell be a NY Assemblies of we have very limited appointments available right now, so please sign up sooner rather than later, and then. Lastly, as we continue to work remotely- and it's unclear when we'll be back in the office, continue to call us or email us with any questions or concerns that you are the community members may have. If you do not get to us on the first call, please leave a message with your name number and your concern and we'll call you right back. We've seen a really high influx of calls over the last few weeks, so it's hard with the phone courting system. So, just you know, leave a message and we'll get back to you by the end of the day other than that I wish you all great health and welcome to all of the new community board members I'm, looking forward to speaking with you all speaking with you all and working with you all much more closely. Thank you say a couple of sentences. Hi, my name is Louise portly I live in Long, Island, City/, Astoria and I. Do security and I love working with people. Thank you welcome. Thank you. You're back I, then I sew, my chomsky I work for local government and I moved here from Mexico five years ago. Doing a story for four years and a half now I fell in love with this neighborhood since, before moving so I'm very happy to be here and I can not wait to see you in person welcome Thank You, Marie, hello, everyone, my name is Hamdi. I live in Astoria for more than 10 years now, and I work in nonprofit organization and I'm really happy to be part of the ball and really interesting to VC everyone, and we be together again. Thank you. Thank you. Thank you. I mean my heading I mean you hear. Yes, I knew good evening. Everyone I'm very glad. You have all of you together here that I'm introducing of you, the good people that had been working for the community long time and it's my pleasure to be with you, and it has been excellent, that the thing that you've been doing the bike, land and I saw the board work on the ferry ride and all of those things that, when I'm being couple of meeting before so it's just I'm very excited to work with all of you and we will together will make better storia and Queens and I look forward to in- person. See all of you. Thank you very much. Everyone you're having me with you. Thank you and welcome. Juliet I am bhaiyya. Yes, hi all right. Can you hear me right? Yes, we can now we can. Yes, you can hear me right now. Okay, yeah, Juliet and I have been a resident of a story for 44 long years, Wow and I'm. An active community leader in my Campina community in New York and I've, been attending your meetings in a story, a matter as an observer, and tonight is my first meeting with the community Board as an official member and I'm. Actually thank you and thank you for being here and we look forward to one day being able to meet personally as well: Marie yeah, very big Irene from sending the generic office just trying to get in okay, hey guys, Irene. Thank you for having me on here and we are accessible by email by phone. Falls I've been on top of the issue with the no mass no social distancing on 30th and Ditmars, especially so I have been working on that hard. I do not know what else I can do on this end so, and also so you guys know we have masks going around if anybody needs and okay. Thank you, I mean thanks. Marie excuse me: Marie I had a question. Yes, okay, I would for the boat ride on the Astoria that we have how we can make more effective, which committee I should join, and we can talk about it because you know I see I know that there has been two years that we have that, but it's not that popular. Yet so I have some idea. I can share with that committee and then go through from there. I was talking with Florence about that, so we're going to be regarding interesting committees and then we'll reach out to you all right. Thank you and we received an update on the tests and trace core the core wants to set up infrastructure to service 50,000 New York is per day by August 1st. If you test positive you'll receive a call from the tracer, we will determine if you need more medical information and also help arrange isolation at home or at a free hotel. If you do not have the room at home to isolate from others and then a free health care and mental health services and wheel and medication. So that is a great thing and I'm going to ask Lawrence could send out information Florence on this to all our board members, so we can pass it on and get the word out there. So hopefully, some have Toby 19 will be decimated, like all these things that are coming up. My next item is I want to inform everyone that we have a vacant position on the Executive Board. So we have had. One of the offices was not be appointed. Therefore, I just mainly work on a team that possession position vacant will be having an election in September. In the meantime, in the board is we will send out information and a form through. If you wish to nominate someone that will go back to the office, we will then send down a ballot, because I do not think we'll be meeting in person soon, but I could be wrong, so we're going to send our ballots, you will fill them out and we'll provide, of course, a self stamped envelope. So you can mail it back unless there's a miracle that happens, and we could all be together bargain in person in September and that's marble, onyx new songs, you muted, yes, Thank, You Marie. Thank you for everything. Okay, I have a report which I received from the mayor's office and it is in response to outdoor cafe applications license application fees still need to be submitted for new renewable sidewalk. Cafe applications a Cathedral each package signed into law by Mayor, Bill DeBlasio, extends license, expiration dates and renewals of application deadlines covered by emergency executive order, 107 and 110 in general. The extension applies to licenses with expiration dates on or after May 12th 2020. When the mayor first declared the state of emergency new renewal application deadlines are calculated from when EEO 110 expires. City Council recently passed a bill that suspends collection of indoor and closed sidewalk. Cafe, consent cafe fees from restaurants, for March, 1st 2020 through the duration of the emergency and for outdoor unenclosed, sidewalk cafes from March 1st 20:22 February 28 2021 through the mayor's executive order. The city has already stopped collecting these fees for the duration of the emergency. Any such consent fees are already collected and have been refunded. Dcw P, which used to be known as Department of Consumer Affairs, is still reviewing new and renewable sidewalk cafe applications and promptly informing applicants of anything they might need to know to amend or submit, but they are not forwarding to other agencies for review due to the mayor's executive order. If someone is applying for new sidewalk cafe application or renewal and have any questions, they can contact by email, sidewalk cafe at DTE nyc.gov and receive prompt assistance and response our office is receiving requests to learn about the new laws for sidewalk cafes, post Covid-19. We have not gotten any updates at this point as soon as any updates come to assist the businesses regarding the rules and regulations in phase 2. We will let you know. Thank you. We wish you all great summer and health and happiness and continued good health. Thank you. A motion to adopt in May 20 minutes motion. Second I'll. Second, that Airport mostly you here most movie Marie. Yes, in Rose Marie's an absence report, we have a LaGuardia Committee meeting coming up a virtual meeting tomorrow evening, which I will be tuning in on okay. Thank you, consumer affairs. Yes, hear me. Yes, all right good evening. Everyone, if you could please review your consumer affairs spreadsheet, that was emailed to you. We're voting on applicants for the month of June. The entities that are we agreed to stipulations are marked now with respect to hanger Astoria bar and grill. The committee met with this business in January to discuss a prior renewal application and we recommended that the board vote to deny their renewal, which the board subsequently did now. Despite this fairly recent denial, they submitted a new application and the ones worth creasing provided another report stating that the location is highly problematic with forty two three one calls and fifty five 911. So the committee is going to recommend that the board vote to deny hangers application again now as to N Y MF bar. They are not seeking a renewal they're just seeking a corporate change which involves a change in ownership. They have to report to the community board when there's a transfer of ownership of more than 80 percent of the business here, there's going to be a hundred percent transfer of ownership to a completely new owner of the applicant entity, Les Amis Cafe Inc. Now the business is not currently open from what we understand and the committee has been told by the new owner that it was actually closed since February. However, over the past year, the prior owner is had 140,141 301 poles regarding noise complaints, as well as complaints regarding to social, distancing and so forth. So as a result, the committee, actually a new owner and a representative come in to speak and I do want to thank committee for coming together so quickly after we got this police report last week now the committee spoke to a representative and the new soul of the business. The new sole owner is not one of the prior owners. The new owner is conducting renovate, is going to conduct renovations and stated that none of the former employees are going to be working at the location. The new owner affirms familiarity with the Mayor Social Distancing guidelines and also said that the employees will be trained to follow the guidelines. Also, the prior location played a lot of loud music and the owner new owner intends to target a different crowd, that's more mellow and will now be playing loud music. Additionally, the new owners familiar with running similar establishments and história the new owner was, is actually a partial owner of the brand on 30Th Avenue now I'm sure some of you may have heard about some of the social distancing issues that happened around the brand, but the new owner informed us that they actually call 3- 1- 1 one themselves to get assistance with the social distancing problems that were occurring outside the business. And you know, I did take a look at the mayor's guidelines with respect to social distancing and they do state that, to the extent that there are issues with dangerous situations to life or property, they call 911. They call 3- 1- 1. Now the new owner affirmed that she will sign the CB1 stipulations and will work with the neighbors as well as one 14th precinct to make sure that they are good neighbors. So, in light of that, we are going to rip the committee voted and we are going to recommend that we approve their application for corporate change now, with respect to two other applicants, specifically the last word in Judy and punch these business, our businesses are seeking to renew their licenses and they did have also some issues with social distancing. The last word had 29:3 1 calls and Judy Ann punch at 28:3, 1 calls relating to denoise social, distancing, lack of faith, face, masks and so forth. The committee did not feel the need to call them, but we are the committee voted and we are going to recommend that a letter be sent to those businesses just requesting that they abide by the rules and regulations set forth by the governor and the mayor's office on social distancing. Now, as to the remaining applications, the 114Th Precinct has reviewed all of the other applicants and they have no issue with their approval, and the committee also recommends their approval. So at this point, I'm going to move for four votes. The first is going to be with respect to the committee's recommendation for denial of Henry story of Bars Renewal application. Accordingly, I move for the denial of Hanger Astoria's bars application. Will anyone? Second, the motion, but I do not second it thank you. Is anyone opposed to the approval? If there's no opposition, the motion is going to passed unanimously right. Thank you know. Now, with respect to NY M F bar, I moved for the approval of the corporate change in light of the affirmation provided by the new owner and the new owners agreement to sign the stipulations. Will anyone second, the motion? Our second thank you is anyone opposed to the approval. If there's no opposition to the motion, it's going to pass unanimously all right. Thank you now, with respect to the last word in Jr. and punch, I move for the approval of the renewal of their liquor licenses. With permission for the community for the committee to send a letter to the businesses just requesting that they abide by the rules and regulations set forth by the Governor mayor's office on Social, distancing. Well, anyone second, the motion. Thank you. Second, it is anyone opposed to the approval if there's no opposition he's going to pass unanimously. Thank you very much now, with respect to the remaining applications listed on a spreadsheet, due to the fact that there were no significant issues and, in light of the committee's recommendation for approval, I move for their approval with anyone. Second, the motion. Second, thank you is anyone opposed to the approval, there's no opposition, the motions that are passed unanimously, all right! Thank you! Everyone stay safe and healthy. Thank you. Yes, I am I had to unmute myself, okay, so the item on the agenda we have for tonight for land use is, you should have received a report in by email prior to the meeting, which explained the public hearing item the goldfish Swim School thoroughly and also another item that we discussed at the G. Muted self lives, you're, muted, okay, all right I needed to get this ear plug out of my ear and I guess: I must have hit the pad on my Mic computer, okay. So we, what we have to do is have a roll call vote. This is a Euler item. It's a BSA application and I will reduce the recommendation from the committee. There were no issues that were raised, except we did ask one member asked about making concessions for some members of the community who could not afford to pay the private lessons and the gentleman said they do not did not do that before, but they will take it on a case- by- case basis and they're, aware of the income levels etc in the community. So, as I said, case- by- case basis, Ed could you could you were mute yourself? Edie. Excuse me. Thank you. So the recommendation from the committee was to approve the application for a PCE permit for a period of ten years for the Goldfish School Swim school. So we would entertain a motion on that and vote on it I'll. Second, it okay I, do not have a roll call. I will do it. No problem. Okay, I'll, do attendance at the same time, Georgia next to you, Angie, yes, Huey you here. Yes, she's voted! Yes, Mackenzie yeah, yes, Amy now, yes, Helen home I, guess Helen never got back on Colleen Ginelli, Colleen, Ginelli, Vanessa, Jones whole Vanessa. Yes, thank you! Yes would you do Sami? Yes, Nancy carnival music, carnival, Jerry crew, yes, Thank You, Hannah, Libyan Anna, yes, Jesse Martin, yes, Tony baloney! Have it Mouche? Yes, thank you still in Nicolau Della, you here, you know Muriel hammer. You know: kinda Ghoulia's, Yes, Mozza, rosemary poker, Omo, Yah-, Tchi, Robinson, Tom, Ryan, yes, moody, so Casey is really still with us. I mean I, know he's still with us, but I need Dominic Stiller. Yes, Andres did Andre, yes, Padres. Yes, myself, okay, my dancing! Yes, do each other! This! Yes Kathleen Warnock, yes, Mitch Waxman! Yes, Louise board, Li, yes, you're back yep I mean the hazy. Yes, please Juliet, pyah, hey Abbi! Oh yes, thank you! Well, it's unanimous, hey I! Believe it still needs me. I will jump. It check either way it's unanimous. So thank you very much. Thank you all very much. We appreciate it. Thank you for the end of my report. I would just like to let the board know that the Land Use Committee is meeting on July 1st, the first for all of us, but to meet in July, but we have some items to become informed about, for that will be, will be handling in the fall and winter I just want to wish everybody a nice summer and enjoy it, and I will talk to my Committee on the first. Thank you. Thank you all the new business. If anyone have any new business hi, everyone I just wanted to go on the record and express my deep disappointment that Nancy Silverman was not reappointed to Community Board one. She was a very active and engaged member of the board for six years. She attended meetings consistently. She initiated events for the community as chair of the Parks Committee and, most importantly, she helped bring necessary processes to help us run better as a board and engage the community at large. She was outspoken and sometimes ask questions or made statements that some people did not like or seemed abrasive, but they were never superfluous. Her questions and comments were relevant to the issues being discussed and they brought a level of transparency, order and seriousness to board procedures, so it was reported in the Queen's Eagle that the district manager of CB5 made disparaging and unsubstantiated comments about members of CB1 and other community boards. I find this highly improper and unprofessional, especially since this district manager has never been to one board meeting. As far as I can recall, interacted with us seen us operate or witnessed any behaviors. I would like to know how he came to this conclusion. If anyone has concerns or grievances, they should be dealt through proper open channels, especially if the allegations affect a board members reappointment. Quite honestly, it is not seen that there was consistent criteria, applied, acrosss all candidates when reappointment was being considered for community board members this round, given that we as a board elected Nancy to the Executive Board earlier this year, her peers recognize the important role she played and could play as we look to improve our board. The work she helps start should not stop our Executive Board as well as any of us who desire should continue to push for structure, clear definition of roles and responsibilities with the district office and, in particular, the district manager and ways to improve our engagement and Outreach to the community through stronger communication strategies. We also should not feel as if our reappointment would be in jeopardy for doing so. That said, I am very happy to see the new board members and see wonderful diversity reflected in our new members. Welcome you and look forward to working with you. Thank you, hear. Dine I follow up with on something Marie I'm, going to read an email that I sent to reinforce today. Hi Dominic's killer no yellow wall window in the back, so I wrote this email today to Marie and I. Think it's I was heavily disturbed about the non- renewal of Nancy Silverman CB1 seat. I feel that Nancy took an objective, professional approach to our decisions and our discussions. In fact, I believe that she took the most objective professional approach to our decisions and discussions and she encouraged full transparency for the benefit of the community. I've been reading in the local news that Nancy was accused behind closed doors of being a bully implied to be bullying by our district manager. Florence Kaye article is copied in the email. It does not mention any examples of inappropriate behavior, nor do any of the monthly minutes that I've reviewed since that have any have any instances of inappropriate behavior. My wife and I were heckled so badly by current and past board members in 2014, when we were applying for our DLT partnered by chorale. I was not a board member then, but there were no ramifications just an example. Furthermore, in 2016 during a meeting, the heckling of the public from the board was so egregious that I and others complain to the previous chair, Joe Ricci to have it exposed and stopped I say Marie. Can we find time to discuss this prior to the summer recess? I would like to define behaviors that are not acceptable to our discourse and have our Board document that all members and the district manager are held to the same standards. I'm copying Florence on this email, as well as other community members, I hope Nancy still has energy for public work. I encourage Nancy to reapply next year. I hope that any contention can be reviewed and eliminated. She will be strongly missed in my opinion, and I also warmly welcome the New board members. Thank you. Thank you and I add something this is Katie Elmen miss Katie I want to also welcome all the new board members. I was forward to working with you and hopefully meeting you in person. Sooner than later, when it's a thank you I do not want to I mean Evie and Dominic spoke so well. I want to publicly thank Nancy for mentoring me when I started on the boards and welcomed me as her Vice Chair for the parks, Rec and Cultural Affairs Committee I also would like to understand- and maybe there's not time now- and this is something we can work on over the summer- how and really just try to drive home the point that we need to have transparency, if we're all volunteers and we all care about our community. But if people are complaining about us as individuals, if this is a work situation, we would have a chance to have those that information presented to us and have a chance to defend ourselves and I feel that in this case, that was not afford to Nancy and I. Think it's a real shame. Thank you yeah. This is rod. Townes I'd, like to add something yes, ma'am not to pile on I. Also welcome. All the new members and I'm sorry you're having to go through this conversation, but I'm also glad you're hearing it there I'm going to this is just a one sentence statement: Joe I hope you can communicate to the borough acting borough. President, that I feel that our boards autonomy has been usurped and ignored by her decision on this and, like the others, I know that Nancy's presence will be missed, sorely by the not only the members of the board but the members of our community. Thank you, I'd like to welcome the new board members. Are you bringing a breath of fresh air to the board and thank you and much success? Thank you. So much I also like Tom, welcome all the new board members and I look forward to on game which, together with everyone we get a chance, say hello to my granddaughter. She wants to jump back in there she's what one of eight to get back out there and we'll get the things done. Glad to have you guys aboard and I'm. Just a is something I know. Evie probably know this already, just from a little note out of my sector in zone, one to six community on programming that we have a new executive director and eruption Donny, she was promoted to the executive director of Zoma to six and next meeting. I will have her on and hook up some phone, so you can get to introduce ourselves. Thank you guys, for the time you guys in person, okay, this is Richard. Kazami I'm again also want to thank all the new board members for coming aboard. It's great I'm lebanese- american we've had very few Asian Americans on this board in the past or from the middle- east and I really appreciate having you guys on board. So thank you so much. Thank you. Your Willie Whitcomb say something mine. It's on mine just well, then every know that YouTube was very successful. I've been monitoring ticking and it's gone on and under update for the whole time and I wanted to make. One comment to Dino looks like Dino needs a shave. Do we see anything in Chad I know that I sent you Tom a statement to be made, and we got me, let me just say I'm on a laptop, so it's will slow here. We have say nothing in Q&A in chat the last ones, all just welcoming the new board members and agreeing with each other, and let's see the last one was from Jose dog sorry Jay rose at CCRB. The CCRB is still taken complaint regarding police misconduct, we're also conducting presentations virtually. Lastly, we will be hosting a Queen's board. Meeting on July, 8th from 6:30 to 8:30 p.m. for information feel free to contact dahi, Jhi Rose ROSC at nine one, seven, two, zero, eight, nine three to zero or via email at Jay rose at CCRB, DOT, NYC, Gov, I. Believe I also sent you a statement and it needs to be met. Yes, let me just give me one second now let me explain to the board. This is highly unusual, but we are not meeting in person. So tonight Tom usually calls up members of the public to speak tonight. He will be reading the statements of the public if any so Tom has a new job. I want to graze all right, I'm going to written public comment, but yes, Silverman. Welcome new book. Excuse me welcome new board members of cream word one. You were the most diverse group of new appointees ever to this clean board. I want to say, council members, Constanta meetings and then Braemar filling their promises that DEP candidates to diversify this board. This is an important step, ensuring that this Seabee both represents and, as representative of our community, to do your best work represent our community. We require that you actively participate, especially in the hard work of committees. It also requires you get to know the bylaws of this board and the rules inside open meeting law of the city of New York, and that you ensure these rules are followed if they're not funded with a copy of the bylaws. Please request it to all board members. Thank you for lected me to executive board. I was committed to doing my part to make this board transparent and democratic on behalf of our community. That was my goal, but I was a point to the board and I'm proud of the changes that came over my tenure here. Some of you liked it better back. Then you should resign as board members because you are not committed to our community. You are committed to whatever power you think, being a Seabee member brings to board members who do the hard work of serving our community by ensuring fairness and transparency and who get to know the issues in the action. What, before the board? Thank you I, hope you'll reach out to the new members and mentor them in order to serve the community. This board needs the support of staff, requires a district manager who is competent and committed to allowing board members to do the work not getting in their way ages. 25 to 27 the bylaws by the duties of the district manager as Committee Board members. It has been your role to hold staff accountable. Finally, I say no longer. Excuse me. Finally, I may no longer be a board member, but I am a member of this community. A beautiful, complicated, vibrant community deserves affordable housing bike Lanes economic justice opens face and jobs. We deserve a keyboard that very prioritizes transparency and fairness. You fund the police black lives matter in a spin. Do we have any other public comments? Motion to Adjourn I do have one comment: Murray if I can interrupt this. Is it's Dino? Okay? How are you I just wanted to say a huge? Thank you. The issues with the emergency homeless, shelters that were set up in the Dutch Kills area. It seems that the concerns were actually brought to City Hall. They were brought to the powers- that- be and every single person that I have spoken to that actually brought those particular complaints has said that there has been absolutely no issues whatsoever so whomever it was that actually did something and actually had conversations of the folks that are in there. Everyone is just a wonderful neighbor and there has been absolutely no issues whatsoever. Thank, You, Tina, so yeah hi I was asking: if can I copy the file AWS and the Open Meeting Law email to all members of the staff was my question: I wrote it in the chat. Yes, okay will the main Jaguar as one time they could go on the website, so I just also the old members. It's been a trying year for everybody and I think that we are Luke now and it'd. Be wonderful to bring all our thoughts and ideas together to the betterment of the community, so thank you for joining Community board, one. Thank you for being on community board one, and thank you all for your input. Thank you. You're very welcome. Maria I see Janessa Vanessa would like to say something. Yes, oh yes, Vanessa, okay, I'm, sorry, I did not see you. Thank you. Everyone! Thank you. Amy Thank, You, Marie I just wanted to reach out and say you know through these time, trying times that the communities of color it's dealing with. This is something that's not new to us, as well as the residents of the story, houses, Ravenswood or Queensbridge and west side, or just o communities of color at large, and we appreciate we appreciate the support that we have received from you all. We look forward to more support from you on an understanding of what our communities have been going through, especially through in the fact you do to the fact that this pandemic occurred. People have lost their jobs. I know the community of Astoria houses have really. We have lost a lot of people due to this virus. I myself have lost 49 loved ones, not all due to the virus, but this past Friday, my sister, who had was supposed to get a pacemaker in March, but due to the shutdown appointment, was canceled. She had a heart attack on Friday and now she's in a coma, and they have her children left to make a decision. So this situation has been devastated to a lot of us. My who had cancer. His funeral is on Thursday, so we've been through a lot of devastations. That has been very heartbreaking and depressing to us, as well as with this virus, and was everybody losing their jobs and for it to be where we wanted. Let it be known that our lives matter, but even the diversity of the community of color, also matter and I, feel it's very important, especially now going forward, and when we open back up and even during the summer, whatever possibilities we can make happen that we as a community board, reach out to all the communities, even if we do not hear from them to just see how things are going just to check and see how people are handling their lives. I've been to try working along with others in the community Thank You Evie, as well as with Queens, together with Jamie, trying to provide food and other materials about the Census and other, and even the coronavirus way they can get testing just making sure we check your wellness checks throughout the communities, just the story along on the city, and it's just that would be great, that we can all band together, sometimes just put away our differences of negativity and come to or something cuz. This is bigger than what we are and we need each other to be there for one another, and this is very important because we all are suffering it does not matter. What's your race or your color, your cream, but I'm, just asking that everybody please ban together along with us as one because all of our lives matter and all of our quality of life matters, and if we do not make something occur. This is just going to get worse and we need to make sure that we pass the word especially to our youth. They make sure that they understand the seriousness of this. We have a lot of people, that's not really taking this serious, not even just the young people, but all the people as well and throughout all our groups, just like you said earlier in the meetings how people are not properly doing their social distancing even at date as they go visit, these bars and cafes. This is a serious situation and I do not want to see it be a second way because we lost too many people, I lost too many people and I can't continue to watch. This kind of thing happen over and over again and within two months out of all my 57 years, I've never lost this amount of people ever but I'm just reaching out to you all to say. Thank you for all the work we have all done together. Welcome to all the new members, I look forward to you coming and banding together, I love the fact that we have a diversity that represents ability. Finally and I say: God bless you all, and may you all be saved and blesses- it's safe help to your families, Thank You Vanessa. We very well said thank you motion to Adjourn.",
            "summary": "Yes, the it is handicap accessible pursuant to code were required to provide a lift, an ad, a lift which will allow anybody who needs that to have access to the pool, and will that Currently, by the landlord and as a part of that renovation, they will be providing a an ad, a accessible handicap ramp along 34th Street, which is a main entrance to the Swim, School and 88 bathrooms, and all the ADA requirements as if it was a new use, correct.\nIt is just so important for us to get the funds we need for education, but that's not why you had me on the call So I'm just going to say thank you for all the work that you are doing and please we are here, follow us on Queen, I have not seen you since you moved into your new office at home as it were, but I have not seen you correct.\nSo I try to work together to make it a better experience, and There are people who are having preliminary hearings right now, instead of grand juries.\nYou know the interesting thing about running many offices in my life and in my past life is that we actually saw this coming very early, So. We started realizing that grand jurors we're not showing up a lot earlier than a lot of people realized it.\nCan only say this to you between me and between me and the borough, president and police and the Cure violence groups and the protesters we've been in contact a lot But I do know that when we had issues we were able to call up people straight away and say: what's going on out there, I can only tell you that it was much more safe.\nTonight, share our proposal for the Crescent Street protected bike, lanes.\nIt does include a protected bike, lane that runs north- South in Astoria, and so overall.\nThis plan calls for building out a connective network throughout all five boroughs to link neighborhoods together, and so we are here to make good on that commitment to bring a protected bike lane to Astoria.\nThat's the case, protected bike lanes can help to calm traffic, shorten the crossing distance for pedestrians and calm the turning vehicles with some of those painted markings that you see with the islands.\nThe pink lines are the shared lanes or sharrows, which are helpful for connecting different bicycle routes together and the dark green lines are the protected bike.\nOur next step in building off the network is bringing a protected bike lane to the middle of the neighborhood and also building out some additional connections.\nWe started a workshop process in February on this year and we hosted this to gather feedback about the routes and designs and various destinations that people wanted to connect.\nThis workshop in February vast majority were residents of the district, and some of the themes that we heard from participants were an overwhelming support for a bike lane that connected the RFK and Queensborough bridge together this bridge to bridge connection specifically on Crescent Street.\nThere are a lot of questions about how this would work in front of their building and so we're continuing to meet with them and discuss how the design would function at their location.\nWe talked about two different design concepts for a north- south protected bike, Lane.\nThis map shows how a conventional bike route network and a protected lane along Crescent Street would fit together.\nThose are simple bike lanes that do not change the travel lanes or the parking lanes just very straightforward, and this would complement a Crescent Street protected path.\nSo recently, D- O- T has been introducing temporary bicycle routes throughout different neighborhoods in the city to provide quick short- term transportation options for this time, when it's challenging for some people to travel by subway and bus when those options are limited and we do expect to see more people continuing to ride.\nPeople are receiving, so bike lanes help facilitate those.\nIt involves either repurposing a parking lane or a travel lane into the to a bike lane, and so, as I mentioned so far, the barrel lane is in place between Queens Plaza North to 34th Avenue.\nWe use the additional travel lane on the east, side, that's repurposed into the bike lane and then the majority of the project is the green line on the map from 38th up to 34th Avenue, where the parking Lane has stripped it off from the curb in place of that.\nSo: the bike lane is separated from the travel lane by that what we call a floating parking lane and so to get into our standard proposal to the design following the temporary route.\nThe project route of Crescent Street is located in a vision, zero priority corridor, which means that it has a relatively higher rate of crashes involving pedestrians, and so this is a high crash corridor with nine people killed or severely injured over a five year.\nPedestrians, cyclists, people traveling in cars, and what you can see here is that people all different types of users are experiencing injuries along Crescent, Street and, as I mentioned earlier.\nSo the majority of our project proposal includes a parking protected bike lane and before we show this.\nIt's also an important It creates a new transportation connection at a really important time, as I mentioned earlier, that we expect to see a lot more people starting to ride as their main transportation.\nSo going through the different project segments will go back by block these sections are broken down based on the existing conditions of the street, so we're going to start at the southern end, And we'll work our way toward the north.\nMany of you know a lot of times, people will use that third right turn lane to kind of jump ahead of the other cars.\nThis uses here is a painted buffer and flexible delineators to separate the vehicles from the bike lane and with the parking along.\nThe next segment is the largest portion of this project, and this is that parking protected, bike, Lane design we talked about earlier.\nWe did look at the traffic volumes and turning movements, and so at key locations where we saw that there is more traffic along this stretch, we're planning to introduce some right turn lanes, leading up to the intersections, as well as some rush hour regulations on the West side to alleviate places that have a little bit more traffic.\nWhen we've installed protected bike lanes at unique locations such as hospitals, Health, centers, schools, hotels that have some different unloading and loading needs for passengers, we use special.\nWe provide a wide area where people can eggs with their vehicles in that tan So when a cyclist rides over it, they can feel several bumps and it alerts them that something is changing, ahead, that they need to pay attention.\nSo, when does redesigning the street to include the parking protected bike lane.\nA lot of different sections and I just wanted to give you an overview of how our proposal actually really breaks down into two different design types for the bike: lane.\nWhere you know a vehicle could pull over to drop someone off without blocking the traveling, but without encroaching on a bike lane as well.\nYou know I've seen some of them on Second Avenue in Manhattan places like that, but I think that at this point, since bicycles are going to become such a large part of our transport community for the foreseeable future, I think we start.\nWe use in- house crews, it's part of our business as usual' expenses, but What we've really found and I think what New Yorkers really appreciate and what our city needs are safer streets and especially in the time of Covid-19, where some folks are still trying to figure out how they're going to get to school to their families to work.\nSouth connection is going to provide a reliable, safer transportation option for the folks in Queens, and particularly in your community board.\nThe, there's a pop- up lane now for Crescent Street, which is intended to help us during Kovach, because biking has increased.\nBut it has given us a chance to see a lot of different, curb uses that we can accommodate and design interventions to include with the more standard proposal, so in some way, as we've been able to really test out the new layout as well.\nI know there are a few people from our bike unit that are also tasked with going out once a week.\nI, just said: unmute, okay, quick question that just came up with a committee meeting, especially you're, on the outer world way of Queen's Queensboro Bridge, what, Will vehicles and there are dozens of different vehicles- are actually authorized to ride.\nYou know sorry give way to two vehicles going straight: Can we educate the community so that everybody, so that interface of bicycles and automobiles and an interface of pedestrians, is more, is more managed and the role the rules?\nWhat was what will be the best way for us to flag that to you in order for that to be repair, because you're definitely challenging, and sometimes you have to get out of the bike lane down to the traffic A number of potholes were just recently filled already on the route, and we are working to see whether there is surfacing Obviously alternate side.\nI'm, not sure I have to double- check, but when that does get lifted like the mayor, did that a couple of weeks ago, just so that the Sanitation trucks could get in when we sent our crews out , we can't get to all of them like in the parking lane, or You know, people, as they were when meeting to the temporary bike.\nActually I just wanted to bring out to the larger group a couple of the smaller details we discussed on the transit committee meeting about this presentation, notably Helen I , believe brought up the kind of sewer grates that the bike lane will be running through which Are not too good for bicycles, and we also discussed the creation of a bicycle lens traffic signal at Queens Plaza to protect bicyclists as they make that right turn: acrosss.\nYou guys dressed the issue of people using wheelchairs, powered or manual travelling in the bike lane quite often which a users would rather ride in the street, because then they do not have to go, up, curbs and down curves and all those issues Obviously you know we do have a policy division and within that policy division we do have someone who specifically deals with people with disabilities and advises our urban planners and designers and engineers, etc.\nI would be interested to see if someone in an electric wheelchair has ever been summonsed, because you know people need to have an accessible way to get from point A to point I'm, not the authority on that And I'm, going to have to take that back to legal I can consult with NYPD And that people with powered wheelchairs, where there is no bike lane on just a regular old- fashioned Road.\nBut if they're in a protected, bike, lane and bikes want to come behind them or whatever there's going to be a traffic jam in there.\nMuch of the city has a huge problem regarding vehicles, parking and bike lanes, putting cyclists at lists and lack of enforcement.\nWith this section, where we have one traveling, it is important to provide the ability for an emergency vehicle to pass through that bike lane and for sweeping and sanitation as well.\nOne thing that we are, including with this proposal, is there, are a few locations where we're updating some of the regulations on the West curb which can be used as a quick pull over spot for delivery instead of blocking a bike lane.\nWe have had seven emails, mostly in support of this bike, lane and I 'm, going to ask Amy and Richard to read them into the record.\nHis email says, please make a permanent protected bike lane on Crescent.\nI am writing in support of the bike lanes being planned for Crescent Street between the Triborough and the Queensboro Bridge.\nIt would really help along the Crescent Street bike lane with all the supermarkets and such again.\nCrescent Street is the ideal location, because it's the only direct route for people living north of 34th Avenue I'm, also hopeful that the addition of the bike lane will help slow traffic on the street, making it safer for pedestrians.\nI. Do hope that the bike lane on Crescent is approved and no one is willing to cave into the where Will I Drive and where will I park.\nMembers I would like to say that the recent bike lane has been an absolute, absolutely terrific and welcome addition to Astoria.\nLastly, I would like to say that, with everything that is happening during Colvard, 19 I am looking for new ways to travel, to and from work while having to enter a crowded, subway I, generally love taking public transit, but will be limiting my commute in order to reduce the chances of coming into contact with the virus.\nI would like to thank you for your work and helping implement this bike.\nWe currently have partial bike lanes on 29th and 28th streets allowing for bike travel to and from the Queensboro Bridge, but they are neither adequately maintained or protected when traffic increases drivers often take their road rage and careless habits out on law- abiding bicyclists I have seen it and suffered from it.\nA protected bike lane on Crescent would increase safety and traffic flow for commuting, Astoria LIC cyclists tremendously and serve our community well, I'm, Scott, Phillips and last.\nOne I write to express my support for and encourage you to vote in favor of their proposed bike lanes over Crescent Street Astoria.\nIn addition to improving the safety of our community bike lanes will promote participation in physical activity and support.\nThey voted unanimously in support of the Question Street Bike Lane, with the stipulation the duty would accommodate any specific matters or issues raised by the Community Board office.\nHaving, said that, the Committee Board one area, Astoria, older storia, Woodside and parts of Long Island City- is currently yet 52.7%.\nAlso I wanted to let you know that we do have a self- response rate map that is available to the public by visiting the 2020 Census Gov, where you could look at your community.\nMy message to you is very simple: today, you understand your community are the people and their priorities and their needs, and you know how effectively deliver the senseless message to them in ways that Census Bureau can never cheat.\nI wish you all great health and welcome to all of the new community board members I'm, looking forward to speaking with you all speaking with you all and working with you all much more closely.\nYou have all of you together here that I'm introducing of you, the good people that had been working for the community long time And it's my pleasure to be with you, and it has been excellent, that the thing that you've been doing the bike, land and I saw the board work on the ferry ride and all of those things that, when I'm being couple of meeting before so I'm very excited to work with all of you And we will together will make better storia and Queens.\nJuliet and I have been a resident of a story for 44 long years, An active community leader in my Campina community in New York And I've, been attending your meetings in a story, a matter as an observer, and tonight is my first meeting with the community Board as an official member Very, big Irene from sending the generic office just trying to get in okay, hey guys, Irene.\nThey have to report to the community board when there's a transfer of ownership of more than 80 percent of the business here, there's going to be a hundred percent transfer of ownership to a completely new owner of the applicant entity, The business is not currently open from what we understand and the committee has been told by the new owner that it was actually closed.\nYou are committed to whatever power you think, being a Seabee member brings to board members who do the hard work of serving our community by ensuring fairness and transparency and who get to know the issues in the action.\nThe support of staff, requires a district manager who is competent and committed to allowing board members to do the work not getting in their way.\nThis kind of thing happen over and over again and within two months out of all my 57 years, I've never lost this amount of people Ever Thank you for all the work we have all done: together."
        }
    }
}