{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UCHip-wiEtSSRtJtA2OoChOA",
            "title": "CB 3 Manhattan - SLA \\u0026 DCA Licensing Committee - Sept 14 2020",
            "publishDate": "2020-09-15",
            "shortDescription": "Agenda\\n1.    Approval of previous month's minutes\\n2.    Amend administrative approval stipulations to require one year of operation before applying for an upgrade\\n3.    District Needs Statement\\nNew Liquor License Applications\\n4.    Hakka Cuisine LLC, 11 Division St (op)\\n5.    Cenoté (Merse Group LLC), 109 Ludlow St (op) (WITHDRAWN)\\n6.    Oola's Kitchen (Javisst LLC), 177 Orchard St (op) (WITHDRAWN)\\n7.    Jose Luis (JoseLuis Corp), 186 Ave B (wb)\\n8.    Avenue A Gourmet LLC, 202 Ave A (op) (WITHDRAWN)\\n9.    El Castillo De Manhattan Rest Corp, 207 Madison St (op)\\nItems not heard at Committee\\n10.    Two Boots East Village (Double Shot TB East Village LLC), 42 Ave A (wb)\\n11.    Prim Thai (Krua Thai NYC Corp), 78 E 1st St (wb)\\n12.    Desnuda (Warlord Enterprise LLC), 122 E 7th St (alt/wb/change method of operation: ceviche-based menu to vegan soul food)\\n13.    Zazzy's Pizza (86-88 Stanton Smalls LLC), 173 Orchard St (wb) (WITHDRAWN)\\n14.    Superiority Burger (Faded Rainbow LLC), 430 E 9th St (wb)\\n15.    Clandestino Cafe \\u0026 Bar (35 Canal Cafe LLC), 35 Canal St (op/corp change) (WITHDRAWN)\\n16.    Vote to adjourn"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 136,
            "um": 207
        },
        "wordCountFullTranscript": {
            "business": 57,
            "hours": 42,
            "restaurant": 41,
            "time": 41,
            "applicant": 37,
            "people": 32,
            "license": 32,
            "businesses": 29,
            "tables": 28,
            "years": 26
        },
        "wordCountSummary": {
            "hours": 12,
            "business": 11,
            "restaurant": 8,
            "years": 8,
            "applicant": 7,
            "music": 7,
            "businesses": 7,
            "facade": 6,
            "operation": 6,
            "time": 6
        },
        "fullTranscript": "Okay, so we're gonna, I'm gonna go through some guidelines, quick, while we're waiting for one other member of our committee to join so just so. Everyone knows the meeting is being recorded. This is the sla and DCA licensing committee meeting if you're not a committed member, please sign in by entering your name and affiliation in the chat box, which you can find in the toolbar at the bottom of your screen and then any items you wish to speak for against or have any questions about. Please keep yourself muted. Unless you're speaking on your desktop computer, you can use the microphone button in the bottom of your screen and press the space bar to temporarily unmute yourself on a phone. You can tap the icon at the bottom of your screen. If you wish to speak or have a comment on any of the items, you can raise your hand using the participants tab and on the phone you can press star 9. for each application. The chair is going to give a brief summary of the application. As it's been submitted, then the applicant will have a chance to speak after that. We'll call in any members of the public that wish to speak or ask questions and the applicant will then have a chance to respond, and then the committee members will discuss and come to a resolution. So that's generally how the meeting is going to go and stop sharing this document forward moment. I haven't had a response from herman. Yet, okay, while we're waiting, as quinn said, could you please sign into the chat box so that we know who you are because I see that only two people have signed in, but I see that there are more than two people on video and that's helpful for us to take attendance also, and you should give your name not just the application you're applying for the location you're applying for please hey clint. Can you send me minutes the template? Sure thanks, I guess I forgot to do that. I had them. Open was maybe gonna do them, but you're more than welcome to I got you. I got you it's just okay. I just sent them to you jesse, thanks, so alex. We can't hear you if you're talking clint, nothing came through. Let me see it's out in my scent right now. Maybe it's just taking a while: it's not a huge file, it should be fine. Sorry, I tried calling herman and herman is 15 minutes away, so I think we can start okay, let's I say we go ahead and start so before we begin like I said, please sign into the chat room and, like clinton said so that we can. This is the way that we take attendance, and that means that you should sign your name in addition to the corporation you represent, I just sent it. I forwarded it again, jesse so yeah. It just came through just now. Okay on the forward, for some reason: okay, all right jeffy. Let me know when you're ready, sami's iphone. You have your hand up. Do you have a question or do I'm good alex? So I'm good to start? Okay, sammy's iphone! You have your hand raised. Do you have a question? Okay, who doesn't know? Okay, all right, we're going to begin the meeting, and this is the sla DCA licensing committee of community board. Three excuse me from the chair, alexandra militano. In addition, there are four other committee members present and we're expecting effect, but we're going to begin before he arrives, I'm going to go through. You can see that we've had a number of withdrawals on our agenda for tonight, specifically three and I'll just separate the agenda into what we would hear and what would not be heard generally. One of them was this afternoon. So it's a late withdrawal, so I just want to alert anybody. Who's come for that particular item, so the withdrawn items are 109 ludlow streets, 177, orchard street and 202 avenue, a that's the one that was true this afternoon that they've withdrawn from this particular agenda doesn't mean that they're never going to be heard. If you have an interest in hearing the applications for those locations or those specific applications, you should look to any future community board websites they're published every month at the beginning of the month or at the very end of the of the previous month. So a new agenda should be published after next tuesday, I would say by next thursday for October. If you have an interest in those items, they have not heard a committee, two of which are also struck, are items that are administratively dealt with by the office and again those also the fact that they're withdrawn on this particular agenda doesn't mean that they won't ask to be heard or considered by the community board at some future point and will appear on a future agenda. So if you have an interest in the ones that are withdrawn from that portion of the agenda, which is dazzy's pizza, 173, orchard street and clandestine, which is okay, I can't see it. Can you bring it up clint for a second? Oh sorry, I'm sorry yeah 35 canal. I couldn't remember what it was, but if you have an interest in those, then you should also look for those for on a future agenda. We're going to move to what is on our agenda now we may not take the items in order. We may take the applications before the other agenda items to be heard, which are two numbers two and three, but we do first have to move to an approval of previous month minutes to officially begin the meeting. So I'm going to do that first and ask if there's a motion for the approval of previous month minutes or an eye motion. A second thank you, okay and then we just can you go through the roll call sure jessie, oh clint, or whoever either it's fine? Okay, so jeffy back here, ellen lell here michelle cooper smith, yes and herman, you it no, not yet! Okay and I'm yes, I present and me also okay, and then I'm going to move two and three to the bottom of the agenda so that we can go to the applications first. I do, however, note- and we usually don't have a representative from an elected official's office president, but given that we do I'm going to give her an opportunity to speak if she wants aura or aldo. Yes, I'm sure he's connected I'm just here to listen for today. I know that there were some businesses that were reaching out to our office and we just wanted to be present. Okay. Well, if there's anything, you want to contribute to photoshop thanks yeah, I'm just here to obviously really cool. Today, I don't have anything to share, but thank you. You're welcome all right, we're gonna. First, move to item number four, and just before we get started, there's a few people that have just joined since we made the announcement. If you could use the chat box to sign in with your name, your affiliation or, if you're, here, to speak or against or have questions about any of the applications. Please use the chat box, that's how we take attendance and use it for our signing sheet. Thank you, clint. So item number four: is it an op license application for 11 division streak? The sla notice is for a restaurant with a whole menu recorded music and no outdoor space on the ground floor and it's a second floor mezzanine there was a or have there have been long-standing wine beer licenses at this location, most notably saline restaurant, which we last approved. I think the business remained the same at that point, but we last heard it in december of 2013, with stipulations to operate a full-service chinese restaurant serving flew to within one hour of closing, having hours of 11 a.m, to 2 a.m. All day having a closed facade playing recorded background music, only not using outdoor space, not applying for an alteration without first coming before the community board, not hosting pub crawls or party buses, not having late lines and not having happy hours. The cfo on the questionnaire that was submitted to us is 200.. The applicant also submitted letters from DOB, which seemed to indicate that the cfo is 75 per floor, which would be 150., there's 15 tables in 94 seats, they're, not divided according to ground floor and mezzanine, a 10 foot bar with six stools. It's there's, no indication of where that's located proposed hours are 10 a.m to 2 a.m, all day a kitchen open all hours serving chinese food. I believe the letter from the attorney said cantonese there's no answer about the facade three to five tvs recorded background music, no promoted events scheduled performances or events with covers. 10 private parties per month, no security, no sound proofing, no pub crawls or party buses, happy hours to 7 pm, no wait lines and an agreement to have someone oversee staff or to make patrons and noise outside the applicant, counted five ops within 500 feet and noted the proximity to a school, the school's directly across the street. If the spf 124 submitted, the applicant also submitted a proximity report from the sla which says it's 175 feet from this location, the applicant submitted its own drawing or diagram indicating that it was 376 feet away. The applicant also submitted letters of support from the chinese chamber of commerce as well as 14 other association area associations or groups, 17 residents from confucius plaza and then four other people who didn't reference any affiliation or the context in which they knew the applicant. The applicant, I think that's it. So this is the opportunity for the applicant and or his representative to make a presentation about the application or to clarify any of the things that I said or amend any things. If any things are changed, any of those things are changed: go ahead, hi everyone! This is jake presler from helper, only be I'm representing with wade lee for author cuisine alex. Thank you for your summary. There are just a few things that I want to add and clarify the there was an additional survey conducted by landa simon, which is where you get the 376 feet. It was a professional survey conductor. I believe in March of this year, and also there is one error in your packet. The chinatown court did not comment on this. Application did not comment to our applicant and his attempt to get support for this application. So in your packet it says that they did provide support. They did not provide support or opposition to this application wade. I want you to be able to speak to the board about what you would like to do with this space and how you envision this project going forward. Wait if you're there please unmute yourself, so that we can hear you, oh okay, all right. It's waiting on the principle of the hakka cuisine, so we're just trying to open a cantonese cuisine, as in the in the restaurant and also you know, I have my kids and go to school in the neighborhood. I have other business. I have other business in this neighborhood too. So I understand I want to find my business portfolio within your packet. You should have a cv for weight as well as the manager. The proposed manager of the space is that it are you finished. Yes, we welcome any questions. I'm sure that you have questions and we want to make sure that we have time to answer all of them for you well before clint calls on anybody. I just want a couple of questions to clarify. Is it an actual second floor? Is it a methane? It's a second floor. Okay, and what's the breakdown of tables and feet per floor? I'm sorry. Can you say that again, please, I think in seconds at second floor we have. We have two rooms and about seven total, seven tables. Okay, what's the what's the number of tables and seats on the first floor, then, first of all we have about. Maybe I think about a tables: okay alex I'm counting just so that I can give you the an accurate count and I'll. Let you know when I'm finished with that, okay sure and it would be good if we had a breakdown per room and then I also have one other question. No, maybe two other questions where the bar is on the ground floor. Is that yes and the upstairs rooms are those for dining. Excuse me, the upstairs rooms are those just private rooms for dining. Yes, so there's additional dining room. Okay and is the facade fixed? Is it closed or does it have windows and doors that open other than the front door as it is now, the facade is fixed. Okay, thank you all right, then. Yes, and I just need to know the tables and seats they're about 40 and 40, so both of the floors have pretty much the same amount of seating. Just the table configuration is different. There are larger tables on one of the floors. So there's two rooms with seven tables and forty feet: correct the tables and seats divided per floor of her room. Excuse me: there are about four for each four tables and then four tables fourteen per room ish that comes out to a little less than you said, 14 that comes out to less than the 94 seats total that he gave us the total right. He said, eight tables on the graph four seven tables on the second floor- that's 15 tables, which is what we had as a total. We had 94 seats, but either by his numbers, your numbers or the breakdown you gave. This is like 86, it's a little bit less. So is that, are you counting the bar as well or not yeah? I was there would be yes, you're right alex. I think that I missed a few and just for the record, I it would be 90, it would be 94.. It's not the lower number that I said to you earlier. Okay, so it's is it 94 with 40 on the ground floor and then a breakdown of well? Is it, including the stools? No, the stools would be separate, so 100 seats altogether. Okay, so is this 40 and 60 per floor? Is it 50 and 50 per floor? How is it 1460 is what I'm seeing 40 on the ground floor and 60 in the two upstairs rooms, correct, okay, all right I've. Just all I've done here is ask clarifying questions about the application just so that we have complete information. Is there anybody who's here? Who wants to ask a question or make a comment? There's an audience member. I didn't see anybody. There was no one. No one signed up to speak to this item. If anyone would like to please raise your hand or unmute yourself and speak okay, I don't hear anyone we can move on to committee. Members then do. Is there anybody who has any questions or wants to make any comments with respect to this application? I don't know I don't really I mean I was at first I was questioning the distance to the school because I think the main entrance is on division street for that school, but it does appear to be more than 200 feet away. So I think it's fine, I mean if we were to approve it. We can include what the sla has what the applicant has submitted and just asked them to evaluate the proximity. In addition to you know at any other recommendation, we're making sure ellen or michelle no comment, I can confirm that the entrance to the school is on division street, but it's diagonally across the street. So I don't know how the measurement is done per sla regulations, but it is like diagonally further down. It's not diagonally straight across you know, division. So then you'll hit the eight of the for the exterior of confucius, plaza yeah. I looking at it on the map, I'm mapping it out. I it's. I think I agree that I think it is more than 200 feet. So I think it's fine can jake go ahead. I was just gonna say we can still, I think, do, as you said out mentioned, alex that you know. If we do decide to approve it, we can most list a resolution or a a, whereas clause, just asking them to confirm that it is 200 feet jake. Can you or the applicant speak to the specific experience, because I saw that the applicant had businesses in the community, but I didn't see very much other experience and I know you've been here yeah raid. Would you like to speak a little bit about your other companies that you have and your involvement within the neighborhood? Yes, first of all on the other prisons in chinatown, and that's why the social adult daycare, which are seniors no case that confuses parser. I also own some home care agency. Also, the main offer is users as computers which compress so, and then we I'm we have all like about 4 000 employees at the home care agency and also as a community association and the current president of the lee fam association located at 41 mastery and also involved with the chinese chamber commerce. So I do a lot of community services in the area, so I'm very familiar to the community and my kids go to school at transfiguration too, and so this would be your first restaurant within the neighborhood correct. I was working at the fooling restaurant, the former restaurant, and when I was about to try to start a business, I yeah I worked there about a little bit more than two years to see how restaurants are and how the business will be. So I feel comfortable and confident on the business. Thank you what what's the experience of the person who's managing the business? Oh, he has a lot of experience and you are the biggest restaurant in chinatown. He was the. He was a manager over there for almost 10 years of which business of which business ping pong ding from august 2005 to may 2016.. Something like all that does anybody else have any go ahead? No, thank you! That's okay! Did you want to finish? No we're all set. I was just going to say and then his other restaurant was the new chaff restaurant. So a combined experience of over 20 years in a restaurant management, okay yeah, the committee members- should we go to the making of a resolution now and by the way herman just joined us as well so sort of but he's on the phone. All right, you want me to go to the making resolution I'll do that, so I propose that we make a resolution to the night unless it agrees. The applicant agrees with stipulations going through the, whereas clauses it would be what the applicant is applying for, which is an op license the elements of the application, and I would amend what the information that we already have to include the floors, the breakdown of tables and seats and where the bar is located and that the facade is fixed. What the business has been a long-standing restaurant with a wine beer license, which we last heard in 2013 when the license for that business was issued. The applicant experience, which I would now include the additional managerial experience, as well as the fact that the applicant owns and owns businesses in the community and has other ties to the community. We would still include the letters of support that I referenced before the number of ops, as well as the issue of the proximity to the school that the applicant submitted a proximity report from the sla indicating it's 175 feet and another productivity report of its own. That's 376 feet and asking that the sla investigates the distance from this location of the from this location to the school given that discrepancy or that difference, but that if it determines that, it's not within 200 feet of the school which I'll identify the resolution that we would deny unless it agrees to the following stipulation so it'd, be chinese, restaurant or the kitchen opening serving food. All hours of 10 a.m to 2 a.m. All day, no outdoor space, closing the facade at to ask me having a close fix, slab, sorry playing recorded background music, only not having djs live, music, promoted event, schedule performance or events with covers having 10 private parties per month. No more than 10 private parties per month, not applying for alteration without first coming before the community board, not hosting cup calls or party buses, not having unlimited drink specials, having happy hours to 7 pm, not having weight lines outside and having a staff person responsible for overseeing crabs and noise outside and posting the stipulation form inside the business just to the liquor license and immediately addressing any resident complaints and providing contact. Information to the community board so that we can forward contact information to residents or any other interested parties. Is there a second, a second all right, all in favor, all right, first ellen so ellen is president of voting ellen. You have to tell us your affiliation so that we can record it because it's required with the president of voting. I have a conflict because I work for one of wade's other companies. Okay, all right and then herman was herman muted. Are you voting on this, or are you opposed or obscene you're voting? Yes, okay! So I've? Yes, one person, okay, all right! So jake. What will happen is I'll finish, drafting the stipulation form and I'll give it to the office tomorrow and they'll forward it to you. Are you the person who should be receiving the stipulation form? Yes, please, okay, anybody else, besides you or just you wade can as well, but I would like to be primary. Do you need me your email addresses so that I can include them with the form yeah of course, so it's j, a k, e DOT, t r. I s l e r at halbron levy, DOT com. I can spell help ron levy for you. If you'd like it's up there, okay, perfect and wait. Yes, wait w-a-d-e and homecare.com yeah all together golden touch. Thank you, okay, thank you and alex. Would it be helpful for you if I sent you or edwin in written, perform the breakdown of tables and chairs per floor? Would that be helpful? I'm sure that would be fine, okay, I'll, send it to edwin and make sure he has it in the morning. Okay. Thank you. You're! Welcome thanks. Everyone. Thank you have a good night. Okay, we're gonna move now number item number seven, which is an application for 186 avenue b. This is that's all I noticed as an application for a restaurant, with a full menu recorded music and background and a backyard on the first floor. This has been a long-standing restaurant with different names, so various restaurants, the most recent one, was administratively approved. A beer wine license in february of 2017, with stipulations to operate a full-service thai restaurant serving food all hours having hours of 11 30 a.m, to 11 p.m. All day, not using outdoor space, closing the safada 10 playing recorded background music, not applying for an alteration without first coming before us, not hosting pub crawls or party buses, not having unlimited drink specials and not having happy hours and not having weight loss. There was no cfo listed as part of this application, 19 tables and 62 seats with 10 tables and 20 seats inside and nine tables and 34 seats outside in the diagram that was submitted, a 12-foot bar with no spools lifted. But then I counted six stools in the diagram that was submitted, a kitchen open all hours serving spanish italian food, a closed facade, an unspecified number of tvs. I think it said to be determined recorded background. Music now promotes events scheduled performances or events with covers. Eight private parties per year proposed hours are 11 a.m to 12 a.m, all day inside 11 a.m, to 10 p.m. All day outside no security, no sound proofing, no problem calls with party buses happy hours, 8 pm no wait lines, there's no agreement about having somebody crowds and noise outside I'm sorry. Okay, there are 11 ops within 500, and the applicant listed no license experience, but managerial experience at a restaurant on mulberry street for 10 years. This is now the applicant or and or the representative if the applicant has an opportunity to make a statement or give a presentation or clarify any of the information that was previously provided. Most of this is from the questionnaire that was submitted by the applicant. Go ahead: hi goodnight, thank you for the summary of our business, I'm diego correa. He is jose luis bardesio and we are the owners of partners of jose luis. Thank you very much, your first time for vp me and the people working for me for me the opportunity to be your neighborhood. This is a special moment for us, because it's the first restaurant have me and him I'm working in mulberry for so many years. My position, my last position is I was a manager and I tried to do something good for the neighborhood, something good for the people working on something good for the customer. I really appreciated you listen everybody here. This is diego dressen jose, and this is the chef. The name is samuel he's from italy. Thank you very much for everything. Okay, I don't know you have any question for us. Are you here on your own or are you here with a representative just so you? No, I don't. I want to make sure I'm not excluding anybody yeah. We filled it out without a president, but he's not here with us, so we are here our own okay, thank you, clint. Is there anybody who's signed up to speak through this or who's raising their hand? No one is signed. No one is signed up to speak and at the moment I don't see anyone raising their hand. So then, maybe we can go to asking questions and coming to a resolution. This might have been administratively approved, except that it has a backyard use. So we have. We are hearing it at committee because it includes outdoor space. Some of the businesses in the past have had outdoor space at this location. Many of them have been buying. I think where, whenever there's been an issue, it's been, the issue has been with the outdoor space, so I think we just want to make sure that the outdoor space is going to be utilized as an extension for dining, as opposed to just you know the area where people can stand and congregate. If that ever happens again, although it's happening now, so it could happen in a backyard. I suppose so is it your intention to have just seats and tables and seats for dining and just have dining in the backyard? Yes, it is, as maybe some people from the community working last weekend, our we just have a dinner in dining tables and that's our purity just serving and closing by 10 like and serving you know because, as you say, mostly of the people right now or the restaurants only can open outdoors and that's one was the main reason that we take this place because we want to take give the people the right to don't go outside, because sometimes you see outside in the open streets, it's been accidents. It's been a lot of things happening so inside in the backyard. Some people that can come these days say that they feel more safe, leaning out there in the back. There is more closes more like safe. But, yes, our intention is only dining and closing at 10 pm like every day and also the bikes are the decoration. If you come in, I promise it's so beautiful and 10 o'clock me him and everybody here granted. If the bike jar starts. To close, it's closed, there's no musical. If you want to come here, if your neighbor, you listen, the music is very down, they are very quiet. Spa is really something nice and we rested for everybody. Arrested for the neighborhood are referred for the freedom of another person. Thank you. I do. I have one question alex, so you did mention music. So are you having speakers and music outside? No really, we have on like those these days. You know this small speaker that you complete sometimes yeah, but we pulled like really low and we turn up like, but at 9 00 pm. We turn off, that's it, but it's not like us, because we don't have anything outside like a speaker or sound system. No okay, it's only there it'll be music, that's simple! Okay! So that's I mean I don't necessarily have a problem with that. I actually used to live on the sixth floor above in 186, so I was there for many years and once as alex mentioned, some of the businesses were fine with the backyard space, the ones that the noise did tend to be a problem were the ones that probably illegally so had speakers outside and the music just seemed to carry. Even if it wasn't loud it. You know those are all tenement buildings and it just so. I you know just you know, don't have speakers outside, and I think you should be fine. Yes, we don't. We don't really have, because our representative told us about it and people who can hear from the from the neighbor like recommenders, don't make a sound and we just have to have a space when people complaining like calm, relax, safe and that's our idea, yeah. Okay, anybody else, jesse, michelle hermann, ellen okay, so my only recommendation would then be just to clarify clint's point: is there shouldn't be music outside 186th avenue b? That particular yard is abutted by buildings right so there's a building above and then there are buildings on all sides so really other than the people which is going to cause enough noise. There shouldn't be any additional introduction of sound, so there shouldn't be music outside at all right. It should just be the purpose of them being outside and being able to eat the benefit, the benefit of that space, as opposed to some of the other more problematic ones. This is not necessarily a little canyon, it has the park and the playground behind it. So it's not. There aren't as many buildings for it to echo off of so. Hopefully the voices won't be as much of a problem as they are elsewhere either, but okay, you're really you're. Really. I mean you're really clear on that because before somebody told me about that too, you know so thank you for saying that. Thank you so much all right. Should we go to the making of resolution. I would I could make the resolution that would be to deny and love but the following, whereas what the application is for what the elements of the application are, what has been at that location so that, like location, whether it's had an opi license or a beer wine license, has long been a restaurant in some form the most recent history we have for that location and when the license was issued for that business, the number of ops in the area, the applicant experience. I know one person that one principal wrote 10 years experience at the business on mulberry street. Is there any additional experience that you have operating an eating and drinking business or working in an eating and drinking business? Yes, I've been working for like more than 10 years, like managing restaurant and like helping in accounting getting licensed certifying with the health department. I have my, I think I got my food permit since like 15 years ago, so I've been having a lot experience like more than in the front restaurant in the back restaurant and my partner here. Jose he's been the opposite. He's been having like a 20 years in wrestling business in the front, so that's why we partner together, because he knows everything about them and then the last 10 years at the restaurant on mulberry street is that right. He was 20 years of period yeah. I was with him in this restaurant too, because this restaurant used to be it. Oh he's owned it by one owner that I work for him and he had four or five restaurants in that time. So I was working for the first person and he was working for one of one of the restaurants that you mentioned there. Okay. So then I would, in speaking about the applicant experience, I would just amend what we previously knew and include that one principal has more than 10 years experience in the back room operations of a restaurant and of restaurants. Excuse me, and the other one has more than 20 years, with the last 10 being at the address that I gave before and then given the circumstances, given that this has been a long-standing restaurant, the location has been a long-standing restaurant and that they're seeking to operate a restaurant with moderate hours. I would deny, unless with the following stipulations, so it would be a full-service spanish, italian restaurant with the kitchen open and serving food during all hours with hours of operation indoors of 11 a.m, to 12 a.m. All day with, with a closed facade, a fixed facade, recorded background music, no live music from other events, scheduled performances or events with cover fees, no more than eight private parties per year, no alteration without first coming before us. No pub crawls or party buses, no unlimited drink, specials, happy hours to 8 pm no weight line and having someone what it means to have. A staff outside to oversee crowds and noise means one of your staff. Members is just responsible for making sure that there is nobody. It doesn't mean somebody's standing out there all the time, but making sure that there's no crowds or noise outside on the sidewalk okay, so no the staff outside to oversee crowds, annoying are staff responsible for overseeing crowds and rise outside and then with respect to the backyard that it would be operated as an extension of the restaurant, with the debt for sit-down dining only with no more than nine tables and 34 seats and hours of operation of 11am to 10pm all days and no music. I have I have one question: I want to ask the applicant, so she mentioned a closed, fixed facade, your front windows. Do they open sony? Can you sit again your front windows at the front of your business? Do they open? Yes, because we have one door and one window, but the window does open. Doesn't it that window does open correct? It does happen. Okay, one thing alex yeah the window, the window over the front window. You want me to amend it to closing at 10. Yes, okay, all right! Is there a second I'll? Second, what do you want? Jesse? You want to do it to the person all right, all in favor aye, that's everybody herman's raising his hand, yes opposed to stain. There's nobody left, so I'm just saying it okay, so you have to sign a form with the method of operation with your method of operation. It's a stipulation form. I have to send it to you and then you sign it and send it back to our community board office. But I have to do that because we're on this virtual meeting in this virtual meeting, I have to send it to you via email, so who should I send it to you one or both of you and what email address for me? Okay and you're, diego right! Yes, is the internet man? Okay, go ahead! What email address diego t-I-e-g-o, c-s and charlie, oh 85, gmail.com, so d-I-e-g-o-c-o 35. Is that what you said? Three five, eight five, eight five! I'm sorry go ahead and at gmail.com okay, so I give it to my office tomorrow and then they send it to you all right and with instructions about how to return it. Okay, so, okay, me and my back so you are approved, provided you agree to to operate your business with the conditions that we made in our motion and those conditions are going to be in the form that we send you to sign. Okay, yes, perfect, all right! Okay, take care, have a good night and come back for the rest of them. Please, okay, my choice! Thank you! We're gonna! Move on to item number. Nine item. Number. Nine is 207 madison street; no, yes, okay! So this is an application. That's what I notice says for a restaurant with a full menu recording music juice box, just jukebox no outdoor space. On the first floor in basement, we administratively approved a wine beer license for this corporation in July of 2017, with stipulations to have a kitchen. You have a kitchen serving food open and throwing food during all hours having hours of 6, 30 p.m, to 11 30 p.m. All day, not using outdoor space. Closing the facade at 10 pm playing recorded background using music not applying for an alteration without first coming before us, not hosting pub calls or party buses not having them limit nutrient specials, not having weight lines. We then administratively approved a 100 corporate change to samuel alvarez who's. The present applicant in September of 2017, but on the attorney may be able to speak to it or the representative rather, but that doesn't seem to have happened because he's not the principal on the slas website and he is applying now for an op for the same business. There's no zoning listed, there's no cfo listed 11 tables and 44 seats no bars at no bar. Excuse me, eight hours or 6 30 pm to 11 pm all day a kitchen open all hours serving spanish food. There's no answer about the facade, no tvs recorded background music, no promoted events scheduled performances or covers no security. No sound proofing, there's no agreement about the stipulations or to the stipulations that are on the back of the questionnaire. So I don't have any other information to provide at this point. So I'm going to have to go through that with you before we can continue on to a discussion of this application. There are no ops within 500 feet and for the actual business that's there. Now the wine beer license was issued June 1st of 2017. So what and the information the application about the experience of the applicant is that he seems to have been the manager at this business for while it's been in operation, but I don't know if that's the three years it's been in operation or left, okay, so first I'm going to give you an opportunity to speak or make a presentation about your application, but I just want to know with respect to the stipulations at the end, none of them were filled in. So there are things that I just have to ask which are usually filled in which are will there be? Are you agreeing that there won't be pub crawls or party buses to this location? Are you agreeing that there will be wait lines agreeing that you're going to have somebody responsible for overthrowing the outside and is there an intent to have happy hours, which is another one of the questions? That's actually filled out, so it's either no happy hours or an intention to have happy hours and then to a certain time. Well, sammy could answer that question whether if there's going to be any happy hours, I doubt it but sammy. Are you there? Yes, okay. Can you please tell me if there's any happy hours that you what well right now we're not going with any happy hours? Okay, no party buses, no happy hours, and can you what is the cfo for the location when I look at it looks small. So what is it's a very small business and it doesn't have a cfo because of the age of the building, so it's 74., that's the default one! Okay, all right and what is in the facade is it fixed? It looks fixed in pictures. It's a candidate. That means that windows are closed other than the front door. Yes, they're closed the door. Everything is closed. No window opens just a door entry. Okay, all right. So thank you for clarifying those things now. Is there any presentation you want to make or anything you want to say with respect to the application? Well, let me let me say that, like I said we're applying for a full liquor license, there is a kitchen there. I've gone to the location, that's a recorded music! I asked a question about juice box and the applicant said yes, so we checked it, there's nothing outdoors, it's a store front with one room right now. All the tables and chairs are basically, you know, put aside basically kitchen with two bathrooms. What else the applicant was at one point was the manager, I believe his father works there as well. His mother is working here as well. What you said about corporate change may have occurred back in 2017 2018. I was not involved at the time, but that's what I've been. I think I've been told that and the basement is within the kitchen that you actually go down. So if we were to lay out the chairs and tables it would be around 11 tables and 44 chairs. The basement, though, is used for storage in the kitchen or the store, storage and back room use, not patreon use. I mean there is not that much of this I mean the kitchen is the back room. I mean it's a tiny space, so there is a an entrance to the basement right from the it's like one of those hats that you open up and then you kind of go off. So it's one of those, it's just for storage purposes. Okay, thank you and you said, family members work in this business is the applicant related to the person who runs the business. Now our own citizens sale, sami alvarez, that's the principal he's the principal of the business now so there actually was a corporate change. When I looked on the sla website, it didn't say samuel alvarez, but isn't this? Is there no license there? Now, then, because I thought that there was a beer my license there. Let me see one. Second, it was issued June 1st of 2017.. I thought it was still acting and I don't see any active license for a restaurant wine. The one I s, I just see that op license. You see the pending op, yes, but I looked it up and I saw when I click on it. I see the history for the beer wine. Has there been a beer wine license there, sammy? Yes, there was and then what happened to it we never reapply for it. When did it expire? Can you can you tell me that? Well, I came in managing the place in 2013 and we never had alcohol. We were trying to apply for it in 2017. I see we never saw beer or wine or any of that prior to that, oh, you were working there and you've been working there since 2013.. Is that right? Yes, in 2018, I became the owner, it's a family, it's a family business. My uncle my mom, my cousins work here. It's a family, business, very small restaurant. We never had problems or issues where the community we've been here for a very long time and we're looking just to stay alive, move forward and sami. Just so that I'm are you also carlos or is carlos somebody different? No carlos is one of my assistants. Okay, all right just checking who carlos is the person whose name shows up on the over the video area. For you, okay, yeah. He wanted to talk. He just stepped out. Okay and oh yeah. He also put his name up carlos rodriguez. Okay is he? Is he coming back? I'm not sure he had to just step away for a while long distance phone call all right. So you're you were the manager but you're unrelated to the person who owned the business before, and then you took the business over in 2018. Is that right? Yes, okay and you've managed since 2013, and in that time there hasn't been a beer wine license. No, even though at some point your boss applied for it. Okay, we're trying to apply for it. Yes, okay, all right, all right, all right! I'm gonna open this up to any other questions. All right, I'm sorry for that. I just wanted to clarify that. I don't specifically have any questions. We did have a couple. People signed up to speak from the public to this item, okay other than carlos who's stepped away. Yes, trevor. Holland, I think, was here to speak trevor. Ask a question just want to ask the applicants. This is I'm sure, they're aware, because they're they have family who work in that. There's no bar in here correct, there's, no bar, no there's no bar all right. Just I live right down the street from this particular restaurant and I'm sure you're, aware of the issue at rutgers and madison. The seven precinct called that the worst corner in all of the lower east side, just because there are a number of issues on that corner and I'm just wondering how you? Yes, can you just tell us what the issues are? There are a number of issues that have to do with crime. I mean I don't want to get into the particulars of it. I mean it's the place where a lot of shootings and stabbings have happened. Over the past few years there has been a police car station there, sometimes 24 hours a day, just because of the safety issue at records and medicine, which I'm sure the restaurant owners are aware of. I understand, especially in this environment, that restaurants need to make money, and this is one of the ways I'm just curious as what they plan to do, to make sure that this the approval of a liquor license doesn't make that corner any worse. Do you want to respond to that? Either? Yes, really go ahead. Well, I just want to tell my neighbor that I am aware of what's happening there, and I mean I I'm gonna hire the security if I need them as right now we're trying to just open up to 12 at nine- maybe close everything by before one, so we're just like entering new walkers we're trying to make everything. You know right in the immediate area. We know that there is a lot of problems with gangs and shootings and stabbings in this area, but I could assure you that I will hire securely if anything will come out of time, but I'm not having a live music or that type of background music is all I'm having, and this is a family-oriented business that I think we are going to try go and take action, the best that we can to make sure that we could proceed with our business uninterrupted. I actually think that's all. I just wanted to raise that issue with the applicants and the the committee members I didn't realize this was going to come up so quickly. I saw it as number nine, but now it's up, but I just wanted to raise those particular issues with, especially since you know I live a block away from this particular corner. Okay, thank you. Trevor quinn to anybody else. Trevor was the only one. So this raises a couple of questions for me and that is that the proposed business, the questionnaire, didn't, include any information about security, but the applicant is talking about the possibility of security to address. I guess issues that might come up with the business and the area, so I think we just need to have a clarification of that and then also he said him. He his intention is to close by 12 or one, but the hours that were listed were 6 30 to 11.. So we just need to know whether or not those are the hours or there are other anticipated hours that we should be. Considering now I mean we had put down 11 o'clock. Is that acceptable to you? Well, we were and now that we're having liquor and people go out a little bit more later in the night I was trying to see if we could push it up to closing at one and having our kitchens closed at one and clean out everything before one. It's, you know I'm just trying I'm just trying to like make it make it work right now, so I want to pass 11 o'clock. Usually people are out and about at that time. So you know, I want to make sure that I get my kitchen and everything at the same exact time. Maybe you know moving forward. We never had a license. I just wanna take the right steps. Moving forward: okay, so you're, proposing 6 30 p.m, to 1 a.m. All day. Is that what you're, proposing or different hours different days? What is it well just on the weekends friday, saturday and sunday? I would like to stay up to one then all the other, regular monday to thursdays up to 12 o'clock. Okay, with the liquid license once we get it, I mean you know. I believe that will help my business so moving forward once we get the license. Those are my intent hours, okay and then can you maybe you speak to this intention to have security? If you need to yes that one assured the neighbor that you know, we don't want to have extra disturbance or anyone standing hanging, and this is like, I know, we're right across the street from the projects, and I know this is like a little bit of gang related area, but at the same time, if I, if I need it for whatever the I will, provide to help and make sure that we manage everything correctly, just to point it out that the gentleman did say in general, the area without without the liquor. So if it's attributable to the liquor being there at the client's store, I mean in a restaurant and, of course, we'll be up for renewal in two years and we'll have to deal with that more strictly, but I think for the time being, you know, I think the applicant will be more aware and we'll we'll be more vigilant about it and we'll see what happens in two years. Okay, are there questions from anybody else? Questions from committee members all right, so I mean this is that this is an area where there are no liquor licenses. So the evaluation of this license is a little different than the evaluation of one where there are three or more licenses already within 500 feet, that being and it's a long-standing business with an applicant who has you know as a tie to the business and that he's actually been the manager for seven years in the well for five years and then the owner for two years owner manager for two years. I think I think I'm okay with approving this, but the hours he's proposing, except not sunday, because that doesn't make sense to me so usually a later hours or friday and saturday, because it goes into sunday morning or their thursday, friday and saturday, but they're not generally friday, saturday and sunday. So I just was wondering whether or not you wanted to. I want to correct that. Yes, I would like to do that. Go ahead. I will go ahead. I would like to correct that. Yes, I'm sorry, I meant to say thursday, friday saturday, yes, not sunday. Of course, sunday, we will be closing earlier all right, all right, so he's proposing hours of 6 30 to 12 sunday, wednesday at 6, 32 one thursday through saturday. Okay, all right, I will go to the making of a resolution, so it will be a deny unless the applicant agrees, the stipulations that we enumerate at the end, the first warehouse clause will be what the applicant is applying for. What the elements of the application are. What the license history is for the location that, although it applied to the community board in 2017 for a fair wine license. Although the corporation applied a beer, wine license, there's no existing license at this location and hasn't been for at least seven years that there was a hundred percent corporate change to that to the present applicant that we administratively approved in September of 2017. and what the applicant's experience is, and that he's been the manager for seven years, the owner for two years, and maybe that he has represented that this is a family-run business with other members of his family working within the business and that, given these circumstances, oh, and also that there are zero licenses within 500 feet. Given these circumstances, the lack of licenses in the surrounding area- and I have to add in trevor that a resident appeared to express concern about the proximity to the corner of madison and rutgers, which is the which is a high crime area for this particular precinct, and that, given these circumstances and that the applicant is proposing to continue to maintain the method of operation as a restaurant, you're, maintaining the business name. What is the business name by the way, el castillo day? Manhattan rest corp? No, the business name and I have a gba, not the corporate name. No, you want the corporate name. I know I want the dba corp is the corporate name sammy? What do you do? Business ads? Hello, it's the same name outside it's still. It builds else. Yeah, Manhattan restaurant! Is that what it is? Okay, thank you, okay. So, given that he's maintaining the method of operation as a restaurant, the business name and presumably the staff, is he also maintaining the staff since it's all his family? Yes, then we would approve with the following stipulations, so those stipulations would be that he's going to operate at spanish, a full service, spanish restaurant, with a kitchen open and serving food during all hours of operation, without with the hour the amendment hours that he gained with no outdoor space, a fixed, facade, recorded background, there's no djs, no live music, no, promoting events, no events with cover fees, no scheduled performances, no alteration without first coming before the community board, no pub calls or party buses, no unlimited drink, specials, no happy hours, no wait lines and someone outside to oversee who will be outside. I have the responsibility of going outside to oversee crowds and noise outside. I agree. Okay, is there a second thank you michelle all in favor hi, that's all of us ellen. Did you say I okay, thank you and then, as I said, with everybody else, I have to fill out the stipulation form and send it into the office tomorrow since we're virtual now or finished a stipulation form they have adapt. Who should I send it to? Would it be to you? Is it just going to be to you yeah? That's fine, yeah, okay and what's your email address, neil, which is n-e-a-l s-l-a at d-t, which is david, thomas law ny.com, so neil sla at d, as in dog t, is in thomas law.com, no law ny.com! Oh sorry, thank you. Okay! All right, I will send it into our office tomorrow and I'll forward it to you. Thank you. God bless you guys! Thank you! So much for everything I appreciate it take care. Thank you. Thank you. Okay, we're going to go back to items number two and three, and so the first one item number two is an extension of a discussion from last month, which is whether or not to administratively approve our today, whether or not to add in our administrative approval, stipulations or requirements, and applicants operate for a certain period of time. The proposal from the office was one year before applying for an upgrade. I submitted sort of a draft that included some background with respect to the administrative approval process, or rather that we have one and what it requires, and I guess the rationale for having this particular requirement as a stipulation, along with the other stipulations that are published on the community board website and that the applicants have to agree for agree to in order to be administratively approved. So I'm going to open it to discussion, and then we can decide whether or not to make a resolution is it to have a revolution and what it would consist of. Does anybody want to stick to it so? Well, I so here's my thought- and I you know I don't I can. I can see both sides of this, but given the current climate- and you know not saying we want it just to be open season, but given the current climate, we want to encourage existing businesses to try and survive. Though then again, wait now that I'm saying this: if it's an existing business that was administrator approved, they don't have the stipulation they wouldn't have the stipulation on there. No, they wouldn't so maybe I will be someone now I mean who knows how long this is going to go on for so, but if it's at the valid point all right and to finish what you were saying clinton, and so you know I was going to say you know if you want to support existing businesses, not bringing in new businesses to spread the customer base, even thinner, you know, and if it's a new business coming in they have the option to you, know, apply for a full license or come to us to be heard for something else, as opposed to just going through the administrative approval, all right jeffy, I don't know I mean you guys, have more experience with this. If this is a common, such a common thing that we need to actually put in the stipulation where they have to wait a year, so you guys would have that if that happens often, I definitely. I don't think at this time, thinning out the herd of customers is. It is a huge concern given just the lack of just given the mass closures of businesses. I would I would just. I would just make sure that we're aware cognizant of any sort of extra burden or pressure that we're putting on businesses that would typically make sense and a typical time that maybe it's worth holding off for right now during this time. Anybody else. Well, basically, that's my feeling. In a sense I mean I just can't understand, where the existing business of severely surviving and coming winter, when even 25 percent indoor stuff, why even people are still coming for a license with the situation that exists. So you know I agree with what anyway, I agree with what jesse said about the whole situation, all right, michelle and ellen either. One of you people disappeared. Sorry, but my ipad doesn't work. If I don't have my headphones and my headphones just died so anyway, now they're back, I think I agree with jessie like it doesn't. I don't know if this has been. Have people been coming back with during this time? I haven't seen any on the agenda since I've been coming, but no not during this time, but we did have a spate. Last fall where we had several months where we had a bunch of upgrades coming that, were you know five six months after going through the administrative approval process, and the thing is the administrative approval process? Isn't you know it's meant to actually help it's to help them, so they don't have to come for a full committee. They can do it in a much simpler process, but yet we're supposed to get something out of it. So when they go through the administrative approval process and then come back in five or six months, it's making more work for us because the office has to go through the first process and then they come to us. So that's where this whole idea has started was that we're giving them something by letting them go not come to a meeting and by the way we're the only community board in new york city, not just in Manhattan. That does anything like this at all. That does administrative approval doesn't administrative approval. It's like, and the other community boards that are similar to us have bulked at the idea. Even when it's been brought up like cb2 thinks it's, I don't want to say they just. They don't necessarily agree that it's a good thing to do yes, yeah and then, and the ones that don't hear their wine licenses are the ones that don't have any issues like they don't have a lot of licensed applications to begin with, and they may not just choose not to hear them or comment on them in any way, rather than administratively approving them is that is there a way to do that, but if, like to do we have to hear a improvement? If they apply, we have if we apply, we have to hear them mm-hmm ellen. Yes, I see your hand we'll get you right. After ellen yeah, I'm saying what the proposed, as is, I think, there's enough consideration given to all stakeholders, and I think it meets a lot of people's needs and companies go ahead. Laura hi! I just want to share that. You know we're seeing now people applying for full liquor in previously unlicensed spaces, so I think that that's something we need to consider in the mix. I it's absolutely an unusual climate, I'm literally tracking businesses, opening and closing every day. I'm well aware of. What's going on, I think existing businesses who've been operating for years throughout the Covid-19. If they think that the upgrading will help them, I think they will apply my concern there is that if it doesn't help them, we have a lot more liquor license establishments that never revert back to dry goods, retail for retail that otherwise serves the community. We also, I think, they're, giving their landlord a reason to get rid of them in exchange for a corporate nightlife partner that down the road people who will hold out they there there's a risk if you're behind in your rent- and you get you win an upgrade. I don't I don't know, I say I think, there's I think, they're running a risk of giving their landlord ammunition to switch them out for another, a blue chip tenant, so to speak. So while there may not be a lot of competition right this second for these spaces, there are definitely people who are holding their spaces and not working with their tenants who are presently licensed, not giving them a break and essentially forcing them out because they have something else in mind for their property. So I just. I would like you all to consider that in the mix, it's just what I'm observing every day thanks so, but my question for you laura is: are you actually? Are you saying that it's you agree that we should put this stipulation in place or that we shouldn't take a stand. I support this stipulation, I think, if right now, you're not seeing a bunch of you're not seeing a lot it's hard to put a deal of any sort together right now and if you're not seeing people short-term people, a rush of short-term people, who've been administratively approved, reapplying it's just because that's where we're at right now, who knows where we're going to be in a year and I think having it as a stipulation for me for new businesses who are coming in because they are you're, not just seeing all upgrades. I think I think it helps put the brakes on full liquor licenses in an area that is still oversaturated and what we need are businesses that serve the needs of the residents not destination. Here's another question for you laura. That is only you know, incidentally, related to this. I know I've I feel like I've seen I can. I can count four or five restaurants that I've seen open in the past month. Are there? Are there more, I mean? Are there restaurants still opening in business new restaurants, opening I've seen? I can think of four on my. You know just that I've seen in the last month that have opened so I'll just say that September for me is typically there's a lot of turnover in September in general, in our storefronts it's a very busy month, because it's right before I usually close my print guide. So it's a mad scramble, there's always a lot of turnover. Now I think people are moving forward with their plans and I'm happy to see that that means they believe in the long term. So you know I there's a lot of things that are opening. There are a lot there's a lot of businesses coming into the neighborhood. There are certainly we're certainly losing a lot of them as well true, but they don't have the burden of having lived through this horrible six months of paying full rent and having no or greatly reduced income. They have that burden. I wonder if I wonder if it would like, if putting in the stipulation is a deterrent. I I'm actually hesitant about this pumping on the brakes. I feel like I, but that's here's the one thing to remember, but one thing to remember: jesse: they don't have to apply for an administrative approval, they can come to us and be heard all beer and wine doesn't have to go for administrative approval. This is their choice, so they can choose to come to us specifically because they don't want that limitation and we could then hear and decide if we want to go with it, but got it all right like that's right. I did forget about that. Okay, yeah, you know no applicant has to go through the administrative approval process. If they don't like the terms, they can say no we're going to come and be heard by the committee and take our chances all right. So that's the one reason why I feel we're not forcing anyone to do anything. This is their option if they want to take the easier route yeah I get it, and that makes I think it's a weird time for us to be doing this but yeah. I just love everything, shutting down and people losing their businesses all the time. It's just weird that yeah it's an odd time for us. I know we've talked about this for a long time, so it's kind of like finally now come into fruition, but I just you know so many businesses going under for us to add on the stipulation just seems a little. I suppose we could include in the resolution, which is very bare that we can include what clint said right, which you know they can always choose, not to agree to the terms and just be heard. Have their application heard just like any other beer, my license application would be heard and that you know that in this time you know this has been to discourage new businesses, but it is being mindful that we have existing businesses, to whom we, you know be equally mindful. We have existing businesses that we do have obligations. To rightly, we need to support them in the best way that we can. I think I could say that in a more artful way, but you know that this is to this is sorry. How is this supporting? How is this supporting them? Because do you mean that's clearly? The existing businesses don't have wouldn't have the restriction right, so they could apply to upgrade the existing beer wine licenses could apply and they may but and then just right, you could say it's a better way. I'm just trying to figure out how to say it, but you know that we can. We can say that we want businesses who are agreeing that their businesses aren't going to substantially change within a period of time, and you know that they're going to it here to the method of operation for which they were granted the administrative approval for a period of time and that in this climate of really of uncertainty that that's the expectation we have for the new businesses that want to have year one licenses in this community, I can withdraw it. I mean my, I will say the resolution that I sort of drafted and gave to everybody. It wasn't very strongly worded because it was very hard to you know either come either devise strong something strongly in favor or something strongly opposed right, and the reason that I say that is because, while I recognize that these are administrative approvals and that they're getting the benefit of not being heard, they're also beer wine licenses and more often than not, which is 99.9 of the time, it will be approved by the by the state, because the state believes it's obligated and they're under the law to approve those kinds of licenses or under the case law that has developed with respect to them. Yes, so I mean we can we can impose a stipulation, we can impose a period of time. We can discuss what that period of time would be, and then I think we should also include something in the what's posted online with the administrative approval process, which is not anything we vote on because it just gets changed by susan when we have discussions about it, but it would be that you know that we, you know, the expectation is that part of this benefit is that you're going to adhere to the method of operation that you you're, proposing to us at least for a period of time. So does anybody else want to be heard? Do you want me to take a straw poll our happy to continue the discussion I can? I can, and you know I you know. I know I said my piece, but I can go either way. I agree that maybe now isn't the time to do it, but I do think we do need to do it at some point, because I you know, I think, especially we are opening indoors going to 50 at the end of October. Like maybe you know, maybe that is the time where start people are going to start their plans up again and we're going to start getting applications, and did we miss a chance to keep things under control? I mean hey, I think, go ahead herman. You know, I'm just saying why don't we just do do the stipulation regarding the period of time after administrative approval to come back to the community board? I you know if you want, even if the states were 99.9 percent, approve that the beer and wine, if they're operating at least we'll know we will know based on the operating, not for six months or three months or whatever, but at least we could judge them for any upgrade after a year or after so are we saying well we're saying to do, stipulation or not to do stipulation? Okay, I mean, like I said, go right away, but I would think we should just do this stipulation now and waiting until things get together and everybody starts to you know come around, then we're gonna struggle to find out what to do it's better. If we do it now and then review it in six months or something and get your reaction, you can do that too yeah and again, I just I think I would feel differently if this was their only option, but they still have every option to come and be heard by us. They don't have to do the administrative approval process. So no, I understand I just said how I would just say her and reminded me about that component, that the year would give time to evaluate operations. But how would we do that at this point, when things are so different from where they might be in a year? Okay, you can't have indoor yeah you're right, that's a good point like it's just how do we know what it's like and also like it seems like this could have unintended consequences. Potentially, I know that the applicants could come and go before the committee without administrative approval, but I just worry: it might be a little protectionist, which would could have some unintended consequences right now. I guess that's just it's like it's hard to think about changing things when we're in this like really uncertain unstable period anyway. That's just my feelings does seem like an unnecessary barrier at this time of like they could go around, but maybe the thought of like trying to open a place right now, it's another barrier of being like well. We can't get administratively approved because that would inhibit us, so that adds another layer. While we're trying to open a business in the middle of covent. I and I don't I don't. I don't not see the whole thing I just. I can't not see also what's happening right now during this time, and so I just I don't think I can support that. Do you want to just postpone this discussion then well, but I mean it sounds like there's more support for it. So don't let my don't let my well. I don't know I don't know I I don't know you know jesse, you could postpone it, but the only thing I'm asking it would be a time frame that we would you know december January february yeah. I don't know we mean to evaluate whether or not it's causing like a decrease in administrative approval, because it's certainly not that kind of time frame is not going to have an impact on if it were a stipulation, it's a one year operation, it wouldn't have. You know that, would that wouldn't have happened even for places that apply next month right, so it would be just. Is that what you mean herman to evaluate whether or not it's having like a deterrent effect on your wine application? Yeah? Okay, you know what I doubt it because I mean it's costly now to run a place and and apply for a beer and wine, because I don't think that revenue, beer and wine revenue driven to the point where, even if they get the concession in rent, that they'd be doing business at this time significantly. So maybe I'll just ask that we postpone it for six months and come back to it. Yeah I'm done with that all right. Anybody else ellen. We can't see you can't hear yourself. I don't really think it'll make much of a difference, but I think this has been in place or there's a desire for this, because it's a reflection of a historic issue and assuming that, once the vaccine is and is effective, then the situations that we know we will still have to deal with, and so, as a deterrent, I mean as someone who works for a person who is opening up a said, new business who has invested a lot of money into it. I don't think these things are that big of a deterrent, because the bulk of the money invested initially to start this business is so much larger and I think you know, and the math just doesn't make sense from that perspective for me, so I don't find this to be a bad deterrent. I actually find this to be a good deterrent, especially you mean you're in favor of it. Yes, I am in favor of this in terms of the normal situation, the sla situation that this community has had to deal with historically and on this, based on the assumption that, at some point, things will go back to that type of situation, because there is still a saturation issue currently and even in the pandemic situation, there is still a struggle to get people to behave in a specific way when alcohol is involved right. So it's not like, though, that behavior is gone, the behavior is still there. So, in terms of the economics perspective, I don't think that I don't think what is proposed becomes that big of a deterrent, especially if you're, opening up a new business now. Will it deter you from sustaining. You know your current business on such a slim margin already during this pandemic. The upgrade might not because it's the addition, the current businesses that are sustaining on one or two tables on the street they're, not sustaining off of that they're, sustaining off of the savings and the extra money that they're pulling they're pushing into the business those three four tables there. It's not sustaining your rent, so it barely covers your employees wages. So I mean financially, and I don't really understand that argument. I'm not sure, I'm sorry, I'm not sure how this is tying into the stipulation. So as it I mean from a deterrent argument like I don't I don't quite understand, but I think in terms of deterring bad behavior future bad behavior. I think that's going to help and I think maybe that would help also the office internally. There might be some operational stuff in there, so I'm in favor of this okay, so then really clint, so where you were coming out in favor of it is that right? I am I'm generally in favor of it, but I've I'm not set in stone either. I could go with delaying this for a month or two to see what happens. Maybe that's delaying the inevitable. Maybe that's opening us up, for you know we're not going to be prepared when it does start back up, but I you know we don't we don't. There's enough. We don't know that. I'm okay with that as well. Generally, I am in favor. However, if we give it another review time of review, I might feel the same that I am for doing stipulation I can. We can consider it again in two months or something like that. You know if you want to do it that way again, I don't. I see both sides of the issues that we're discussing here and I also see the issue with sort of imposing this additional requirement now at this stage or the perception of what the perception might be and also the potential impact. You know what laura has been speaking about. So look I'm not quite sure what to do. I don't. I know we had difficulty with it last month and I want to guide you in the best way that I can, if we're divided on it, then maybe we should hear it maybe not next month, but in November I mean if we say: let's do it now, how divided we are. Only three people, two people, three to three like three to three [Laughter], that kind of divided. Does it seem that way I mean I'm fi. I agree with you that we're that divided- and even you know those of us, I'm not I'm, not I'm not 100 convinced either way. So you know I'm on the fence myself. That's why I'm asking for I mean it's fine, if you're saying we're just so ready to post this right. Now, that's fine, but I do know like you know. I have a friend who is looking at opening up a bar she's checked out three locations, one already had higher than an offering price on rent with three offers in it. Another one had two: these are all in the east village and you know so I just don't know that we're going to be in this decimated landscape that was maybe predicted. It doesn't seem like, and I mean if you've been out on avenue b on a weekend, it's been it's been worse than the videos of st marx. Of course I mean so there is business going on. But again I agree that maybe this isn't the time to impose this, at least in the even if nothing else for the perception of it. Maybe we postpone this two months till November mm-hmm, that's fine, and recently we moved on to the news game and then right, I am right and I was gonna say, reconsider it at that point, maybe we'll no more! Maybe we won't no more. We have no idea so all right. Moving on to the neet statement. Did everybody review the amendments? Yes, I did, and I think the only thing I had alex was maybe we should do something around the sidewalk cafe to empty, and I drafted a paragraph for it: okay, just to incorporate the outdoor dining as it is now yeah. So what I was going to suggest was that we include a paragraph that says that, as the city sought to lessen restrictions- I'm sorry- I just jotted this down quickly before this meeting placed on businesses after the stay at home, orders and new york city, executive orders and the city permitted eating and drinking establishments to have outdoor dining tickets, to the businesses or on the streets in front of the businesses and the city has now elected all right take out now, because it would have already happened so, and the city then elected to extend that program or that youth. It's not really a program, and it's not a practice, because it only happened once so that used into the summer of 2021 and that the youth which has an effect, expanded, sidewalk seating, has also exacerbated patron crowds on the street. Outdoor noise and businesses encroaching on public space and have further highlighted the need for sufficient enforcement during all hours, and that, in fact, is still one of our requests. So I think it ties into what the then bullet point requests are because we're asking for additional enforcement because it's never been adequate and now it's further inadequate. But if we're going to continue to allow outdoor use, then we should be enforcing it properly. That's it! So that's just my proposal to add that in at clint's suggestion does anybody want to be heard, or is that fine, in which case I'll add it in and we'll send it back to the office? Otherwise, as is with the jim's amendments and then my amendment so jim's a red minor purple and basically they were just to include the we'll wait and see you know we're gonna, be monitoring conditions closely, we'll wait and see what's happening and they made more general. The asks at the end of the night portion of the statement of needs, okay, and I don't think we have to vote on it, because I think we bring a vote on the whole thing in October right. Okay, any anybody want to bring up anything else. No, not me look it's not even 8 30 yet so I feel like I know this is that's good. You can talk about at least three other things, four or five other things, nope all good, I'm good! All right! Well, more went away! Okay, so motion to adjourn she's, saying bye so have a good night, everybody, okay, good night,.",
        "summary": "We'll call in any members of the public that wish to speak or ask questions and the applicant will then have a chance to respond, and then the committee members will discuss and come to a resolution.\nOkay, all right, we're going to begin the meeting, and this is the sla DCA licensing committee of community board.\nWe may take the applications before the other agenda items to be heard, which are two numbers two and three, but we do first have to move to an approval of previous month minutes to officially begin the meeting.\nAnd, it's a second floor mezzanine there was a or have there have been long-standing wine beer licenses at this location, Most, notably saline restaurant, which we last approved.\nI. Think the business remained the same at that point, but we last heard it in december of 2013, with stipulations to operate a full-service chinese restaurant serving flew to within one hour of closing, having hours of 11 a.m, to 2 a.m. All day having a closed facade playing recorded background music, only not using outdoor space, not applying for an alteration without first coming before the community board, not hosting pub crawls or party buses, not having late lines and not having happy hours.\nNo security, no sound proofing, no pub crawls or party buses, happy hours to 7, pm, no wait lines and an agreement to have someone oversee staff or to make patrons and noise outside the applicant, counted five ops within 500 feet and noted the proximity to a school, the school's directly across the street.\nThe elements of the application, and I would amend what the information that we already have to include the floors, the breakdown of tables and seats and where the bar is located and that the facade is fixed.\nMore than 10 private parties per month, not applying for alteration without first coming before the community board, not hosting cup calls or party buses, not having unlimited drink specials, having happy hours to 7 pm, not having weight lines outside and having a staff person responsible for overseeing crabs and noise outside and posting the stipulation form inside the business just to the liquor license and immediately addressing any resident complaints and providing contact.\nA beer wine license in february of 2017, with stipulations to operate a full-service thai restaurant serving food all hours having hours of 11 30 a.m, to 11 p.m. All day, not using outdoor space.\nClosing the safada 10 playing recorded background music, not applying for an alteration without first coming before us, not hosting pub crawls or party buses, not having unlimited drink specials and not having happy hours and not having weight.\n, there's no agreement about having somebody crowds and noise outside There are 11 ops within 500, and the applicant listed no license experience, but managerial experience at a restaurant on mulberry street for 10 years.\nYes, it is, as maybe some people from the community working last weekend, our we just have a dinner in dining tables and that's our purity just serving and closing by 10 like and serving you know, Because, as you say, mostly of the people right now or the restaurants only can open outdoors and that's one was the main reason that we take this place because we want to take give the people the right to don't go outside, because sometimes you see outside in the open streets, it's been accidents.\nI actually used to live on the sixth floor above in 186, so I was there for many years and once as alex mentioned, some of the businesses were fine with the backyard space, The ones that the noise did tend to be.\nI, know one person that one principal wrote 10 years experience at the business on mulberry street.\nYes, I've been working for like more than 10 years, like managing restaurant and like helping in accounting, getting licensed certifying with the health department.\nSo it would be a full-service spanish, italian restaurant with the kitchen open and serving food during all hours, with hours of operation indoors of 11 a.m, to 12 a.m. All day with, with a closed facade, a fixed facade, recorded background, music, no live music from other events, scheduled performances or events with cover fees, no more than eight private parties per year, no alteration without first coming before us.\nWhat and the information the application about the experience of the applicant is that he seems to have been the manager at this business for while it's been in operation, but I, don't know if that's the three years it's been in operation or left, okay, so First I'm, going to give you an opportunity to speak or make a presentation about your application, but I just want to know with respect to the stipulations at the end What is it's a very small business All right and what is in the facade?\nWe know that there is a lot of problems with gangs and shootings and stabbings in this area, but I could assure you that I will hire securely if anything will come out of time, but I'm not having a live music or that type of background music And this is a family-oriented business.\nI just wanted to raise that issue with the applicants and the the committee members I didn't realize this was going to come up, so quickly.\nIt's, you know I'm just trying I'm just trying to like make it make it work right now , Usually people are out and about at that time.\nAnd, it's a long-standing business with an applicant who has you know as a tie to the business and that he's actually been the manager for seven years in the well for five years, Okay, all right, I will go to the making of a resolution, so it will be a deny Unless the applicant agrees, the stipulations that we enumerate at the end.\nGiven these circumstances and that the applicant is proposing to continue to maintain the method of operation as a restaurant, you're, maintaining the business name.\nSo those stipulations would be that he's going to operate at spanish, a full service, spanish restaurant, with a kitchen open and serving food during all hours of operation, without with the hour the amendment hours that he gained with no outdoor space, a fixed, facade, recorded background , there's no djs, no live music, no, promoting events, no events with cover fees, no scheduled performances, no alteration without first coming before the community board, no pub calls or party buses, no unlimited, drink, specials, no happy hours, no wait lines and someone outside to oversee who will be outside.\nIf it's at the valid point all right and to finish what you were saying, clinton, and so you know, I was going to say you know If you want to support existing businesses, not bringing in new businesses to spread the customer base, even thinner, you know, and if it's a new business coming in, they have the option to you, know, apply for a full license or come to us to be heard for something else, as opposed to just going through the administrative approval.\nAnd then, and the ones that don't hear their wine licenses are the ones that don't have any issues like they don't have a lot of licensed applications to begin with, and they may not just choose not to hear them or comment on them in any way, rather than administratively approving them.\nWhat's going on, I think existing businesses who've been operating for years throughout the Covid-19.\nThey don't like the terms, they can say no we're going to come and be heard by the committee and take our chances all right.\nDon't have wouldn't have the restriction right, so they could apply to upgrade the existing beer wine licenses could apply and they may We can say that we want businesses who are agreeing that their businesses aren't going to substantially change within a period of time, and you know that they're going to it here to the method of operation for which they were granted the administrative approval for a period of time and that in this climate of really of uncertainty that that's the expectation we have for the new businesses that want to have year.\nJust saying why don't we just do do the stipulation regarding the period of time after administrative approval to come back to the community?\nPotentially, I know that the applicants could come and go before the committee without administrative approval, but I just worry: It might be a little protectionist, which would could have some unintended consequences right.\nBecause it's certainly not that kind of time frame is not going to have an impact on Is that what you mean herman to evaluate whether or not it's having like a deterrent effect on your wine application?\nWith, And so, as a deterrent, I mean as someone who works for a person who is opening up a said, new business who has invested a lot of money into it."
    }
}