{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UCEAZeUIeJs0IjQiqTCdVSIg",
            "title": "Top chat replay",
            "publishDate": "2020-08-24",
            "shortDescription": "",
            "lengthSeconds": "2:58:51"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "RGrrZrA1xpc",
            "fillerWordCount": {
                "uh": 326,
                "um": 379
            },
            "readTimeFullTranscript": "109 min read",
            "readTimeSummary": "14 min read",
            "wordCountFullTranscript": {
                "clients": 80,
                "shelter": 65,
                "hotels": 55,
                "shelters": 54,
                "providers": 52,
                "street": 47,
                "individuals": 42,
                "neighborhood": 41,
                "residents": 31,
                "services": 30
            },
            "wordCountSummary": {
                "shelter": 17,
                "clients": 17,
                "hotels": 16,
                "services": 15,
                "housing": 13,
                "providers": 12,
                "hotel": 12,
                "individuals": 10,
                "shelters": 10,
                "street": 10
            },
            "fullTranscript": "Hmm hi mark. That's me I just wanna. Sometimes my audio does not work. I just Wanna make sure it was working. Okay, thank you not too bad yeah. No, you can be heard. That's great welcome! Good evening. Everybody we've got a long way to go here. We have eight panelists and I think they'll be a total of 75. So we'll give them a chance to join. Hmm, hey mark, hey rich, you got it working got it working thanks, though Mark do you have an order of speakers at this point? Yes, I do unless I'm very much mistaken, we'll be going in this order. It'll be DHS, followed by the service providers, followed by inspector Yaguchi from the 24th precinct, who will be speaking on behalf of both the 20th and the 24th precincts then, depending on time, principal Monica, Berry from Ps87 needs to be on a call having to do with the reopening of schools, which I'm sure is a as thorny, an issue as this one is so. I may take her out of sequence, then remarks by elected officials and then and then we'll go to the stakeholder groups, which will include goddard, Riverside, the upper west ciders for safer streets, the open hearts initiative, the West Side Community organization, two block associations, two faith leaders, a co-, op, condo Board and then mark you're going to back clean up. Okay. That sounds good. Thank you. If there are any questions of fact in there we will repose them and give DHS and the service providers a chance to answer them, then we'll tune. Then we'll turn to questions from that were submitted in advance from the community and what faith leaders do you have speaking exactly? I have kay carpin from Saint Paul's and Andrew, and Rabbi Lauren Hermann from Saj prepared a statement that a parishioner or a congregant of hers will be reading great she's unable to be with us. Thank you, okay, 15 panelists, which is great for a normal night, but way below where we should be so. But we have a few minutes left hoping everybody joins on time. We've got a long agenda, there's Christian I'll, be back in about three minutes very good. You got time and mark we do. We can't see if any panelists joined as attendees. Well, there are 2,286 attendees according to zoom, so I have no hope of being able to find them. Yeah, that's a good point. If they, if they're, attendees and they're meant to be panelists from the community board, maybe they could contact rich or christian by phone I mean by email, I think, probably by text that'd be better but yeah they can mark. Are you broedcasting live yet or waiting for 6:30? Maybe the attendees will populate at 6 30.. The attendees will populate when I hit start the webinar and and then yeah, okay, which I will do shortly, because it's 6:26 and it's going to take a while for 2,000 people to join yeah. Do we have names of the people from the service providers or DHS? We have something sure I'm just thinking Jerry and I should have them so we can be on the lookout if we need to okay well, I should have thought that before I have them, but I can't share them with you very easily. I have do not worry about it. I have a short table with the list of the people that were on the agenda very good Christian who participated in the previous. Should I just I can just send that to you by text, if you can send that to Christian and just and to rich. That would be great all right. I'm going to hit start webinar. So now the attendee should start popping in. Let's see how it goes, I do not think you have to wait for 2,000 people. I think at a certain point. You can start yeah we're not there yet acrosss 250. yeah we're already at the biggest meeting we've ever had so, okay rich, I sent you the that short list. I have yeah great you're such a celebrity mark that they all come to come on Shelly, I'm in enough trouble as it is. I really do not need any help, but thank you very much. I'm sorry. We have the first hand raised already wow what happened? I'm back. The number keeps going up. The attendee number is going up, but the panelist number is crawling. Well, it's up to 32. yeah, but we're good. We need like there's like 70 of us. Is that even counting all the CB7 members that would include the CB7 members, all right, we're plus 500. Now this does have a certain houston, hi mark, hey, Gail, hello, everybody first mission: success is we've passed 500 and we're still live thanks, rich, really appreciate it yeah! It's not me! It's you gayle! Oh no, we did not get you extra. We got you extra support, though you did I'll mention that in a minute you do not have to it's just. I was insistent on because I know what it's like well we're grateful, I'm going to give two more minutes in hopes that the panelists all join and then we're going to get started because we got a only two hours and a lot to cover since we have dead, Aaron Gail's here. Not only thank you to you, but also to Noel who's, been fabulous, rich you're, stealing my thunder hi Mark, I'm an old dj. I hate that air. Okay, actually a dj, remember that we are recording and live hi Mark, hey Jay, great job, well, great, we'll just call it a night and go home now right quit. While I'm ahead all right, it is no hey mark, hey there, whoever that is, I'm sorry brad, oh Senator Hyman! I did not know you're going to be with us. Okay, we're at 850 attendees God. I hope they can all hear us all right. Good evening, everybody. My name is Mark Diller, I'm the chair of Community, Board 7.. Welcome to our information session concerning the use of local hotels in our district for the protection of homeless, shelter, clients who were housed elsewhere to protect them from Covid-19. I will lay out just a few things in advance here. The purpose of this meeting is for the public to hear directly from our from the Department of Homeland services and from the service providers in three of the hotels on the decisions made and the operations underway and how that all works. We are completely grateful that they have agreed to participate in this in this information session. I'm hesitating to call it a meeting, because really it's intended for an opportunity to share information and to have questions answered and comments raised. We have two hours and far more far more to cover than that could possibly handle. So we're going to I'm going to be moving us along as best I can, and I'm going to be as tight as you've ever seen me about timing for everybody and with apologies to our wonderful elected officials who have joined us tonight, a couple more than I had anticipated, which is great- and I thank you for that as well. But we're going to ask everybody to keep it to two to three minutes other than the DHS and the service providers, because we're here to hear from them that's how this is intended to work. So I hope I can count on everybody to find that soul of wood, which is in brevity, I am going to take a little bit of chairs privilege here. Just to do a couple of things. First is that this. The purpose of this is to be to have a productive exchange of information, we're going to do our best to find solutions to things and to chart a path forward that is productive. This is in direct response to the community's request or need for information and that's what we're trying to solve or to supply here at Community Board seven. I am grateful, as I said, to DHS and the service providers for coming here. I'm also grateful for all of you for making the time to be a part of this session. I want to lay out just very quickly how the evening will go, I'm going to as soon as I finish talking and thanking just a couple of people we're going to turn to the department of Homeless services. I'm going to ask, while I'm doing this, I'm going to ask Christian and rich to make sure that we have muted everybody. We will then unmute the people who are going to speak and that's how this is going to go. There are currently 1,000 well between panelists and participants, we're at 1100 people and counting. So this can not be a town hall. I can't pass the mic around we'd, be here till thanksgiving and even then probably have folks still waiting. I also asked for questions and comments via email, and I thank you because I've received over 165 separate emails, many of them with multiple questions, and so we have compiled them into categories which I will read once we get to that part of the meeting. But first we will have, as I said, DHS the service providers. Nypd will speak. I I hope that we can find deputy inspector yaguchi, the commanding officer of the 2- 4 precinct on the list, and we will hear from him. We will then hear from let's see we'll then hear from depending on time principal Monica Berry is with us from Ps87 one of the schools closest to two of the shelters, and I know that she has other duties with respect to exactly how it is that we're going to reopen our schools or are we or are they inside or outside, and so with apologies to the order of speakers, we're going to turn to her earlier on than perhaps the other stakeholders. We'll then hear from our elected officials. As I said, and then we will go to a series of community stakeholders again two to three minutes, and we will ask them to use that time on this subject. There are about eight or nine of them, and then we will give DHS an opportunity to respond if they choose or if there's a question posed in those community stakeholder questions and comments. If there's something to respond to we'll give them that quick chance to do it and then we'll turn to your submitted questions in advance, because we had so many questions submitted in advance and because they all seem to fall into a handful of categories, we are not going to be able to take questions from the chat as well. Tonight I apologize for that, but it's simply a logistical impossibility. What we will do is save the chat. We will review it in the next day or two. We will make sure that any question that was not already answered by the previous questions and answers is submitted to the right party and we will work out a way to make sure that those answers are posted or shared in a way that makes sense we sort of have to wait and see exactly how that works. Please allow me to thank a few people with respect to this. First and foremost is borough president Gail Brewer, who, among other things, expanded our license so that so many of you could join us tonight without her, we would have to cut this meeting off at 500 people, and that really was not in the spirit of the meeting or the event. So we are grateful for both the funding and the forethought right behind gail. We want to thank Noel Hidalgo of beta NYC who's, actually, the person who's the tech guy who figured out how to do that and got it to work because Zoom was. I do not know if anybody noticed that Zoom was actually down on the entire East coast of the United States today. So unraveling zoom is no task for the faint of heart, so we're grateful to Noel. I am personally grateful to April adams. I know it's a mistake to call out one staffer among others, but April adams did yeoman's work in making sure she's with the borough president's office, making sure that I had all the contact information and the opportunity to reach all of you and then I personal gratitude to rich robbins, Christian, Cordova and Doug Clyman on his birthday. He is spending it helping us facilitate this conversation. They are my co-, hosts they'll, be the ones on muting you and looking for the correct things, I will not be able to unmute anybody in attendees. So I'm sorry to say that raised hands will not be answered among attendees. With that, I am ready to begin our evening's program and I call on the department of Homeless Services. I believe Aaron drinkwater. Are you the first to be to be speaking? Yes, I am thank you welcome to Community Board 7 and thank you for your participation in this evening. Thank you mark and thank you to the community board, to our elected officials and to everybody participating this evening to have you know over a thousand participants really says something in terms of individuals wanting to get information about the work that the city is doing to protect vulnerable new yorkers and also learn more about the services that we're providing. My name is Aaron drinkwater, I'm the deputy commissioner for intergovernmental and legislative affairs here at the Department of Social services. I'm joined this evening by two colleagues by the Manhattan borough, director, Leilani Irvin, and our associate commissioner of adult services, Yvonne Ballard. I also want to take a moment really to stop and acknowledge all of the staff of DSS hra and DHS, as well as all of our contracted providers, who are represented on the call. This evening, they've really been at the front line of the response in terms of providing programs and services and really making sure that new yorkers, who have no place else to go really are connected, really are essential services during exact steps. If I can I'd like to take a moment and sort of walk the audience and participants through the work that DHS has done over the course of these past couple of months to contextualize the conversation that we're going to have, I think it will provide some information and possibly answer questions that are coming and so Wanna. You know, make sure that we're starting from a place of a common understanding of the response that the city took. We started very early on when we were learning that this pandemic was unfolding of really working with our colleagues at health and hospitals at the Department of Health and mental hygiene, utilizing CDC guidance to determine how to respond appropriately to protect new yorkers who are in shelter. Our shelter system is made up of different systems. Our families with children's shelters are largely apartment. Buildings. Individuals can isolate and are able to really protect themselves during Covid-19. Similarly, our adult families. These are cases who it might be, a mother, an adult child. It might be a mother and a grandmother. Those two are individuals who are typically housed in facilities that are called tier. Two shelters individuals are able to appropriately social distance in those locations. That is unlike our single adult system. Our single adult system makes up approximately a fourth of our system and is dorm style layouts for the sleeping arrangements. There is congregate, meals and recreation area, and these spaces are the ones that we focused on as it related to the relocation and consideration for the use of what we call the de- densifying hotels, to ensure that we're protecting the health and safety of our clients. Our planning really began all the way back in February, but some of the work that was known to the public did not really start until well into March. In the beginning of March, we started disseminating information to our providers to make sure that they had the latest from our health experts, dohmh Et cetera, and in Mid- March. We opened our first isolation capacity. This capacity allowed us to take individuals who either had tested positive for Covid-19 or experience Covid-19 like symptoms. We can remo rewind our memory a little bit. If you remember very early on, we did not have access to testing, and so we had to use a symptoms- based approach and a presumed positive to really make sure that we were taking care of the totality of our shelter system, and so that meant, if individuals were presenting with symptoms, we were able to remove them from those congregate settings place them in an isolation hotel until their symptoms subsided, thereby making sure that we were treating them as well as the shelter system as a whole. At the end of March, we started weekly commissioner, calls with our electeds our CBO partners and our providers. Those calls continue each week every Tuesday and following those calls, we send out an email, summarizing updates that occur each week, and this is acrosss, both the hra system and the DHS shelter system and back in April, very early on the New York Times credited us with the transparency in our reporting, which we were very proud of, because we think that transparency is important. We then continue to provide PPE as we gained access to supply chains. Again, if we go back to March the situation. Looked very different in terms of accessing the things that both our providers needed, as well as our clients. We were able to secure PPE we're able to secure cloth, face coverings and making sure that is provided to our clients towards the end of March. On top of our excuse me in the beginning of April, in addition to the isolation capacity that we set up, we started De- densifying, our hotel, our shelters, moving individuals into commercial hotels. We started that effort by focused on clients who were over 70, and then we continued that exercise moving individuals into commercial hotels, we've utilized approximately 60 hotels, acrosss, the city. The conversation tonight is focusing on three. In the area of the upper West side. There are four commercial hotels that we're utilizing in CB7 and, as I said, 60 around the city, we worked to initiate these transfers as quickly as possible. We entered into a contract with the Hotels Association of New York. So that way, the agency could focus on serving our clients and we worked with providers to match them to hotels based on you know the size of the shelter that they were serving and how they were going to move those clients into the commercial hotel, the provider. Also, it's not just moving the clients, they also moved their program, their social service staff, their security staff into the hotels as well to make sure that our clients, irrespective of where they were located, still had the availability of case management of housing, specialists of connections to mental health, to telehealth, to substance, use counseling and those sorts of things, as well as the opportunity to you know, continue to engage with staff. We had meal delivery to make sure that our clients had access to food. We also continued our work on the streets in terms of ensuring that individuals who are experiencing unsheltered homelessness also had access to information to PPE. During what was the colder weather months, we were able to make sure that clients had access to things like socks, if need be. In the hotter months, we've made sure that they have access to water, one of the things that I think you and I might not be so attuned to, but the public spaces and the ways in which individuals use spaces has changed very significantly during the Covid-19 outbreak right, so many locations were closed, whether they be gyms or libraries, coffee shops, grocery stores, all types of things. Well, not grocery stores. Those are essential, but all types of things were closed during Covid-19 and it meant that the places that you or I might frequent and my our clients at DHS might frequent. Those no longer were available. For example, bathrooms oftentimes clients will use bathrooms, you know in public places and coffee shops and Mcdonald's those sorts of things. Public bathrooms became a very challenging thing for clients to access. We recognized that and the city actually put out a number of porta potties and mobile hand washing stations to address this. We recognize, especially with clients who are experiencing street homelessness. To have access to. That would be very important. Unfortunately, we had to remove those after being out for a number of weeks because they were vandalized despite you know, daily cleanings and things like this and ultimately did not serve the purpose that the city had intended them to serve. Today. We've made sure that our outreach staff are informed on the locations of public restrooms that are available to ensure that clients who might be on the street know where to access those locations. In addition, DHS never closed down. What are called our drop- in centers drop- in centers are a critical tool for our street outreach team. They allow clients to come inside to utilize the restroom they can take a shower. These are not sleeping facilities, but they do allow a client to connect with staff and continue to build that trust. So that way, ultimately, we can get them connected to services and bring them inside and no longer remain on the street. So all of that it was part of our response, the hotels that we're speaking about tonight. We began utilizing two of them in May and then one in July. This required a staggered response, as we had to move clients out of the congregate locations into the commercial hotels. So that way we could, as we were, moving work to also ensure the safety of our clients, as well as the staff and everybody else who, from the program teams, would be moving along with the clients to date. As of August 18th, we tracked 1428 positive cases over the course of the past four months of those that included 130 cases that were referred to us from our agency partners and of those there are 16 cases within that remain positive, meaning they have not met the threshold and health criteria for resolving the case and considering that case closed of those 1428 positive cases that includes 400. Excuse me 104 deaths, which is tragic, but we know that by moving new yorkers into the commercial hotels, we were able to save lives. We acted with urgency. We acted with the priority of our clients and our provider staff in mind our essential staff, who showed up to work each day and we've been working with our communities to address issues that some of you have raised. That have been raised through the community board that have been raised directly with providers and are glad that we've had the opportunity to have a couple of stakeholder meetings where we've heard from our elected partners from community boards from bids and other stakeholders in the community and then to be able to respond to some of those things. I know that each of the providers are going to have an opportunity to speak later, but I wanted to give a couple of examples of the things that we've been able to respond to and that I think, are important. So we've been able to give contact information at the sites. We've been able to remind people that if they see somebody who is experiencing homelessness and they're interested in getting some assistance to that individual to call 3- 1- 1. So that way our outreach teams can be deployed. We have regular canvasing that occurs on the upper West side by goddard Riverside through our Manhattan outreach consortium, the locations in and around the three hotels that we are using for our d density efforts are canvased regularly multiple times a day, acrosss multiple shifts. So when you call 3- 1- 1, that's in addition to the regular canvassing that's occurring in these locations. We've also been able to, through the conversations that we've had these past couple of weeks, remind our hotels staff or the excuse me, the provider staff that if they see somebody who their teams are trying to engage- and it turns out that it's not from one of the hotels that they're able to call our joint command center to ensure that DHS responds to make sure that we get a team out to address the needs. We are working in a new environment in our outreach world. The most recently passed budget made some changes to the Nypd's budget and the ways in which the NYPD had historically worked with our outreach teams. The homeless outreach unit was disbanded, and we now are very much focused on ensuring that we're leading with our social services tools that we're working with clients to engage them, that we continue to focus on meeting the social services needs of our clients, rather than using a heavy- handed enforcement tool. We continue to work with our department of sanitation in terms of addressing cleanups and issues in which debris has accumulated in an area. Again, we continue to work directly with the client dhs's. Responsibility in a cleanup is to ensure that if an individual is willing that we have the resources available for them to come inside, and so that work is continuing as well. I see that there are some items in the chat, and so I want to make sure we give our providers an opportunity to speak. I know we're going to get into the questions, I'm not ignoring them. They are popping up, which is a little distracting, but I want to make sure that we save time for the providers and then be able to dive into questions no matter how many times we do they zoom things. It still takes a little bit of getting used to. So thank you for your time and attention and I'll turn it back to the chair thanks so much, and thank you for your presentation before I turn to the service providers and I'll be calling on project renewal first, so perhaps we can unmute Eric and whoever else eric designates. I want to have a couple of other housekeeping notes. One is the purpose of this meeting is to hear from these folks and to have them answer our questions, so the two to three minute rule will not apply to them. Although I encourage everyone to be brief, so please let us listen to the folks that we're here to listen to. The second thing is that I'm noticing a lot of folks using the Q&A, the Q&A will not be preserved. The chat will be so. If you have a comment or a question that you want to make sure is in the record of this meeting. The way to do it is by the chat. We will be dismissing the Q&A at the end of the day, and we really do not have time to do all of these different functions within zoom. At the same time, so that's how we're going to run the meeting any objections or concerns about how this meeting is run are solely mined. I've been given great help, and so, if I have not followed through that's on me, but let's now turn to Eric Rosenbaum, who is with project renewal and anybody that Eric wants to turn to in. Instead, thank you and hello, I'm eric Rosenbaum and I'm the CEO of project renewal, I'm also your neighbor. I've lived on the upper West side for 23 years in an apartment I own, just five blocks from the Lucerne. I've seen the changes in our neighborhood over the past two decades and I've seen the changes in the past six months. It's a really tough time and I and our staff are committed to working together with all the community leaders here to help our neighborhood and all of New York Recover. I'm joined here tonight by my colleagues, Kaydon Grinnell vice president of programs and our director of security Charlie mullen a former federal law enforcement officer, who's working daily with the 20th precinct. Our entire leadership team has been meeting with community leaders on a regular basis and we deeply appreciate your partnership and goodwill. You may not know much about project renewal because until July 27th we did not have a presence in this neighborhood we've been serving homeless new yorkers for over 53 years today, we house over 2000 people, every night, half in seven shelters and half in permanent, supported housing, we've built or rehabbed. Over the past decades, we deliver health care to over 13,000 individual patients annually through licensed clinics in our shelters and in mobile medical vans. We've built successful employment programs that have helped thousands of clients gain living wages to earn their way out of homelessness. One of these is citibeat kitchens, which makes and delivers over 3 million meals a year to homeless, shelters throughout the city and before the pandemic did bar mitzvahs and weddings. Also, I know you're all concerned about what we're doing at the Lucerne we've heard your questions and created a special page on our website with more detailed information. The address is project renewal, DOT, org, slash Lucerne, and the link should be in the chat, but to give you a snapshot, here's what happened just today in the hotel on the 8 to 4 shift. We had 25 staff on site. In addition to security, we delivered 774 meals to clients in their rooms, including dinner. We've done 721, individual health checks. So far, today and there'll be more. This evening, our on- site nurse had six scheduled appointments and nine walk- ins. There were 31 psychiatric and medical appointments, our vocational counselor had 15 individual sessions and one group of 11 clients case managers held 26 individual meetings, we're doing two joint patrols with help USA from the Belclair. A peer engagement specialist made neighborhood rounds every two hours we distributed about 200 masks today and actually we've gone through 10,000. In the past four weeks, 19 clients went to work today out of 35 who are employed in total. There was one incident involving the police. Today, some of you have may have seen it. A client became very agitated and distressed and became aggressive. We called 9- 1- 1, they responded. The client was removed, taken to a hospital and will be transferred to another shelter. Nobody was hurt and there were no other consequences. I also want to celebrate that today we moved one client out of shelter and into his own apartment, and some of you have donated household goods to help that client settle in. I know you wonder how we got to the Lucerne. Let me take you back six months to the middle of March, when New York went on, lockdown cases were tripling daily, icus were jammed, and most of us were huddled in our apartments. Scared to go outside. My greatest fear was that the virus would decimate our clients who live in dormitories with beds three feet apart, often 20 or more in a large room. I was terrified. The virus would spread to our staff, who take the subway every day and bring the virus back home to their families, their neighbors and to every part of the city. I am unbelievably relieved to report that we have had just 81 cases of Covid-19 among the 2500 clients we've housed in the last six months. Two, sadly, have died only one in shelter, and that was someone who was on hospice before they got infected with a virus among our 900 staff. We've had just 31 cases and thank God all have recovered and are back at work. Our remarkable staff have showed up three shifts each day without fail during the worst of the early days during the protests and the curfew. When the subway shut down at night, they are essential workers, so give them a smile and a thank you when you see them today, we have about 700 people in four hotels. Normally it takes about two years or more, to create a shelter. We had about two weeks notice for each hotel we opened, and we did it again and again and again and again and again five times in about three months. Of course, it has not been perfect, because this was a public health emergency. The Lucerne has calmed down enormously in the four weeks since we opened in part because we've made changes based on your feedback. For instance, the precinct now has a patrol car stationed at the hotel most evenings we've transferred 18 clients back to congregate, shelter for repeated failure to respect our good neighbor policy. Our greatest challenge right now is finding a large enough program and outdoor space that is safe for them and for all of us, we're working on that and we hope to have it organized in one more week. Thank you for the donated gifts of individually packaged snacks, books, single ride, metro cards and games. So many of you have left at the hotel. I can't tell you how much these gifts and your good wishes motivate the men to participate in our voluntary programs and activities. This has not been easy for any of us, we're all worried about a second wave of Covid-19 in the fall. We're planning right now for our return to shelters, adding plastic dividers to create more spacing improving air, filtration and circulation systems, because we know we won't be in these hotels, much longer Charlie Katon- and I will be here to answer questions after the presentations are done. Thank you all for being patient and understanding. We are here to work with you for as long as we are a part of this community thanks. Thank you very much we're going to turn immediately to help USA and I'm not sure who will be speaking on behalf of help USA. So help me out there is that Marcus Daniel yeah I'll, be speaking yeah very good hi everybody. My name is Daniel Farrell, I'm a senior vice president here at help. Usa on the panel with me, is Ronnie Silverman she's, our chief development officer. We have a number of people at help on the call help you say: we've been operating, we've been operating since 1986. We provide shelter and programs and permanent housing in over 65 different program, shelter and housing capacities serving over 4,000 people. Daily 90 of those folks are here in New, York City. When we move and in New York City alone, we run 12 shelters for single homeless, men and women. When we moved to the Belclair on May, 2nd 3rd and 4th, we made a couple of strategic decisions and I'll get back to the our relationship to the mortality rate and all that eric so eloquently and Aaron eloquently spoke about. We made a couple of really important strategic decisions based on our on the neighborhood. We opened up two shelters at the exact same time, one in Times Square in Manhattan, of course, and then the Belclair at the Belclair, we're represented by clients from five different shelters. We have about 260 to 270 clients there at any given night about 35 percent of our clients are working full- time about. 35 percent of our clients are all still women, they're, not all men at at the Belle Eau Claire. Most of our clients at the Belclair do not have major mental health issues and many of our clients at the belclaire are high functioning and they do not have major substances problems. Those clients from shelters who we serve. That population were generally transferred to the hotel in the Times square, which non- residential neighborhood. We made that strategic decision, because we recognized very clearly that the upper West side was a much more residentially dead and dense neighborhood, and so we wanted to act as good neighbors right from the get- go. We made sure that we had robust staffing. We have many security staff, many case managers. Now we have two social workers. We have a nurse at any given time on a daily basis, we're doing about 250 daily wellness checks per day. Our nurses is going around to every single room, checking as many clients as possible to make sure that they're not presumptively positive. All of that, so I have to say that in it's going actually very well in that regard. Now let me double back to the testing numbers. When we moved into the belcher we were still. The city was ramping up testing and at all of our shelters we had an eight percent positive rate. This was in June, slash July and at the Belclair we had a six percent positive rate and do not worry for every client that was positive or even presumptively positive. They were quarantined immediately. Now I'm happy to report that in the last round of testing in the last two weeks, our positive rate among all of our shelters in New York City, is 100 percent zero. Are we have zero positive cases astounding? I actually thought that was a mistake, but that's consistent with what Aaron has been talking about. The numbers been dropping through the floor citywide and that's something that, without our ability, this ability to move clients out of congregate settings into hotels. We would not be there right. Now, more clients would have died. Probably more staff would have died as well. The coalition for the homeless put out a report at the end of June, estimating that, during the height of the pandemic, from March until the end of May memorial day weekend that about 200 per 100,000 new yorkers at estimated to have passed away from coburn. That's all new yorkers for sheltered homeless. New Yorkers was about 292. at help. It was about 250.. We ran our own analysis, so we were right in the middle from being about halfway between all new Yorkers and all sheltered new yorkers for all homeless, new yorkers. That number rose to about 320 city- wide, so we feel like we've done as good a job as we can do in protecting our clients and staff, and I can't you know it's hard to overstate how difficult our work was, and I know for many of you on the on the zoom call as well who work with people in any capacity how difficult these decisions were and still are. March April and May, as we all know, was a very difficult time, but without our ability to empty out our shelters, we would not be here right now. The other critical decision that we made kind of fast- forwarding is that we did not close any of our shelters. We made that critical decision so that when a if a client acts out inappropriately either external to the hotel or internal inside the hotel, we almost immediately that same day move them back to their shelter of origin. That shelter margin is either in the Bronx in Brooklyn, on Wards Island or in Washington Heights in Manhattan. So we have really have a low tolerance, a low threshold for clients who are just behaving inappropriately or having some challenges or difficulty and we're not moving them back just out of like keep them out of the neighborhood, but sometimes when they go back to their shelter, origin, they're, actually, a little more comfortable. Those shelters have been emptied as well. They're operating in about half capacity so being back to their shelter of origin is actually in some ways of a point of comfort for them. So now let me talk a little bit about what we need and we I've spoken with many community residents who live acrosss the street down the street, and I really appreciate the outpouring of support. I read a couple of the articles recently in some of the local papers and it really it really is great- to hear kind of cutting through some of the noise, but what we need for our clients look we're in business to put our homeless shelters out of business. We all agree, Tony agrees, Eric agrees, Aaron. All of us know that our job and our mission is to be out of the shelter business we need business. Attire, like I said about, 35 of our clients are working, but that's not enough. We need we need more jobs, we need access to more employment right now we have clients working at places like Sephora the New York Times. We have a couple of 311 as a customer care service. We have a couple of clients who are construction workers and we have a number of clients in the food delivery business. Among other things, we have a number of clients who work in other nonprofits and shelters, and we need to expand our employment opportunities for our clients and, lastly, and most importantly, regarding the work that we do is ending their time of homelessness. As Eric said so eloquently in August alone, we were able to move seven clients from the belt Claire out of homelessness into their own housing. This is a tremendous thing. We have five more in the pipeline that we're hoping to move in the next. You know one to two weeks so that might be 12 clients who were homeless at the Belclair from the beginning of August through about the second week of September that are no longer homeless, they're. Instead, they'll they either are or will be in stable and secure housing, and that is something that we do our best to celebrate. Every time that we do that. Lastly, I want to say on a personal note, I started my career 30 years ago as a volunteer on the upper West side. I started at a synagogue, angie hessed on 100 in West Hunter Street in West End. I started doing overnights with folks who are homeless much to my parents, horror, which only made it better for me in some ways, and it really launched my career of public service, I'm an out of borough kid, the sense of public service and where I grew up on staten island was non- existent. I learned about public service by and large from the upper West side. I moved from that volunteer experience. I moved to God of Herbicide in another volunteer experience, then I was hired by God of Riverside and then I moved on from there. I worked at four different places on the upper West side for about eight or nine years in my twenties, and it only launched my career and kept me going in homeless services for the ensuing 15 years thereafter. So I'm really appealing to all of the all the great comments and all the well wishing and all what people want to do like the list that I just provided. There are things that we need from the community again in order to end our clients, time of homelessness. Thank you, everybody. Thank you, Daniel. I am going to interrupt for two things. One of them is that there's a lot of comments in the chat about concerns about safety. I have those questions we will get to them, but we also have Monica berry the principal of Ps87 with us who has a another commitment coming right up, so I'm going to interrupt our flow to call on Monica as a as a community stakeholder. Just a couple of minutes, please principal, but we're grateful that you're here and thank you please take it away. Thank you for having me here tonight, so I actually have had the opportunity to meet with both project renewal and with help USA separately, along with the principle of Ps9, to talk about what we can do just to ensure that we are all feeling safe in this situation, and so we discussed what we do in terms of the patrolling around the area, because I know that there has been concerns about people gathering in our play, yard and things of that nature. So we talked about that when school is in session, and we also told them that we will let them know our hours that we would be in school and the times when children will be outside, so that they can also coordinate their patrols at that time as well, so we're going to keep working together with them. We have numbers to call if there's anything that is going on, so we can reach out right away to talk to security to help us, so we definitely have been working with both organizations to make sure that we are doing all that we can, while school is in session to make sure the kids are safe, the one area that we have not been able or the one office we have not been able to get in contact with yet is with the 20th precinct, and I guess our question for them would be what role will they be playing in patrolling as well? I do know that you know there is so much that the security can do from the agencies, but then there's also just the idea of if there are police patrols to help. If there's anything else, that's going on, particularly when we are entering the building our buildings in the morning and when we're dismissing in the afternoon and if there's any time during the day, if we're using our play yard. So we have been working with, like I said, both agencies with both of the organizations we'd also like to have a conversation with the 20th precinct to talk about added protection that could come to our school to help us in maintaining the safety and security of the members of our community. Thank you very much principal barry and good luck with the reopening. That's obviously a herculean task times three. I guess because it's in person and remote and then blended. So so thank you for that and I'm going to go turn now back to our service providers and the third one is cucs and is that Mr Hannigan or who is going to present on your behalf, yeah hi, it's Tony hannity good evening and thanks to CB7 and Manhattan bro, president Gail Brewer for pulling us together tonight, I'm Tony Hannigan, the founder and CEO of Cdcs, I'm joined by my colleagues, Julie Lorenzo chief program officer and gregory Mendelsohn who's, the program director at the Bell Nord Hotel. For those of you who are not acquainted with cucs I'll, give you a little bit of background. We were originally a project of Columbia University and then we spun off as a completely independent organization in 1993. I did not know that about Daniel about starting his career on the upper West side. I did too being part of clump university actually doing organizing in the single room, occupancy hotels at the time and and in some ways. This is reminiscent of that right because we're talking about people who are in many cases down now and looking to make a better life for themselves and we're trying to help them do that today, cucs has 30 programs acrosss the city that emphasize housing and restorative health and mental health services for homeless and formerly homeless, individuals and families, though what they look like is street outreach. The full continuum of street outreach, shelters, safe havens. We do a lot of supportive housing for individuals and families, and we also have a partly because of our genesis at the university have a very substantial national training program. We train 15,000 staff per year in best practice around homeless people, and this includes the NYPD. We do the training for the NYPD on crisis intervention when they do respond to edp calls. All in Ucs serves about 50,000 people annually on May 21st, we relocated our 100 and what bed shelter in the Bronx to the bel Nord Hotel. For us this was a lifesaver. It was prior to testing, but we figured we had at least 20 Covid-19 cases at that point and in a congregate setting it's impossible to manage that and it's a threat for everybody in that shelter and it's a threat for the residential neighborhood that we resided in, and so we were grateful and remain grateful to be able to be at the billboard and we're actually very proud to have been able to as a staff to regroup so quickly and create recreate our program in a totally different setting, which was just it was uprooting for everybody involved, the staff, but also for the for the residents. We've acted upon our good neighbor policy and- and that has been returned to us, both Eric and Daniel, have mentioned the being supported by the community. We feel that very much the support and the inclusion, the contact with us, the donations that we've received, keep them coming. Everybody really appreciates that. At this point I would like to get into some more detail just about what our staffing looks like and what we're doing at the bellnord, and just some updates and and gregory. If I call on you to give us a brief summary of that sure, thank you Tony. Can you hear me? I came up. Okay sure can I'm looking at the clock at 7:15 and we have not gotten to questions yet so if we could move a little bit faster, that would be great. Thank you so much so I'm the program director at the Delta manor at Belmord, we relocated at the end of may. We have 101 men with us and we have I'm a licensed clinical social worker and we have social workers on every shift on our staff. We also have. We also have medical and psychiatric services provided through our jainin affiliate, and we work very closely with them. When we moved into the belmord. I think it was like Tony said very disruptive to everybody, and we've worked very hard on trying to address the community concerns. Some of the things that we've been doing is that we created a smoking space for the clients, because we know inside the hotel and we're lucky enough to have that space. We know that people congregating out on the street is something that you know is unpleasant. It blocks traffic, it's intimidating to people, so we also instituted he also instituted perimeter patrols with our security and they wear yellow vests. They go around a couple times a day, just to make sure as well that nobody is loitering around in front of our building. We also reached out and started working with NYPD Deputy inspector Yaguchi's on the call I've spoken with him. He has my cell phone number and we've been working with trying to create a great partnership with them, and I'd like to thank him and all the officers for the help that we've gotten from them, and I've also put out my number and people have reached out to me. I've spoken to many of you on the phone about general things about client concerns and we're trying very hard to we're, trying very hard to address any concerns that people have and being very responsive to that, and I would echo what what Eric and Daniel said about moving people out. We actually just moved somebody out. Last week we had some interruption because of the move, but we did not move out somebody last week and we actually have about six more move outs scheduled right now, and I say that because my experience in the Bronx and working with the community there is that when we start to move our clients out into permanency, we create the type of situation where they're invested in shelter, they're invested in what we're doing and they're invested in the community they're in because they want to see their lives move on, and I think that kind of that kind of tangible benefit and that kind of tangible result is one of the things that I point to. As being the progress we've made since we've moved in sort of getting ourselves situated. Responding to the community concerns responding to our clients, concerns and being the type of good neighbor that we have been in the Bronx for many years and I think that we're getting towards being on the upper West side, like I said, I'm at the site most days and I've spoken to many of you. So if you have concerns, you can certainly address them to me here or at the site. Thank you so much. This is a terrific presentation, so we have a better feel of what our what our service providers are about. I'm going to turn I'm going to try to keep us moving here. So I'm going to start turning to our our community partners, the first one would be deputy inspector Naoki Yaguchi, who is the commanding officer of the 24th precinct and, as I understand it, we'll be speaking on behalf of both the 2- 0 and the 2- 4 good evening, deputy inspector. Are you with us, and can you speak Yup good evening? I do not know if you guys can hear me, can sure do please go ahead. Thank you for being with us, Yep Captain Zuber. Unfortunately, could not be with us tonight because he's I think he had surgery on his hand, an injury he suffered a couple about a month ago, or so I'm here on behalf of the tool and the two floor, I just want to say that I, with the recent attention on all these homeless, shelters and hotels. I hope we have try to put a lot of cops out there on Broadway, but a little bit more presence to counter some of the unpleasant things that the residents of the upper West side has seen. I hope that everyone has seen that chief buccardo has kind of made it a priority, him and chief of right to put some extra cops out there. Just so people feel a little bit safer. I know Miss Berry, I think from the school spoke she talked about. Having some extra cops, I mean. Obviously we have many schools located throughout the 2- 0 and the 2- 4, but that's definitely something that we can do during dismissal during the start of school. If the schools do come back that we can try to put more cops out there, that's something that we already do when we have schools that have violence issues or whatever it is, but in this instance you know to protect our kids to make the kids feel better to make the parents feel better. That's something that we can do, but that's in the last two three weeks, we've definitely tried to step up our patrols and, I think, hopefully, you've noticed not just cops out on patrol, but also cops out on foot to make their presence a little bit more seen and more visible. Thank you. So much commanding officer, deputy inspector Yaguchi, we'll have some questions for you later. So I hope you can stick around. There are a lot of questions about reporting crimes and what does not work in terms of providing that information to the NYPD. So when we get to our Q&A, I'm hopeful that you'll be with us to answer those. So I will now turn to elected officials. We have a couple more than we anticipated before I do that. I want to we'll hear from Gail Brewer Helen Rosenthal Linda Rosenthal, if Robert Jackson, Senator Jackson is with us and then Brad Hoyleman in that order. But I wanted to recognize those elected officials who sent representatives but were not able to join us. Comptroller Scott Stringer was able to send Jessica Silver and Mike Stinson of his team. Congressman Jerry Nadler sent Robert Gottheim Congressman Mark, I'm Sorry Council member Mark Levine. I just gave him a promotion, sent Eric Cuell Senator Brian Benjamin sent Shanna Harman Goff Senator Jose Serrano Jr, since Sawad Hassan, I guess Jacob Priley is with with Senator Heyman Hope K who's with Senator Jackson and Liam Galligan for Assembly member danny O'donnell. So we thank everybody for the attention of our elected officials paying to all of this. I do not mean to be rude or disrespectful, but I'm going to beg my elected officials to please keep it to two to three minutes calling on gail Brewer first and with thanks for all that. Your help that you gave us with this meeting. Thank you very much mark and I want to thank the three providers. I have to say knowing Manhattan well, people may not know this, but they're three of the best we could have had others, whom I will not mention, but for whom I do not have respect. I also want to thank the 79th Day Black Association and everybody who's been working on this issue. I'm going to be less than a minute. We wrote a letter to commissioner banks, it's up on social media, it's going to be on our website and it certainly has been in our newsletters, and I am upset because if, in fact the city moves people into hotels without telling the community, then we can't plan- and I know you understand- you- do not want to be told- no not to go into the hotel, but you got to plan and right now we're in a situation where there's not a lot for the individuals to do during the day. So we have been trying to work on that at the Lucerne at the Belclair, the bell north and we are working with some local providers to try to change that. But that is a concern. If you plan in advance, then we could have dealt with that. Second, I know that security is the issue again, planning would have helped. How can we work with the precincts who are trying so very hard? I know that the security staff is going around to the different hotels, particularly at the Lucerne and they've, been very responsive and Charlie's. Discussion with the restaurants has been phenomenal because I've been to all the restaurants. They have this number and they appreciate it. But if we get a hats on discussion in advance, how we would understand- because I'm not sure I do what does nyp do? What does the outreach teams do? How do they work together? That would have been helpful just in terms of outreach. I have been begging DHS for more support, so that people would know who's from which hotel and who is the individual working with goddard and the outreach. I have not been successful yet, but I think there might be one glimmer of hope to get more support and I just want to say that we do have a copy of the contract. If anybody wants it, I'm going to put my information into the chat I'll, be glad to send it to you and just. Finally, I think that we do not know when the end date is. We know that this is not a permanent situation. I do wish that we could figure out because I've got Midtown too this I got the entire borough and I know all the problems that was in Midtown two and a half hours a day, walking around same issues same problem, and I wish that we could figure out as a society that people have the kind of challenges, and I understand the need for Covid-19 be more secure in terms of not being in congregate, shelters. I've been working in this area for a very long time. I understand exactly what you're doing, but we do need to think of our stores, our small businesses and figuring out. We got a garbage problem, there's so much in one community, it's hard for the folks to deal with it, so we do need to figure out. How can we be more supportive on the issues that were left but that were listed, but also? How do we figure out how we do have higher quality drug treatment or whatever is needed on a daily basis? So thank you mark. I do want to say the DHS. We need permanent housing and I have a building at 1763, Amsterdam avenue which ds wants to make transitional. I want to make it permanent, because the biggest problem we have is the lack of support of housing. Thank you very much. Thank you for President. I wanted to acknowledge the public advocate. Jumani Williams has a representative here, but the name went by so fast in the chat. I did not catch it, but it's in the chat. I thank the public advocate for being with us and turn immediately to council member Helen Rosenthal Helen. Can you unmute yep? I think thank you for being with us yeah, thanks for having me mark and thanks to all of community board, seven for hosting this important information session, and thank you to the hundreds and hundreds of residents who are participating tonight. I'm here, of course, to listen to my constituents, but I'm also here because we have to find a path forward together as a community. Now these shelters are not permanent, but they are absolutely impacting us. That's without a question. We are also experiencing the impacts of a growing street homeless population and, as I look through the comments in the chat, I think many of those comments have to do with the street homeless and, unfortunately, goddard Riverside outreach is not on this town hall tonight, but we are actually oh great. I hope they have can talk about this. You know in agreement with gail, we need many more resources on the street to make sure that we are helping our street homeless actually agree to come in to shelter. So how can we make sure that everyone feels safe on our streets and how can we make sure that the people living in the shelters are getting the services they need? So they can live here safely and then move on forward, and I felt Eric started to address that in talking about the types of meetings that had that his staff has been working on today. To me, the two: these are the two overreaching questions. Listen I've so appreciated the very many conversations I've had with you, but I was struck in particular by the email that Mark Greenberg sent out today, and I see him here as well: Mark directs the Interfaith Assembly on homeless and housing. I agree with him that the upper West side can play a very constructive role, as the city tries to address the Covid-19 crisis and our crisis of homelessness. For a limited time, several hundred shelter residents will be our neighbors as mark asks. How can we find a way to live responsibly and respectfully together? Thank you, Mark. Thank you. Council member. I'm now going to call on Assemblymember Linda Rosenthal and followed by Senator Robert Jackson and Brad Hoyleman hi, everyone, hi mark and hi Community board, members and providers, and everyone else on this call. I've lived on the upper west side, my entire life, my family fled Nazi Germany to come here, and they took root here on the upper West side. At a time before our community had a great renaissance, they worked to build a community, we could all be proud of. It took many years, and here we all are, but the Covid-19 pandemic has changed life for all of us, sheltered or not in a very short period of time, and the changes have been significant for many people's lives, incomes, housing situations and the future feels and is uncertain, and I've heard that sentiment from so many of you over the last several months. Those who've called to discuss homelessness. Those who've been laid off and my office has helped thousands of people get their unemployment from the State Department of Labor and people struggling to pay, rent and feed their families. So these times are tough for everyone, including the homeless, men and women, who were moved into our neighborhood seemingly overnight, in an effort to keep them safe from the disease. I do agree that we should have been notified, so we could all work together before people were placed here. I always say this communities need to be in on what is going on the city and the state at times can not just place people without in a community without getting communities to be part of making it work, and no one learns their lesson, and this keeps happening maybe after this it won't, but there are hundreds of new people in a seven block radius and we also see a lot of people, including some in front of my district office, who are on the street. Our homelessness problem was record- breaking before this kofit 19 laid bare all the flaws in our system. Our homelessness problem is not an accident. It's the result of policies that have allowed people like Sandom and Michael Edelstein to warehouse units kick out tenants, break the laws and still be rewarded with lucrative contracts from the city we've given out handouts to wealthy developers and not created enough permanent, affordable housing, and that is what we are lacking. That is how we get here today, but I must say, as the chair of the Assembly Committee on alcoholism and drug abuse, there needs to be a lot more treatment for mental health and substance use disorder. If I had a majestic wand, I would ensure- and I hope that the city can come up with funding, even as they cut valuable programs to engage some of the people who live here, who are very troubled and have a substance use disorder. It is a disease and let me be absolutely clear- all of science, no matter what side of science you're on agrees, that substance use disorder is a disease, it is no one's fault, it is no one's fault, but we need more resale resources dedicated to outreach and support more counseling, more support, so people can get better. People can move into their own housing. The city should not have placed the sex offenders that it knew were not allowed in the neighborhood in the neighborhood. That is, that is not right. That is against the law, and laws are passed to be followed, so that was terrible and inflamed everyone, and rightfully so you can't have sex offenders who are restricted for where they live in the community. But in the meantime these people who were placed in Lucerne are here they will be here. They need help. We can't just say move them to another neighborhood, because there are on our upper west side, just they are at the way they are in Hell's kitchen and lower Manhattan. This is the problem that the whole city is dealing with. My hope is that it'll be soon that there is a way for people to live in congregate, shelters with no chance of getting a disease, but right now people in active addiction need support to stop using people in recovery, need support to maintain sobriety and they need more access to counseling and drugs that can help them along the way. They're medication assisted treatment, drugs that will help people, but people also have to be ready. This is a very fraught situation, but it's our west side and it's up to us to make sure we all live together. Nothing is permanent, but we all need to work together and to make the west side what it always has been. Thank you. Thank you. Thank you very much. Thank you so much for that. I'm going to turn now to Senator Robert Jackson Senator Jackson. Are you with us, and can you speak all right, we're going to look for Senator Jackson, while I call on Brian Hoyleman Senator Hoyleman. Yes, thanks, mark I'll, be very brief. Thanks to the providers DHS. Thank you Gail for putting this together and my colleagues just to say that the lack of planning, the lack of communication is unacceptable, even in the middle of a pandemic. Even when we are trying to you know, do the right thing. You could expect these this outrage from community members, given the fact that they did not know what was happening. Given the fact that elected officials did not know us, so we have to learn from that, but in this in this situation, I'm going to get out of the way, because there's a lot of a lot of very constructive comments that I know the community is willing to share. But I do have a question about what the time horizon is going to look like what your epidemiologists or the Department of Health says, is the figure for when it's safe for these men and women to return to congregate housing. I think you know we have the right to know what you expect in the future in terms of the infection rate which now, as we all know, is below one percent. When is it going to be safe or are we are we looking at weeks and months, even though we're keeping the infection rate so low so, but thank you to all the providers for doing this work. I'm greatly appreciative. Thank you. Thank you. So much senator. I do not see Senator Jackson with us. I do see Senator Serrano with us. I was not a scheduled guest, but Senator Serrano. If you can join us for just two just two minutes, please and tell us a quick update. Thank you very much. I appreciate the meeting the purpose of this meeting the necessity of this meeting and it's really important that we hear from the community that we hear from all the stakeholders. As I said in the previous meeting that we had on this issue, it's very difficult when the rhetoric becomes so harmful to a point where people retreat to sides and they do not really discuss in ways that that are very helpful and move us forward. I'm very grateful that this dialogue is happening now, but, as my colleague Senator Hoyman said, we needed a lot more of it on the front end each and every constituent who's reached out to the office. We have a responsibility to hear their concerns and to follow up on their concerns, but again mark. I do not want to take up time. I know we need to get to questions, but I appreciate you giving me the opportunity to say hello. Thank you, Senator, I'm going to know unless Robert Jackson is with us and I do not see him so apologies to Senator Jackson, we'll get you later. If we possibly can I'm going to keep going with our with our community partners and I'm going to beg everybody to please when we say two minutes, we really mean two minutes, please I'm going to call on Doug Clyman, my vice chair to let us know when we're about a minute and a half in so from here on in we go with parent leader, Adam Herbst from the Manhattan day school. Please Adam and mute yourself and join us hi. There thanks mark I'll, be about one minute. My name is Adam Herbs, I'm a resident of the upper West side for the last 20 years, and tonight I'll be speaking on behalf of Manhattan day school school in the community. For more than 75 years, with more than 500 students from ages 2 up to 14., the school is located on 75th street between West End and Riverside drive. I would like to thank the entire community board for inviting me to speak this evening and for facilitating this working group of schools and also expressed my most sincere appreciation to the providers and to the police and the 20th and 24th precincts for everything they do to keep us all safe, they've offered to increase the patrols near the school and have been accessible to speaking with us. On more than one occasion, I have been a senior executive at a local children's hospital and previously worked for a non- profit, supportive housing provider based in Harlem and I've also been an auxiliary police officer for the last seven years. My wife is a pediatric infectious disease doctor and an epidemiologist. So we fully understand the city's plan to move these individuals to stop the spread of Covid-19 and agree that it was necessary in the middle of a pandemic, to save the lives of people who have nowhere else to go, but in the interest of full disclosure, the percentage of people with Covid-19 in the city is currently under one percent and has been for over two months now, and we really would like to understand what metrics will determine when this emergency will be considered over first as members of the community, we do intend to be good neighbors I and the school supports helping the homeless, but neither we or any of the other parents or school groups were given notice and input about the moves that were being made here, particularly the unacceptable number of registered sex offenders, moved so close to playgrounds in schools. There was zero transparency, despite what the deputy commissioner said earlier, and many of my neighbors have only shared their loss of safety with respect to this. In one week our school will be opening and after much preparation, most of the children will be returning to the school. The first and most important question that parents have right now is how students can go back to school safely in light of the ongoing pandemic. The latest American Academy of Pediatrics advice says that children learn best when they are in school and normally kids will get bus to school through the board of Education, but obviously due to the virus that will be happening this year. The vast majority of our kids will be coming by either foot or public transportation. Then foot and our parents are worried about the safety of themselves and their kids. Many parents have experienced homelessness before in the city, but this increased homeless situation that we're dealing with now has caused major alarm: a loss of safety and security, and many people are looking to leave the neighborhood and somehow already have due to the increased harassment. The lack of hygiene, including people screaming defecating, masturbating coughing without mask in the middle of the street, open drug use and, in other cases, just blatant disregard for the law. The upper West side has always been a vibrant, family- oriented community, and in normal years we often see people moving into the community and contributing to the community. Yet this year, obviously, we have lost many people due to the virus when they have looked for open space and less crowding. Now, unfortunately, with the appearance of less safety and uncertainty, more families are feeling less safe and are feeling being like they're driven out. We understand that these people were not relocated to our community. They did not necessarily ask to be here, but while they are here, we need reassurances for the safety of our children, the parents, while they walk to and from school. It would be unacceptable to move any more registered sex offenders or dangerous individuals so close to a school, placing them there illegally. To begin with was shocking, but we have been told they have all been moved out and we hope this is true, we'll be running many programs for our young children outdoors this coming year and we hope to ensure that our kids will be safe as they have been in prior years. Requests. Three minutes: please wrap up. Thank you. Finally, I just would like to say that we do not believe crime. Homelessness is a crime, but we do want to be part of the problem. We only support compassion for homeless individuals. We propose a work group between the city and the DHS and the service providers, the police and members of the community, and I ask for serious consideration of this idea so helping with communication and transparency. Thank you very much. Thank you. So much I'm going to turn immediately to Carrie Goldwyn, who is with the goddard Riverside homeless, Outreach group carrie. Can you unmute? Yes, I can hi everyone thanks for being with us happy to be here. My name is Carrie Goldwyn, I'm the program director with Uptown, Goddard's, homeless, outreach team and I'm joined tonight with our executive director, Rod Jones and our deputy executive director Roberta Solomon. So I'm personally not going to give as eloquent a history of the agency, but I will just share a little bit about what our outreach team does. So our teams cover the upper West side. It's 24:7 coverage. We work with folks that are street homeless that are staying on the street, with the ultimate goal of getting them into permanent housing along the way we seek to place folks into transitional housing and provide a range of services, including connecting folks with benefits, medical care, psychiatric services, substance abuse, treatment through other providers and ongoing case management. Our teams are out there daily, responding to not only through and ones but responding to hot spot locations and community concerns, as well as just canvassing the entire catchment area, engaging new folks and offering services. Was that too brief? Oh, that's! Terrific! Thank you very much. I was not accustomed to somebody taking me seriously about the time. Thank you. I'm going to turn immediately to lorena Matas. I hope I'm pronouncing that correctly. She is with the upper West siders for safer streets lorena. Please join us hi! Thank you! Mark hello. My name is Lorena Marus, I'm a hispanic citizen and I'm a concerned. Parent and member of the upper West siders for safer streets. Upper west siders for safer streets is a non-, partisan facebook group that was formed by residents and local business owners out of collective concern for safety in our neighborhood, the Facebook group was has provided a forum for information sharing and collaboration and solutions to address our concerns. After only a few short weeks, our group is rapidly approaching 12,000 members. So thank you for opening this letting us speak tonight. Our safety concerns are not unfounded. In the span of a few months, our community has fallen prey to a number of incidents that we have not experienced in the upper West side in recent memory, such as unprovoked attacks and vandalism to residence, cars and local businesses. Just today, a man was seen running shirtless out of the Lucerne and down 79th street, while screaming as police entered the hotel. In addition, DHS placed 19 level 2 and level 3 sex offenders into temporary shelters without community notice or transparency. Many of these men are violent. Sex offenders and most committed crimes against children, level, 3 offenders and offenders on parole or probation are generally prohibited from living in one thousand feet of a school. However, these men were placed undeveloped in close proximity ps to a Ps87. It was not until the community raised awareness of this issue that something was done about it as of today, Nys Sex, Offender, Registry reports, two level two and two level. Three offenders living at the hotel, El Claire, the character of our neighborhood has changed enough for the better. There have been countless incidents of certain reported of public urination, severe public intoxication public heart drug use and an increase in drug deals taking place on our streets, as well as a variety of forms of harassment, including cat calling and aggressive panhandling. In addition to the hotel, shelter residents have not been consistently being wearing mask or social distancing in keeping New York state guidelines for Covid-19 prevention. The city's recent actions have created a climate of fear and danger on the upper West side. These unsafe conditions have heightened fears of residents, especially the elderly, their caregivers and women in the community. In addition, these actions have heightened fear of local business owners whose livelihoods are at stake. These conditions are particularly detrimental to our local businesses who are struggling to survive during the pandemic environment. We are living as we all know. This will continue to have an impact on our community. For quite some time, our elected officials have failed us their constituents through a complete and utter lack of transparency, accountability and responsive actions. For our concerns, you have an obligation to provide an environment of safety to your community, and you have failed to do so. The current situation affects everyone in our neighborhood, including the most vulnerable population, the homeless people who have been failed by the city by being left out on the streets or placing hotels with adequate social services and facilities to address their varied and complex needs. I like to ask our elected officials how our children are expected to be go back to school in a few days when the streets they need to traverse to get to and from school present such unsafe conditions. What is the city going to do to restore safety in our neighborhood? What concrete steps will the city take and when will they be put in place and communicated to the residents in our community? Please wrap up, I'm almost done a few more words and how will the city commit to adequately and effectively help the homeless population? I am an american citizen. I love my adopted country. We are all residents of this beautiful community and we want to stay quiet. Thank you for your time. Thank you for your presentation. I'm going to turn immediately to the open hearts, Initiative and Melissa Sanchez to be followed by the West Side Community, Organization and Megan Martin. Please go ahead! Melissa Sanchez! Can everyone hear me there? You go okay! Thank you for giving us a moment to tell our community about the upper West side, open hearts initiative, we're grateful for the work of the experienced and dedicated service providers that, as an emergency public health measure, have temporarily relocated to neighborhood hotels. As tonight's representatives have explained, services provided in the hotels are identical to those that would be offered to in an ordinary shelter, environment or any other temporary location. The staff at these shelters, as well as some of the residents, are among the essential health and service workers that we all applauded every evening at seven. During the darkest days of the pandemic. We do not want to send them to someone else's neighborhood. We know that all neighborhoods have children. We know that all people deserve to feel safe. Evidence- based studies have established that shame and stigma, Impede recovery from addiction and mental health disorders. Accordingly, the open hearts initiative has sought to organize both moral and material support for recovering shelter residents. We have mobilized direct donations of supplies to these organizations we have held, we have held or art supply drives. We have hosted sidewalk talk events where families can write encouraging messages recognizing that 35 percent of health, USA residents and 15 percent of project renewal and cucs residents are employed. We have planned metro card drives to help them get to their jobs. To assist those seeking work, we are organizing resume workshops and an employment fair. We seek to raise awareness of facts about crime in our neighborhood, as we've heard from several tonight. Nypd statistics show that, while complaints about quality of life infractions are up year- to- date, violent and property crimes are down by 10 percent compared to the same point in 2019 in our neighborhood. Many in our group are parents and we want to protect our children from sexual assault and abuse through awareness and through education. Department of Justice records show that 93 of assailants are known and trusted to their victims. Seven percent of assailants are strangers. Removing registered sex offenders would bring a very welcome reduction of the risks of stranger assaults in our neighborhood. It would not be nearly enough to keep upper West side, children safe. We want to keep upper West side, children safe, and we want to do that by reducing the greater risk posed by those that they know open hearts initiative and it's a group that has grown out of it upper West side strong, are thereby combined. Compiling prevention resources and planning expert- led online workshops in hopes of empowering our community to be proactive about all risks, sources and warning signs of abuse and assault. We want to keep the upper west side a place that is safe, harmonious and hospitable. To all, please wrap up on my last sentence. We have written an open letter to city and state officials on this matter and you can learn more about our work and join our initiatives at www. We're not asking for your money, but we would be grateful for your time and help. Thank you. Thank you. So much returning to West, Side, Community, Organization and Megan Martin, obviously we're running longer than this meeting was ever intended to run. I'm going to do my best to move us along here. We will get to questions and answers. Please help us out with that. Megan Martin is the next to speak and we'll get we'll get our stakeholders and then our questions. Thank you. Chairman Dillard and Cv7. I'm the president of the newly formed nonpartisan and Grassroots Community group, the West Side community organization in March, Kova changed our world. In a way. No one could have imagined every new yorker has been deeply affected as a medical doctor, who also has a master's degree in public health. I am particularly aware of the risk that cobit presents to our homeless population. However, what has occurred on the upper West side is to replace one public health crisis with another. The upper West side is known as a welcome and diverse community in a short period and without any transparency, a large at- risk homeless population was relocated to three local hotels, ill- equipped to serve their needs. A significant number of the residents in at least one of these hotels are classified as mentally ill and chemically addicted, otherwise known as Mica are particularly high- risk population and in need of greater support services. The mayor himself admitted when this policy was implemented, that hotels are not. The answer, and many homeless advocates have noted that, in the case of Micah Shelter clients, temporary hotel housing may create significant community problems, as well as fail to provide appropriate services to this at- risk population. As a result of this failed policy, upper west side residents have witnessed in a very short period the growth of open and illicit drug use, needles on our playgrounds, aggressive, panhandling and public masturbation. In implementing this policy, the city did not evaluate the impact that these hotel shelters would have on this vulnerable population. Consider the effect on existing residents or businesses or seek input from the community. In doing so, the city has failed us all. These problems should not have been a surprise as they understand these same effects happen when many of these same residents were housed at the Washington Jefferson Hotel on 51st street. As part of the city's covent response efforts, the solution to the complaints of that neighborhood Speaker Ford Johnson's district was to move many of these same residents and problems 28 blocks north to the Lucerne hotel, where history has repeated itself. This undercuts the argument that this was all Covid-19 related. Also, this has deeply impacted our quality of life and devastated the rebirth of our small businesses, who were so desperate to reopen. Just as the second hit occurred, we are asking our local officials to fix the failed homeless hotel policy that has put both the men and community at risk. These individuals should be moved back to housing, which is appropriately equipped to deal with their specialized needs as quickly as possible. This is even more true, given the diminishing risk of cobit as the city reopens and the Mir himself committed to commit to moving these residents back to appropriate housing immediately. The city instead moved more homeless residents into another commercial hotel in Brooklyn. While we recognize the pandemic has changed the world, it can not be avail for careless decisions by our elected leaders that are detrimental to our community. The city's approach on the upper West side can not be the new normal. The westside community organization urges our politicians to take action and insist that the city honor the mayor's commitment and set a clear date by which this failed hotel experiment will end every new yorker deserves better. Thank you for your time. Thank you. So much we're going to keep moving right along I'm going to ask the remaining speakers to please keep it as short as they possibly can. Dale Brown the West 79Th Street Block Association, followed by Steve Anderson of the Theodore Roosevelt Park Neighborhood Association Dale you're up. Thank you mark and thank you for everyone. Who's participating, I'm Dale brown, president of the West 79Th Street, Block Association, and I've lived on West 79Th Street for 50 years, when it was announced that 283 homeless, men with drug and alcohol abuse issues would be moving into the hotel. The cern the neighborhood was in a state of shock. People were scared and angry concerned for their safety and the safety of their families, and there were those that were welcoming concerned for these men's welfare and wanting to greet them with kindness. It has been a tradition that westsiders have always welcomed the less fortunate and the homeless. Everyone wanted to know why we did not have advance notice. How come our elected officials were in the dark. There was no community input, no time to repair and major concerns about these men being so close to our schools. We're already dealing with the pandemic. People working from home people have lost their jobs, seeing local merchants struggling to stay open to serve the community and seeing many of our favorite stores close their doors forever. Now we have the addition of the homeless men in this shelter. The first three weeks were truly a nightmare: men, roaming, our streets gathering at the medium at 79Th, Street and Broadway 15, or more none wearing masks, smoking drinking, throwing garbage around and blocking the crossway to the other side of Broadway. The Block Association has made constant and instant on communication with project renewal management, heads and their security chief. I personally have conversations with their senior vp and the coo every two to three days. Several of us have met with the chief of security and their vp of programs. Things seem to be getting better project. Renewal has now had all their administrative and program staff at the Lucerne, formerly from the two shelters in the village. These people know the men and the men know them. Programs are being held at the Lucerne and at the third street location, where the men are driven in vans. We are seeing less wandering men around the neighborhood. The Block Association requested more security guards patrolling 79th street from Amsterdam to broadway 78th to 80th Street project renewal now sends out more security guards. At a meeting with captain Zuber of the 20th precinct, we requested more police presence. As everyone knows, the police force is at a bare minimum due to budget cuts. Their outreach program is no longer they can not hire any new officers. The captain has assigned six officers to go from 72nd street to 86Th street on Broadway from 12 o'clock noon to 8:30 at night. Patrolling this particular area. There is a patrol car, that's parked in front of a lacern at 9:15 in the evening till 10:30 at night, observing the men returning to curfew, please wrap up. Okay, I will thank you on the kurdish. The guardian angels have been around our neighborhood Ellie Wazel said indifference can be seductive. It is much easier to look away from victims. These men are victims. This is a temporary situation for these men and we would like to make it a win- win situation for all of us. We want our neighborhood to be safe and welcoming project renewal is working hard to educate their clients and they are working closely with our Block Association. Thank you for your time. Thank you. Dale we're going to go right to Stevie Anderson Steve, please! Yes, thank you. I will be very brief and we've created another crisis, and that crisis is that we simply do not have confidence in government. Let us down. They went around the backs of our elected officials and they did not provide the type of engagement that it would have given us an opportunity, as a community to rise to the occasion from the start. Where do we go from here? I'll? Be very quick about this. I think there ought to be a website that has every day a report from the providers on all the information that they have shared with us now, every day, update us and give the information not a facebook page where there's a bit of debate, but a report from DHS and the providers each day that we can access. Secondly, please tell us what we can do as a community to be part of the solution. This is essential for us to move forward. We banged the pots and pans to recognize the essential workers. We did it because we knew that was important. We recognize that the need for justice in our community. We have a great history of compassion here, give us the tools to let us use in our capacity in this case now and let's move forward. Thank you. Thank you. Steve, I'm going to go to Melissa Bender for who is speaking for Rabbi Lauren, Grabel Hermann, I'm hoping that you can edit that your statement on her behalf because we're it's already eight o'clock and we desperately need to get to Q&A all right. It's a three minute statement. I'll do my best to the members of the Community Board seven and the upper West side community from Rabbi Lauren Grebel, Hermann, S.A.J Judaism. That stands for all. I regret that I can not join you this evening due to a long- standing commitment. I proudly have served as a rabbi of the upper West side for over five years and in just one week I will call the upper West side. My home, the jewish community, has entered into a time of personal and spiritual reflection in advance of the jewish high holidays. It is a time in which we consider the ways in which we have not lived up to our stated values or been the best version of ourselves. It is the time we aim to set ourselves on the right path, as the community meets to discuss the temporary use of shelters in the upper West side neighborhood. It seems to me an opportune moment for this kind of reflection. Have we been showing ourselves to be the people we profess and hope to be of people who believe in opportunity, diversity and inclusion? Have we participated in or tolerated speech or behaviors that dehumanize others or relay the blame for systemic societal problems on a few individuals? Have we followed the golden rule and done unto others, and, as we would have wanted done for Us jewish tradition teaches that even the most poor in a community must give some bit of charity? We do so. We are taught because we never know if we might be one of the people who one day need that same charity, and we want to promote a cycle of giving being homeless is not a crime, and it is not a personal failure. It is, and has always been a result of a system of inequality in combination with a lack of access to needed services in this pandemic. The riches richest Americans added to their wealth, while others lost their jobs, benefits health insurance and many did not even qualify for stimulus money based on their immigration status. If and when evictions begin to take place and unemployment continues, we will see more people in need of shelter. As things go from bad to worse, it is vital that we work with the shelter providers to support them in their needs to serve the population, including more outreach workers to support their mission. This time of reflection also offers us a time to listen and to learn. I would love to see and am willing to take a leadership role in seeing our community talk about and think about how we got here as a city and a country, many of the chronically homeless, who sleep on our streets and are not living in any of the three locations suffer from mental illness. What are the mental health services that are available to the poor? There are those in shelter who use drugs. How is our city and state working to prevent drug use or provide adequate support for those who want to turn their lives around and perhaps most of all, what does the amount of people without homes in New, York City, say about our social safety net? And what can we do about all of this? I hope and pray that we can ask questions of ourselves in this moment and to engage in the big picture. Long- term conversation if we believe that all people should live in dignity and have the chance to be safe. Let's begin to think about the bigger issues and how we can do something to make our city more equitable and more hopeful for all who live here. Thank you so much pastor, K carpent from the church of saints Paul and Andrew thanks Martin. I will try to be brief. Very brief. Our church has been on the up west side since the 1890s. I myself have only been here since the 1980s we've tried to do what we can to create a positive situation here. We are actively engaged in work, both with homeless individuals and also with a number of other residents trying to prevent additional people from experiencing homelessness. We try to be a good neighbor to everybody on the West side, both long- term residents, who care so much about this neighborhood as we do ourselves and also now figuring out how to be good neighbors to these temporary residents who have come here. I love the West side. It's been a wonderful place for me and my family. I love the energy, the I love the diversity. I love what I think and I've experienced as a spirit of compassion and a spirit of open- mindedness, and I hope that through all this, we can keep that in mind and keep that going. I guess my question and the question of a lot of other clergy that I've been in touch with in a lot of other communities of faith they're about 60 to 70 communities of faith in the West side. We want to know what we can do to be constructive in this the situation, what we can do to support the residents of these shelters and also what we can do to get to a healthier conversation about safety for these new residents and safety for a long time and ongoing residents of the West side, we're very interested in that, and- and so I just offer our whatever resources and help that we can offer to the situation, which is not ideal. Nothing about this pandemic is ideal, it all sucks and we hope that we can move forward in a positive direction. Thank you, pastor, kay. Those questions are also in the in the Q&A that I'm trying to get to. I'm going to call on one co-, op and Condo Board recommended to me by one of my colleagues. This is Yuri Pavad from the central Savings Bank building Yuri two to three minutes: please, no more yuri! Can you unmute? Yes, okay? Well, thank you for inviting me. I represent the boards of conducts and condominiums of the upper West side and if I can just summarize two poets number one, there is a starking difference between what officials presented to us today with reality and what actual our neighbors feel and see in the streets and the second message. I would like to say on behalf of other board members that we see exerters of our neighbors from this neighborhood and the recent development with moving these homeless. People actually accelerated that movement and I've been hearing that people are concerned about the schools and people with families moving out and with them, local businesses losing their clients and we're losing revenue from taxes, sales, taxes from property taxes, small businesses, losing customers and their employees become unemployed, and we can see more and more vacant real estate in our neighborhood. So the trend is not very rosy and that's my message. Thank you. So much. I'm the last person I'm calling on before the Q&A is Mark Greenberg for the Interfaith alliance on homelessness and housing mark. Can you help us with a quick statement? Thank you very much mark and thank you all for everything. You've offered and contributed- and let me just say we are such a great community on the upper West side. So inspired by all of us. I know that if any community can figure this out, we can I've been working on the issue of homelessness and affordable housing about 35 years. I think some on this call have been doing it longer than I have. We have a tremendous amount of institutional memory and collective wisdom here. I also want to acknowledge the fear and concerns of some of the in this gathering field, but I must say in my experience of working with over 500 homeless individuals, I have never once felt threatened. So I think fear, even unfounded or largely unfounded fear can be a very powerful thing, but I would suggest anyone who's afraid should get more engaged and we will learn that the fear is largely without merit. As Linda Rosenthal mentioned substance abuse is a met, is an illness, and I think many of the men who are who have visited us on the upper West side are struggling with this illness and many of them very successfully. I would suggest that the those in the group that are having very difficult times and are creating problems are a vast minority and I'm glad to hear from Miss Brown that that the numbers of problems have disappeared or have been reduced. I just want to say one thing. I think that a big element- that's really not being included, is the fact that I think any fruitful conversation that we have about homelessness must really include representatives of homeless themselves. I mean, after all, the homeless programs. Homeless system is to help them they're at the center of this issue. They need to be part of the conversation. They need to be part of the solution, and I know in my work with homeless individuals directly. They want to help. I think that what we need to do is find ways of engaging them, give them an opportunity to be of service. I think, as my friend James Addison, who was formerly homeless and worked for the home park, if there are no problems in the building, there will be no problem in the neighborhood. We need to speak to these folks and ask them what we can do to help them and how they can help us now. How can they help? I understand that we have some restrooms that were dismantled because there was vandalism. We could have had some of the guys from the from the belka from the from the belcher and others being security people at these facilities. We could have people on the street part of a neighborhood hospitality corps, providing services, helping people be directed to bathrooms, to provide security, possibly help with voter registration or with poll watching there are things that they can do that we need to ask them to do. They need to feel engaged. You know people that we have in our in these hotels, they're, going through the most difficult time in their entire lives. This is not who they wanted to be it's not who they grew up to be they're going through hell. What they need is a community to support them. What they need is someone to listen to them to ask them how they're doing to say. What's going on? How can we help? I think Kay's offer of faith communities wanting to help is crucial. We all need to be there for them and I think together we can figure it out. I just read a chat from a miss cohn who said my husband and I have been the belt player for years. We welcome our neighbors. Everyone has been attentive, wants to live harmoniously in the building. I think that is by and large the truth of the matter and I think again, together with all the collective wisdom, we can make this work and I know we will and I stand ready to help. Thank you. Thank you. Thank you. Thank you. So much I'm going to turn us now to questions and answers that were submitted in advance, which we have compiled then try to. You may not recognize your own words but they've. There were many common areas, I'm going to beg the our team from this. Obviously it's 8:15 and it's obviously later getting to this than I had ever hoped we would. But I thought it was important to hear from our community organizations who asked to speak so we've done that we're going to go to Q&A with the permission of the DHS team, I'm going to go right into questions and answers, and and we'll jump with that I'm seeing this drinkwater nodding. Yes, so thank you for that. We're going to jump right into that, and so the first question there were a lot of questions around the duration, the length and so forth, and the question the questions that came out of that were how long is temporary. How are the will? These hotels be used for permanent shelter after the temporary uses is concluded, and then there were a lot of questions about fair share. That, in effect, in effect, fair share is the suggestion that there are many more of these kinds of operations and facilities on the upper West side than there are in certain other communities. So can you address the how temporary is temporary and also speak to the distribution of the use of hotels around in various neighborhoods around the city? Thank you. Can everyone hear me? Yes, thank you. Okay, great, thank you, okay, so on the the timeline for going back into congregate, shelters, what we know is moving into the commercial hotels has helped us in respect to the low infection rate that we are currently seeing. We are also continuing to test our clients, who are in our single adults system. We are working just as closely as we did with the Department of Health and Mental Hygiene State Department of Health and CDC, based on their guidance as we were when we left the shelters, as we will be to go back into the shelters. Our single adult system is a system that built up haphazardly over many years. Each shelter building is laid out in a different way. It requires a different analysis for each of the locations we are currently using congregate. Shelters we've been able to do so because we've been able to de- densify those locations by moving people to commercial hotels. We have to be able to have both the ability to social distance in the commercial hotels, the availability of testing and making sure that our clients have access to those things. So that way we can continue to keep the infection rate low. The move back to the commercial excuse me, the move back to the congregate capacity will rely on those things we do not have a definitive timeline. I understand that the mayor's comments great provided anxiety in a good way that this was coming to an end soon. There are a lot of unknowns beyond our control and we are working together with the medical experts to continue to make sure that New York City's infection rate as a whole remains low right. The way that our system interacts with New York as a whole is also important here. So I understand that everyone wants a definitive timeline. We are working with the experts to be able to understand what thresholds need to be met to be able to go back into the congregate locations. The city is slowly reopening our experts at the test and trace location are minding the numbers to make sure that, if we're seeing increases in the infection rate that we're able to determine how and why that is happening, we'll continue to provide masks and testing to our clients in the single adult system. Some of the other questions included fair share. I mentioned in my remarks the fact that the city has gone into approximately 60 hotels as part of our densifying effort. Four of those were located in community board. Seven for numbers in terms of individuals placed in community districts. The upper West side does have other locations that are used to house or shelter homeless, New Yorkers, it falls sort of like in the mix of where the city is so that's those are the numbers I can provide you today. Thank you, I'm going to shift to I'm going to shift to sex offenders because that's obviously one of the more incendiary questions that is on everybody's mind. It's obviously filling up the chat and so forth, and I guess the questions are stem from what is permitted there was. It would be great to have clarity on whether there are any registered sex offenders left in these hotels and if you could address the concerns of folks, especially parents of children in a residential community that is, that is being shared with multiple sex offenders and of different levels. Sure I will answer the question we provided this update and response both on last Wednesday stakeholder call and then in writing to the borough president, with the hopes that it was getting disseminated into the community. The city of New York places all of our clients in appropriate locations in accordance with state law, and we provide shelter to new Yorkers experiencing homelessness, irrespective of their background. All verifiable homeless. New Yorkers have the right to shelter. The right to shelter is unique in New York we're one of a few major cities that has a right to shelter. What this means is individuals are able to get connected to programs and services that there's not restrictions on who and how people can come into the shelter based on their background, they're able to rebuild their lives and get a second chance, as opposed to being out in the street. If you compare New, York City compared to La, you see a stark difference in the numbers of new yorkers experiencing homelessness on the street compared to those in shelter who are connected to case management, housing, specialists, substance use, counselors and other resources to get a second chance and to get back on their feet. We in respect to sex offenders. I want to provide some information that I believe was useful on the call we did not have any follow- up questions, and so I like to think that we were responsive. So the requirement of that a sex offender has to register is separate from that of the residency restriction requirement. The residency restriction is imposed by the state during period of Parole New York state classifies sex crimes into three levels based on an offender's risk and a risk of committing another sex crime and the harm to community level. One is low level, two is moderate and level 3 is high. These risks are determined at the time of offenders, release into the community and are individualized based on the case and the facts. Such offenders, convicted of the same offense, might receive a different risk level based on those individual circumstances. This level of risk also governs the type of information which can be released as community notification and as well as the duration of registration, with the state division of criminal justice and, as a general matter, sex offenders under the New York State Sex Offender, Registration Act Sora level. 1 sex offender must register for 20 years, except with certain designations level. 2 and 3 sex offenders are required to register for life separate, and apart from this, registration requirement are potential restrictions where a person can reside upon release into the community. These are oftentimes called residency, restricted sex offenders. A person's status as registered does not mean that the person has a residency restriction. Sora does not restrict where a registered person may live. Rather, the state's residency restrictions are a component of the state's sexual assault, Reform Act, Sarah and under that restrictions are imposed as a condition of parole or conditional discharge, and this is where an individual has restrictions on where they might live, which includes the thousand feet from a school. I hope that provides some clarity in the difference between the requirement of an individual to register their address versus the restrictions upon where an individual can reside. So is it the case that the in the in the hotel shelters there may be folks who are required to register but are not residency restricted? That is correct. Thank you. The I'm going to shift gears and talk about we've heard a lot of questions about aggressive behavior, and this is where we have a confluence of shelter, clients and of street homeless. There have been a lot of questions in the chat about mentally ill folks behaving in a threatening manner, especially around women and children. There have been concerns about homeless, encampments and the regular presence of non- shelter, client homeless in as being a part of the daily occurrence or experience on the street and as well as verbally aggressive behavior toward women and questions as to why they are permitted to remain. If you could, please address what can and can't be done with respect to each of those categories of folks sure so I'll talk and I'll certainly look to the providers who can fill in the work that they're doing in the community. We encourage residents who want to get individuals connected to our street outreach teams to call 3- 1- 1, so our outreach teams can come out, as I mentioned in my remarks earlier. These areas in the proximity of the shelter are regularly canvassed by our teams on a regular basis throughout each shift. This provides the team an opportunity to check in with the client, to engage with them to offer them services. It is incumbent on the individual to accept those services and that's what I think the community sometimes is experiencing. The frustration is that they'll see somebody on the street who does not necessarily change their circumstance, and so there's an appearance or an impression that they do not have a relationship with our team and that they're not engaging with the team. It can take hundreds of encounters for individuals to come in off the street. Under the course of this administration. We have encouraged individuals to come off the street. We have increased capacity of low threshold beds to ensure that individuals have a bed at the time when they finally decide to say yes to spend a night inside off the street, and we consider each step on that process. Successful. The administration has placed over 2,800 individuals who have been off the streets and remain off the streets from the start of this administration, and so we work with them regularly. I do not know if the providers also want to talk a little bit about what they're doing. We have made sure that both goddard, as well as the hotels, have contact each other information for one another. So we can have immediate responses in regards to individuals who you feel might be threatening. I would remind you that if there is a threat of an immediate danger, you can call 9- 1- 1, but I would also remind us that individuals are experiencing any numbers of traumas and really challenging circumstances that the Covid-19 crisis has brought on for them, whether that be having to move from a location that I've been previously housed in the unsettling action of having to sort of reimagine what their life is like in a new location is all stressful. It's stressful for you and I, if you compound that with a substance, use disorder, a mental health diagnosis. These are individuals who we do not know their circumstance. If you are feeling concerned and you feel threatened, 9- 1- 1 is an option, but I would also say that we walk past people every day and we avert our eyes. We cross the street. It does not have to be the way that we interact with individuals who are vulnerable, and I would encourage the community to call people in instead of calling people out to figure out ways, and we've heard some of it tonight how to welcome people. You know how to say hello and make sure that we're being good neighbors on both sides of this conversation. I think that that's critically important you I'm going to pivot for a second, if inspector yaguchi could could join us again, I'm hoping he's still with us inspector Yaguchi. Yes, I'm here. Thank you. Thank you. So much there's been a lot of questions in the in the in the comments having to do with we already heard from Dale Brown about the increases in patrols. That were excuse me, one second, something happened on my screen. Thank you about the increases in patrols, especially around school drop- off and dismissal. So, but there's been a lot of questions about what to do when folks encounter and I'm sorry using words that I never thought I'd use in a community board meeting, but they encounter people masturbating or they encounter people being aggressive and so forth, and also when they encounter people who are engaged in drug activity, either using illegal drugs or buying and selling illegal drugs. There's a lot of confusion about when to call 3-, 1- 1 when to call 9- 1- 1, whether it's worthwhile taking a photograph or a video of that, and if so, what do they do with it? What can be useful to the police or the law enforcement and what is not, and then there are other questions having to do with with the with respect to whether they can whether there can be searches of rooms of folks inside shelters, so, first with respect to 31191 and private video and so forth. What is the? What do you recommend what is useful to the police in terms of enforcement and interdiction of crime? So, first of all masturbation drug use. You should absolutely call 9- 1- 1 if you feel like you're being harassed, absolutely call 9- 1- 1, that's what we're there for. So that's number one in terms of the second thing. What is helpful to us? Absolutely if you're able to take photos or video of these incidents and do it do so in a safe manner. We that is helpful to us, because a lot of the descriptions that we get you know they. It includes a large pool of people, so to speak, it's hard for us to narrow it down unless there's like a specific, distinct characteristic that they're able to provide us. So a video photo, if you can do it safely. The last thing that I would want is for you to be taking a photo or trying to take a video and that enrages the this individual even further and now you're putting yourself in danger of getting hurt physically. The third thing is: we are not allowed to go into shelters and just start searching their rooms. That would be a violation of their privacy. Obviously the shelter itself or may have certain policies in place that would allow for that search, but we, the NYPD the government, can't just go in there and start searching their rooms. Thank you. I did kind of quickly add to my colleague Aaron Drink order in regards to the 311 reporting. I do hear this quite often from community members, where they are frustrated when they reach out to 3- 1- 1, and they still see the individual in front of them on the corner after they flagged it. One of the most helpful tools that a message to communities to utilize is the 3- 1- 1 app as you're walking and navigating through the street. The app will actually geometrically ping, your location and within the hour the outreach teams are dispatched to engage this individual. Why 311 is important is because it's a metric tracking system that our outreach teams heavily rely on. We constantly observe and monitor 311 to see where the new hotspot locations are, but it's also important for community members to know that after you flag that individual to us, the engagements do not stop. The outreach teams will continue to engage those individuals for services. Of course, the bed is our number one priority, but we also want to connect every day. New York is our most vulnerable population on the street to care services and shelter, but to do that, we heavily rely on 3- 1- 1, so the app is something I encourage for folks to try to utilize. It also will update you in real time that you know they'll, say you'll get a notification on the ad that will let you know that it's been received. Your flag has been received, it'll, let you know that the outreach teams have been dispatched it'll. Let you know if the outreach team, if they found the individual if the individual flag was not observed or found, but just want folks to know that, once that individual is on the outreach team's radar, the engagements do not stop, and so this is why it's important to utilize 3-, 1- 1, so that our teams can continue to ensure we're connecting with every individual folks are seeing in the community who may be homeless. Thank you, Leilani. I understand that you very kindly DHS kindly has agreed to continue on the call for another half hour. Is that correct we're here to answer community's questions? So as many questions as we can answer the greater? Thank you very much for that I'll continue. Then, with questions from that were submitted in advance. There were a lot of questions concerning homeless, shelter, clients, as well as the street homeless, but especially shelter, clients, congregating in public without wearing masks and without social distancing, and there were a number of ways in which that question was expressed, including whether or not there were not ways in which to enforce the requirement of wearing masks and so forth, and a question as to whether, if the purpose of moving them into the hotels and away from the congregate shelters was to create opportunities to interdict the spread of the virus, then is not that defeated by congregating in public in close quarters without masks on what can be done about better compliance with masks and I'm not sure if that's a question for DHS or for the service providers so Aaron, I think her. I think she may have dropped off, I'm happy to respond, and I think the providers can speak to what they're doing and proactively operationally inside of shelter, but DHS has provided all of our shelter sites, including our street outreach teams with PPE equipment. So as it relates to the street homeless population, our reach teams have gone out. They do disseminate masks hand sanitizers to actually homeless population. For those who may have not known that's what the you know, that's one! That's one effort on the Outreach street homeless, outreach side as it relates to shelter. I do know that all of our providers are doing what's called House checks, check- Ins, frequently with our clients. There's signage inside of the hotels, reiterating the importance for our clients to you know, be effective in practicing social distancing, washing their hands wearing masks as they leave sites. They're encouraged to please keep a mask on, but I think that this is a challenge citywide that we see with folks, not honoring the Mass Protocol. It is a challenge, but it is something that I do know and can confirm that providers are constantly a driving home to every client that walks out of the door of the shelter sites. I'm sorry the commercial hotel sites and any provider would like to jump in specifically to touch on what you all are doing inside of shelter to ensure clients are being reminded on why it's important that we're face covering that they exit the sites, please feel free to jump in, but I do know this is being reiterated at all of our sites and when our outreach providers, I'm sorry the shelter providers, we are doing joint canvassing. So as they do external perimeter patrols, we have the providers doing that together, so they can identify whose client is who and if they do, observe or engage anyone who is from the site that is not wearing a mask. The mask is provided it is being messaged and asked of the individual to please wear masks if they engage anyone who may be street homeless, then that's a flag for our jcc teams and we're coordinating in such a way. I hope that answers that question regarding Mass. Thank you. Thank you very much. I'm going to turn now to the Covid-19 testing that was done recently is eric still on the call or somebody from project renewal, because there was reports that there were I'm back. Chair dillard apologies that there was recent rounds of testing and the question is what, when someone did test positive, apparently there were some positive tests and it would be helpful to know how many, but how many tested positive and then please explain what happens to the folks who test positive sure we did Covid-19 testing two weeks ago. There was one positive result: the person was entirely asymptomatic at the time he was immediately transferred to an isolation, shelter and so was his roommate. As a matter of precaution, there have been no other positive results chair. I'm happy we're going to have positive results in the other shelters for the folks that are with us, I'm sure they're, just hoping this is Daniel from help we've had, as I mentioned in my initial talk, we've had in our second round. We had zero positives among staff and clients alike. I also want to double down on what Leilani said about masks. You know when I'm there, when our staff are there we're reminding clients constantly, as the weather continues to stay hot. I do I do deep compliance when they walk out of the hotel taking their masks off. We remind them, but we can not force them. We prob them. We condole them. We use our relationship, we have with them to remind them the importance of staying safe, and all of that so- and I do think, there's been a lot of success with that, but there are limitations as well. I also want to say- and I want to address the sex offender issue very quickly- the belt clear. We have no level two or level three offenders, no residency, restricted sex offenders of the Belclair chair, I'm happy to provide more information with the community like it. In regard to testing. There were a number of questions about oh foreign sex. There are a number of questions that were posed about the criteria for when populations would be moved back from hotels and why these hotels were chosen in the first place. There were suggestions, for example, that in a there were questions about with families in the neighborhood of residents that were proximate to schools and so forth. Why were why was this population linked with these hotels, rather than say, families with children who are also experiencing homelessness? Sure, as I mentioned in my opening statement, families with children, that's something you can answer. Can you hear me? No, can you hear me, I guess we probably need Aaron for that hello! Okay, can you can you not hear Aaron? Can you hear me clearly, I think everyone can hear you except Mark, I'm one of the board members so Mark. I do not know if you can hear me, but we can hear Miss drinkwater. Yes, I'm not sure if you can hear but she's speaking. So, let's let her speak and I'm just trying to give you a little help. We can hear her thanks. I can't but go ahead, you're, absolutely right. So as I, as I had mentioned in my opening remarks, the reasons why family children population were not relocated is the type of shelter environment that those individuals are housed in family with children and adult families are located in contained apartments. Sometimes there's a shared bathroom, but it is unlike our single adult system in which there are dormitory style settings in which individuals, anywhere from four to upwards of 16 individuals, can share a room. Court ordered settlements required that the beds are three feet apart and therefore this is a particularly vulnerable population, because the dorm style setting does not permit for social distancing without the removal of some of the individuals and some other providers then indicated or decided to do full relocations of their shelters. As I also mentioned, we entered into a contract with the Hotel Association of New York, to assist with bringing capacity online quickly due to the urgent nature that we were faced with in terms of getting individuals out of those congregate locations into commercial hotels where they were housed, oftentimes too, or sometimes one to a room depending on what the needs of the client are. Thank you, Mr Inquirer Mark. Can you I'm sort of an intermediate here? Can you hear me mystery quarters done? Thank you. I am so sorry. I do not know. What's going on with my audio, I could be a middle person if you, like. That's terrific. Thank you, the the next question. Well, there were a lot of comments that they came acrosss with respect to the need for long- term, affordable housing instead of additional shelters. I do not know that that's a question, but it should be shared because it was part of the many comments that were that were submitted. We could not agree, we could not agree more and things and the service providers help us with what shelter clients need that the community could donate or provide that was. I know that Mr Farrell gave some details about that. Could the other shelters help us with for those that are so that asks those questions? Thank you mark. I think Miss Drinkwater had an opinion and then why do not we give it to the other shelter other providers? But if you wanted to clarify your thought, mystery quarter Steve. You need to hear from the service providers. Okay, this is your thought Ronnie from help I'd just like to say, one of the things that we could use is space that could be made available in the community to run small group programming. The Belclair does not have a lot of open space where clients can meet in small groups, both for recreation and counseling activities and remain socially distant. So if there are churches or synagogues or other institutional buildings that might be made available for use on a temporary basis for us to run those programs, that would be extremely helpful Ronnie. We have somebody from the community who's trying to reach out to you, someone from a local nearby church who's wanting to do just that direction. Is it? Is it resurrection, church or no? Okay? Can you email me at Helen, rosenthal.com and I'll connect? You wonderful! Thank you. Thank you. Thank you. Go ahead. I'll also speak for project renewal, as I mentioned in my remarks before people have been dropping off on individually packaged snacks, single ride, metro cards, books and games. We can accept those at the hotel. They are great incentives and rewards for clients to participate in programs, and they really appreciate the direct support that provides I'll also say that the city budgets us about 7.46 a day to provide three meals and snacks for all of our residents. We supplement that with about a hundred thousand dollars of additional funding, because I think pretty much. Everyone here knows that it's tough to feed three meals a day in snacks for 7.46, so our social purpose, enterprise city, beat kitchens would certainly appreciate support to help subsidize that, thank you and, in addition to what Eric said, I would add that clothes are always gently used. Clothes are always really welcome. The men do not really have a lot of clothes and metro cars really use metro cards. Thank you. If inspector Niguchi Yaguchi is still with us, there was there were a number of questions about the guardian angels and their presence in the community, as well as about volunteer or citizen patrols or private security. Can you can you walk us through what is and is not recommended, and what does and does not work with your work in law enforcement? The guardian angels showed up, we had a shots fired on 99th street in Broadway last Tuesday. They showed up to provide some extra presence. I know historically they've been around. It's certainly something that we want to be careful about. Endorsing too much. I mean citizens patrol. It's not necessarily a bad idea in the sense that it's an extra set of eyes, but obviously, where our concern is that when you're encountering more violent offenders, the safety issue of it. Obviously we have a lot of tools to deal with that, a lot of training to deal with that, but it's a mixed bag. The idea of it does not bother me necessarily. I think it's good that fellow citizens are wanting to look out for each other, but obviously it's not something I can 110 endorse, given the dangers that are involved in it, it's certainly dangerous that we worry about every day. So for me to sit here and say that you know you should go out there and confront these unpredictable, sometimes violent people, I think is. I just have to be careful about that. Thank you we're getting close to it's 8:45. I promise we'll wrap this at nine o'clock. I want to give my community board colleagues an opportunity to ask a question or a comment again, please, on the brief side. Stephen did you have one that you wanted to make yeah. I wanted to follow up or make a brief small statement that follow up on a question and hopefully get some clarity and the statement I'd make is that it has to do with. The question is the one criteria that I did not hear that DHS was using was community appropriateness for certain areas, and I would really encourage that be part of the criteria. You know an extremely residential area like 79th Street to me, may not be the best appropriate place for people with addiction challenges, and I have experience in that personally and there's places in the upper West side that I think would actually be more appropriate. So it's not a matter of trying to push a problem on somebody else. I just think that's an extremely poor location for that, particularly- and I do not think it does. I do not think it's well for the k for the for the men either, but my question hopefully is the clarity. Is I found the you know as a head of youth, education and libraries candidly, I found the question on the on the pedophiles very discouraging. You know it seemed very legal and maybe that's the answer that needs to be made on it on something like this, but I think it'd be good to get clarity, and that is one of the providers is willing to confirm if they had level two or level three people and I'd like Eric or Tony, if they're, if they are willing to either say if they have level two a level three or they're free to say, I'm not comfortable answering that, but I think the community would like to know that confirmation and we've Daniel confirmed that I'd. Ask those providers if they're willing to answer that question Steve. We need to really be careful that sense of physics. Offenders are not necessarily pedophiles. Well, a sex offender level. Two and a level three involves children and that would be a pedophile. So those are the two that I'm speaking of okay, that's the ones that I'm asking so is Erica Tony. Can you answer those questions and if you want to say I won't answer them, then that's fine, but I'd like to pose it I'll speak for project winner. We have none. There were there actually was one who was listed in the registry, but that was not. It was not a true situation. The person was not with us. Okay is, I think it was tony. I do not know if anybody else is from that from that provider. I'm not sure. If that's a no or an audience or you know, I'm sorry, no, we do not have any great well, then I think that it seems that we are hearing indirectly, and it makes me feel better that there are no level two or level threes at these three areas, but I would say that same here I would say to our legislators that it seems to me that was a very legal loophole type answer, and I would really ask them: you see how big an issue this is with everyone on here. I would simply say that a sex offender level to a level three convicted should not be allowed to live within a thousand feet of a school, whether it's, whether wherever it is- and it seems to me that there's a little bit of us of a loophole in there, and I would encourage our elected officials to work on that, because that greatly concerns me and I'll leave it at that. I mean that'll, be my question mark thank you for offering me to go first. Thank you. I think shelly had a question is: am I correct about that? Shall we fine, oh gosh, so Shelley get up just so you know mark okay, yeah. My the screen is overloading here a bit with all of the traffic that's running through this, while waiting for Shelly is there any other of my community board? Colleagues that has a question you're going to have to speak up, because I can't see you can I ask one quickly for DHS, I feel like there's a perception from the neighborhood that the upper West side is really overburdened with the number of hotels and homeless individuals. Can you speak to whether that is actually true or just a perception and like are not other neighborhoods dealing with this exact same situation? Can you give us any data on it sure? So we have utilized 60 hotels as part of our de- densifying efforts. Cb7 has four. There are locations in Manhattan community boards, five have significant numbers community board. Six has significant numbers. Long, island city and Queens has significant numbers. These are all hotels that we've utilized to de- densify our shelters. I've seen comments in the chat as to why the agency is not utilizing hotels in the outer boroughs, we are again we're utilizing 60 hotels outside of the Covid-19 response. The city was utilizing. I believe 88 hotels right before Covid-19, my audio is cutting out again is something that capacity needs. Aaron is speaking, and we can hear her continue. Aaron, let's drink, just to say that there we are utilizing commercial hotels outside of the Covid-19 response. Also in outer bros I saw somewhere in the chat. You know, why are not we utilizing hotels out in near the airports? Dhs has contracts and does utilize those hotels. So I do. I do think that it is somewhat of a perception issue. I will note that there are three in close proximity to one another. There are other neighborhoods where that is the case. So I hope that answers your question shelly. I think we were waiting for you for a question. Yes question. No, we thought you had a question. I did not ask a question. Okay, I have a question lyndon thanks questions for DHS. I think what Melissa was referring to and I think what we feel a lot of is that we have it's not just situation. The upper West side has been an area that has had a lot of shelters over the years. Dhs surreptitiously moved them in 2006 in 2008 on West 94th street we've been experiencing this from DHS for many years. I think one of the reasons why and I think that was Melissa's question- how many shelter situations and SRO situations sros do we have on the upper West side? We seem to be a repository for many and we have been for last 20 years. Sorry Linda. Just that was not my question so appreciate you not speaking, and I'm sorry. Thank you. Oh sorry looks like Shelley does have a question yeah now I have a question: the there was a history for a long time of DHS, not counting contacting the community during the Bloomberg administration. I met with the mayor and he said he would give 30 days notice as a policy now granted. There was an emergency situation, the medical situation here, but the fact is the situ. The decision was not made in one day, so I think that the looking forward into future relations between the community and DHS that we should expect that there be some level some time period before while DHS is planning a move, that there is some consultation with elected officials in the and the Community Board and the affected community. So I'd like to know from DHS is: is that their intention moving forward? Because certainly this situation that we have the negative parts were exacerbated by the lack of notification and consultation. So I understand that the use of emergency hotels- you said it exactly it, because it's operating in a in an emergency to respond to this, we did provide calls to our elected officials and to the Community board. I understand that from the community's point of view. That's it was not enough time. We have been in ongoing communication and conversations with the community to have an open door to be able to be responsive to feedback that we've gained from those conversations to create meaningful and productive relationships with the neighbors in the immediate vicinity and with neighbors acrosss the district and hope that content continued conversations like these will allow us to continue to be responsive. Thank you, okay. So are we back on? Yes, thank you. So I realized that I cut off Linda's question before it got an answer, so I apologize for that Linda. Do you want to pose it again and if was it a question or was it a statement? Oh yeah. It's a question. I mean I, it is a question. I misunderstood Melissa's question. I thought it was relative to you know. We have a whole history on the upper West side. As we know of being, and we've been very old, you know we've embraced a lot of these a lot of the shelters, so a lot of a lot of the shelter populations, but I think one of the things that you know made everybody so angry. I guess it is a statement and really brought the community up in arms was the fact that once again, we had a population without any free notice, and I understand the emergency nature of this situation, but we've got a whole history with DHS dating back to I entered yes and Seth Friedman and all of your predecessors, and I understand the historic context here and the frustration. I will say that, in the context of our permanent shelter sites, the mayor made a commitment under the turning the tide plan to open, 90 new shelters. We have announced on 70 of those shelters. 39 are currently up and open and operating of those 70 shelters that we announced on. We have made a commitment to provide at least 30 days. We are currently providing over 100 days notice, and that is for our permanent shelters, and that is a commitment that we've made and we have stood by. My team makes those calls to our elected partners the community board, to the precinct. This was not that circumstance and again I recognize I am empathetic to the frustrations of the community, which is why we're here tonight why we've participated in other meetings to hear from the community and really be partners on the question of sros and other issues that the upper West side feels like it is handling more than their fair share. I will also say that you know opening up permanent housing is exactly what we need to solve: the homelessness crisis. Under this administration, we've moved 147,000 individuals out of shelter or have avoided entry into shelter. That includes about 1500 plus individuals over the course of the pandemic, because we've been able to utilize remote viewings of apartments, but we have not stopped moving people out because of the pandemic. We know that a permanent place is the best option for people, but we also know that we have to work in partnership that we all are working towards a day where I no longer have a job working to provide information to communities around homeless, shelters, but homeless shelters are often like Ers, okay right nine o'clock. I see there are additional hands raised, but I think it's probably time especially given the the technology challenges I'm having. Maybe one last question: Robert asked a question: if possible: well, okay, Robert was waiting for much longer, let Robert and then Doug will get the last word: okay, yeah thanks Doug. So I'm really repeating the comment that I've made before and I'm very happy to hear that one of the earlier comments by I think it was the clergyman about the 20:30 minutes ago that suggesting the very same idea so that we do not know two months. We do not know three months. We know that we have a population of human beings that are among us and that they've been among us for a while, and I think that what we should be doing and I'm a great believer on this concurrency. You do not do one thing at a time. You do not. You know you walk and you chew gum at the same time and that there, a good number of the people that are no neighbors have skills and they have worked and, of course, they've run in on bad times and they're out of work, they're out of home and so on and so forth. But I can assure you that whether we're talking about the Lucerne or the other facilities that they're people who are able to work and that are psychiatrically, stable and that are willing to work and that we have agencies where we're happy with their behavior toward the community or not DHS is a better month of an agency, and they have everything you need, and so we have assessment tools. We have ways of knowing who can work and what skill they have and how to help them. Take a step up and that there and we have a local infrastructure. We have local chains of commerce very active. We have our local business district. We have two of parliament here I grow. We have a little chauvinistic. We have two of the business districts that are probably the strongest in the city and that why are we not creating a matching program that we would sponsor? We play a role as the advocates where we canvass the our new neighbors to see. What do you have? Are you a carpenter or whatever, because in the new, in the new model that we're pursuing- and I hope it stays gail of hitting the streets and I'm eating out? I do not know where I'm getting the money from, but I'm here at my favorite haunt acrosss the street, because it's so near, I just you, know they're going to have to throw me out of there and there are all kinds of jobs, because you now have a new configuration. You have new needs on the street. These human beings can do the jobs, whether it's cleaning, whether it's busing, whether it's whatever it is, and that I think that, instead of just complaining that what are we going to do with the guy that that is masturbating over here or that is defecating on the street. That's a psychiatric issue, he's a definite psychiatric issues and, to a certain extent, psychiatrically criminal issues, and they have to be addressed. So that's another failing of the system, but we're going to have to I'm going to have to speak to you along a little bit. I think you get my point mark yeah. I think you can get your point. We should be aggressively. Thank you, Jay. We should be aggressively working to get to accommodate our new neighbors. Very good. I understand, even though my technology is now limited, Irena has had her hand up before other folks, so I'm going to call under reina. Please keep it for just a couple of minutes folks, because we're just about overtime we're. Actually we are over time now. So please keep it short, and then I see I think it was one of the Doug's and Jay. Thank you mark. I really appreciate it. I've been on the call since it opened, and I just could not get into this room, but I want to thank all the service providers that are on this call, and I just have one very brief comment. You know I've been on the upper West side, probably over 30 years, and I work for community Board seven when sally good goal and John Kohler were the chairs of this board, and I just want to remind everyone on this call, particularly the service providers, that the upper West side has a history of developing supportive housing before anyone even knew what that was, and so I want to make it. I want to say that, because I do not want people to walk away from this call thinking that we are not empathetic and sympathetic and we do not understand the plight of the homeless, SRO law project started on the upper West side. There was far more supportive housing homeless, shelters on the upper West side than any other community district, and I really just want to emphasize that. Secondly, I want to say that the Covid-19 numbers the increase in Covid-19, has been for the past month below one percent. I am perplexed, to put it mildly, why Miss drink water and why DHS and the mayor can not tell this community and every other community when they expect for the homeless that have been placed in this community to be returned either to a shelter or to other facilities. I feel like something else is going on, because we're not getting an honest assessment of a time line, and I think it's critically important that we get that timeline and that the public that the public officials may put a pressure on the city on the mayor on the deputy mayors on Steve and everyone else involved to give every community a timeline. This idea that we do not really know is, I think, I'm suspicious of it. So I just want to say, I think, we're entitled to a timeline when the homeless will be will return to where they to the homeless shelters, since the number of cases are going down and we we're not seeing an increase in spread. Thank you. Thank you. We're going to take Doug, Mcgowan and then Jay ate off and then we're going to call it a night. Thanks mark I'd like to just echo Irina's comments, there are clear clearly a ton of community concerns here, Lorena Yuri and some others expressed them very well. Although the meeting has been a good first step, what's the next step for the community leaders in addressing our concerns to whom, how will the will the issues be addressed, and I think Adam herbs made the comment. It was a good one that a a task force of some type be assembled to address these concerns. So can you communicate to the public? What's next from the Community board standpoint from the Community board standpoint and or from our elected officials? Well, the DHS has agreed to work on a small group meeting that the Community, Board and others are a party to. I will continue to work with them and involve our colleagues from various committees on those calls to make sure that we follow through on those on the on the upkeep and update, rather on those matters we can beyond that. We can absolutely work with our elected officials to to develop other ways of following up right now, I'm actually a little bit blanking on what all of them might be, but but we're not. This is just our. This is our first community meeting on this. There have been smaller group meetings and they will continue and we will continue to try to address all of the issues as they come up. There are some that are particularly thorny and hard to solve, as you heard tonight, but we're not by any means one and done with this. Thank you to work with you to to develop some of those things. I realized that I called on Doug Mcgowan when I should have called on Doug Kleinman, so I'm going to call on Doug clyman and then I'll give Jay ate off the last word real, quick. I I appreciate everybody being here and for such a protracted amount of time and the service providers. This is probably for you perhaps DHS. I just since so much of the concerns in the neighborhood are of safety and potential criminality. Obviously being homeless is not a crime, and I think I've been in this neighborhood my whole life, and I think this is a very compassionate neighborhood and I wish every single resident the best and in their sobriety, in their recovery and in their housing. The question I have is under what circumstances, however, would a resident be removed from any of these residents? I hear about a friendly neighborhood policy. I'd like to know if a resident is is arrested for a crime in the in the neighborhood, and that is confirmed not alleged. I realized there's various levels of crime. Obviously, but what are the internal rules? I understand sobriety is not a rule and that would perhaps be in a rehab center, but not in a shelter. So if the service providers could just speak to that, under what circumstances would a resident be removed? Thank you mark. I can speak to that really quickly on behalf of help at the belcher, our threshold is very low and we've been doing this since day, one. We set the tone with our clients from May 2Nd that we've had an issue at the beginning, with some poking in their rooms in the hotel. They were sent back to their shelter of origin. We had folks outside that were if they were engaging in any sort of inappropriate, behavior public intoxication anything along those lines. We sent them back to shelter and we've continued to do that. We've sent dozens and dozens and dozens of clients back to Shelter. Now, like I said from the get- go, we have a third of our clients. We said we tend to see less problems with women, but also I just lastly want to speak. To many of our clients are working. Many of our clients are doing well. If we're going to talk about 700 folks at the hotels, we should talk about the full depth and breadth of those 700.. We already have majority of those folks are doing. Well, that's all I'll say thanks does any other shelter provider want to get in on that, because this is an issue where we confront that, because there are surprises that, for example, active drug use is not sometimes a an experience that causes them to be transferred to someplace else. Can someone speak to that as well I'll answer for a project renewal and then I might ask Kadan to jump in if you have, if you have something else to say, we've transferred 18 people in the last four weeks out of the Lucerne and back to shelter to other locations, because either because of repeated unwillingness to abide by the good neighbor policy or because they simply you know, were not willing and able to function well in the hotel environment. One of the challenges we face and I'll be honest about it is that we think everybody is better off when people are staying in shelter and receiving services, as opposed to being out on the streets and completely unsheltered and unsupervised. So it's a little bit of a of a judgment call and it's one of the reasons why I'm so proud of our staff, because those are not always the easiest calls to make. If we, if we transfer someone they're going to another location, we have definitely found that people appreciate our clients, appreciate being in the hotel and most of them. The vast majority of them are working pretty hard to make sure that they get to continue. This and Helen just asked me if there had been any arrests of a client. There have been three arrests at the Lucerne since we came in one was for taking a CitiBike that someone did not. Dock one was for taking a package out of the building, and I believe there was one drug arrest. Charlie and Karen can confirm that and yeah, and I would just add that if obviously, if somebody commits a crime and the NYPD removes the person and then takes them to jail, that's the end of that for the shelter we've had. People who have been arrested, but also, if part of what we do is provide treatment so and sometimes people's behavior is due to mental illness and try to address that mental illness. But we also work with DHS if the person's not a fit for the setting or the person is getting in trouble with other individuals in the shelter or then we work with DHS to transfer the individual, and that and that's you know we try not to do that, but it does happen in dhl. We find DHS very cooperative, very good. Thank you. That's all three Jay. I think you get the last question and then we're going to wrap this up. My question my last question mark are your first two questions which we did not get an answer to. So I echo Iran's concern and ask Ms drinkwater to just give us a projected timeline as to when the pandemic motivated moves will be undone and the second question I would like a yes or no answer as to whether this administration has any intent to make any of these hotels, a permanent homeless, housing, yes or no, I'm going to try again on the move back to congregate, Shelter question: I know that everyone hears it as a non- answer, and I really am sorry for that. Well, instead of a non- answer, why do not you try giving us an answer? Jay? Unfortunately, I do not have a Christmas. This is reliant on data. This is reliance on medical experts. It would be a terribly unfortunate circumstance to rush and move everyone back into a congregate location because of the current city infection rate only to have a second wave come and hit us in the fall and have to relocate 10,000 clients back to commercial hotels to protect them. I understand that it is frustrating for the community. We have come here tonight. We have come here to talk to the Community, Board and other elected stakeholders to provide information. We are living in a time where there's a great deal of uncertainty and we are working tirelessly, along with our providers, to try to help those who are most vulnerable, who are living in congregate, dorm style settings where there are 4 to 12 upwards of 16 individuals in a room. That is a recipe for disaster. There were headlines early on about a ticking time bomb in the shelter we mitigated that risk and saved untold numbers of lives. I understand that it is frustrating. I can not give you a date certain today. What I can commit to is regular communication with this community and any other community who is asking for information, Mr Adolf on your question and respect to does the city have any plans to make these permanent shelters not at this time? No, yes or no answer all right. I could continue the discussion, but yeah we're done yeah we're done so I think it just falls to me to say. Thank you to everybody for participating. These are very difficult issues. We will, of course, as a community board continue to work on them. The community will obviously continue to work. Our elected officials will as well. We are grateful that the Department of Homeland Services and the three service providers stayed on 45 minutes longer than they proposed to do and provided answers that were very important for us to hear, obviously providing answers and providing the answers we want to hear are different things in this context, but this is engagement that we did not have before. I obviously have my own thoughts about why about how the community ought to be informed and be engaged early on, but but here we are doing this work and I'm grateful for all the participation of everybody to try to make our situations better with that I'm going to unless there's anything, I'm missing or forgetting I'm going to say. Oh, we will save the recording of this. We will save the chat, the chat, probably numbers in the hundreds of pages at this point, so it may take us a little while to post it and to vet. It and make sure that the questions that are raised in it were answered in one fashion or another here, but that will be our next work going forward and we will continue to engage on this issue with that. I'm going to say thank you to all my colleagues and for all the participants in this meeting and wish you a good night. Thank you mark good job, thanks for thank you. Richard well done everyone. Yes thank you and thank you borough, president, for the extra thousand people mark contact me tomorrow, so we can work on the on the chat. Thank you we'll do. Thank you. Thank you mark. Thank you, gail good night, all right, everybody.",
            "summary": "And, then we'll go to the stakeholder groups, which will include goddard, Riverside, the upper west ciders for safer streets, the open hearts initiative, the West Side Community organization, two block associations, two faith: leaders, a co, op, condo Board and then mark You're going to back clean, up.\nWe've got a long agenda, there's Christian If they're, attendees and they're meant to be panelists from the community board, maybe they could contact rich or christian by phone And it's going to take a while for 2,000 people to join Do. We have names of the people from the service providers or DHS?\nWelcome to our information session concerning the use of local hotels in our district for the protection of homeless, shelter, clients who were housed elsewhere to protect them from Covid-19.\nThe purpose of this meeting is for the public to hear directly from our from the Department of Homeland services and from the service providers in three of the hotels on the decisions made and the operations underway, and how that all works.\nBut we're going to ask everybody to keep it to two to three minutes other than the DHS and the service providers, because we're here to hear from them That's how this is intended to work.\nYou mark and thank you to the community board, to our elected officials and to everybody participating this evening to have you know: Over a thousand participants really says something in terms of individuals wanting to get information about the work that the city is doing to protect vulnerable new yorkers and also learn more about the services that we're providing.\nThis evening, they've really been at the front line of the response in terms of providing programs and services and really making sure that new yorkers, who have no place else to go really are connected, really are essential services during exact steps.\nIf I can I'd like to take a moment and sort of walk the audience and participants through the work that DHS has done over the course of these past couple of months to contextualize the conversation that we're going to have, I think it will provide some information and possibly answer questions that are coming and so Wanna.\nThere is congregate, meals and recreation area, and these spaces are the ones that we focused on as it related to the relocation and consideration for the use of what we call the de- densifying hotels, to ensure that we're protecting the health and safety of our clients.\nWe did not have access to testing, and so we had to use a symptoms- based approach and a presumed positive to really make sure that we were taking care of the totality of our shelter system, and so that meant, if individuals were presenting with symptoms, we were able to remove them from those congregate settings place them in an isolation hotel until their symptoms subsided, thereby making sure that we were treating them as well as the shelter system.\nTop of our excuse me in the beginning of April, in addition to the isolation capacity that we set up, we started De- densifying, our hotel, our shelters, moving individuals into commercial hotels.\nSo that way, the agency could focus on serving our clients and we worked with providers to match them to hotels based on you know the size of the shelter that they were serving and how they were going to move those clients into the commercial hotel, the provider.\nThey also moved their program, their social service, staff, their security staff into the hotels as well to make sure that our clients, irrespective of where they were located, still had the availability of case management of housing, specialists, of connections to mental health, to telehealth, to substance, use, counseling and those sorts of things, as well as the opportunity to you.\nAlso continued our work on the streets in terms of ensuring that individuals who are experiencing unsheltered homelessness also had access to information to PPE.\nThe hotter months, we've made sure that they have access to water, one of the things that I think you and I might not be so attuned to, but the public spaces and the ways in which individuals use spaces has changed very significantly.\nWe've made sure that our outreach staff are informed on the locations of public restrooms that are available to ensure that clients who might be on the street know where to access those locations.\nBut we know that by moving new yorkers into the commercial hotels, we were able to save lives.\nI know that each of the providers are going to have an opportunity to speak later, but I wanted to give a couple of examples of the things that we've been able to respond to and that I think, are important.\nWe have regular canvasing that occurs on the upper West side by goddard Riverside through our Manhattan outreach consortium, the locations in and around the three hotels that we are using for our d density efforts are canvased regularly, multiple times a day, acrosss, multiple shifts.\nThe homeless outreach unit was disbanded, and we now are very much focused on ensuring that we're leading with our social services tools that we're working with clients to engage them, that we continue to focus on meeting the social services needs of our clients, rather than using a heavy- handed enforcement.\nAnd I and our staff are committed to working together with all the community leaders here to help our neighborhood and all of New York Recover.\nYou may not know much about project renewal because until July 27th we did not have a presence in this neighborhood we've been serving homeless new yorkers for over 53 years today, we house over 2000 people, every night, half in seven shelters and half in permanent, supported housing, we've built or rehabbed.\nWe made that strategic decision, because we recognized very clearly that the upper West side was a much more residentially dead and dense neighborhood, and so we wanted to act as good neighbors right from the get- go.\nWe need access to more employment Now we have clients working at places like Sephora the New York Times.\nI worked at four different places on the upper West side for about eight or nine years in my twenties, and it only launched my career and kept me going in homeless services for the ensuing 15 years.\nThere are things that we need from the community again in order to end our clients, time of homelessness.\nSo we definitely have been working with both organizations to make sure that we are doing all that we can, while school is in session to make sure the kids are safe, the one area that we have not been able or the one office we have not been able to get in contact with yet is with the 20th, precinct, and I guess our question for them would be: what role will they be playing in patrolling as well?\nBoth agencies, with both of the organizations we'd, also like to have a conversation with the 20th precinct, to talk about added protection that could come to our school to help us in maintaining the safety and security of the members of our community.\nCucs has 30 programs acrosss the city that emphasize housing and restorative health and mental health services for homeless, and formerly homeless, individuals and families, though, what they look like is street outreach.\nIt was prior to testing, but we figured we had at least 20 Covid-19 cases at that point and in a congregate setting it's impossible to manage that It's a threat for everybody in that shelter, It's a threat for the residential neighborhood that we resided in, We've, acted upon our good neighbor policy.\nI think it was like Tony, said very disruptive to everybody, and we've worked very hard on trying to address the community.\nHe has my cell phone number and we've been working with trying to create a great partnership with them, and I'd like to thank him and all the officers for the help that we've gotten from them, and I've also put out my number and people have reached out to me.\nAnd I say that, because my experience in the Bronx and working with the community there is that when we start to move our clients out into permanency, we create the type of situation where they're invested in shelter, they're invested in what we're doing and they're invested in the community Responding to the community concerns responding to our clients, concerns and being the type of good neighbor that we have been in the Bronx for many years.\nIn fact, the city moves people into hotels without telling the community No not to go into the hotel, but you got to plan and right now we're in a situation where there's not a lot for the individuals to do during the day.\nI know that the security staff is going around to the different hotels, particularly at the Lucerne Do they work?\nDHS for more support, so that people would know who's from which hotel and who is the individual working with goddard and the outreach.\nAnd I know all the problems that was in Midtown two and a half hours, a day, walking around same issues same problem, and I wish that we could figure out as a society that people have the kind of challenges, and I understand the need for Covid-19 be more secure in terms of not being in congregate, shelters.\nWe need many more resources on the street to make sure that we are helping our street homeless actually agree to come in to shelter.\nHow can we make sure that everyone feels safe on our streets and how can we make sure that the people living in the shelters are getting the services they need?\nIt took many years, and here we all are, but the Covid-19 pandemic has changed life for all of us, sheltered or not in a very short period of time, and the changes have been significant for many people's lives, incomes, housing situations and the future feels and is uncertain, and I've heard that sentiment from so many of you over the last several months.\nI always say this communities need to be in on what is going on the city and the state at times can not just place people without in a community without getting communities to be part of making it work, and no one learns their lesson, and this keeps happening maybe after this it won't.\nBut I do have a question about what the time horizon is going to look like what your epidemiologists or the Department of Health says, is the figure for when it's safe for these men and women to return to congregate, housing.\nMy name is Adam Herbs, I'm, a resident of the upper West side for the last 20 years, and tonight, I'll, be speaking on behalf of Manhattan day school school in the community.\nI would like to thank the entire community board for inviting me to speak this evening and for facilitating this working group of schools and also expressed my most sincere appreciation to the providers and to the police and the 20th and 24th precincts for everything they do to keep us all.\n, I have been a senior executive at a local children's hospital and previously worked for a non- profit, supportive housing provider based in Harlem And I've also been an auxiliary police officer for the last seven years.\nWe fully understand the city's plan to move these individuals to stop the spread of Covid-19 and agree that it was necessary in the middle of a pandemic, to save the lives of people who have nowhere else to go, but in the interest of full disclosure.\nThe percentage of people with Covid-19 in the city is currently under one percent and has been for over two months now, and we really would like to understand what metrics will determine when this emergency will be considered over first as members of the community, we do intend to be good.\nMany parents have experienced homelessness before in the city, but this increased homeless situation that we're dealing with now has caused major alarm, a loss of safety and security, and many people are looking to leave the neighborhood and somehow already have due to the increased harassment.\nWe propose a work group between the city and the DHS and the service providers.\nWe work with folks that are street homeless that are staying on the street, with the ultimate goal of getting them into permanent housing along the way we seek to place folks into transitional housing and provide a range of services, including connecting folks with benefits, medical, care, psychiatric services, substance, abuse, treatment through other providers and ongoing case management.\nMy name is Lorena Marus, I'm, a hispanic citizen Upper west siders for safer streets is a non, partisan facebook group that was formed by residents and local business owners out of collective concern for safety in our neighborhood, the Facebook group was has provided a forum for information sharing and collaboration and solutions to address our concerns.\nIn the span of a few months, our community has fallen prey to a number of incidents that we have not experienced in the upper West side in recent memory, such as unprovoked attacks and vandalism to residence, cars and local businesses.\nIn addition, DHS placed 19 level 2 and level 3 sex offenders into temporary shelters without community notice or transparency.\nIn addition to the hotel, shelter residents have not been consistently being wearing mask or social distancing in keeping New York state guidelines for Covid-19 prevention.\nThe current situation affects everyone in our neighborhood, including the most vulnerable population, the homeless, people who have been failed by the city by being left out on the streets or placing hotels with adequate social services and facilities to address their varied and complex.\nThank you for giving us a moment to tell our community about the upper West side, open hearts, initiative, we're grateful for the work of the experienced and dedicated service providers that, as an emergency public health measure, have temporarily relocated to neighborhood hotels.\nThe upper West side is known as a welcome and diverse community in a short period and without any transparency, a large at- risk homeless population was relocated to three local hotels, ill- equipped to serve their needs.\nTemporary hotel housing may create significant community problems, as well as fail to provide appropriate services to this at- risk.\nWe are asking our local officials to fix the failed homeless hotel policy that has put both the men and community at risk.\nThe city instead moved more homeless residents into another commercial hotel in Brooklyn.\nIt is the time we aim to set ourselves on the right path, as the community meets to discuss the temporary use of shelters in the upper West side, neighborhood.\nWe are taught because we never know if we might be one of the people who one day need that same charity, and we want to promote a cycle of giving being homeless is not a crime, and it is not a personal failure.\nIt is vital that we work with the shelter providers to support them in their needs to serve the population, including more outreach workers to support their mission.\nIs our city and state working to prevent drug use or provide adequate support for those who want to turn their lives around and perhaps most of all?\nWe are actively engaged in work, both with homeless individuals and also with a number of other residents trying to prevent additional people from experiencing homelessness.\nWhat we can do to support the residents of these shelters and also what we can do to get to a healthier conversation about safety for these new residents and safety for a long time and ongoing residents of the West side, we're very interested in that, And, so I just offer our whatever resources and help that we can offer to the situation, which is not ideal.\nI know that if any community can figure this out, we can I've been working on the issue of homelessness and affordable housing about 35 years.\nYou know people that we have in our in these hotels, they're, going through the most difficult time in their entire lives.\nShelters we've been able to do so because we've been able to de- densify those locations by moving people to commercial hotels.\nThe upper West side does have other locations that are used to house or shelter homeless, New Yorkers.\nThe city of New York places all of our clients in appropriate locations in accordance with state law, and we provide shelter to new Yorkers experiencing homelessness, irrespective of their background.\nThis means is individuals, are able to get connected to programs and services that there's not restrictions on who and how people can come into the shelter based on their background, they're able to rebuild their lives and get a second chance, as opposed to being out in the street.\nYou see a stark difference in the numbers of new yorkers experiencing homelessness on the street compared to those in shelter who are connected to case management, housing, specialists, substance, use, counselors and other resources to get a second chance and to get back on their feet.\nWe've heard a lot of questions about aggressive behavior, and this is where we have a confluence of shelter, clients and of street homeless.\nWe constantly observe and monitor 311 to see where the new hotspot locations are, but it's also important for community members to know that after you flag that individual to us, the engagements do not stop.\nNew York is our most vulnerable population on the street, to care services and shelter.\nIt is a challenge, but it is something that I do know and can confirm that providers are constantly a driving home to every client that walks out of the door of the shelter, sites.\nSorry, the commercial hotel sites and any provider would like to jump in specifically to touch on what you all are doing inside of shelter to ensure clients Are being reminded on why it's important that we're face covering that they exit the sites.\nAnd I want to address the sex offender issue , No level, two or level three offenders, no residency, restricted sex offenders of the Belclair chair, I'm happy to provide more information with the community like it.\nWe could not agree more and things and the service providers help us with what shelter clients need that the community could donate or provide that was.\nThink the community would like to know that confirmation We need to really be careful that sense of physics.\nWe know that a permanent place is the best option for people, but we also know that we have to work in partnership that we all are working towards a day where I no longer have a job working to provide information to communities around homeless, shelters, but homeless.\nThere was far more supportive housing, homeless, shelters on the upper West side than any other community, district, and I really just want to emphasize that.\nAnd then I might ask Kadan to jump in if you have, if you have something else to say, we've transferred 18 people in the last four weeks out of the Lucerne and back to shelter to other locations, because either because of repeated unwillingness to abide by the good neighbor policy or because they simply you know, were not willing and able to function well in the hotel, environment.\nIf we transfer someone they're going to another location, we have definitely found that people appreciate our clients, appreciate being in the hotel and most of them.\nSo I echo Iran's concern and ask Ms drinkwater to just give us a projected timeline as to when the pandemic motivated moves will be undone and the second question I would like a yes or no answer as to whether this administration has any intent to make any of these hotels, a permanent homeless, housing , This is reliant on data.\nWhat I can commit to is regular communication with this community and any other community who is asking for information, Mr Adolf on your question and respect to does the city have any plans to make these permanent shelters not at this time?"
        }
    }
}