{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB6",
            "channelId": "https://www.youtube.com/channel/UCHip-wiEtSSRtJtA2OoChOA",
            "title": "Brooklyn Community Board 6 October 28 2020",
            "publishDate": "2020-10-28",
            "shortDescription": "Brooklyn Community Board 6 \\nYouth/Human Services \\u0026 Education Committee Meeting\\n\\n- Discussion with School District 15 superintendent Anita Skop about the academic year \\n- Youth Awards Planning",
            "lengthSeconds": "1:36:43"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB6",
            "normalizedName": "Brooklyn Community Board 6",
            "twitterName": null,
            "youtubeChannelName": "Michael Racioppo",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCKaVsnwHRM6uXG-_rrWwHqA/videos",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "rHVTuB8Otks",
            "fillerWordCount": {
                "uh": 79,
                "um": 168
            },
            "readTimeFullTranscript": "57 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "school": 81,
                "schools": 70,
                "kids": 41,
                "children": 39,
                "work": 24,
                "principals": 24,
                "terms": 20,
                "food": 20,
                "teachers": 20,
                "child": 18
            },
            "wordCountSummary": {
                "school": 15,
                "schools": 12,
                "teachers": 9,
                "principals": 8,
                "kids": 6,
                "terms": 6,
                "food": 6,
                "families": 6,
                "child": 5,
                "children": 5
            },
            "fullTranscript": "Just all right, so everyone knows this is being recorded for posterity. Today is October 28 2020 and it is the what is the full name of our committee, youth, Education and human services yeah, and this is the first time we've met since Susannah were talking about this, probably February before the pandemic. So it's good to see everyone. We do have new members on the committee, so I think we should just take a couple minutes now and you know everyone just kind of introduce themselves and if you wanna, you know, do a little icebreaker. Just tell just say something that you think everyone should know about you and most important, because Jason has remained chair of the youth part of the committee and I'm still chair of the education part of the committee, but Tiffany Reed Brown is now the new human services chair of the committee, so welcome Tiffany, hi Tiffany there. You are, let's start with Tiffany I'll just because we only have seven people I'll, just I'll just call people out so tiffany. You can go first you're on mute. Sorry about that. My name is Tiffany brown. Two things about me: oh gosh, I love children and animals can deal with kids and animals all day. Long. Do not give me adults that talk back okay, so we'll go to the other co- chair, suzanne I'll. Let you go next. Suzanne Tourette, I'm from the Park slope, part of the district. I've been chair of the education part of the committee for a while now and I'm glad to see everybody okay and then we'll do bridget Rayne hi, I'm bridget Ryan. I am. I live in Clinton street and I work for the United Federation of Teachers. So I am a former teacher. Well, never former! Always a teacher and Anita Scott was district 22 a long time ago, and she remembers me when I was a little girl. So just so you know just as that's a little cute thing about me. Thank you. Bridget now we'll go to Dana, Harris, hey everyone, Dana and I have been on the committee since I think 2017. something everyone should know. I live in park slope also and recently moved, but just a block away. So all of my civic engagement duties remain static. Okay, I miss Joy and brown President Jordan Brown, oh man, I thought y' all were going to go right past me. Thank you, okay. Let me see I love taking care of my. I call my grandparents and I love taking care of my children and I love my animals and I'm always thinking positive. I do not care what's going on until I just find out the information and I referenced a title for Joanne John. You want to tell everybody about the new role that you have. Oh I'm sorry. Well, I just became the new elective president of Walrus Street Houses Tennis Association Herland. Congratulations! Thank you. Thank you. Okay. I will go to Neil hi everyone, sorry, I'm still moving out and about almost home, but Neil Zephrin. This is my second term. I believe on CB6 I've been on this committee since about 2017. Also someone mentioned that they were a former teacher. I am a former high school teacher that was in my past life I no longer teach in high school and once a teacher, always a teacher yeah. Well, that's true. I still teach you right. You're right and I've worked closely with Anita in the past. I was on the Cec 15 and we've done some pretty good work together. So welcome everyone. Thank you, Neil and I guess I'll go last before we talk to our vip. My name is Jason Reshell, I'm the co- chair, Youth, Services Committee. I also used to live in park slope for 13 years, but now I live in Carroll gardens, so just like you might I'm still in CB6. So not that much has changed. Just my zip code and where I vote- and I was a professional musician for like 15 years playing guitar. So it's good to see everyone and I'm glad that we do have Quorum in case. We need to do anything, that's binding, but at this moment I want to kick it over to our district 15 Superintendent Anita Scott, to kind of fill us in on everything that we need to know. District 15., you're, muted. There we go. I met with Cec 15 last night, so you're going to get the same information. First of all, thank you for having me and I want to say that bridget's beautiful mom was the president of the PTA when I came into school, and so she was like my idol, and I was so amazed at all. She could do so. It was very special. Thank you. Oh you're welcome honey. So, first of all, let me tell you what's going on in c in District 15., like everybody else in the city, we are talking about the policy of adjusting from blended to remote and vice versa that the chancellor came out with this past week and it went from being a series of opportunities to one more opportunity. Parents will be able to complete a survey on November, 2nd from November, 2nd to November 15th, determining whether they want to move their child from remote to blended or vice versa, but most like, most importantly, we're looking at blended, because that means the children would be impacting the actual presence in school, and so principals are very eager to get this information and to figure out how they're going to support the children that way this is this. Has this will be the only time the chancellor said where there will be this movement now before it? I it sounds really tight. Please understand that we have been moving children all along. It is at the discretion of the superintendent and if the school has room, the principal has room. I'm happy to move children, we're very flexible about that. So I do not want people to go into an absolute panic about this, because we are open to the needs of the community and the children. Second of all, they came out with a grading policy and it's fairly similar to the one that was done in the spring. I am actually going to call up the information, because I do not remember the exact titles off the top of my head, but I will tell you that it is one second come on open up, good job, so grade 3-K pre- k do not get grades period, kindergarten through grade five. They will have the opportunity to get the kind of grades that they have usually gotten, which in elementary is usually a grading system of one to four. If a child gets a one or a two, they will get what is called a needs improvement as opposed to getting the low mark. Also, parents have the opportunity if they are not pleased with their child's mark at a level three or four, to ask that it simply says mastery, and so that is at the discretion of the parent or the guardian to do that, and so that will be something that is an option that parents have in grades six through eight at the middle school level. Again, the schools will be using numeric grades much the way they always have, for example, but those numeric grades are more in line with out of a hundred. So the way they are done in the middle schools in the high schools, and if a child is not doing well, then they can get a course incomplete or if they're really doing poorly, they get what is called an Nx grade which allows them to work over the summer and complete the work again I at the discretion of the parents. If they are not satisfied with the numeric grade, the child has gotten. They can simply ask that it says pass and the same hope pretty much holds true for high school as well. We have heard nothing about state testing. We have heard nothing about regents. I do not know how they would do any of those things I think they're waiting to see. So that's an important thing. The other thing in line with assessments is that this year, previously last year, the state, as you may know, the state requires for schools that are csi or Tsi all schools. Well, let me back up all schools. Do something called a cep, a comprehensive educational plan and in their comprehensive educational plan Lisa. We have not heard anything about this. The high schools either all schools when they do. The comprehensive educational plan are required to show how they are progress, monitoring and by that they mean that. How are they showing that? What they're doing with students is successful, and so they select any form of assessment that they can choose. Schools that are in good standing have never had a problem with that and whatever they use to assess they assess last year, the schools that the state designated as Csi Tsi schools. Those schools were required to do a specific assessment called the map assessment and that was used for progress monitoring this year. Schools can self-, select from amen their own menu of assessment, so they're kind of being, given that option, so schools will be doing different things. I always when I talk about this. I have to say something about my philosophy about this, so bear with me, and that is people get very nervous when we talk about assessment, because bridget can tell you and anybody who's worked in the school system can tell you that oftentimes assessment was used very heavy- handedly, basically to seek blame to seek a rationale for blaming people for things or to say that this made something unsuccessful and, in some very severe cases to close schools. What we have, what I believe assessment is for is very diagnostic. It is designed to help us figure out what children need, and so, in our district, we really focus in on that and we're looking at very specific diagnostic needs of children. I was an early childhood teacher. I am absolutely passionate about children being fluent readers by the end of second grade, because it is life- changing if they are not in a very negative way. They have to be able to read fluently because when you get to third grade the reading load is consistently larger and harder and children are expected to read for information, and so you need to be fluent as readers. Therefore, I see early childhood as a pivotal piece, so looking at not just the testing grades as the state testing grades, but looking at early childhood and the needs of early childhood is super important and those diagnostic needs are like when you go to the doctor. If you go to the doctor and they do not take your blood pressure and they do not take your temperature and they do not listen to your heart. How do they know what's wrong with you? It's not like they're going to look at you, and so that's the way assessments should be used. That's what we believe and so we're very supportive of our schools. Looking at what their kids need and looking at how they're meeting those needs that all of that being said, one of the things that assessments are supposed to do are supposed to help you to monitor. If what you're doing is working and as you know and bridget knows, because she's, a teacher and Neil knows because he's a teacher and anybody else, who's taught anything knows that if you are doing something you want to know, if it's working or not, and if it's not working, then you have to say to yourself: I'm not going to spend a whole year doing something that's not working. I have to change it up. I have to figure out what I need. I can tell you endless stories about this, but the gist is and I'm going to use the medical analogy again. If you go to the doctor and God forbid, you have high blood pressure. It may take a while for them to adjust your medication or change your medication to get you where you need to be, but they are not going to give you too expert and tell you to take it for the a year and then come back, and so that's what we can not do with our children. We have to be very diagnostic. We have to be very prescriptive and we have to be very clear. We do not blame our children, we do not blame circumstances. We are here to help our children. So that's my philosophy. So please bear with me the other things that I can tell you that are going on in d15 is like elsewhere in the city. We have some concerns about connectivity and about the ipads. We have kids who have come in, who really do need electronic support, but, unlike in the spring, thank God because the buildings themselves are open. Teachers are able to give families even for remote students, packets of information, books and materials, and they have done so. They have done a lot of outreach. There is an extensive amount of outreach that is done for children to make sure that we hear from them. We know they're, okay, we know they're not getting lost in the crush, and one of the things also that I think, is a very big plus, and this is from the dre. All the way down is that attendance is not being used as an arbiter of grades. It is not connected to grades. It is connected to the child's well- being do they need support it's more of a social emotional piece, just trying to make sure that we connect with all of our kids that they're safe, and there is no punishment for attendance in terms of grading. The other thing is that, let's say a child is remote. It is not as if they have to be on the remote all day if they can't handle it and they just check in the morning and that's what they're doing that's considered present, because the idea is to support children from where they are and in some cases it's difficult for families. For example, you may have one laptop and three children, then how do you juggle that? And we have families that are waiting to get the hot spot ipads that are we've ordered more? There are a hundred thousand that have been ordered from the department of Ed, in addition to the 300,000 that were given out by the end of the spring and we've ordered 100,000 more. I believe that they actually only need 70, so there's wiggle room there, but those are coming in slowly. I do not have to tell you and so we're hopeful that by Mid- November everybody will have what they need. Meanwhile, we're using paper, materials and books to reach out to our kids and our schools are very good about that they're everything for them. We are, as you are aware, because it impacts Carol Gardens. We are doing the par process in terms of looking at rezoning for the schools, so no decision has been made. No map is on the table. No anything. What we have done is the par process, and I do not know if I've ever had an opportunity to talk to you about this. So if I may, let me explain what I'm talking about when we started to talk about rezoning. We are doing rezoning in a way that is remarkably different than anywhere else in the city. We are looking at it through the lens of integration and because we have schools and Carol Gardens and schools in red hook and schools in the area in between Gowanus and everything. We have seven schools that are in what is called Subzone three. We were fortunate enough to have construction added on to Ps32. So if you've been near Ps32 if you've walked around, you will see that they have a beautiful new addition. They were able to do that because it had a gigantic school yard with you and it had a series of portables that were beginning to fall apart, that the community wanted to get rid of, and the department of Ed wanted to get rid of. So for the past three years, they've undergone construction and they have a beautiful new edition which gave us 400, I believe, 408 suits, and because of that we were looking at rezoning. So consequently, we started looking through the lens of integration and when we started having meetings we had the office of planning came out with possibly two ideas. One was to unzone the entire Subzone three and do the lottery much the same way as the middle school lottery works and the other was to create lesser zones in the more in the more overcrowded areas so and to balance and create what you may call a free and reduced lunch students in temporary housing and english language learners opportunities. That would enable them to get priority for seats at any school. The when we started going out to meetings and we must have had half a dozen or a dozen meetings that we went to all over the place. We realized very quickly that while we were hearing from the parents in Carol gardens, we were not hearing much from the parents in red hook or the parents in Gowanus, and we wanted to ensure that all the voices in the room were heard and so consequently, from the community came, the idea of doing something called par is participatory action. Research and we at in district 15 have been the recipients of a Sega grant or a state integration grant, and because we had a little bit of money from that grant, we were able to fund the par process because, had we not had that money, then it would have become a precedent setting piece if the department of Ed paid for it. So this way we're paying for it. It's not precedent setting and we were able to go forward with it and what participatory action research does. Is. It literally takes people from the communities anybody can volunteer and a small group of people have and they are paid, they are trained and they are paid a small stipend to interact and get information and share information in the community. The Department of Ed is not connected with any of that, in that it is run through a connection with Brooklyn college, and so there is this real belief system. That's working where people are willing to talk to their neighbors and friends. The way Jason was talking about the census at the food banks and that's exactly what they did, which is very different than talking to people that they do not know from the department of education that they do not trust, and especially in communities that have been historically disenfranchised and redlined, where they feel that their voice is not counted. This is an opportunity for their voice to be heard, so we are in the midst of that process. There is a survey that is available. It is available online at the at our website and I'm happy to send you the link for the survey they are in the midst of doing this. Obviously, as you had exactly the same thing with the census, we had all these really big plans and then Covid-19 came along, and so they put a kibosh on a lot of the things that we were going to do. But we've done some they've done outreach through food banks, they've done outreach through red Hook initiative, they've done outreach through Gowanus housing and wyckoff housing, and all of that, but they've also done outreach and they have members of the team who are from Carol Garden. So it's a nice mix and they have been reporting back to the cec. We do not know what the timeline is as yet, and they will make recommendations as to what they think might work. So, while, as the two original pieces may or may not still be on the table, they can recommend anything, they think would work. So that's the par process and that's where we are with that. The last thing I want to tell you is: I have exciting news, and that is the Sega grant that I just alluded to was a was a grant that had steps to it. So the first grant was 57,000 the first year and we were delighted to get that and we were very excited and the second year the grant was again slightly competitive. The first year was not competitive. All you had to do was apply for it, but the second year was a little competitive and there were requirements and we got a hundred and thirty thousand dollars and we used some of that money. That's how we're funding the par process, but the last piece of the grant is a three- year chunk that was highly competitive, and that is 2.7 million dollars over three years, and we just found out last weekend that we got the grant so wow. We are so excited about this because it will enable us it will enable a number of things. We are going to be doing work in terms of supporting schools in terms of classroom, libraries in terms of parent workshops in terms of all working around culturally responsive curriculum integration efforts, all kinds of work around that we're very excited about this, and because we have this three year, long grant. We have written into the grant that should any other part of the district require rezoning. We have funded the par process going forward, so in district 15 rezoning will always be a grassroots initiative, as opposed to a top- down initiative. So we're very excited about all of this more to come, and it is it's just wonderful and we're hopeful, please God, that we get through Covid-19 and we can do great things. So that's it! That's great. I have a couple questions I'll answer anything I can so was enrollment in district 15 schools down this year. It's interesting to say, and it's very interesting and in one part of the district or the other part of the district. How did it so? The place where we're seeing the greatest decrease in enrollment is actually the north end of the north more affluent end of the district, the southern end of the district there's a slight decline, but they're, not big numbers, the northern end of the district. In fact, some of our most popular schools are the ones that are showing a declining entry point middle school less than Elementary. We have a bubble in the middle where people are actually coming into middle, but the elementary I do not know. I think it has very much to do with Covid-19. I think that people are many. People are waiting to send their children because they're out of town or because they have created a pod situation or because there are so many variables to this. I think this is something we're seeing across the city, but again we're going to have to wait and see how this shakes out. But, yes, in answer to your question, there is a decline in population, but again I'm not so sure that will happen once schools, please God reopen. You know. I think that people will come back and things will come back. Although some people may decide that the suburbs is a great place to live. You know I do not know, but yeah, it's a concern, anita. I just want to like say in front of the committee in front of the guests that it's been like it's such a pleasure going into your schools. I've been I've been for the uft going in doing the walkthroughs. I was at your high school on on Burm, the Burm Hill High School, and you know you had your principals all set. The schools were just like a community, you know, and I'm just giving you a big compliment. Thank you out loud and your PPES and the custodians were working well with the principals and the teachers and the teachers felt as part of the community, and it was just such a pleasure going into those schools. I went to other schools and I was given such a different results. Your schools, especially, was great. I just want to know what's going on, are you checking your brt teams? Are you? Are you getting reports from your principals? I'm sorry, it's called the the basic response: team yeah, the brts. Absolutely, are you getting reports from them and how are they doing with Ppe's? And you know, are you getting those daily reports about what is needed in the schools to keep the schools safe and clean so and to be honest, we have not even had to because the principals themselves and the custodial staff, I have a very close relationship with the facilities, people and the minute we need anything. They literally have been driving all over before school's open to make sure we had every single thing. I am so impressed with the work they're doing we've if a principal needs something they are very comfortable reaching out to me. They they have masks, they have cleaning materials and the thing that you notice bridget- that I think is impressive as well is that the custodians and the principals and the teachers and the schools are communities, they're, truly communities, and they are very committed to their the pride that they feel in the school. And if I can talk, I have not been in the school, so I can't say that I did walk throughs the way you did, but I can tell you that my deputy did and he said that the schools are very clean. They're very well kept. He said, they're a pleasure he's been there for random testing and he was impressed with the way the schools handled it. Our security agents may give a shout out to them. They've been remarkable, they're very the chancellor came to one of our schools and they said, and the chancellor was like coming into 32. In fact, on one of the first days of school and the agent said you have to fill out this form, sir, and he said no, you know it's okay and he said no, I'm sorry. You have to fill out this form to the chancellor, so the expectations are followed. People are very respectful of each other they're concerned and they're careful they're. They really are concerned and they're careful. Having said all of that, I can't swear that when kids get out of school they do the right thing, but I can tell you: when they're in school, they're doing the right thing. The teachers have been very supportive of their kids, they love the kids. I've been doing virtual visits to classrooms and I've seen lessons and some of the work that's being done is extraordinary. It's just extraordinary, and so all of that the brts are doing what they need to do and in fact, even the things that would have to be done regularly that have nothing to do with Covid-19, so fire drills, shelter, drills. All of those are being done. We just had a meet a principal's conference. Yesterday, the head of Brooklyn came and spoke to the principals reminded them of the time frames. They've changed the time frames a little bit, obviously because school started later, so he gave them a set of time frames and they're doing everything they need to do to make sure the kids are safe. The buildings are safe and that we're doing what we need to do to keep the schools clean and thank God. I have to say, we've had a couple of cases we have we've had school kids, but the only time that we've had to close schools has been because of the governor's color- coded system. We have not had to close schools, yet I do not want to give it a kanahara, as my mother used to say, but but we've been very fortunate. We had one school in the Red zone that is still closed and that is Ps 131, which is the one that is the closest to borough park. It is on 43rd between 43rd and 44th street. It is on off of Fort Hamilton and it is very close, so they are still in the red zone. We had seven other schools that were in the Orange Zone and closed for 10 days and those were Ps 230, ps130, ps, 94, ps2,896, Ps24 and Ms 839 were closed for the 10 days they have reopened. As of Monday thank God, everything is fine. We have schools that are doing very innovative and creative things. They are. Some of them have been approved for outdoor space, so, for example, P M S 136 is using a side street for for azure space and they're doing some lovely work there. Schools are taking walks to prospect park, the ones that are close to the park. To do some science work. There, schools are using their school yards, we're managing our classes. Some of our schools are more filled than others, for example. I do not know if you're aware, but less yesterday, a study came out that talked about the disparity of children, of color are less likely to be in school than children, who are more affluent and white, and so we're seeing that we're absolutely seeing that the families that are taking partaking of sending their children to school are more the families in the northern end. In fact, as Ps29 has one of the highest student presences, they have a very high student presence. We have a wonderful attendance rate so, and that includes remote and blended and as of today, our attendance was 94.4, which is excellent for this time. I'm very proud of that. So yes and answer your question: bridgette, the schools are clean, the kids are coming to school and we are working as a community very tightly. Great so looks like Neil also has his hand raised and if any of the attendees that are not on the board have a question just put it in the chat so kneel the floor. Is yours, hey anita? How are you I'm good? How are you it's good to see you it's good to see? You too, I just have a question in terms of the paw process. What what's the timeline in terms of them coming with a resolution in terms of the final plan? Are you looking for school year, 2021 and then the other? No finish no finish. No, I was going to say and then the second question I had was you had mentioned that attendance was going was not going to be used as any indicator of grades. You know how is that going to be enforced? Like I mean I mean, I know, that's a general statement, but are: is there going to be a way that that parents can be comforted in knowing that you know the attendance is going to be used for assessment purposes and not for you know, you know grading purposes or you know how exactly that. So, I'm going to give you two answers, because they're very divergent, so the first one about the par process is there is an expectation that they will come forward with recommendations probably shortly. I would assume that they would do so before the end of the year. We do not know what's going on in terms of the timeline yet, but it is an expectation that they will come forward with some recommendations shortly. They were at the cec meeting last night and they talked about what they explained the process and what was going on and they indicated that fairly shortly. They should be able to come forward with some recommendations. So that's one part. I do not know if neil, if it's going to be for 21:22 or 22:23, whatever the changes are because then, as you know, having been on the cec, the cec would have to vote on it and everything. So that's one part. The second question, forgive me the second. Your second question would you mind repeating that I just like it went right out of my head in terms of attendance. You were saying that, yes, I attended right. All I needed was the word so, first of all, as your superintendent, one of the responsibilities that we have is that we do meetings with principals. Obviously, we've been doing them fairly frequently, I would say once a week since Covid-19 happened, because now that you can do it virtually it's not the same as asking principals to come out of school for a day. Usually we do two hours. We can do it once a week and they have questions. We have information we want to share plus we really are focusing in on and want to focus in on instruction we're doing some instructional work. I can tell you about a very interesting partnership. We had this past month, but at those meetings I talked obviously to principals, and I have made it very clear to principles. I have made it very clear to everyone, and so, quite frankly, has the chancellor's office. That attendance is not something that is punitive. I know that for a very long time it was very clear. It was not clear, it was very fuzzy and it depended on which teacher- and this is especially true in the upper grades in high school and middle school, where teachers often say well, if you did not come to my class enough times, you're, not getting the seat credit, there is no more seat credit, so those are things that have to do with the reality of where we are now. I have made it very clear to principles the chancellor has put it in writing. There is if a parent is concerned, or if there's an issue, please tell them to reach out to me and we will follow up, but our principals have shared with their teachers that this is the policy and that's where we're going, and it makes sense, because if a child can show mastery of the work, they should be able to get credit up for that work, and it also enables kids to do work that they're really interested in, and it also deals with mitigating circumstances. For years and years we've had children who maybe had to stay home and watch a sick, brother or sister, while mommy or daddy, went to work and that impacted their attendance. We have children who have older children who have some part- time, some almost full- time, jobs that sometimes impact their ability to come to school, and there are other things that have to do with poverty that impact children very deeply. We can not count their attendance as a means of saying they learned the work or they did not if they know the work they're getting credit for it. Neither does that mean that they also won't look at attendance for middle school applications and we do not now we do not do it. We are a lot, that's the one. You know, you'll appreciate this more than anybody yeah when they started talking about how we're going to do the specialized high schools. How are we going to do this program? How are we going to do that? I was like one less headache we have because we do not have to think about the middle school application process. Our middle school application process is exactly the same. It's a lottery, you do an online form, we're doing some wonderful things. It's going to take a little while, but we're doing it and we're waiting for support from enrollment because they are going to get some informational videos to share. But we are creating a video for every middle school they're, creating their own virtual tour. They will have a meeting so that parents can go in at their leisure and look at a school and not necessarily have to go to the school. Obviously they can't, and so it really changes the way the process works and makes it easier. To be honest, one of the things that we're working with enrollment on is subtitles because we want to make sure that they are available in the languages of our district. So we're very excited about that Anita. What do you think the time frame is on applying for the middle schools? So it's delayed right now. It's delayed. Obviously, if you think about it, we've really only been back in school a very short time. It feels like we've been back in school forever, but kids have not been back in school until some of them since the 29th of September. That's when you know everybody can back it, and so kids have been remote, but it was only like a week to 10 days prior. So you think, sometime after the first of the year. I do not know it might be. We have heard nothing yet and we're in almost literally Monday is Sunday is November, so clearly they're not going to put something out in November and say we want it December 1st, I'm going to assume it's going to be after the first of the year. Yes Suzanne, okay, absolutely and also there was a question on the board about what about the S shsats. I have absolutely no idea. I know, there's been a lot of discussion about it. I can tell you something interesting that has to do with my high schools, but it has nothing to do with the shsats. We do not know. We have been given no guidances yet on the shsats, but I can tell you that these the high school for the arts they're doing virtual auditions and they are doing it like there's a place for you to submit your audition on in a digital format. So they can literally look at hundreds of kids auditioning without them having to come into school, and I would never have thought of this, because I am no musician. But the principal of the high school for the arts is a musician and he plays a brass instrument and he said you do not want kids in a room together when they are blowing into a brass instrument. So you want virtual for these things and I have to say, I'm very proud of to a number of things, but last year, at the end of the year, ms443, which is new visions, they created a the chorus teacher put together the song we're all in this together and they kids lit. They spliced it together from kids, doing their song and they put it together and you could have put it on TV. It was phenomenal. It was just phenomenal. This year, because of that little piece, they were asked to do for the opening bco Kickoff. They did the star spangled Banner and it was just beautiful again the same thing, different kids singing all put together, it's amazing, so I feel that, like we are working very hard to ensure that the arts are being kept, that kids are doing great things, that the science is being kept. It's not easy. This is not easy, but we're working it we're absolutely working. So we have two people on the board. With their have raised their hands, the first one will be tiffany, one of the co- chairs and then after Tiffany will be Joanne good evening. I noticed that it was a whole issue with domestic violence cases going up in the inner city due to the pandemic. Have there been anything with any follow up with the children that may be in some of these households? In regards to that? If is anyone reaching out to them to? Is there a program? That's been set up for them as well, so Tiffany you are raising something that's near and dear mark to my heart, not just for domestic violence cases, but for the fact that all of our children right now, in fact all of us sitting here standing here- are all victims of trauma. We are all victims of trauma: teachers, parents, everybody and one of the biggest focus foci excuse me and district 15 has been social emotional support for our children. So first let me tell you that every single school in district 15 before the pandemic was trained in a program called ruler and ruler comes out of the center for emotional intelligence at Yale University. It is the work of Dr, Mark, Brackett, and sometimes, if you're in a school- and you see this thing that has a red box, a blue box, a yellow box, a green box that is called the mood meter and children are given the opportunity to place where they're feeling in it and then talk about it and talk, share their feelings. The Department of Education also did the most amazing training for all principals in something called I'm going to get it wrong. T- R-, E- p, which is trauma reinfo, it's an acronym, but it has to do with trauma and it really talked at a very deep level about how do you handle kids and trauma? How do you support kids in trauma when you look at a child who is acting out? What do you see? Do you see a kid who's misbehaving, or do you see a kid who's reacting to something? The way we look at children's behavior now is so different. Thank God than the way we used to look at it. I think. As not even teachers see, teachers did not. Teachers knew their kids and they were protective of their kids in many cases, but I think that more so now we have restorative circles where the kids will have a morning meeting every single one of our schools has morning meetings where the kids can talk about. What's going on how they're feeling and it enables the teachers to kind of like take the temperature of what's going on and if they see something they needed? Another thing- and this is when you're talking about trauma you're also talking about how do we support families? So this is, we have done some work with. We have a person on my team. Let me start with this, who is a trained yoga instructor and she has been doing online yoga and if you've missed it it's available. I can send you the ad the time she does online yoga in the morning and she does a session of for mommies and me with a Teddy bear. That's just wonderful, so that there is an option to support families, and, ironically, we've gotten a lot of turnout from schools in sunset park. With this, you know which I'm very happy about our schools do, as I said, they're doing yoga there's the talking. The discussion is so important, but one of the things I'm most proud of my principals and my people is that they really care about their families, and so, when Covid-19 hit, we had a lot of families that had food crisis that did not have enough food and so especially in sunset park, but also red hook. So we began to work with local community organizations and I reached out, I have to say, give kudos for this. I reached out to Brad's office and I said look: can you spread the word that we could use donations? You know we want to make sure that our families, because one of the center for family life in sunset park, which is an amazing group, they were doing a food pantry, but the problem was they were only doing it four days a week because they did not have the funds to do it more than four days a week, which meant the last day of the week they gave out food was on Thursday, so that meant there was that three- day stretch of the weekend when people did not have access. So what happened was we were so successful in getting donations that they were able to add an entire day? And so then Friday became the day where you could go to the food pantry as well and get food for the weekend. But the other thing- and you know this was- and it's still available- is that we as a city are providing food even to the kids, who are remote, they can come and get food or their parent can come and get food at feeding sites. There are adult feeding hubs as well that are open, for example, on holidays they'll, still open, like they'll, be open veterans day, so that people can come and get food. So this to me is super important, but another thing that happened that talks to the need for families is that principals were literally delivering food to families. They were, even though it was cold that they would like bring food to the apartment house door. You know they would they would feed their families. Schools did adopt a family where a one person from the PTA would adopt another family and help them none of this. None of this made anybody feel diminished or feel like it was. You know the kind of not nice charity that some people do. It was a community. We are a family together, and this is what we do. We have seen some terrible things. Terrible losses in our community people have lost a number of family members. People are very fearful in parts of our community because I do not have to tell you there is the whole political tenor of homeland security and the ice raids and all of those things, but as a district, we support each other and we're very grateful. But in addition, this is what I wanted to say. Tiffany the most important thing to us to me and what I tell my principals is that the whole child is not is the most important thing and if I can share with you the last line of what I said, it's a quote from Carol Carol, Ann Tomlinson, who said no academic goal, is worth the soul of a child, and so for us, that's what we think. That's what we believe and that's how I ended my principles conference on Tuesday. Thank you. You're welcome all right so now we'll go to miss joy and Brown of trying to come back to school or staying home. Is there any? Is there any incentive that you can keep checking on them and making sure that they have the you know the work and whatever that the parent might need? Or what have you either checked? Absolutely our is able to help this people to help their child to become a little bit better or is there somewhere that some road, like a neighbor that y' all can talk to that maybe can help the child and help their mom something or something in it. So, first of all every one of our schools, almost everyone. We have a couple that do not have one, but most of our schools have something called a parent coordinator and that person that is there. They are the support system for families in every school, and I have to say that they are very good at what they do. We have monthly meetings with them, so they're all hearing the same message and they bring concerns to us. So whatever the concern is, they can kick it upstairs to our office. They are the ones that, if the parent has any need any issue that can come and talk to the parent coordinator, the other thing is that teachers are reaching out to families. This is part of the whole concept. Changing concept of attendance. That attendance is about checking in on kids. It's not about okay here get to work, it is really about how you do it, and there is also something that I do not know. If some parents know about it's called office hours and teachers are having office hours where they can meet with one parent. 10 minutes talk to them about what they need. They are available, they can make an appointment or they can email them and say. Can we set something up? There is always opportunity, and I'm going to say two things, one if a parent needs support, and they do not know where to turn, they can always write to me and we will help them. That's number one number two, they always write to the principal and the principal will help them as well. So please spread the word whatever they need if they need more materials or if they're they've had parents called and said. How do I motivate my child or like how things that we worry about we're here, whatever it is, we're happy to help and I have favorite. I have a spectacular lady in my office who, by the way, is bilingual and speaks spanish. Her name is Brenda Diaz and she is our parent support person at the district office and she is incredible. She is just incredibly knowledgeable and kind and she will do anything and to help absolutely that's wonderful to hear, but I'm talking about the ones that does not. You know the atmosphere of coming to speak to your parent corner because see I work in the schools too. Okay, and so I know about the parent quantities and all that too yes, Ma'am, but I'm looking at the ones that are afraid to come and speak to their teachers called the guidance counselor that principal because they feel embarrassed or they are ashamed of their parents or either they might be. Something is going on. Excuse me going on somewhere down the line that somebody have not touched on or either paying attention to, because I see it on a regular basis, and this is why I'm asking you that question the ones that that's really falling behind that, like you said that you know about them. I'm trying to find out is that, like I said someone to reach out to the ones: that's not out there, not outspoken, they are the ones, that's quiet or something is going on that you do not know about that. You do not eat. So I can't tell you a whole story, but I'm going to tell you this part of it because I can't get into it. Sometimes children demeanor changes the way they act changes, and you know something is wrong right, so they do not have they can't tell you they're, not comfortable teachers notice that that's the whole point of whether it's online or not, and we have had situations where the teacher noticed something the principals are very engaged with children as well and in one of our schools. The principal literally noticed something in one of her students and it was really pretty tragic to get acs involved. But again what happened was we helped the child? So I do not understand exactly where you coming from. I understand where you're going with this conversation, I understand it and I know where you're going with it yeah all right. So that's what I wanted. I would say people have a tendency of just brushing them off. You know, instead of just taking a moment no, and the thing is that there is for those of you who know this. There's a gentleman named Richard Ellington, who's kind of a guru in education, and I once heard him speak and said for kids to be successful in middle school. He did not talk about elementary, but he talked about middle School and said for kids to be successful in middle school. They have to connect to one adult in the building, just one it does not have to be a teacher, it does not have to be the principal it could be the custodian it could be the kitchen lady. It could be the security agent if they connect to one person. One person is the one who says hello to them. One person is the one who checks in on them. That makes a difference in a child's life and we have trained our teachers to be very cognizant of the needs of our children and if there is a problem- and it is not noticed and somebody in the school will notice it, and hopefully that will happen- I can't say 100. I wish I could, but I know that our district is very cognizant of the needs of children, because principals reach out to us teachers reach out to us and teachers reach out to principals, and they know their kids well, all right, all right, so Anita, I'm sorry, Jason. I have to ask you one question: why did the mayor change the policy for the Opt- in and opt out? You know why was that what was going on that the parents were given ability of four times to decide about what they were going to do, and that was because you know, I think it's pretty unfair, I'm not yelling at you, anita. You know that I know I love you, I'm yelling at the mayor right now. I do not understand why the mayor decided to do this in the middle of a pandemic when parents, you know, sometimes change their minds when you see a rise in cases. So you change your mind. So you want to go back to remote and then, when you see that the curvature goes down and then you want to go back to the school building and it's not about the building and it's not about the teachers and it's not about the principals and the custodians and the everybody in the build the community. It's about the fact that parents get nervous with the rise of culver cases, and he does things this mayor, and he just you had a big controversy at the Orange Zone School P.S 130, where they closed the school, and you know people the parents were upset. You know you get this closure and nobody gets notification, it just happens immediately and they feel lost. So what is going on here? Why are we changing tunes left to right and center? Not you district 15. I'm talking about city, I have to be honest with you and say that I do not know these are decisions that are made by the mayor's office. Bridget you're 100 right, not even Richard's involved yeah. I think so. I can tell you the trajectory for the Orange Zone, because I can tell you exactly what happened with me that I can tell you when I heard at like I in the afternoon about the governor's map when I saw the governor's map and I got a clear copy, I immediately notified all my principals that were in the Red Zone and the Orange Zone and said you have to get ready and I said because they're going to close you, they are they're going to close you. We waited the next morning. The mayor announced that, yes, they were going to close the schools, so they were ready and then we waited to get clarification with letters to parents. It took a while, but I was very lucky because my principals were already prepared. I had told them the night before so they had. Thank you a little bit of a jump on it, because when you know that something's going to happen, you want to make sure everybody's ready. You do not want anybody to be blindsided and my deputy, and I we made sure that we spoke to. We called it immediate principles conference the next morning and we spoke to the principals, and we said this is what you're going to do. This is how you're going to handle it, get everything ready put together packets. They God bless them. They said to me we're on it anita we came in this morning. We put together packets, we have stuff for kids who do not have technology. We have technology to give out we're ready. We're done we're going to be done by today, and they were. They were ready and I'm very grateful for that. The same thing when they heard they were going to come back, they prepared and they came back, and that was it. I try very hard to be on top of what I can be. On top of, I there's a lot to politics. You know me a long time, I'm not a particularly political person. I know- and I think in district 15 that maybe it had been a disadvantage for me, but I can tell you that what matters to me is that my schools run well. My kids are taking care of. My families are supported, that's the main thing for us. So thank God for that, and I wish you are not the only person who has asked me this in the past three days. Believe me, I can't my cec wants to know why I do not know. All I know is. There must be a reason that I'm not seeing yeah. I can't see it either. Yeah, okay, so thank you Jason. I'm sorry, you're welcome no problem and we have one last question and that is going to neal. Yes, me again, the last question I had was relating to the d15 plan. I mean, I know you know because of the pandemic. You know, resources have to be reallocated and that's totally understandable, but I just wanted to just find out. If you know there were basically 40, as you know, 40 to 50 recommendations in that plan, and I just want to ensure that that's still going to be in the purview in terms of ensuring that some of these are being enacted, if not in the near future, because of course we have more pressing matters as it relates to the pandemic. But at least at some point you know that's going to be readdressed. So one of the things I do not know if you were on for the time when I talked about the Sega grant, I do not know if you heard that part yeah, I did so we got the you know that million dollar yeah, so I recall the secret grant when we were yeah. Remember when we were talking about this every year for the next three years we will be getting nine hundred thousand dollars and that's going. It is exclusively to work on the diversity and integration initiative, and so we're able to do things like culturally, responsive libraries, training for families, training for school bias, training for schools supports for schools that are not doing well supports for kids. We're going to do a lot of things, some of the things that we have built into it and please forgive me for being redundant. Excuse me. Some of the things that we have built into this plan are things that think about the future and to make sure that exactly what you're talking about Neil happens so that we have built in the par process going forward for all rezoning for the next three years. We have built in work with Wxy to make sure that we can reflect on where we are and what's covered in the plan and what we still have to do. We can we've also built into the there's so many pieces, there's PA outreach to parents, we're going to be working with a variety of strong academic and social justice organizations to ensure that our schools are getting what they needed. We're also focusing in because it's part of the state concern we're focusing in on our media schools to us an extent that says how are we supporting them to make sure that our kids are doing well? So all of these things are part of it and we're going to continue to make sure that the diversity plan in district 15 is a living, growing, breathing thing and that's why I'm so proud of the rezoning because Neil it's exactly what you talked about, what we talked about, that it is not it's like. Okay, now what happens with the elementary schools, and this is going to make a difference. Thank you. I think we actually. I spoke too soon. We actually have two more questions. The first is suzanne and then following that is our public Attendee Sonia Anita. I have an email from a gentleman Justin Krebs, and I know that yeah and you know yeah it's about a petition they have with about 2000 signatures on regarding the not being able to switch after this one. Last time so- and I said that I would mention it to you, and I should have him, send it to you and to the mayor. Please I'm happy to be cc'd on it. I will share it with the borough, the executive superintendent. I will share it. I will forward it to the chancellor's office. So please have them, I know they're going to send it there anyway, but I will forward it as well. Okay, you should not tell Justin that I've gotten letters from families. I am answering every one of them that this is what we do, but I will ensure that anything they send me gets forwarded to the right office. It will be seen okay, great, thank you. Okay and now we're going to go to Sonya and I turned on her like Sonia. I think she's still muted there she is hi there. She is good evening. You did not know you are yes, hi! Oh sorry, thank you! So much so it's more of a general announcement. The Youth Advisory Council for the Ccrb is accepting applications and I just wanted to share that in case there are any young people who wanted to apply and I sent the information in the chat, but it's disabled now, but that's already been shared. Okay. Thank you. Thank you. Does anybody else have any questions before we wrap up Anita's section going once Jason before we before we let Anita go because I know we're going to speak about the youth awards, but maybe you want to just give a quick overview to Anita, because I'm sure she could be helpful to us to getting it out sure and you can feel free to jump in when I believe anything out so Anita. We are going like Susan said after you we're going to speak on our committee about restarting the youth services award from CB6. I know that it's something the Community board used to do a while ago, and it has not been done for. I do not know how long it has not been done since I've been on the Community Board. But Susan did you want to talk a little bit about some of the like how it would be nominated and stuff like that? What we thought that the award should be about is that we know that there are many students, either in the grade, schools or the middle schools or the high school who have been working to help during this crisis, either by doing more than just like volunteering at a food pantry, but actually organizing a food drive or some sort of something above and beyond, and we thought that the awards this year should recognize those efforts, we're not quite sure how many awards we want to do. That's what we're going to discuss whether we want to do one for grade school, one for middle school or whether we just want to get a bunch of recommendations and then choose two or three, and if they're all just happen to be grade school, that's fine or whatever. That's what we have to figure out. But we would definitely like your help in getting the word out on this. So if I can make a blanket statement, please do not hesitate if there's something that you want to get out that has to do with education. If you would like my principles to know it, please do not hesitate. We share everything and I will put it on the website. I am happy to share and happy to support you in any way that I can so please do not be afraid to ask okay, and I think we will want is somebody to nominate the kids rather than it being self yeah. I agree with you, I think not. The kids nominating themselves is very sweet, but it's not the greatest idea, but I think that we will happy to reach out to principals, the parent coordinators, the guidance counselors, the assistant principals. We can reach everybody and suggest to the schools that they nominate students who have done amazing things, because some of them have I'm sure, and so we will spread the word for you no question and thank you. We appreciate that with that I am going to thank you for having me. It was a pleasure and I am going to leave you to your work. So thank you, everybody. It was lovely to see you all and looking so good. Thank you be safe. Everybody bye- bye. So that's a good transition, so I do not know. I know we. We have some new people, but we talked about this last year or two years ago and it just it did not get off the ground so Mike and Susan, and I were talking recently- and we thought this is you know this is something that we should do now, especially in this. You know era where the community communities are coming together with the mutual aid societies and food banks. There's a lot of opportunities where we can. Actually, you know, try to shine some positivity on the community. Instead, when you turn on the television or read the news, it's you know it's very doom and gloom out there, so we want to use this as an opportunity to you know to show that good stuff is happening within the community, but really to you know to recognize some of these students. As far as what suzanne mentioned, you know, I think we should kind of talk about it like how many awards do. We think that we should give out. Should it be. You know you know, k through five and you know six through eight, or should it be that just a certain number that we're going to give away two or three or I'll I just I guess I'll, just open the floor for anyone's opinion. Does anyone have an opinion, bridgette hi Jason? What so? What is? Okay, so the child gets an award like a certificate and what does the certificate, like particularly say like, and what does and what's the criteria of getting the award in terms of you know, and you know I can be helpful- we have parent coordinators in each borough and I could be helpful in terms of you know. Getting well. We'd have to use Brooklyn and getting the Brooklyn coordinator and the district 15 district rep to support with our teachers and Paris. But you know what what's the criteria and you know a lot of things: will the kids get like a library of books? You know? Do we have a budget? You know we, you know we can get a donation of books. You know uft, we have our book drive in terms of you know. We have. You know aft gives us a grant of books, you know what do you well, I mean, I think this is the purpose of this discussion, because it really is in the early stages. It will be a certificate we have not put down. You know what the certificate is going to say yet, and I think you know part of the conversation right now is actually figuring out. What are the parameters like? What are we looking for? So then we do send out the announcement. You know people can fill it out in the past. It was just a certificate from the Community board, acknowledging a youth who had done something to benefit the community and they used to do it. There was one for a youth, and then there was one for an adult who worked. Kids do something which I do not think we need to do that part of it. I think we could focus on youth, and, after that, my suggestion it was that it was something above and beyond just volunteering, that it was somebody who came up with something and put and did something different. They court. They started a food bank, they started going to seniors. I do not know what it would be. I think what you know suzanne would have been perfect. Is that with Covid-19 right and you know, get it covered related absolutely and we call it, you know we can call it something like a Covid-19 hero, youth hero, and you know that I know that's. There were kids, they were picking up garbage at the parks and you know that's culver related because of the fact that they reduced the hours of the parks Department for cleanup. You know it should be somebody who put who created or programmed as opposed to just picking up the garbage, because lots of kids did that. Oh okay, so right, what do you think? I mean? I think we want to get a large application pool. So I think we should keep the perimeters like somewhat vague, and then we can actually see you know when it comes in and then really decide. I guess an internal kind of grading system where everyone can kind of help review the applications. I wonder too. This has been such a big year. Oh sorry, right, there's so much going on this year. It's not just coped right. We've seen a lot of racial justice work we've seen the elections. Does it seem narrow to only be looking for kids, who are stepping up in terms of Covid-19 they're, all obviously so interrelated, but I think that it would be like more inclusive to expand what we're looking at here right. I agree with that, and then I guess a major question is: when would we want to give out the award? Is it an end of 2020? Is it in the spring of 2021? I think I'm sorry Suzanne, I'm open to that. I just. I just think that this year, tiffany right this year is like too much I'm done with this year. Yeah. I agree. I say spring of 2021. okay, so then that gives us a little more time to kind of like which shed this and really, you know, make it something that it can be. You know media worthy as well, we'll also get them in the newspaper and like really draw attention to what they've accomplished. But if it's going to be in the spring of 2021, then we probably need to send out. We probably need to start telling people about it right around December or January yeah, every January, great question. So in terms of this award the are we looking at a specific age group. Is it from elementary school Junior high school? What's the age range or age group we're looking to target, I mean if it's going to be junior high school, I guess that would be 11 to 13:14.. So that's one thing right and then and then the other thing is I mean in terms of keeping it general. I do agree what was mentioned earlier in terms of it should not be covered related. It should just be an award on individual students who are able to balance school life, Home life and extracurricular activities, particularly in the era of Covid-19, but not have that be the theme, but that you know you have well- rounded students that are able to maintain. You know whatever average we designate and they might have volunteered at a food kitchen or might have participated in a in a social justice rally, black lives matter rally or what have you, but I think that should be the broad scope that we're looking at and then. Lastly, if it's going to be an award based on a person's a student's performance within the year, I would recommend maybe May of 2021, where you encompass basically, unfortunately, the rest of 2020 and I do agree, we have had enough of 2020 but definitely leading into 2021.. I agreed that so I guess one of the questions is: what does the time period have to be the time frame for when this you know whatever they did counts? Is it all of 2020? Is it from here to is it you know? I was here like I'm sorry Joanne? Yes, you were saying something. No, I was going to ask. Can we do like a like a team effort? You know, like some, you know some of the children that be doing some of the science projects you know are either like a math project well, you're, either. Like another child, creating- oh god, you're like something that computers were where they're teaching other children how to get onto the computer. I, the original youth award that the Community Board game gave out was for community building. You know for doing something within the community, not something not something that was done in a school. The schools give out a lot, for you, know science, projects and math projects, but this was having contributed to doing something in the community above and outside of school. Oh okay, all right I mean for the time frame in regards to them doing it, I would say all of 2020 and into 2021, because oh gosh, like this year, has been an absolute mess and it's been something major events happened within this last year. I feel like that could be you know accounted for in regards to this has been a trying year for children, well, everyone in general, but especially children, so them actually doing something worthwhile and giving back to the community during this time frame. I think that should be included as well, because you got to think about anything. That's implemented right now still carries over to 2021. correct. So I agree with you. So maybe we go from March 2020 to March, like March, 1st 2020, to March 1st 2021 right and then make the application, like the recommendation has to be in like March, 7th or whatever, and that way we have you know a month and a half where we can do our scoring and stuff and then give it out in May yeah that sounds yeah. It does sound good because covets started March 14th, so let's just do March to March and that's the yeah and they later right, yep Jason. One thing is that: do you think we can give a special award, I'm just throwing it out there. Citizen squirrel did a lot of youth stuff before you know, Covid-19 happened, and do you think that we could do an honorable award to citizen squirrel? They did the bus. That was that's Kathy's organization, yeah, Kathy, Park Price, and I just you know it's. I think it's a very nice group and if we can maybe do like an honor, you know a special award. I do not know if people would want to do that. We could talk to Mike and see if there's something that the community work would recognize. You know a group that you know went above and beyond, but I think for this award. It has to be an individual right. Okay, individuals and you know youths, but I'm not opposed to what you said. Yes, Joanne, were you saying something? No, okay, it's funny because the Speaker Box pops around on people. So sometimes I think people are speaking. It's just highlighting you for okay. So then we have some time. I think you know Suzanne and I will put some of the things that everyone said together and I'll start a like an email chain, so we can actually kind of with everybody on the committee start to kind of you know, break down the parameters so that we can all decide on. You know, run it by a mic and then make sure that we get it out by the end of this year, so that people have at least three or four months knowing that is out there and if they want to. You know work a little bit harder between January and March, so they could do it, so they could submit something that would be good too. Before we ended, are we all sort of an agreement that we want to do one for whether it's grade school to Junior, high and then another one for high school? Or do we not want to break it down that way and just see what comes in? Why can't? We do all three? You know like the middle, the elementary Middle School and high school, because the only issue with high school wait how many high schools are in the district? Oh yeah, it does not have to be based on school. It could be basically right if you live, it has to be so that's a question. Does that have to be based on residency and CBS or residents the work that they did happened in CB6 no residency? Well, because you can be on community board six and not live in the community board six as long as you have business or interest in community board six Hmm area right, so you think that people should the children's have to live within the Community Board six yeah, I'm just throwing it out there. So we can have a consensus. Yes, I think it should be live and do something in the district right. If you live in the district and you're doing something in Manhattan, that's not part of it. You have to live in the district and do something in the district right. What about the borough, I feel like they might be doing things that are still really supportive for the for the borough writ large, which includes us, which includes CB6 but the their standing in a different community board. When it happens, I think the borough president has that kind of an award yeah. He does a youth award yeah, he does it. Yes, he does well we'll decide what that is like further down the road, but anyway, like I said I'll, put together all these recommendations and put it on an email chain and we'll hammer them out over the next like month and we'll try to make and then hopefully next month's meeting. We can actually have everything out, vote on it and then just listen it on the mic so that it'll get the ball rolling. Wait. Sorry, we giving out only one award, that's sorry about as many as we want. We were thinking two to three. No, because I would I'm sorry. I did not see her name and then skipped around a bit. I'm you know my eyes back exactly what she was saying in regards to their residents in our district, but they also there's something in the borough. Maybe we can do something for have both one student did something in the district and also lives there, but the residents there, but also assisted with other places, because they, some of them, do go to school in other areas where they inhibit it as well. But that may be something we can do. We could do both right. I mean I kind of I understand that, because not everybody thinks along district lines. You know you're trying to do something you're not like. Well, I got to make sure I do it on this side of Flatbush, because it does not matter, and the thing is Cb6's lines do not match up with the city. Council line or state Senate lines or assembly lines like so lines really mean, do not really mean that much to the everyday normal person, but we could say that they have to live within. You know the neighborhoods that comprise of cv6 redhawk yeah. You give something for residents that actually gave back to their immediate area and residents that filled outside the box and chose to help everyone. I mean I do not. I do not know yeah I mean we could call them different names too. The awards like, I think I do not think that's something that we have to explain when we send out the parameters. I think we could actually see how they come in. Let's see if we have a lot of things like, oh actually, then we should call this one like the borough, citizenship award or something like based upon what kind of recommendations are coming right, but I think it's just important to set the parameters so when they send it when they, when they send it out to the schools that they know exactly like the requirements that you had to have to. Actually you know be eligible. We should be residents of CB6, though yeah of those six neighborhoods. I think that's to that point does not it make the high school piece challenging like do not a lot of kids, not necessarily like reaching out to high schools where they're coming from different districts or community boards. How like? How do we get teachers to nominate the right folks there like it seems more complicated. I would imagine for high schools than the others right in that district. Anyway, I think there's two. We have to do a lot of outreach to youth groups and areas where high school students might hang yeah good question, yeah pretty good question. So I guess this is food for thought and, let's really try to like. I said I'll start an email chain, and you know at next month's meeting we'll try to like try to finalize all the parameters we can vote on it. Okay, sound good yeah. Yes, are we going to do a cat award too Monet? Do we have any other? I guess if we're kind of done with this part, is there any other new business? No, just remember that Pb is starting, and so, if there's any schools that we know of that has any ideas for Pb that they should reach out to Brad's office and same thing on other items, parks, items, etc. Suzanne and Jason. Can I just ask a question in terms of the Gowanus rezoning when how did they come to the conclusion that it was a junior high school that they were going to put in for the affordable housing piece? Was there a discussion? I do not know that. That's true. It was not as supposed to be a junior high school or it was it did they did they put a you know like a hold it like they, a plan for Elementary, junior, high school or high school. Was there a plan for the school component? What kind it's going to be? I think when we put forth our suggestions, we did call on them to do a school. You know grade school, see if there was a need for another junior high school and a high and a small high school in the area. Yeah I mean they've been dangling schools yeah. Why are you suggesting? We do not need one and that we do need? No all right. I think we need a lot more. Why would I not suggest you suzanne? You know me very well yeah, I just you know I was just wondering how they deemed the specific school. I thought that it was deemed a junior high school. I got under the assumption. It was I and I did not know where that came from so I'm just I was just wondering. I think we suggested that all was needed, but I do not think there's been a specification of one or the other or whatnot okay. Thank you all right. Well, if that's all, then I guess we can adjourn this meeting. It's great to see everybody bye, everybody thanks all right.",
            "summary": "Just tell just say something that you think everyone should know about you and most important, because Jason has remained chair of the youth part of the committee and I'm still chair of the education part of the committee, but Tiffany Reed Brown is now the new human services chair of the committee, so welcome Tiffany, hi Tiffany there.\nIn District 15., like everybody else in the city, we are talking about the policy of adjusting from blended to remote and vice versa that the chancellor came out with this past week and it went from being a series of opportunities to one more opportunity.\nParents will be able to complete a survey on November, 2nd from November, 2nd to November 15th, determining whether they want to move their child from remote to blended or vice versa, but most like, most importantly, we're looking at blended, because that means the children would be impacting the actual presence in school, and so principals are very eager to get this information and to figure out how they're going to support the children.\nWhen we talk about assessment, because bridget can tell you and anybody who's worked in the school system can tell you that oftentimes assessment was used very heavy- handedly, basically to seek blame to seek a rationale for blaming people for things or to say that this made something unsuccessful.\nIt may take a while for them to adjust your medication or change your medication to get you where you need to be, but they are not going to give you too expert and tell you to take it for the a year and then come back, and so that's what we can not do with our children.\nIt is connected to the child's well- being Do. They need support It's more of a social emotional piece, just trying to make sure that we connect with all of our kids that they're safe, and there is no punishment for attendance in terms of grading.\nJason was talking about the census at the food banks and that's exactly what they did, which is very different than talking to people that they do not know from the department of education that they do not trust, and especially in communities that have been historically disenfranchised and redlined, where they feel that their voice is not counted.\nWe are going to be doing work in terms of supporting schools in terms of classroom , libraries in terms of parent workshops in terms of all working around culturally responsive curriculum integration, efforts, all kinds of work around that we're very excited about this, and because we have this three year, long, grant.\nI, just want to like say in front of the committee in front of the guests that it's been I was at your high school on on Burm, the Burm Hill High School, and Thank you out loud and your PPES and the custodians were working well with the principals and the teachers and the teachers felt as part of the community, and it was just such a pleasure going into those schools.\nThey've been remarkable, they're very the chancellor came to one of our schools and they said, and the chancellor was like coming into 32.\nThey've changed the time frames a little bit, obviously because school started later, so he gave them a set of time frames and they're doing everything they need to do to make sure the kids are safe.\nYes, and answer your question: bridgette, the schools are clean, the kids are coming to school and we are working as a community, very tightly.\nAnd, then the second question I had was The first one about the par process We do not know what's going on in terms of the timeline yet, but it is an expectation that they will come forward with some recommendations.\nObviously, we've been doing them fairly, frequently, I would say once a week since Covid-19 happened, because now that you can do it virtually it's not the same as asking principals to come out of school for a day.\nThis is especially true in the upper grades in high school and middle school, where teachers often say well, You did not come to my class enough times, you're, not getting the seat credit.\nThere is if a parent is concerned, or if there's an issue, please tell them to reach out to me and we will follow up, but our principals have shared with their teachers that this is the policy and that's where we're going, and it makes sense, because if a child can show mastery of the work, they should be able to get credit up for that work, and it also enables kids to do work that they're really interested in, and it also deals with mitigating circumstances.\nOne of the things that we're working with enrollment on is subtitles because we want to make sure that they are available in the languages of our district.\nThe principal of the high school for the arts is a musician and he plays a brass instrument He said you do not want kids in a room together when they are blowing into a brass, instrument.\nIt enables the teachers to kind of like take the temperature of what's going on This is when you're talking about trauma You're also talking about how do we support families?\nYou know which I'm very happy about our schools do, as I said, they're doing yoga The discussion is so important, but one of the things I'm most proud of my principals and my people is that they really care about their families, and When Covid-19 hit, we had a lot of families that had food crisis that did not have enough food and so especially in sunset, park, but also red hook.\nThis to me is super important, but another thing that happened that talks to the need for families is that principals were literally delivering food to families.\nYou know the atmosphere of coming to speak to your parent corner because see I work in the schools, too.\nThat makes a difference in a child's life and we have trained our teachers to be very cognizant of the needs of our children, and if there is a problem- And, it is not noticed and somebody in the school will notice, it, and hopefully that will happen- But I know that our district is very cognizant of the needs of children, because principals reach out to us teachers reach out to us and teachers reach out to principals, and they know their kids I have to ask you one question: why did the mayor change the policy for the Opt- in and opt out?\nSo, you want to go back to remote, And When you see that the curvature goes down, and then you want to go back to the school building And, it's not about the teachers It's about the fact that parents get nervous with the rise of culver cases, and he does things this mayor, and he just you had a big controversy at the Orange Zone School P.S 130, where they closed the school , I'm talking about city, I have to be honest with you and say that I do not know.\nMillion dollar So I recall the secret grant when we were It is exclusively to work on the diversity and integration initiative, and so we're able to do things like culturally, responsive libraries, training for families, training for school bias.\nSo many pieces, there's PA outreach to parents, we're going to be working with a variety of strong academic and social justice organizations to ensure that our schools are getting what they needed.\nWe thought that the award should be about is that we know that there are many students, either in the grade, schools or the middle schools or the high school who have been working to help during this crisis, either by doing more than just like volunteering at a food pantry, but actually organizing a food drive or some sort of something above and beyond, and we thought that the awards this year should recognize those efforts, we're not quite sure how many awards we want to do.\nWe, can reach everybody and suggest to the schools that they nominate students who have done amazing things, because some of them have I'm sure, and so we will spread the word for you no question and thank you.\nThen that gives us a little more time to kind of like which shed this And really We probably need to start telling people about it right around December or January, Every January, great question.\nLike another child, creating- You, know for doing something within the community, not something not something that was done in a school.\nThen we should call this one like the borough, citizenship award or something like based upon what kind of recommendations are coming right, but I think it's just important to set the parameters so when they send it when they, when they send it out to the schools that they know exactly like the requirements that you had to have.\nIf there's any schools that we know of that has any ideas for Pb that they should reach out to Brad's office and same thing on other items, parks, items, etc."
        }
    }
}