{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCV61VqLMr2eIhH4f51PV0gA",
            "title": "October 2020 Executive Committee Virtual Meeting.",
            "publishDate": "2020-10-20",
            "shortDescription": "",
            "lengthSeconds": "1:54:53"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "RSmviDzub2k",
            "fillerWordCount": {
                "uh": 368,
                "um": 287
            },
            "readTimeFullTranscript": "66 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "report": 33,
                "information": 28,
                "budget": 27,
                "person": 18,
                "page": 16,
                "parks": 15,
                "example": 13,
                "idea": 13,
                "month": 13,
                "guys": 13
            },
            "wordCountSummary": {
                "budget": 6,
                "parks": 6,
                "licensing": 5,
                "report": 4,
                "information": 4,
                "documents": 4,
                "seniors": 4,
                "hours": 3,
                "person": 3,
                "idea": 3
            },
            "fullTranscript": "Liz Ritter, we were had a meeting with nobles Crawford and Katherine Diaz last week, Saturday and we are in the process of hybriding hybrid, making a hybrid sort of budget ranking in which we can have the newer members, the older members and the technology. Savvy members are pretty much it right along the process that, even in my third year, it still takes a little bit of time to really comprehend and understand everything that it entails and its importance. So catherine, I'm going to leave the floor to you for the next couple of minutes so that we can get everyone. You know up in the same page and see what we've done in the past report. What we've done in the past couple of hours with the doodle and the technology and so forth, so Katherine Hi good evening, everybody happy Monday, so yeah so basically part of the discussions for what would be kind of like our first ever virtual vote as a board, and I think it's a great way to test it in terms of or just have that experience in terms of our budget rankings. So essentially, as elias said, has explained, you know, we know that virtual and technology has its limitations, and so we've discussed having a hybrid voting process. So first it would be that the compilation- and I do think that some of the committee recommend rankings are still pending, but I'm sure benezer will get to that in his report, but basically we're going to compile it all onto surveymonkey and it would have to actually be two separate links, so folks will get in their email. Two very distinct links, one for capital, one for expense and through that folks, you know we have you know 40 items and 25 items and folks are able to rank those in the order that they wish the goals that folks will also be emailed prior to Wednesday. The Pdf document that we've traditionally used in person as just a way to visually, see, for example, that like small business or licensing or whichever committee ranked it in this order and because in surveymonkey it'll just be all items and people will be able to just kind of rank them. There are some limitations that come with that. So that's why? We want to offer the pdf side by side, of course, having folks vote via survey. Monkey makes this process so much easier, because you know I can't imagine what the board office staff have had to tally for 50 plus people. You know so this time we're able to kind of export all of the online responses on how they come in and then, of course, folks's names and will be attached to those tallies and then for folks who do not, because I'm not going to say age right because there might be some folks acrosss. The age spectrum who want to vote not be a survey monkey, but for folks who do not feel comfortable with surveymonkey are not able to access it. What they will do is have it emailed to them, and so what we're going to do in the next two days is essentially call a small pool of people and just assess their comfort level right. So if they have access to a printer at home and can quickly rank it and email that over to Ebenezer, so he can add it in to the larger survey monkey pool in the case. For example, that someone can not, you know, have a printer at home and do it. What we can set up are time slots to verbally give ebenezer in this case, either Chanel or paola what their rankings are, and that's just in terms of kind of a backup plan. But based on how meetings have been going in the last couple months, it seems like folks might be able to just kind of quickly print them out and tally them on paper. And so one of the I think distinctions right is because in having a hybrid is that normally when we voted in or when we ranked excuse me in person, we submitted it that same evening right and so that is usually possible with something like surveymonkey or other applications. But this time around, considering that we wanna give both pools of people the same amount of time and this you know this is also being brought up to tonight's meeting, that the link, for example, will be sent. So the budget hearing, for example, is Wednesday at 6:30 we're estimating an hour meeting at the end of that meeting. The link will be sent to folks and because we need to compile, you know that other smaller pool the idea is to keep the survey monkey open for 48 hours, and so folks can actually this time around compared to in other years, have additional time to rank. If they also have. You know any further bigger questions that they want to ask the committee chairs or committee members they're able to do that as well, and that kind of keeps the time I would say equitable for all and you know, keeps it really clean any and I think what's really dope about. That too, is the fact that the deadline is October 31st, but we'll probably, and most likely have in time for the general meeting what the actual ranking is, if we do keep it to 48 hours, so that means by Friday evening we could collect it. You know Monday Tuesday, compile it all together and that'll. Be that I did you make the point: did you make the point of emails or texts as well? Do you I'm sorry? What do you mean by emails or texts that, if you know some of the people feel more comfortable, just emailing their budget rankings, they can easily email it to ebenezer or they can just if they do not have the email access or you know, especially the older generation. They can just send the text yeah. So that's I think. Well I mean that's something to decide right. It could be either via text or email, but just to kind of keep it more streamlined, yeah that smaller pool of people who do not feel comfortable or can't access a survey monkey they can email it or even if they take a picture, you can still email it and up send it to Ebenezer just to have that time record in the actual board email. Did you mention a deadline for having this stuff in by yes, so what I had said was 48 hours. So, for example, let's say fri that would be Friday, 8, P.M, okay, no again, and then you know, then, as soon as we can thereafter, we will publish the results, because again everything we do is public right. So that's what I was mentioning is that the benefit of surveying monkey right is that, instead of having to tally stuff, we can automatically export and because we're assuming there's going to be a smaller pool of people who actually email the pdf that can easily be tallied in so those you know I would. The goal would be to have that ranking out earlier than usual. Well, I think you know that will make life much easier. As you pointed out, and everyone who worked on this in the past, including Liz ritter, they all need to be complimented for the horror of doing it. The old way and the new way you know, will be much easier because at least you can get all the numbers in the spreadsheet or many of the numbers, and especially much faster, so respectfully suggests an improvement to this process. Yeah. Absolutely. If the survey monkey includes name the survey monkey should include the name of the person filling it out, so that the record preserves who filled it out. It does include it right, yeah, here's my suggested improvement. If people do not feel comfortable with the survey monkey, then I would suggest that the office staff take the emailed or physically dropped off Pdfs data enter that instead of data entering it into Excel data enter it into the survey monkey and you know, write in Liz Ritter parent data entered by staff. Make sure that you check it to make sure that what I submitted in a pdf you've data entered into surveymonkey and then Surveymonkey will compile everything and since we're having our hearing on the 21st and the deadline is Friday, the office will be able to crank this out and wait for it for the first time ever present. The results at the October general meeting talk about transparency first thing is that the deadline is the 30th, not Friday, the deadline for submitting it to the office to the office yeah. So the survey. Why would we have it be that late? I mean if we're giving it to the 30th, but if we're giving, I thought the deadline and sorry did they like to submit it to the OMB. Is the fact that he said it's 48 hours so we're going to have our hearing on the 21st and then 48 hours after that is like Friday night and then the general meeting yeah Liz? I hear where you're going with it and that's exactly what I was saying that I think for the first time ever will definitely be able to get it on, hopefully for this month's general meeting versus the following month. So I'll talk to Ebenezer and the office staff to also get to just enter into the survey monkey versus the exported data. So that's pretty simple! Thank you for that and catherine just for your reference in years past, although we had the option and were encouraged to the extent possible to submit our rankings the evening of the public hearing in so many cases there were changes made to the priorities listed. There were new things added, so it was not unusual for board members to submit their rankings. You know the next day or the day after. So what we're doing with the 48 hours is consistent with that as well. Okay, catherine, you have three people raise their hands, so if you can, I can't see who they are from. One was liz and one was Wayne and we took care of it. Oh okay, Natalie also has behind them hi. Thank you good to see you guys. I just wanted to mention. It would be fantastic and thank you for doing all this work. If you guys do submit it on time, but this would be if you, by any chance, need a an extension. It sounds like OMB themselves are needing to extend their own hearings, because they've had to postpone several of the agency hearings, so there might be if there is needed some flexibility this year because of the circumstances. But if you guys can still, you know, bang it out and get it there and show them that CB12 had it together. That would be amazing. Thank you. So much for the work all right. Okay, thanks so much yeah go ahead, just real quickly, yeah, just really quickly, just about the actual hearing on Wednesday. So the idea- and just because obviously this is the executive. So we have all the committee. Hopefully, all committee chairs are not on I'm on my phone. The idea is, I think, one of the main objectives, at least particularly for me, is that there's and for a lot of other members in the past, there's always been tons of confusion about the budget hearing, and so the agenda will be shared out tomorrow and the goal is to have each one of you know within your three- minute. Speaking portion really speaks to the items that you've enlisted. I know that given Covid-19, there are tons of priorities and maybe shifted priorities, and so you know as much as committee chairs can highlight. You know any kind of like hot topics on that are being ranked or, if there's any technical budget items that are new that are older, that you feel like were really robust. So please share that and then I would also add if there was items that you've included as a result of Covid-19 or as a result of community groups that have come to your committee meetings. I think that's vital as well like Wayne added, usually new things get added and we're going to have. You know really tight time frame if we do have to add new items, given that it is a survey monkey because that means you know adjusting that. So you know so just as much as you can share within the brief amount of time on Wednesday evening is much appreciated and if you do have to kind of hop off or you can't stay for the duration, just email me and I can bump people up based on the agenda all right. So something else that I wanted to add is that something that I, as a newer member, was not able to gauge or have a baseline from how the previous years and I'm going to make sure that we have some sort of guidance as to how our submittance and rankings were in 2019 versus some of the things that were accomplished and some of the things that were not. I think that adventists are sent out the report from Mbpo or no DCP rather saying you know the numbers and what some of the budget items were applied to so we're going to have a baseline, showing you know what we were from last year. So that we have an idea, especially the newer members, so that they understand the prices and how that accountability emanates from you know what was promised to us versus what was actually done, so he said, hopefully we'll make it all. We all make it interesting and pitch in and make this process a learning experience for the newer members and those of us who do not 100 dominate the topic so going to the next item on the agenda is important before you move on just mention one thing: it's another virginia of course right. The hearing that we hold should not be referred to as a budget consultation. It's that's a term, that's used when the community board meets with the city agencies and consults with them on what's needed in the budget there. This is a this. Is a public hearing on budget priorities for the community board. It's it should you should not. We should not be using the word consultation precisely. I do not think ever. Anyone did, but thank you for all right. That's what it says on our monthly calendar. Okay, great ebenezer! If you can get that corrected thanks, Steve Ebenezer, oh you're, next, on the agenda good evening, everyone- always it's a pleasure being here as your district manager, not too much to report. On my end, as you hear this report from catherine and eliazar, we have been working trying to put this together for the publicating on the budget priority. You know what going to be the way we're going to proceed since we are working virtually also. We have been working how the elections may happen, the one scheduled for this month and next month, so that has been calling our attention and also communicating with OMB working in the statement of district need, etc, plus a few side visits that we have to make so not too much to report. I know that the treasurer is waiting for my compilation of the expenditure in the spreadsheet that he sent me. I have not be able to complete the whole thing. I want to give you an accurate document, so I do not have it for you, so you do not have a report at this time. Working my day, I would like to complete it by Friday if it's possible, otherwise we're going to do it next month. This is the end of my report. Please be attentive to the emails that I send regarding the budget process. Thank you to all of you who have response on time to my request and thank you also for the one that I had to call back to follow up and clarify some information. We continue working with this and you're going to be communicating with you via email and a phone call if it's necessary. This is the end of my report. Mr chairman. Take it back. I have a actually a couple questions, but it may be for both ebenezer and for Eliezer sure I think. Over the weekend I had a couple questions real. You know relative to the upcoming election and you know how things are going to be handled and Natalie forwarded a link to the. I guess, the recent borough board meeting, because the board of elections made a presentation on that. So I'm wondering what CB12 has done is doing to get some of this vital information out to people. Regarding you know how to, for example, how to spot a bogus, you know ballot box, you know any ballot box that is not inside is not legit, but also that there is no legal limit on the number of let's say absentee ballots that a person can deliver, meaning if there are seniors who are uncomfortable, mailing the absentee ballots and want to have them dropped off, but are still uncomfortable doing that they can give it to someone to drop off that there was a question was: is there a limit? To that I mean, can you know five neighbors give all of their ballots to someone who is younger who's going and the answer you know is yes, but you know I'm wondering what we're doing. Cbs 9 and 10 spoke a great deal about you know, literally in the case of CB10 walking up and down 125Th street socially distanced, but letting people know CB9 did similar things. My question is you know? What are we doing to get the word out and to get the word out in multiple languages, but on and on the public safety side cv 9 pointed out that not since Covid-19, but rather since last year, there's been an uptick in drug related crime and activity in that whole West Harlem area, and you know, they're working with the police prisons to address it, and you know we all know that activities like that do not respect community district lines, and so, if it's happening in Washington in West Harlem album heights, it's crossing 155Th Street into you, know Washington Heights, and you know what are we doing to look at that which then raises the third question: is there used to be a rather frequent gathering of the four upper Manhattan Community board chairs sort of 19:11 12 to discuss? What's going on uptown and what's kind of a collective strategy? My question is: are those meetings still happening and if not, what do we? You know? What are we going to do to make to bring them back to life because you know, what's affecting you know, West Harlem is affecting Washington Heights. I there's compounded four questions right well, yeah, so the one the one the one thing about the elections and what are we doing as far as a board to make sure that people that speak more than one language to understand? It's, not even people who speak more than what it's like. How do we? How is that information getting out there? Because if I did not ask, I would not have gotten like any of this right, so we've been partnering with organizations like myself, nimik that we've been working with and also mbpo we've been participating in some other events in 175Th and Broadway, 181St of Broadway Cedro and Juan Rosa, and all those executive directors of those organizations that we've been working with getting the ward out for the voting and as far as Community Board, let nine ten eleven and solve that's a tremendous idea, an initiative that we should start again putting back together I'll speak to cecily Harris, which I'm the person that I usually speak them off and the other two are wayne acts of view of making that connection and on the issue of the ballots in our voting. Were you able to link up with the the executive? What is it the chair of CB1 has to give us an answer on how the voting took place. You're talking about the elections for the board, I'm talking about the elections for the president of the United States yeah. They are. I know I'm just asking you no. I did not do that. My assumption is that the relative to the Community board elections, that's something that you know office staff was going to handle. My question pertained to. I think we all by now received in the mail the information from the board of elections with the card and the little what they call the fast pass, and they said that you can vote. You know safe and fast using this, but they do not say how and in the in the presentation given by the representatives of the board of elections at birber board. They explained that and I think that would be very useful information to get out. There are apparently a number of short videos on the board of elections website. That also would be maybe if they get you know linked or if somehow you know CB12 connects to them. I think there's a lot of information that people need to know, there's a lot of misinformation. They need to know about, and we need to be really on top of this okay, good. That was a situation with a person. I know he's not even a U.S citizen that actually received a ballot, so he could vote that kind of thing is happening. Yes, his name is Antonio pena, oh yeah, it's! This is the kind of things that are that are happening out there and they people need to know that could have been a felony in the event that he would have voted right. So that could have become a bigger issue. I would suggest we get the information from the board of elections about early voting, because I think there's confusion and people do not realize it's going to begin on the 24th and run for, I think, seven or nine days so and it's going to be happening throughout our community. So we should advertise the fact that people can go vote if they're concerned about voting on the day of the election itself, they're going to have various opportunities to vote before the election day, and it would be good if we could help get that word out. That's my point exactly Steve. Okay, great does anyone else have any answers? Oh my questions before we move on to Gerald's report. Yes, yeah that the answer is yes, there are people that have questions who made that person. I do not I'm not look. I can't see you know the stack. I see they're going to help us question to Ebenezer at the June meeting June executive committee meeting I asked to for the document the licensing committee documents to be sent to me and Eli indicated that all community board members should get it so far. At least I did not get anything and so do you aussie wait like can I finish my. Let me see I'm sorry. I did not get your questions because you was frozen. Okay. I know you said at the June meeting and then I think he had anything after that. Okay, so at the June meeting I asked for the licensing committee, pre- meeting documents to be sent to me and Eli indicated that he wants all community board members to receive it so far. I did not receive anything, so I wonder where is it like? When are we going to receive it before the general meeting? What, if what is specific? Can you be specific as to what information it is that you pertaining that you reframe the question: what information, specifically the pre meeting documents that being submitted to the licensing committee so you're talking about the applications? That's correct all right, even though, even though the yeah that should not be an issue, I mean it's public access most, especially when is a renewal. The owner's information and the business information is on the SLA website so that that's not a big deal. I do not think I mean it's just public information anyways. I did not say that it's a big deal. My question is that at the June meeting, what you said is that it's like all right. I should not be the only one receiving it, but the entire community board should, and so far I did not see anything. That's also I'm asking even easier enough. No, so I'm asking benezer since the general meeting will be next week. When should we expect to get those documents? What which documents you want from June on forward? No! Well, you want, which month are you looking for going forward every month before the you know, when the licensing committee received those documents, I would think it will be convenient to just send it to everyone, but if not, then that can be sent you know after the meeting, so whenever the office feel that it's the best time to send it to the community. I got your question all right, so Curtis, I think you are you okay. Now you muted yourself, because so Jim, let me ask you as the yes all right as far as do have you not has anyone here had not received any documentation in the general meeting with all the documentation that is required in order to vote on a resolution? Is there anyone else that has not received proper documentation so that the resolutions are passed with as much information as we've done? Historically it's. I think what am I missing here? The problem is that often will get information until the day of the meeting or the night of the meeting. That's not what Oc is saying. Oc would like to see the actual applications that the applicants submit, on the basis of which the committee has a discussion. Thank you so much. I understand I already agreed that would be sent to her and that anybody on the board who requests that could get that information as well. So Oc's question, not that I can get the last 10 minutes of my life back. Is it having been asked and approved for her to receive that information when ebenezer, do you plan on sending it to her? I'm not clear, I'm not clear if this was approved or not on the last meeting. Okay, I do not really. I do not recall. I watch him. Let me let me come. Let me let me kind of like just move on, because I think we just you know talking about the same thing. So it's sort of like you getting a presentation in the parks, the in the Parks Committee prior of the presentation happening. Is that what you're saying right? No or that's what I understood like it's really simple. What I'm asking is the same documents that the licensing committee is receiving prior to the licensing committee, something that you specifically would like to have right. Well, it's a public information, of course, and in June, oh, we get it apparently yeah. No, you get me just yeah. I got so ebenezer, so whatever information is public, they just send it. It's not a big deal. Okay, I'm! I did not say it's a big deal. All I'm saying is so, do you have another question so that we can move forward? No, I just agree. My question was like: when am I going to receive it before on it? Okay, I have a question on the October general meeting. That's more right! Thank you. Does anyone else have another question. This is Kathy Stark, because I can't raise my hand so because, for example, when we have we get the packet we get the actual application, sometimes, for example, if it's a restaurant, they need to come in with the menu. Oh see, are you referring to the supplementary materials like menus and floor plans, or are you talking about the actual application? Okay, I I'm sorry I did not. I did not think it would be that complicated. I'm, not I'm not asking, because it's complicated, I just. I wanted clarity on it because, for example, when it was brought up previously, it's something that it does not seem like everyone gets routinely and if it's something that can just be uploaded with the minutes on the website, then that's an opportunity to improve the transparency. So I'm just asking for specificity because the application we all get so what other materials is it that we're not getting? Okay, you do not get. We do not get the application, do not get the applications. Can you can? I finish please thank you. We do not get here. I'm on your side. I know I understand it, but I'm trying to save time here and trying to be as clear as possible. We do not get the application at what we get. Catherine is the minutes and the resolutions after the meeting. What I'm requesting is to get the public information, which is the packet that the licensing committee is receiving prior to their meeting, okay, good, so that's being established, but all right. My question is: when was this discussed because I do not see in the minutes. I do not recall this ever being a motion to pass this or not. If it's a request not approved by the chair, I have no problem, but I do not recall the discussion on the last month. No, it was it was just that was in June. I can't she's going to continue to ask until she no, I actually obviously gets it, but I will already instructed ebenezer, so we can just move forward right, but that has to be. Can I get like you said like use yourself, like you just said: that's it sure, like you just said, I'm going to just finish it and let's just move on this is really a non- productive conversation or something that you should just it's not my fault that it's not productive. So now you're going to turn into a silly argument, but let's just come on. Let's just move on actually the next report. Gerard please good evening, can everybody hear me to see everybody so, as Ebenezer indicated, I have more of an update than a report and really with no intention of being overly critical, but just to recap, no financial budget reports have been issued by again not being overly critical lebanese just to update but nothing's been issued since June. So we really have no information issued from July August September, nothing through October. So, as ebenezer noted in September, I asked him to issue financial budget reports for those months, so we could do kind of a first quarter report to at the executive committee and move forward with that. So definitely would greatly appreciate ebenezer if you know going forward as I've requested since I became the treasurer one week before the executive meeting. It would really be helpful if you were to send that information, so we could kind of kick the tires, take a look and if it makes sense we're comfortable presenting it to the executive board, but really the Executive board and the board really do deserve a monthly update of some sort. So I would make a personal appeal lebanese if you could do that going forward week before the executive board just get it out and we'll look it over and we can present it. Thank you more than okay. I got it, but more than your ask. I think that it needs to be some sort of recurring meeting between the both of you and connect prior to each one of these meetings and so that he can. She can show you what he has and then you can guide him into what you need, and hopefully you can take that from there all right takes off, so you can at least try to like Offline talk, connect and just have that meeting in and so that we can have that report. It's just it's over without question and chair since February of 2019. That is a standing request. I have an email. I repeated that every month, so just hope I can get it got it. Okay, moving forward to our secretary's report, okay, at least okay yeah. That's the question yeah. I think at least ask a question before you move on yeah. I've had my hand raised for a while. I actually have a question. Sorry, it's okay! I have a question for you in the chairs report generally in October, is when the chair announces the formation of the Nominating committee and I'm just wondering, and usually at the October executive committee. The chair advises the executive committee as to who is on the nominating committee sure we're working on that you'll by the general meeting. You will have the composition of the right: okay, yeah, okay, hello, everyone. I have nothing to report. I actually request the office to send me the attendance for all the committees, but I did not receive them, so I do not have anything to report. I want to add something: Eli, I'm sorry, that's related to a question to you about the special election that supposed to happen this coming general meeting about the assistance secretary special election. I think- and I want to also thank Liz for pointing out that there need to be a correction on the tonight agenda from me being assistant secretary to a secretary. So that's my report or that's my no report for tonight. Thank you oc for for your reference as secretary, and this is something that I do not know. If Piola has any updated information during the land Use Committee meeting. I noted that in the list of committee members we have domingo Estevez and we have juan Guzman and I know Domingo, I think Domingo's online domingo attended. I think the January and February land use, but not since so we need to clarify if he is or is not, and I was. I was informed that once you're a chair, the executive committee meeting and your committee meeting are the are the two meetings that you have to attend. Well I mean it varies. I mean I was chair of land use, also a member of public safety for a while. But my point is: if you look at the most recent exists, trying to clarify that, because if you're not, then you should not be listed. As a committee member yeah green from my understanding, I was the chair of business, business development and executive committee meeting where okay. So what up my report? My point to the secretary is: that's something that she wants to look into and Piola said she's going to reach out to you and also to one who is new, but I do not have actually. I need Juan's email as well, because he did not log into the committee meeting and I want to make sure he knows that he's a committee member all righty. The next item is the review of the calendars, so we're going to go over November 2020 calendars. Hopefully you guys had an opportunity to review them and take a look at them. If there's anything that you guys would like to change as far as you made it, this is a chance. So does anyone have any problems with November's calendar? There's anything that you would like to change. Is that a thumbs up? Yes, anyone. I would like to make an a change for my November. It's going to be on Thursday, but that's not 67. It's 6 30., it's a Tuesday uh-! Oh sorry, Thursday yeah, Thursday, 12:6, 30 happy new year. If you want to change the time. Yes, thank you. I do it so November 2020 calendars approved December 2020. is not the oh. No going back to November. The executive committee in the General Board meeting are not they at 6:30. It's correct, though, because I'm going to I'm going to make those changes. That's why we send it to you guys: okay, December's calendar, okay, I'm wondering if we need to to do the general meeting on the third Tuesday. I mean we'll, hopefully in November, we're holding the board meeting two days before thanksgiving. Maybe we could do the same in December with respect to it'll, be three days before Christmas or the it'll be two days before the Christmas Eve. I think this year. This is especially, I think that which I think that we should just give people like a nice little two weeks break. You know this is what we usually do. Yeah, but usually it Christmas comes earlier in the week. But, okay, it's not a it's just been a tough year. It does not matter, it does not matter to me. Well also, we have the executive meeting scheduled for after the General board meeting for December no I'd say five days before for December, the executive committee is listed for the 21st. The General Board meeting is listed for the 15th. All right, we send it a revised calendar this afternoon is scheduled for the 10th. You know not everybody's on their email all day long. Can you I know Mary. Can you look at it here? Mary? I can't see it I'll text it to you. No it's I'll! I I'll get it all right, I'm sure it's on my email, but you know what is the is the executive? Is the executive committee going to be at seven or at six thirty, six, thirty, as well? Okay, so where? If the executive committee is going to be at 6:30, then the calendar should say 6 30., they should all say 6, 30. they're, all wrong. We said that for November as well yeah and I going back to my book- you might want to check with faye to see if she wants to move youth in education so that it's not happening after the executive committee in December. I have not. I have not seen Faye and I just text her and I was not able to right. That's what I'm saying she's, not on the call so well she's. Not someone might want to reach out to her, because right now in December, youth in education is scheduled to meet after the executive committee and the day before the board meet the general meeting. They might want to move that to the seventh or so yeah I got it. I got it. I gave you a point yeah. This is debbie. One good thing about potentially fabing on the seventh is the same night as Tnt. Is we have one agenda item? That's really a common item with Phase, Committee and Tnt. I have not really talked to her at length about it yet, but it relates to a charter school. So that would be awesome if she could move to the seventh, because that would allow us to do that together. It would be great all right. So I'm sorry what you're suggesting is to have only one meeting transportation committee and the U.S education. Then the one item they have together. They can discuss it together and then, if they have to break into separate meetings, they can do so. But if they're, if they're scheduled for the same date and same time, they can easily overlap. I think that's what she's saying yeah and obviously I've deferred. If they you know, obviously she should move the meeting as she sees fit, but it would be great if she joined if she did it on the seventh, because it would allow us to you know, do all this. We have to okay, I will call Hell tomorrow we have to look into the logistics of the two meetings separating the with the various zoom meetings. You know yeah. Well, I think we have the technology that oh yeah, pretty simple good, but as long as you do not know how to do it in advance, you can have one meeting and then go into what's called breakout rooms and then the two meetings if they start together- and they have this shared agenda item together as one meeting then when they're done discussing that you go into breakout rooms and the person who's, the host can send people who are on Tnt into that breakout, room and zoom does not give zoom does not give you that right it just it does. It does mean that the person who's the host is going to have to know who attaches to which meeting and at the beginning of the meeting you're going to have to. I do not know, ask the public attendees to like please identify what meeting it is that they are there for so that they get put into the right breakout room all right. Let's go into the details later: let's we do not even know if fate this works for faye, yet so, okay, good enough. So now that we have all agreed on December's calendar, then we can move on to Lisa Reader's report, since I understand that she's going to be leaving us earlier than usual. Yes, thank you very much for that. So I do not really have that much to report. The substance of what happened in the committee will be covered in the minutes, which I am trying very hard to get to you in advance of next week's general meeting the you know. We of course had a very robust ranking session and I think the parks and Cultural Affairs Committee has like I do not know more capital items than all the other committees combined, because we have so many parks so that part of the meeting was very long. But at the beginning of the meeting we did have about a 45-minute presentation and Q&A with the the head of parks enforcement patrol, and that was really useful and very informative both for us and also for him to be able to hear directly from the community about some of the enforcement issues in parks and he is committed to attending on a regular basis, not necessarily every month but on a regular basis and to just having a more open communication between the committee and the board and his agency. So that was really helpful. Curtis. I have to be in touch with you offline about some items from our committee that relate more to yours, that I think are already on your list and we have had some ongoing conversation with the Metropolitan Museum about the Margaret Corbin drive and the possibility of opening that up in the spring. Even though the museum is now open. There are a lot of people in the community who liked having that road closed for physical exercise, so we're looking on the possibility of having that open in the spring once we're back to evenings still being light out. Now it's you know, they're dark, I think that's pretty much it. We did not have any agenda items. The other issue was something that was raised by Richard at the last executive committee about the possible renaming of Bennett Park in light of the discovery of James Gordon Bennett's history as a flaming racist, and that he's maybe not the guy. We want to have parks, and I guess, by the same extension roads named after and some actions that the fire department took with renaming an award that was named after him, based on his endowment of same the Parks. Department is looking at that they are going to be announcing on November, 2nd the results of their analysis of this. I assume that process is not going to be their final decision, but is going to be the beginning of a public conversation with some opportunities for public feedback. We did not get to discuss that so much at our meeting because of the length of the meeting. So that's going to be on the calendar for the November meeting and in the meantime, some people who have had some suggestions on possible different names to consider for Bennett Park have forwarded them along to the parks Department. So that's pretty much it do. People have questions. I have one related to not the benefico co- naming yes, but some time ago a community resident brought to our attention issues related to the person after whom, for trump remark yes, is named, and you know british loyalists and other things that are terribly american and at that time I do not know if anyone you know made much of it, but if we're going to focus on Bennett Park, what about Fort trying, so that was that was something that somebody had raised quite a while ago and a lot of people kind of poo- pooed the idea, and then there was a second iteration of discussion about it, where it was taken a little bit more seriously. I do not know what the status of that is right now. There are a lot of people who do not necessarily think that it should be changed in some people who do, but I think that when the Parks Department comes out with their recommendations on November 2nd that park and others, I think, are up for discussion. Okay, so I have a question I just can't raise Liz. Did you say that there were four other names previously submitted? I'm sure lots of people have tried to rename parks in the past or are they kind of opening that up to the general public? Now I think that we're going to have, I think, actually Steve, is better able to answer that question. Well, let me just say that the the Parks Department is undergoing a an acrosss- the- board, review of a lot of different parks and the announcement that made. I expect this to be made in November. I assume is the beginning of a process and and and a particular set of talks is probably going to be identified, and I do not know at this point whether Bennett and or Fort Tryon will be on that list. But I do not believe that would foreclose any further dialogue about those names, but I would not liz necessarily commit to saying at this moment that either one will be part of the announcement that's coming up. I do not know if that's going to be. I do not know if that's going to be the case, but because there's a there's a particular thrust right now to to the to the renamings- and I do not know whether or not these two parks are going to fit within that particular category, but that does, but the commissioner is opening up the idea of renaming parks. So you know that's. This is going to go this. This consideration is going to go on beyond November for sure right and that's why I actually did not feel too bad about not being able to have a robust conversation about it in October. I feel like we're going to be in a better position to have a meaningful conversation when we have the Parks Department's recommendations and people can respond to that, because it was my assumption and I'm glad to know that I was right that the parks Department would be the Parks Department's announcement was going to be the beginning of a public conversation, not fair complete. This is what we are doing end of story, so that is good to know and that's my report. Thank you. Wayne thanks Eleazar. So the land use Committee. We had basically four agenda items. The first one was a briefing by Simeon Bankoff of the historic Districts Council on the listing of the Fort Washington Branch of the New York public library, on the national register of historic places. We learned about that. You know through the borough president's office and wanted to get some more information. As you may have heard, committee members may have heard of the Carnegie libraries. I think it was in 1899. The Carnegie foundation gave the city of New York. A grant of, I think, was 5.5 million dollars in today's value. That's about 160 million dollars and it was dedicated to building my birthday, so the there were 67 libraries built from that grant. More than half of them are in Manhattan and the Fort Washington Branch is actually the last one to be built in Manhattan. But the real important thing is the historic Districts Council worked on creating a framework for designation of the Carnegie libraries as like a class of buildings, so that framework was approved by SHPO. So now any individual Carnegie library can be nominated under that framework, because all of the research has already been done after the framework was approved. Shipper wanted a test case, so the you know the Fort Washington Branch was picked as that test case, and it was listed. We also found out literally the day of the land Use committee meeting that the Holy Root church is also now on the state register of historic places and was forwarded for listing on the national register. We then had an updated discussion on the proposed development at 857 Riverside drive, which we previously discussed in September and for which there have been some discussions over the summer. That's the site, where sort of an 1800s, you know two- story. Single- family house is proposed to be replaced with a 13-story apartment building. There are questions pertaining to the zoning, but more critically the questions pertain to how the street width is measured, because that impacts, zoning and it impacts the building height from Dot's perspective of everyone else who actually know to partner for the area. Riverside drive in that area is a narrow street. What the building department appears to be doing is counting the width of a portion of Fort Washington Park as part of the street, which makes it then a very wide street. I believe the President's office and city planning were going to speak to the appropriate people in city parks directly to get clarification on that, because you know, as I said, that determination of whether Riverside drive is a wide or a narrow street impacts, the whether I believe the sliver law applies and if it does, it impacts the height which will limit the height to five stories. Instead of 13., we then had an update by Dr Ramona Hernandez of the Dominican Studies Institute, on a proposal that we discussed not with her but with lori Tobias Cohen last year, and that was for a non-, contiguous, historic district. That's tied to you know the dominican community, and we say the discussion last year focused on two initiatives that congressman Espana was interested in. One was the non- contiguous historic district dedicated to the dominican community and other, was an Inwood apartment house district and just to clarify the non- contiguous district as Dr Natas points out, most historic districts are landmarking, it's tied to a specific building, a specific area or a specific set of buildings, whereas this non- contiguous district is really tied to cultural memory. It's a very interesting prospect. We were presented with a lot of demographic data which then it is translated into a draft interactive map that has icons of various. You know places locations and places where people lived, who are tied to the Dominican. You know, community. You know we had a thorough conversation and Dr Hernandez. You know, you know, invited the land Use Committee to review and comment on that and we're more than happy to do so, but we also thought that some other committees of the board would be interested in including youth and education, because I can easily see taking a lot of this information and turning it into. You know material that goes into the classrooms as well as parks and cultural affairs, because once again, you're talking about the cultural memory of a place. So that's an ongoing conversation and then we worked on our expense and capital budget priorities. We basically took the two items that land use submitted last year, made some modifications and voted to resubmit. Those continue to be relevant to both the committee and to the community and we're very happy that last year the full board ranked each of our items in the top five and that's my report- Wayne, okay, Chris. I mean that Steve. Do you have a point? You have a question yeah. I think Natalie is also on the call Natalie and I Tim Anderson from our office and other people from the Riverside drive area were on a call right before this meeting and it was brought up. The request was made, as we had discussed at the land Use Committee a couple of months ago, that the board itself sent its own letter to the department of buildings indicating that we're concerned about the 857 Riverside development, the demolition of the existing building, the construction of a 13-story building on the site, and I think we said that we were that we were going to pursue that. But my understanding is either ebenezer or liaison was going to do that because we're asking for information from the building department. So was that done the 850? Can you hear me? Yes, on the a57, a riverstar drive yeah the letter yeah. The letter is supposed to have gone out, I'm not sure whether he was sent that already, but I did get you in both of your emails on that situation. So I'm going to double check tomorrow. When I come into the I mean, because you know like a month has passed since we just yeah, you know the point is I remember there is you know like the central point which it's coming down to? Is you know we have the department of transportation, as we said last month, saying that you know the low drive is so narrow that it really can't be or should not be a two- way street. It should be a one- way street and you have the build department, saying: oh, no, it's a wide street and you know I provided to Tim Anderson and the borough president's office because he was not, but it seems to be contradictory to what parks is saying. Okay, well also wayne. You should know that Tim said today that this liver law may apply, regardless of what the issue is about the street, with that this liberal law has like a different set of requirements and whether we can pursue both issues but right, but not determine whether the sliver law applies. No, I think it's the lot with and that even that's the question. Well, my point is you know it's important, for you know the questions that were raised, that for the Building, Department, Eleazar and Ebenezer to know that there are questions we want them to answer. It's we're not passing a resolution, we're saying in the course of discussion. All of these questions came up. We need you, as the agency with jurisdiction, to give us answers. Yeah. Could we see the letter before it goes out? Wayne. Have you already reviewed the letter? I have not seen anything I'll. Send you a copy of the both of you yeah, please before it goes out. Please yeah. I would also suggest liaison. I understand that Mark Levine's office has drafted a letter that gail Brewer is going to sign on to addressing that. If we did not what other way around the letter is being drafted by the President's office right, that's not that's not what we were told in the Lens committee. Well, that's what I was told just now: okay, great, but the point is: if we could see that letter, it would help us to coordinate as well, but we're losing time. Yes, all right. Okay, guys. Thank you steve. It's almost like a trickle- down effect. You get Liz, Wayne and Steve. Well, at the at the health and Environment Committee meeting, we had a once again a thorough presentation by the health department on the current situation. With respect to Covid-19., we got a report that two of our zip codes, 33 and 34 at that point, were exhibiting an increase in positive cases. There was an and there's a downward trend at that point in 32 and 40.. I just reviewed the statistics before this call began. As of today there have been increased cases since we had our meeting on October 1st. In the last 18 days, there have been 191 more cases of Covid-19 in our community 38 more in zip code, 40., 56, more and zip code, 32:65 more in zip code, 33:32, more and 34., and there have been three more deaths in our community, one in the zip code, 32 and 2, and zip code 33.. So I do not know. The news is not all that great the we also had a presentation from two of the resource navigators who work out of the northern Manhattan improvement corporation. This is an aspect of the test and trace core that I was not previously familiar with. These are people who are providing services to to people who have cover 19 and who have to isolate themselves, either staying at home or in hotels and who need services or supplies who may need food or medication, or even you know the diapers, all sorts of different things that they may need, but they can't access too, because they're, isolated or quarantining self- quarantining at home, and so they reach out to these to these people and they try to they provide them with services. This service is open at the northern Approval Corporation seven days a week from nine to nine. They have Ford resource navigators, they've helped over 1500 people in the last few months, including our about half of whom are in Washington. I said Edward and the others are in the Bronx and other boroughs, so they have a pretty large territory that they're, covering also on the plus side, we had a report from Betty Lehmann that Isabella has had no new colvin cases, and- and the only other thing I want to report is that last Thursday I attended the ribbon cutting for the new Orion Health Center on Wadford Avenue, just south of 181St Street. It's now open providing services to people in our community. It's a you know. This is an incr, a wonderful non- profit in facility, and this is the seventh one that they've opened up in Manhattan it's about time, maybe that they came up to Washington, Heights and Inwood, but very happy to see that they're now in the community. I had asked them to invite both Eliezer and Sidrow, and I hope that they did, but I guess maybe neither one of you could make it there. I did not get the invite Austin, but thank you, though, all right, I told them to damn it. I'm sorry Fern Herzberg was there and oh shoot one of our other board. Members was also there, but I specifically asked them to invite the two of you next time, Steve more about it. If they want to keep the sidewalk clean, they should have sent an invite, but we'll do that. Do not worry about it. It's okay! Is that the end of the report, but Israel. If you get a chance, you should drop in there. It's. You know I think you're going to be very happy to see how they've fixed up the place, and it should be an asset to the community on all sorts of levels, not just on Healthcare, so Steve. I think this was covered on New York one or whether one of the other news stations yeah. It was on New York one. So this is, I mean the building itself dates back to like the late 1800s early 1900s and they kept and restored the facade and did a thorough renovation inside yeah. You know it used to be a theater and if you look way at the top along the corners, it still has the old the whole, the theater, those classic theater images. You know of a bit of different faces and yes used to be called Astro. No, that Astro was was further down. I think on 181St. I think this was just called the Heights theater and and then, when I had an office next door, it was a pornhouse, but it was always important. It was always a porn house. No, it was not no way. No at one point: it showed real, odd films and it was a regular movie. Theater, that's what it's called I'll cut it out. Okay for years and years, but but yes, they they preserve the facade and they and I was really pleasantly surprised- to see how they preserved those old. What do you call those things on the up above along the top? What gargoyles? Yes, yeah? They like gargoyles yeah, it's a very nice adaptive, reuse. All right! My doctor is right next door, I'm sure you know him sees fire, though yeah next door right next door. I'm probably going to go check it out all right. You should visit this place too. All right, I will there's a there's, a question on the Q&A sleeve someone is asking: where can they look up the cove numbers for one zero? Three, two for the zip code: one zero! Three two! All of this is on the health department website. It's it's all there. You can there's a tab, so I can just put it in the chat. I'll have to send it to you guys. Would it be Nyc.Gov, slash health? Yes, oh yes, I'm sorry, yes yeah and then, and then there's a tab that says Covid-19 and then, when you get to that page, you have to click on data and then, after you click on data. You click on table thanks, Steve. Thank you thanks. Okay, one. Second, one. Second, zip code. 32. The question involves Zip code 32 right. Yes, they want to know the copy numbers. Okay, so that's number 80. You have to scroll all the way down. Zip code. 32 is number 80 on the list. Okay, thanks for the answer, Mary your report. Yes, I have my hand raised, I thought you were leaving. I am so I wanted to say that I was leaving, but before I left I did want to say, since we did not get to Isidro's committee report, I just wanted to commend him on a particularly well- run and productive meeting, and you know I wanted to be able to say that publicly. So thank you and with that I will see you on Wednesday. Thank you, Liz appreciate it. You bet, okay, we spent a good deal of the meeting talking about issues about well actually, health issues, safety issues, a variety of things which I have brought to the appropriate committees thus far and the other part of the meeting we spent re- revising our budget items and renum renumbering them according to the priority, because we felt that there were a lot of things that needed to move up on the list and some things needed to be changed. One of the one of the issues has been that you know with trying to get seniors to log into the zoom meetings, and things is that they do not have connectivity and we want. We wanted to be sure that system- wide upgrade of cb12-m area to improve access to connectivity and Wi- Fi was an important thing, not just at senior centers, but throughout the area and the expense budget. We wanted to be sure that the seniors are getting access and outreach that they were providing an access and outreach to healthy, culturally appropriate food for seniors with medical needs. We talked about the importance of mental health issues, but referred that over to Steve Simon and hopefully he's going to follow through and include the seniors under that item, I heard that he did all right and then we talked about the issues that had been discussed about our resolution to give priority to the frail, seniors and disabled and the long lines that happen at businesses in the area. We talked about suggestions from some of the board members Steve had suggested, maybe the possibility of having a lost my words steve. A press conference. Thank you press conference as a possibility, and I spoke to Eli about that and he is in agreement. So I think we're going to work towards that and I'm hoping I asked paola to be sure that she sent out the resolution to the electeds, and I know it's gone out, so I'm trying to actually see which businesses are actually allowing the disabled and the seniors to get them in front of the line. What I do notice is that 175Th Street farmers market on thursdays. They have grow NYC staff at one of the one of the biggest farmers tables there to let the seniors and disabled jump to the front of the line and they're very good at that, and you know so I'm hoping that we can use them as an example, although they're, not local businesses, but so I'm scouring the area. If anybody is aware in the CB12 area of a business that is doing that. Let me know please we want to pursue that as an example and that's about it. Thank you for your contributions, Mary. I really appreciate them and I'm sure all of us do so. Thank you. The next is Ariel. Can I ask a question, of course, I'm sorry I'll tell you what she's standing up yeah Mary do not do not any of the banks do something like that provide a special line for seniors, not that I know of because I've dealt with Chase Bank on 181St and I deal with Civi Bank on 180Th between 180 181st and neither one of them do. I thought maybe the Apple bank does it. I have not been to Applebank, I think Betty goes there for one of our other organizations, so I can ask her yeah check that out. But if you can't find anything else, then I would use the green market if they're doing something like that, we can use them and prop them up. As the example of you know, I'll tell you this there's one lady who's usually assigned to be there on that line and she is terrific she's, like you come into my line go over here by the ex. Maybe we can help promote them. You know so that people know that they are. They want place in the community that they can come to right. Okay, thanks to the both of you, oh yeah, you know I want us firmly. I think this is a great issue for the Community Board to to latch on to and to to to raise the flag on. It would be a good thing for board 12 to try to get some publicity around this issue and it would it would reflect well on us, I believe, yeah we're just texting a designer, so they can put a flyer together so that we can use it as a regular promo on our social media and stuff. So I was just doing that while we were talking so thank you again, Steve and Mary. You might want to check with domingo also because when we discussed this actually he had talked about being available on to you know for some signage. So I do not know if he still wants to get involved with that or not I'm a little busy right now. So, unfortunately, like I'm at capacity at the moment, all right so ariel your report. Thanks, oh Mary, once again: okay, hi everyone. How are you doing so I'll? Keep it pretty brief? Essentially, we went over pretty much what's the main process for budget items we went along for the most part, with most of the items that were included previously. I think some of you already mentioned that you went over some of these items, but just to go, you know, for the most part, there's five items that were kept from the previous year in relation to. I believe this is the capital items here and then an additional six or so items or no five items on expense. We've added one item specifically to the capital sheet and then two items on expenses, I'm not sure if perhaps folks might have seen it already. This was shared yesterday with the staff yesterday evening, but yeah that's pretty much it. We did not really have much of anything else further than discussion about the budget. Thanks any questions for audience going, one going twice the end today, oh see yeah. I knew I still had a question for you. Yeah Ariel were you able to fit in the item about providing fun to increase funding for the food pantries yeah? I left you a voicemail, not sure if you saw, I guess not. No, okay, all right! Thank you. Thank you thanks deb hi. So the breaking news is that elevator replacement at 191St Street, a train which was projected to go through February 21st, is expected to be done two to three months early. How do we know that? Because today, MTA announced on December 5th, the 181St street 1 train will be closed for its elevator replacement. Mta will be at the November 2nd tnt meeting to talk about that closure and the alternate travel plan. This is only the second time that we've had a full station closure and the last time was 168th and while that was a full closure of the one train at least you still had the a there. So so, like all of these, you know each closure. Each elevator replacement has had its idiosyncrasies and 181 is going to is going to be big but obviously heartened to hear about how quickly they got the last one done. We'll have we will have three resolutions. We passed three resolutions at the Tnt committee meeting on October 5th. There are two co- namings and one related, that's not a co- naming which I want to talk a little bit about. We had a community member who has been circulating with various offices in D.O.T, a proposal for Riverside drive, and I want people to try to picture this. Riverside drive west of Broadway, so Riverside drive between Broadway and the henry Hudson entrances, and the idea was sort of a little bit inspired by the fact that you no longer have a connected bike lane on Dikeman because of the open street and dining plaza. So and amongst other reasons, but that's the main reason. So you no longer have a connected bike lane to get you towards the greenway, the Hudson greenway, or to the rest of the Dikeman Bike Lane. That goes east, and so the idea that this person had was that you would. You would move that since you basically do not have the bike lane on dikemen anymore. You would create it on Riverside drive on the westbound side and have a protected line, laying on the far right of the westbound side on the north, curb that means, and then you would take all your existing parking and move it next to the protected bike. Lane and you'd have one lane of traffic lane rather than two lanes of traffic, and besides the issue with the fact that I'm sorry debbie, I I'm very confused, are you talking about the Riverside portion of Riverside drive just south of Dyckman Street alongside Fort Trium Park? Or are you talking about something down in my neighborhood? I'm talking about next to fortran, Riverside drive between Broadway and the henry Hudson entrances? Okay, the block is south of diamond, oh okay. Now I got it, I got it yeah so and then the idea, besides the fact that you no longer had the connection you know the bikeway connection was that there's also been I you know, issues with excessive speeding and some described as drag racing, which this person claimed was actually a little bit of an issue in the right lane, because in the left lane, since more of us, are going towards the southbound henry Hudson you're kind of like doing your thing and you might be obeying the traffic, but there's a game to play to like if you're going to northbound or you just want to get ahead of the line going. Southbound because that's where the traffic is to actually speed in the right lane. So the idea is that you get traffic calming and you also get, and then you also get the lane. That's not working on and not sort of existent on dikeman and then move that out of there and you do not lose any parking because you're retaining the parking blah so the other. But the other thing is that this short strip we've been getting a lot of reports of issues also coming east, as people exit the highway they're still at highway speeds and there have been accidents and like repeated well, this is property damage. This is not people getting hurt, but there have been people hurt at henshaw, so like henshaw, the sign gets wiped out like every other week and there actually have been people hurt at that corner. So what we so? What we did was we passed a resolution that asked DOT not to support the idea but to say to DOT. Please look into this proposal, but look into the whole strip and evaluate the idea, evaluate the conditions and come back to us. So this again is not a it's, not sort of in support of the proposal, as is, but it is saying, go look at this so again, because we've seen things in both directions: issues in both directions, the other two co- namings one was and that's. Daryl Cochrane has taken the lead on the health care hero's way which passed unanimously, and I think I'll probably have him presented at the general and that's been drafted, and this other co- naming we had, which was absolutely a heartbreaker and one of the harder things I've had to do during a meeting is a co- naming for Isaiah Chaimaronto away at Dickman and Nagel, and this is the young person 13 year old, who jumped into the very cold water trying to save his friend and died and his and a real what was presented to us, and I think people might that maybe know the families or know you know more about the story and Domingo's been very involved as well. Is that this was a kid who touched a lot of people who was like an upstander. You know one of those like help. People with bullies help people with, but like sort of help, people of all ages left a mark. It was absolutely I do not know. I do not really have the words, but you know there's, I guess a mural that is up for this young man, but we all felt so honored. I think to be able to do something small to make sure that this person's history is remains. You know with all of us as part of our collective history as community members that one has not been drafted yet, but that's what I'll be presenting and then last on my on the on the budget stuff, you know on Tnt we kind of had been sort of pushing along the same stuff over a lot of years, so we really made an effort this time to kind of bring forth a few items that we end up talking about a lot throughout the year, a few hot spots and such kind of bring those in we added something on fair fares which has gotten such a dramatic. It's so dramatically needed yet has gotten such a dramatic budget cut. So we we added that item. So anyway, people will see we do not have a long list, but we've really tried to align it, particularly on the expense side to things that you know, we've contended with over time as a committee and yeah- and I hope people feel that, like that is reflected, would that be all before I move on to curtis just like to make a quick comment: Debbie yeah, you know thank you for making it worthwhile to be here. So one of the things that more times are not when we do not, we do not do, which is to recognize the own song hero or the person, that's willing to even give up his life for a fellow human being. So I know about the family. I know they may not. Thank you for taking the initiative at doing this. Is that something that called hit home for me? So thank you for making it making it worth being here at all. I see you yeah. No, I mean it's we're I yeah. As I said, I felt I mean it's such an unspeakable tragedy and I really did feel honored to learn more about him and to be able to be one more person who could hold him. You know because in memory we keep people's alive in a way, and you know we do not. I mean this service on community Board, for all of us gives us exposure to people. We might not know because we do not live on their block or we do not go to the same school or what have you? But you know, but that's the beauty of this right, that we get to learn those stories and when we get to see this thing, that's ours, it's our community and just understand even that much more about the amazing people that are in it. So, but it was it was. That was a tough one boy yeah. I do not know what I'm going to do with the general, but we'll figure that out all right. Thank you and domingo for making us human once more. My main curtis next do not mute yourself Bro. Thank you very much. Come on man hear me: yes, perfect, Bro, I wanna I'll, be very brief. We had a very productive meeting this past month. We had, we had representations from the 34th as well as the fire department. They have not been present for the past few months, but they are back on schedule with attending our meetings regularly. We did speak in great detail about some of the challenges. We've heard ongoing challenges of 301 noise atv, and we had a substantive conversation about the Atv issue. I would love to chat with you debbie offline about this in the future, because there are pieces of legislation at the state level that we can possibly advocate in support of a few of our local electeds were present in my meeting, and they spoke about the Atv issue. There are some, you know some ways of including more speed cameras in certain areas, particular time periods. Some are against it. Some are in support of it. I would love to have that issue, maybe discuss also at your committee, since it is an overlapping issue other than that we are going to be. We have a few great items on our on our list of priorities for our for the budget process, including the three- on- one issue. We noticed during the summer months that spanish language is not an option when you call 3- 1- 1. So that's one of the high priorities areas for our commit our committee to advocate for that language, accessibility, as well as mental health and clinical support staff for the NYPD precincts to help mitigate some of the issues that we see acrosss the community. I did email you about the two shootings. The precincts were great and I want to thank them publicly for emailing us immediately about those incidents. One person was arrested and this, I believe, remains arrested and the other person at that point in time was have not been arrested. So I think I'm not sure what the update is as of yet but their ongoing investigation. So we do not have any additional information at the time. That concludes my report. Thanks George, thank you for keeping us updated and things that we may even drive by the street, and then I found out through you. So that was that was really thank you for looking out. Are you always on top of on top of the game? Oh you say already, I'm sorry. I should add that you know part of the f. You know the challenge I had was you know that the you know trying to figure out ways to improve communication with the precincts to ensure that they're giving us information in a very expeditious and efficient way, and I did push them to do that, so they have been emailing me whenever there's an issue like if it's really important, I do not. I would not email you all everything, but I thought the shooting for a viable information that you all should have as well. Since it is shootings, I will say that you know there have been four murders this year and in the 34th I believe five in the 33rd, so that is an increase. There were only I think the year to date last year was one in both precincts, so those are those are increases, but other than that, the other increases are burglaries and gla. There continues to be a lot of car theft because people are leaving their keys in their cars and going to shop, and that's just it's crazy to me that people are doing that, but they are doing it and people are still in cars, so the largest increase. It falls under the dla category and not necessarily particular crime, so the shooting yes, it is important, but it's important to look at it on a year on the you know compared comparatively to the prior years and really see that the bigger increases are with burglaries and as we see, people are still stealing packages and they're. Also some cars yeah. If you own a honda, you better watch out, because that's what they're aiming for Honda's from 2010 to 2017, something like that. I was just told that they found a bunch of different handles all over the world that they were stolen here. So thanks Curtis happy to answer any question all right. Just any questions, I guess not thanks! Faye are you there are you were you promoted already? Where are you are you on? She was not promoted. I could see her yeah. Oh, she has not been promoted while she gets promoted, then I'll move on to she was promoted. Now she was promoted great fake hope. She was not held back. Okay, yeah all right, we're happy now well, you'll, be in control. That's why I clearly hear you thank you for bringing me back good evening. Everyone, yes, okay! We finally had our one meeting this past Thursday. As you already probably know, we have some turmoil with the transmission, but finally we got it. You know we got it done, so we were able to comply with our duties. We discussed our budget priority for fiscal year 22.. We review a total of seven items for the expensive capital. I mean expensive budget and we also review about not about 13 capital. Unfortunately, I know we were pressure four times, but we did manage to to vote. For I mean the the but all the budget priorities we are actually adopted. There was a few questions that are still reminding that I have to discuss with with James Berlin, which is about one of our kali Paradise. We have to exit the meeting before we conduct the voting procedures, but she said that she will go with whatever with the recommendation the committee you know would do so. My question to Jim was basically whether or not her vote counts, although she said it in advance that she will go with the recommendation. The committee, you know decide, are you talking about your committee meeting or the budget priorities meeting the budget we have. We have forum, but one of the members she have to exit like 10 minutes prior to the committee, taking the voting or conducting the voting procedure, and she said before she exited that whatever recommendation the committee you know, do I mean she will go with it yeah. Unfortunately, I'm sorry that you off, but you know, let's try to save a little time. The second she leaves okay, the if you're, not at the meeting. You know you can't vote and you know you can't leave your votes behind. It would be like leaving an ordinary meeting early, so she just does not get to vote, but probably she says she was agreeing with everyone. It probably won't make a big negative difference. Well, she when she participated throughout the discussion she just only. The point is if she left the meeting before the vote was taken, she may not vote okay period. Those are the rules. No, I understand, and I appreciate it. Thank you. That's the only thing I do not make up the rules. I just interpret them. Remember that oh you're gay, you yes exercise, then all right so other than that. I just wanted to announce that coming on our next meeting on November 9th we're going to have a forum and the tour that would be the second part of the youth and homelessness we're going to bring that conversation back from 2017. We are planning to bring the same panel that we brought up. You know back that we previously had, but we also may have too few folks that are going to be new guests. So far we are still and still pending, but so far that's what we are. We are projecting to have the the forum on November 9. other than that. That's my report. I want to thank you for your time, and this is it okay thanks? Thank you. Oh hey is idro, so I wanted to thank the staff members Evening Sir Chennai Paolo, for putting together the paperwork for the licensing committee. I know, as we all know, that these are the unprecedented times are very grateful for putting all the paperwork together. So we had 14 applicants, there were new nine new licenses, which included four liquid licenses and obviously three one Mba licenses. Two of them were withdrawn at the meeting. One of them was rejected because of my show there were two particular applicants that were a little bit contentious and that's because there was some residents that came to the meeting and they had some deep concerns about the possible issues that might come up. If we were to approve those two licenses, there were some board members above gabriela and many others that raised concerns about those particular spots. At the very end, our committee decided to approve those licenses, because our idea was that we could not have punished a business that has not come into the neighborhood and we should have given them a fair chance, especially on those times, and originally I myself was going to vote against one of them. But after hearing comments are from some of our new members, I decided to vote in favor and now both of these applications passed, we did put a number of stipulations just to make sure that the issues that were concerning to the residents, which was noise and also double parking issues. So we set up a stipulations that they have to be obligated to follow up with this stipulations, but other than that it was a you know. Really. Nice meetings, I'm happy to see some board members coming to these meetings, because it gives me a better perspective of what's going on those some particular areas that I might not be aware of issues that I may not be aware of. Well guys. Are you always welcome to come to licensing every now and then it gives me a great pleasure to hear from you and it serves the purpose that you know we're not there by ourselves. I think that your minutes are going to be submitted by one of our members and also the resolutions also are also going to be rain by our fellow members as well as we move forward. Those minutes and resolutions are going to be written by other members, so we're going to alternate every now and then because I want to make sure that you know this is inclusive and that you know everyone gets involved with that. I will stop for any questions steve any questions wayne the usual suspects no question today is your lucky day. You have zero questions. You must be doing something good. The next it'll be Richard allman. If he had a computer issue, maybe he's back and if he's not, may you guys? Can you guys promote him back into the panelists group and then that will be domingo, and that will be the end of our meeting he's here. He just has to be promoted, cool richard yeah. Can you guys Chanel or Ebenezer, promote him Jonathan? He has to be one of the hosts that no longer have the ability. It could be. You ebenezer all right, he's back he's promoted already yeah Richard is here so Richard, you're, muted. Well until he gets it's computer issues resolved Jonathan just gave us a few words as to the work we've done, where we're going. Jonathan just give us a few reports. Oh a report. That's basically, what's it's transpiring technology- wise with the board and some of the things that we're planning on doing and so forth? Well, I have done another youtube report, regardless that we may have on the hands good tools to handle the transferences and the following meetings going forward. That's a report! Richard are you back with us. I'm sorry! I had a question to join. Can I get my report because I got this thing yeah all right, so basically the bingo. We did the rankings. Our committee basically worked. This penis smoke being able to get different being able to feel the impact like getting a better understanding of the impact Kobe cove it had on the business sector by being able to identify the various sectors and getting testimonies from business owners. So we could be able to have a refined scope and really truly understand what the impact has been on cobin and what businesses truly need. So in our previous committee meeting, what we did was identify the various sectors that we'll be inviting for the next two three months, so we could put together a solid resolution as to what are some of the recommendations based on what businesses are telling us that we're encouraging the city. What measures to take and besides that that was that was what the meeting consisted of. If folks want a much more in- depth, play- by- play, I would say in our minutes, in the General Board meeting we should we should be able to give a better understanding. If there's any questions feel free to. Let me know or ask, and thank you, okay, Jose. I think you I understand you had questions before Domingo stepped in yeah. I had a question to Jonathan sure. Can you update us in terms in regards to the Facebook page? Well, we've been we've been using the same webpage. Ultimately, we design it. So for the moment we do not have no plan on bringing on some contacts that may be added on some existing old page that we mentioned at the very beginning, yeah, that's what we had before. Okay Richard. Could I make this tonight. Can I just offer a suggestion looking at this issue, because it seems to be an ongoing issue. Is there a way Jonathan to download all of our current followers on the old facebook page and we invite them to be to like our current page? That's not possible. Okay! No! I'm! Oh, go ahead! Sorry Jonathan. I wanted to say something yeah. That was one of our first an initial proposal. We say that we were able and we still are able to invite any important on follower that we might have on the other page, which I still do not know, and we do not have the access. I do not know exactly who has the access. I know some of you guys have that access, but I do not have it. I do not know which follow we have there, but yeah. Absolutely we can invite them to follow the current page. Another option which I've seen people do is to simply re post messages saying this page is no longer in service operation. Please click here to follow the new link and you do that once from once a week and over time people will start to Migrate and they'll start to, like the other page, absolutely yeah, that's one of the auctions that we might implement either advising put a message and click here and go there and also inviting them from the new page. Also catherine. So we can say something exactly that's exactly what I was going to say and I think in the context of that post, putting that existing facebook page will be shut down so that people have urgency in going into the new one, and you know I think a public meeting is not necessarily the space to discuss that, because that is more logistical. So I think you know, maybe we can broker a meeting of folks who are managing the old page with the official Community Board page, and that way we can actually set a time to it, because you know this is getting. This is becoming a broken record honestly, and so, as long as we can say, you know, by November 30th by October, whatever weekly meetings on the old facebook page, that it will be shut down, please like our new ones. I think we can really Rob have a robust following and eventually people who do find us on Facebook will only find one and not two yeah. I think we're going to turn that around into from the curtis at the great point, this migrating, so that the Facebook page becomes content- driven and it has not been content- driven. It's mostly been a way of just you know, broedcasting the meetings, but there's history there that I do not want to get into because really necessary you're trying to be as productive as you can here. So basically yeah. You had something else before I call it a night yeah. I just I wanted to add one more thing to my report. I think I forgot to mention this, but we have 3- 1- 1. It has been an ongoing issue, obviously for us in this community. For a long time we have 17,000 complaints over the summer. I did listen to. I do follow the World Board meetings as well, so I did listen to the report that Gail Brewer mentioned about 301 complaints and kind of go getting to the bottom of. Where do these call? Where are these calls going? There's been talk about creating a czar, some sort, so to kind of navigate all this enforcement issues that are going on and people call through one they're routed to the fire department, sometimes right, routed to the to the transportation department, so they're going everywhere and there's not one central reason as to what how their complaints are being resolved. So the 311 issue is an ongoing issue that we're going to have on our agenda next week. I mentioned that because I saw some of our regular attendees at our meeting in our in the attendee section here. So I want to let you all know that we are going to continue to monitor that issue and to advocate, for you know, whatever we can to figure out how to best have those complaints or concerns processed and in a way that they're not just being just sent out into the universe and no one's ever responding thanks, George Beta, NYC beta, and we see that I'm sure you know is the is the arm the technological arm of Mbpo, and I requested that the 311 studies are also done in spanish, because it has not. I mean it's not the same as translation versus doing something totally in Spanish, so that people can understand and grasp. You know really the concepts that are being explained there. That has been extremely adamant as to you know how this data is, transforming it's transforming in the sense that when you see that the numbers are presented in a way but you're, not can't you can't translate them into what they really mean. Something as simple as knowing that community boards, 3:9 10,11 and 12 have the most noise complaints. Just so just to give an example, out of mainly the entire city, that pattern means something and that's what that's. What is critical, that this beta NYC model is spread out in as many communities and as many boards as you should be. So. Thank you Curtis, I think is. It was an extremely good point. So unless I go to Richard Olmein, I have something. Do you yeah well? First of all, I I may have missed a part of your report earlier. Did you indicate whether the Columbia you've asked Columbia to bring the Dikeman Institute Scholars to the November meeting? It was the other way around. Ross had approached me and asked me if it was okay to have the document scholars in the next general meeting, which I agreed to he has not confirmed yet. Oh well, yeah. I think he's going to do that. So I want to I'll report it I'll report it when I have a confirmation. Okay, I wanted to give you credit for doing it. Okay and Natalie has asked me to make a big announcement that community district 12 has actually won. I can I cut you off because I was going to I wanted to do that in front of in the general meeting as part of my presentation. So, okay, sorry, brother, so, okay, all right, so I won't mention that we won. Oh because I want. I want all 50 of us to celebrate, not just the 11. Why did we win nothing I'll? Let you know Richard your turn. If I can't get Richard, then I'm going to ask for a motion to adjourn the meeting. Second, thank you. Thank you all. Thank you. So much wait who called the motion to Adjourn. Thank you. That's not a problem! Good night, everybody.",
            "summary": "What we've done in the past couple of hours with the doodle and the technology and so forth, so So, basically part of the discussions for what would be kind of like our first ever virtual vote as a board, and I think it's a great way to test it in terms of, or just have that experience in terms of our budget.\nAnd I do think that some of the committee recommend rankings are still pending, but I'm sure benezer will get to that in his report, but basically we're going to compile it all onto surveymonkey, Two, very distinct, Links, one for capital, one for expense and through that folks.\nThe Pdf document that we've traditionally used in person as just a way to visually, see, for example , that, like small business or licensing or whichever committee ranked it in this order and because in surveymonkey it'll just be all items and people will be able to just kind of rank.\nMonkey makes this process so much easier, because you know I can't imagine what the board office staff have had to tally for 50 plus people.\nI think distinctions right is because in having a hybrid is that normally when we voted in or when we ranked excuse me in person, we submitted it that same evening, right But this time, around, considering that we wanna give both pools of people the same amount of time and this So, the budget hearing, for example, is Wednesday at 6:30.\nThe link will be sent to folks and because we need to compile, you know that other smaller pool the idea is to keep the survey monkey open for 48, hours, and so folks can actually this time around compared to in other years, have additional time to rank.\nYou know any further bigger questions that they want to ask the committee chairs or committee members they're able to do that as well, and that kind of keeps the time I would say equitable for all You know, keeps it really clean.\nToo, is the fact that the deadline is October 31st, but we'll probably, and most likely have in time for the general meeting what the actual ranking is, if we do, keep it to 48 hours.\nIf you know some of the people feel more comfortable, just emailing their budget rankings, they can easily email it to ebenezer or They can just if they do not have the email access Yeah, that smaller pool of people who do not feel comfortable or can't access a survey monkey they can email it or even if they take a picture You mention a deadline for having this stuff in by yes.\nThe idea: is, I think, one of the main objectives, at least particularly for me- is that there's and for a lot of other members in the past, there's always been tons of confusion about the budget hearing, and so the agenda will be shared out tomorrow and the goal is to have each one of you know within your three-.\nAnd, then I would also add if there was items that you've included as a result of Covid-19 or as a result of community groups that have come to your committee, meetings.\nI think that adventists are sent out the report from Mbpo or no DCP rather saying you know the numbers and what some of the budget items were applied to so we're going to have a baseline, showing you know what we were from last year.\nCv 9 pointed out that not since Covid-19, but rather since last year, there's been an uptick in drug related crime and activity in that whole West, Harlem area, and you know, they're working with the police prisons to address it, You know we all know that activities like that do not respect community district, lines, and so.\nWe've been participating in some other events in 175Th and Broadway, 181St of Broadway Cedro and Juan Rosa, and all those executive directors of those organizations that we've been working with getting the ward out for the voting and as far as Community Board, let nine ten eleven and solve that's a tremendous idea, an initiative that we should start again putting back together.\nI think there's a lot of information that people need to know.\nI would suggest we get the information from the board of elections about early voting, because I think there's Confusion and people do not realize it's going to begin on the 24th and run for, I think, And it's going to be happening throughout our community.\nAt the June meeting June executive committee meeting I asked to for the document the licensing committee documents to be sent to me and Eli indicated that all community board members should get it so far.\nI know you said at the June meeting So at the June meeting, I asked for the licensing committee, pre- meeting documents to be sent to me and Eli indicated that he wants all community board members to receive it.\nYou reframe the question: What information, specifically the pre meeting documents that being submitted to the licensing committee That, should not be an issue.\nWell, you want, which month are you looking for going forward every month before the you know, when the licensing committee received those documents, I would think it will be convenient to just send it to everyone, but if not, then that can be sent, you know after the meeting, so whenever the office feel that it's the best time to send it to the community.\nWhat I'm requesting is to get the public information, which is the packet that the licensing committee is receiving prior to their meeting, okay, good, so that's being established, but all right.\nSo, as ebenezer noted in September, I asked him to issue financial budget reports for those months, so we could do kind of a first quarter report to at the executive committee and move forward with that.\nAnd, then you can guide him into what you need, and hopefully you can take that from there all right takes off, so you can at least try to like Offline talk, connect and just have that meeting in and so that we can have that report.\nI need Juan's email as well, because he did not log into the committee meeting and I want to make sure.\nSomeone might want to reach out to her, because right now in December, youth in education is scheduled to meet after the executive committee and the day before the board meet the general meeting.\nWell, I think we have the technology that oh yeah, pretty simple good, but as long as you do not know how to do it in advance, you can have one meeting and then go into what's called breakout rooms They have this shared agenda item together as one meeting then, when they're done discussing that you go into breakout rooms and the person who's, the host can send people who are on Tnt into that breakout, room and zoom does not give zoom , I do not know, ask the public attendees to like.\nThe parks and Cultural Affairs Committee has like I, do not know more capital items than all the other committees combined, because we have so many parks, so that part of the meeting was very long.\nAt the beginning of the meeting, we did have about a 45-minute presentation and Q&A with the the head of parks enforcement patrol, and that was really useful and very informative both for us and also for him to be able to hear directly from the community about some of the enforcement issues in parks On a regular basis and to just having a more open communication between the committee and the board and his agency.\nIf anyone, you know made much of it, but if we're going to focus on Bennett Park, what about Fort trying, so that was that was something that somebody had raised quite a while ago and a lot of people kind of Then there was a second iteration of discussion about it, where it was taken a little bit more seriously.\nThis consideration is going to go on beyond November for sure right, That's why I actually did not feel too bad about not being able to have a robust conversation about it in October.\nI feel like we're going to be in a better position to have a meaningful conversation when we have the Parks Department's recommendations and people can respond to that, because it was my assumption and I'm glad to know that I was right that the parks Department would be Parks Department's announcement was going to be the beginning of a public conversation, not fair, complete.\nI believe the President's office and city planning were going to speak to the appropriate people in city parks directly to get clarification on that, because you know, as I said.\nI think Natalie is also on the call Natalie and I Tim Anderson from our office and other people from the Riverside drive area were on a call right before this meeting and it was brought up.\nThe request was made, as we had discussed at the land Use Committee a couple of months, ago, that the board itself sent its own letter to the department of buildings indicating that we're concerned about the 857 Riverside development, the demolition of the existing building, the construction of a 13-story building on the site, and I think we said that we were that we were going to pursue that.\nOne of the one of the issues has been that you know with trying to get seniors to log into the zoom meetings, and things is that they do not have connectivity and we want.\nWe talked about the importance of mental health issues, but referred that over to Steve, Simon and hopefully he's going to follow through and include the seniors under that item, I heard that he did all right Then we talked about the issues that had been discussed about our resolution to give priority to the frail, seniors and disabled and the long lines that happen at businesses in the area.\nSo I think we're going to work towards that And I'm, hoping I, asked paola to be sure that she sent out the resolution to the electeds , I'm trying to actually see which businesses are actually allowing the disabled and the seniors to get them in front of the line.\nWe had a community member who has been circulating with various offices in D.O.T. A proposal for Riverside, drive, and I want people to try to picture this.\nThe other thing is that this short strip we've been getting a lot of reports of issues also coming east, as people exit the highway they're still at highway speeds and there have been accidents and like repeated well, this is property.\nAs long as we can say, you know, by November 30th by October, whatever weekly meetings on the old facebook page, that it will be shut, down, please, like our new ones.\nI, think we can really Rob have a robust following and eventually people who do find us on Facebook will only find one and not two Know, broedcasting the meetings, but there's history there that I do not want to get into because really necessary."
        }
    }
}