{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCNZyLULUQBp5e9Q1cKtvk6Q",
            "title": "Executive Committee November 2020 Virtual meeting",
            "publishDate": "2020-11-17",
            "shortDescription": "",
            "lengthSeconds": "2:29:19"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "rUMp2kStRZA",
            "fillerWordCount": {
                "uh": 408,
                "um": 218
            },
            "readTimeFullTranscript": "78 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "cameras": 28,
                "attendance": 25,
                "report": 22,
                "health": 22,
                "land": 16,
                "zip": 14,
                "day": 14,
                "business": 14,
                "numbers": 14,
                "percent": 14
            },
            "wordCountSummary": {
                "land": 7,
                "business": 6,
                "election": 5,
                "development": 5,
                "health": 5,
                "ballot": 4,
                "attendance": 4,
                "chair": 4,
                "cameras": 4,
                "report": 3
            },
            "fullTranscript": "So hey, oh you hear me people, yes, I can hear you, okay, hello, hi, Wayne, hello, I'm going to kill my video while we're waiting for things to get started. Also: Esr you're, muted. Yes, I'm going to have to hop off the call a few minutes to eight, because I have a class that I'm taking at eight. Unfortunately, my mondays are now taken over by study. Welcome to the club. Would you like to have your report done sooner than ever and everyone else I, don't think I necessarily need to go first, I'm happy to be in the order that I'm in unless it looks like we're getting up against that eight o'clock, in which case I'll request to leapfrog, if necessary and I, think that I think that we may have quorum going one two, three, four, six: seven, eight nine ten, two there's 14 of us, so we do have quorum all right, so we're going to call the maiden to order 6:37, November Monday, November 16th at 6:37 p.m. Thank you! Each and every one of you for being here considering the times. I'm sure that we've all we all know that we are pretty much coming in into a second wave of the Covid-19 virus and the positivity rates and so forth. I think Bex is the message that we'll take care of each other that will be vigilant of social distancing and all the nice stuff. I think that I saw two of the three sets. Two Stetson sites on 181St Street and they were scary, were go around the line from 181St all the way down to the middle of the block in 180,182nd street and the one indictment forget it in both sides. So I think that, hopefully the city doesn't get shut down again, but hopefully things aren't quite the way that they used to be so I'm going to go step right into my report and talk about a letter that we have of all of us will send out to Mr Chris Kelly, the assistant vice chairs assistant, vice chair of the office of ambulatory care at NYC, health and hospital and Mrisa Dorothy, the Office of the mayor's community affairs, requesting additional testing sites in in zip code. One zero four zero, since we just happened to just have one- and that was one of the zip codes that I'm sure all of you guys know were the increase, the highest increase of Covid-19 cases. They responded that they are following up with it that we are in contact with Lorraine Valentin, who is the test and trace outreach campaign for Manhattan she's, a director for that campaign and she's, following with the testing teams, so that she can so that we can track the progress making towards the goals of having at least three or four testing sites in one zero, four zero, so they sent us awesome documentations that we'll be sending out tomorrow. Is this flyer? Oh, it says what are you? What can you do to fight Covid-19 the resources that they, the city, is going to provide us with for to safely separate us when we're home, so you're going to get a copy of this email tomorrow, each and every one of us? On a second note, we sent out a letter to Chief Edward Grayson from the acting commissioner of NYC department of Sanitation, requesting more basket trucks for the commercial corridors in 180 fairs dachman inside Nicholas. They also responded saying that they are working on it. We also contacted the Office of Dyna Councilman Denis Rodriguez, who had that we did not know of had allocated twenty five thousand dollars for the additions of more basket truck services at the times. No one really know the times that they're picking up they used to do it three times a week, actually no daily, twice a day daily twice a day. Now they don't even know the times they're just coming. You know whenever, so we given we've been very vigilant to the services that sanitation is providing us or the lack thereof. On another note, on the positive note last Friday, the awards for the paper awards were given to two wonderful organizations. It was the whole fifteen thousand dollars Sally and her organization in friends of in the friends of Inwood park were able to receive 5,000 of them. Her testimony was wonderful. She was extremely grateful. Hopefully, she'll talk about it in the general meeting about what she was going to use the funds for, and the community of the heights received the rest. They are also very grateful. They are going to use it to hire a manager for the food pantry. Her food pantry is now serving approximately according to their new executive director, almost 3,000 meals a week and without any city funding for it. So I think they were very happy. When I spoke to Yvonne on Friday, she was very happy to hear that at least she has some startup money so that she can continue to serve her food pantry and I'd like to give personal thanks to Wayne for making the suggestion of using cloth as a as one of the two organizations and and Steve Simon, also so personal. Thank you to the both of you. I, don't want to take all the credit on something that it was really. Your commendation I think that's pretty much. Oh and Thursday at 12 o'clock we're going to send out a flyer and that's going to be part of Mary Anderson's presentation, we're going to have a press conference at Plaza in 175Th and Broadway in which we're going to make a presentation. One media, Pressly release of Mary marries a resolution on the disabilities and the on the aging as to how business is going to help better service, though so, but I'll leave that up to Mary. But I just wanted to announce that we're going to have a press conference on Thursday at 12 o'clock. The details will be provided between tomorrow and Wednesday. With that finishes, my report and I also like to bring in Mr Jim Berlin and very briefly, make up presentations on two resolutions about the next remote elections that we're going to have thanks. Thank you. Eli wait. Can I ask a question. Yes, I actually have a question for Elia Sar, yes I! That sounds amazing. What you just described from cloth, I'm just curious. Since we have Sally here, would it be possible to get like 30 seconds from her to just explain what her organization is doing with those funds, because I think that would be instructive? Yeah I wanted to do it in the general meeting, but she's there now, yeah, she's I think she's on. So, if someone can not mute, her sure is actually raising her hand. Oh perfect hi Sally. So you have to mute yourself. Sorry I'll, try and be brief, but that, as you know, for me, that's sometimes hard. We're kicking it off with a seed giveaway, probably with a drum circle and I. Had a question. I had my hand raised, because one of my questions for Ellie was at this seed. Giveaway we'd also like to distribute some information in PPE, if possible. So I don't know if that's on the list of resources that you spoke about, but this is the perfect opportunity since we'll be interacting with a lot of community members to give out PPE and other materials. So the first thing is just going to be the kickoff which is going to be a seed giveaway and that, hopefully, will be in November to be scheduled. If not early November I mean early December. Basically, we want to get the seeds in the ground before the first frost, so we have some time. Second, we are establishing a tool chest for the community. What that means is a lending library of tools and other supplies that we've acquired over the years. So if you want to go out and do a cleanup one day, we've got grabbers we've got gloves: we've got trash bags, we've got that kind of stuff, it'd be good if people supply their own trash bags, because that's the one resource we might run out of, but we have a bunch of tools we have shovels. We have breaks if you want to, if you're trained as a citizen tree pruner, you can also we have all the equipment that they recommend through that course, and so, if you have the certification, you can use those tools. If you want to do a host of. If you want to do treat care, we've got cultivators trials, it's basically making right now when a community group wants to go out and do work or even like a group, that's not a community established community group. What they have to do is find their own tools. We want to make that easy by locating those tools centrally and being people being able to access it like having a library of tools in the neighborhood and it can grow. You know, as our funding from other sources grows and then the last thing is doing. We've been doing read-aloud read-alouds in the park we've been doing poultry walks and that kind of stuff. The idea with the read-aloud library is basically offered the same thing, but I'll be able to film them so they're accessible in a channel on our website. Whenever someone wants to read a story or have a story read to them so focusing on all different age groups inviting bilingual speakers so that people can hear stories in their native languages, and so that's the plan so far and we are really honored to be able to have this opportunity. Thank you to everyone who recycled and thank you to the community board for designating us. Thank you Sally. Thank you, your story. It's our story! Thank you! So Jim. If you want to go ahead with the presentation and I too am you know, like everyone, we're all very proud of Sally and the work she does, so you should have gotten two resolutions in the mail one of them. Nobody had any comment on and the other one we'll talk about in a moment the authorizing resolution. It turns out, as it says, that when we had our election actually it violated the bylaws. So we had this perfectly fair and wonderful election for assistant secretary, but you know so what we're doing is just affirming the results. So that's what that resolution is about this one and I can not imagine anyone has any problem with that. Correct I only received one resolution, so if you could share the screen with that, one, no I can't I, don't know how to do that on my iPad, basically yeah real quick, whereas on October 27th, 2020 community board Manhattan held an election for the office's assistant secretary using remote means and whereas the election used voting methods that were transparent and fair and its results were uncontested and whereas the conduct of the election, however, was not consistent with the bylaws of our community board and that they require in-person voting, therefore be it resolved. The community board. 12 Manhattan hereby affirms the results of the election for assistant secretary held in October. Okay, now, the other one and I'm working off of the copy that Wayne produced except I, would like two changes in it. That's the one that changes our bylaws so that we can have revoked remote voting when necessary and notice that they just it's one sentence or two whatever just sits in the bylaws and if God forbid there's another pandemic, then we don't have to change the bylaws. The wording is already there. Now. If you look at the well I'll, read the actual new wording and then I'll tell you the two changes, one that I would like, or the idea should be there. The original the beginning, an election by written ballot for board authors new, show be held during the executive session of the regular December general meeting of the board by the chairperson of the nominating committee. That's the original sentence. It was there except it had a typo in it. So that's why it's there again. Additionally, in the event that physical presence at meetings is not now Wayne used, the word aloud. The word that should be there is required. So when voting is not required, then we can vote this other way. Okay, so that's the one change I want in Wayne's. You know change and he goes on. For example, during an emergency decreed by the governor of the state of New York voting shall be permitted by okay and then we have any and all I don't want any and all I want. Just the word all, and let me explain what that's all about, because in 10 years we won't need it anymore. We actually, in fact, have members of this board that are not totally comfortable with all the electronic stuff and we have to make every accommodation possible so that we don't disenfranchise these people. So that's why it has to be all, and obviously they can't vote more than once, but they can use all of the methods, and one of them is of course using the app or website that we use like last time. The second thing, because nowhere are you, allowed to vote directly by email, because it's too easy to spoof here, you're going to send a copy of something signed. That's a picture, and you know there are other ways of verifying too. But that's what we're going to look at picture and we have board members who, when they're on zoom on their computer, might be able to take a picture of a ballot you know, but to switch to another app on their computer. You know so and then the bottom line. The key is that our election of officers is not secret anyway, because it's not allowed to be according to various regulations, including over meetings law. We just have this paper voting so that we, you know you don't get embarrassed to hear that nobody voted for you that night, you can go. You know the next day to see who to be mad at when you look at the list. But the point is since it's not a secret ballot anyway, and you re, if you really can't vote any other way, you can simply say who you're voting for and yes, people will hear, but that's a perfectly way of voting, and so those are changes I would like, and if there's any objection please let me know so we're going to change. The word where it says meeting is not allowed. That's going to be changed to meeting is not required. You know, presence at me and we're going to get rid of any and we're just going to leave the word all and that's my wrath, see any and can be. The whole thing is you have to see how people can infer what it says and if you say any and all it might imply to some future committee or something that they can pick a method? No at the moment, they can't pick a method they have to allow all these methods as an accommodation. Okay, so that's my rationale. Are there any questions? I have a question, certainly so I believe it's appropriate for the person who is voting to pick a method, so I would just like to make it very clear that well, of course, all of these methods are appropriate. Some language that says that makes it very clear that the board members who are voting should pick which of the three allowed methods how about the following. No person may vote more than once period. That's fine I mean anything that just makes that. Okay, when that's a nice short sentence, we'll just add it. Okay, the other thing that you yes also suggest is for those of us old farts who might be taking pictures of things on our phones. Texting is texting it to the is texting permitted if the like, if I'm, if can I, take a picture text it to Ebenezer or Paola who prints it out as opposed to emailing it. Okay, here's the complication there, it's not clear! Well, what I do when we don't have specifics, is I look at other parts of the law and not that I'm a lawyer and as far as I know, the business law doesn't allow that I absolutely doesn't allow you know voting by email, which is why we have to do this picture thing. But on the other hand the key is the picture, and so it would seem to me you know it's the picture which has your signature and such and it's the other piece of it is in both cases. This email or you know, text would come at the right time. If it comes, you know three days from now: it's not valid so I think I, don't have a problem with that. So then, can you say, and by submitting a photograph of a properly signed ballot immediately submitting a photograph just say bye-bye effects or electronic? You know conveyance or something like that. No I think we're going to be specific email or text when they have a new one. They can change the box. Okay. Of course, anyone else have any questions. Curtis I have a question yeah. How does this account for attendance, because people, only those who are in attendance of the meeting should be voting in the meeting? How does it? How does this account for that? Considering that people caught not attending could also send in an email or text message, and that is a very good point and that's covered by the you can't vote in general if you're not in a meeting okay. So, but to answer your specific point, what we did and I don't think we have to put all the words in there because it's semi-obvious I think. Basically, at the time the vote starts. You take attendance, which is what just think back what we did a month ago, because I think we did it very well. You take attendance, only those people and we know who they are, can vote, and they each of them can only vote once and anyone who wasn't present at that moment can not vote yeah. This is not a standalone, it's a modification to the bylaws, so it's part of the violence and the other parts of the bylaws will address attendance right. But you know again, there's not even nobody. You know you have to be there. Yes, you have to there's nothing in our bylaws that actually say that you have to be there. The reason- oh, no, that's actually that's in actually in the open meetings law and that's why you don't have to be there in person anymore right, but because the sorry Liz just to keep order right, because I had a question after Curtis and then so just to kind of also preface that the I don't want to say clause but line. Number two under elections is specific, that the nominating committee has to call the role of members and I think at another moment, and it doesn't have to be now or it can be Jim that we can edit that just to kind of unpack it a little bit in terms of because it condenses like by calling the role of members and shall verify that all ballots have been returned for tally and in the digital world we first call the role of members and then we give the ballot any point. My question was: do I just answer your preface for a second I think we can do that, but we don't have to do it now. The thing we have to do now is precisely this, so we can vote the way we vote and you know what you're suggesting I mean if I have time to do it or someone wants to do it, you know that's a nicety, but it you know the wording. Is there and it's been working all these years and the only difference is you know you don't have to be physically present, but you have to be electronically present at the meeting so right. You know sorry about that. No, it's! Okay! So my question, sorry, so my question is on the resolutions. It says by Pro by submitting a photograph of a properly signed ballot and we have had discussions about what constitutes a ballot. Okay, let me tell you again why I'm intentionally vague there and sometimes people you know, think: oh, you must always be precise and no, you must not open you know, but anyway, the reason I'm vague is let's say we can't get someone about they. You know they can't get emails, but they can still take pictures and stuff if they create a paper ballot with the various offices and write the names next to them and sign the bottom and date it and print their name. So we can read it. That is a valid ballot and that's why I said a picture of a ballot now in the old days and I think most at most. Well, many of you are too young to remember this in the old days when they required coupons to like get some free treat from some company. You could also do a reasonable facsimile and you could just draw one by hand, and that was okay. So basically, this is all accommodation. If we can't get you a ballot, you can vote anyway and the me you know the fact that the ballot is going to arrive at the right time and actually has your signature on it. You know, and your handwriting that that's you know that's a totally perfect way of validating it. So that's why I wanted that's. Why I'm vague like that? Does that answer your question Catherine? So maybe we'll have one or more so we can yeah. That's fine, yeah, okay, I'll see what's going on so that you have all the changes necessary. All the necessary changes right, Jim! Yes, I do and does anyone else have a question and yeah again: Yahoo Oc I have a question. Okay, I! Think that, in my view, I feel that it will be better. If we add something, I don't have the what you held in your hand: I don't have the that section in front of me, but to add something about that. The voting can only take place in the time when the nominating committee is running. The meeting I think that's basically inherent in the other words that are in the bylaws see. So this is as Wayne pointed out. This is an addition, and basically you know once the that. The reason why I'm saying that, let me just finish once the nominating committee closes the nominee you know closes the election, then they will not accept any more ballots right. It comes in after that. You know the reason why I'm saying that, because some people will have some issues with the tax doesn't come and there's a delay in the texting and so forth. So but again you the whole reason. You know, that's why you can make a hand ballot if you don't get the text and take a picture of that, and that will be fine, but you still have to text it right. Oh, if you can't text it, then you have to use another method, which is you can email it? You can fax it or you can actually tell us what your vote is or you can vote electronically. You know all these options. Are there okay? So the other thing is, you know, I, like keeping you know doing stuff with as few words as possible, and you know the simplest words possible because it makes it easier for more people to understand. So that's why you know I, but you know anyway, all righty so and I hope I'm not trying to railroad this. No, yes, I am no that's funny, but okay, I'd like to continue on with the district manager, Mr Smith. Thank you Jim extremely well throughout, and do we vote on these or I think we have to present it in the general meeting? Don't we well? No, we have to vote on them because they're coming from this committee, okay, so we have to do it now we may as well so we're going to have a motion to update to adopt the bylaws voting. Amendments I would well I. Think Jim's. Introduction of them is the motion, so a second okay and we could, if no it's simpler. If no one has any objection, then we can just approve both of them at once now and then the you know we just it's. The number of people you know with who voted is the people online? So if you second it so the second then is there. Does anyone have any other objections, nope all in favor aye? Basically, it's unanimous both of them great. Thank you thanks Jim solution to all of you. Thank you, okay, happiness. Your report. Thank you. Mr, chairman, always a pleasure to report as the district manager of Community, Ward 12. very quickly. I know time is of the essence. Today, the fiscal year 22 budget request submission was finalized last week. In our part, it happens that this year the Department of City planning requests from us that we have manually submit each one of the items to their system. We never done that before our job finished in the past, when we send the information to to then after the final ranking, and they take care of that. But this year, they've requested to us and demand from us that we need to submit it. So it was a lengthy process to enter each one of the items into the system and made the following correction. We submitted for the first time on November 6th Friday November 6th and on Monday I got a phone call that some corporation needed we've reviewed last week and Friday November 13. We had the final submission to the Department of City planning. Last week we received as well a notification from the controller's office requesting from us to or notifying us that they want to conduct an audit on the weight. You know how we comply with the open meeting law, it's very easy audit, but very precise, because what they want to find from us is if we comply with all the requirements or give a notification to people having an agenda and also having the appropriate recording, etc. So we have a few meetings. Last week we are already working on that. One part of the audit is also the website requirement as well. So we have been busy doing that the last week and this week, because we need to submit it before Friday this week, the document they requested and also last week we had several meetings regarding Covid-19 return or possible return or numbers going high, whatever you want to call it with the mayor's office and local elected officials. The mayor's office is asking our help and also is telling us the plans to do what are going to happen. What may happen etc, and they sent last Friday very late at night, a language that they asked us to send it out to the community to inform how to avoid or prevent Covid-19 to go up. Saturday morning we sent that email out and we sent it through the weekend with the title: how to prevent or how to stop Kovi 19 in New York City. Please review that and forward to your list, because this is the official warning of the protocol that the city wants us to follow in order to prevent the recovery 19 spike in our district at the zip code, 32 33 and 40 I have the numbers a little high. This is the end of my report. Is there any question? Wayne has a question: yeah Ebenezer. There is a matter that I know. Eleazar is familiar with, and probably Natalie as well. You may have been looped in D.O.T is undertaking road work on Riverside drive from 155th to 158, and they are proceeding somewhat. You know mindlessly to narrow the width, particularly in front of my building, 800 Riverside, so that if you have a car parked and a Fedex truck or anything that stops, you know to do unloading all of the traffic will be backed up and I know that Bruce Robertson who's on the traffic transportation committee have been trying to get them to focus on the fact that what they presented is not what they're building and that waiting to study the matter down. The road doesn't make sense if we're sending them photos. Now that you know based on the width of the median, they built they're going to be traffic backups. So the question is what can be done to stop DOT from mindlessly, proceeding with construction and address the issues that have been raised from the time they started construction? It's not that we said oops down the road from the time they marked the street. We said it looks like what they're going to build is too wide and they kept saying. Don't worry, it's not going to be as wide as you think. It's exactly as wide as we thought yeah. What and what I did was to put in a call to the Sinai Nest. The acting commissioner, the Ot commissioner, and they are looking into this matter. I think that there are some things that they're not really communicating. Clearly they're, not communicating clearly at all they're, not so they're, probably there's something happening between contractors and DOT, and that's what the breakdown of the communication is so we're trying to push it and pushing the envelope until we tell them look we're going to just go in there and just stop it. Just we're just going to go in there and start some commotion there. So that's what we are with it, we're just waiting for Jane Ginseng next, to give us a call back on that issue. Thank you. Lsr for I answered the question from Wayne. Yes, this situation is happening in several areas in the district I myself have been discussing this matter, marking and narrowing the street and making you know that almost then nobody can drive and I have that discussion regarding another location last in last month. This is service cabinet meeting I have the DC service company meeting this week and I will promise you I promise you that I'm going to follow up with them as well right request, yeah just to be clear because I, I'm not on the committee I did attend one of the presentations. There is a need to calm traffic at the intersections, particularly the intersection of Riverside 158. There would work because that's one of those five-way intersections why they decided to narrow the run of Riverside drive going between 155th and 1. You know, 58 is the question and why they're doing it in the way that they proposed is the question, because that is what is causing the backup, not the traffic calming for pedestrians at the intersections. I'm sorry, you just have the answer they're doing this because they want to make the street pedestrian the safety to improve. What I just said is that is the basic that they're saying right. But if you look at the way it is the way did the layout come out. It really is not appropriate because the traffic is backing up or whatever they did that around the office and really is almost impossible to drive around there right. So, if you look at the design, the work done to make the intersections narrower makes sense. Once you get away from the intersections, that's what's questioned yeah, they are actually doing the same kind of job at 192Nd, Street and Broadway. They because there's a big distance between a long distance between the post office and where you decide whether you take the train in the other side of Broadway. So what they did do was to almost haul to traffic for hours and hours, while they'll do the construction and just like in Rsd the trucks don't fit, so they have to come around Broadway almost and then virgin tonight they I don't at least you guys are protesting and making complaints about it. But yeah just I, don't know: what's I don't know, what's there I, don't know what they're doing yeah it's more than even just trucks. I mean one of our residents. Who's actually been in the building since the early 60s. If not the late 50s is in a wheelchair. Now he's not the only one. So he said if an ambulance or anything you know if they stop once again that will block the intersection he points out. That years ago we tried to have a loading zone established and we're told by DOT that was illegal, so I mean something has to get fixed. We're going to continue the pressure on that's just the best. We can do just put the pressure on moving forward, Gerard should I, say Gerard or Gerald Gerard. Thank you. So I got ta, get that Gerard. That's right: French, Gerard, Eli I'll. Let you keep the element just only you, though. Okay, so I actually have I have more of a clarification than an update. I did send an email out earlier and I'll, just basically kind of give that obstruct that, since becoming treasurer I created a basic Excel spreadsheet that the district manager would update each month to report fiscally a monthly actual and forecasted expenses, as they related to the budget, which would enable the Treasury to advise the board what funds might be available to be repurposed throughout each fiscal year. Should the board consider that as an option, this reporting is good practice, promotes transparency within the board and community and enables the board leadership and community to understand spending patterns throughout each fiscal year month by month. It's a modest request that builds trust and confidence within the board and community and a more consistent, timely submission of this requested information by our district manager on a monthly basis would be productive and constructive for the board. I sent this request out, November 2nd, which has basically been the request, since I became treasurer every month a week before I like the information, so I can review with the district manager. That's pretty consistently has not really happened so and I got a response. Friday November 15th at 509, so I don't really have an update, but I wanted to make that clarification. Just to kind of you know memorialize that this is something that I've been requesting since I started, and you know the committee and the community have asked for it, and you well deserve to get that. So that's my clarification, slash update! Thank you! That's all I have thanks. Thank you. Would you like to move along with Ozy's report? Okay, I thought we didn't have an answer, but okay, so the same for me, although I requested and probably more than once for sure the attendance sheet I never received that from the office all I have here is what I looked at from the September and October general meeting and also last month, when Wayne advised at the executive committee meeting of one member that didn't show up, I'm not sure if he did not show up more than once, or he did not show up just in October. So there was one member that did not show up for three meetings: two general meeting and at least one committee meeting I, don't know that I can name names right now, because we are not an executive session, but so Jim. So my request again, but I, don't mute myself. Okay, I, don't know that my question was I. Don't know that I can name names. Well, I'm answering your question. It turns out members attendance is public information and you can name the names okay, so Juan Guzman did not show up. At the last to general meeting and at least one land use committee meeting per Wayne's information that I received at the last executive meeting. The office does not send me the information about members. Attendance I did request it more than once, and so far I've so far received. Nothing. I also asked the previous Secretary Liz Reader for any information she may have, and she informed me that the office does not send out the information that she asked for. So it's a consistent pattern. I would like to get an answer for that. So what was your question so that you can get an answer? Why am I not getting the information that I'm asking? Which information is specific? Which information specifically because Paola is usually the person who handles attendance? Paul? Is there at the meeting? So is there something that you guys can discuss offline, although they have to be? No, we have to discuss it ethically. That decision I make, but is that something that can wait or that's something that you want to do it can not well I mean like I'm waiting for which person specifically do you want, so that I can ask her she's right there? It's not. There is one person that I know of that. Didn't not show up for three meetings and okay Paola. What can you do yourself? I, don't know. Maybe Liz can answer. I've never sent Liz any committee attendant since we've been doing virtual and she was able to track the attendance the way that I'm able to track. It is with the attendee report and kind of like more or less since I'm covering certain meetings. I know who's in there. So I can update my spreadsheet from what I see, but I have no idea how the previous secretary was recording attendance because I've never submitted anything previously. I was just yeah, no I wasn't, and that was part of my issue. I was tracking I was monitoring. The general meeting, attendance and I was monitoring the attendance of my own committee in my capacity as the chair of that committee, but I had repeatedly requested from the chair of the board clarification as to who was on what committees and I didn't bother to get the attendance at the various committees, because I never had clarity as to who was on the committees and after repeated attempts to get this information and to get clarity on who was on what committee and as of what date they were on what committee, so that I could map people's attendance with what they were supposed to have been doing. This is why I resigned as secretary. It wound up being a huge waste of my time, so I never got anywhere with it and I wish you the best of luck with all of that oc. Well, so I need to get back on a regular basis, and I would like to ask the office to for that information to me all right. So by Thursday. Not only will you get clarification that obviously after 10:11 months was not able to get for whatever reasons, but I'm sure that by Thursday you will get all the information that you need all right, everything's January ever since any documentation you need, you will get, not only clarification. You would also get the transparency that it requires for you to have, and I'm sure that you will, by the end of this week, I can put my word on that. So by the end of this week, you're saying that I will get the whatever it is. Just can I send me the email just send me the email. You send it to me, I'm trying to finish a sentence five times and I'm your interaction. I couldn't hear you, okay, I'm trying to finish my sentence for the fifth time and you're keep interrupting me. So I just want to make sure that we are all clear. So by the end of this week you are saying Eli that I will receive all the attendance that you know from the beginning of the year. Is that gives us a question right. I want to make sure that we are all on the same page, but are you, but you need to be clear on what you're asking me. So your question is, you know, am I going to be able to send you all the information that you request as far as attendance I just wanted you're not to no longer the secretary, so let me just handle it with her, so you're going to get anything that you request. My request is the attendance since January for all the members for all the committees that shouldn't be a problem. I would like to offer one important piece of information. It is it's great that you are going to send Lasar that you are going to send or are going to make sure that the office sends to oc the attendance for each of the committee meetings. That's crucial, but the other thing that's also important to have and without which oc is not going to be able to do the job that the bylaws requires her to do is to know for each month. What were the committee assignments because if I attend, you know Isidro's licensing committee on a particular month? That's fine! But since I'm not on his committee, I'm not obligated to attend. So if there's somebody who failed to attend a particular committee meeting, but they weren't assigned to that committee, then there's no negative effect to their attendance record. So Oc needs to be able to take not only the attendance of who attended what meetings, but the committee composition month by month, so that she can accurately map out who attended a meeting as compared to who was required to attend. That's what I meant, and that for me was the issue because I could get the attendance from the chairs. But there were many chairs who didn't know like. Is this guy on my committee or not? Is this person supposed to be showing up or not, and people would say: oh I didn't attend blah meeting because I'm not on that committee. But then when I would ask you is this person on that committee? You wouldn't get back to me so she's going to need to have not only the attendance but also the committee composition for every month, so she can map that out. Yes, you'll get that, but what should it? What should have happened, and that did that happen, and we used to do that when we had physical meetings is that you had two sign sheets. You had the sign sheet for board members and within the sign sheet, you said: if you are in a board member, we never really established that as to the difference that you're, referring to as to how a person that is just part of the board is just attending a meeting rather than being a committee member. That's what we're going to try and separate and give you obviously by the end of the week, is that is there anything else that you'd like to present today? I could just add one tiny little thing what's been done in the past is because people are on two committees. One of them is considered their primary committee and that's the one they have to attend properly. The other committee we're not quite as strict that's the way we've done it in the past. Now, that's nice to me! Well, that's! Well! Maybe we don't now and actually you know on one hand. Well that was well, don't shake your head Liz, because that was definitely was done in the past and you were not there in the past when it was done. Unless you have a time machine now, it may well be that now we do it differently and there's a perfect rationale for that as well and in fact it boosts the necessity of attending committees. So I now understand according to what you're saying Jim, then actually a member of a board does not have to does not is not required to attend more than one committee meeting. That is no, that's not correct. Can I just answer that? That's not what I said and in fact, based upon what Liz said, based upon how and she's been the second, she had been the secretary for a very long time and therefore she knows how this you know. These calculations are done. Based on what I understand from Liz, you have to attend both of your committee meetings and if your attendance is deficient at either of the committee meetings at which you should be attending, you will not. You know, you're not eligible to run for office. Is that correct Liz that is correct and I again. I totally understand that rationale. It pushes people to attend committee meetings, and so those are the rules you have to, but Liz's other point was: you have to make sure that the person is on the committee. If I'm not on committee- and I'm not- you know very good, so we're all that I know okay, but the whole primary committee secondary committee thing. That's tradition, that's not actually in the bylaws, so I know, while we don't do it. Okay, all right! So is that the end of your report so that we can move on yes for this month, I have my hand up for Rosie Paula. You and I have a meeting tomorrow. Wayne has his hands up. Oh, I'm sorry, I didn't hear it sorry Wayne my part yeah so and this, but this relates to both what you and Ozzy have been discussing for a bit. When I reported on attendance for land use, there was one thing that I believe Eliezer. You said you were going to clarify, although I have not seen an email clarifying, it Domingo pointed out that it was his understanding that when he became chair of business development, you know business development and the executive committee were his two required committees and that he was no longer on land use, but in even the most recent list of committee members he's still on the land use Committee, so he gets more absent. Every time he's not there, and so we need to know or confirm you know when he became chair of business development so assuming moving forward from that he was no longer on land use that should be confirmed and an email would be. Fine. Juan in fact did attend the November land use. Meeting and I. Don't remember what he said. The problem was before so maybe someone in the office could circle back to Juan to figure out what the problem was with his attendance earlier. But you know that is what was happening with land use, at least in terms of attempts. Yeah understood, yeah, that's something that we're going to have to backtrack, and since that was you brought it up locally and that's something that he'd have to officially send out an email, like you just said, and we'll sort it out and we'll go back. But that's what I brought up you know last month and I'm sure it's certainly easy to track when Domingo became chair of business development, so that we'll know moving forward, he shouldn't be marked absent from land use January, so we're going to actually Domingo you attended land use in January, yeah, correct and then I came to the realization that most of the chairs were only attending one committee and that's why? When I asked I'm like okay, so I'm going to three four minutes per month for the community board on top of my job, you know. So that's when I raised the question of hey. I'm attending four meetings a month, I thought I was only supposed to attend two and the general meeting, and that's why I think you know like streamline what, when we were saying if, at that point in the realization that you only have to attend the one committee, you will have to send an email saying that you would not longer be part of that committee, which is what we did not get. No I. Think Eliezer. You should just you know in response to my email, confirm that when Domingo became the year that, in which case business development and the executive became his two committees, if he wants to come to land use, that's fine but he's no longer a member. But that's the other thing you need to confirm, he's no longer a member. He came off the list, exactly that's correct! So unless you have a question yes to be, because you have a question too, I have a question to you so and just a general statement to be clear: I sent many emails on just this topic in January and in February about you know. I asked about you know: Kathy's committee membership and Domingo's committee membership because, as people rose to officers or to chairs and became members of the executive committee, they were I would think no longer obligated. So I think to be clear. You know you are the chair and it is only you as the chair who has the authority and the power within pursuant to our bylaws, to put people on committees. So I might, as a member say, hey I have class on Monday nights, so I can't be on traffic and transportation committee anymore. Can you please put me on another committee, but until you as the chair in consultation with the committee chairs, have that conversation and then say: oh Liz can't make Monday night, so I'm taking her off this committee and I'm putting her on something else. I can't as a member just like resign. So Domingo can say: I don't want to be on this committee anymore, but it's not until you say: okay you're, not on this committee anymore. That Domingo is there not on the committee. So the question is my I. Guess it's more of a statement that this is why it's so important for you to communicate in writing what the committee composition is and also to let people know that they can't just resign from a committee at their convenience, because that's an authority and a power that's invested only in you as the chair. That's your statement. Yeah, but I got something to say about that, though, because it's under this, what I see is a whole bunch of older people. Who've been in the community boy board who exploit the fact that they're chairs of one commit of one committee and don't attend others right they visit. Others I think it's extremely important to note that same level of understanding should be shared amongst other individuals. I did raise it to Elias Right. The new committee assignments were sent out, but I was still a bit confused around all right. How is it that you have all these in the all these different chairs and all of them are attending one meeting and you know so I did raise it then Elias, two weeks later Covid-19 happened, you know so then it was juggling to go virtual this and that so I don't want people to make the assumption that I chose not to attend land use right, because that's the same way, I could make the assumption that, just because a new chair came in and you've been going to one committee, your whole life right, the whole 50 years you've been on the board, I'm making that I have made that assumption. You know so. I just want to be very clear on that: okay, the again there's a bunch of perceptions and misconceptions made by the fact that we will address it Paola. We have a lot of work ahead of us and we'll make sure that Ozil gets the information. We've sent many occasions that the rosters and the updated rosters, but some people get it. Obviously, some people have not, and that's okay I just want to put in a good new member orientation and making sure that we communicate exactly precisely because you know the committees that you're required to attend that's critical information precisely that is and should be shared at new member orientation, but also I mean in the past. When we were, you know, assigned to you know the board by the borough president I mean Scott Stringer made it very clear that you're required to attend. You know two meetings and you know if you didn't do that. It was his expectation that when you came up for renewal, you would not be on the board. Okay. So we're going to move along to our review of our calendars for December, 2020 and January 2021. Does anyone as I'm sure that all of us got those emails? Does anyone do not does anyone is missing? Is anyone missing the calendars that were sent out earlier? So, let's begin with December 2020, I'm assuming that we all have them? Does anyone have any changes that they'd like to make for the December 20. answer? Is no January 2021 actually I have a question for Faye if she's still on yeah at the last month or whatever, was there a discussion in December of moving youth in education, because right now in December, youth and education is happening the day before the general meeting you're muted? Can you Paula? Can you unmute her? Yes, I'm sorry, thank you and to repeat the question. You say that my committee has the meeting and good evening everyone before anything else. No I was saying Faye that I think at last month's exec committee meeting there was a discussion of whether the youth and Education Committee, which is scheduled for the 14th, should move to the prior week because in December because of holidays, the general meeting is on the 15th. So if you need to do minutes or resolutions or anything, you have no time between the 15th, the 14th and the 15th. Actually, that's a great observation which I didn't you know, thought about it's just the day before exactly well, and you know what I actually already confronted with one of the local school that wanted to present and I told them that you know it's going to be on the 14th. Well, I! Guess if I can pause and then get back, I can't I. Don't think that I can answer that question right now, but maybe I will definitely by tomorrow morning send an email and yeah so many emails. But then because you got a great point and I thank you for bringing that up, but I don't know I, I'm not exactly. You know, I'm not sure I can answer that question right now, because it's if I answer to you yes doesn't mean I'm taking the decision for the rest of the Cali as well. So just bear with me then in the morning sometime before no let's say hopefully, if they answer, because sometimes they take long to answer so, but we will think about it and thank you for bringing that up. So we should we could have it. Let me ask you: let me allow me just to ask because what would be the case in the last scenario because we're not even going to have a a minutes, you know wow, then that's the point. You wouldn't have time to do minutes between Monday and Tuesday. Unless you did it all night long, but hey, you can send any the way that you've been doing it and copy me send out an email to your members to your colleagues. Have them give us a date about the general meeting, then we'll have it sorted out? It's not that difficult! It's not that we adapted them today either. All you have to do is just have clear. That is your data and you want to change it standard procedure. That's not nothing out of the ordinary! So just a very last question, so the the general meeting is something that we are going to discuss today or not. Necessarily. This is a done deal we're going to have dinner meeting on the 15 right. Definitely it's a set day already. I think we said another one, the 15th you know two months ago. Well, I guess I've been somewhere in the cloud, but thank you all right. Okay, thank you, Wayne all right thanks in December 2021, this is January 2021 for January 2021. Does anyone have any objections? Any changes that they like to make yeah can I just make on the 17th it should go. It should read a district service cabinet meeting. The word we keep leaving out the word cabinet- and it should also be added to this- should also be added to the entry on January. The 21st thanks, Steve you're. Almost correction should be in both December and January at district Cabinet Service, yes, District, Service, cabinet, okay, so we're good and can I just on in I'm listed here as having my committee meeting on January, the 14th I. Don't see any reason why it shouldn't adhere to the regular schedule, the first Thursday on the seventh I. Don't know why I'm down for the 14th? Would you like to have it on keep it on the seventh? This is not a problem. One is at 10 8:10 30 a.m, which is marriage and then housing and health yeah I mean if it doesn't I mean yeah I know. Is there a reason? I was moved to the second Thursday. Now that I know of no all right well, I think the rule of thumb is that we should keep to the regular schedule unless there's a compelling reason not to okay. So move you back to Thursday the seventh right, seven pm same time. Okay, it's been easier. Please make note of it. Okay, so we're going to move on to our committed report, Faye and Nadiel, I'd like to the both of you to congratulate you on that extremely well-run, with great panelists, a lot of information forum that you guys had. It was extremely grateful to see and your colleagues for that moment what happened? There is really something that should be replicated what you guys, the both of you guys today, I'm I, really I was honored and thank you Faye for allowing me to be part of it and the panelists were sensational. You know it was just a great overall well thought out and executed forum. So again, you know I couldn't be more proud of you and not yet, and with that introduction, I'd like to be the first one to have your report in front of us. Thank you. Well, Mr, Chairman, thank you, I, think your surprising, you know, or certain appearance, and that panel was very much appreciated and I think this is something that I hope that you do more often you know, and yes, it was highly appreciated. This is a conversation, as many of you know that this is part two of the homelessness and mental health event. Actually we did that back in 2017 and most of the panelists were there, with the exception of two of them that unfortunately weren't able to join us, but, as you already have witnessed, we have folks from the legal aid society one of the attorney which actually part of her concentration, of work close with the homelessness right project. For that particular institution. We also have Miss Battino, who is someone well known in the community, and she actually well acquainted with the the root of the problems, not only in the area of homelessness, but also, you know in terms of education, mental health and anything that touched the life of any student so or our students. So many of you know Miss Matinos. We also had gratefully intense to Ariel, who actually invited Denis Daniel Farrell, who is the vice president for the homelessness prevention? He he's also, he was representing the held the U.S I. Don't want to elaborate much because I know for the tiny assassin in this case, but I also wanted to go and record for the, and they know that the assistant commissioner for the vulnerable and special need for youth division run away in homelessness use services from the department of DYCD who also supported this event. For second time. He also was there and of course, we have Colombia as usual, at Night Columbia about privacy and hospital all the way you know supporting us. So this time we also have Sharon Kim, who is the program manager for the uptown cult and for the vision of community and population helper estate, and all these folks did a great fantastic job. I probably want to thank all of them and I wanted just to briefly say that they really touch or elaborated and the subject of homelessness and one of the things that I think is really stand out many times and the area of mental health, the impact and the the terrible. You know, situation in shelters and with the double loss. Student and shelters are just students that are missing a lot of classes. You know having problem getting equipment also and turn on the other homelessness and mental Health. Ms Matino I believe that she also brought up something that I really captivated my attention where you say that whether the school decide to go in person or not, you know, but they should increase the the personnel the deal so like with you know the mental health to provide more assistance for those students and basically, what else should I tell you, because you can see in what awakening assets. You know YouTube video, but one thing that I think is equally important. That I mentioned is I'm working and and elaborating a report which is going to be part of the con will not well part of the conversation of you know the initial information that some of these analysts brought into this conversation and also many information that, unfortunately, they were not able to share with the community because of the time but again I. Thank you all Mr Chairman thank you and Ariel I thank the housing and Human Services Committee I think they did a great job and join up and I wish that more committee, you know unify themselves and do things you know like that, because I think it's important. So this is my report and I. Thank you all. Thank you. So much Faye for, if I bring in so much yeah, go ahead. Sorry, bro yeah. He I think Catherine said that someone had a question for Faye. Is that what you said cat yeah? Yes, who was that Steve Simon? Oh Steve Simon, yes, yeah I just want to say, following up on your last comment, Fei, that my committee stands open to work with you on the mental health issue at any time. So, if you want to bring us in on it, we would certainly be open to working with you. Well, we have done that before and I certainly appreciate very much I highly respect the work you're doing, and then this especially when it comes to mental health. Yes, absolutely I! Guess this time, I'm sorry that oh I apologize to you that didn't occur with me. You know, since I was so much focused on homelessness. Looking at the the housing committee, because the first time that's what we did, it was more about homelessness. More than mental health, I should say, but yes and the next segment that we present about mental health, definitely I would love to have it with your community, against which we may have a second part with you. Thank you. Steve I appreciate it. Okay, very good I'll, just very briefly mention at the ending of that town hall. We then transitioned into pretty much discussing new business in the committee or between both committees rather, and we had a resolution that came out. I can't say this without enough stress in on my own part, my laptop literally just I guess battery just died on me last night, I'm a graduate student, so I, I'm more stressed than you can imagine right now, wow, but I wish I could send I can send you all the resolution so that you would have been able to see it. I could have read it. It was I think it was very well received it passed unanimously. I'm going to be working on getting a new battery for my laptop within the next few days. Hopefully, I can get it out to everyone shortly, but yeah, so I'm thankfully using my family's laptop for the time being, but that is unfortunately on my regular laptop I'll. Bring you one tomorrow, bro if I may I have a question for Ariel. Just briefly, Ariel I just wanted to highlight the importance of this resolution at the title. To that you add that this is a joint resolution that is important. Yes and I was just very happy to be able to work with both the housing human services, as well as the youth and Education Committee. Moving forward it hit on I mean I tried to get as much as I, possibly could I think there was even the conversation going it was like. Is this too much to put into one? So you know there's clearly just so much that can be done. I look forward to continuing to do this work, addressing these issues that particularly are affecting a lot of our youth, and you know I'm again just thankful to have had this opportunity so yeah, that's our joint update. Thank you too. Thank you guys, thank you so much for bringing so much positivism. The next report is Bart's list. Thanks, Ariel, I'm so sorry about your computer. That's really stressful, oh anyway, so I will have minutes for you all to review and I. Welcome you to do that. The two main takeaways to share are that we will be having as a as an item on our agenda going forward. We have really robust preliminary conversation about the possibility of renaming Bennett Park and how we name other parks as well and who we're honoring with with place names, and we thought, although there's a lot of support for the idea of reconsidering the name of Bennett Park, just a little bit of background that as it turns out, James Gordon Bennett was a flagrant racist, so maybe having a park that honors him not the best idea, but to rename a place is a big deal and not something that should be done lightly. In the course of one meeting, it should be done as part of a robust conversa public conversation where there's a lot of advertising of the fact that meeting is happening so that people know that they should attend it. If that's something that they care about and to provide people an opportunity on how to weigh in on that topic. So that would be part of an ongoing discussion over the next several months in committee. The other big thing that happened at our committee was, we heard a presentation from some folks at the Parks Department about a substantial project to restore and renovate the portion of the retaining wall in Amelia Gorman Park that collapsed it's over on broadway across from the Ortiz funeral home. We have a resolution in support of that proposed project. There's a lot of detail on it that I'm not going to share with you now, but it was utterly uncontroversial and had unanimous support and I would anticipate that the resolution will enjoy unanimous support from the full board as well and you'll have all of that in your inboxes by the end of the week. Thanks once more any questions, does anyone have any questions for this writer? No Sally has a question. Sally has a question, so my question was I, guess for Faye, because I didn't understand either. I did listen to that call, but I didn't understand why the health committee wasn't part of I'm just going to hop in. Since that's not a question for me, I'm going to hop off the call since I have this other obligation at eight o'clock. Thank you very much. It seemed odd to me to tell you the truth that the two committees would organize something that talked about mental health and not include the third committee in it or any resolution that has to do with mental health care. I mean that is you know. Housing is health care all this impacts health care and, if it's not considered by the health committee, that seems like an oversight so I guess it's more common than a question, but I hope that in the future that doesn't happen again well. Sally allow me just to because this is about. You know my comedian, the work that we are doing. This is the second part or an event that we conducted back in 2017 when my committee did the mental only specifically mental health, that the first time that we discussed that which was at the we had a plan on Isabella the Saturday Meeting Steve graciously attend that meeting and he immediately picked on that subject. So we decided to go a second to have a second part in mental health and that mental health second part. Our committee did it in conjunction with his committee, so we have done work with him. This is homelessness related to help. Let me I think so. I think allow me please excuse me, because I don't really like to talk too much, but when I have to so I need to clarify this. Yes, we have worked with a Steve Committee before and I. Don't think that necessarily is anything wrong with involving I just get back to the housing committee. This time and Steve know that we would but no I would I just don't understand. Why would it be the back and forth Sally? This is the executive committee and we were gracious enough to allow Sally to come in and ask a question but I think to keep order and I think that you guys have been here longer than I have understand as an executive committee. Those questions are not. This is not the space. So if you just give an answer, Sally you can talk offline. So the next report- Wayne Benjamin, please ah thank you. Lazar and yeah I too feel for Ariel and his laptop dying. Although I will say when I was in grad school, the use of personal computers was not widespread, but I did have my typewriter ribbon. You know kind of fade, and so my professor thought that the gray font on the gray paper was terribly elegant, but that was not the intent is that the ink was running out anyway, land use. Had we had four agenda points. We had a conversation with Ann Friedman from the New York City Landmarks Conservancy, which is not the Landmarks Preservation Commission. The conservancy is a non-profit that advocates for preservation and, unlike the LPC, the conservancy has a low interest loan program. They have a technical assistance program, they have a sacred sites program, they have an emergency loan program and you know they also pointed out that the designation of buildings also make them eligible, for you know, a range of grants. We also discussed that you know National register listing the work required to do that. You know will typically, it will cost five thousand dollars to hire consultant to do that, but through Columbia, University, Andrew, Dolkhart's preservation course I think each year they request from you know various stakeholders a wish list for projects to work on, and you know the students will in fact work on a project and the designation of holy root church. In you know, our district is in fact one of the projects that got designated through the work of you know their students. We then transitioned into an update on the status of the development at 857 Riverside drive, which we've discussed at the previous executive committee and general meetings. One of the interesting things that we learned is you know in addition to the building, you know being a you know, a mid 19th century building. It is the only remaining building of what once was an abolitionist colony in that area. It was built by a hero of the underground, railroad and subsequently owned by a judge who was also you know, active. You know in the anti-slavery movement and based upon further research, the you know, neighborhood residents who've been doing the research put in a request for evaluation to landmarks to designate the building not based upon the architecture, because the street facade has unfortunately been unsympathetically changed, but based upon the history and culture and New York City's preservation law recognizes the architectural, historical and cultural merit, not just architectural. We then- and this is just a mild point- we circulated in the last meeting draft minutes from the September land use meeting. We reviewed them. There were no changes, so they are final I. Don't think, there's any need for us to send you yet another set, because there were no changes. We then had a a presentation by Sean Rickenbacker of the bond center and it was to give us some insights on how we might proceed with updating the neighborhood planning and land use study that we completed in 2007 and one of the things that Sean pointed out. That I think was really important, he's familiar with the study, but what they did for CB9 more recently was to create a live platform that pulls together a lot of data and allows you to model. You know potential projects on that platform. So, instead of having an updated static planning model, they now have a CB9, specific platform, digital platform that allowed them to look at. You know land use and planning and zoning issues. You know in real time and I think that is something we absolutely positively. You know want to have for CB12 as well. I think it is, you know in the 21st century, having you know a paper document, as our planning you know, dual planning model is not the way to go. I think the idea of having a c12 tailored platform that allows us to you know pull in data that is readily available, but it's in multiple sources bring it into our platform and allow us to look at what does it mean if we do zoning of X, Y or z? What does it mean if this project gets built is something that is, you know, would be an invaluable tool and Sean had to leave the meeting, but we are going to schedule time for him to give us a more detailed presentation of the capability of the platform they created for CB9 to discuss how in fact you know they can, you know, do it for CB12 and the point is once they develop it they hand it off to us. It is ours to use as we see fit, and you know that's my report. Thank you, William. Are there any questions? I missed it? Can you repeat who the team that built the platform is with Sean Rickenbacker? He is the director of City College's bond center for just futures, just urban futures I believe it's called thank you. Did they leave a presentation? Wayne, that's handily available, you think I don't I have to check, but what we would have is the CB9 platform and that may be available online. Okay is that is it on their website or well? It probably is on CB 9's website, because it's their platform he presented to us I, think a powerpoint, but he's going to come back and present it in more detail and I can ask him if he could send us what he shared at the language committee yeah. So we can put it in our website and put in motive yeah. Well, we don't want to put. We don't want to put the CB9 platform in ours because it was tailored to CB9. We want them to tailor one to CB. 12. placement, 12. okay, got it understood Katherine! Does that satisfy your question? Yes, okay, good and I. Think it's also be a you know. Great use of you know our tech savvy people, because it is, you know once again it's a tool that we use, so they will train folks in on the board or in the office to use it. But it's not something where we go back to them and say: can you do this for us? Can you do that for it's hours? Oh great hours put us in contact so that we can have protect people well, as I said, they will be coming back to the land use committee. To give us a more detailed presentation, I'll make sure that you know it probably will not be December, although it may be, but I'll, let you know so that folks can attend once again. Thank you. If you want to build yourself fake Mary, next I'll meet yourself, Mary got it no I said I thought Steve was next. Okay I'll go. We have I'm willing to go after you Mary. It's kind of you I really appreciate that. Well, it's consistent with the resolution we passed, giving preference to seniors. Oh I'm holding it. I'm seeing you wait a minute Steve you just spoiled it man yeah, but forget it I yeah! It doesn't work, I'm sorry! Okay! So we had a lively discussion at our last meeting. Everybody was very happy with the budget. The capital budget results and also the fact that the mental health issue on Steve's committee ranked number one from the board, and that, of course, was due to our input into that item. See what we could do together? So you know that was a good thing. We've had a lot of discussions about how we can begin to involve seniors in the community in tuning in to the asian Committee meetings, we're working at least I'm trying to work alongside the senior centers who are not having programs they're, not open, but they're having virtual programs for the or their constituents. You know for their members, and there are a few seniors that are able to you, know, get and tune into their those programs, so we're hoping to work with them to get their seniors to. You know join with the aging committee as well. We talked a lot about issues that we want to discuss at upcoming meetings and in December. We're going to have Carmen de La Rosa be presenting two bills that she's involved with sponsoring that have to do our issues with seniors. One is a bill that relates to patrol parole, eligibility for certain inmates, age, 55 and older, and the second one relates to increasing penalties for offenses committed against elderly persons, so she will be presenting at the December meeting and since that meeting Eleazar has been instrumental in helping to set up on Thursday this Thursday a press release press conference, which will be in the plaza at 175Th street, which also happens to be the last day of the farmers market with grow NYC, and the reason that we decided to want to have there is because grow. Nyc has been the one consistent organization in this community, where there's one farmer that takes up about half of the plaza and that farmer has always long lines going to their tables and they have one of the grow. Nyc people staff that particular farmers tables allowing seniors and disabled to come to the head of the line. So I want to give a shout out to this particular lady while we're there as well so Idonis Rodriguez will be there and I understand from Eleazar that he's really gung-Ho about this resolution. We also have some media coming in Channel, one Univision, I'm trying to get a hold of somebody from patch I got information about who to contact on and then also and I'm hoping guys that some of you will be able to come to that presentation on Thursday 12 noon. Ellie. Will you be there yeah of course, yeah I'd like to be her bodyguard? That's an old light deal sit in the back and protect you because you're going to get all the media attention that day, Mary Right and and does the green walk? Does the green market know that you're coming not yet because we didn't make these decisions until after Thursday, you know and I didn't want to. You know, give them information, but what I'm going to do is I'm going to go over there early Thursday and talk to growing when I see people and let them know what's going on I know there will be fewer farmers, because it's the last day, so you know, as far as the area goes I think we'll be okay, all right, so this is Thursday at noon right. Yes, all right, I may reach out to my contact there as well. Okay, you have a relationship with Miss Guerrero at Whitic, any of you Steve, not really, but so yeah. That's not a bad idea to invite her as well yeah. So I'm going to reach out to her see if Ebenezer is not her number and contact her, so she could come Faye I think you have a question for Mary. This is your time before. Steve goes on with this presentation. Thank you, hi Mary, how you doing I'm good Mary since December is coming. You know it's just around the corner. I've been thinking about our annual holiday activity for Isabella I know this year. Maybe something rough tough. You know, but I think I can improvise something very nice. So I just wanted to put that ball in your courtyard. So you give you some thought. I don't know if you might be willing to maybe to do that. What do you think? Why? Don't you give me a call and we can discuss it offline because you know there's nobody's allowed in? Yes, no, but we can do something virtual, but you know what just you give me a call, because I think it's easy for you to reach out to me than me to reach out to you. Okay, let me go whenever you know. You have the time, no problem. Okay, can't the patients be on the other side of the window and see what's going on outside, wouldn't that be loud only one at a time, oh really, with a family visitor, oh okay, we can do something around the launch or dinner time. Yeah I, don't know, we'll see we'll talk about it. Yes, Domingo I'd, love to see you there. If you can on Thursday count me in all right cool because you're out there in the business association, the business world is Cedric's not on the call tonight right because he had you know anyway. So anybody else that can make it please do I'd, love the moral support. This is my first attempt at doing anything like this, so you know I really need you know, let's get it married and try to bring some kids too we're going to pack the house. No, you don't want to pack the house. No, we don't want to pack the house, so this is yeah. Sorry wait! What ahead of myself! Thank you for the checkup. Oh Steve, where's, yours, man, all right, okay, okay, I just want to say it a couple of things off of Mary's report. Maybe I should talk to you at further lens at some point, but on your capital budget item, which we reiterate year after year about yes, I'd like big Mac. Excuse me the order. What Domingo please mute yourself or order for the rest of us. He made me hungry man, yeah god, I hope he's not ordering healthy food, for somebody am I still on yes, okay, so Ed Mary every year we keep saying that we want renovations made to the senior centers to comply with ADA and diff to regulations. But my recommendation to you and your committee is that you, you gr you dive into this more specifically and find out what exactly does each one of our senior centers need? Well, we should compile a more detailed list we can present to to the council members and to the borough. President, because this is very general and we should give them more guidance on what it is that they should fund to benefit our senior centers, okay and and we're, and with respect to the green market at 175th street in all humility, I was the one who suggested around 1980 that the green market expand and locate at 175Th street when I worked for the former city council member, so I take great pride in the fact that green market is still there and I'm very happy that it's there, because it's written that's the one I go to all every you know every week. Well, I was thinking of you for 40 years ago in 1980. I'm sure you were that's about the time. I moved up to this. Well, actually, it was 78 when I moved up here, so okay, well, yeah I was a little behind okay. So moving along the love, fest, okay for the healthy environment for the health and Environment Committee I have three points there. You go first of all on Covid-19 there's some real concern about the fact that our positivity rates in the three of our four zip codes are are in the are above the line: they're excessive, but they're above the threshold for the seven days ending last Friday, the positivity rate in the zip code. 40 was it 4.61, representing 49 new cases in zip codes and so zip code. 40 is the 16th worst zip code in in the city at large out of 177 zip codes. They rank zipcode40x as number 16. zip code. 33 ranks as number 46. Its positivity rate for that week was 3.66 with 57 new cases, zip code, 32 ranked says: number 70. It's a positivity rate at 2.97 percent, 54 new cases and zip code. 34 is ranks at 133. It's the only one under the two percent threshold. It's at one point: eight six percent with 40 new cases. So in that one week alone, in our district, we had 200 new cases of Covid-19, which is a much more, which is a real uptick, for instance over the over the month of October, where we had maybe 428 cases between October, 1st and November, the 5th and now in just so that was just a little more than a month. We had 428 cases, and now, in just one week we had 200 and three of our four zip codes, as I mentioned, are, are well above the two percent threshold, and two of them are well above the three percent threshold which, as you know, is being used as the as the guide to figure out whether or not the schools should be closed down. So at the moment, this is not looking good. My second point is that my resolute, my committee passed a resolution on calling upon the city to increase its efforts next year to control the proliferation of fireworks. This is a resolution I previously mentioned to Curtis. That I would like to have as a joint resolution between our two committees. So I'm not forwarding the resolution to the General Board meeting and at this November I will be passing it on to Curtis, in the hope that his committee will will jointly support that resolution. Finally, my committee was was given a presentation by the corner project which, as most of you probably know, has not been able to find a permanent space in our community, since it lost its location on 181St street in Saint Nicholas back in 2018. They have since been operating out of a van on Amsterdam avenue alongside Highbridge park and they're, still looking for a permanent location but have have not had any success. So they now have a plan to establish what they're calling the village, which would be comprised of five trailers on the east side of Amsterdam Avenue between 177th and 178th streets. They would occupy 10 parking spaces and they would be able to then provide a wider range of services, health services. They would have be able to reinstate their drop-in center. They would be able to increase their, they would be able to have public bathrooms. They would increase their staffing by 100 their services and programs by 150 their hours of operation by 60 percent and my committee had we had a pretty full discussion about this plan and they would be they would be authorized to have the trailers on Amsterdam Avenue by virtue of obtaining a permit through the street activities permit office which they have yet to apply for, and they are telling me that SAPO the street activity permits office has asked them to present the this proposal before the full board. We had thought that they could present to the executive committee tonight, but as it turns out, they weren't even available for that, but but they're telling me that sample wants them to come before the full board so that they can and they want us to sign off on the application. So I don't know what the I'm wondering, what the exact, what the thought is. Thoughts are of the executive committee members, but Eliezer. Do we have a room on the agenda for November to allow them to make a a full presentation? You know they would have to take at least I would think about. 15 minutes or more to to show us their full presentation. They have a powerpoint which I can forward to everybody to everybody on the executive committee, so they can see it ahead of time. We can send it to all the board members. At a time. Yeah I mean it's a great opportunity for the board, the general Public Rosita, Romero and Wdc up in Dr Premierelli, the people in 176Th street, the sport leagues, the basketball, leagues and all the people that belong in that ecosystem to come in and hear the presentation and express their opinions. Just we do with the liquid licenses, so yeah I think it's a great chance for people. So you want to you'll put this on the General Board agenda for the 24th. More than definitely yes, okay, all right, fine, okay, I'll, let them know but you're going to have to be prepared to you know to you, know, to set aside a fair amount of time for their presentation and then I'm sure, what's going to going to be a a pretty, what might be a lengthy discussion afterwards, it's going to take if it's going to take that much or that long, yeah I think that we have to get through it and just make it wholesome, and so people can be part of it. You know the community has to hear and community has to be part of it. The whole process, all right, very good, have a question yeah at the end of his presentation: yeah, no I, didn't no! That's fine! I! Guess! Because I have another question too. I was just hoping that maybe ebony is a good double check with Sappo to find out. If, if sample is the status of the application, yes and whether sample was actually going to be is going to depend upon the what weight sample will give to the recommendation of the community board all right so Domingo, you want to shoot first, because I have a question on his on Steve's numbers and the Covid-19 numbers. Okay, I actually have a recommendation for location for their village. Looking at for try on before entering the park, there's a huge influx of spaces that could potentially be taken to set up a village, just a recommendation as to alternate locations of where the village could be placed. Okay- and my question is Steve on your numbers right- is there a correlation as to why there are less people in the emergency rooms? But yet the numbers are higher. What seems to be the connectivity or relations between those two numbers? Well, I. Don't know how do we know that? Are you sure that there are fewer people going to the er last time, I checked yeah, especially what I see on the newspapers and the news on the cable channel I mean well I. Tell you I, don't know because we're not getting those reports from from the hospital, so I have no idea. What's going on at the hospital I wish, we were getting those reports, but we're not so the these are. These are not necessarily people who are being hospitalized or or who who are seeking. You know medication at the ers. These are people who are just being tested. I mean that's a good question as to how are they? How are they being referred once they get a once they get their test result I'll ask a DOH what happens at that point? Okay, thank you! So much Steve, okay, but this is these- are some of the worst numbers I've seen. So this is an issue and and I think we also have to figure out a role for the community board to play in helping to spread the word to people that they have to be careful. They have to. They have to wear masks, they have to observe social distancing, they have to wash their hands, they have to stay home as much as they can. It can only what they you know. What they've been saying is that can only it can only get worse as the weather gets colder yeah and as people remain indoors, yeah we'll use Thursday's press conference or media release as an opportunity to start voicing that opinion and continue to those of us who can I, don't know I, don't yeah, you could possibly do that, but I think let's talk some more because it may require. Maybe a separate outreach. Okay, good all right, so we'll tell we'll shoot tomorrow. We'll I'll give you a call tomorrow, very good guy through this all right. Okay, thanks Debbie in the vaping is she there I haven't seen her I have a question for Steve I raised my hand like a few minutes ago: Steve, yes, Miss, Canada, okay, what's is there an update about Isabella cases in Isabella? Yeah Isabel has been doing very well for the last several reporting periods, I didn't check. The I didn't check their figures today, but for the last three or four weeks they've had, according to the reports that they found with the state Health department, they've, had no additional Covid-19 deaths, either presumed or were confirmed over 19 deaths and Betty's reported to us that they haven't had any any reported illnesses. So the so I mean somebody had asked me whether or not the increase in zip code 40 could be attributable to the nursing home, but that doesn't appear to be the case not anymore. Are you satisfied with his answers? Aussie or just this yeah, all right so Steph? Is she there or is Omar going to make make a presentation on her behalf? Well, I'll tell you what I'm going to get off the call for a moment, I'm going to check the State Health department, figures and I'll come back to let you know whether Isabella has remained the same for the last week. Thanks can you promote Omar, maybe he's the one who's going to be making, because I was unaware that David wasn't going to make it today. So, while we're doing that, I forgot to mention in my report that the committee passed a resolution supporting the request submitted to LPC to designate 857, so that resolution will be presented to the full board. Oh great, so Curtis Man, hey do yours! Thank you very much. So we had a very fruitful conversation and some of the same issues that have been happening over the past few months are continuously on the rise, if not more. The glas, which is the auto theft as well as commercial burglaries, have also been up the for the last 28 day period. Our officers reported on that information and also encouraged us to inform people to lock their doors when they're going inside for small purchases. The second thing was: was our discussion on the furious Act Senator Brad Holman presented a legislation that he has in Albany, which is to have more speed cameras in areas where there's a high level of drag racing or other speeding. It's called the furious act, so I invited him to speak. Senator Jackson is a co-sponsor of that legislation, as well as Carmen De, La Rosa, and they also shared their reasons for supporting this legislation. It is one in which it would allow for speed cameras to be used outside their normal hours of operation, for example, in school zone. They're operating from 10 o'clock just to 9 pm I believe so this piece of legislation would allow for the city to expand the use of the speed cameras and also have them in operation over the weekend. So one of the big pieces, or the big reasons, I felt it was important for us to discuss this at the community board level. Obviously, we had a lot of concerns over drag racing and speeding in the community, so I felt it was a great opportunity for us to weigh in on that issue and also ensure that when the decision is made on with speed cameras to use we're not advocating for them all to be used, 24 hours a day and seven days a week, we want to be engaged or actively giving them advice on which speed cameras should be used in which areas based on the data we receive from whatever sources. We also want to advocate in that in the resolution that we voted on to include data from the transit divisions as well. So that's that was the bulk of our conversation, the furious act, so we did pass a resolution that will be presenting to the general body next week and for December. We are going to be inviting the fire department in to give us a presentation on their winter safety issues and concerns. That concludes my report. I have a question. Yes, Sir, hey Curtis! My question is more around the fierce act. So is the cameras managed by the NYPD, because, from my understanding, speed cameras is a state, it's not necessarily city right. They are not managed by the NYPD at all. No, so there's no there's currently, no only thing that I'm trying to include in a resolution is a coordination on like who makes a decision on which cameras to use and if the legislation currently actually mentions community boards that there needs to be a public hearing on which cameras to use, we don't want to have every camera. That's available now to be used in a successor, so I included that, because I wanted to make sure that they knew that we were advocating not just blankly for the legislation, but particularly for the cameras in certain areas that we know there to be, and one thing to be conscious about also is how ice and a lot of these, like federal agencies, actually do a data grabs that include like a lot of these surveillance cameras, just putting it out there, yeah so I believe the city, so you're saying I have to double check on who has authority over the cameras in front of New York over the school, because these are the cameras that are currently in school zones and they're there for speeding purposes. So I'll have to do some due diligence to find out exactly who has authority and access to them. Obviously, if there is a crime, then the footage could be requested, although it's very grainy footage, but if there isn't a situation where the NYPD would have to request the camera footage for that corner, then I think they would probably have some authority to do so. All right cool now I was just putting it out there, because I was looking into it and a lot of the speed cameras are under a state like I, would I wouldn't say, like surveillance, you know: okay, well, there they're authorized by the state, but I'm pretty sure they're operated by the city, yeah, that the legislation does authorize the city to operate yeah. So thank you, Steve. Any other question. I do! Thank you. Yes, quick question. Teres! Thank you, for you know for your report, I wonder if you heard of or if you have an intention to bring about the the face recognition. You know now that you're speaking about camera- and this is something that I hear here and now you know a different location about you know using that particular you know that kind of technology bringing face recognition yeah. We talked in great detail about cameras and the types of cameras, there's also I, believe the city of Paris. They installed cameras that would track your speed and noise, so they would tackle both issues at once, so that issue came up, but nothing in regards to facial recognition. The cameras that they have now like you can barely see someone's face so I, don't think they're not going to be very helpful with identifying people in the event, the whole purpose is particularly. We want to focus on the speeding issue and not necessarily authorizing them to use. You know anything else. So I want to make sure that the resolution we present to you all is very clear and it just it's restricted to that particular issue, because that's what we're trying to solve. Not anything else question besides, the 250 plus cameras that are that already installed, especially by the school areas, are there's more cameras on top of those 250 something. So that's one of the things that's confusing about the legislation, because people think it's more adding more cameras. It's actually not adding more cameras, it is expanding the use of the existing cameras, so we would say if there are 250 cameras in our school districts or school within whatever it's like a half a quarter-mile radius. We would say this school that we want this. We want 10 cameras. We would pass a resolution saying these are the areas we see. The high number of complaints on speed rate speed racing and we would give them that information and they would we know we would they would authorize the use in those areas, but it will come to us first. So the resolution really is to make sure that we have the authority as a community board, to make suggestions and recommendations on which areas based on the complaints that we have received good act. I was so confused. I helped include the schools because a lot of school day they still don't have cameras and I brought up Indiana budget. So but anyway, thank you. No problem thanks anybody else. This is a good subject to comment on because it affects us all in I, paid a whole bunch of tickets and I did when I spoke with Captain Bellow and the precincts. Well. Excuse me that the precinct representatives were there and some there is a school of thought that it's not going to help with speed racing. That's an alternative debate to this thing right, because once people figure out well, it's this is the area where the speed camera is on 24 hours a day. You know it kind of makes it like we're just not going to go down that street, but it's worth giving it a try and I think that it is worth supporting, because it definitely shows that we have been responsive to the complaints we've received about this beating in the area and there's not going to be a sign that says this is a speed camera, that's working, so no one, no one's really going to know unless we tell them because you know what my concern is with that Curtis is like one of those quick fixes that what it usually does is it doesn't stop the bleeding it just like moves it somewhere else. You know what I'm saying or overflows in another direction. You know, because, unfortunately, the whole speed race and drag racing there's cameras all over the place. It just means all right cool. Instead of going to the school area. Let me go in front of Isabella who doesn't have cameras yet and potentially putting elders in a tough situation as opposed to you know what I'm saying like there's people that get paid to be able to look for solutions and I think they just have to be a bit more creative and stop trying to use this notion of surveillance and policing as if it's going to address what it hasn't been able to address. Yet you know disagreement there, any other questions. Oh there, it is. Thank you we'll be in touch. I'll, continue to expand on that thought. Domingo I think you're. Next, all right, so I wasn't able to attend. My committee meeting my assistant, chair, Tanya, Bonner, chaired the meeting I, had already put together a presentation from the Department of Health, which was to talk about just as presentation about around Govid and small businesses. So not only the increases, but the areas increased. What type of businesses were around one thing I would say and Steve I'm going to hit you off offline about this is I. Think it's important to have also stop like just fragmenting these city agencies. You know what I'm saying and getting caught up in the bureaucracy, but actually addressing the issue from a much more unified angle, which is involving also the people who enforce the Covid-19 regulations, the Covid-19 guidelines being able to develop educational campaigns together, as opposed to just having one entity, do the research and another one just enforcing. So that's something that came out of it and just yeah, so that it was that and again I want to thank my assistant, chair, Tanya, for doing a great job, facilitating the meeting and making sure that we educated ourselves on Covey and not only its impacts but also like its patterns and how it's impacting small businesses. I have a question, I mean, and it probably is a tool to your question for you and Steve the numbers that Steve gave earlier related to our businesses. As you know, I'm a business guy or businessman business owner are you. Is there the real possibility that they'll be that the city will be shutting us down again? What's your guy? What's your take it's a three percent threshold that and then again you see the dynamic of power because you have Cuomo saying three percent is not enough. You know that you can technically go about your business and then De Blasio has identified three percent as the threshold that he's going to be able to justify shutting the city down. So again, it's all going to fall into juris like whose jurisdiction this falls under and that's the type of shutdown we'll see citywide, I'm not sure. Like I said it's a trouble, a power happening right now, but you can't really predict that the shitty city is going to shut down. Well, you actually can if the numbers keep going up, there's going to be like some effect, but I can't honestly say that I could you could predict based on the numbers now because there's so many other underlying factors involved? Okay, Steve, anything that you want to chime in well. The only thing I've heard is that the three percent, the three percent threshold applies to whether or not the schools would remain open and- and that's the back and forth- that I've heard between the mayor and the governor that the governor is saying- and maybe the three percent threshold should not apply if the schools themselves are have a much lower positivity rate. The students, you know are not testing positive, to the same extent that the general community is. But the mayor is saying that this is the agreement he reached with the parents and the and the teachers before they agreed to reopen the schools. So he's he's still adhering to the three percent cut off I haven't heard what the number might be for a general shutdown, I think I, don't know that I've heard that it would be three percent, but but I think Domingo is correct if the numbers keep going up and I think you hear that on the national level too, you know- and you hear from different cities across the country- and you hear from Europe that you know different places are going into lockdown again because of the increasing numbers, so we could possibly be facing that I wouldn't preclude him yeah, but also part of the reason. Why and I think it's important to know sometimes how the researchers and the enforcers have been out of touch. You know, so that's why I think and Steve I'll be reaching out to you to see how we could do some joint call it an info session or something joint where it's like everybody has to be on the same page. That's the only way we could be able to develop effective, not only guidelines but measures in order to keep people safe. You know you can have one aspect of the bureaucracy thinking this way, but yet the people feeding you the information, are interpreting it. This way, you know so I think it's pretty important for everybody to be on the same page, while being able to effectively go up against the pandemic thanks Domingo. Thank you. So much for all that information that pertains and affects us directly man, it's just it's a real issue. I, don't see Caesar there. So my assumption is that unless he sends someone to make his report we're going to move that up, move that along Richard Coleman, is there anything that I'd like to remember report at this time? Would you like to talk about the budget ranking that you and I kind of like touched on, or you want to leave that for later it isn't urgent for tonight it's more discussion they have sometime between now and when we do budget rankings again next fall. Just to look at the timeline seems to me: we keep making the same mistakes in terms of how we set up the timeline each year. The people are great, but maybe we could set it up a little better next year, all right. Thank you, Richard for pointing that out. It's been a great meeting. I'd like to get someone to put the motion on the floor. To call them can I just report back to oc. Yes, please I was going to ask okay, the the State Health Department report says that, as of yesterday Sunday, the 15th there have been no additional confirmed or presumed Covid-19 deaths at Isabella. Thank you and Steve just never mind that remember, for tryon should also be proposed for the village. There's a lot of space up there as well, and where are you talking about you see by when you enter the park? There's this like open area, a bunch of parking spaces there that nobody can technically stand on. There's an it's like a no standing zone. What in its Washington Avenue yeah by the entrance of Fort, Tryon, Park Right? That's where the bus turns around well, please that's not where they would want to go. That's not that's not where they would be reaching any of the any of their clients. That's that's ridiculous. Well, no, but I think it's about creating a safe space right and looking for alternatives within the community that can basically address the need, which is space, not necessarily clients. Well, I, think you know I think on that general meeting. I think that all of the communities voices will be heard and I think your voice domain goes important, that you know people the na the business owners in high bridge who historically have been impacted for missions other than like that, I may not know of will have a shot at expressing their opinions and see how they feel about getting the brunt and the bulk of a responsibility that belongs to us all, and this is a it's a great opportunity to talk about it openly in a civilized manner. I like to leave end our meeting with a positive note, I love, positive notes during our presentation where Sally and cloth were honored money price. Yes, I heard someone was going to say something. Yes before I thought that Jonathan is going to do some report. No, we spoke so I. This I creative following face advice. We created a thank you card for faith, has all of our names. Hopefully you guys can see it and it just basically says, and I'm going to read it on behalf of community board 12 Manhattan I am writing to express our collective appreciation for granting the honor and privilege of being awarded the my hand, paper challenge. You're. Just basically saying thank you to our mppos has all of our names we'll make sure that Gail receives it. She saw it loved it. Who was giving that to what was that that's a card from us to who are we giving it to Gail's double brewers? Well, I mean it's not like. This was a decision made based on numbers. It's not like she, okay, Senator she's, just a thank you Steve, all right, so harsh, no senator all right, so just look make my name larger than the others. I know, that's what you wanted all along. You wanted to have it hold it motion to adjourn what you just said, I think is important thanking bono president, absolutely, okay! So there's a motion on the floor. There's a motion on the floor to adjourn the media. There's an emotion on the floor that was seconded. Okay have a great night y' all bye. Everyone thank you who seconded it. I did. Thank you. Yes.",
            "summary": "So hey, oh you hear me: people, yes, I can hear you, okay, hello, hi, Wayne, hello, I'm, going to kill my video while we're waiting for things to get started.\nSo we're going to call the maiden to order 6:37, November, Monday, November 16th at 6:37 p.m. I'm sure that we've all we all know that we are pretty much coming in into a second wave of the Covid-19 virus and the positivity rates and so forth.\nWe also contacted the Office of Dyna Councilman Denis Rodriguez, who had that we did not know of had allocated twenty five thousand dollars for the additions of more basket truck services at the times.\nWith that finishes, my report and I also like to bring in Mr Jim Berlin and very briefly, make up presentations on two resolutions about the next remote elections that we're going to have thanks.\nWe've got cultivators trials, it's basically making right now when a community group wants to go out and do work or even like a group.\nWe want to make that easy by locating those tools centrally and being people being able to access it like having a library of tools in the neighborhood and it can grow.\nAm you know, like everyone, we're all very proud of Sally and the work she does.\nI, don't know how to do that on my iPad. Basically, yeah real quick, whereas on October 27th, 2020 community board Manhattan held an election for the office's assistant secretary using remote means and whereas the election used voting methods that were transparent and fair and its results were uncontested and whereas the conduct of the election, however, was not consistent with the bylaws of our community board and that they require in-person voting, therefore be it resolved.\nThe original the beginning, an election by written ballot for board authors new, show be held during the executive session of the regular December general meeting of the board by the chairperson of the nominating committee.\nThe second thing, because nowhere are you, allowed to vote directly by email, because it's too easy to spoof here, you're, going to send a copy of something signed.\nThat's what we're going to look at picture and we have board members who, when they're on zoom on their computer, might be able to take a picture of a ballot you know, but to switch to another app on their computer.\nThat says that makes it very clear that the board members who are voting should pick which of the three allowed methods how about the following.\nConsidering that people caught not attending could also send in an email or text message, and that is a very good point and that's covered by the you can't vote in general.\nYou take attendance, only those people and we know who they are, can vote, and they each of them can only vote once and anyone who wasn't present at that moment can not vote.\nYou know they can't get emails, but they can still take pictures and stuff if they create a paper ballot with the various offices and write the names next to them and sign the bottom and date it and print their name.\nYou know the fact that the ballot is going to arrive at the right time and actually has your signature on it.\nLet me just finish once the nominating committee closes, the nominee you know closes the election, then they will not accept any more ballots.\nYou know the reason why I'm saying that, because some people will have some issues with the tax doesn't come and there's a delay in the texting and so forth.\nYou know how we comply with the open meeting law, it's very easy audit, but very precise, because what they want to find from us is if we comply with all the requirements or give a notification to people having an agenda and also having the appropriate recording, etc.\nWe have been busy doing that the last week and this week, because we need to submit it before Friday this week, the document they requested and also last week we had several meetings regarding Covid-19 return or possible return or numbers going, high.\nAnd I know that Bruce Robertson who's on the traffic transportation committee have been trying to get them to focus on the fact that what they presented is not what they're building and that waiting to study the matter.\nProbably, there's something happening between contractors and DOT, and that's what the breakdown of the communication is so we're trying to push it and pushing the envelope until we tell them look we're going to just go in there and just stop it.\nThis situation is happening in several areas in the district I myself have been discussing this matter, marking and narrowing the street and making you know that almost then nobody can drive and I have that discussion regarding another location.\nAnd I'll, just basically kind of give that obstruct that, since becoming treasurer I created a basic Excel spreadsheet that the district manager would update each month to report fiscally a monthly actual and forecasted expenses, as they related to the budget, which would enable the Treasury to advise the board what funds might be available to be repurposed throughout each fiscal, year.\nI sent this request: out, November 2nd, which has basically been the request, since I became treasurer every month a week before I like the information, so I can review with the district manager.\nAnd you know the committee and the community have asked for it, and you well deserve to get that.\nAlso last month, when Wayne advised at the executive committee meeting of one member that didn't show up, I'm, not sure if he did not show up more than once, or he did not show up just in October.\nI mean like I'm waiting for which person specifically do you want, so that I can ask her she's right.\nWell, so I need to get back on a regular, basis, and I would like to ask the office to for that information to me all right.\nWill you get clarification that obviously, after 10:11 months was not able to get for whatever reasons, but I'm sure that by Thursday you will get all the information that you need all right.\nIs, you know, am I going to be able to send you all the information that you request as far as attendance.\nIs it's great that you are going to send Lasar that you are going to send or are going to make sure that the office sends to oc the attendance for each of the committee meetings.\nBut the other thing that's also important to have and without which oc is not going to be able to do the job that the bylaws requires her to do is to know for each month.\nIs, this person supposed to be showing up or not, and people would say: Oh I didn't attend blah meeting because I'm not on that committee.\nSo she's going to need to have not only the attendance but also the committee composition for every month.\nAccording to what you're saying Jim, then actually a member of a board does not have to does not is not required to attend more than one committee meeting.\nIt pushes people to attend committee meetings, and so those are the rules you have to, but Liz's other point was: You have to make sure that the person is on the committee.\nYou said you were going to clarify, although I have not seen an email clarifying, it Domingo pointed out that it was his understanding that when he became chair of business development, you know business development and the executive committee were his two required committees and that he was no longer on land use.\nYou know when he became chair of business development so assuming moving forward from that he was no longer on land use that should be confirmed and an email would be.\nWhen Domingo became chair of business development, so that we'll know moving forward, he shouldn't be marked absent from land use January.\nSo we're going to actually Domingo you attended land use in January.\nI thought I was only supposed to attend two and the general meeting, and that's why I think you know like streamline what, when we were saying if, at that point in the realization that you only have to attend the one committee, you will have to send an email saying that you would not longer be part of that committee, which is what we did not get.\nYou should just you know in response to my email, confirm that when Domingo became the year that, in which case business development and the executive became his two committees, if he wants to come to land use, that's fine.\nBecause, as people rose to officers or to chairs and became members of the executive committee, they were I would think no longer obligated.\nIt's more of a statement that this is why it's so important for you to communicate in writing what the committee composition is and also to let people know that they can't just resign from a committee at their convenience, because that's an authority and a power that's invested.\nWho've, been in the community boy board, who exploit the fact that they're chairs of one commit of one committee and don't attend others right.\nThen it was juggling to go virtual this and that so I don't want people to make the assumption that I chose not to attend land use right, because that's the same way, I could make the assumption.\nI just want to put in a good new member orientation and making sure that we communicate exactly precisely because you know the committees that you're required to attend.\nNo I was saying Faye that I think at last month's exec committee meeting there was a discussion of whether the youth and Education Committee, which is scheduled for the 14th, should move to the prior week because in December, because of holidays, the general meeting is on the 15th.\nIt's just the day before exactly well, and you know what I actually already confronted with one of the local school that wanted to present.\nYou, know, I'm, not sure I can answer that question right.\nAnd I think this is something that I hope that you do more often you know, and yes, it was highly appreciated.\nI believe that she also brought up something that I really captivated my attention, where you say that whether the school decide to go in person or not, you know, but they should increase the the personnel the deal so like with you know the mental health to provide more assistance for those students and basically.\nYou know YouTube video, but one thing that I think is equally important.\nThat I mentioned is I'm working and and elaborating a report which is going to be part of the con will not well part of the conversation of you know the initial information that some of these analysts brought into this conversation and also many information, that, unfortunately.\nAnd I wish that more committee, you know unify themselves and do things you know like that, because I think it's important.\nFollowing up on your last comment, Fei, that my committee stands open to work with you on the mental health issue at any time.\nI look forward to continuing to do this work, addressing these issues that particularly are affecting a lot of our youth, and you know I'm again just thankful to have had this opportunity.\nI did listen to that call, but I didn't understand why the health committee wasn't part of I'm just going to hop in.\nWhen my committee did the mental only specifically mental health, that the first time that we discussed that which was at the we had a plan on Isabella the Saturday Meeting Steve graciously attend that meeting and he immediately picked on that subject.\nYou, know, land use and planning, and zoning issues.\nI think the idea of having a c12 tailored platform that allows us to you know pull in data that is readily available, but it's in multiple sources bring it into our platform and allow us to look at what does it mean if we do zoning of X, Y or z.\nDoes it mean if this project gets built, is something that is, you know, would be an invaluable tool and Sean had to leave the meeting, but we are going to schedule time for him to give us a more detailed presentation of the capability of the platform they created for CB9 to discuss how in fact you know they can, you know, do it for CB12.\nThe capital budget results and also the fact that the mental health issue on Steve's committee ranked number one from the board, and that, of course, was due to our input into that.\nWe talked a lot about issues that we want to discuss at upcoming meetings and in December.\nYou know, as far as the area goes I think we'll be okay, all right.\nSo I'm, not forwarding the resolution to the General Board meeting and at this November I will be passing it on to Curtis, in the hope that his committee will will jointly support that resolution.\nMy committee was was given a presentation by the corner project which, as most of you probably know, has not been able to find a permanent space in our community, since it lost its location on 181St street in Saint, Nicholas back in 2018.\nWe had thought that they could present to the executive committee tonight, but as it turns out, they weren't even available for that, but but they're telling me that sample wants them to come before the full board so that they can.\nNo only thing that I'm trying to include in a resolution is a coordination on like who makes a decision on which cameras to use and if the legislation currently actually mentions community boards that there needs to be a public hearing on which cameras to use, we don't want to have every camera.\nI included that, because I wanted to make sure that they knew that we were advocating not just blankly for the legislation, but particularly for the cameras in certain areas that we know there to be, and one thing to be conscious about also is how ice and a lot of these, like federal agencies, actually do a data grabs that include like a lot of these surveillance cameras, just putting it out there.\nDon't think they're not going to be very helpful with identifying people in the event.\nSo I want to make sure that the resolution we present to you all is very clear and it just it's restricted to that particular issue, because that's what we're trying to solve.\nYou know it kind of makes it like we're just not going to go down that street, but it's worth giving it a try.\nYou know what I'm saying like there's people that get paid to be able to look for solutions.\nAnd again, I want to thank my assistant, chair, Tanya, for doing a great job, facilitating the meeting and making sure that we educated ourselves on Covey and not only its impacts but also like its patterns and how it's impacting small businesses.\nYou know that you can technically go about your business and then De Blasio has identified three percent as the threshold that he's going to be able to justify shutting the city down.\nI. Think I, don't know that I've heard that it would be three percent, but.\nYou know you can have one aspect of the bureaucracy thinking this way, but yet the people feeding you the information, are interpreting it.\nPlease I was going to ask okay, the the State Health Department report says that.\nWell, I, think you know."
        }
    }
}