{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCB4 Full Board Meeting",
            "publishDate": "2020-11-05",
            "shortDescription": "",
            "lengthSeconds": "2:20:50"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "spuVbvwySjU",
            "fillerWordCount": {
                "uh": 245,
                "um": 312
            },
            "readTimeFullTranscript": "83 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "housing": 36,
                "street": 34,
                "sidewalk": 30,
                "shelter": 23,
                "building": 22,
                "budget": 19,
                "day": 19,
                "statement": 18,
                "shelters": 17,
                "residents": 16
            },
            "wordCountSummary": {
                "housing": 11,
                "shelters": 7,
                "budget": 6,
                "street": 6,
                "needs": 5,
                "block": 5,
                "population": 5,
                "statement": 4,
                "shelter": 4,
                "health": 4
            },
            "fullTranscript": "And at the bottom of screen that says, reactions and what it allows you to do is when we get a consent. When we have a sort of evoke type thing, you can raise a hand you know and whatever, and it's a good way to at least quickly like when you say: let's get a consensus, everybody raises a little hand and shows up on the screen on the tile on your picture as a raised hand, and you get a real, quick indication of what you got there all right. I do not know how to turn that functionality on and Jesse. Why are we streaming yet Jesse or janine or nelly? This says we're live on YouTube and we should not be live yet because I have not called the meeting order yet we're still lacking four people for a quarter. Nothing has full host capabilities right now, so I have no way to turn it off all right. Well, where is Jesse, I'm not sure which thirteen fourteen fifteen sixteen seventeen eighteen nineteen number and subtract two any one subtract two from the panel's number subtract three ray: who else is here nelly, janine and Jesse? Oh janine, I did not see her okay, there you go. Can you see any of us or are you just like bleary- eyed and with a new level? 24. we got the 24. evening, everyone Lowell, you have Quorum okay, then I do not wanna all right. I'm going to wait for Jessica to get connected because she's up, First Jessica you ready to roll Jessica hello, all right. You are ready to roll okay good evening. Everyone welcome to the Manhattan community board 4 meeting for the month of November, which is coming to you from election purgatory. We start our agenda tonight with a public hearing on the proposed statement of district needs and budget requests. So I'm going to turn this over to our second vice chair and chair of the budget, Task Force Jessica Chait to hold the public hearing Jessica great welcome everybody. This is a annual occurrence where we prepare our request to the city for the budget that will begin July, 1 2021.. I believe we have a few people who have signed up to speak. Let me pull that up here. We have Keith Allen, Randolph and Lucy. So if you are still signed up and interested to speak, Jesse I'll ask for help in calling up those folks. Let me just clarify lol is now where we actually review the statement of district needs, or this is just an opportunity to hear from the public. This is just an opportunity to hear from the public. The report prepared by the budget task force has been live on our website, so they may have reviewed it already. The speakers they may just have other requests that did not you know get filtered through, but we actually vote on it and review it in the business session. Great that's what I thought. Okay great, so so I do not see Kathy or Keith in the attendees section. I do see Alan Mark, so I will move him over great and Alan will ask you and all the speakers to limit your remarks. I believe to two minutes, and as soon as you're ready, you can go ahead and get started. Alan. Are you with us? Can you hear me now? Yes, sorry about that anyway, I'm increasingly becoming concerned about the 36th street and 37th area homeless, shelters in particular, the area is becoming increasingly I'm going to interrupt you for one second. Yes, this is just a public hearing on our statement of district needs. If you want to address any issue any other than the statement of district needs in proposed budget, you have to wait for the public session. Did you did you want to speak on the budget or just about 36th street generally at just about 36Th Street? I apologize all right, then we will call you up at the appropriate time. That is a warning to anyone who has signed up to speak at the public session or to speak on the topic of the statement of district needs. If you signed up to speak on the statement of district needs, your comments are restricted right now to that you can still address us during the regular public session. Sign ups for the public session continue until 6:45 for another nine minutes, so Jessica and Jesse. Is there anyone else who signed up to speak on the statement of district nations and budget requests? We have two other people again unclear if you, if you did want to speak on behalf of the statement of district needs, it's Randolph Barksdale and Lucy Lieberman Randolph. I have Randolph I'll move him over now great he should be Randolph. Can you hear us hi? Can you hear me we can and are you prepared to speak about the budget, the statement of district needs? Specifically, I was going to speak about 36Th Street, so I'll, wait, okay, we'll move you over! Okay! Thank you! Uh- Huh and Lucy Lieberman same thing. Lucy. Are you there? Thank you Lucy. Can you hear us? Yes? Can you hear me? We can sorry. Are you? Yes, I'm just for the public session. Okay, we'll move on! Thank you. So we have no one else: who's signed up. I believe that concludes our public session on the statement of district needs. Thank you Jessica. Now we move to our regular public session, which I will turn over to our first vice chair, Jeffrey Le, Francois Jeffrey are you here I saw you thought I saw you yeah Jeffrey. It's that mute button thing you got ta hit. No, I hope I'm the first and only of the evening to be told I'm on mute good evening. Thank you. Mr Sheriff hi, everybody Jeffrey. I'm going to suggest that you start with Lucy Randolph and Allen. Since they've already been moved over as they are here, I will give it to Lucy, followed by Alan and then Jesse. Could we please bring over Lisa Wager and Brian Webber Lucy? Are you here just have to mute yourself, Lucy, I'm unmuted hi guys. My name is Lucy Lieberman, I'm a resident of West 36Th Street between eighth and ninth, and I just wanted to comment on the letter about the temp homeless, shelters on West 36Th Street. I really just can't believe, I'm on yet another full board meeting where this remains unresolved. It's been over five months since DHS and the city placed this disproportionate number of temp, homeless, shelters and hotels in a one block radius and the situation just remains terrifying. The superficial tactics of increased security stadium, like lighting and sanitation, have had no impact at all. For example, a few days ago, a shelter resident high on drugs sat right outside my building, yelling and taunting. The shelter security guards pulled down his pants and chased them in circles wagging his private parts at them until they eventually corralled him back into the shelter last night. Four security guards from the shelter pinned an agitated resident to the ground, while he screamed eventually dragging him inside this morning, two men from the shelter Od'd on the sidewalk in front of their hotel. I can't imagine how difficult it is for a shelter to operate out of a hotel, but what I know for sure is that placing three different shelters within one block has to be exponentially more difficult. This was simply poor planning and the city must fix it by relocating at least one shelter moving just the Doubletree hotel residents. We will still have over 500, temporary and 100 permanent shelter residents in one block. I'm thankful for the vocal support of the of this group of CB4, the borough President Assemblyman Gottfried Senator Jackson, but it is beyond disheartening that our mayor, Corey, Johnson and Senator Hoyleman take no action or remain silent for fear of appearing politically incorrect or insensitive and prefer to continue experimenting with our safety. This is a nightmare and it will be 15 seconds. Just please help and thank you very much Jeffrey before you move on Lucy. Can I ask you a question. The incidents you just relayed. Do you know which hotel the men you mentioned reside in it's primarily it's almost exclusively at the double at the former Doubletree Hotel. Okay. Thank you. Thanks before I go to the next speaker, I did not give my full feel as to how the public session will be run this evening. As is customary, each person will be given two minutes to speak on an item of their choosing. However, we strongly encourage and highly recommend that, if you are not adding anything new on a topic somebody has already spoken about, please be cognizant of that. We do have a full agenda this evening. The item that the previous spoke speaker just spoke about- we are taking up as item 15, as this board has taken up consistently for the past five months, so I will leave it at that and know that you'll get a 15 second warning when you're before your time is due at two minutes, and I will go to the next speaker whose name I do not have in front of me because he was pulled over from the previous session. I believe it was Randolph we can go, we can go with Alan Mark and then, after that, we'll be random art. Still there we go Alan. Can you hear me? Yes, I'm increasingly being concerned about the viability of West, 36Th, Street and West 37Th street. Despite these numerous meetings, the area is becoming increasingly unsafe. Just today, when I came home, I got out of the cab. It was after five o'clock and a shelter resident said get out of my way and all I was doing is getting at the cabin trying to go into the building. The noise level has now become atrocious. There's 24 almost there's 16 hour day, music playing, there's ambulances, cue two hours, there's arguments are yelling, there's screaming, there's drug fights, the sanitation which was supposed to be improved, has not been improved. There's human excrement and daily garbage real estate values are plummeted, unlike any other area in New, York City, Corey, Johnson, De Blasio is missing in action. The bottom line there's been no progress, no progress, I'm really hoping that this community forum will give us help the neighborhood is being destroyed. These monthly meetings are doing nothing. Thank you for your time. Thank you. Next Speaker Randolph Barks and then Jesse Lisa, Wager, Brian Weber and Brian Palago Randolph hi. Can you hear me? Yes go ahead? Yes, I just do not want to take up too much of a time. I'm just going to reiterate the last two speakers and just saying that I guess the Community board four were very appreciative. You you're the only outlet we have to go to address our concerns, but there's been no improvement and it's kind of insane to have three four homeless shelters and one block radius. Whoever thought of that was just not thinking and we just want to have one of them removed. The horse defender is the double tree. Now they call it the Central Times Square. They say it's under renovation. We do not. We do not know what that means, but we do hope that we can at least have one of them taken away. So we can have a little bit more of a normal life around here, and anything you can do is much appreciated by all of us. Okay, thank you. Thank you. Lisa. Are you here, Lisa Wager Lisa should be here. I moved her over. I see her name, I'm muting. Sorry, hi Lisa you're fine month, eight of this right, okay, so my name is Lisa Wager, I'm the director of government community relations at the Fashion Institute of Technology to SUNY college on 27th, between 7th and 8th, with the fourth Residence hall on 31st between 9th and 10th. How are you we're all waiting, as I mentioned before, the museum at Fit's fall fashion. Culture programs have moved online, they all premiere on the museum's YouTube channel at 6 pm on the designated day, and they run one hour. They can be part of your culture fix for the week next up tomorrow, in fact, is a conversation discussing native american fashion design moderated by Reagan De Loggins, a member of the Mississippi Choctaw. The panelists are Jeffrey Gibson, an award- winning Choctaw Cherokee artist, whose work combines traditional native american elements, with contemporary references and Karina Emmerich founder of Emmy, a fashion brand reflecting her indigenous heritage, which stems from the palliative tribe of the coastal Salish territories in the american and canadian Pacific northwest. That's tomorrow, at 6., more public free public programming vogue has named museum at Fit's podcast, dressed the history of fashion. As their pick for number one fashion. Podcast. You can find that on spotify or apple pod podcasts, and there are three segments so far now to speak about what fit delivers as a public higher education institution. We have ranked at or near the top of numerous lists that count with students and parents when they're choosing colleges, College magazine ranked Fit as number one on its 2020 list of 10 colleges for aspiring fashion designers. They note our prestigious alumni, like Nina, Garcia, Michael, Kors and Calvin Klein, our location on 7Th Avenue, the specialization choices in the fashion design, major and our robust extracurriculars, also the site best value schools ranked fit. Second, on a list of the top New York institutions with online programs, the number one choice was Syracuse University, best value basis, its assessment on job placement rates, faculty experience graduate success, the number of options I got this graduation rate options for financial aid and student feedback, we're very glad you have ranked so high on these and other college choice lists and to be able to deliver this caliber of public education for students from New, York and beyond. Thank you. Thank you. Lisa thanks Jeffrey Brian Webber, hello. Hi. Can you hear me hi? Thank you I'll. Try to keep this brief. I'm Brian Weber resident of 36Th Street and the co- chair of the 36Th Street Block Association, I'm here on behalf of the Block Association, to support housing, health and Human Services letter item number 15 regarding the temporary shelters on West 36Th Street. I won't reiterate what my neighbors have said, but I just want to comment. I know that Corey Johnson's office and Brad Hoyleman's office has been trying to work and getting more security, more lighting, more sanitation and it's not working. We can not make this block an experiment for either the permanent residents or the shelter residents. The situation here is deplorable. It continues. We've been coming to these meetings for for five months now. This is going on six months that we're living this way and we need to reduce the density of the shelters on West 36Th Street. One incident that Lucy did not mention was one of my neighbors was assaulted, trying to enter her building earlier this week. Fortunately, that building has a doorman and the doorman was able to rush to her aid and shove. The assailant out of the way, I'm afraid someone is going to get hurt here. Shelter residents are getting hurt on a daily basis, but I'm afraid that permanent residents are going to get hurt on a daily basis. So I really implore Speaker, Johnson and Senator Hoyleman to support community board 4 Manhattan borough president Gail Brewer, Assemblyman, Godfrey and Senator Jackson's request to reduce the number of shelters and the number of shelter beds on West 36Th Street. Thank you so much for giving my neighbors the opportunity to speak. Thank you! That's it! Thank you! Brian Palago! I do not see that I do not seem to buy it I'll go there got it. Let's go to next three Jane Greenman Ann Santori and Lynn Stefanelli Jane. Are you there jane you're unmuted? Can you hear us? Can you hear me now? No, I can go ahead and okay, my earphones were not functioning hi, I'm the neighbor who was assaulted last Sunday evening I was it was about 7:30.. I was coming back, I'm not a relatively recent widow. I live here by myself. I've lived here for 16 years. I've never felt unsafe in this neighborhood. Yes, it's gritty, it's part of its charm, but I could come and go at any time of day or night and really never feel like. I was in danger. I can't even my family, my daughters and my grandchildren are afraid to come and see me. They won't come to my apartment anymore and I'm limited in my ability to go, see them because I can't come or go after dark. I was in you know, dropping off some stuff before going to park the car with my 102 year old mother sitting in the car and the guys you know there must have been half dozen on one side and at least a dozen on the other side of our entryway. They became increasingly aggressive to me as I started, walking in the building and jane you're on mute and Lynn my car door, and you know happily, I was able to just ultimate the door. Luckily, the door attendant was there and helped me get in the car and leave. But you know I'm a prisoner in my apartment from Sundown till sun up essentially something's got to be done. 10 seconds, I'm done thanks dane. Did we find Anne Corey? I am on the floor. Thank you. I too am a resident of West 36Th street you've heard from me before I've. My with my thanks, because you're the only people who are helping us I've lived here for many years, I'm five feet tall, I'm 71 years old, I watched a family insane enough to walk down 9th Avenue last week, be assaulted. The woman thrown to the ground emergency help, while her young children and her husband watched, but the offender was had mental issues and was not able to be arrested. We no longer have not been on eight eighth avenue since March three months locked down and then shelter residents moved in. I was trying to make a point last session since we see each other every month about density. Here's this here's, what I'm trying to say and I'll say in a different way. There are 147 residents on our block, residencies some have more than one people, so let's say 200 people and over 800 mail, shelter visits. There are no women's shelters, there's no family shelters on our block. We already have a shelter, so that means for one of me there are four guys on the street every day and I am going to conclude by saying two days ago. I, since I can't walk on the sidewalk anymore. We all walk in traffic, which is safer than the sidewalks and, as you know, we're an exit route from the Lincoln tunnel, so walking in that traffic is a little dicey, but it's safer than the sidewalks, and I came to my House 15 seconds. I saw a guy who was much bigger than I was talking to himself and acting erratically, and I hid behind a dumpster to try and call my husband who was in Queens because I could not come home. And finally, someone in my building saw me came down without a mask to rescue me, and that is how I got home the other night and that's my West 36th street experience for the fifth month waiting. Thank you next up, Lynn, Lin, Stefanelli and then Jesse can we bring over miriam natal, and that should be that's my list. Lynn the floor is yours hi. This is Lynn Stefanelli. I live on West 36Th Street for the past 20 years, due to the overwhelming influx of shelter population on West, 36Th Street, the longtime residents of this block have become the vulnerable minority, the disenfranchised the overlooked and the underrepresented, our safety and public health are at stake. Every day our safety and health have been prioritized above the shelter population. As a woman, I literally take my life in my hands. Every time I leave my building across the street from the doubletree I have been verbally threatened with rape. I have been verbally threatened with rape. I've had local shopkeepers need to form a human shield around me, a human shield, so that I can walk home safely because someone that is having a mental issue has decided to strike out and be a random person on the sidewalk. I have witnessed human urination, defecation, masturbation, drug deals and overdoses in broad daylight. I'm sorry! If these words offend you, they offend me on a daily level. My apartment is a work live loft. Clients will no longer come here. Nor do I blame them. Messengers are fearful to come here. I am fearful all of my neighbors had to have can recount an issue of violence between either themselves or a neighbor. What will it take my murder 15 seconds, I'm about to walk my dog. I have 50 odds whether or not I'm going to come home alive, 50 odds, whether or not I'm going to come home alive, because I have to walk my dog and you're going to give me 15 seconds. I have 50 odds, man we've, given everybody two minutes this evening and you're the sixth speaker on the topic. We recognize the difficulties that board has been advocating on behalf for the past six months, so we will be taking up another letter this evening and I sincerely appreciate you being here this evening. All right jessie did we get any other news speakers. Besides Miriam Natal, I do not have any hands raised and it's past 6:45.. Okay is miriam here. Yes, okay, great marion, the floor is yours. Okay, my name is Miriam Atar. I came here in 2003 to this community to live with my husband and my children. He died in 2007 and I live and work in this community for ps212 Midtown West and for Salvation Army Theater 315. Since I move here in this community, I try to help and do the best that I can in the community. I agree with all these for the homeless shelter, but I do not want to go over that. I get hit by an electric bike in September 23rd. I almost died and the guy get out and left because he does not have any identification and those by going fast as the car, and I would like to have the last enforcement for those bike. I called Andrew Commerce, Office and Corey Johnson's, and that's why I reached to you to see what we can do together. No law no lawyer want to take my case because I have nobody to sue, but I think I have something to do for the community if we all get together and do something for safety for the community, we are really back they're going on the sidewalk and the wrong way. I get hit by the wrong way, guys, who I had two broken ribs. I had concussion in my in my head. I had all my two knees and my hand cut and with a mother who had to survive because the Covid-19 I just started working and then I had to stop working again and I would like that we all get together and do something for those electric bike and also for the restaurant, who send the delivery out with no name on. So how can we know who is out there 15 seconds? It's okay, thank you so much for the opportunity and I hope we can get together. I like to work for the community and I like to be on board and anything that I can do positives for the community move forward. Thank you so much for the opportunity. Jeffrey. Can I just thank you marion? Yes, please jeffy miriam. Can you follow up with us in the office? My name is Jesse Bodean, I'm the district manager. If you just go on our website and you'll get my email and you can follow up with me directly. I email to you and you answer back to me. I will send you all the picture and everything that I have. I had a video from the police and I had a I tried to move forward for that. Okay, we'll keep on working on it. Thank you miriam. Thank you. So much Jesse with that Mr chair, no further speakers. I declare the public session closed this evening. Thank you. Jeffrey first order of business is the adoption of the agenda for tonight. Do we have any proposed changes to the agenda? Hearing none I'll, entertain a motion so moved. I saw Katie's hand as a second all those in favor of adopting the agenda all right all right. Anyone opposed all right. The agenda's in place the minutes from last month's meeting with any proposed changes, comments, additions, hearing, none I'll entertain, a motion move to adopt and Jeffrey is the second, this time all those in favor of the minutes being adopted all right. Anyone opposed the minutes are adopted. We move on now the Rep we normally go to our borough president. I do not see her here Brian. I do not know if she's coming tonight, you should. I will let you know when she gets here. Okay, then we will move on to the elected officials for now, and I saw our newly elected state Senator Brad Hoyleman in the audience, Senator Hoyleman Newley. Thank you. Thank you, Lol. Thank you and thank you to. Let me just first stay thanks to all of those that very moving set of testimonials that I heard just now and want you to know that as your state senator as a state official, I have been working with my colleagues who obviously are at the city level and trying to rectify this untenable situation. I want you to know that I have walked the block numerous times. I have seen with my own eyes what you see far more frequently and it's unacceptable, and I just want you to know that I've been in close contact with DHS. I'm disappointed that we have not had a face- to- face, sit- down meeting with them and the commissioner. Yet to me that is what has been sorely lacking, but what we have not been lacking in is information from the community board, thoughtful responses from the community board, with alternatives and strategies, as well as your outspoken concern, and I just want to put that on the table but as as Lowell said, I was recently re- elected just last night. I want to thank you for that. You know we are all waiting to see what the results of the presidential election are, but we're also waiting what the results of state Senate elections are. You should know that there were state Senate elections all across New York. We have a majority in the democratic state Senate of 40. There was some talk of us having what's called a veto. Proof majority of 42, I'm not sure we're going to get there or not veto proof means that we can override a governor's veto and have a greater hand in budgeting and hopefully addressing issues like the need to build additional supportive housing for our homeless population. We've not done that in New York and we're failing you in that regard. I do not know. If we're going to get to 42, though we suffered some losses in the democratic Senate, we're going to still retain the majority, though, but I think everyone's you know, hearts are in their throats waiting to see what the results of the federal elections are for just wanted to share. With you mention of a of a Washington Post editorial that I wrote too. It's it'll be in the and the board report about my personal experience around the issue of familial violence, which I think is pertinent to our times today on different levels wanted to mention that my office is going to be partnering with Mount Sinai to host a free flu shot event coming up. You can get more details in the board report, but it's going to be on Tuesday November 17th from 10 A.M to 3 P.M outside of Penn South. I held a press conference. My fourth item I wanted to mention about a legislation I carry which would strengthen New York's slap statute. Slap stands for strategic lawsuits against public participation and very wealthy and powerful interests such as the real estate lobby. Certain developers, Donald Trump, use these kind of baseless lawsuits to dampen criticism from activists. One of the activists is actually in our own community Board Michael Mckee he's been sued by the real estate lobby for a number of years now costing him and his advocates. You know tens of thousands of dollars in legal fees to try to get to try to silence him on issues around tenant protections, and he appeared with me, along with some advocates, but to advocate for strengthening this New York law in this regard. By the way Michael Mckee has been sued for 40 million dollars by the by the real estate lobby, but I hope to get the bill signed. What it will do is basically require an individual who makes these kinds of suits against advocates, and critics and journalists to pay attorney's fees if they in fact lose that's going to do a lot to dissuade these types of baseless lawsuits and protect free speech and fifth item. In light of a report that we saw in a number of publications, I've introduced something called the pandemic self storage Act, and that's going to ensure that those individuals who are suffering through this pandemic, like the rest of us and have their items kept in self storage, will not lose them to a lien sale. It's going to basically put a moratorium on lean sales during the pandemic and for a short period thereafter. You know there's up to 50 million square feet of self storage facilities across New York, so a lot of new yorkers are using a lot of them in our own district and we need to make sure that folks are protected from having their personal items sold and then. Finally, I just wanted to note that I am carrying legislation with assembly. Member Harvey Epstein called the save our storefronts bill and that's going to be a major rent relief bill. That's going to help small dis businesses across our district, mainly to keep them from being both evicted and give them, and the small landlords who have leases with them, support through a structure that we created this legislation. Hopefully when we get federal aid under a new federal administration. So that's just kind of the highlights happy to take some questions. I will say that the legislation that I passed this past year into law requiring you to buckle up and seat belts, went into effect on November 1st. You know it's so important that we wear seat belts because in cabs and now and liveries such as Uber, there are these plastic partitions that both protect the driver from Covid-19 and also you know, protect the driver from other security issues. What happens, unfortunately, is that when you do not buckle up in the back seat and the driver might come to a slow stop, you get flung forward and you hit that partition and it can break your teeth. Split your lip or give you a concussion or worse, it's so common at Nyu, Langone Hospital. These cases that they call it partition face because they see so many patients coming in with it. Well, there's now going to be a requirement that you have to buckle up in the back seat when you, when you're riding in a cab or an uber, and then I just want to finally mention that we have passed legislation that would amend the administrative code of the city of New York to require all new homeless shelters to conduct a public hearing in the community where the proposed shelter is to be located before it's cited. That is important because, as we saw with West 36Th Street, the community board, the local elected officials and, most importantly, people who live on the block had no idea that the shelter was being located in this in this area. So that's my report. Thank you. Senator Hoyleman, we have been joined by Manhattan borough. President Gail Brewer gail. The floor is yours. Thank you very much, Mr Chair. So a few things. First of all, it's a pleasure to work with you on your new role as a member of the Hudson River Park Trust, and I just want to say I know that we're working on the pound, pier 76, is an endless discussion, but I did have somebody that was someone from the board. If you could please mute yourself, okay, all right so on the pound, and I want to thank the chair for being a member of the Hudson River park, trust, but on the pound, hopefully by the end of the year, it'll be moving. I know you're going to have a hear, a hearing and a discussion on it, but there are 50,000 cars towed there. You may have known that. I did not realize that per year and 195 cars taken in per day, that was news to me- obviously 22nd century. Maybe it could be done in a different way and we have many more statistics of information, but that was of interest to me. That's a challenge same relevant to the issues of waterside projects, we're working on the helicopters. It's not as much complaint coming from board. For but boy am I getting complaints from board seven and other community boards, so we're going to try again, we have been in constant touch with New Jersey elected officials, and it seems like most of them are coming from New Jersey, but we are on it. I do not know how many, if any tourist- wise come from the West side, the West side teleports another story, but in terms of banning non- essential helicopter flights over New York City, I'm getting more complaints than ever, and I'm not supposed to do that. So I'm just letting you know we have an airport in westchester and we have 50 airports in New Jersey now how many of them are actually flying. That's what we're trying to find out. I also want to just say much thanks to everybody on the NYCHA Chelsea working group, I have to say that you know I work, as you know, for many years, maybe 40 years on NYCHA issues and we have a rad in board seven with a huge complex there. We have scatter rads all through the five, the five boroughs, but a lot of them in Manhattan, and this is the most substantive I just wish. We'd had this discussion much time many months ago, because the other rads are just proceeding without any of this input, but we'll see how it comes out, but just in terms of the process and the input and the residents and the citywide organizations and, of course, the miraculous brilliance of people from board four. You should be very proud of it, because nobody else is doing this and it really does make a difference in terms of the final product. I know that we're all we have a discussion about the hotels and the shelters and some of the providers. I thought it was a good discussion. The DHS finally agreed to participate. I will have to say that what we're doing is we're, following up with the department of information telecommunications, to talk about ways in which their apps for recording data could be implemented and also making sure that there's a single number, because if, when listening to the providers, different numbers are being called for different providers and that's not helpful for the public. So, on the tech front, we're going to try to be helpful in our way same thing with link stations. I know it's an ongoing issue working with do- it on which should exist and which should not and without getting into the specifics, because you know what they are. I just want to say: we are following your lead on that I've been pushing for this public realm proposal. That's the notion that somebody be in charge of our streets. I think I mentioned, I think I've counted 21, different agencies, state and city that follow up, whether it's the MTA, the consumer affairs, the health department, the buildings department, the Department of homeless services, etc. We need somebody particularly with the outdoor dining sanitation. I know that Mas Municipal Art Society time Square alliance are abolishing that the wastewater treatment has come quite a long way. I started pushing this quite some months ago. Boston found a surge of covered hot spot by having their waist identified. Holland and Europe has been doing this for some time. Finally, the city has the restock people, a department of environmental protection, a lab they're, just waiting for more equipment. They can do about 30 tests, 35 tests a day they want to do 80 and they can do that when the equipment arrives. I want to thank the cleanup efforts in your borough. I mean in your community board they've been phenomenal without getting into the specifics. Just know that I go there a lot and really people are stepping up to do that. There's a lot of discussion about the tech devices in the schools. It's still neat, despite all the press, there's a lot of work that still needs to be done and we've been calling the shelters to try to figure out what it is that they really need in terms of bandwidth connection and devices. We are also had the south and the north in terms of police reform. I was the moderator for the South. I think it went really well. We had young people who were quite articulate as they always are and we'll see what comes out of it. It's just the beginning of plans on police reform and we'll see we'd love to have your input. Obviously, the Urban League New York Urban League Rep, the federation of protestant welfare agencies and Robin Hood Foundation over three people, have been assigned by the mayor to take our suggestions for the entire five boroughs. Applications for the community boards are going to be released next month or next year. We also have in November, we'll be sending you to November 23rd attendant resource, fair, virtually we'll have tons and tons of tenant, reps and law, legal AIDS and so on to be able to answer questions, and then we also have been giving out. I think you know we gave up money for tourism grants not a lot. We gave out some expense money, not a lot. We gave up money for the census, not a lot, and we gave out capital money this year. That was the extent of the budget. Thank you very much committee board, for I know there's a lot going on and you're rising to the occasion. Thank you. Thank you. Gail Assembly member Linda Rosenthal also won re- election last night. Dale Corbin is raising. I did thank you for mentioning that and thank you. Everyone in my district Linda I'm going to hang you I'm going to ask you hang on one second dale, you had a question for gail yeah, sorry, just real, quick gail. I just wanted to let you know that we have actually gotten a fair number of complaints from Chelsea about the helicopter traffic and we have, with the help of some of the people on the ground. We've identified a specific operator in Jersey and one of the letters number 13 is specifically about that situation. So thank you for your work. Thank you very much. That's helpful to us sorry about that Linda newly elected, a newly re- elected assembly, member Linda Rosenthal. Thank you and thank you all for supporting me. All these years and I'm happy and proud to have been re- elected for another term in the New York State Assembly, representing parts of Hell's kitchen and the upper West side, and there is plenty of work to do the election. I know so many people voted in the early voting days. It does not seem as if as many voted on actual election day, and I actually felt weird not voting on election day, but I wanted to be sure that I got my vote in early, and so I know there are so many outstanding absentee ballots in this state. If they are postmarked by the third, then there are seven days where they can be returned and only after that are they opened. So it's going to be a while it it's not important in most races, although there are a few in the assembly where things are really tight and there are some in the state Senate where they're tight as well. So that's that's very important. I have proposed a bill introduced a bill that everyone, who's eligible to vote would be mailed a ballot. It's the same. What they do in New Jersey. I think that people who were worried about Covid-19 or could not stand online just went into the polls and dropped off their ballot in the dropbox and that people loved that there was no waiting. You just fill it out and put it in there, and so that's something that I think you know would do well in this state. Obviously- and I've advocated for this for a while, we need a board of elections that is professional, not to say that a lot of people who work in there are not professional, but the operation needs to be run in a more professional way without partisan squabbles and just has to be streamlined. Many people agree with that. Hopefully, next year in Albany, we will get to work on that, but it's very politically sensitive. So you know those things make things take longer, so we had passed a law that gave a hundred million dollars to hcr, to distribute to people who were in crisis in terms of paying rent. I thought that the 100 million dollars was really a drop in the ocean and we needed a much more robust program both for tenants and for primarily the smaller landlords who are not getting the rent. It's a symbiotic relationship here and it turns it turns out that Hcr rejected 57,000 of the applications after a very cumbersome application process where people would go through the website and get to the end and then crash or unable to submit so 11,000 people submitted by a paper. But there were about 94,000 applications and 57,000 were just outright rejected, which means they're, 57,000 households out there do not know what they're doing they do not know how they're going to make rent and they have not paid rent in the past few months. So this is really a crisis and I'm hopeful we will go to Albany and fix this part of what people were banking on was that you know there'd be a big change in Washington and we would get a swift stimulus who knows what'll happen if we do not win the U.S Senate, it's going to be very difficult, but really people are becoming homeless. Landlords are taking people to court. I've had a bunch in my office, even though you know they can't evict someone right now. It's still, you know terror, it's terrifying for some of the people who get these notices because they just do not know where their next dime is coming from. So that's a real, a real problem and these are among the issues that we'll be tackling. Hopefully, if not here this year at the beginning of next year. I know some of you participated in my flu shot day, I'm having a shred day, which is usually everyone's favorite day on the calendar, because you've been saving up all your papers, so November 10th in front of my office, 230, West, 72nd street. I believe it's at 10 to 3., bring your bring your papers, bring whatever you want to get rid of furniture, not accepted, but you know it's a it's a good day to clean up. We in terms of moving the toe pound. Yes, we levied a humongous penalty on the city because they have neglected to deal with the issue of moving until pound, but we are in a far different world than we were just six months ago. The cars that are in Midtown and that are towed to that topam are not there and I think we have to re- imagine the way we approach taking up valuable real estate for a tow pound right across from the water, where that could be used for other purposes toe pounds. I do not think need to occupy such important, precious real estate people. We have to look at how car culture is changing and I know Jeffrey is smiling inside or even not inside, because he's been very adamant about that and Linda. I am sure Jeffrey is smiling from head to toe with that comment, but you know we're on the same page with that we can't we can't do it, and so I have asked months ago and I'm continuing to ask the city to show us where else they've studied. You know they said they studied seven plus sites, but I've yet to see any paper that backs up that claim, and so we're all going to be on this. It's important to get it off. You know the pier, but it's not suitable to be right there, because people park their cars illegally. We have to treat it differently, and so it's one of the things I'm working on. I told you about the park to with Clinton park, getting it fixed up, we're waiting on parks for that, and I think you have a longer a long calendar so I'll bow out here, but I'm always around. If you need me and thanks for doing your job, does anyone have any questions for assembly member Rosenthal, Dale, no you're, just snapping? Okay, that was for the anti- car comment again. I know I know he's smiling too from head to toe yeah. Thank you. So thank you again for joining us. I think that does it for the electeds who are scheduled to speak this month. As you all know, we rotate our electeds. So we do not spend half our time listening to elected officials each month. We split them up in two. I do want to recognize that Carl Wilson from Speaker Johnson's, Office, Luke Wolf from Controller Stringer's office and mat Tai from assembly member godfred's office are with us tonight as well Lowell, just let's the espionage. Oh sorry, I believe from Senator Jackson's office, Senator, Jackson's office and Leslie Splatt, sorry Leslie. I did not see. I did not see her name but okay. I think she was here anyway we're now going to move on to our district manager's report. Jesse bodeen, the indispensable Jesse bodine evening, everybody I'll be very quick. So we are, we officially have a new home. It is at 424, West, 33Rd, Street, Suite 508. We I and the staff are still continuing to work remotely and are accessible by email, phone and regular mail, but we will slowly be moving into that space and getting it ready to eventually have. As a you know, seven five day a week, normal business hours, office, space, October committee- I mean sorry, November committee updates and board reminders, so Wednesday, November 11th the office will be closed for veterans day Chelsea, sorry, Clinton, hell's, kitchen, land use, sorry Jd will be rescheduled and notice will be going out shortly on that all other committees are meeting during their regular time. Just a friendly verging on non- friendly reminder that all board members need to fill out their virtual vote sheets by the end of the meeting or at the very end of the meeting and submit them. We can't count load late vote sheets and just one house cleaning thing for tonight. There's a couple folks that are still have their just CB4 members listed as their names with when they're, not on camera. So you have to rename yourselves. I can't tell you, we can't tell you who you are and the and the the public can't tell you tell who you are so, if you're going to vote, you need to be able to be seen. So if you can rename yourselves and then at least minimum, and if not, then you need to be on camera. Thank you. Thank you, Jesse, the those of us who are running for, I think in all cases. It's now real election of the executive offices of this board underwent a grueling interview process with the Nominating committee. So now we get a report from Paul devlin, the chair of Said Committee. Thank you. All. The nominated committee met and interviewed with all forthcoming candidates we're pleased to announce that each officer of the Community Board has decided to run for another term. There were no challenges and the Nominating committee has endorsed all of the existing officers as qualified to run and support their candidacy. I believe I have the opportunity to open up Jesse's. Stop me if I'm wrong open up the floor for any other nominations before this process ends, and I do not see anything in the chat box saying that's the case, so we're going to close this now and vote at the next meeting, but the nominating committee has now fulfilled its duties. Thank you for the opportunity. Thank you. Paul. I'm seeing a question in the Chat James Wallace was asking about the address of our new office, which is 424 West 33rd street, and it's on the fifth floor for those of you who did not catch that. My report is up next, as you've heard from the members of the Public West 36Th Street is still a problem. We continue to meet with DHS and the providers to try and improve that situation. We are maintaining our position that one of those hotels needs to be moved, as you heard from the residents we are joined in that by certain of our elected officials, not all of them, but we continue to push for that and we continue to meet with DHS and the providers and we, as we've been you know, asking for and doing in certain cases. Since this all started back in March, the CB4 members of the night, Chelsea NYCHA working group are meeting and making great progress. I understand I want to thank Joe, Betty, Elzora and Mike for participating in that, and hopefully we should be getting some feedback from them on their progress shortly. There are a group of us myself, Jeffrey, Allen and Leslie, who met last week as part of the Hudson River park, Pier 40, pier 76 task force. The task force in the state have basically decided that nothing is going to change on pier 40 anytime, soon, no great, surprise there, but we are moving ahead with pier 76 in terms of planning for once the tow pound is moved and there will be a presentation at the Waterfront parks and Environment Committee next week to that effect, to follow up on where you will hear some of the results of what we talked about at that working group meeting. The only other announcements I have is we have two members of this board who are stepping down Raksha Kumar has stepped down already, and I am very unhappy to report that due to pandemic and other related issues, we are going to lose the services of Morgan Mclean Morgan, I'm actually. Looking at you do you want to say goodbye, hi everyone. It's been an honor to serve with you. Thank you, lowell. I have to move out and that's all I can say it's been 32 years and I will miss you all I'll, join you for zoom. Anybody who wants to open a nightclub in their building give me a call I'll give you a hand, especially Joe Rastucci. I know how much he's missing his nightclubs and guys Christine. I forgot you're next good to see you all I'll, join you on zoom meetings. I will not vote tonight or will I vote tonight? Lowell. We, I believe, you're. You resigned effective after this meeting, so you can vote. I will help you with a quorum folks. It's been great to be part of this I'll, miss you I'll try to get back as soon as I can, but I got ta move. Thank you. Thank you for your service morgan. It's been a pleasure working with you and you're, getting a lot of silent applause that does it for the public portion of the agenda. We now move into the business session moving at a breakthrough tonight. There are eight items from the build business license and permits Committee, Frank and Bert. I saw Frank. I do not know if I saw Bert. I do not know who's taking this from here, but the floor is yours, I'll take it. Unless anyone has any questions or wants to discuss anything, I would propose. We bundle all eight of them. Are there any questions on any of the eight SLA applications pending for the month gone once going twice all right. We move on to the Clinton hells kitchen land, Use Committee. We have two letters on slaughterhouse Jean, Danielle jd you with us. Yes, I am here. There are two letters about the slaughterhouse site, which is on 11Th avenue 39th to 40th street we've heard about this before give a shout out to Joe Rostuccia when he was a young man just getting off the boat from Newark, he saw that piece of land. He said that would make a great, affordable housing site. That was many years ago. We are actually moving forward on this. They came before us that is, the developer came before us in June. I think, with a presentation of the building design, it's basically two towers, one for a hotel and the other for affordable, permanently, affordable housing. The committee had some ideas about the design, we're not a very shy committee. They came back this month that is the developer and Lo and behold the modernist and the classicist, and the reactionaries and the radicals on the board all thought it was a pretty good design. Everybody seems pretty happy with it. We still have some asked about it, so there are two letters before you tonight. The first letter is to the design commission. They have to sign off on this building. The second letter is to ransom, the developer, there's a little public space in front of the building, and we want it designed and we asked we wanted better designed and we asked if we could helped them out and they agreed. So that is a letter to the developer, reminding them that we want to talk about the design in front of the building and, as christine bertay has pointed out around the side of the building as well. None of this is controversial. They will be coming back to us. If you have any questions about the affordable housing, I will defer to our housing experts, Joe and Maria that will be finalized at the next appearance of this slaughterhouse saga. Jd you got, it looks like you have a couple questions marty, the cat. Thank you marty. Thank you, hey jd, all right, I'm so glad that this project is moving forward. If you remember- and I'm sure you do, that it was originally not going to be a hotel, it was going to be a single building with all affordable housing that was supposed to make up for the affordable housing that was to have been placed in what's now at park on 20th street. When I read this and took a look at item 16 a which is the budget, I began to realize that our community board has a great deal of concern for homelessness, and yet we focus on housing that we say will exist at all levels and I'm just throwing out as a comment I'll vote for this, but I think it's time to put the homeless issue together with our stance on what levels, income, bands of housing that we support- and I know Joe for one- has been arguing that it needs to be diverse, but we have a contradiction between our concern for the homeless population in our district and not have it not supporting enough housing that will house that part of the population, the homeless population that does not need supportive housing or any of that. So I just wanted to make that comment. Thank you for listening. Sure good comment. Thank you marty. Thank you. Marty tell Corvina Dale yeah thanks yeah. It's been a really interesting process to see this building go from like an all glass tower to something more contextual and more relevant to its function. I just have one quibble, which is the paragraph about the starts: further refinement of southeast corner etc, which is a recommendation about the solidity of the corner. That was an opinion that was expressed at the meeting, but you know, for instance, I had a different opinion, so I do not think that's a consensus opinion of the committee and I wish it was not in the letter. The letter on the public space is yes perfectly aligned with what was expressed in committee Dale. It's a good point. Would you like to? We could add your difference of opinion from that in the letter. Would that be helpful yeah we could do a while. Some of us were this, and some of us were that we suggest yeah something along the lines. Oh sure, absolutely thanks all right, Jeffrey. I think I've asked this question before so I apologize. Why is pdc having a moment on this? The building is on the land is going to be owned by the city, it's good, so any land, that's municipally owned. The Public design Commission gets to a pine on no it's going to stay on. It's going to be a ground lease, a land leave sure so, therefore, well something that stays in city ownership is subject to pgce review. Okay, thank you and Joe. You had a comment. Yeah first marty. Just so you know the hundred units of supportive housing 60 is for homeless singles, so we have actually by our efforts, gotten homeless, housing into this building. The second thing is we note in the letter that we've had 45 meetings about this project, so far meetings phone calls, but I want everybody to understand the board's first letter about this site was in 1986., so we have persistence. That's the one thing, that's amazing here! So the fact that we're this far is pretty amazing and I think, we're down to the re. If it's Dale and I disagreeing about a corner, damn we're in good shape in this building would. I would also add to that we, the it's very productive at this point, working with the developer and the design team. So it's a good relationship yeah! I just prefer go ahead, Jd, I'm sorry! I did not mean to cut you off it's okay. We are further to go so stay tuned yeah. I just wanted to point out that in 1986, when this first came up, Joe had already been on the board for 32 years. Only four, only four, I saw Betty Mcintosh's hand betty the mute Button. Please it's fabulous that this project is has gotten to here, because I know when I started on the board. I do not know how long ago it was it was percolating. I just had a tiny question about the affordable housing, so you said, 60 of it is for homeless people, no 60 of the 100 supportive housing units will be for homeless, individuals, okay and then 40 is for commun general population community, but low income, okay and then, when the sentence that talked about services in item number, nine right before the conclusion talked about, you know special services for the population, and I get I guess. Maybe you would want to change where it says: integrated, affordable housing program, the units that are just ordinary, affordable housing are not to get those services or are they also no betty? The issue is that it was proposed to the board not quite clearly by the developer, that the possibility the support of housing units might be segregated on different floors in the building. We want to make sure the building is fully integrated, irrespective of the type of housing throughout okay and then the services. As for everybody in this housing, no, that last piece is about the supportive housing component. Only services, okay, I think something got a little- maybe needs to be a little clarified on that. Why do not we work on to clarify that I'll make a note? Yeah thanks hector yeah, I'm pretty excited about this project. Unfortunately, this was started way before I even joined the Community board 4 and I'm glad to see that Joe has been a part of leading the charge on this. My question is, though, I know you answered Betty's inquiry about the homeless population and the services, but as far as the affordable part, how affordable is it going to be low income, meaning at what type of income are we talking about so hector? This project is a replacement for site M, which was a site to be acquired by the city through the number seven line: 155 units of housing and the 20th street site. 136 West 20th was a park now both of those sites were meant for people for 80,100, 125 and 165 of for basically moderate and middle for working when those sites disappeared. This is the replacement site. This is the slaughterhouse compromise the community board crafted. Additionally, though, now we've crafted we've grafted units at 50, 60 and 50 for the lowest income, which will be the support of housing. So in one building we will have units at 40, 50, 60, 80,125, 100,125 and 165, so that full range so someone's going to fall somewhere on that spectrum. When there's an actual lottery wow, that's very impressive. You were able to pull that together. One good job, Joe keep going with it good job, any other questions on slaughterhouse I'll. Let you sum up jd! I just want to make sure there's no one else with their hand raised. I do not see any all right, jd floors, yours again, sorry, one historical aspect: there was a slaughterhouse there and on that slaughterhouse there were these giant cow heads. Joe Restudya has those cow heads and we're hoping that they will be placed in that little park area that we want designed and Betty had a great suggestion, maybe some kind of historic plaque or explanation of what existed there. Part of the history of Hell's kitchen all right. Thank you, Jd. Thank you! Joe, I'm going to move on to transportation. There are four letters here. One has already gone out and it's just for ratification because there was a time element to it, but I will let christine and Dale Jd you're raising go ahead. Are we going to vote on the letters? No we're going to vote all at once, like we always do gotcha, that's the zoom rule. So I was going to let christine and Dale explain the four letters, including the one that was ratified and James Wallace I'll, come back to you in a minute sure, sorry about this, but item number 11. We have to modify because DOT presented a plan for CitiBike expansion and they inadvertently included a site, an expansion site that was not within Cb4S bounds and this version of the letter comments on that installation. So once we realized that it was mistakenly identified as a CB4 site, we removed all mention of that particular installation. It's the fit one so this letter that we're considering, I think Jessie- has the new language. Jesse and janine have the new language, but it strikes any mention of the 27th and 8th avenue site and also its strikes are, are haranguing them for doing sidewalk sighting of docks. Since none of the new none of the expansions occur on sidewalks in our district, so it mainly focuses on writer, a request to expire, expand, rider education and also to do some more station maintenance and clean up and then, as far as the ratification goes, there was a time constraint on the let which one was ratified: the the letter for 30Th Street 30Th Street, which is a request for D.O.T, to consider some greening along 30th street. Since they the repaving, is imminent. We wanted to get the letter to them as quickly as possible and the other letters one is on the helicopter use and it's supporting nadler's legislation restricts Manhattan airspace. One of the nuisances that's happening now are touristic flights of helicopters like Instagram trap. Helicopter rides where people take selfies from hanging out of the helicopter and it's just completely non- essential and they're hovering and they're flying over Manhattan air and they're operating out of New Jersey to circumvent any restrictions in New, York, City, teleports and then the other letter is bike, safe measures for 8th Avenue and 45Th Street. In response to some specific incidents at that corner. Okay, we got a bunch of questions. James wallace your hand was up first sure, first, this great few letters here and I hope these are friendly amendments and it's sort of couching a question. I guess this is for Dale in 11 and 12, and I do not know where it would be more appropriately placed. We heard the testimony earlier of the lady who got into a accident with a bicycle, and it's mentioned in letter 12.. I just feel like. Is there more? We could request regarding both enforcement. We talk about compliance and education, but we do not talk about enforcement and that's the one thing I was thinking of and then the other thing is along with that. As a regard CitiBike, it seems maybe and again I'm just floating this as an idea, hopefully a friendly amendment. I used to have a CitiBike account. I love bicycles. I have nothing against bicycles. If there are people who are using them incorrectly unlawfully ever forbid, causing injury, it might be easier to identify who those people are. If there was large numbers- and I would imagine- that's something that could be mandated- I understand it does not solve all the problems. It does not solve the problems with bicycles that are delivering food, but CitiBike is a huge program and if there were large numbers like four digits, for example, I'm just throwing it out there, then you know it would not be unique, but it might be easier to identify people if they like hit and run or whatever. Oh, I see you're saying that the individual bikes CitiBikes individual bikes should be identified numerically identified yeah. The first letter- I'm not sure, if that's this, I mean I recognize both your concerns, but the first letter is specifically addressing their expansion for three sites within the district. So I'm not sure if that's the place to raise it, but maybe the place to raise it is where there are safety. Concerns is the second letter and yeah. There is a. There is a discussion in letter 11 and wherever you decide is fine. There is a discussion of education and yes compliance so, but I'm sorry really quick. I just noticed that Chris Lebron mentioned that the bikes have I d numbers. I do not know how visible they are from a distance. I'm aware that I mean, I think I think we could add something along those lines so that the within the education component that individual equipment is clearly identifiable in the case of any misuse yeah. Oh, that was it I mean. I would consider that christine. What do you think is that a friendly amendment christine you? I was saying that makes sense: okay, yeah so we'll take that as a friendly thanks, James Sarah Apple. We put big letters on dogs too: okay thanks Brad, Sarah, Appleton's next yeah Dale. Just a quick question. I just was not sure. If I heard you right, given that sidewalk site is no longer in our district, are we still just making a general statement in the letter that you know just as policy? You know. We are aware that there are sidewalk sites in other districts, and you know hope that as policy they will start not doing that. Are we totally taking out any mention? Well, there could be a mention of it under compliance like, for instance, one of the non one of the you know, one of the one of the not the compliance issues we see of late is riders on sidewalks. So I think Sarah is talking about locating the dock. We could keep that sentence as a position as a general as a general assertion or as a general principle right, but we do not want to ha hang on it too much in this particular letter. Only we have, I think we have raised that before and also this letter is specific to three expansions which are not on sidewalks, so we want to. We can just remind that and yeah. We want to encourage the fact that these are non- sidewalk. We could say we applaud the fact that, however, stay off our sidewalks in the future. Okay, great thanks just watching hector yeah, I I'm thinking along the same line as James concerning safety. Is there any way to incorporate in this letter or maybe in a future version of letter? Similar to this? Where part of the issue is that a lot of these bikes get stolen or just taken out illicitly out of the docks, because they're not locking properly, they need to upgrade the security devices on these bicycles, and I'm aware, when they're stolen, I believe they have GPS. Somebody had mentioned that they do, but I do not think there's any real enforcement, because there are folks riding on sidewalks illicitly and I see kids all the time pulling them out, checking the bikes to see if they're unlocked or not- and it's very simple- I mean sometimes they're- not working at all or basically, you literally have to jam them in there just to get them locked if they're working. So I could see why they break all the time. So CitiBike really needs to be approached about upgrading how the stocks will function. To be honest with you, so maybe they can it'll reduce the amount of stolen bicycles and bicycles used in illegally and that hopefully, will cut down on joy rights and kids people getting hurt. Unfortunately, people that are not authorized to use the CitiBikes because, honestly, if they can pull them out of the docks, there's no way for them to track who the actual individuals are and I'm curious to see what the numbers are on enforcement on these bicycles that are taken out and used in criminal activity or just illegally on sidewalks or you know just for joyrides. In general, because I do not think anybody's keeping track of that as well, so I like to see some more accountability on a part of CitiBike to be honest with you and I'm a big fan of Citibank. Do not get me wrong, I think, but expanding way too quickly. You know, honestly, I'm not aware that is a prevalent issue and I would like to ask I would you know I would like to circle back with the CitiBike reps and ask them about that. I'm I was not. I was not aware that was a prevalent issue in terms of the theft, okay, so Dale it's beyond the scope of this letter, then I would say: okay, so hector we'll take it up. Next time we get CitiBike all in. Thank you, okay. Marty. Thank you, I'm concerned about the on sidewalk policy this particular place, which is not in our district. I did not think of that. When I was reading, the letter is an extremely wide sidewalk, so the department was, I think, making using good judgment to put the bikes on the sidewalk there and, as a result, not interfere with the loading and the commercial parking that block is most of the week, so in the reassert insertion of a letter about no our policy of no sidewalk installations, I think you need to be more careful. They made a good choice in this place to put the bikes on the sidewalk, and so we should evaluate that much more on a case- by- case basis. I understand the argument for not putting bikes on an eight- foot sidewalk. That makes a whole lot of sense, but it made sense to put it on the sidewalk. In this case I tend go ahead, christine right. Well, first of all, it's not in our neighborhood, so we're not going to deal with that, but this has been our policy for a very long time to not put them on the sidewalk, and one of the components of that you know policy is that once the bikes are on the sidewalk as a parking. Indeed, in order to get to the dark, people have to ride on the sidewalk, so it is an incentive to the wrong behavior, even if there is a lot of space. So for that reason, in addition to the fact that we have generally narrow sidewalk, we have said we prefer not, I mean we have. We have some of them on the sidewalk and we have considered them and we have done it in multiple places. So you can be assured that we are taking. You know one by one consideration. Usually I would say it's a general guideline you're, absolutely right. It should be a general guideline, but it should be case by case, but also we're concerned about, like developing a culture of compliance and the sidewalk locations when they're not absolutely necessary, muddy. That argument- and I did cons, I think maybe we could do something like make sure that there's like enough signage and wayfaring to and instructions to like get your bike from the dock and then walk it to this well, where you can get out onto the into the lane, rather than take off on your bike on the sidewalk. Like if they could do some signaling signage and wayfaring at their docks, when that's necessary, but fundamentally I think if we put a sentence, which is a very general one, and we are happy that they did not put it on the sidewalk, because it's our general, you know approach to it, does not it's not really telling them. This is a policy or whatever it's just a general statement. I'm good with that. Thank you. Okay, thanks all right, all right, wait, hang on. We got one more Brett. Firfer has his hand. Oh great. I was just going to take some of those points to tell and christine made about the sidewalk. It's which has been made. I mean it's all. It's also I'll just add it's also a sidewalk congestion issue. Even if someone is not riding their bicycle on the sidewalk to get to a dock, they might be walking their bicycle and so on a busier sidewalk. It gets people on the sidewalk with their bicycle takes more space. Why do you decide like? I can hear why it might be less of an issue, but it's also it's also about predictability. So if someone is a CitiBike writer, they always know the doc is on the street they're accustomed to approaching the document a certain way and if we're consistent in advocating for them to be on the street side, the city program, hopefully, will take our cue always put them on the street, and so there will come a day where they're going to do a redesign of those stocks. I'm sure you know 20 years down the road 10 years. So if the behavior is you approach it from the street, you dock it from the street, they might have a design that will be more appropriate to have this, the bicycles as part of the street traffic at the sidewalk traffic yeah. Okay, any other comments on the transportation letters all right. Seeing now we're going to move on. I'm sorry tail can't hear you, though I think you're having Mic trouble. It's not that you're muted. All I said was thanks. Oh okay, there you go you're, welcome we're going to move on the housing, health and Human Services committee. There is a letter on the 36Th Street, Shelter, Joe and or Maria. So this is our monthly 36th street letter and it's basically a pretty much a repeat of our letter to DHS and the mayor's office and NYPD, and now this is directed instead toward the elected officials to meet with us to discuss this specifically come up with a plan to solve a problem. Let's get hopefully get the elect, that's on the same page, and we put this graph in the center after line 26. That shows you just how much we are bearing in our district, but then out of that eight percent of the single homeless beds earn a one block radius on 36 and 37Th street citywide in a temporary shelter. So that's a crazy thing and that's why we're asking yeah gd all right, excellent letter Joe. I want to ask you and Maria if about the possibility of putting right up front right after your opening paragraph. What you have is your conclusion. That is yes, I thought about that. Already, okay got it, and could I further suggest that it? After what I hear tonight I Jeffrey can we have a two minute limit on the politicians from now on? It's supposed to be five jd, but I'm going to make a motion. We move it to two, but after what I'm hearing tonight the reluctance- I do not know how else to phrase it of our electeds to grapple with this. Can we make that sentence clearer, a specific we urge we demand. We insist that Dick Godfrey Brad Holloman Corey Johnson Dale Brewer sit down with the board as soon as possible, or something like that just to make it specific and more well. We actually have addressed it to them all individually on the top okay. We call them out by name, so I think. Okay, I think we've done that. Okay, but just put it up front it'd, be great, got it christine. Yes, the testimony tonight was very poignant, and I wonder if I mean at a minimum, we should be clearly there are some individuals which are more dangerous than others right, and I think I think we need our elected and the NYPD to address that the people which are really dangerous should be removed. For you know, there is a lot of people right now that NYPD removes from the streets. There are disorderly contract obstruction of this. The street. You know congregation on the sidewalks and you know we need to be able to take the people and remove those which are terrorizing the neighbors. This is not I mean I do not understand why NYPD can not use the laws on the books to do that christine. This is a bigger problem than just this block. Last week, my office, we have a mentally ill tenant from West. 42Nd came to our office was not letting because our office is not open. He persisted, he broke the glass in the front door. He ripped off his shirt screaming. He was an angel, the police were called, they tried to deal with him and they got a call in the middle and they left the man screaming in the middle of the street. This is an endemic thing throughout our entire city, right now, between Ems and the police that there's a sort of they're not really acting. My point is was exactly that I mean do not. We have a message to the head of NYPD and De Blasio, saying: look, you know it's one thing to put homeless people in one place and we're all for that. But it's another thing to have like a sub group which is terrorizing everybody. So it's like. I do not want to say we have a gang, but it looks like we have a gang. We did that last month when we wrote to the mayor and the police commissioner and then DHS. This is now elected officials come and talk to us because you can not ignore it any longer and we're really getting frustrated response from the head of NYPD. There has been no response to our letter from last month: Right Jesse or Lowell you're. Sorry, we have not had any official response. We've never had an official response. We've had ongoing conversations as you're aware, but there has never been an official response from DHS in writing to us. Well, there was one about two or three letters ago, but yeah I'm talking now about NYPD, because what I'm hearing today I mean you know there is not. We do not like it, but now I'm hearing people are being attacked and you know if any other person than the homeless was attacking you. The NYPD would take a step. I hope I have had. I had a conversation this week with the 10th about this very issue. Yeah and the answer was we can not do certain things. They invoke the bail law, they talk about Ams. I mean this there's a lot quite fun. Frankly, christine there's a bit of double speak here. So that's what's very frustrating well beyond the DHS and the mayor's issue that the cops are of two minds. Yeah, so, okay very tried. I tried I'm very frustrated well and finally, final question is: have we talked to the owner of the property? What was the two three, the two double treatment, double trees, yeah we're. Actually what we're trying to do christine is we're trying to reach the mortgagee. We feel that the lender is even more important than the owner. Yes, I'm glad you are doing that. Thank you, okay. I need to. I want to jump in and clarify something there. The board has not done that. There is an organization that Joe is a member of that is addressing this outside the scope of the board. The board has not reached out to the lender at all. We have been working solely with the city agencies so Joe. Maybe you want to just say something briefly about it. Yeah I mean actually no we're just trying to identify it right. Now, that's the only from the broader community, because we know that many times. For example, the Doubletree name came off the hotel because the franchise doubletree did not want their name associated. Global is talking about you talking about the new group that you have. Oh, I I'd like to really present that lola in a broader venue, so we do it once and properly. Okay. No, I just because the question about reaching out to the lender or identifying the lender is being done not by the community board, but just want to clarify that Dale. I do see you. I will get back to you, I'm going in the order. I saw the hands. James Wallace was next same to you Betty. I just have two things: one yeah the testimony today was, I mean it does not get any easier. It was just as hard this time. I wanted to say one thing to the many people we have attending the meeting, who are not members of the board. We have been working on this and we will continue to work on this, and this is, I think I do not know if I speak for everyone, but I certainly speak for myself number one priority Joe. I know you all are doing the best you can with these letters, and we can only do so much for an advisory committee. The one tweak I would just ask if you take it as a friendly amendment, is in line 48 line 48 through line 50. We use the term dangerous situation and I just want I'm going to add some language to the chat, and I just I think it helps address the NIMBY thing, while at the same time making it more specific. The current situation presents a clear and present danger to the health and safety of the clients of the shelter, as well as to the residents, visitors and businesses of mcb4. I think it just puts a finer point on it. I know this is directed at the electeds and I know that you know you know they come to our meetings, but I hope you take that as a friendly amendment. It's just trying to put a finer point on it. James just emailed me that, because we had a, we had similar language than the prior letter that I took out, so we can put it back in but just email that speech like I can drop it in. Okay, we'll do, and we also received some other emails for other friendly amendments. So thank you. We got a lot of clarifications from folks on 36th street things that were not quite right, so we're fixing that also lol. Yes, I'm on Mute, I got it. Katie stokes is up next hey there. So I think Jd's point is a really good one. I think it's important that we bring up to the beginning. You know the ask about de- densifying, and I think that there was a point that we made in the last letter. That is not in this one that I would suggest you bring up, and that is simply that we're happy to have it in our district, but we need it. We need it moved, so we want to do densify, but we're not asking to put it somewhere else. I think that's a really strong point and we want to make sure that the electeds know that yeah so- and I also I will say that I think the thing to really focus on is the identifying and not just you know. This is dangerous to everybody, because they're going to argue that would be true about any of them and that that it does not really make the point about De- Densification, so we really just have to, I think, focus on De- Densification, but anyway, I would also just suggest adding the language about the fact that we're happy to have it somewhere else in our district got it dale you're up. I have a question joe. Maybe I, as I understand it, this all was precipitated by the fact that they had to move facilities due to Covid-19. Are they seeking to cure the congregate shelters or so this is? This is a this? Is a short- term situation they're going to be dealing with for an unknown but longer period? It's not it's not getting. There's no timeline for them to go back to whatever normal was the DHS indicated a number of meetings. This would be sometime in the second or third quarter of 2021 the earliest to move people back, and they were not even clear about that date. They said that's what you know that was it so they're not. Are there active measures to cure those buildings like to make them to improve the ventilation system? No they're, just moving? No, it's not about ventilation. It's that people are in a congregate, Africa context and like that is the nature of it. You know right, okay, got it thanks, Mike, noble yeah! You know, I think letters great one thing that I wish is that everyone we've addressed these letters to could have heard the testimony tonight. We had a few people, well, the most intense testimony heartbreaking testimony as a matter of fact, so I'm suggesting we drop a link to this meeting into the letter. Let them hear if somebody in their staff wants to hear this meeting. Let me just note that we have had multiple housing committees attended by multiple elected official reps and the testimony has been as heartbreaking and disturbing every single time. Okay, I think that people who hear this and do not understand the nature of living there just are being deaf well, because tonight is like what was the you know, cherry on the on top of all the testimony we've heard at general meetings tonight was the best there's only a handful of people so anyway, but yeah Mike. I do want to point out. Brad said he heard it. Carl has been here all night from Cory's office. You know, and you know Dick so Dick and Gayle are already you know on. You know on board with this, and some of the folks also from who live on 36th street have also sent emails and spoken to reps from each of those offices, and it's also the poor souls who are running around doing these things. You know kind of think about those people yeah. I think I think James's language addresses that Mike I'm going to move on here, Betty first, regarding the letter, which is a great letter, I think, even like the first or second sentence should be. We want an action plan and I think you need to put the community board vote information somewhere up there up front. Do not we need to have. We voted right, I'm sorry, it dropped out from the reworking from the prior letter. Okay, but I'm not done on this. I have heard I've heard I have heard going to every housing meeting every community board meeting and I'm so upset for these people, and I feel that maybe this is too radical. But at some point maybe it's not the official community Board, but some kind of either protest. Publicity, local newspapers, these stories or to get out- and I do not know who you want to embarrass- but I maybe that's not what the community board does, but maybe somebody whose name does not have a community board affiliation, but I mean is not there some kind of more dramatic action we can take Betty but Joe before you answer that am New. York did pick up a protest about this. Of course they did identify a picture of dolores as Maria, but they did pick up the story. So what Lol spoke to before is that the community has organized a new group, the health Kitchen Neighbor coalition, which is made up of the block associations, different not-, for-, profit organizations, the garment center alliance, Manhattan Plaza, tenant association, Hudson yards a whole group of people together to basically bring publicity to this, because we really believe that it's not understood that we're, not the folks on the upper West side. We're just saying we do not like anybody, but it's just horribly managed so betty that activity is ongoing and Jesse. We can send him the articles and coverage so far and the ongoing efforts, because there's also now just foreign information, a lot of video that is beyond disturbing from what we've heard tonight. So where is that video going to get seen by the public that is being brought to various news organizations, so they can make a story of this buddy good? That's I mean at some point. We've got to get that out so that somebody gets embarrassed by this right and normally that's the function not on the community board, but of the community active activity or organization to pull stuff together. Well, I'm glad that they're doing that is that carefully said low yeah. That was good. That was good brad! Oh yeah, thanks just a suggestion. It's good that you're trying to get a meeting with all our electives just to kind of hammer the point. I would suggest that in addition to the meeting, or maybe you have the meeting outdoors, get a tour like walk see if you can get them to walk, then we've done tours. The problem is Marie's done them. When you do the tours. Dhs knows about it, everyone's gone, it's the most ridiculous thing in the world. Well, do not publicize when you're coming just you know, I'm just saying meet and then take a walk with the with the public officials and say like this is: let's go. Let's go see before we sit down to meet and you know see if you can get that you know, and you know a little bit like what Ben was saying, invite someone from the press for your for a little impromptu tour as well. So you can get somebody on record, saying: oh yeah, that's terrible! We got ta fix that Brett. I know Brad has done that on a couple of occasions. I know that I think I know Carl is aware of it. I do not know Carl has done it. Yeah Carl's done it. I do not know that cory has actually done the area we're talking about. I do not know that Eric has, but I know Carl has from their office as well. Awareness Eric has, I was very careful. Okay, that was yeah. Christine Brad did one today. Robert Jackson has DHS hands yeah, but all these tours are nothing because when you tour and at the end of the day, what do you do nothing? Well, it's not just to go see what the with situations on site all the people that are coming to speak, the neighborhood neighbors, let's you know, meet them along the way, hear their story, so they can actually point. This is where I was on the sidewalk when this happened to me and it becomes, I have to say quite frankly, the area is quite dicey. I would not have people be out there, because there's people are pointing to various neighbors. It's not that's, not a good thing, but also brett, some of the video there's, a video of the security guards punching the homeless residents back and forth in front of the doubletree that when that becomes more public, it's not going to be a good story for anybody. So you know all right. I've still got four hands up. I'm going to cut off the discussion after dolores I'm going to five hands up, I'm going to cut the discussion off after dolores, because I did not give fair warning. I'm going to ask all of you to. Please keep your comments. Short Jeffrey's rules. You know about not repeating whatever everyone else has said will now apply hector. Oh that's not good anyway, just to make it short being on the housing subcommittee with Marie and Joe. It's been very aggravating, to say the least, and I really feel for these folks and living in NYCHA housing. I mean we've dealt with this on a daily basis for for a while, but to see such a densely populated area with so many hotels and the homeless situation has really gone out of hand. It's very disheartening and I really feel for these people. Recommendations are yeah. We're going to have to you know, somebody's going to have to embarrass some people, unfortunately, and the higher ups and with DHS and the mayor, probably as well, because folks are not doing their job and somebody needs to point that out and put the spotlight on them and, unfortunately, that's the way things need to get done. Sometimes, all right, I I'm going to jump in there. It is not our role as a community board to embarrass other city agencies or our electeds. There are other groups that are working that angle. We're going to continue to follow the tone of this letter, which is one of these hotels, must be moved and that you know we are asking you to help us get DHS to move this. If the electeds do not get on board, we will do this ourselves. It is going to happen because we're not going to let up, but in terms of the embarrassing thing, that's not our function. Leslie, I feel like I'm Groundhog day. This might be the 135th letter about this that we've talked about and Joe and Maria. Your letters have been really, I mean all of them have been great, but I do have to say to every they're aware the elected officials are aware of the problem. They know. What's going on, they've done walks, we have talked to them umpteenth times. They are some of them. I want to give props first to Gail, Dick and Robert, but the ones who have not signed on to the letter or our cause. I guess they have a moral opposition to the word or the De- densification part. So, no matter what we talk about de-, Densification or moving a shelter. They said they are not going to sign on to, for whatever reason whether it is political, whether it's a media thing so Joe and Maria and Lowell, I guess to a certain extent. What can we do about that part that they kind of put their foot down and said? No matter what we are not going to sign on to anything that says: De-, Densify or move, so we're not asking anybody to sign anything we're telling them. This is a real problem. It's not going away and we need to solve it and you need to be involved in the solution. This was the request at our last meeting of housing was okay. We now spoke to the city agencies now use our elected officials representing us, weigh in here and work with us to solve it, and I mean the problem. Is that you're right? It is Groundhog day, but it is getting worse and I said, meeting after meeting I'm concerned about it. The next incident happened that is going to be just unbelievably dangerous or troublesome, so yeah, and we can do that. I mean we have made clear that as Joe said, this has to be solved. We have given them the solution. We have said we will. We will gladly move this within our district, so this is not the upper west side. This is not the financial district. Where you know there are coalitions of NIMBY people trying to move this. That's not the position we're taking here. We just want this solved for the residents of 36Th Street Dale did not you get one bite at this apple already did, but I have a different question totally very quickly. Please not grandstanding. I just want to know Joe and Maria. Has any effort been made and I'm not impugning anybody if it has not to identify an alternative site, an alternative operator, because I know that would that's going to open a can of worms somewhere, but is that a is that a road we should go down? We have. We have two things. One is we've said within the district. The problem is, the hotels are referred by the Hotel Association in New York, in a contract with DHS, so basically they have to find a willing hotel owner operator to do it. So why are not they in on? Why are not they on this letter and say, look we okay, gotcha thanks and then for the operator, we're very clear where our concern is what if it gets moved when it gets moved and the operator does not perform. So we really want to know what happens next on that. Okay, Paul thanks. This is not directly about this letter, but to follow up on a point that Dale made earlier, and I know we're trying to deal with an immediate crisis. But is anybody talking to DHS about retrofitting existing shelters to de- congregate for the future, so that? If they're going to be in these hotels until the third quarter of next year, are they doing construction to retrofit those old shelters? And can we as well really believe that there's a huge plan you're in a different city joe? You need to be a little louder? Yeah, you believe, there's a huge plan, you're in a different city or you're at least living thinking, there's a different mayor with the circumstance there's a management problem on the providers in the agency in the mayor's office. It's a management problem. I want to say over and over because in fact we have groups operating. I said in multiple meetings: black veterans of social justice, of the watson. We do not have these issues, it's not so many people and it's well managed. So I do not know how we can get clearer until we scream into this into the sky about it, and I just want to highlight something: bvsj that is on 36th street. They have 330 beds where it might where the Doubletree site Mica, the provider has 275 and you can. The people who live on 36th street are speaking mostly about the doubletree, the former doubletree. So I think that tells you something about the way, the shelter provider the way it's managed. I'm sorry, I'm sorry, I'm talking about a completely different issue. Yeah now Paul, because you're talking about a different issue, I'm going to shut it down in the interest of time. We can circle back to that at another time. I hear you, I understand what you're saying, but let's stay focused on this letter right now I submit what Maria just said and what Joe said about black vets. The last call we had with DHS all of the providers on 36th Street were on the call- and I asked point blank, the Rep from black vets for social justice. You know I said you're running the watson on 57Th street, the biggest complaint they've had there is they had one noise complaint because you know people were congregating and talking in the courtyard at the hotel where they're supposed to be, but it was bothering a neighboring building and they fixed that. I said: what's the difference between 57th Street and 36Th Street and the guy from the shelter operator said, the problem is density, so DHS has heard this not only from us, they've heard it from the providers as well. Dolores you're, going to you're going to take us home on this. I'm sorry low, just contact just to give context the reason bvsj mentioned the difference between 57 and 36 is because they also run a site on 52nd street yeah. No, I think Joe made that point that they're running. So that's why I asked the gentleman's name is Jelani. I asked Jelani point blank in front of DHS. What's the difference and DHS heard loud and clear from even from the providers that the problem on 36th street is density, all right, dolores bring us home on the topic, I'm not quite bringing home, I'm actually suggesting something. Joe Maria, I'm thinking that if we were to add as an addressee- and I do not know who the person would be, but the essentially the New York State Tsar for Covid-19, someone within Cuomo's administration is very highly concerned about the rising numbers we already have had. People speak to the fact that in that zip code, the number of cases have risen. Dhs continues to say that they have no cases mainly because, as we understand as soon as anyone tests positive, they remove them. That does not remove the health threat. I think we need to be addressing to Cuomo's Covid-19 task force or whoever is ahead of that area, to highlight that this is also a health issue for everyone involved, the residents in the shelters and the residents on the street, and they that may give us another angle for a little bit of firepower for the governor to take notice of something that will be pushing against the great progress that he has made in stemming the tide of the virus. So dolores I'm going to suggest that we do that at our next housing community meeting and you're going to do the research to find out who we write to, because I think it's important that we keep this letter focused and get the next issue, because basically we have to keep this on. Everyone's attention span understood so then, can we at least see the governor so that there is a trail of that being flagged to the state, and then we focus this month on bringing a very specific letter to talk about the Covid-19 risk. Thank you all right. Thank you, dolores I'm. Sorry, if there were other people who wanted to comment- but I think we know where this letter is going, you know I commend Joe and Maria for staying with us as long as they have. We are going to get this done. I do not know when I do not know how, but we're going to get this done. So that's it. That's for housing, health and human services. There are two letters coming out of exec one is the statement of District needs. Jessica will handle any questions. Anyone has thank you lol. I just want to start by. You know both acknowledging that it's the it's the work of the budget task force and, more broadly, the community board that puts together the district. The statement of District needs and identifies priorities that we are looking to fund within the district. We had a great number of successes last year. I think everyone might still be tired from last night, so I won't go through them all, but I encourage you to look at page eight on the statement of district needs, where we outline what some of those accomplishments are. Certainly things for schools for housing for some of the key priorities that this district and this community board have championed for a long time. This year is obviously a very challenging year where we are simultaneously, you know, obviously experiencing a global pandemic with economic impact that we're just beginning to feel frankly, and so the implications for the budget obviously are going to be significant. The budget task force worked with all of the chairs of and all of the committees to come up with a plan for how to think about the priorities recognizing that we have long- standing priorities of the community Board that we abide by, while also recognizing that this is an incredibly changing and challenging environment, and so I really want to give a lot of credit to all of the committees who dug in and did the hard work of saying, yeah. We've prioritized x, y and Z for years, but we're facing something we've never faced before, and so we're going to put those things not lose them, of course, but put them down on a list and prioritize some more more immediate short- term needs that we're seeing, maybe even long- term needs, but things that we're seeing that we had not seen before and so really impressed at how quickly people have moved to understand the needs of the community and what they're seeing to help aid. In that. I want to acknowledge that we did do a community survey which we'll be sharing back to all of the different committees very shortly we had over. I think it was over 200, maybe even 300 responses from the community. We use this to kind of give us a texture of where people were seeing challenges. Obviously, there's a process around the things that the you know. We need to have written letters on this. We need to have had meetings on things, so we use this the survey really as a as sort of a touchstone for where is the community and what are some of the issues that maybe we were already hearing and seeing at the at the committees. We will be sharing those surveys back with everyone, so that we can be a little bit more proactive or just more informed by the community voice about what's going on, but you know large by and large, the issues were our existing priorities of affordable housing and this heightened need, I would say, for issues of not just neighborhood preservation and air quality and traffic, but largely around homelessness and education, and so you'll, see in the statement of district needs that you all have a copy of that. These priorities have been amplified this year, you'll see in the budget priorities both expense and capital, a real emphasis on homelessness, prevention, housing and education, as well as associated services. And again we affirm our long- standing priorities, and so they are all we believe they're all here, and this really was a hard task of the big budget task force to find that right balance to present as a as a unified piece. So I just want to acknowledge. You know that this is a hard budget cycle and we did our best to put in the things that we thought were both most important and most winnable or most possible and obviously the more we learn throughout this process. The mayor will issue his preliminary budget. I believe in January. This will continue to be an iterative process with the goal of ultimately influencing the budget that gets implemented. July 1 2021. with that. Are there any questions or comments about either the priorities or the statement? Oh there was a friendly sub friendly amendment that we received. So if you look in the dropbox that now, that is the document that you should be looking at questions everyone's happy with, where it ended up. Congratulations, Jessica! Thank you all right. Finally, last letter coming out of exec, this is actually coming out of the social and racial justice task force. Because again, these two items are coming from task force. They go to exec first and then exec brings them to the Full board, viren or Katie who's going to address the letter. Are you here yeah? I'm here? Oh okay, can you chime in when you can community vote? 10 came to social and racial justice group. They have been working on this project since December last year, where they wanted they're calling for an installation of permanent exhibit to commemorate exonerated five in central park, and they made a very comprehensive presentation to the group. The group was very impressed with their passion and this sort of rationale and the manner in which they actually conceived. This exhibit they're not clear about whether it's going to be a sculpture or a sort of mural or a combination of the two but they're looking to do something on the northeastern parts of central park. We felt that we should stand in solidarity with the educational intent of the exhibit itself, and the group felt that we should write a letter of support and we brought it to executive committee, which was unanimously approved katie. Anything you want to add just that. Cb10 is making an effort to go around and speak to a whole bunch of different community boards, because they've said that it's important to them and and they've also heard from Gail Brewer's office that it would be really useful to try and get support from lots of community boards, because central park is a place that everybody should feel welcome and and that this is an important issue. So this our their visit to us was one of the first ones that they're doing but they're looking for letters of support from lots of different community boards, just a correction, they already have, I think, a letter of support from CB11. That's right. We were one of the first yet, but not the first okay, any questions on this. Okay, then we're going to move to our roll call vote. No, I see Brett has his hand up. Oh, I did not see that I'm sorry Brett go ahead. Yeah, I think yeah, no, just just with my background. I I'm a advocate for justice reform and it's just it's what I do for just this is my career and as a passion of mine, so that you know the plate of any individuals who do not have access to justice who face problems in the system. It's a very it's a very heart, rendering kind of situation for someone to be in. You know that said my concerns about just putting support it's a little bit unprecedented, that someone's got an exhibition and it's not in our district to be involved, and I'm also a little reluctant, very reluctant to sign on to supporting an exhibition that I have really no idea what it's going to look like, but it's what are going to be the contents. Is it you know? So it's it. You know it. It's base the idea of educating people on what could what could happen if we do not have a fair and just system is, I think, very well founded and in a in a great mission. I just it's. This, it's just the specifics of the idea of supporting another board's exhibition when we do not have any control over it, and I do not know what it is. It's just it's that's. Those are. Those are just my concerns about that. I do not know if that was a discussion and exec that those issues were raised, but that it would be a little I think, outside of our purview and what we would typically do. You know more important. A more appropriate way of supporting might be to actually write letters individually to their community board show up at their meetings when they have anything to do with the with the proposal. I think that's you know we can. We can show support as individuals, but I think it's for our district to represent it's just. Those are my concerns. I will, I will add something here. This was originally presented by CB10 at the monthly Borough board meeting and they asked all the chairs to sign on, and there was some not pushback from other boards, but there was a request from a lot more information before any of the other boards would sign on. So that's why Gail urged them to present to each of the various community boards. I know that does not really answer your question Brett, but I wanted to just make sure that information was out there. Dolores, I see your hand. There is precedent for at especially Burro board level, for this board having supported or been supportive of. Another community board's wish to continue with some action. So I think that if we are thinking of this more broadly that we're being supportive of one of our other community boards in pursuing, because let's make no mistake, this is a project they are hoping to have happen. They have not created any type of fundraising for this. It has not been actualized, there is no actual design. This is a concept, and so our support is for the concept and the support of that community board pursuing the concept. If at some point in time, they came back to us to opine on the design and how it would impact the flow of movement at that part of central park. That would be completely inappropriate for us to opine on, because it's not our district, but again there has been precedent, and I do not think that the issue here is saying that we are signing on to exactly what they're designing and exactly what they're doing, and it's the concept of saying we're supportive of another community board pursuing this idea of bringing about the potential of an exhibit marking these issues that all of us have concerns about. Thank you, dolores josephine. So for me this is really the concept, as dolores so well explained, is about this city's racial bias in the criminal justice system. Our community board has set up this task force specifically to deal with issues involved with social justice and racial justice in terms of the criminal justice system. So this is a perfect example of something that went horribly wrong to children who were aged 14 to 16 years old in central park, which is all of New York City's backyard, especially Manhattan and Community. Board 4 does represent one of the gateways to central park being on the southwest corner. So I think that this is a perfect time and an example to show our support, and I hope that this mural serves as a place of healing and education and just says something that you know we recognize what basically has happened. So no, we have not had access to what this is actually going to look like, but I think that supporting the concept that yes, this is this is true. This is a reality that black men are often targeted by the police due to racial discrimination and that's what this is about and that's what our task force is about, and so that's why I was very supportive of writing this letter and thank you very much to Dale for working on this anyone else, I'm not seeing any other hands. Okay, thank you. All we're going to move to a roll call vote. There are 17 items just to remind you. There are eight from BLP. There were no comments or discussions on any of them. There were the two letters from Clinton health kitchen land use about slaughterhouse. There are the four letters from transportation number 11 is about. Citibike number 13 is about the helicopter safety item. 15 is the letter about the 36Th street shelter from HHHS 16 is the budget requests and statement of district needs and 17 is the letter from the social and racial justice Task Force, Mike and Leslie? Are you ready to take over yep I'll, read the names Leslie notate we've got one member who's not identified he's on the phone, so I do not know who that is. Did you see that Pete Diaz is still only listed as mcb4 member that never changed his name? I'm going to say one other thing before we get to the roll call get your vote sheets in right after this meeting. I do not want to have to chase anyone again. I chased people last month. I do not want to chase anyone this month come on people. You can do this and those are some mean emails if you saw them okay, I can leslie just because I've put it in the chat multiple times tonight and I've emailed it to everybody tonight as well as I'll make sure everybody has the vote sheet, no excuses, all right, great okay, starting off with Sarah Appleton, yes, and all christine birthday, you're, muted, yes or no, okay, gwen Billig are you here tonight. I saw her yeah she's connected. It says connecting to audio give her a second okay move on to the next person. You can circle back to Gwen she's starting trunk looks like she's trying to connect Okay Leslie Bogosian Murphy, yes, tall Biryan, yes to all Jessica Chase, yes to all dale, yes to all my vote sheets in Judith, Day, Hill, yes to all marty dakar, yes to all my vote sheets in great Paul, devlin, yes to all Tina, I saw you earlier well, we'll have to come back to Tina as well: Pete Diaz, yes, Tool, Brett, Redferford you're on YouTube, I'm standing on 17, yes to the rest of abstaining, then next on Zoro, yes to all wendy gonzalez. Yes to all yes to walt Frank, yes to all Josephine, yes to all Kerry Keenan, yes, Tom blake, yes to all bird Christopher, yes to all Jeffrey, yes, Betty, yes to all, oh and for the last time, Morgan Mclean, yes to all very good Sarah mills, yes to all myself, Mike, noble, yes to all Jd Yesterall Maria, yes to all Alan Oster, yes, one through seventeen Brad Pasquerella Abstain on 13 and yes to the rest, is Rhonda patillo here tonight in advance: okay, joe yes, 12 except 14 president, not eligible yes to all the morris, yes to all Brian Sokow. Yesterday, David Solnick, yes to all katie stokes, yes to all get Tallerson, yes to all marty treat marty here, I think Marty's here tonight. Is he and I have not seen him. Okay, hector, vasquez, yes to all Rob Walker, yes to all James Wallace, get used to seeing President biden, yes to all Yay to all, and I sent him Leslie Williams, yes to all pound right. Yes, you are, and okay we're going back then to Gwen Billing. Are you back yet Gwen yeah? She does not seem to be able to connect, I'm not sure. What's going on, I asked if she could yeah. I asked her to post it in the chat and she has them. I asked her to post it in the chat, but she has not done that either. So all right and then you lowell you're the last well, you got to go back to Tina as well. Yeah Tina are you here with us she's here: you're, muted Tina. Yes, I see her. I see her yes and I am yes to all okay gwen we're going to give it another try. Now I think Gwen is going to be a no vote, not a not a, not a no vote, but a non- vote president, not voting yeah. Okay, get your vote sheets in monster, hey it's your office! That makes me do this! Jesse! Yes, jd! I want to say one thing about Morgan Mclean he's been a terrific member of this health's kitchen community and a wonderful member of the land Use committee morgan. You can park on my block anytime we're going to miss. You have been just a wonderful, valuable member for all these years. Thank you. Good luck! Good luck to your parents agreed I'm going to try to get back as soon as I can, but right now I'm going to take a little bit of a break. I can't go through my savings and I want to say I'll, miss you all, but I'll join you in the zoom meetings and if you any advice at opening that garden on 48th street and that opening that night come that garden Jd. Let me know I lived there on 48th street in 1980 before you moved up here. I know it's going to be an affordable housing site and we'll say we'll save an apartment for you, okay and at Nightclub on the first floor, great good to see you good night, everybody anything else, we're adjourned. Thank you. Everyone to everyone. Good night, everyone good night, everybody good night.",
            "summary": "We start our agenda tonight with a public hearing on the proposed statement of district needs and budget requests.\nYou want to address any issue any other than the statement of district needs in proposed budget.\nYou want to speak on the budget or just about 36th street generally at just about 36Th. That is a warning to anyone who has signed up to speak at the public session or to speak on the topic of the statement of district needs.\nJust wanted to comment on the letter about the temp homeless, shelters on West 36Th Street.\nIt's been over five months since DHS, and the city placed this disproportionate number of temp, homeless, shelters and hotels in a one block.\nBut what I know for sure is that placing three different shelters within one block has to be exponentially.\nI'm thankful for the vocal support of the of this group of CB4, The borough President Assemblyman Gottfried Senator Jackson, but it is beyond disheartening that our mayor, Corey, Johnson and Senator Hoyleman take no action or remain silent for fear of appearing politically incorrect or insensitive and prefer to continue experimenting with our safety.\nI'm, Brian, Weber resident of 36Th Street, and the co- chair of the 36Th Street Block Association, I'm here on behalf of the Block Association, to support housing, health and Human Services letter item number 15 regarding the temporary shelters on West 36Th Street.\nSpeaker, Johnson and Senator Hoyleman to support community board 4 Manhattan borough president Gail Brewer, Assemblyman, Godfrey and Senator Jackson's request to reduce the number of shelters and the number of shelter beds on West 36Th Street.\nLet me just first stay thanks to all of those that very moving set of testimonials that I heard just now and want you to know that as your state senator as a state, official, I have been working with my colleagues who obviously are at the city level and trying to rectify this untenable.\nMeans that we can override a governor's veto and have a greater hand in budgeting and hopefully addressing issues like the need to build additional supportive housing for our homeless population.\nIf we're going to get to 42, though we suffered some losses in the democratic Senate, we're going to still retain the majority, though, but I think everyone's you know, hearts are in their throats waiting to see what the results of the federal elections are for just wanted to share.\nThe board report about my personal experience around the issue of familial violence, which I think is pertinent to our times today on different levels, wanted to mention that my office is going to be partnering with Mount Sinai to host a free flu shot event coming.\nWell, there's now going to be a requirement that you have to buckle up in the back seat when you, when you're riding in a cab or an uber, and then I just want to finally mention that we have passed legislation that would amend the administrative code of the city of New York to require all new homeless shelters to conduct a public hearing in the community where the proposed shelter is to be located before it's cited.\nThat is important because, as we saw with West 36Th Street, the community board, the local elected officials and, most importantly, people who live on the block had no idea that the shelter was being located in this in this area.\nI, think I've counted, 21, different agencies, state and city that follow up, whether it's the MTA, the consumer, affairs, the health department, the buildings, department, the Department of homeless, services, etc.\nI'm going to ask you hang on one second dale I just wanted to let you know that we have actually gotten a fair number of complaints from Chelsea about the helicopter traffic We've identified a specific operator in Jersey, and one of the letters number 13 is specifically about that situation.\nAll these years and I'm happy and proud to have been re- elected for another term in the New York State Assembly, representing parts of Hell's kitchen and the upper West side, and there is plenty of work to do the election.\nI told you about the park to with Clinton park, getting it fixed, up, we're waiting on parks for that, and I think you have a longer a long calendar You need me and thanks for doing your job, does anyone have any questions for assembly member Rosenthal, Dale, no That was for the anti- car comment.\nThe office will be closed for veterans day Chelsea, sorry, Clinton, hell's, kitchen, land, use, Just, a friendly verging on non- friendly reminder that all board members need to fill out their virtual vote sheets by the end of the meeting or at the very end of the meeting and submit them.\nMy report is up next, as you've heard from the members of the Public West We continue to meet with DHS and the providers to try and improve that situation.\nFor once, the tow pound is moved and there will be a presentation at the Waterfront parks and Environment Committee next week to that effect, to follow up on where you will hear some of the results of what we talked about at that working group, meeting.\nThere are two letters about the slaughterhouse site, which is on 11Th avenue 39th to 40th street we've heard about this before give a shout out to Joe Rostuccia when he was a young man just getting off the boat from Newark, he saw that piece of land.\nWhen I read this and took a look at item 16 a which is the budget, I began to realize that our community board has a great deal of concern for homelessness, and yet we focus on housing that we say will exist at all levels.\nAnd I'm just throwing out as a comment I'll vote for this, but I think it's time to put the homeless issue together with our stance on what levels, income, bands of housing that we support- Joe for one- has been arguing that it needs to be diverse, but we have a contradiction between our concern for the homeless population in our district and not have it not supporting enough housing that will house that part of the population, the homeless population that does not need supportive housing or any of that.\nThe issue is that it was proposed to the board not quite clearly by the developer, that the possibility, the support of housing units might be segregated on different floors in the building.\nMy question is, though, I know you answered Betty's inquiry about the homeless population and the services, but as far as the affordable part, how affordable is it going to be low, income, meaning at what type of income are we talking about so hector?\nOne, good job, Joe keep going with it good job, Joe Restudya has those cow heads and we're hoping that they will be placed in that little park area that we want designed and Betty had a great suggestion, maybe some kind of historic plaque or explanation of what existed.\nIt does not solve the problems with bicycles that are delivering food, but CitiBike is a huge program and if there were large numbers like four digits, for example, I'm, just throwing it out there The first letter- If, that's this, I mean I recognize both your concerns, but the first letter is specifically addressing their expansion for three sites within the district.\nI'm aware that I mean, I think I think we could add something along those lines so that the within the education component that individual equipment is clearly identifiable in the case of any misuse, If I heard you right, given that sidewalk site is no longer in our district.\nWe are aware that there are sidewalk sites in other districts, and you know hope that as policy they will start not doing that.\nSomebody had mentioned that they do, but I do not think there's any real enforcement, because there are folks riding on sidewalks illicitly I mean sometimes they're, not working at all or basically.\nThat block is most of the week, so in the reassert insertion of a letter about no our policy of no sidewalk installations, I think you need to be more careful.\nThere is a letter on the 36Th Street, Shelter, Joe and or Maria.\nThis is our monthly 36th street letter It's basically a pretty much a repeat of our letter to DHS and the mayor's office and NYPD, and now this is directed instead toward the elected officials to meet with us to discuss this specifically come up with a plan to solve a problem.\nThat's a crazy thing and that's why we're asking All right, excellent letter, Joe. We, insist that Dick Godfrey Brad Holloman Corey Johnson Dale Brewer sit down with the board as soon as possible, or something like that, just to make it specific and more well.\nThe testimony tonight was very poignant, and I wonder if I mean at a minimum, we should be clearly there are some individuals which are more dangerous than others, right, and I think we need our elected and the NYPD to address that the people which are really dangerous should be removed.\nYou know it's one thing to put homeless people in one place: I do not want to say we have a gang, but it looks like we have a gang.\nWe had similar language than the prior letter that I took out, so we can put it back in We, got a lot of clarifications from folks on 36th street things that were not quite right, so we're fixing that also lol.\nYou know the ask about de, densifying, and I think that there was a point that we made in the last letter.\nAnd I think you need to put the community board vote information somewhere up there up front.\nI have heard I've heard I have heard going to every housing meeting Maybe it's not the official community Board, but some kind of either protest.\nThe health Kitchen Neighbor coalition, which is made up of the block associations, different not, for, profit organizations, the garment center alliance, Manhattan Plaza, tenant association, Hudson yards a whole group of people together to basically bring publicity to this, because we really believe that it's not understood that we're, not the folks on the upper West, side.\nThe tone of this letter, which is one of these hotels, must be moved and that you know we are asking you to help us get DHS to move.\nI think we need to be addressing to Cuomo's Covid-19 task force, or whoever is ahead of that area, to highlight that this is also a health issue for everyone, involved, the residents in the shelters and the residents on the street, and they that may give us another angle for a little bit of firepower for the governor to take notice of something that will be pushing against the great progress that he has made in stemming the tide of the virus.\nSo dolores I'm, going to suggest that we do that at our next housing community meeting And you're going to do the research to find out who we write, to, because I think it's important that we keep this letter focused and get the next issue, because basically we have to keep this on.\nThink we know where this letter is going, That's for housing, health and human services.\nThe budget task force worked with all of the chairs of and all of the committees to come up with a plan for how to think about the priorities recognizing that we have long- So I really want to give a lot of credit to all of the committees who dug in and did the hard work of saying, Term needs, but things that we're seeing that we had not seen before and so really impressed at how quickly people have moved to understand the needs of the community and what they're, seeing to help aid.\nAnd and they've also heard from Gail Brewer's office that it would be really useful to try and get support from lots of community boards, because central park is a place that everybody should feel welcome and and that this is an important issue.\nLooking for letters of support from lots of different community boards, just a correction, they already have, I think.\nAnd, that's what our task force is about, and That's why I was very supportive of writing this letter and thank you very much to Dale for working on this.\n15 is the letter about the 36Th street shelter from HHHS 16 is the budget requests and statement of district needs and 17 is the letter from the social and racial justice Task Force, Mike and Leslie?\nI know it's going to be an affordable housing site, And, we'll say: we'll save an apartment for you, Okay and at Nightclub on the first floor, great good, to see you good night, everybody anything else, we're adjourned."
        }
    }
}